{"title":"10 Dinge, von denen Sie nicht wussten, dass Google Docs tun kann","content":"<p> Google Doc mag auf den ersten Blick einfach erscheinen, aber das Cloud-Produktivitätstool hat viele übersehene Funktionen, die Ihnen helfen können, bei der Arbeit mehr zu tun. </p> <p> In diesem Artikel sehen wir uns verschiedene Google Doc-Funktionen an, von denen Sie wahrscheinlich noch nichts wussten, und wie Sie sie verwenden können, um beim Erstellen von Inhalten Zeit zu sparen. </p> <p> Bitte beachten Sie, dass diese Funktionen hauptsächlich in der Desktop-Version des Google Docs-Tools verfügbar sind. Diejenigen, die auch auf der mobilen Version verwendet werden können, werden angezeigt. </p> <h2 id=\"voice-typing\"> 1. Spracheingabe </h2> <p> Um die Spracheingabefunktion zu verwenden, öffnen Sie ein Dokument und klicken Sie auf <strong> Werkzeuge </strong> aus der Menüleiste oben auf der Seite. Wählen <strong> Spracheingabe </strong> aus der Dropdown-Liste. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> Auf Ihrem Bildschirm erscheint ein Mikrofon mit einem Sprachmenü, in dem Sie Ihre bevorzugte Sprache auswählen können. Wenn Sie Ihren Text sprechen möchten, klicken Sie auf das Mikrofon oder drücken Sie <strong> Befehlstaste + Umschalttaste + S </strong> (wenn Sie einen Mac verwenden) oder <strong> Strg + Umschalt + S </strong> (wenn Sie einen Windows-PC verwenden), um die Aufnahme zu starten. </p> <p> Um Satzzeichen zwischen Text hinzuzufügen, sagen Sie den Namen des Satzzeichens, das Sie hinzufügen möchten, z. Sie können Formatierungsanweisungen wie &quot;Neue Zeile&quot; oder &quot;Neuer Absatz&quot; oder &quot;Aufhören&quot; geben, wenn Sie eine Pause vom Sprachtippen einlegen möchten, und &quot;Fortsetzen&quot;, wenn Sie bereit sind, fortzufahren. </p> <p> Sehen Sie sich die erweiterten Bearbeitungsbefehle hier an <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Liste der Befehle </a> auf der Support-Seite von Google. </p> <p> Sie können diese Funktion auch zum Transkribieren von Audio verwenden. Spielen Sie einfach das Audio (von Ihrem Telefon oder einem anderen Gerät) zur Voice-to-Text ab, und es sollte es für Sie eingeben. Möglicherweise müssen Sie ein paar Änderungen vornehmen, aber Sie hätten viel Zeit gespart. </p> <p> </p> <p> Die Spracheingabefunktion ist nur auf dem Desktop verfügbar, funktioniert jedoch nur im Chrome-Browser. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Offline-Bearbeitung </h2> <p> Viele Leute lieben Google Docs wegen seiner Funktion zum sofortigen Speichern in der Cloud, aber es kann unpraktisch sein, wenn Sie eine Weile keinen Zugang zum Internet haben. Die gute Nachricht ist, dass Sie weiterhin offline auf Ihre Dateien zugreifen und diese bearbeiten können. </p> <p> Diese Funktion ist nur in Google Chrome verfügbar und Sie müssen die . installieren und aktivieren <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Google Docs Offline Chrome-Erweiterung </a> . Stellen Sie außerdem sicher, dass Sie nicht im privaten Modus surfen. </p> <p> Diese Funktion muss eingerichtet werden, wenn Sie online sind. Sobald dies jedoch erledigt ist, können Sie Text offline schreiben und bearbeiten. Anschließend werden sie in der Cloud gespeichert, wenn Sie auf das Internet zugreifen. Hier ist wie. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> Um es möglich zu machen <strong> Öffnen und Speichern von Google Docs-Dateien offline </strong> , Folgen <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> diese Anleitung </a> . Diese Funktion ist auf PCs, iOS und Android verfügbar. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Dokumentversionsverlauf verfolgen/wiederherstellen </h2> <p> Wenn Sie alleine oder mit anderen an einem Dokument arbeiten, können Sie Änderungen am Dokument mithilfe der Versionsverlaufsfunktion verfolgen. </p> <p> Sie können das Dokument auch vorübergehend oder dauerhaft in einer früheren Version wiederherstellen; eine Funktion, die lebensrettend sein kann, wenn Sie versehentlich Teile Ihres Dokuments löschen und die Funktion nicht verwenden können <strong> Rückgängig machen </strong> Schaltfläche, um sie wiederherzustellen. </p> <p> Um die Versionsverlaufsfunktion zu verwenden, klicken Sie auf <strong> Datei </strong> aus der Menüleiste und wählen Sie <strong> Versionsgeschichte </strong> aus der Dropdown-Liste. Sie werden sehen, dass Sie auch eine Version benennen können, damit Sie fortlaufende Änderungen im Dokument verfolgen können, insbesondere wenn andere Benutzer dasselbe Dokument bearbeiten. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Diese Funktion ist nur auf dem Desktop verfügbar. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Vorschlags- und Überprüfungsmodus </h2> <p> Obwohl es großartig ist, mit anderen zusammenzuarbeiten und ein Dokument gemeinsam zu bearbeiten, kann es schwierig (und chaotisch) sein, den Überblick über die Änderungen jeder Person zu behalten. </p> <p> Mit der Vorschlagsfunktion können Sie einfach Änderungen vorschlagen, wenn Sie das Dokument nicht vollständig ändern möchten. Ihre Vorschläge werden dem Editor als Kommentare in der Seitenleiste angezeigt, und der Editor kann sofort Änderungen vornehmen, indem er den Vorschlag akzeptiert. Sie können auch Konversationsthreads mit weiterführen <strong> Antworten </strong> , sodass Sie direkt auf der Dokumentseite Feedback geben und empfangen können, ohne E-Mails hin und her senden zu müssen. </p> <p> Um Änderungen vorzuschlagen, klicken Sie oben rechts im geöffneten Dokument auf das Stiftsymbol für den Bearbeitungsmodus und wählen Sie dann aus <strong> Vorschlagen </strong> . </p> <p> Um das Dokument ohne die Vorschläge anzuzeigen, klicken Sie auf <strong> Ansehen </strong> . Sie können ohne Durchstreichungen und Kommentar-Popups lesen. </p> <p> Um Zeit zu sparen, können Sie alle Vorschläge auf einmal annehmen oder ablehnen. Klicken <strong> Werkzeuge </strong> , dann wähle <strong> Überprüfen Sie die vorgeschlagenen Änderungen </strong> . Klicken <strong> Akzeptiere alle </strong> oder <strong> Alles ablehnen </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Diese Funktion ist nur auf dem Desktop verfügbar. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Schriftarten hinzufügen </h2> <p> Wenn du jemals willst <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> stilisieren Sie Ihren Text </a> passend zu Ihrer Nachricht können Sie dies auch mit Google Docs tun. Abgesehen von den 24 Standardschriftarten, die bereits im Google Docs-Tool programmiert sind, können Sie mehrere coole Schriftarten Ihrer Wahl hinzufügen, um Ihren Text optisch aufzuwerten. </p> <p> Um Schriftarten hinzuzufügen, klicken Sie einfach auf <strong> Schriftarten </strong> in der Menüleiste und wählen Sie <strong> Mehr Schriftarten </strong> . Wählen Sie aus der bereitgestellten Sammlung beliebig viele Schriftarten aus. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Diese Funktion ist nur auf dem Desktop verfügbar. </p> <p> </p> <h2 id=\"compare-documents\"> 6. Dokumente vergleichen </h2> <p> Dies ist eine weitere Funktion, die Sie verwenden können, um Änderungen zu verfolgen, die Sie selbst oder ein Mitarbeiter an einem Dokument vorgenommen haben. Es ist besonders nützlich für große Dokumente, und wie der Name schon sagt, können Sie zwei Dokumente vergleichen, um Unterschiede zwischen ihnen anzuzeigen. </p> <p> Um diese Funktion zu verwenden, öffnen Sie das Basisdokument, für das Sie einen Vergleich durchführen möchten, und klicken Sie dann auf das <strong> Werkzeuge </strong> und wählen Sie <strong> Dokumente vergleichen </strong> . </p> <p> Wählen Sie im angezeigten Dialogfeld das Dokument aus, mit dem Sie es vergleichen möchten, und klicken Sie auf <strong> Vergleichen Sie </strong> . In dem <strong> Attributunterschiede zu </strong> geben Sie den Namen des Mitarbeiters ein, der der Autor der vorgeschlagenen Änderungen im endgültigen Dokument sein wird. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> Die Unterschiede zeigen sich auf die gleiche Weise wie im <strong> Vorschlagen </strong> Modus, den wir oben besprochen haben, und Sie können auch Änderungen annehmen oder ablehnen. </p> <p> Diese Funktion ist nur auf dem Desktop verfügbar. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Suchen und ersetzen </h2> <p> Wenn Sie jemals mehrere Instanzen eines Fehlers in Ihrem Text ersetzen müssen, macht es Google Docs mit der Funktion Suchen und Ersetzen ganz einfach. </p> <p> Für Benutzer, die mit der Funktion Suchen und Ersetzen in Microsoft Word vertraut sind, funktioniert dies genauso. </p> <p> Verwenden Sie die Verknüpfung, um ein bestimmtes Wort oder einen bestimmten Satz in Ihrem Dokument zu finden <strong> Strg + F </strong> auf einem Windows-PC oder <strong> Befehl + F </strong> auf einem Mac. Geben Sie das Wort in das Feld &quot;In Dokument suchen&quot; ein. </p> <p> Um den gefundenen Text zu ersetzen, klicken Sie auf die drei Punkte auf der rechten Seite und wählen Sie <strong> Suchen und Ersetzen </strong> . </p> <p> Geben Sie dann den Text in das ein <strong> Finden </strong> Feld und der Ersetzungstext im <strong> Ersetzen mit </strong> Feld. Scrollen Sie mit dem Auf- und Ab-Cursor durch die Textinstanzen und klicken Sie auf <strong> Ersetzen </strong> einzeln auszutauschen. Oder klicken Sie auf <strong> Alles ersetzen </strong> um den gesamten ausgewählten Text auf einmal zu ersetzen. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Verwenden Sie ein Wörterbuch </h2> <p> Damit Sie sich besser konzentrieren und nicht zwischen Tabs wechseln müssen, wenn Sie nach der Bedeutung eines Wortes suchen, verfügt Google Docs über ein In-App-Wörterbuch. </p> <p> Wenn Sie tippen und ein Wort nachschlagen müssen, markieren Sie das Wort, klicken Sie dann mit der rechten Maustaste und wählen Sie aus <strong> Definieren </strong> aus dem Menü. Das Wörterbuch-Tool sucht im Internet nach der Definition des Wortes und wird auf der rechten Seite Ihres Bildschirms angezeigt. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Sprachakzente hinzufügen </h2> <p> Verabschieden Sie sich vom Auswendiglernen von Tastenkombinationen mit Akzent oder dem Kopieren/Einfügen von Buchstaben mit Akzent aus anderen Dokumenten. </p> <p> Um Buchstaben mit Akzent zu verwenden, müssten Sie herunterladen <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> das Add-on „Einfache Akzente“ </a> . Sie können Akzente für 20 verschiedene Sprachen direkt aus einer Seitenleiste in Ihr Dokument einfügen. </p> <p> Laden Sie das Google Doc-Add-on herunter, indem Sie das . öffnen <strong> Werkzeuge </strong> Menü, dann klicke auf <strong> Add-Ons </strong> und <strong> Holen Sie sich Add-ons </strong> . Suchen Sie im angezeigten Google Marketplace-Feld nach <strong> Einfache Akzente </strong> und klicken Sie auf die blaue Installationsschaltfläche, um es zu Ihrer Google Docs-Add-On-Sammlung hinzuzufügen. </p> <p> Klicken Sie nach der Installation auf das <strong> Add-Ons </strong> Menü, um das Add-on Easy Accents auszuwählen und alle Ihre Fremdwörter mit den richtigen Akzenten zu versehen. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Dieses Add-On ist nur auf dem Desktop verfügbar, aber mobile Tastaturen unterstützen normalerweise Sprachakzente, sodass Sie ohne das Add-On Text mit Akzentzeichen auf Ihrem Telefon schreiben können. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Erstellen Sie benutzerdefinierte Verknüpfungen </h2> <p> Die meisten Leute kennen sich mit <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Word-Verknüpfungen </a> , aber Sie können auch Ihre eigenen Verknüpfungen in Google Docs erstellen. Um benutzerdefinierte Verknüpfungen zu erstellen, klicken Sie auf <strong> Extras &gt; Einstellungen &gt; Ersetzung. </strong> Sie werden feststellen, dass es bereits einige Abkürzungen für Brüche und Symbole gibt (wie das Ändern von 3/4 in ¾), aber Sie können gerne einige Ihrer eigenen hinzufügen. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Diese Funktion ist nur auf dem Desktop verfügbar. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Machen Sie mehr mit Google Docs </h2> <p> Nachdem Sie diese Google Docs-Tools kennengelernt haben, können Sie sie beim Erstellen Ihres nächsten Dokuments verwenden. Hoffentlich erleichtern sie dir die Sache! </p>"}