{"title":"5 Dinge, die Sie dauerhaft von Facebook sperren können","content":"<p> Facebook ist nicht so bekannt wie Twitter für das Entfernen von Konten. Es gibt jedoch einige verbotene Delikte, auf die Facebook mit mehr als nur einem Warnhinweis reagiert. </p> <p> Hier untersuchen wir die Geschäftsbedingungen von Facebook und wo das Unternehmen die Grenze zieht, indem wir historische Beispiele von Nutzern betrachten, die Facebook aufgrund ihres Verhaltens „de-platformed“ hat. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> Facebooks Haltung zu dauerhaften Sperren </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> Im Gegensatz zu anderen Social-Media-Websites listet Facebook nicht viele Verstöße auf, die zu einem dauerhaften Verbot führen. Stattdessen werden wiederholte Straftaten und nicht die Schwere der Straftaten als primärer Faktor genannt. Daher kann theoretisch jeder Facebook-Verstoß, der oft genug wiederholt wird, zu einer Profilsperre führen. </p> <p> Allerdings führen nur wenige Aktivitäten zu einem vollständigen Verbot und Facebook ist mit einigen anerkannten illegalen Aktivitäten überraschend lasch. Zum Beispiel ist der Verkauf von „regulierten Gütern“ wie Waffen und Marihuana auf dem Facebook-Marktplatz nicht erlaubt, aber Facebook listet dies nicht als verbotene Straftat auf. </p> <p> Facebook zieht es vor, Inhalte Post für Post zu markieren oder zu entfernen, anstatt Profile zu löschen. Es gibt jedoch Ausnahmen. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Missbrauch von Tools und Daten </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> In den Nutzungsbedingungen von Facebook sind drei verbotene Straftaten aufgeführt. Die erste ist eine Sammlung von Aktionen, die im Rest dieses Artikels genauer betrachtet werden. Die zweite und dritte sind spezifischer und haben mit dem Missbrauch der Tools und Daten von Facebook zu tun. </p> <p> Diese allgemeine Nutzungsbedingungen verbietet den Zugriff und die Nutzung von Teilen der Website, die Entwicklern vorbehalten sein sollen. Es verbietet auch die absichtlich böswillige Verwendung von Tools für öffentliche Websites, z. B. die Verwendung von Facebook zur Verbreitung von Viren und Malware. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Bedrohungen der öffentlichen Sicherheit </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Einer der wenigen Fälle, in denen Facebook angibt, dass es Konten deaktiviert, ist der &quot;echte Gefahr von körperlichen Schäden oder direkten Bedrohungen der öffentlichen Sicherheit&quot;. Facebook entfernt auch Profile, die &quot;eine gewalttätige Mission verkünden oder sich an Gewalt beteiligen&quot;. </p> <p> Dies war der Grund für das unbefristete Verbot des damaligen Präsidenten Donald Trump nach einem Aufstand im US-Kapitol im Januar 2021. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Assoziation mit gewalttätigen Gruppen </h2> <p> Facebook nahm im Oktober 2020 seine Haltung zu schädlichen und bedrohlichen Inhalten auf die assoziative Ebene, als es Profile im Zusammenhang mit der QAnon-Verschwörung entfernte, selbst wenn die einzelnen Profile keine gewalttätigen Inhalte enthielten. Die Verschwörungsgruppe hat seit 2016 zu gewalttätigen Episoden geführt. </p> <p> </p> <p> Facebook verbot auch die Musikgruppe Trapt für Beiträge, die sich auf die Hassgruppe The Proud Boys beziehen. Die extremistische politische Organisation ist seit 2016 an Straßengewalt in den USA und Kanada beteiligt. </p> <p> Das Unternehmen behält sich außerdem das Recht vor, Konten zu deaktivieren, wenn diese Konten ein rechtliches Risiko für Facebook darstellen. Darüber hinaus ist Facebook unnachgiebiger als andere Social-Media-Plattformen bei der Zusammenarbeit mit Strafverfolgungs- und Öffentlichkeitsorganisationen, wenn diese Art von Inhalten angetroffen wird. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Gefährdung der Sicherheit anderer Konten </h2> <p> Eine weitere der seltenen verbotenen Straftaten, die Facebook auflistet, ist die &quot;Kompromittierung der Sicherheit anderer Konten und unserer Dienste&quot;. Eine Gefährdung der Sicherheit der Facebook-Dienste hört sich stark nach Malware und Missbrauch an, die in den Nutzungsbedingungen erwähnt werden. Die Idee, die Sicherheit anderer Konten zu gefährden, deutet jedoch auf Doxxing hin. </p> <p> </p> <p> Doxxing ist die Veröffentlichung sensibler realer Informationen eines Social-Media-Benutzers, möglicherweise einschließlich seiner Privat- oder Arbeitsadresse, seiner privaten Telefonnummer oder seines physischen Standorts in Echtzeit. Diese Praxis wird oft mit der Absicht durchgeführt, dieser Person Schaden zuzufügen. </p> <p> </p> <h2 id=\"misinformation\"> 5. Fehlinformationen </h2> <p> </p> <p> Die offiziellen Richtlinien von Facebook besagen, dass Facebook Fehlinformationen nicht entfernt, sondern sie stattdessen so kennzeichnet, dass sie zu Dialogen beitragen können, ohne andere in die Irre zu führen. Eine Reihe von gesperrten Kontoinhabern gibt jedoch an, dass ihre Entfernung auf das zurückzuführen ist, was Facebook als &quot;Falsche Nachrichten&quot; bezeichnet. </p> <p> Dafür gibt es eine Reihe von Gründen. In einigen Fällen stellt Facebook fest, dass die falschen Nachrichten auch der persönlichen oder öffentlichen Gesundheit schaden. </p> <p> Das war <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> Facebooks Erklärung für die Entfernung des Verschwörungstheoretikers David Icke </a> für die Behauptung unter anderem, dass 5G-Internet Covid-19 verursacht. Facebook sagte auch, Icke habe &quot;wiederholt gegen&quot; Richtlinien verstoßen. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Facebook-Richtlinien und Ihr Konto </h2> <p> In den meisten Fällen nimmt Facebook keine Probleme mit Ihnen, solange Sie die Plattform nicht missbrauchen, um anderen Schaden zuzufügen. Es gibt jedoch bestimmte Probleme, bei denen das Unternehmen eine Grenze in den Sand zieht. </p> <p> Wenn Sie nicht gegen diese Nutzungsbedingungen verstoßen, sollten Sie sich vor einer dauerhaften Facebook-Sperre schützen. </p>"}