{"title":"8 Möglichkeiten, wie Social Media Ihnen beim Erlernen einer neuen Sprache helfen kann","content":"<p> Haben Sie immer noch Albträume von den spanischen Lehrbüchern und dem schlecht unterrichteten Französischunterricht, den Sie in der Schule erhalten haben? Keine Angst. Dank des Internets kann das Erlernen einer neuen Sprache heutzutage sowohl Spaß machen als auch zugänglich sein. </p> <p> Insbesondere soziale Medien haben dazu beigetragen, Millionen von Sprachlernern auf der ganzen Welt zu verbinden. Egal, ob Sie etwas Beliebtes wie Deutsch oder etwas Unbekannteres wie Färöisch lernen, Sie werden eine breite Palette von Ressourcen finden, die Ihnen auf Ihrer Reise helfen. </p> <p> Hier sind einige Möglichkeiten, wie Sie Social Media nutzen können, um Ihre nächste Fremdsprache zu erlernen. </p> <h2 id=\"join-facebook-groups\"> 1. Tritt Facebook-Gruppen bei </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> Auf Facebook finden Sie Gruppen für fast jede erdenkliche Sprache. Sie finden Gemeinschaften von neu umgezogenen Expats, die ihre Fähigkeiten verbessern möchten, sowie Gruppen für Lernende aus aller Welt. Um das Beste aus Ihrer Erfahrung herauszuholen, sollten Sie sich beiden anschließen. </p> <p> Um die richtigen Facebook-Gruppen zu finden, können Sie eine einfache Online-Suche durchführen. Alternativ können Sie auch in Facebook finden, wonach Sie suchen. Gehen Sie dazu zu Gruppen und suchen Sie nach Ihrer Sprache. Sie erhalten dann eine Liste der Communities, die diesen Anforderungen entsprechen. </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> Wenn du an einer lokalen Sprachschule lernst, kannst du auch deine eigene Gruppe gründen, um dich mit deinen Mitschülern zu verbinden. Um dies zu tun, <strong> Gehe zu Gruppen &gt; Neue Gruppe erstellen </strong> . Anschließend können Sie die Einstellungen bearbeiten und Mitglieder einladen. </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2. Nutzen Sie Reddit </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit ist ein beliebtes Online-Forum, das für Sprachlerner eine Goldgrube ist. Sie finden Subreddits sowohl für spezifische Sprachen als auch für allgemeines Sprachenlernen. </p> <p> Wenn Sie einem Subreddit beitreten, werden Sie viele nützliche Tipps und Hinweise von anderen Lernenden entdecken, die Ihren Weg gegangen sind. Sie werden auch viele Meme finden, auf die Sie sich zweifellos beziehen werden. </p> <p> Um einen Subreddit zu finden, gehen Sie oben in die Suchleiste und geben Sie Ihre Sprache ein. Nachdem die Ergebnisse geladen sind, lohnt es sich, sich sowohl lernspezifischen als auch kulturellen Gruppen anzuschließen, um mehr über die lokalen Gepflogenheiten zu erfahren. </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. Verbinden Sie sich mit Muttersprachlern </h2> <p> Der beste Weg, eine Sprache schnell zu lernen, besteht darin, mit Leuten zu sprechen, die sie bereits sprechen. Und soziale Medien können ein großartiger Ort sein, um diese Lautsprecher zu finden. Möglicherweise musst du dich an ein paar Leute wenden, aber irgendwann wirst du jemanden finden, der bereit ist, dir etwas Zeit zu nehmen, um dir zu helfen. </p> <p> Wenn Sie sich in sozialen Medien mit Muttersprachlern verbinden, konzentrieren Sie sich zuerst darauf, eine Freundschaft aufzubauen. Wenn Sie sich in derselben Stadt wie sie befinden, bieten Sie an, sie zu treffen und einen Kaffee zu bezahlen. Bieten Sie anderen an, eine der Sprachen zu lernen, die Sie bereits sprechen. </p> <p> Die Schritte dafür sind auf jeder Social-Media-Plattform ähnlich. Folgen Sie ihnen auf Instagram oder Twitter und senden Sie eine Nachricht (sofern ihre Datenschutzeinstellungen dies zulassen). Sie können auf Facebook einen ähnlichen Ansatz verfolgen, obwohl einige Leute möglicherweise weniger bereit sind, Freundschaftsanfragen von Unbekannten anzunehmen. </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. Erstellen Sie Ihre eigenen Social-Media-Inhalte </h2> <p> Sie müssen nicht nur soziale Medien konsumieren, um sich selbst beim Erlernen einer Sprache zu helfen. Versuchen Sie auch, Ihre eigenen Beiträge zu erstellen. Dies wird Ihnen nicht nur helfen, Ihr Sprechen und Schreiben zu üben; Vielleicht entdecken Sie auch neue Benutzer, mit denen Sie üben können. </p> <p> Sie haben viele Möglichkeiten, Inhalte zu erstellen. Auf Twitter können Sie an Gesprächen teilnehmen oder einige Ihrer Tweets in Ihrer Zielsprache schreiben. Mit Instagram können Sie Bildunterschriften schreiben, Grafiken erstellen und sich selbst beim Sprechen aufnehmen. </p> <p> Wenn Sie Ihre eigenen Social-Media-Inhalte erstellen, erhalten Sie auch Feedback von Muttersprachlern. Außerdem können Sie Ihr Portfolio erweitern und ein paar nützliche neue Fähigkeiten erlernen. </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. Stellen Sie Ihre Apps auf die Sprache ein, die Sie lernen </h2> <p> Das Ändern Ihrer Telefoneinstellungen ist eine einfache Möglichkeit, in Ihrer Zielsprache zu denken und sie bequem zu lesen. Sie werden auch Dutzende neuer Wörter zu Ihrem Wortschatz hinzufügen. </p> <p> </p> <p> Alle großen Social-Media-Netzwerke verfügen über In-App-Einstellungen, mit denen Sie Ihre Sprache ändern können. Gehe zum Beispiel auf Instagram zu <strong> Konto &gt; Sprache </strong> . Sie sehen dann eine Dropdown-Liste mit allen Sprachen, die Sie verwenden können. </p> <p> <strong class=\"gallery__section-title\"> Bildergalerie (2 Bilder) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> Erweitern <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <p> Sie können auch alle Sprachen Ihrer Apps gleichzeitig über Ihre Telefoneinstellungen ändern. Gehe zu <strong> die Einstellungen </strong> &gt; <strong> Allgemein &gt; Sprache und Region </strong> . Von dort aus sehen Sie eine Liste aller verfügbaren Sprachen. Beachten Sie, dass Sie Ihr Konto für kleinere Sprachen möglicherweise nicht optimieren können. </p> <p> <strong class=\"gallery__section-title\"> Bildergalerie (2 Bilder) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> Erweitern <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. Machen Sie das Beste aus Hashtags </h2> <p> Die Verwendung und Suche mit Hashtags ist eine leistungsstarke Methode, um mehr Benutzer in der Sprache zu finden, die Sie lernen. Durch die Verwendung einer Vielzahl können Sie sich mit den Inhalten von Muttersprachlern und anderen Lernenden verbinden und diese konsumieren. </p> <p> Um die Art von Inhalten zu finden, nach denen Sie suchen, überlegen Sie, was andere Lernende verwenden werden. Sie können auch Inhalte von Muttersprachlern finden, indem Sie nach bestehenden Themen in einem bestimmten Land suchen. Diese finden Sie oft in angesagten Posts und Artikeln. </p> <p> Um nach Hashtags zu suchen, verwenden Sie die Suchfunktion der jeweiligen Social-Media-App, die Sie verwenden. Sie können auch auf Beiträge klicken, die diese verwenden, und die Ergebnisse alle angezeigt werden. </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. Folgen Sie Konten in Ihrer Zielsprache </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> Jeder interessante Account, dem Sie auf Englisch folgen, hat wahrscheinlich auch ein Äquivalent in Ihrer Zielsprache. Dies können umfangreiche Veröffentlichungen sein, oder sie könnten alltägliche Sprecher sein, die sich wohler fühlen, Arbeiten in ihrer Heimatsprache zu erstellen. </p> <p> </p> <p> Sie sollten auch sehen, ob Ihre Lieblingsmagazine, Sportmannschaften und Musikkünstler Konten in Ihrer Zielsprache haben. Viele der größten Sportvereine der Welt haben beispielsweise Konten auf Englisch, Spanisch und mehr. </p> <p> Wenn Sie Accounts in der Sprache folgen, die Sie lernen möchten, ist es eine gute Faustregel, diesen nur zu folgen, wenn Sie ihre englischsprachigen Inhalte genauso interessant finden. Andernfalls werden Sie sie ignorieren und später wieder entfolgen. </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. Folgen Sie Sprachlern-Apps auf Social Media </h2> <p> <strong class=\"gallery__section-title\"> Bildergalerie (2 Bilder) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> Erweitern <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <p> Auch Sprachlern-Apps haben oft aktive Social-Media-Profile. Diese eignen sich hervorragend, um allgemeine Tipps zu erhalten und sich auf allgemeine Probleme zu beziehen, mit denen jeder konfrontiert ist – egal ob er Norwegisch oder Japanisch lernt. </p> <p> Einige Konten, die es wert sind, verfolgt zu werden, sind Babbel, Busuu und Duolingo. </p> <p> Sie müssen diese Apps jedoch nicht nur zum Konsumieren verwenden. Fühlen Sie sich frei, Ihre Gedanken in die Kommentare zu schreiben. Sie können sogar neue Freunde finden, auch wenn sie eine völlig andere Sprache lernen als Sie. </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> Mit Social Media macht das Sprachenlernen Spaß Fun </h2> <p> Da hast du es also. Jetzt haben Sie eine bessere Vorstellung davon, wie Sie soziale Medien nutzen können, um Ihre Sprachreise zum Vergnügen zu machen. Obwohl Lehrbucharbeit immer noch wichtig ist, sollte es nicht Ihre einzige Option sein. </p> <p> Auch wenn Sie die App nicht auf Ihre Zielsprache optimieren können, finden Sie immer noch viele Muttersprachler und Mitlerner, mit denen Sie in Kontakt treten können. </p> <p> Der Schlüssel zum Erlernen einer Sprache mit sozialen Medien liegt darin, sich sowohl zu engagieren als auch zu konsumieren. Wenn Sie dies tun, werden Sie Ihre Erfahrung erfüllender finden und Wörter aufgreifen, die Ihnen die Lehrbücher nie beigebracht haben. </p>"}