{"title":"Apple behebt einen Fehler im macOS Big Sur Installer, der zu Datenverlust führen kann","content":"<p> Apple hat einen kritischen Fehler im macOS Big Sur-Installationsprogramm behoben, der beim Versuch, einen Mac ohne den erforderlichen verfügbaren Speicherplatz zu aktualisieren, eine Fehlermeldung ausgab. </p> <p> Ein überarbeitetes Update für macOS Big Sur 11.2.1, jetzt verfügbar im <a href=\"https://apps.apple.com/app/macos-big-sur/id1526878132?mt=12\" target=\"_blank\" rel=\"nofollow noopener\"> Mac App Store </a> , prüft vor Beginn der Installation ordnungsgemäß, ob genügend freier Speicherplatz vorhanden ist, sagte Mr. Macintosh am <a href=\"https://twitter.com/ClassicII_MrMac/status/1361428354306633728\" target=\"_blank\" rel=\"nofollow noopener\"> Twitter </a> . </p> <p> macOS Big Sur benötigt 35 Gigabyte freien Speicherplatz auf dem Startvolume deines Computers, mit Ausnahme des 13-Gigabyte-Installationsprogramms selbst. </p> <p> Dies hätte nicht früher kommen können, da eine der Folgen des fehlerhaften Installationsprogramms ein potenzieller Datenverlust ist. Für Menschen, die sich nicht regelmäßig angewöhnt haben <a href=\"https://www.makeuseof.com/how-to-back-up-mac/\" target=\"_blank\" rel=\"nofollow noopener\"> ihren Mac mit Time Machine sichern </a> , könnte dieser ziemlich grundlegende Fehler möglicherweise schreckliche Folgen haben. </p> <h2 id=\"how-to-install-the-new-update\"> So installieren Sie das neue Update </h2> <p> Das neue Update ist erhältlich über <strong> Systemeinstellungen &gt; Software-Update </strong> auf Ihrem Mac. Wenn Updates verfügbar sind, werden sie durch Klicken auf die Schaltfläche &quot;Jetzt aktualisieren&quot; installiert. Möglicherweise werden Sie aufgefordert, Ihr Administratorkennwort einzugeben. </p> <p> Das Update wird nicht angezeigt, wenn die überarbeitete Version von macOS Big Sur 11.2.1 bereits auf Ihrem Computer installiert ist. Das überarbeitete Installationsprogramm trägt die Build-Nummer &quot;20D75&quot;. Um die Build-Nummer der macOS Big Sur-Software anzuzeigen, die auf Ihrem Mac installiert ist, klicken Sie auf das Apple-Menü und wählen Sie die Option &quot;Über diesen Mac&quot;. </p> <p> </p> <p> Klicken Sie im geöffneten Fenster &quot;Über diesen Mac&quot; auf die Registerkarte &quot;Übersicht&quot;. Sie sehen den Namen der macOS-Betriebssystemsoftware auf Ihrem Computer, gefolgt von ihrer Versionsnummer. Um auch die Build-Nummer anzuzeigen, klicken Sie einfach auf die Versionsnummer. </p> <p> Welche macOS-Version aktuell ist, erfahren Sie in einem Support-Dokument auf <a href=\"https://support.apple.com/HT201260\" target=\"_blank\" rel=\"nofollow noopener\"> Apples Website </a> . </p> <p> </p> <h2 id=\"big-sur-s-broken-free-space-check\"> Big Surs gebrochener Freiraumcheck </h2> <p> Das Problem ist kürzlich dank Herrn Macintosh ans Licht gekommen, der das Problem ursprünglich gemeldet hat. In der Veröffentlichung wurde festgestellt, dass das Big Sur-Update ohne Probleme heruntergeladen werden konnte, aber nicht gestartet werden konnte, weil &quot;Bei der Vorbereitung des Softwareupdates ist ein Fehler aufgetreten&quot; </p> <p> Das Problem wurde einem Fehler bei der Überprüfung des freien Speicherplatzes von Big Sur zugeschrieben. Herr Macintosh sagt, dass sich die Leute darüber beschwert haben, seit die erste öffentliche Version von macOS Big Sur im November 2020 herauskam. Nachdem die Veröffentlichung Apple auf das Problem aufmerksam gemacht hatte, hat das Unternehmen den bösen Fehler schnell beseitigt. </p> <p> </p> <p> &quot;Das Upgrade wird gestartet, selbst wenn Sie nur noch 1 % freien Speicherplatz haben und schlägt fehl.&quot; <a href=\"https://mrmacintosh.com/big-sur-upgrade-not-enough-hd-space-serious-issue-possible-data-loss/\" target=\"_blank\" rel=\"nofollow noopener\"> die Post </a> erklärt. Und da das Startlaufwerk zu fast 100 % voll ist, blieb das Installationsprogramm in einer endlosen Bootschleife stecken, um den Installationsvorgang abzuschließen. </p> <p> &quot;Dadurch können Sie nicht mehr auf Ihre Daten zugreifen&quot;, warnte Herr Macintosh. </p> <p> Die einzige Möglichkeit, das Problem zu beheben, war das Löschen und Neuinstallieren der macOS-Software. Aber mit dem überarbeiteten Update, das jetzt im Mac App Store verfügbar ist, können Mac-Besitzer ihrem täglichen Leben nachgehen, ohne sich Sorgen machen zu müssen, ob ein Update auf Big Sur ihr Startvolume löschen könnte. </p>"}