{"title":"Betreten Sie die dritte Dimension: Arbeiten mit 3D-Workflows in Adobe After Effects","content":"<p> Wenn Sie Ihren Adobe After Effects-Workflow verbessern möchten, müssen Sie sich irgendwann mit der Z-Achse befassen, mit der Sie die 3D-Tiefe eines Objekts bearbeiten können. </p> <p> Dies eröffnet Ihnen eine Reihe neuer Visuals und Stile, mit denen Sie arbeiten können, schafft jedoch auch eigene Einschränkungen und Überlegungen. </p> <p> In diesem Artikel erfahren Sie, wie Sie 3D-Ebenen aktivieren und damit arbeiten sowie 3D-Kameras hinzufügen und animieren, um dynamische Bewegungen zu erstellen. Ein Szenario, in dem wir Text in einem 3D-Raum animieren und verschieben, wird ebenfalls untersucht. </p> <p> Steigen wir ein! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> So aktivieren und animieren Sie 3D-Ebenen </h2> <p> Innerhalb Ihrer Komposition können Sie Ihre Ebenen in Ihrer Timeline umschalten, um sie als 3D zu aktivieren. </p> <p> Dies ist ein sehr einfacher Prozess. Finden Sie einfach die <strong> Würfel </strong> Symbol für Ihre Ebenen in Ihrer Timeline und klicken Sie auf das Kästchen darunter, um 3D für diese Ebene zu aktivieren. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> Sobald dies erledigt ist, werden Sie wahrscheinlich keine sofortigen Änderungen sehen. Wenn Sie jedoch zu Ihren Positions-, Skalierungs- und Rotationsparametern in Ihrem Layer navigieren, sehen Sie, dass ein dritter Satz anpassbarer Zahlen angezeigt wird. </p> <p> Diese neuen Zahlen bestimmen jetzt Ihre Drehung, Position und Skalierung auf der Z-Achse im 3D-Raum. Genau wie Ihre anderen Parameter können sie Keyframes sein, um Animationen und Manipulationen zu ermöglichen. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> Lassen Sie uns als Beispiel eine Komposition und eine Textebene mit einigen Wörtern erstellen. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Sobald dies erledigt ist, aktivieren Sie die 3D-Ebene. Beachten Sie, dass, wenn Sie vorhaben, die <strong> Ausrichten </strong> Um sicherzustellen, dass Ihre Ebene perfekt zentriert ist, müssen Sie dies tun, bevor Sie 3D aktivieren. Dies liegt daran, dass <strong> Ausrichten </strong> Werkzeug funktioniert nur auf 2D-Ebenen. </p> <p> Da unsere Textebene nun eine 3D-Ebene ist, können wir sie im 3D-Raum entlang der Z-Achse verschieben. Lassen Sie uns den Text also &quot;in Richtung des Bildschirms&quot; verschieben. </p> <p> Zuerst legen wir unseren Z-Achsen-Parameter fest. Standardmäßig ist es auf Null gesetzt. Stellen wir es auf <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Jetzt navigieren wir zwei Sekunden auf unserer Zeitachse und setzen unseren Z-Achsen-Wert auf <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> Mit dieser Änderung sollten wir nun sehen, wie sich der Text &quot;in Richtung&quot; des Bildschirms bewegt. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> Was sind 3D-Kameras? </h2> <p> Wir haben erfolgreich ein Objekt im 3D-Raum in After Effects animiert. Aber was ist, wenn Sie mehrere Objekte haben und ein Gefühl dafür erzeugen möchten, dass sich der Betrachter auf sie zu oder von ihnen weg bewegt? </p> <p> Sie könnten einfach jedes einzelne Element animieren, sich auf Sie zuzubewegen, aber das wäre sehr zeitintensiv und nicht besonders effizient. Hier würden Sie eine 3D-Kamera verwenden. </p> <p> </p> <p> Wenn Sie 3D-Software wie Cinema 4D oder Blender verwenden, haben Sie wahrscheinlich schon einmal 3D-Kameras verwendet. Wenn Sie schon einmal ein Computerspiel gespielt haben, haben Sie auch eine 3D-Kamera erlebt, die Ihren Blick in einer 3D-Welt bewegt. </p> <p> Das mag auf den ersten Blick komplex erscheinen, aber 3D-Kameras funktionieren genauso wie eine echte Kamera. Sie bieten Ihnen ein Sichtfeld, das in einem 3D-Raum manipuliert und verschoben werden kann. </p> <p> Lassen Sie uns an einem Beispiel arbeiten. </p> <h3 id=\"setting-up-a-3d-camera\"> Einrichten einer 3D-Kamera </h3> <p> Erstellen Sie zunächst mehrere 3D-Textebenen und positionieren Sie sie nacheinander auf der Z-Achse. </p> <p> In diesem Beispiel ist eine Lücke von <strong> 3.000 Pixel </strong> zwischen jeder Schicht verwendet wurde. Die erste Schicht liegt bei Null, die nächste bei 3.000, die nächste bei 6.000 und so weiter. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Jetzt ist es an der Zeit, eine 3D-Kamera zu erstellen, indem Sie auf klicken <strong> Schicht </strong> &gt; <strong> Neu </strong> &gt; <strong> Kamera </strong> , woraufhin Sie ein Fenster sehen, in dem Sie die Einstellungen für Ihre neue Kameraebene anpassen können. Diese gibt es in zwei Arten: <strong> Ein Knoten </strong> und <strong> Zwei Knoten </strong> . </p> <p> Das <strong> Ein-Knoten </strong> Kamera wurde entwickelt, um eine reale Kamera so genau wie möglich zu bedienen und zu emulieren, und der Fokuspunkt wird manuell durch die Bewegung der Kamera festgelegt. </p> <p> EIN <strong> Zwei-Knoten </strong> Die Kamera ist so konzipiert, dass sie einem einzelnen Punkt von Interesse folgt, was sie ideal für die Umlaufbahn oder Verfolgung eines sich bewegenden Objekts macht. </p> <p> In diesem Szenario ist die <strong> Ein-Knoten </strong> Kamera verwendet wird. Sie werden eine Reihe zusätzlicher Einstellungen im Fenster bemerken, wie z <strong> Zoomen </strong> , <strong> Betrachtungswinkel </strong> , <strong> Schärfentiefe aktivieren </strong> , und <strong> Brennweite </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Diese sollen reale Kameraeinstellungen widerspiegeln. Wenn Sie wissen, wie diese funktionieren, können Sie mit ihnen herumspielen. Wenn nicht, können Sie in der oberen rechten Ecke eine Reihe von Voreinstellungen auswählen. </p> <p> Wir wählen die <strong> 35mm </strong> jetzt voreingestellt. Jetzt, da unsere Kameraebene eingerichtet und in der Szene ist, werden Sie zunächst keinen großen Unterschied sehen. </p> <h3 id=\"using-3d-camera-navigation\"> Verwenden der 3D-Kameranavigation </h3> <p> Es gibt zwei Methoden, mit denen Sie die Ansicht der Kamera anpassen und animieren können. Am genauesten ist die Eingabe verschiedener <strong> Position </strong> Werte in der <strong> Verwandeln </strong> Einstellungen für die Kameraebene. Sie können dann Keyframes erstellen, wie Sie es beim Animieren einer anderen Ebene tun würden. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> Wenn Sie die Kamera bewegen, werden Sie feststellen, dass sich alle anderen 3D-Objekte in Ihrer Szene relativ dazu bewegen. Beachten Sie, dass die Kamera <strong> keine Auswirkungen auf 2D-Ebenen </strong> . </p> <p> Lassen Sie uns also unsere Kamera so einstellen, dass sie sich in einem Intervall von vier Sekunden auf der Z-Achse von null bis 9.000 bewegt, und unsere Bewegung mit Keyframes versehen. </p> <p> Hier hast du es! Wenn Sie es richtig eingerichtet haben, sollten die Worte &quot;auf Sie zu&quot;, &quot;durch&quot; das Sichtfeld und &quot;hinter&quot; den Betrachter drücken. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> Andere Möglichkeiten zum Bewegen der 3D-Kamera </h3> <p> Wenn Sie mit Ihrer Kamera lieber etwas experimentierfreudiger und weniger zahlengesteuert sein möchten, gibt es andere Möglichkeiten zum Bewegen, Navigieren und Anpassen. Das <strong> Orbit </strong> , <strong> Pfanne </strong> , und <strong> Transportwagen </strong> Tools oben in der Symbolleiste ermöglichen dies. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> Mit diesen können Sie klicken und ziehen, um sich von einer Seite zur anderen zu bewegen ( <strong> Pfanne) </strong> , umdrehen ( <strong> Orbit </strong> ) und vergrößern und verkleinern ( <strong> Transportwagen </strong> ). Diese Steuerelemente sind weniger genau als die Eingabe von Zahlen, aber sie eignen sich hervorragend für die Planung Ihrer groben Kamerabewegungen und Animationen. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> Übung führt zur Perfektion </h2> <p> Sie sollten jetzt in der Lage sein, 3D-Ebenen entlang der Z-Achse zu erstellen und zu animieren und auch mit 3D-Kameras zu arbeiten, um mit mehreren 3D-Objekten zu navigieren. </p> <p> Wenn Sie gerne in einem 3D-Raum arbeiten, möchten Sie vielleicht die erweiterten Möglichkeiten erkunden, die eine speziellere 3D-Software wie Blender bieten kann. </p>"}