{"title":"Bissgroßes Brain Food: 5 Websites, um neue Dinge auf kurze und unterhaltsame Weise zu lernen","content":"<p> Dokumentationen, die weniger als eine Minute dauern. Podcast-Episoden von nur 60 Sekunden. Animierte Infografiken zur Erläuterung komplexer Themen. Hier erfahren Sie mehr über die Welt in schnellen Kapseln mit spannendem Wissen. </p> <p> In einer Ära kurzer Aufmerksamkeitsspannen und 280 Zeichenaktualisierungen muss selbst das Lernen in winzigen Dosen erfolgen. Deshalb gibt es Content-Ersteller, die sich darauf spezialisiert haben, informative und unterhaltsame Stücke zu erstellen, die in unserem geschäftigen Leben fast keine Zeit in Anspruch nehmen. Von Mini-Dokumentationen über faszinierende Menschen und Themen bis hin zu Social-Media-Leitfäden zu Trendthemen – geben Sie Ihrem Geist mundgerechtes Brainfood zum Kauen. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 60-Sekunden-Dokumente </a> (Web): Profile interessanter Personen und Themen in 60 Sekunden </h2> <p> </p> <p> Haben Sie eine Minute? 60 Second Docs hat eine coole Geschichte über eine interessante Person zu erzählen und wiederum ein cooles Thema. Jeder Dokumentarfilm ist nur 60 Sekunden lang, aber er behandelt das Beste, was Sie über das Thema wissen müssen. </p> <p> Der coolste Teil ist, dass 60 Second Docs sich auf Profile von echten Menschen konzentriert, anstatt auf Konzepte oder Trends. Normalerweise macht diese Person etwas Einzigartiges, sei es, einen neuen Trend zu starten, ein neues Thema zu erkunden oder die Grenzen in irgendeiner Weise zu überschreiten. Indem Sie es über die Person machen, erhalten Sie nicht nur mehr Einblick in den menschlichen Aspekt des einzigartigen Themas, sondern es fühlt sich auch realer und emotionaler an. </p> <p> Alle 60-Sekunden-Dokumente sind auf ihrem YouTube-Kanal oder in den sozialen Medien verfügbar. Es ist eine gute Idee, ihnen in jedem sozialen Netzwerk zu folgen, das Sie häufig besuchen, und sich jedes neue Video vollständig anzusehen, wenn sie ein Update veröffentlichen. </p> <p> Wenn du längere Dokumentationen magst, dann schau mal beim <strong> Offizielle Auswahl </strong> Seite auf der 60 Second Docs-Website. Hier wählen die Redakteure 10-20-minütige Dokumentationen aus, die andere gedreht haben, zu Themen, die Sie ihrer Meinung nach sehen sollten. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Sie möchten also darüber sprechen </a> (Instagram): Mini-Guides zu politischen und gesellschaftlichen Themen </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> Wer hätte gedacht, dass Instagram in einer Welt voller Influencer-Selfies und von Marken beworbener Hashtags eine Plattform zur Bildung bieten würde? So You Want To Talk About (Sywtta) nutzt die Mehrfachbild-Post-Formate von Instagram, um Mini-Guides zu politischen und gesellschaftlichen Themen zu erstellen. </p> <p> Die von Sywtta ausgewählten Themen behandeln in der Regel Trendthemen wie die Kündigung von Studienkrediten, schwarze Rechte und Geschichte, logische Trugschlüsse, COVID-19-Impfstoffe und vieles mehr. Jede Folie verwendet schön formatierte Typografie, um Sie über das Thema zu informieren, und außerdem ist jede Folie wie eine kleine Lektion für sich. Jeder Guide wird zu einem schnellen und informativen Crashkurs, ohne zu datenlastig zu sein. </p> <p> Zu einer Zeit, in der Sie wachsam sein müssen <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> voreingenommene oder gefälschte Nachrichten </a> , es ist auch wichtig, die Philosophien des Gelesenen zu notieren. In der Politik propagiert Sywtta die Ansichten einer progressiven und linken Politik. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> 60-Sekunden-Wissenschaft </a> (Podcast): Kurze Audioerklärungen zu Wissenschaft, Gesundheit und Technologie </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Wenn Sie Ihre Informationen lieber anhören als lesen oder ansehen, schauen Sie sich den 60-Sekunden-Wissenschafts-Podcast an. Dieser tägliche Podcast, der vom Team von Scientific American erstellt wurde, berührt Themen aus Wissenschaft, Medizin und Technologie und erklärt ein Thema in kurzer Zeit. Obwohl es sich nicht mehr auf das minutenlange Zeitlimit beschränkt, dauert jede Episode immer noch unter fünf Minuten. </p> <p> Jeder Podcast hat verschiedene Moderatoren aus dem Scientific American-Team, die Themen wie COVID, Tiere und Vögel, DNA und Medizin, Umweltwissenschaften usw. abdecken. Sie genießen hohe Produktionswerte, integrieren reale Klänge zum Diskussionspunkt und fügen oft Sprachclips hinzu von Experten. </p> <p> Um die Archive vergangener Episoden zu durchsuchen, besuchen Sie die offizielle Website von 60-Second Science. Hier können Sie die Episoden nach Themen filtern (Gesundheit, Geist, Nachhaltigkeit, Technik, Wissenschaft). Wenn Sie keine Informationen in kurzen Abständen wünschen, probieren Sie den Science Talk Podcast in voller Länge aus. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Animationen </a> (Web): Hochwertige animierte Infografiken zur Erklärung der Dinge </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> Wie funktioniert Kryptowährung? Welche Besonderheiten gibt es bei der Autoversicherung? Wie macht man einen Moonwalk? Designer und Animator Jacob O&#39;Neal bricht komplexe Themen in einfache Erklärungen und zeichnet hochwertige animierte Infografiken, um sie zu veranschaulichen. </p> <p> Animaraffs ist eine Sammlung von kurzen Erklärungen durch visuelle Anleitungen mit animierten GIFs. Jacob verwendet eine Vielzahl von Designtechniken, wie Querschnittsansichten, um jeden Teil eines Instruments zu veranschaulichen, oder große Bilder mit beweglichen Teilen, die Sie wie Google Maps vergrößern und verkleinern können. Jeder Stil passt zu dem Thema, über das Sie lernen. </p> <p> Auch die Themen sind breit gefächert, darunter wie ein Gepard läuft, wie Elektroautos funktionieren, wie ein Lautsprecher Geräusche macht und so weiter. Sie sollten sich auch den Abschnitt &quot;Kundenarbeit&quot; ansehen, in dem Jacob bezahlte Aufträge für Marken vorstellt. Keine Sorge, obwohl es sich um Werbung handelt, sind sie dennoch informativ und unterhaltsam. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Große große Geschichte </a> (YouTube): Faszinierende und interessante wahre Kurzdokumentationen </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story beendete den Betrieb Ende 2020, aber nicht bevor er fünf Jahre lang reizvolle Kurzdokumentationen hinterließ. Tauchen Sie ein in die Archive und finden Sie etwa 5-minütige Videos zu einer Reihe interessanter Themen und faszinierender Menschen aus aller Welt. </p> <p> Von einem Film, der seit 24 Jahren in einem indischen Theater läuft, bis hin zu dem fantastischen türkischen Eis, das nicht schmilzt, jedes kurze Video ist ein qualitativ hochwertiger und gut recherchierter Blick auf das Thema. Im Gegensatz zu den meisten anderen solchen Videos reisen die Videomacher von Great Big Story oft um die Welt, um sich selbst in die Mitte der Geschichte zu versetzen. Sortieren Sie nach den beliebtesten oder verwenden Sie die verschiedenen benutzerdefinierten Playlists, die von den Machern empfohlen werden. </p> <p> Auf dem Kanal finden Sie auch einige längere Videos, etwa 10 bis 15 Minuten lang. Dies sind in der Regel Listen und Zusammenstellungen, die einige Ausschnitte aus den kürzeren Videos enthalten. Wenn Sie die Zeit haben, mehr über die Welt um uns herum zu erfahren, können Sie mit diesen nichts falsch machen. Auch nach dem Herunterziehen der Fensterläden ist Great Big Story eine der beliebtesten <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> faszinierende und lehrreiche Kanäle auf YouTube </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Verwenden Sie Drip Learning, um große Themen zu erobern </h2> <p> Diese Websites und Podcasts konzentrieren sich darauf, jedes neue Thema in ein kompaktes und unterhaltsames Informationspaket zu verwandeln. Es ist eine schöne Möglichkeit, in kleinen Häppchen neue Dinge zu lernen. Aber Sie können die gleiche Philosophie auch anwenden, um komplexere und größere Themen zu erlernen. </p> <p> Drip Learning oder Microlearning ist immer häufiger ein beliebter Bildungsweg. Durch Empfangen <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> mundgerechter Unterricht jeden Tag </a> , können Sie Themen wie Programmierung, Design, App-Entwicklung, Produktmanagement und mehr angehen. Eine schnelle Websuche sollte Ihnen helfen, eine Drip-Learning-Version von allem zu finden, was Sie sich weiterbilden möchten. </p>"}