{"title":"BitPay bringt Bitcoin zu Apple Pay","content":"<p> BitPay-Benutzer in den USA können jetzt ihre Prepaid-Bitcoin-Karten zu Apples Wallet-App hinzufügen und <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> damit Dinge mit Apple Pay bezahlen </a> . Kunden, die nicht von Apple stammen, können ihre BitPay-Karten der Marke MasterCard bald zu Google Pay und Samsung Pay hinzufügen. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> So fügen Sie Ihre BitPay-Karte zu Apple Wallet hinzu </h2> <p> Um Ihre BitPay-Karte einem Apple-Gerät hinzuzufügen, öffnen Sie die Wallet-App auf Ihrem iPhone und tippen Sie oben rechts auf &quot;+&quot;. </p> <p> Mit Ihrem BitPay in der Wallet-App können Sie die Karte zu Apple Pay hinzufügen, indem Sie zu . gehen <strong> Einstellungen &gt; Wallet &amp; Apple Pay </strong> , und tippen Sie dann auf die Option &quot;Karte hinzufügen&quot;. Um BitPay-Benutzer zu werden und Ihre Prepaid-Karte zu bestellen, laden Sie die BitPay Wallet-App von der <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> Appstore </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Eine neue Art, mit Apple Pay Geld auszugeben </h2> <p> Ein Beitrag zum <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> BitPay-Blog </a> sagt, dass das Hinzufügen einer BitPay-Karte zu Apple Pay eine bequeme Möglichkeit ist, Kryptowährungen an mehr Orten als zuvor auszugeben. „Wir haben Tausende von BitPay Wallet-App-Kunden, die die BitPay-Karte verwenden und immer auf der Suche nach neuen Orten und Möglichkeiten sind, ihr Krypto auszugeben“, sagte BitPay-CEO Stephen Pair <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> Pressemitteilung </a> . </p> <p> </p> <p> Mit Apple Pay können Inhaber von BitPay-Karten sichere kontaktlose Einkäufe in physischen Geschäften, Apps, die Apple Pay unterstützen, und im Internet tätigen. Das Unternehmen weist darauf hin, dass Kunden, die auf die Lieferung einer Plastikkarte warten, ihr virtuelles Gegenstück über die offizielle BitPay Wallet-App zu Apple Wallet hinzufügen können. Auf diese Weise können Sie sofort mit den Ausgaben beginnen. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> Was ist die BitPay-Karte? </h2> <p> Die BitPay-Karte, eine Prepaid-Karte, die das Mastercard-Netzwerk nutzt, erleichtert sowohl kontaktlose Zahlungen als auch PIN-Zahlungen sowie das Abheben von Bargeld an jedem kompatiblen Geldautomaten. Mit der App können Kunden beispielsweise ihr Guthaben einsehen, eine neue PIN anfordern, sofort aufladen sowie Kryptowährung in Fiat-Währung umwandeln (die dann auf die Karte geladen wird und überall dort ausgegeben werden kann, wo Mastercard Debit weltweit akzeptiert wird). </p> <blockquote> <p> Für Power-Blockchain-Benutzer unterstützt die BitPay Wallet-App eine Reihe von Optionen zum Kaufen und Speichern von Krypto und zum Tätigen von Online-Zahlungen. Benutzer können sofort Geschenkkarten von Hunderten von Top-Händlern in Geschäften und online kaufen. </p> </blockquote> <p> Die Karte hat einen EMV-Chip und kann im Notfall mit der App gesperrt werden. </p> <p> Nach Angaben des Unternehmens ist die Unterstützung für Google Pay und Samsung Pay für &quot;später in diesem Quartal&quot; geplant. Die BitPay-App unterstützt derzeit Bitcoin, Bitcoin Cash und Ether sowie vier an Dollar gebundene Stablecoins, USDC-, GUSD-, PAX- und BUSD-Kryptowährungen. </p>"}