{"title":"Bericht: Android 12 wird einen Einhandmodus bieten","content":"<p> Wir haben offiziell die Phase des Lebenszyklus von Android 11 erreicht, in der die Gerüchte über Android 12 in vollem Umfang herauskommen. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> XDA-Entwickler </a> hat berichtet, dass Google an einem Einhandmodus für Android 12 arbeitet, der es viel einfacher machen wird, mit einer Hand auf dem Telefon zu navigieren. Egal, ob Sie große oder kleine Hände haben, dies könnte eine ganz neue Möglichkeit eröffnen, mit Ihrem Android-Gerät zu interagieren. </p> <p> Natürlich viele Gerätehersteller und <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> Softwareentwickler haben Lösungen eingeführt, um die einhändige Bedienbarkeit zu verbessern </a> . Viel angenehmer ist es jedoch, wenn es direkt in das Betriebssystem integriert ist. </p> <h2 id=\"android-12-s-one-handed-mode\"> Einhandmodus von Android 12 </h2> <p> Dem Bericht zufolge plant Google, die Einhandfunktion zu AOSP hinzuzufügen, der Open-Source-Version von Android, die alle Softwarehersteller auf ihren Geräten verwenden können. Das bedeutet auch, dass OEMs, die ihren eigenen Einhandmodus noch nicht entwickelt haben, die Funktion einfach in ihre Geräte implementieren können. </p> <p> Was der Bericht nicht angab, war, ob Google von Telefonherstellern verlangen würde, die Einhandfunktion von Android 12 zu verwenden, oder ob sie optional wäre. </p> <p> Da es noch unglaublich früh ist, wissen wir nicht genau, wie der Einhandmodus von Android 12 funktionieren wird. Wenn die bisherige Fähigkeit von Google, dem Betriebssystem Funktionen hinzuzufügen, ein Hinweis darauf ist, erwarten wir, dass das Unternehmen bei der Implementierung gute Arbeit leistet. Google kann den gesamten Bildschirm für einen einfachen Zugriff auf eine Ecke des Geräts verkleinern. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> Der Bericht weist auch darauf hin, dass der Einhandmodus von Android 12 eine Möglichkeit haben wird, ihn mithilfe des traditionellen Drei-Tasten-Modus zusammen mit dem neueren gestischen Navigationsmodus auszulösen. </p> <p> Wie bereits erwähnt, haben viele Smartphone-OEMs die Funktion bereits in ihre eigene modifizierte Version von Android implementiert. Huawei hat beispielsweise tatsächlich versucht, seine Version der Funktion bei AOSP einzureichen, aber Google hat dies abgelehnt. Vielleicht hat Google es abgelehnt, weil das Unternehmen wusste, dass es beabsichtigte, eine eigene Version der Funktion selbst zu veröffentlichen. </p> <p> Da dieses Leck so früh ist, zeigen noch keine Fotos die Funktion, also müssen wir warten, bis Android 12 seiner Veröffentlichung näher kommt. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Wann wird Android 12 veröffentlicht? </h2> <p> Leider wissen wir nicht genau, wann Android 12 der Öffentlichkeit zugänglich gemacht wird (obwohl es noch eine Weile dauern wird). Wir wissen auch nicht genau, wann diese Funktion für Entwickler oder für die Beta- oder Stable-Android-Versionen veröffentlicht wird. </p> <p> Wie immer bei neuen Android-Features müssen wir abwarten, ob es überhaupt um das Betriebssystem geht. </p>"}