{"title":"Computer-RPGs vs. klassische Rollenspiele: Was bedeutet CRPG im Jahr 2021?","content":"<p> Die Geschichte der Computer-RPGs ist so lang wie die Geschichte der Videospiele selbst, die sich im Laufe der Jahre weiterentwickelt und zusammengewachsen sind. Und so wie sich CRPGs weiterentwickelten, Grafiken verbesserten, Spielmechaniken hinzugefügt oder weggelassen wurden, so auch die Bedeutung und Terminologie, die zu ihrer Beschreibung verwendet wurden. </p> <p> Die Abkürzung CRPG, die traditionell für Computer Role Playing Game stand, erweiterte ihre Bedeutung im Laufe der Zeit um RPGs für verschiedene Plattformen. Nun hat es eine neue Bedeutung angenommen. Obwohl sich seine neue Bedeutung nicht ganz von seiner ursprünglichen unterscheidet, beschreibt es jetzt ein bestimmtes RPG-Subgenre. </p> <h2 id=\"the-history-of-crpgs\"> Die Geschichte der CRPGs </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> Die Geschichte der CRPGs begann in den 1970er Jahren mit der Veröffentlichung der frühesten Videospieladaption des Tabletop-Rollenspiels Dungeons &amp; Dragons, Dungeon. Das Spiel war ursprünglich auf dem Atari verfügbar (Sie können es spielen über <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, ein Spiele-Streaming-Dienst auf Plex </a> ). </p> <p> Obwohl das Gameplay von Dungeons hauptsächlich textbasiert war, beschrieb es die Bewegungen Ihrer Multi-Charakter-Party in einer Fantasy-Umgebung vollständig und implementierte die meisten grundlegenden Grundsätze von Dungeons &amp; Dragons. </p> <p> Damals nannten wir sie Computer-RPGs, um sie von ihren damals weitaus populäreren Tabletop-Gegenstücken abzuheben, und wir kannten sie einfach als Rollenspiele. </p> <p> In den 1990er Jahren waren CRPGs in voller Blüte, jetzt sind sie in der Lage, eine Fantasiewelt vollständig darzustellen, zumindest in einer Top-Down-Perspektive oder einer isometrischen Ansicht. Dies war bei Ultima VII der Fall, einem der interaktivsten CRPGs, die dieser Autor gespielt hat. </p> <p> Fast alles, was Sie sehen, können Sie bewegen oder interagieren: Sie können Waffen herstellen, Instrumente spielen und sogar Ihr totes Gruppenmitglied aus einem Kerker bis in den Thronsaal des Königs tragen, um es wiederbeleben zu lassen! </p> <p> Baldur&#39;s Gate war einer derjenigen, die das Tabletop-RPG-Erlebnis am ehesten nachahmen. Es hat das Regelwerk von Dungeons &amp; Dragons 2nd Edition (AKA Advanced Dungeons &amp; Dragons) in eine isometrische <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> in Echtzeit pausierbares CRPG </a> . Diese Art von CRPGs betonte Taktiken im Kampf, Charakterentwicklung, Entscheidungsfindung und förderte die Erkundung. </p> <p> </p> <p> Heute, in einer Welt, in der Konsolen den Markt dominieren, sind Rollenspiele populärer geworden als Tisch-RPGs. Insofern bezieht sich das Akronym RPG im modernen Gebrauch eher auf seine Videospielversion. Du würdest Dungeon&#39;s &amp; Dragons eher als Table-Top-Rollenspiel bezeichnen und nicht nur als RPG. </p> <p> Mit der Entwicklung der Grafik wurde die Spielmechanik von CRPGs an moderne Grafikstandards angepasst. CRPG-Serien wie The Elder Scrolls, Gothic oder The Witcher haben das Genre revolutioniert und einige neue Spielmechaniken eingeführt, während andere fallengelassen wurden. </p> <p> Diese Rollenspiele sind action-orientierter und temporeicher und platzieren sich etwas, wenn auch nicht vollständig, im Hack-and-Slash-Subgenre (dies sind jedoch immer noch solide Rollenspiele!). </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Eine neue Welle von CRPGs </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> Doch entgegen dem Trend in der heutigen Videospielindustrie, grafischen Realismus zu bevorzugen, kam eine neue Welle von CRPGs. Old-School- oder Classic-RPGs beeinflussen diese Spiele stark und legen den Schwerpunkt eher auf Spielmechanik und Immersion als auf Grafik. </p> <p> Es handelt sich im Allgemeinen um isometrische Spiele mit entweder pausierbaren Echtzeit- oder rundenbasierten taktischen Schlachten. Diese CRPGs tun auch ihr Bestes, um so immersiv wie möglich zu sein und Ihnen ziemlich große Blöcke gut gemachter Prosa und eine solide Hintergrundgeschichte zu bieten. </p> <p> Die meisten von ihnen verlassen sich für die meisten Dialoge eher auf Text als auf Sprachausgabe, ähnlich wie CRPGs der alten Schule. Einige dieser CRPGs sind Pillars of Eternity, Divinity: Original Sin oder Pathfinder: Kingmaker. </p> <p> Diese Spiele betonen auch Kampftaktiken, Charakterentwicklung, Entscheidungsfindung und ermutigen zum Erkunden, genau wie es bei CRPGs der alten Schule der Fall war. Aus diesen Gründen betrachten wir sie als eher verwandt mit klassischen Rollenspielen als mit den meisten modernen Rollenspielen. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> Was CRPG im Jahr 2021 bedeutet </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> Seit den 2000er Jahren war RPG der Standardbegriff für jedes Rollenspiel. Aber um 2015 herum veröffentlichten sie Divinity: Original Sin and Pillars of Eternity. </p> <p> Diese Rollenspiele waren eine Abkehr von der actionorientierten Einstellung moderner Rollenspiele, während sie älteren Titeln sowohl in der Ästhetik als auch in der Spielmechanik sehr ähnlich waren. Ungefähr zu dieser Zeit entstand die Notwendigkeit für einen neuen Begriff, um diese Rollenspiele von modernen Rollenspielen abzugrenzen. </p> <p> Obwohl die Leute seit Jahren im Internet die Begriffe &quot;Old School&quot; und &quot;Classic RPG&quot; um sich werfen, um diese Spiele zu beschreiben, ist letzteres derjenige, der haften blieb. So wie moderne Rollenspiel-Videospiele das Akronym RPG für sich beanspruchten, nennen die Leute Old-School-RPGs jetzt &quot;CRPGs&quot;. </p>"}