{"title":"Canon bringt eine Photo Culling-App auf den Markt, die Ihre besten Aufnahmen findet","content":"<p> Hinter fast jedem perfekten Foto steckt eine Kamerarolle voller anderer Fotos, die fast genau so aussehen. Es ist nicht ungewöhnlich, dass Fotografen den Auslöser fast immer gedrückt halten, weil sie befürchten, einen flüchtigen Moment zu verpassen. </p> <p> Das Durchsuchen von Dutzenden oder vielleicht sogar Hunderten von Fotos, um Ihre Favoriten auszuwählen und Speicherplatz freizugeben, kann ein langer, nerviger Prozess sein. Zum Glück hat Canon eine neue App veröffentlicht, die das automatisch für Sie erledigt. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> Nehmen Sie ganz einfach eine Fotorolle auf die besten wenigen auf </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon Deutschland </a> hat eine Foto-Culling-App auf dem <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> Appstore </a> So finden Sie schnell und einfach Ihre besten Fotos. Die App selbst ist kostenlos, aber um sie nutzen zu können, müssen Sie ein Abonnement für 14,99 USD/Jahr oder 2,99 USD/Monat abschließen. Beide Abonnementoptionen haben eine dreitägige Testversion. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> Tatsuro „Tony“ Kano, Executive Vice President von Canon USA, erklärt: </p> <blockquote> <p> In der sich ständig verändernden und überwältigenden Welt von heute, in der Tausende von Fotos aufgenommen und auf dem Smartphone einer Person gespeichert werden, benötigen Verbraucher ein fachkundiges, zuverlässiges und intuitives Fototool, das ihnen hilft, die besten Fotos basierend auf jahrelangem vertrauenswürdigem Wissen und Technologie auszuwählen. </p> </blockquote> <p> Die App von Canon, einfach Photo Culling genannt, arbeitet mit einer KI namens Photography Intelligence Learning oder kurz PHIL. PHIL schlägt vor, welche Fotos Sie behalten und welche Sie löschen sollten, je nachdem, welche der beiden Foto-Culling-Optionen Sie auswählen. </p> <p> Die erste Möglichkeit, <strong> Ganzes Keulen </strong> , ist toll für <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> bessere Portraitfotografie </a> . Wenn diese Option ausgewählt ist, ermittelt PHIL Ihre besten Fotos, indem es sie anhand von vier Faktoren bewertet: Schärfe, Rauschen, Emotionen und ob die Augen Ihres Motivs geschlossen sind (sofern zutreffend). </p> <p> Inzwischen ist die <strong> Ähnliches Keulen </strong> Option wählt Ihre besten Aufnahmen aus, indem sie die Ergebnisse ähnlicher Fotos vergleicht. Angenommen, Sie haben ein paar Wolkenfotos und dann ein paar Blumenfotos gemacht. Die App würde die Wolkenfotos und die Blumenfotos in separate Gruppen aufteilen. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Unabhängig davon, für welche Option Sie sich entscheiden, gilt: Wenn die Punktzahl eines Fotos über der von Ihnen festgelegten Zielpunktzahl liegt, wird das Foto als Keeper betrachtet. PHIL schlägt dann vor, die verbleibenden Fotos zu löschen, die nicht hoch genug bewertet wurden. Falls Sie mit PHIL nicht einverstanden sind, machen Sie sich keine Sorgen. Sie haben immer noch die volle Kontrolle über alle Ihre Aufnahmen. </p> <p> </p> <p> Zu den weiteren Funktionen der App gehören Informationen zur Fotoanzahl und zum Speicherplatz, Fotoalben, Parametereinstellungen für Fotobewertungen und die Option, den Dunkelmodus zu verwenden. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> Werden Sie die Photo Culling-App von Canon herunterladen? </h2> <p> Es scheint, dass die Foto-Culling-App von Canon alles bietet, was Sie brauchen, um die Auswahl Ihrer besten Fotos weniger mühsam zu machen. Am Ende des Tages liegt es jedoch an Ihnen zu entscheiden, ob Sie das Aussortieren von Fotos genug hassen, um zu rechtfertigen, für etwas zu bezahlen, das Sie selbst tun könnten (wenn auch wahrscheinlich sehr langsam und langweilig). </p> <p> Zum Zeitpunkt des Schreibens ist die App nicht für Android verfügbar, aber vielleicht hat Canon das für die Zukunft in Aussicht. </p>"}