{"title":"Der Edge-Browser von Microsoft war Gastgeber für geheime Nintendo-Spielemulatoren","content":"<p> Microsoft hat eine Reihe illegaler Spielemulatoren ausgeschaltet, die sich in seinem Microsoft Edge-Browsererweiterungsspeicher verbergen. Der Store für Microsoft Edge-Erweiterungen beherbergte Dutzende von Emulatoren, mit denen Benutzer mehrere ikonische Spiele spielen konnten, von denen keines legal im Store veröffentlicht wurde. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft entfernt illegale Edge-Erweiterungsemulatoren </h2> <p> Im Microsoft Edge Extensions Store lauerten einige der kultigsten Spiele aller Zeiten, darunter Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2 und sogar Minecraft. Jedes Spiel wurde im Browser in einem Emulatorfenster gestartet und ermöglichte es den Benutzern, jeden Titel vollständig durchzuspielen. </p> <p> In keinem der klassischen Titel wurden jedoch die offiziellen Spieleentwickler wie Nintendo, Sega, Atari und ja – sogar Microsoft aufgeführt. Zu den Namen der aufgeführten Entwickler gehörten Gamelands, Kday und StayReal, die alle völlig frei erfunden sind und keine Links zu den ursprünglichen Entwicklern haben. </p> <p> Seltsamerweise ist der offizielle Twitter-Account von Microsoft Edge Development, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , über die Emulatoren gepostet, die anscheinend die im Browser-Erweiterungsspeicher verfügbaren Spiele bewerben. Wir haben den Original-Tweet, der die Emulatoren bewirbt, nicht mitbekommen, aber eine Kopie ist erhältlich über <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Zurücksetzen </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> Sind Emulatoren illegal? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Mit Emulatoren können Sie verschiedene Software ausführen </a> auf deinem Computer. Sie können auch einen Emulator verwenden, um alte Spiele zu spielen. </p> <p> Während Emulatoren selbst nicht illegal sind, ist das Herunterladen von urheberrechtlich geschützten Inhalten zum Abspielen auf einem Emulator bereits illegal. Der Tweet vom offiziellen Microsoft Edge Development-Konto war ein seltsamer Schachzug, da die Emulatoren eine neue Kopie des Spiel-ROM zum Spielen heruntergeladen haben. </p> <p> Auch das Thema Abandonware ist eher eine Grauzone. Abandonware-Spiele werden nicht mehr veröffentlicht und sind nicht mehr online oder in einem Geschäft erhältlich. In vielen Fällen ist das Urheberrecht an diesen Spielen jedoch nicht abgelaufen, aber der Urheberrechtsinhaber setzt seine Rechte nicht aktiv durch. </p> <p> </p> <p> In vielen Fällen ist Abandonware illegal. Dennoch gibt es keine Gerichtsverfahren, die sich auf Abandonware beziehen, oder zumindest keine in Bezug auf einen alten Spieleentwickler, der jemanden wegen des Herunterladens eines Abandonware-Titels strafrechtlich verfolgt. </p> <p> In diesem genauen Beispiel ist die Emulation dieser alten Spiele in einem Webbrowser illegal. Außerdem ist Nintendo dafür berüchtigt, Websites oder Dienste zu deaktivieren, die versuchen, sein geistiges Eigentum zu replizieren oder weiterzugeben. </p> <p> Derzeit wurden die Spiele aus dem Microsoft Edge-Erweiterungsspeicher entfernt. Außerdem ist noch nicht bekannt, wie die emulierten Spiele in den Extension Store gelangt sind oder wer sie dort abgelegt hat. Unnötig zu erwähnen, dass es unwahrscheinlich ist, dass sie zurückkehren. </p>"}