{"title":"DeviantArt fügt seiner mobilen App eine Seitenleiste und Gruppen hinzu","content":"<p> Jeder bildende Künstler hat seinen eigenen einzigartigen kreativen Prozess, aber es ist üblich – insbesondere im heutigen digitalen Zeitalter – dass der letzte Schritt in diesem Prozess darin besteht, Ihr fertiges Werk online zu teilen. </p> <p> Vorbei sind die Zeiten, in denen Sie Museen finden mussten, die Ihre Gemälde oder Fotos mitnehmen, damit die Leute sie sehen können. Wählen Sie stattdessen eine Plattform, die Sie am meisten anspricht, und posten Sie sie! </p> <p> DeviantArt wurde im Jahr 2000 gegründet und ist eine der ältesten Kunstcommunities im Internet. DeviantArt hat seine mobile App 2017 auf den Markt gebracht und das neueste Update ist klein, aber bedeutend. </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt for Mobile verbessert die Navigation </h2> <p> DeviantArt hat die Benutzeroberfläche seiner mobilen App verbessert und eine Seitenleiste hinzugefügt, die der auf der DeviantArt-Website sehr ähnlich ist. Über die Seitenleiste haben Sie schnellen Zugriff auf die Startseite, Abweichler (Künstler), denen Sie folgen, und Gruppen. </p> <p> <strong class=\"gallery__section-title\"> Bildergalerie (2 Bilder) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> Erweitern <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <p> Der Zugriff auf das letzte Element dieser Liste ist besonders bemerkenswert, da DeviantArt-Gruppen vor diesem Update nur auf der Website verfügbar waren. DeviantArt-Gruppen funktionieren ähnlich wie <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> Facebook-Gruppen </a> – Sammlungen von Nutzern, die sich auf der Plattform mit gemeinsamen Interessen oder Zielen zusammengeschlossen haben. </p> <p> Tippen Sie in der Seitenleiste auf <strong> Meine Gruppen </strong> um alle Gruppen anzuzeigen, zu denen Sie gehören, oder <strong> Empfohlene Gruppen </strong> um Gruppen anzuzeigen, von denen DeviantArt glaubt, dass sie gut zu Ihnen passen würden. Sie können Ihre Lieblingsgruppen auch oben in Ihrer Seitenleiste anheften, um den Zugriff zu erleichtern. </p> <p> Wenn Sie Ihre eigene Gruppe leiten, wird sie möglicherweise im empfohlenen Abschnitt für andere Abweichler angezeigt, die daran interessiert sein könnten, beizutreten. Wenn Sie an einer Gruppe nicht interessiert sind, können Sie auf die drei Punkte rechts neben dem Namen tippen, um die Empfehlung zu entfernen. </p> <p> Wenn Sie eine Gruppe in der App besuchen, sehen Sie sowohl deren Abweichungen (Einreichungen) als auch Beiträge. Gruppenadministratoren können Updates für ihre Gruppe über den Beitragsfeed veröffentlichen. </p> <p> <strong> Herunterladen: </strong> DeviantArt für <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> (Kostenlos) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> Wo teilen Sie Ihre Kreationen online? </h2> <p> Wenn Sie ein Künstler, Designer oder Fotograf sind, der schon lange im Internet unterwegs ist, haben Sie wahrscheinlich schon einmal DeviantArt besucht. Die Community scheint nicht mehr ganz so lebendig zu sein wie zu Beginn der 2000er Jahre, aber die Zahl der eingereichten Arbeiten ist in den letzten Jahren explodiert. </p> <p> Bei einer so aktiven Nutzerbasis sollte es für DeviantArt von größter Bedeutung werden, seine mobile App zu verbessern. Zum Zeitpunkt des Schreibens ist die App im App Store mit 2.6/5.0 und auf Google Play mit 3.2/5.0 bewertet. </p>"}