{"title":"Disney+ hat fast 100 Millionen Abonnenten","content":"<p> Unterschätze niemals Disney. Während Disney+ erst im November 2019 in den USA auf den Markt kam, zählt der Streaming-Dienst mittlerweile fast 100 Millionen Abonnenten. Es ist ein Wachstum, mit dem nicht einmal das Unternehmen gerechnet hat. </p> <h2 id=\"how-many-customers-does-disney-have\"> Wie viele Kunden hat Disney+? </h2> <p> Wie im angekündigt <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Disney Q1 2021 Gewinnbericht Q </a> , Disney+ hat am 2. Januar 2021 weltweit 94,9 Millionen Abonnenten. </p> <p> Das bedeutet, dass die Zahl die Abonnenten, die durch die erfolgreiche Veröffentlichung von WandaVision gewonnen wurden, nicht berücksichtigt. Es wäre nicht unfair anzunehmen, dass Disney+ mittlerweile über 100 Millionen Abonnenten hat. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Die letzten Zahlen wurden im Dezember 2020 veröffentlicht, als Disney bekannt gab, 86 Millionen Abonnenten für seinen Titel-Streaming-Dienst gewonnen zu haben. Der Sprung seither ist wahrscheinlich auf starke exklusive Inhalte wie die zweite Staffel von The Mandalorian und Pixars Spielfilm Soul zurückzuführen. </p> <p> Der durchschnittliche monatliche Umsatz pro Abonnent sank von 5,56 US-Dollar im Vorjahr auf 4,04 US-Dollar heute, was hauptsächlich auf die günstigeren Kosten des Dienstes in Indien und Indonesien zurückzuführen ist. </p> <p> Hulu und ESPN+, Streaming-Dienste ebenfalls im Besitz von Disney, verzeichneten ebenfalls ein starkes Wachstum. Ersteres wuchs im Jahresvergleich um 30 % auf 39,4 Millionen Abonnenten, während letzteres im Jahresvergleich um 83 % auf insgesamt 12,1 Millionen Abonnenten wuchs. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney hat kürzlich ein Bundle auf den Markt gebracht, das alle seine Streaming-Dienste kombiniert combining </a> , so dass klar ist, dass das Unternehmen weiterhin alle drei unterstützt. </p> <p> Star soll auch bald in vielen Regionen auf den Markt kommen, was die Anzahl der Filme und Fernsehsendungen von Disney+ enorm steigern wird. </p>"}