{"title":"Das Surface Duo erhält ein Veröffentlichungsdatum in Großbritannien und eine Preissenkung","content":"<p> Microsofts Surface Duo hatte keinen so fantastischen Empfang, aber es scheint, dass das Unternehmen daran interessiert ist, außerhalb der USA einen besseren ersten Eindruck zu hinterlassen. Das Unternehmen senkt nicht nur den Preis des Surface Duo, sondern hat auch ein bestätigtes Erscheinungsdatum für den britischen Markt. </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> Microsofts letzte Vorbereitungen in Übersee für das Surface Duo </h2> <p> Diese Nachricht kommt zu uns von <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . Wenn Sie sich vielleicht erinnern, als das Surface Duo gestartet wurde, <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> Es hat keine guten Bewertungen erhalten </a> . Ein zentraler Knackpunkt war, wie fehlerhaft das Betriebssystem des Duos war, aber ein anderer war der atemberaubende Preis von 1399,99 US-Dollar. </p> <p> Microsoft hat hart daran gearbeitet, die wichtigsten Probleme zu beheben, die von den Rezensenten gefunden wurden, aber der hohe Preis blieb dort, wo er war. Microsoft plant jedoch, das Surface Duo deutlich auf 999,99 US-Dollar zu senken. </p> <p> Dieser Rückgang ist wahrscheinlich in Vorbereitung auf die Veröffentlichung in Übersee, da sich Kritiker weltweit darauf vorbereiten, das Surface Duo Zoll für Zoll aufzuschlüsseln. Mit diesem niedrigeren Preis und den jüngsten Korrekturen des Surface Duo-Betriebssystems könnte das Wunder mit zwei Bildschirmen im Ausland einen positiven Eindruck hinterlassen. </p> <p> Microsoft hat auch bestätigt, wann britische Fans das Surface Duo selbst ausprobieren können. Wenn Sie sich in Großbritannien befinden, behalten Sie am 18. Februar 2021 die Elektronikhändler im Auge. </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> An der Oberfläche von Microsofts Auslandsplänen kratzen </h2> <p> Während das Surface Duo in den USA Mühe hatte, einen guten Eindruck zu hinterlassen, gibt es im Ausland möglicherweise noch Hoffnung. Mit all den Korrekturen am Betriebssystem des Surface Duo in Kombination mit diesem Preisverfall kann das Gras auf der anderen Seite grüner werden. </p> <p> Wenn Sie wissen möchten, auf welche Art von Patches Microsoft für das Surface Duo gedrängt hat, hat das Unternehmen kürzlich einige Stabilitätsupdates veröffentlicht, um die Fehler vor dem internationalen Debüt des Duos auszubügeln. </p> <p> <small> Bildquelle: Jack Skeens / <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}