{"title":"Das neueste WatchOS-Update schützt vor dem Apple Watch-Bricking-Fehler","content":"<p> Apples neuestes watchOS-Update, Softwareversion 7.3.1, enthält eine sehr wichtige Korrektur – die Behebung eines Fehlers, der das Aufladen einiger Apple Watch Series 5 und Apple Watch SE-Geräte verhindert, wenn sie in den Gangreserve-Modus wechseln. </p> <p> Das Unternehmen hat außerdem ein neues kostenloses Reparaturprogramm für betroffene Geräte gestartet, die in diesem Energiesparmodus gefangen sind und ihn nicht verlassen können. Dieser Fehler &quot;vermauert&quot; im Wesentlichen ihre Apple Watch und macht sie nicht mehr funktionsfähig. </p> <h2 id=\"the-power-reserve-mode-bug\"> Der Fehler im Gangreservemodus </h2> <p> Der Gangreserve-Modus wird eingeleitet, wenn der Akku einer Apple Watch fast leer ist. Es stoppt die Kommunikation Ihrer Apple Watch mit Ihrem iPhone. Es verhindert auch, dass Benutzer auf andere Funktionen der Apple Watch zugreifen. Um den Gangreserve-Modus zu verlassen, müssen Benutzer ihre Apple Watch aufladen. </p> <p> Auf einen <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> Support-Seite zum Fehler- und Reparaturprogramm </a> , vom 15. Februar, beginnt Apple mit der Feststellung: </p> <blockquote> <p> Bei einer sehr kleinen Anzahl von Kunden mit Apple Watch Series 5 oder Apple Watch SE-Modellen mit watchOS 7.2 oder 7.3 ist ein Problem aufgetreten, bei dem ihre Uhr nicht aufgeladen wurde, nachdem sie in die Gangreserve eingetreten ist. </p> </blockquote> <p> Um herauszufinden, ob Sie ein betroffenes Apple Watch-Modell haben, empfiehlt Apple, Ihre Watch auf ein Ladegerät zu legen und mindestens 30 Minuten zu warten. Wenn es nicht aufgeladen wird, wenden Sie sich an den Apple Support, der eine kostenlose Mail-In-Reparatur arrangieren wird. </p> <p> Die Uhren werden auf ihre Eignung überprüft, und sofern dies der Fall ist, wird die Reparatur kostenlos durchgeführt und die reparierte Uhr an ihren Besitzer zurückgeschickt. </p> <p> Es ist nicht genau klar, wie viele Apple Watches ernsthaft von dem Fehler betroffen sind. Es scheint jedoch, dass das Problem nur eine Teilmenge der Modelle der Apple Watch Series 5 oder Apple Watch SE und keine anderen Modelle betrifft. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> So aktualisieren Sie auf WatchOS 7.3.1 </h2> <p> Für diejenigen, die den Fehler noch nicht erlebt haben, lohnt es sich dennoch, auf die neueste watchOS-Version zu aktualisieren, nur um sich davor zu schützen, dass er möglicherweise passiert. </p> <p> Wie wichtig der Bugfix ist, zeigt die Tatsache, dass Apple sofort watchOS 7.3.1 an alle Benutzer verteilt hat. Dies steht im Gegensatz zu der Art und Weise, wie es normalerweise Software-Updates herausgibt, indem es diese zunächst Entwicklern für Beta-Tests zur Verfügung stellt. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple veröffentlicht watchOS 7.3 </a> Ende Januar. </p> <p> Benutzer können watchOS 7.3.1 mit der Apple Watch-App auf dem iPhone herunterladen. Dazu müssen sie gehen zu <strong> Allgemein &gt; Software-Update </strong> . Ihre Apple Watch muss mindestens 50 Prozent Akku haben, um ein Update durchführen zu können. Es muss sich auch in der Nähe Ihres iPhones befinden. </p>"}