{"title":"Eine weitere inoffizielle PS5-Faceplate-Marke ist auf der Bühne","content":"<p> dbrand, das Skins, Bildschirme und Hüllen für eine Vielzahl von Geräten herstellt, hat sich dem Sony-Köder angeschlossen und eine eigene inoffizielle PS5-Faceplate veröffentlicht. </p> <h2 id=\"dbrand-releases-darkplates\"> dbrand veröffentlicht Darkplates </h2> <p> Wenn Sie Ihre PS5 anpassen möchten, ist dbrand das neueste Unternehmen, das inoffizielle Drittanbieter-Faceplates für die Konsole der neuen Generation anbietet. Sie nennen sie Darkplates, weil es sich um schwarze Faceplates handelt. </p> <p> Sie können die Platten auf der <a href=\"https://dbrand.com/shop/special-edition/ps5\" target=\"_blank\" rel=\"nofollow noopener\"> dbrand-Store </a> , wo Sie die mattschwarzen Frontplatten für 49,00 US-Dollar (zum Zeitpunkt des Schreibens) kaufen können. </p> <p> Sie können auch das, was dbrand eine &quot;mittlere Haut&quot; nennt, aufnehmen, einen Vinyl-Aufkleber, der über das hochglänzende, schwarze Mittelfeld der PS5 geht. Dies kostet zusätzlich 11,95 USD und ist in einer Reihe von Farben und Designs erhältlich. </p> <p> <img alt=\"dbrand shell texture detail\" src=\"images/dbrand-shell-texture-detail-544.png\" loading=\"lazy\"> </p> <p> Sie werden auch feststellen, dass es mit seiner Faceplate-Textur prahlt. Das ist ähnlich wie <a href=\"https://www.makeuseof.com/sony-how-ps5-controller-textured-playstation-symbols/\" target=\"_blank\" rel=\"nofollow noopener\"> die winzigen PlayStation-Symbole, die du auf dem DualSense findest </a> , anderes offizielles PS5-Zubehör und die Erstanbieter-Frontplatten, die beim Kauf an der Konsole angebracht sind. Ähnlich, aber sind sie genauso beeindruckend? </p> <p> </p> <h2 id=\"will-dbrand-last\"> Wird dbrand dauern? </h2> <p> Sie haben zweifellos unsere gesehen <a href=\"https://www.makeuseof.com/cmp-shells-ps5-faceplate-colors/\" target=\"_blank\" rel=\"nofollow noopener\"> Faceplategate-Abdeckung in Bezug auf CMP-Shells </a> , was die selbst triumphierende Rücksendung nach Sony-Verbot rechtfertigte. Manche mögen sagen, seine Rückkehr sei arrogant, da es seine neuen Faceplates für rechtlich unantastbar erklärte. Wir werden sehen. </p> <p> </p> <p> Dies lässt Sie sich fragen, warum sich dbrand überhaupt die Mühe gemacht hat. Sony kategorisch <strong> nicht </strong> nehmen Sie freundlich zu CMP Shells, erstens, weil der frühere Markenname zu PlayStation (PlateStation) zu ähnlich war. </p> <p> Dann legte Sony Einspruch ein, weil es entschied, dass die Frontplatten Teil des Designs der Konsole waren und daher das Kopieren eine Verletzung des geistigen Eigentums darstellte. Cue das Hämmern des Banhammers. CMP Shells stellte die Produktion ein und stornierte alle Bestellungen, bevor es in seiner neuen Form wieder auftauchte. </p> <p> dbrand befindet sich bereits in der vierten Welle potenziell unerfüllter Kunden-Vorverkäufe. Sie müssen also schnell sein, wenn Sie sich eine der benutzerdefinierten Faceplates schnappen möchten. Ob die Platten tatsächlich in Produktion gehen, ist eine andere Frage. Sony könnte den Hammer durchaus wieder zu Fall bringen. </p> <p> </p> <h2 id=\"should-you-buy-a-dbrand-faceplate\"> Sollten Sie eine dbrand-Faceplate kaufen? </h2> <p> Wie bei der CMP Shells-Saga raten wir jedem, der daran interessiert ist, seine PS5-Faceplates anzupassen, vorsichtig zu sein. Dies sind Produkte von Drittanbietern, und Sie haben daher keine andere Möglichkeit, ihre Qualität zu bestätigen, als die Marke Ihnen sagt. </p> <p> Angesichts des Beharrens von Sony, dass PlateStation (jetzt CMP Shells) die Produktion einstellen musste, wird es auch nicht verwundern, wenn es nicht auch seine Anwälte anwählt, um den Fall von dbrand zu bearbeiten. </p> <p> Kurz gesagt, seien Sie vorsichtig, wenn Sie Ihre Faceplates anpassen möchten. CMP Shells erstattete allen seinen Kunden beim ersten Mal eine Rückerstattung. Aber das bedeutet nicht, dass eine andere Marke dies tun wird. </p> <p> </p> <h2 id=\"do-you-really-need-to-customize-your-ps5\"> Müssen Sie Ihre PS5 wirklich anpassen? </h2> <p> <img alt=\"ps5\" src=\"images/ps5-183.jpg\" loading=\"lazy\"> </p> <p> Wenn Sie mit dem Aussehen Ihrer PS5 nicht zufrieden sind, können Sie es jederzeit auf andere (deutlich günstigere) Weise ändern. Sie können der Konsole jederzeit eine Vinylhaut hinzufügen, wenn sie anders aussehen soll. </p> <p> Die PS5 wurde erst im November 2020 auf den Markt gebracht. Versuchen Sie vielleicht, ein paar Spiele darauf zu spielen, bevor Sie den unwiderstehlichen Drang verspüren, das kosmetische Erscheinungsbild Ihrer Konsole zu ändern. </p>"}