{"title":"Ein riesiges Microsoft Edge-Update steht auf Ihrem Weg","content":"<p> Microsoft arbeitet sehr hart daran, seinen Internetbrowser Edge zum absoluten Besten zu machen. Jetzt bringt das Unternehmen drei wichtige Funktionen mit, und die Zukunft von Edge sieht rosig aus. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Was Microsoft für Edge geplant hat </h2> <p> Das große Bumper-Update wurde erwischt <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows-Neueste </a> . Die drei Funktionen sollen in einem großen Update erscheinen, es lohnt sich also, Edge in naher Zukunft im Auge zu behalten. </p> <p> Zunächst erhält Microsoft Edge Unterstützung für Web-Widgets. Diese Widgets sind eine praktische Möglichkeit, um einen schnellen Einblick in wichtige Informationen des Tages zu erhalten. Der Software-Riese möchte mit Widgets in allen Formen und Größen experimentieren, hat sich aber entschieden, mit einem News-Widget zu beginnen, um die Sache zu starten. </p> <p> Als nächstes erhält Microsoft Edge eine Tab-Suchfunktion. Wenn Ihnen das bekannt vorkommt, liegt es wahrscheinlich daran, dass Sie das gelesen haben <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> Erste Spekulationen, dass Edge ein Suchwerkzeug für Tabs bekommt </a> . Glücklicherweise ist diese Spekulation Realität geworden und Microsoft plant, die Chrome-Funktion in Edge zu integrieren. </p> <p> Schließlich können Sie alle Ihre Edge-Erweiterungen über ein einziges Menü verwalten. Es erscheint als Puzzleteil in Ihrer Browser-Taskleiste, und wenn Sie darauf klicken, werden Ihnen alle installierten Erweiterungen sowie eine schnelle Möglichkeit zum Aktivieren und Deaktivieren jeder Erweiterung angezeigt. </p> <p> Es ist nicht sicher, wann genau dieses Update veröffentlicht wird, aber Windows Latest hat es für &quot;das nächste große Update&quot; angeheftet. Daher wird es nicht lange dauern, bis Microsoft Edge zu einer attraktiven Wahl für Leute wird, die nach etwas Neuem suchen. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: Das nächste große Ding? </h2> <p> Die Browser von Microsoft galten lange Zeit als fortschrittliche Download-Manager für die Installation von Chrome oder Firefox. Seitdem Microsoft eine Chromium-Codebasis für seinen Browser eingeführt hat, ist es jedoch längst nicht mehr zum Gespött der Browserwelt geworden. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCounter </a> listet Microsoft Edge zum Zeitpunkt des Schreibens als zweithäufigsten Windows-Browser in den USA auf. Wir wussten bereits, dass Firefox von Edge in den Schatten gestellt wurde, aber seitdem ist die Lücke nur noch größer geworden. </p> <p> Jetzt macht Edge 5,25 Prozent des US-Marktes aus, verglichen mit 3,35 Prozent, die Firefox besitzt. Beide sind weit entfernt von den 45,83 Prozent von Chrome, aber es ist ein Anfang. </p> <p> Wenn Sie zuvor beim Microsoft-Browser die Nase rümpfen, ist jetzt ein guter Zeitpunkt, ihm eine zweite Chance zu geben. Wer weiß, vielleicht werden Sie von Microsofts bestem Browser aller Zeiten überzeugt sein! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Den Browser an den Rand schieben </h2> <p> Wenn Sie in der Vergangenheit kein Fan von Microsoft-Browsern waren, ist dies ein guter Zeitpunkt, um zu sehen, worum es bei der Aufregung geht. Ein großes Update ist in Arbeit, und es wird von hier aus nur noch besser. </p> <p> Microsoft weiß, dass es sich um eine Erfolgsformel handelt. Tatsächlich berichtete das Unternehmen kürzlich, dass mittlerweile 600 Millionen Menschen auf der ganzen Welt Edge zum Surfen im Internet nutzen. </p> <p> <small> Bildquelle: DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}