{"title":"Facebooks Mark Zuckerberg nahm Apples Datenschutz-Push persönlich","content":"<p> Facebook-Chef Mark Zuckerberg sagte Berichten zufolge den Facebook-Mitarbeitern, dass &quot;wir Apple Schmerzen zufügen müssen&quot;, weil sie den Social-Media-Riesen so schlecht behandelt haben <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> Wallstreet Journal </a> berichtet. </p> <p> Zuckerberg gab den Kommentar angeblich 2018 ab, nachdem sich Apples und Facebook-Chefs über den Skandal um Cambridge Analytica gestritten hatten, bei dem die persönlichen Daten von Millionen von Facebook-Nutzern ohne deren Zustimmung für politische Werbung abgerufen wurden. </p> <h2 id=\"apple-vs-facebook\"> Apple vs. Facebook </h2> <p> Damals wurde Apple-Chef Tim Cook in einem Interview gefragt, wie er reagieren würde, wenn er sich in Zuckerbergs Situation mit der Krise befände. &quot;Ich wäre nicht in dieser Situation&quot;, sagte Cook. </p> <p> Das Wall Street Journal behauptet, dass, während Zuckerberg kommentierte, dass Cooks Worte &quot;extrem glatt&quot; und &quot;überhaupt nicht der Wahrheit entsprechen&quot;, er hinter den Kulissen jedoch wesentlich härter in seiner Einschätzung war. </p> <p> Seitdem hat sich die Beziehung zwischen den beiden Technologieunternehmen nicht verbessert. Apple hat seine datenschutzorientierte Haltung verdoppelt, wobei Cook den Datenschutz als einen der <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> die dringendsten Sorgen der Welt </a> . iOS 14 enthält mehrere datenschutzbezogene Funktionen, die Facebook in Frage gestellt hat und behauptet, dass sie kleinen Unternehmen schaden könnten. </p> <p> Während des letzten vierteljährlichen Investorenaufrufs von Facebook bezeichnete Zuckerberg Apple als <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> einer der größten Konkurrenten von [Facebook] </a> &quot; als Ergebnis dieser neuen Datenschutzmaßnahmen. &quot;Apple sagt vielleicht, dass sie dies tun, um Menschen zu helfen, aber die Schritte folgen eindeutig ihren Wettbewerbsinteressen&quot;, sagte Zuckerberg. </p> <p> </p> <p> Facebook bereitet angeblich ein Kartellverfahren gegen Apple vor, das die Scharfschützenjagd zwischen den beiden Silicon Valley-Titanen in einen umfassenden Rechtsstreit verwandeln würde. Der Bericht des Wall Street Journal stellt fest, dass &quot;die möglichen behördlichen Vergleiche und rechtlichen Entscheidungen in den kommenden Jahren wahrscheinlich Hunderte Millionen von Verbrauchern betreffen werden.&quot; </p> <p> </p> <h2 id=\"different-approaches\"> Unterschiedliche Ansätze </h2> <p> Facebook-Sprecher Dani Lever sagte dem Wall Street Journal: &quot;Apple behauptet, es gehe um Datenschutz, aber es geht um Profit, und wir schließen uns anderen an, um auf ihr selbstpräferierendes, wettbewerbswidriges Verhalten hinzuweisen.&quot; Sie sagte, dass Facebook im Namen kleinerer Unternehmen und Entwickler, die durch Apples App-Datenschutzfunktion verletzt werden, „absichtlich gegen Apple aufsteht“. </p> <p> Lever bestritt zwar, dass der Kampf zwischen den beiden Unternehmen persönlich ist, geht aber absolut über einige Streitpunkte zwischen zwei großen Technologieunternehmen hinaus. Das werbefinanzierte Geschäftsmodell von Facebook unterscheidet sich stark von dem hardwarefinanzierten Modell, das Apple antreibt. Keines der beiden Unternehmen – oder ihre Führungskräfte – werden wahrscheinlich von ihren Grundüberzeugungen über den Aufbau der Zukunft der Technologie abweichen. </p> <p> Die Tatsache, dass Apple-Chef Tim Cook den Datenschutz moralisch diskutiert, zeigt, wie persönlich dies auf einer Ebene wirklich ist. </p> <p> <small> Bildquelle: Wikipedia/ <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Anthony Quintano CC </a></small> </p>"}