{"title":"Facebooks Hassreden-Erkennungs-KI zahlt sich aus","content":"<p> Facebook verbessert seine Effizienz beim Erkennen und Entfernen hasserfüllter Inhalte. Die Plattform <a href=\"https://transparency.facebook.com/community-standards-enforcement\" target=\"_blank\" rel=\"nofollow noopener\"> Bericht zur Durchsetzung von Gemeinschaftsstandards </a> zeigt einen deutlichen Rückgang der Prävalenz von Hassreden im letzten Quartal 2020. </p> <h2 id=\"hate-speech-on-facebook-has-dipped\"> Hassreden auf Facebook sind zurückgegangen </h2> <p> Im Facebook-Bericht zur Durchsetzung von Community Standards für Oktober bis Dezember 2020 enthüllte die Plattform wesentliche Verbesserungen im Umgang von Facebook mit Hassreden. Guy Rosen, Vizepräsident für Integrität von Facebook, hat einen Beitrag auf <a href=\"https://about.fb.com/news/2021/02/community-standards-enforcement-report-q4-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> der Über Facebook-Blog </a> um seinen Erfolg hervorzuheben. </p> <p> Auf 10.000 Aufrufe von Facebook-Inhalten kamen nur sieben bis acht Aufrufe von hasserfüllten Inhalten. Facebook hat auch Maßnahmen gegen 6,3 Millionen Mobbing- und Belästigungsposts ergriffen, ein Anstieg gegenüber 2,5 Millionen Posts im dritten Quartal. </p> <p> Die Plattform konnte auch 6,4 Millionen organisierte Hassinhalte erfassen, was eine massive Verbesserung gegenüber den vier Millionen Inhalten darstellt, die Facebook im Vorquartal entfernt hat. </p> <p> Der Bericht zur Durchsetzung von Gemeinschaftsstandards zeigte ähnliche Verbesserungen auf Instagram. Fünf Millionen Posts mit Bezug zu Belästigung und Mobbing wurden auf Instagram entfernt, zusammen mit 6,6 Millionen Inhalten mit Hassreden und 308.000 organisierten Hassinhalten. Alle diese Zahlen übertreffen die Statistiken des dritten Quartals. </p> <p> Die proaktive Rate von Facebook, auch bekannt als die Menge an Inhalten, die Facebook entfernt, bevor ein Benutzer sie meldet, verbesserte sich ebenfalls. Bei Mobbing und Belästigung stieg die proaktive Rate der Plattform von 26 Prozent auf 49 Prozent auf Facebook und von 55 Prozent auf 80 Prozent auf Instagram. </p> <p> <img alt=\"Facebook graph for bullying\" src=\"images/facebook-content-takedowns-q4-715.png\" loading=\"lazy\"> Bildquelle: Facebook </p> <p> <a href=\"https://www.makeuseof.com/facebooks-ai-tackles-hateful-content/\" target=\"_blank\" rel=\"nofollow noopener\"> Die Hasserkennungs-KI von Facebook </a> hat eine wichtige Rolle dabei gespielt, die Reaktion auf Hassreden zu verstärken. Rosen weist darauf hin, dass die Plattform ihre KI verbessert hat, &quot;wo Nuancen und Kontext wesentlich sind, wie Hassreden oder Mobbing und Belästigung&quot;, was letztendlich dazu beigetragen hat, die Menge hasserfüllter Inhalte auf Facebook zu reduzieren. </p> <p> Mike Schroepfer, Chief Technology Officer von Facebook, hat einen separaten Beitrag über <a href=\"https://about.fb.com/news/2021/02/update-on-our-progress-on-ai-and-hate-speech-detection/\" target=\"_blank\" rel=\"nofollow noopener\"> der Über Facebook-Blog </a> um die Errungenschaften der sich ständig verbessernden KI von Facebook zu feiern. Trotz der jüngsten Errungenschaften hofft Schroepfer, dass die KI von Facebook besser werden kann, &quot;Inhalte im Kontext über Sprachen, Kulturen und Regionen hinweg anzuzeigen&quot;. </p> <p> </p> <h2 id=\"facebook-s-ai-is-getting-smarter\"> Die KI von Facebook wird intelligenter </h2> <p> Facebook verlässt sich zunehmend auf sein KI-System, um hasserfüllte Inhalte aufgrund der anhaltenden COVID-19-Pandemie zu bewerten. Rosen stellte fest, dass das Facebook-Team wahrscheinlich immer noch von der Pandemie betroffen sein wird, &quot;bis ein Impfstoff allgemein verfügbar ist&quot;. </p> <p> Auch wenn die Moderatoren von Facebook eines Tages wieder normal arbeiten werden, scheint die KI der Plattform nirgendwo hinzugehen. Facebook hat seine KI nur intelligenter und effizienter gemacht, und es scheint nicht so, als würde Facebook in absehbarer Zeit aufhören, Fortschritte zu machen. </p>"}