{"title":"Google fügt der 2FA-Eingabeaufforderung auf Android einen dunklen Modus hinzu","content":"<p> <a href=\"https://www.makeuseof.com/dark-mode-android/\" target=\"_blank\" rel=\"nofollow noopener\"> Liebhaber des dunklen Modus </a> haben heute einen Leckerbissen, da Android ein dunkles Thema für seine Zwei-Faktor-Authentifizierungsaufforderung erhält. Das bedeutet, dass die Anmeldung mit 2FA den Dunkelmodus Ihres Telefons nicht mehr mit einem scheußlichen hellen Bildschirm durcheinander bringt, wenn Sie sich irgendwo anmelden müssen. </p> <h2 id=\"dark-mode-two-factor-authentication\"> Zwei-Faktor-Authentifizierung im Dunkelmodus </h2> <p> Das Team von <a href=\"https://9to5google.com/2021/02/11/google-prompt-dark-theme/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> hat die 2FA-Eingabeaufforderung im Dunkelmodus auf Android entdeckt, die für einige Nutzer eingeführt wurde. Es nimmt die gleiche Eingabeaufforderung &quot;Versuchen Sie sich anzumelden&quot; an und taucht sie in ein dunkelgraues Design, das Ihre Augen schont und im Vergleich zum Rest Ihres Telefons nicht so störend ist. </p> <p> Abgesehen vom Hinzufügen des Dunkelmodus hat die 2FA-Eingabeaufforderung auch eine kleine Optimierung erfahren. Die Schaltflächen wurden etwas getrennt, um es einfacher zu machen, die richtige zu treffen, wenn Sie versuchen, sich bei einem Ihrer Konten anzumelden. </p> <p> Der Text hat eine kleine Optimierung, da Google den Text richtig groß geschrieben hat, sodass er professioneller aussieht als zuvor. </p> <p> </p> <h2 id=\"when-can-you-get-dark-mode-on-2fa\"> Wann können Sie den Dark Mode auf 2FA erhalten? </h2> <p> Google hat letzte Woche damit begonnen, das Dark-Mode-Theme für seine 2FA-Eingabeaufforderung bereitzustellen, sodass Sie es jetzt auf Ihrem Gerät verfügbar haben sollten. Schalten Sie einfach das Dark-Mode-Thema ein und Sie sollten loslegen. Wenn Sie es noch nicht sehen, müssen Sie etwas länger warten, da Google daran arbeitet, es auf allen Geräten bereitzustellen. </p>"}