{"title":"Google fügt Chrome für iOS Face ID-Unterstützung hinzu","content":"<p> Google testet eine neue Sicherheitsfunktion in Chrome 89 für iOS, die die biometrische Authentifizierung des iPhones verwendet, um Ihre privaten Browser-Tabs zu schützen. Dies ist derzeit auf Personen im Betakanal von Chrome beschränkt. Dadurch können Sie Ihre Inkognito-Tabs mit Face ID oder Touch ID sperren. </p> <h2 id=\"even-more-private-private-browsing\"> Noch mehr privates Private-Browsing </h2> <p> Alle mit Face oder Touch ID geschützten Inkognito-Tabs werden im Tab-Wechsler unscharf angezeigt. Gesperrte Tabs werden wieder sichtbar, sobald sie mit der biometrischen Authentifizierung des ‌iPhone‌ bestätigt wurden. </p> <p> Diese hilfreiche Funktion erhöht nicht nur Ihre Privatsphäre, sondern erhöht auch Ihre Sicherheit beim Multitasking über mehrere Apps auf Ihrem iPhone oder iPad. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> stellt fest, dass aufgrund einer serverseitigen Komponente nicht alle Beta-Benutzer auf die neue Sperroption zugreifen können. </p> <p> </p> <h2 id=\"how-s-this-useful\"> Wie ist das nützlich? </h2> <p> Es ist auch nützlich, wenn ein Freund Sie bitten könnte, Ihr iPhone auszuleihen, um schnell online nach etwas zu suchen. Mit dem Face ID-Schutz für den privaten Browsermodus von Chrome können sie Ihre geöffneten Inkognito-Websites beim Wechseln der Tabs nicht sehen. </p> <p> </p> <p> &quot;Inkognito&quot; ist ein Marketingname für den privaten Browsermodus von Chrome. Im Inkognitomodus können Sie im Internet surfen, ohne dass Chrome Informationen zur Sitzung speichert. Wenn Sie ein Inkognito-Fenster schließen, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> alle Informationen zu dieser Sitzung verschwinden </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> So aktivieren Sie die Face- oder Touch-ID in Chrome </h2> <p> Diese bevorstehende neue Funktion muss im Abschnitt Datenschutz der In-App-Einstellungen von Chrome manuell aktiviert werden. Eine ähnliche Datenschutzsperre ist in anderen Google-Apps vorhanden. </p> <p> In der nativen Such-App bestätigt beispielsweise die biometrische Authentifizierung des iPhones Ihre Identität, wenn Sie nach 15 Minuten zu einer Inkognito-Sitzung zurückkehren. In Google Drive ist auch eine optionale Face- oder Touch-ID-Authentifizierung verfügbar, um Ihre Dateien beim Beenden der App zu schützen. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> Wann wird das Feature offiziell veröffentlicht? </h2> <p> Es ist noch nicht bekannt, wann die neue Sperroption für alle verfügbar sein könnte, aber Chrome 89 wird voraussichtlich nächsten Monat für die Öffentlichkeit freigegeben. Google könnte sich auch entscheiden, die Funktion trotz der Auflistung in den offiziellen Versionshinweisen überhaupt nicht zu veröffentlichen. </p>"}