{"title":"Google veröffentlicht experimentelle KI, die Synästhesie simuliert","content":"<p> Wassily Kandinsky brach seine juristische Laufbahn ab, um an der Münchner Akademie der Bildenden Künste Malerei zu studieren. Er gilt als einer der Begründer der reinen Abstraktion in der Malerei, und das könnte an seiner faszinierenden Art und Weise liegen, wie er Farben und Formen wahrnahm. </p> <p> Mit diesem KI-Tool können Sie sich Kandinskys Ohren ausleihen. Jetzt können Sie hören, was er beim Malen gemacht hat (oder zumindest Googles Interpretation dessen, was er beschrieben hat). </p> <h2 id=\"what-if-you-could-hear-color\"> Was wäre, wenn Sie Farbe hören könnten? </h2> <p> In Zusammenarbeit mit dem Centre Pompidou in Paris hat Google Arts &amp; Culture ein experimentelles Projekt namens . gestartet <a href=\"https://artsandculture.google.com/experiment/sgF5ivv105ukhA\" target=\"_blank\" rel=\"nofollow noopener\"> Spielen Sie einen Kandinsky </a> . </p> <p> Wie der Name schon sagt, können Sie mit dem interaktiven Tool die abstrakten Gemälde von Wassily Kandinsky in musikalischer Form erleben. Kandinsky war ein russischer Maler mit einer neurologischen Erkrankung namens Synästhesie. </p> <p> <img alt=\"A screenshot of the second part of Play a Kandinsky\" src=\"images/play-kandinsky-screenshot-2-986.png\" loading=\"lazy\"> </p> <p> Die von Antoine Bertin und NSDOS komponierte Partitur wurde von Musik aus Kandinskys Zeit inspiriert und mit Googles Transformer generiert <a href=\"https://www.makeuseof.com/tag/what-are-neural-networks/\" target=\"_blank\" rel=\"nofollow noopener\"> neurales Netzwerk </a> . </p> <p> Beim Klicken <strong> Experiment starten </strong> , Musik wird abgespielt und die KI fordert Sie auf, ein paar Mal auf einen Kreis in der Mitte des Bildschirms zu klicken. Jedes Mal, wenn Sie dies tun, ändern sich die Farben des Kreises und des Hintergrunds sowie die Musik. </p> <p> Synästhesie ist ein Zustand, der Ihre Wahrnehmung beeinflusst. Die Stimulation eines Sinnes löst eine automatische, unfreiwillige Erfahrung in einem anderen aus. Beispielsweise könnte ein Synästhetiker (eine Person mit Synästhesie) an die Zahl &quot;4&quot; denken und rot sehen oder Äpfel schmecken, wenn er das Wort &quot;Freund&quot; hört. </p> <p> Für Kandinsky bedeutete Synästhesie, dass er Farben sah, wenn er Musik hörte, und Musik hörte, während er malte. „Der Klang der Farben ist so eindeutig, dass es schwer wäre, jemanden zu finden, der helles Gelb mit Bässen oder dunkles Blau mit Höhen ausdrücken würde“, sagte er einmal. </p> <p> <img alt=\"Yellow-Red-Blue (1925), by Wassily Kandinsky\" src=\"images/yellow-red-blue-kandinsky-947.png\" loading=\"lazy\"> </p> <p> 1925 schuf er ein Meisterwerk, das er Gelb-Rot-Blau nannte (Bild oben). Es war ein Ölgemälde, das ihn von den einflussreichen Kunstströmungen seiner Zeit, dem Konstruktivismus und dem Suprematismus, unterschied. </p> <p> Im dritten Teil von Play a Kandinsky können Sie das Gemälde in einer klassischen siebensätzigen Symphonie hören. Seine großzügige Verwendung von Blau und Gelb in starkem Kontrast zueinander folgt dem <a href=\"https://www.makeuseof.com/how-to-use-color-theory-elevate-your-creative-projects/\" target=\"_blank\" rel=\"nofollow noopener\"> Farben Lehre </a> des deutschen Dichters Johann Wolfgang von Goethe. </p> <p> Google ordnet Kandinsky Farben und Formen zu, so wie man einem Musiker Tasten und Saiten eines Instruments zuordnet. &quot;Als außerordentlich begabter Künstler arrangierte er Farbklänge zu Farbsymphonien&quot;, <a href=\"https://artsandculture.google.com/story/the-sound-of-colours/0ALymHuhPl1jLg\" target=\"_blank\" rel=\"nofollow noopener\"> Geschichte </a> liest. </p> <p> </p> <h2 id=\"there-s-more-to-art-than-meets-the-eye\"> Kunst ist mehr, als das Auge sieht </h2> <p> Wir werden nie genau erfahren, was Kandinsky während seiner Arbeit gehört hat, aber es sind Projekte wie dieses, die Kreativität und Selbstbeobachtung wirklich anregen. </p> <p> Vielleicht gibt es eine Verbindung zwischen Kunst und Musik, die die meisten von uns nicht vollständig verstehen können. Das Experiment von Google leistet gute Arbeit, um diese Möglichkeit zu untersuchen. </p> <p> <small> Bildquelle: Wassily Kandinsky/ <a href=\"https://commons.wikimedia.org/wiki/File:Kandinsky_-_Gelb-Rot-Blau,_1925.jpg\" rel=\"nofollow noopener\" target=\"_blank\"> Wikimedia Commons </a></small> </p>"}