{"title":"HBO Max wird im Juni in Lateinamerika starten","content":"<p> HBO Max, der Streaming-Dienst von WarnerMedia, startet im Juni 2021 in ganz Lateinamerika und der Karibik. Zum ersten Mal wird der Dienst außerhalb der USA verfügbar sein. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> Wo startet HBO Max in Lateinamerika? </h2> <p> Derzeit ist HBO Max nur in den USA erhältlich. Ab Ende Juni 2021 wird es in vielen Ländern Lateinamerikas und der Karibik verfügbar sein. Die Nachricht wurde in a bekannt gegeben <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> Pressemitteilung von WarnerMedia </a> . </p> <p> Im Einzelnen sind dies: Anguilla, Antigua, Argentinien, Aruba, die Britischen Jungferninseln, Bahamas, Barbados, Belize, Bolivien, Brasilien, Kaimaninseln, Chile, Kolumbien, Costa Rica, Curacao, Dominica, Dominikanische Republik, Ecuador, El Salvador , Grenada, Guatemala, Guyana, Haiti, Honduras, Jamaika, Mexiko, Montserrat, Nicaragua, Panama, Paraguay, Peru, St. Kitts und Nevis, St. Lucia, St. Vincent, Suriname, Trinidad und Tobago, Turks und Caicos, Uruguay , und Venezuela. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> Was wird HBO Max in Lateinamerika bieten? </h2> <p> </p> <p> Bestehende HBO GO-Abonnenten, die direkt oder über &quot;berechtigte Partner&quot; bezahlen, erhalten sofortigen Zugriff auf HBO Max. HBO GO wird dann in allen Regionen auslaufen. </p> <p> Preisdetails wurden noch nicht bekannt gegeben, werden jedoch in den nächsten Monaten zusammen mit Informationen zu neuen Inhalten und Werbeangeboten versprochen. </p> <p> Wie in den USA wird HBO Max eine Vielzahl von Abonnementpaketen und Support-Geräten wie Smartphones, Tablets und anderen intelligenten Plattformen anbieten. </p> <p> </p> <p> In einem Trailer, der die Neuigkeiten ankündigt, sind Ausschnitte aus Serien wie Game of Thrones and Friends sowie Filmen wie The Matrix und Casablanca zu sehen. Am Ende erscheint jedoch eine kleine Meldung, die darauf hinweist, dass &quot;nicht alle Titel beim Start verfügbar sein werden&quot;. </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> Wann wird HBO Max weltweit verfügbar sein? </h2> <p> Im vergangenen Jahr kündigte Warner Bros. kontrovers an, seine gesamte Kinotafel 2021 für HBO Max zu veröffentlichen. Es verursachte Regisseur <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Christopher Nolan bezeichnet HBO Max als „schlechtesten Streaming-Dienst“ </a> . </p> <p> Obwohl einige in der Filmindustrie stöhnen mögen, ist dies eine großartige Entscheidung für die Verbraucher. </p> <p> Daher werden sich diejenigen in Lateinamerika und der Karibik wahrscheinlich auf den Start von HBO Max freuen, in der Hoffnung, dass der Deal auch für sie gilt. </p> <p> Was den Rest der Welt betrifft? Es wurden keine festen Daten festgelegt, aber WarnerMedia gab bekannt, dass die nordischen Länder, Spanien, Mitteleuropa und Portugal noch in diesem Jahr auf HBO Max aktualisiert werden sollen. </p> <p> Johannes Larcher, Leiter von HBO Max International, sagte: </p> <blockquote> <p> Wir freuen uns sehr über die Einführung von HBO Max in Lateinamerika und der Karibik, die den ersten Schritt darstellt, um den Direct-to-Consumer-Service von WarnerMedia Verbrauchern außerhalb der USA und weltweit zur Verfügung zu stellen. </p> </blockquote>"}