{"title":"iPhone 13 könnte mit &quot;Always On&quot;-Display aufwarten","content":"<p> Apple stellte 2019 sein &quot;Always-On&quot;-Display für die Apple Watch Series 5 vor. Ein paar Jahre später könnte es auf dem iPhone erscheinen, so der Reporter Max Weinbach, der die Informationen mit dem YouTube-Kanal teilte <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> AllesApplePro </a> . </p> <p> Der Bericht behauptet, dass das iPhone 13 – wenn Apple es tatsächlich so nennt – einige Bereiche des Bildschirms dauerhaft beleuchtet haben, um bestimmte Details anzuzeigen. </p> <h2 id=\"how-always-on-display-will-work\"> So funktioniert die Anzeige &quot;Immer an&quot; </h2> <p> Diese Details können sowohl das Uhr- als auch das Batteriesymbol umfassen. Sie bleiben auch bei gesperrtem iPhone sichtbar, d. Benachrichtigungen, z. B. Benachrichtigungen über neue Nachrichten, würden nur vorübergehend beleuchtet. </p> <p> Dies wäre das erste Mal, dass das iPhone mit einer &quot;Always-On&quot;-Display-Technologie ausgestattet ist. Es wäre jedoch keineswegs das erste Mal, dass eine ähnliche Technologie auf einem Smartphone Einzug hält. Nokia hat bereits 2009 eine „Always-On“-Bildschirmfunktion eingeführt. In jüngerer Zeit ist sie zu einer weit verbreiteten Funktion auf verschiedenen Android-Handys geworden – einschließlich Modellen von Huawei, Motorola, Samsung, Google und anderen. </p> <p> Der große, offensichtliche Vorteil von &quot;always on&quot; besteht darin, dass der Benutzer sein Telefon nicht aufwecken oder entsperren muss, um auf Informationen zuzugreifen, auch wenn es sich um etwas so Kleines wie das Überprüfen der Uhrzeit handelt. </p> <p> Der Nachteil ist, dass es zusätzliche Akkulaufzeit verbraucht, was bei Smartphones bereits eine Prämie sein kann. AMOLED-Displays können diese Batteriebelastung jedoch reduzieren, indem nur die Pixel auf dem Display aktiviert werden, die zum Anzeigen der Informationen erforderlich sind. </p> <p> Mit anderen Worten, dieses &quot;Always-On&quot;-Display ist im technischen Sinne immer eingeschaltet - obwohl der Großteil des Bildschirms ausgeschaltet ist und nur wenige Teile die ganze Zeit beleuchtet bleiben. Dies bedeutet, dass die Auswirkungen auf die Akkulaufzeit nicht so groß sind, wie es sonst sein könnte. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> Was Sie vom iPhone 13 erwarten können </h2> <p> Das iPhone der nächsten Generation wird voraussichtlich im September 2021 auf den Markt kommen. Laut Weinbach wird es das gleiche Gehäusedesign wie die iPhone 12-Serie aufweisen, obwohl es einige Upgrades unter der Haube geben wird. </p> <p> Dazu gehören stärkere MagSafe-Magnete, ein verbessertes Kamerasystem zum Aufnehmen von Mond- und Sternenbildern, ein Ultra-Weitwinkel-Kameraobjektiv für die gesamte iPhone-Reihe, ein Video im Hochformat (statt nur Standbilder), eine verfeinerte matte Rückseite und ein Serienchip. Ein früherer Bericht hat behauptet, Apple könnte <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> Einführung von Touch ID im Display </a> als Alternative zur Face-ID. </p> <p> Da dies noch mehr als ein halbes Jahr entfernt ist, könnten viele neue Details auftauchen, bevor Apple im dritten Quartal sein nächstes iPhone vorstellt. Nichtsdestotrotz scheint die Gerüchteküche bereits zu kreischen. Beobachten Sie diesen Raum! </p>"}