{"title":"JPG vs. JPEG: Was ist der Unterschied zwischen diesen Bilddateiformaten?","content":"<p> Nicht alle Bilddateiformate sind gleich. Tatsächlich wurden viele von ihnen erstellt, um ein Problem anzugehen, das ein bereits vorhandenes Format nicht lösen konnte. Das JPEG zum Beispiel entstand, weil die Größe der Bilddateien viel zu viel Speicherplatz verbrauchte. </p> <p> Ob Sie es glauben oder nicht, die Dateierweiterungen JIF, JPEG und JPG beziehen sich mehr oder weniger auf dasselbe. Um zu verstehen, warum das Dateiformat so viele Namen hat, müssen wir ein wenig verworrene Geschichte aufdecken. </p> <h2 id=\"what-is-a-jpeg\"> Was ist ein JPEG? </h2> <p> Das Akronym JPEG steht für Joint Photographic Experts Group. Der Dateityp wurde nach dem Unterausschuss benannt, der bei der Erstellung des JPEG Interchange Format (JIF)-Standards half. Es wurde erstmals 1992 von der International Organization for Standardization (ISO) herausgegeben. </p> <p> JPEGs sind 24-Bit-Standbild-Rasterbilder mit acht Bits in jedem Kanal des RGB-Farbmodells. Dies lässt keinen Platz für einen Alphakanal, was bedeutet, dass JPEGs zwar über 16 Millionen Farben unterstützen können, jedoch keine Transparenz. </p> <p> Wenn ein Bild als JPEG gespeichert wird, werden einige seiner Daten in einem Prozess verworfen, der als verlustbehaftet bezeichnet wird <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Dateikomprimierung </a> . Das Bild benötigt wiederum 50-75 Prozent weniger Speicherplatz (im Vergleich zu älteren Formaten wie BMP) bei kaum bis gar keinem wahrnehmbaren Verlust an Bildqualität. </p> <p> Die JPEG-Komprimierung basiert auf einer verlustbehafteten Bildkomprimierungstechnik, die als diskrete Kosinustransformation (DCT) bezeichnet wird und erstmals 1972 vom Elektroingenieur Nasir Ahmed vorgeschlagen wurde. </p> <h3 id=\"what-is-a-jif\"> Was ist ein JIF? </h3> <p> Sie können sich eine JIF-Datei als JPEG in seiner &quot;reinsten&quot; Form vorstellen. Das Format wird jedoch nicht mehr häufig verwendet, da es einige frustrierende Einschränkungen aufwies. Beispielsweise verursachten die Farb- und Pixelaspektdefinitionen eines JIF Kompatibilitätsprobleme zwischen Encodern und Decodern (Viewern). </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> Glücklicherweise wurden diese Probleme später durch andere &quot;ergänzende&quot; Standards behoben, die auf dem JIF aufbauen. Das erste davon war das JPEG File Interchange Format (JFIF) und später das <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Austauschbares Bilddateiformat </a> (Exif) und ICC-Farbprofile. </p> <p> JPEG/JFIF ist das derzeit beliebteste Format zum Speichern und Übertragen von fotografischen Bildern im Internet, während JPEG/Exif das Format für Digitalkameras und andere Bildaufnahmegeräte ist. Die meisten Leute unterscheiden den Unterschied zwischen diesen Variationen nicht und bezeichnen sie einfach nur als JPEG. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> Was ist ein JPG2 oder JPF? </h3> <p> Im Jahr 2000 veröffentlichte die JPEG-Gruppe ein weiteres Bilddateiformat namens JPEG 2000 (seine Dateierweiterungen sind JPG2 und JPF). Es sollte ein Nachfolger des JPEG werden, war aber bei weitem nicht so beliebt. Auch wenn seine fortschrittliche Kodierungsmethode oft zu einer besseren Bildqualität führte. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Bildquelle: Dake/ <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Das Dateiformat JPEG 2000 floppte aus einer kleinen Handvoll Gründen. Zum einen basierte es auf einem völlig neuen Code und war daher nicht abwärtskompatibel mit JPEG. Darüber hinaus erforderte die Verarbeitung von JPEG 2000-Dateien mehr Speicher für die Verarbeitung, was damals ein kleiner Deal-Breaker war. Immerhin verfügte ein durchschnittlicher Computer zu dieser Zeit nur über 64 MB Arbeitsspeicher. </p> <p> Das JPEG 2000 hat ein kleines Wiederaufleben erlebt, da sich die Computerhardware in den letzten 20 Jahren im Allgemeinen stark verbessert hat, aber das Dateiformat wird immer noch sehr wenig genutzt. Der einzige Internetbrowser, der zum Zeitpunkt des Schreibens JPEG 2000-Dateien unterstützt, ist Safari. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG vs. JPG </h3> <p> Frühe Versionen von Windows (insbesondere die Dateisysteme MS-DOS 8.3 und FAT-16) hatten eine maximale Begrenzung von 3 Buchstaben, wenn es um die Länge der Dateierweiterungen ging. JPEG musste auf JPG gekürzt werden, um die Grenze nicht zu überschreiten. Mac- und Linux-Computer hatten so etwas nie, und so würden Benutzer Bilder weiterhin als JPEG speichern. </p> <p> </p> <p> Beliebte Bildbearbeitungsprogramme, die auf verschiedenen Betriebssystemen funktionieren – wie Photoshop und <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> Gimp </a> – würde schließlich ihre Standard-JPEG-Dateierweiterung auf JPG setzen, um Verwirrung zu vermeiden. </p> <p> Und so kamen wir zu zwei Dateierweiterungen für das gleiche Format: JPEG und JPG. Bei der Auswahl des Speicherorts für Ihr Bild gibt es keinen Unterschied. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG vs. PNG: Was ist besser? </h2> <p> </p> <p> JPEG und PNG wurden innerhalb desselben Jahrzehnts veröffentlicht, wobei jedes Dateiformat ein anderes digitales Bildproblem löste, mit dem die Technologiewelt damals konfrontiert war. Man könnte sagen, dass es nur natürlich ist, dass sie ständig verglichen werden... und das sind sie bis heute. Welches Bilddateiformat dominiert zwischen JPEG und PNG? </p> <p> Ehrlich gesagt hängt die Antwort davon ab, welche Art von Bild Sie speichern. </p> <p> JPEGs eignen sich besser für Fotos, da sie eine verlustbehaftete Komprimierung verwenden, um angemessene Dateigrößen einzuhalten. Fotos sind so große, detaillierte Bilder, dass Komprimierungsartefakte (durch die Komprimierung verursachte subtile Bildverzerrungen) nicht sehr auffällig sind. </p> <p> Auf der anderen Seite sehen Bilder mit scharfen Punkten, scharfen Kanten und mit großen Flächen einer Farbe (z. B. Vektorlogos, Pixelart usw.) nicht richtig aus, wenn sie als JPEG gespeichert werden. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Bildquelle: Axel Grimard/ <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Hier könnte die Datei Portable Network Graphics (PNG) ins Spiel kommen. Entwickelt von der PNG Development Group vier Jahre nach der Veröffentlichung von JPEG unterstützt PNG verlustfreie Datenkomprimierung und Transparenz. PNGs werden daher häufig verwendet, wenn die Bildqualität beibehalten werden muss und die Dateigröße kein Problem darstellt. </p> <p> Eine gute Faustregel ist, JPEG für Fotos beizubehalten und PNG für Bilder mit Transparenz und nicht-fotografische Bilder zu speichern. Weitere Informationen zu den vielen verschiedenen Dateitypen (nicht nur Bildern) finden Sie in unserem Leitfaden zu <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> wissen, wann welches Dateiformat zu verwenden ist. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG und JPG haben das gleiche Dateiformat </h2> <p> Trotz der Verwirrung, die das JPEG mit seinen vielen Aktualisierungen und Variationen verursacht hat, wurde die schließliche Flut digitaler Bilder im Internet Mitte der 90er Jahre zweifellos in erster Linie durch seine Veröffentlichung verursacht. </p> <p> Wenn Sie das nächste Mal bereit sind, ein Foto aus einem Bildbearbeitungsprogramm zu exportieren und die lange Liste der verfügbaren Formate angezeigt wird, denken Sie daran: JPEG und JPG sind ein und dasselbe. </p>"}