{"title":"Laut neuer Studie sind Android-Nutzer bessere Partner als iPhone-Nutzer","content":"<p> Zwischen iPhone- und Android-Smartphone-Nutzern tobt ein nie endender Kampf. Selbst diejenigen, die nicht an der Schlacht teilnehmen, haben sich nur durch die Auswahl ihres Smartphones für eine Seite entschieden. </p> <p> Es gibt eine neue Falte in der Schlacht, als <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> VergleichenMyMobile </a> hat kürzlich eine Studie darüber durchgeführt, ob iPhone- oder Android-Benutzer bessere Beziehungspartner sind. Wie sich herausstellte, neigen iPhone-Nutzer dazu, nervigere Telefongewohnheiten zu haben als Android-Nutzer, was zu dem Schluss führt, dass Android-Nutzer bessere Partner sind. </p> <p> Natürlich steckt mehr hinter den Daten als diese einfache Schlussfolgerung, also lassen Sie uns etwas tiefer eintauchen und einen Blick darauf werfen. </p> <h2 id=\"iphone-and-android-relationship-study\"> Beziehungsstudie zwischen iPhone und Android </h2> <p> Die allgemeine Schlussfolgerung der Studie ist, dass Android-Benutzer bessere Partner sind als iPhone-Benutzer, aber die Ergebnisse gehen viel tiefer als diese oberflächliche Schlussfolgerung. Insgesamt befragte die Studie mehr als 2.000 Nutzer und bietet somit eine relativ große Stichprobengröße. </p> <p> Bei der Untersuchung der nervigsten Smartphone-Gewohnheiten ergab die Studie, dass iPhone-Nutzer mit 12 % höherer Wahrscheinlichkeit eine Straftat begehen als ihre Android-Nutzer. Tatsächlich haben iPhone-Nutzer in jeder einzelnen Kategorie der Umfrage mehr Gräueltaten bei der Telefonnutzung begangen als Android-Nutzer. </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> Einige Beispiele für ärgerliche Vergehen sind, ihren Partner beim Lesen zu lassen, ihr Telefon während eines Films zu benutzen und sogar ihr Telefon während der Fahrt zu benutzen (was nicht nur nervig, sondern auch unglaublich gefährlich ist). iPhone-Nutzer lassen ihre Handys noch häufiger fallen und kaputtmachen als Android-Nutzer, was eine wirklich überraschende Statistik ist. </p> <p> Einige andere nervige Gewohnheiten sind <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> auf den Social-Media-Profilen anderer Leute schleichen </a> , übermäßige Filter für Fotos verwenden, mehrere einzeilige Nachrichten senden (ich weiß, dass ich das viel zu oft mache) und ihr Telefon während eines Gesprächs verwenden. </p> <p> Interessanterweise fand die Studie auch heraus, dass Männer die meisten der lästigen (und in einigen Fällen geradezu unsicheren) Gewohnheiten eher ausüben als Frauen. </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> Aber Apple-Nutzer bekommen mehr Termine </h2> <p> Laut einer anderen von CompareMyMobile veröffentlichten Studie ist es wahrscheinlicher, dass iPhone-Nutzer Dates in Online-Dating-Apps erhalten. Die Studie, bei der über 50.000 Wischvorgänge untersucht wurden, ergab, dass iPhone-Nutzer mit 76 % höherer Wahrscheinlichkeit ein Date bekommen als jemand mit einem Android-Handy, wenn sie über eine Dating-App sprechen. </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> Glaubt man der ersten Studie, funktioniert die Beziehung möglicherweise nicht, weil der iPhone-Benutzer sich auf andere Social-Media-Profile schleicht und während der Fahrt SMS schreibt. Dennoch ist es wahrscheinlicher, dass sie ihren nächsten Partner finden, wenn die vorherige Beziehung nicht funktioniert. </p> <p> Am Ende ist Dating nie einfach. Tun Sie also Ihr Bestes, um zu verhindern, dass Ihr Telefon zu dem Gerät wird, das eine gute Sache tötet! </p>"}