{"title":"Lang ersehnte AirTags könnten im März endlich debütieren","content":"<p> Apples AirTags, ein Miniatur-Standort-Tracker für Schlüssel und andere kleine Gegenstände, werden seit 2019 gemunkelt. Sechs Wochen nach 2021 müssen sie jedoch noch von Apple angekündigt werden – geschweige denn, mit dem Versand zu beginnen zu Kunden. </p> <p> Das könnte sich nächsten Monat ändern, so der mehrjährige Apple-Tippgeber Jon Prosser. In einem am Freitag, dem 12. Februar, gesendeten Tweet behauptete Prosser: &quot;AirTags sind für März noch aktiv. Ich habe diesmal keine weiteren Verzögerungen gehört.&quot; </p> <h2 id=\"what-to-expect-from-airtags\"> Was Sie von AirTags erwarten können </h2> <p> Prosser bezieht sich auf eine frühere Verzögerung, von der er Ende letzten Jahres vor dem Medienereignis von Apple am 13. Oktober berichtete. Damals notierte Prosser auf <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800\" target=\"_blank\" rel=\"nofollow noopener\"> Twitter </a> dass er von seinen (scheinbar gut positionierten) Quellen gehört hatte, dass &quot;Apple die Ankündigung und den Start von AirTags auf März 2021 verschoben hat.&quot; Bis zu einem halben Jahr später scheint es, dass keine weiteren Verzögerungen die Veröffentlichung der AirTags aufhalten werden. Hoffentlich zumindest. </p> <p> AirTags wird angeblich die Ultra-Breitband-Technologie von Apple verwenden, damit iPhones ihren genauen Standort mit hoher Genauigkeit bestimmen können. Sie werden angeblich sowohl Audio-Cues als auch einen erweiterten virtuellen Marker verwenden, um genau anzuzeigen, wo sich das an den AirTags befestigte Objekt befindet. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> AirTags laufen noch für März. <br><br> Von weiteren Verzögerungen habe ich diesmal noch nichts gehört. 🤞 </p> – Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1360265330296250377?ref_src=twsrc%5Etfw\"> 12. Februar 2021 </a></blockquote>  <p> Das Finden der einzelnen AirTags wird will <a href=\"https://www.makeuseof.com/apple-find-my-items-hidden-tab/\" target=\"_blank\" rel=\"nofollow noopener\"> erfolgt über die iOS-App &quot;Find My&quot; </a> , mit dem Benutzer auch ihre iPhones, iPads, Macs und andere Apple-Geräte verfolgen können. Die AirTags werden Apples Konkurrent zu beliebten Bluetooth-Tracking-Produkten von Unternehmen wie Tile sein. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Also, über AirTags. <br><br> Dieser hier tut mir im Herzen weh... <br><br> Mir wurde mitgeteilt, dass Apple die Ankündigung und Einführung von AirTags auf März 2021 verschoben hat <a href=\"https://t.co/xtUvCAFmoE\"> https://t.co/xtUvCAFmoE </a> <a href=\"https://t.co/DIUlcp01Xy\"> pic.twitter.com/DIUlcp01Xy </a></p> – Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800?ref_src=twsrc%5Etfw\"> 9. Oktober 2020 </a></blockquote>  <p> Apple hat noch keine Sonderveranstaltung für März angekündigt, bei der die AirTags angekündigt werden könnten. Wenn es jedoch eine hostet, wird dies den letzten Jahren entsprechen. In sechs der letzten 10 Jahre hat Apple im März eine Veranstaltung veranstaltet, bei der neue Produkte vorgestellt wurden. </p> <p> Im vergangenen Jahr gab es viele Gerüchte über eine Veranstaltung, die jedoch nicht stattfand, höchstwahrscheinlich aufgrund des Beginns der COVID-19-Pandemie in den USA und anderswo. Nun, da Apple auf virtuelle Events umgestiegen ist, würde dies jedoch nicht davon abhalten, nächsten Monat ein weiteres Event zu veranstalten. Alternativ könnte Apple die AirTags per Pressemitteilung bekannt geben. </p> <p> </p> <h2 id=\"expect-a-new-ipad-pro-as-well\"> Erwarten Sie auch ein neues iPad Pro </h2> <p> Dies ist möglicherweise auch nicht das einzige neue Apple-Produkt im nächsten Monat. Prosser antwortete zusätzlich auf eine Frage zu Apples nächstem iPad Pro, indem er sagte, es sei &quot;auch [für] März eingestellt, soweit ich weiß&quot;. </p> <p> Während Prosser sich schon einmal geirrt hat, hat er insgesamt eine beeindruckende Bilanz, wenn es um genaue Apple-Ankündigungen geht. Werden die AirTags und das iPad Pro der nächsten Generation darunter sein? Es dauert nicht lange, bis wir es erfahren. </p> <p> <small> Bildquelle: iphonedigital/ <a href=\"https://www.flickr.com/photos/137872055@N03/22522566994/\" target=\"_blank\" rel=\"nofollow noopener\"> Flickr </a></small> </p>"}