{"title":"LastPass beschränkt Sie auf einen Gerätetyp, es sei denn, Sie bezahlen","content":"<p> LastPass, der beliebte Passwort-Manager, befindet sich im Umbruch. Bald können diejenigen, die den Dienst kostenlos nutzen, dies nur auf Computern oder Handys tun, aber nicht beides – es sei denn, sie zahlen. </p> <p> Das bedeutet, dass LastPass als kostenloser Passwort-Manager keine attraktive Wahl mehr ist. In einer Welt, in der wir ständig zwischen Computern und Mobiltelefonen wechseln, ist ein Passwort-Manager, der nur für einen Gerätetyp funktioniert, nutzlos. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> Was ändert sich in LastPass Free? </h2> <p> Wie am . angekündigt <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> LastPass-Blog </a> , für die kostenlose Version des Passwort-Managers sind Änderungen im Gange. </p> <p> Derzeit können Sie den Dienst mit LastPass Free auf allen Ihren Geräten nutzen. Ob Sie LastPass auf Ihrem Computer, Tablet oder Mobilgerät verwenden, spielt keine Rolle. All das ist kostenlos. Das soll sich am 16.03.2021 ändern. </p> <p> Ab diesem Zeitpunkt umfasst LastPass Free nur noch eine unbegrenzte Anzahl von Geräten eines Typs: Computer oder Mobiltelefone. </p> <p> Für LastPass werden Computer als Desktops oder Laptops eingestuft, während Mobiltelefone Mobiltelefone, Tablets und Smartwatches sind. </p> <p> Wenn Sie sich am 16. März zum ersten Mal bei LastPass anmelden, müssen Sie Ihren aktiven Gerätetyp festlegen. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> Wenn Sie beispielsweise Computer als Gerätetyp auswählen, können Sie LastPass auf Ihren Desktop- und Laptop-Geräten verwenden. Wenn Sie LastPass jedoch auf einem beliebigen Mobilgerät verwenden möchten, müssen Sie auf LastPass Premium aktualisieren. </p> <p> In gewisser Weise kehrt dies zum alten LastPass zurück. Die kostenlose Nutzung von LastPass auf Desktop- und Mobilgeräten wurde erst im Jahr 2015 verfügbar. Zuvor mussten Sie für den mobilen Support bezahlen. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> Der LastPass-Support ändert sich ebenfalls </h2> <p> LastPass ändert auch die Art und Weise, wie es Support bietet. Ab dem 17. Mai 2021 steht der E-Mail-Support nur noch Premium- und Family-Kunden zur Verfügung. </p> <p> Benutzer der kostenlosen Version bleiben bei den Hilfeartikeln hängen, die auf der LastPass-Support-Website verfügbar sind, oder sie können innerhalb der LastPass-Community um Hilfe bitten. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> Jeder sollte einen Passwort-Manager verwenden </a> . Die Chancen stehen gut, dass Sie es auf dem Desktop und auf dem Handy verwenden müssen. LastPass weiß dies und setzt darauf, dass Benutzer auf den kostenpflichtigen Dienst upgraden, der derzeit für 27 US-Dollar pro Jahr 25 % günstiger ist. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> Ist es an der Zeit, den Passwort-Manager zu ändern? </h2> <p> Wenn Sie LastPass Free verwenden, haben Sie wahrscheinlich einen Wechsel in Betracht gezogen. Wenn ja, gibt es viele andere großartige Passwort-Manager, die Sie auf all Ihren Geräten kostenlos verwenden können. </p> <p> Andererseits denken Sie vielleicht, dass es fair ist, einen kleinen Betrag an LastPass zu zahlen, um den von ihm bereitgestellten Service zu unterstützen. </p>"}