{"title":"Microsoft führt Azure mit dem Spaceborne Computer-2 von HPE in den Weltraum ein","content":"<p> Microsoft greift über den Rand des Planeten hinaus, um außerirdische Dienste bereitzustellen. Das Unternehmen wird mit Hewlett Packard Enterprises zusammenarbeiten, um über seine Azure-Plattform eine Verbindung zu einem PC auf der Internationalen Raumstation (ISS) herzustellen. </p> <p> Der Spaceborne Computer-2 wird über NASA- und HPE-Bodenstationen mit Azure verbunden und liefert der Raumstation eine große Datenverarbeitungsleistung. </p> <h2 id=\"azure-heads-into-space\"> Azure Köpfe in den Weltraum </h2> <p> Wie berichtet <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> das Microsoft Azure-Blog </a> , wird der Spaceborne Computer-2 (SBC-2) die ISS-Astronauten mit Technologien versorgen, die ihren terrestrischen Gegenstücken ähnlicher sind. </p> <p> Die Hoffnung ist, dass es die Zeit für die Datenübertragung zwischen der ISS und der Erde drastisch verkürzt und die für die Verarbeitung und Analyse erforderliche Bandbreite reduziert. </p> <blockquote> <p> Astronauten und Weltraumforscher verdienen Zugang zu den besten Cloud-Computing-Technologien und fortschrittlicher Verarbeitung auf höchstem Niveau. Manchmal muss die Analyse sofort am Edge durchgeführt werden, wo jeder Moment zählt, und manchmal ist die Analyse so komplex, dass sie nur mit der Leistung der Hyperscale-Cloud durchgeführt werden kann. </p> </blockquote> <p> Der Spaceborne Computer-2 verwendet das Edgeline Converged Edge-System von Hewlett Packard Enterprises, das &quot;absichtlich für raue Edge-Umgebungen entwickelt wurde&quot; und jede Menge Azure-Funktionen auf die ISS bringen wird. </p> <p> Wenn die Verbindung hergestellt ist, wird der SBC-2 Forschungen in Bereichen wie Wettermodellierung für zukünftige Marsmissionen, Pflanzen- und Hydrokulturanalysen zur Unterstützung des Nahrungs- und Pflanzenwachstums im Weltraum sowie medizinische Bildgebung auf der ISS selbst (zur Unterstützung der Astronautengesundheit ). </p> <p> Dr. Mark Fernandez, Lösungsarchitekt von Converged Edge Systems bei HPE und Principal Investigator für Spaceborne Computer-2, sagte: </p> <blockquote> <p> Durch die Zusammenführung des Spaceborne Computer-2 von HPE, der auf dem HPE Edgeline Converged Edge-System für fortschrittliches Edge-Computing und KI-Funktionen basiert, mit Microsoft Azure zur Verbindung mit der Cloud, ermöglichen wir Weltraumforschern die nahtlose Übertragung großer Datensätze von und zu Earth und profitieren Sie von einer Edge-to-Cloud-Erfahrung </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> Die nächste Phase der Azure Space Initiative von Microsoft </h2> <p> Die Ankündigung von Microsoft ist ein weiterer Schritt nach vorne für seine <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Azure Space </a> Initiative, die sie im Oktober 2020 ins Leben gerufen hat. </p> <p> Die Azure Space-Initiative ist Microsofts Bemühen, „den nächsten großen Sprung im Cloud Computing“ zu machen und seine Azure Cloud Computing-Plattform in den Weltraum zu bringen. </p> <p> </p> <p> Azure Space hat zuvor mit dem SpaceX Starlink-Projekt zusammengearbeitet, um Satellitenbreitband für sein Azure Modular Datacenter (MDC) bereitzustellen, und setzt seine Arbeit am Azure Orbital-Projekt fort, das die Konnektivität zwischen seinen Cloud-Rechenzentren mithilfe von Satellitentechnologie erweitern wird. </p>"}