{"title":"Microsoft hat versucht, Pinterest zu kaufen, aber der Deal ist aus ... vorerst","content":"<p> Microsoft wandte sich kürzlich an Pinterest wegen einer möglichen Übernahme, die eine der größten Akquisitionen Redmonds aller Zeiten gewesen wäre. Derzeit sind die Gespräche nicht aktiv, aber das Ausmaß der geplanten Fusion markiert die Wachstumspläne von Microsoft weiter. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft möchte Pinterest kaufen </h2> <p> Wie von der . berichtet <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Financial Times </a> , hat Microsoft versucht, Pinterest, die weltweit größte Hobby-Pinnwand, zu kaufen. </p> <p> Pinterest wird derzeit auf rund 51 Milliarden US-Dollar geschätzt, und sein Marktwert ist während der COVID-19-Pandemie um mehr als 600 Prozent gestiegen, da die Menschen während der Sperrung online gehen. Die bevorstehenden Nachrichten über die Übernahme ließen die Aktie von Pinterest um 7 Prozent steigen, bevor die Märkte am Donnerstag, den 11. Februar, eröffneten. </p> <p> Der Umzug hätte Pinterest in den ständig wachsenden Stall von großen Technologieakquisitionen von Microsoft gebracht. Im Jahr 2016 erwarb Microsoft LinkedIn im Rahmen eines 26-Milliarden-Dollar-Deals, gefolgt vom Kauf von Github für 7,5 Milliarden US-Dollar im Jahr 2018. </p> <p> Ganz zu schweigen davon, dass Microsoft Minecraft besitzt, das 2014 2,5 Milliarden US-Dollar gekauft hat, und die laufende Übernahme der großen Gaming-Holdinggesellschaft ZeniMax für 7,5 Milliarden US-Dollar. ZeniMax ist die Muttergesellschaft von Spielestudios wie Bethesda Softworks, id Software, Alpha Dog Games und Tango Gameworks. </p> <p> Außerdem gab es a <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> fehlgeschlagener Versuch, TikToks zu kaufen </a> Nordamerikanische, australische und neuseeländische Vermögenswerte Mitte 2020. Der Deal scheiterte letztendlich, hatte aber einen Wert zwischen 20 und 30 Milliarden US-Dollar und kam nach dem ehemaligen Präsidenten <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Trump drohte mit Verbot </a> das soziale Video-Sharing-Netzwerk aus den USA vollständig. </p> <p> Wenn der Pinterest-Deal zustande gekommen wäre oder zu einem späteren Zeitpunkt abgeschlossen wird, wird es die bisher größte Akquisition von Microsoft. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> Warum kauft Microsoft so viele Technologieunternehmen auf? </h2> <p> Microsoft mangelt es nicht an Geld und will sein Imperium erweitern. Die eigene Aktie ist seit Beginn der COVID-19-Pandemie um rund 80 Prozent gestiegen und hat kürzlich rekordverdächtige Gewinne vermeldet. </p> <p> </p> <p> Der Erwerb einer anderen Plattform, wie Pinterest, ist ein Ticket zu Daten für andere Dienste von Microsoft. Die schiere Menge an Daten, die von Plattformen wie LinkedIn generiert werden, ist das perfekte Werkzeug, um ihre KI-Technologien zu trainieren. Darüber hinaus dient die Übernahme und Verwaltung eines riesigen Online-Dienstes wie Pinterest auch als Werbung für seine Azure-Plattform. </p> <p> Wie der Bericht der Financial Times auch anspielt, würde die Rede von einer so enormen Fusion zwischen zwei Technologieunternehmen auch die Regierung von Präsident Biden auf die Probe stellen. Erlaubt die neue Regierung Tech-Giganten wie Microsoft, Google und Facebook, die Konkurrenz aufzukaufen? Nur die Zeit kann es verraten. </p>"}