{"title":"Möglicherweise erhalten Sie das neue Microsoft Teams Pro kostenlos","content":"<p> Vor einiger Zeit haben wir einen geplanten Abonnementdienst für Microsoft Teams namens &quot;Teams Pro&quot; behandelt, der zusätzliche Funktionen für die Software freischalten wird. Microsoft hat dann jedoch zu Protokoll gegeben, dass einige Leute Teams Pro ohne zusätzliche Kosten zu ihren aktuellen Plänen erhalten werden. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Erklärung von Microsoft zu kostenlosen Teams-Pro-Abonnements </h2> <p> Falls Sie eine Erinnerung benötigen, haben wir dieses Thema bereits in unserem Beitrag über . behandelt <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro, das dem Dienst Webinare hinzufügt </a> . </p> <p> Nun ein Artikel von <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> zum gleichen Thema hat inzwischen eine Stellungnahme von Microsoft erhalten. Die Aussage ist eine gute Nachricht für Leute, die sich Sorgen machen, für Webinare extra zu bezahlen: </p> <blockquote> <p> Am 9. Februar haben wir einen MC-Beitrag zu einem neuen Teams Pro-Serviceplan veröffentlicht. Zur Verdeutlichung: Es gibt keine Änderung an bestehenden Produktlizenzen durch das Hinzufügen dieses neuen Serviceplans. Stattdessen wird der Serviceplan automatisch zu Microsoft 365- und Office 365 E5/E3/A5/A3- und Microsoft 365 Business Standard/Business Premium-Lizenzen hinzugefügt und ermöglicht Benutzern, die für diese SKUs lizenziert sind, automatisch die Bereitstellung von Funktionen für Mannschaften in naher Zukunft. </p> </blockquote> <p> Microsoft führt weiter aus, dass Administratoren nichts tun müssen, um diese neuen Funktionen zu aktivieren. Außerdem erhält jeder mit einer kompatiblen Lizenz wie oben aufgeführt diese glänzenden neuen Funktionen ohne zusätzliche Kosten. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Mehr für dasselbe mit Microsoft Teams </h2> <p> Microsoft führt einen neuen Teams Pro-Abonnementplan ein, der Webinare und mehr freischaltet, aber nicht jeder muss dafür extra bezahlen. Wenn Sie eine der oben genannten Lizenzen abonniert haben, können Sie sich darauf freuen, alle Teams Pro-Funktionen ohne Aufpreis zu erhalten. </p> <p> Das soll nicht heißen, dass Menschen ohne Teams Pro im Schatten stehen bleiben. Zum Beispiel wird jeder bald Zugriff auf eine praktische Zusammenfassungsfunktion in Microsoft Teams haben. </p> <p> <small> Bildquelle: Postmodern Studio / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}