{"title":"Microsoft veröffentlicht seine neue Office-App für das iPad","content":"<p> Microsoft hat seine einheitliche Office-App für das Apple-Tablet veröffentlicht. Damit stehen Word, Excel und PowerPoint jetzt als einzelner Download auf dem iPhone und iPad im <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> Appstore </a> . Microsoft bietet diese iPad-Apps weiterhin als eigenständige Downloads an. </p> <h2 id=\"better-late-than-never\"> Besser spät als nie </h2> <p> „Wir kombinieren die bekannten Word-, Excel- und PowerPoint-Apps in einer einzigen, iPadOS-optimierten App“, schrieb Microsoft in den Versionshinweisen zum Download. Dies sind großartige Neuigkeiten, wenn Sie Office verwenden und unterwegs arbeiten möchten. Für diejenigen, die es suchen <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> Verwandeln Sie ihr iPad in einen Laptop-Ersatz </a> , dies ist eine entscheidende Veröffentlichung. </p> <p> Die Apps stehen kostenlos zur Verfügung, für die Bearbeitung und andere erweiterte Funktionen ist jedoch ein Office 365-Abonnement erforderlich. Für diejenigen, die sich fragen, bietet Microsoft verschiedene In-App-Abonnementoptionen ab 6,99 USD pro Monat. </p> <p> Wenn Sie nur ein Textverarbeitungsprogramm auf Ihrem iPad benötigen, ist es möglicherweise eine bessere Idee, Alternativen in <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> MUOs Zusammenfassung der besten Textverarbeitungs-Apps für das iPad </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> Ein einheitliches mobiles Office-Erlebnis </h2> <p> Um es klarzustellen, dies ist ein Update für das vorhandene Office für iOS, keine brandneue Version. Das <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> All-in-One-Office-App debütierte auf dem iPhone </a> und Android im Februar 2020. Es ist unklar, warum Microsoft ein ganzes Jahr gebraucht hat, um iPad-optimierte Versionen von Word, Excel und PowerPoint in den Mix aufzunehmen, aber besser spät als nie. </p> <p> </p> <p> Bis heute boten die in der Suite enthaltenen Produktivitäts-Apps ein unterdurchschnittliches Erlebnis auf dem iPad, da sie früher im Fenstermodus ausgeführt wurden. Aber mit dem neuesten Update, das jetzt verfügbar ist, können Apple-Kunden jetzt unabhängig von der Bildschirmgröße die native Office-Erfahrung auf ihrem iPhone, iPad oder iPod touch nutzen. </p> <p> </p> <h2 id=\"ipad-specific-features\"> iPad-spezifische Funktionen </h2> <p> Microsoft erweitert seine mobilen Office-Angebote regelmäßig um neue, Tablet-optimierte Funktionen. Beispielsweise haben mobile Versionen von Word, Excel und PowerPoint kürzlich die Unterstützung für Maus- und Trackpad-Gesten aufgenommen. Die Apps unterstützen auch die Side-by-Side-Multitasking-Funktion Split View von iOS. </p> <p> Während die Mobil- und Desktop-Versionen von Office nicht über dieselben Funktionen verfügen, bietet das neue Office für iOS einige neue Funktionen. Damit können Sie beispielsweise Dokumente mit Ihrem Apple Pencil oder Finger unterschreiben, schnell PDFs aus Ihren Dokumenten erstellen, Bilder in Text und Tabellen konvertieren und so weiter. </p> <p> </p> <p> Außerdem können Sie jetzt ganz einfach Datum, Form, Bild und Notizen in PDFs einfügen. Power-User können jetzt über das Mehrzweck-Freigabemenü von iOS auf die bildbasierten Aktionen von Office (wie PPT erstellen, PDF erstellen und mehr) zugreifen. „Außerdem werden aktuelle Screenshots beim Öffnen der Office-App als Vorschlag zur Konvertierung in PDF oder PPT angezeigt“, stellt das Unternehmen fest. </p> <p> Microsoft wird auch einige Änderungen an seiner Office-Suite für Mac und Windows vornehmen. Nach Angaben des Windows-Herstellers werden die kommenden Updates für Office für Desktop im Jahr 2021 neben anderen Verbesserungen unbefristete Lizenzen enthalten. </p>"}