{"title":"Nintendo bestätigt nächsten Nintendo Direct Showcase","content":"<p> Nintendo hat Details zur nächsten Nintendo Direct-Präsentation veröffentlicht, und Sie müssen nicht lange auf Neuigkeiten vom Mario-Ersteller warten. </p> <h2 id=\"nintendo-direct-reveals-forthcoming-presentation-date\"> Nintendo Direct gibt das bevorstehende Präsentationsdatum bekannt </h2> <p> Möchten Sie wissen, was Nintendo für das kommende Jahr geplant hat? In diesem Fall müssen Sie das nächste Nintendo Direct-Showcase einschalten und es von ihnen hören. </p> <p> Das nächste Nintendo Direct findet am 17. Februar statt, wie in einem Tweet von Nintendo of America bestätigt. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Schalten Sie am 17.02. um 14:00 Uhr ein. PT für a <a href=\"https://twitter.com/hashtag/NintendoDirect?src=hash&ref_src=twsrc%5Etfw\"> #NintendoDirect </a> Livestream mit etwa 50 Minuten Informationen zu verfügbaren Spielen wie Super <a href=\"https://twitter.com/hashtag/SmashBrosUltimate?src=hash&ref_src=twsrc%5Etfw\"> #SmashBrosUltimate </a> und Spiele kommen zu <a href=\"https://twitter.com/hashtag/NintendoSwitch?src=hash&ref_src=twsrc%5Etfw\"> #NintendoSwitch </a> im ersten Halbjahr 2021. <a href=\"https://t.co/fbG3hEtD0Q\"> https://t.co/fbG3hEtD0Q </a> <a href=\"https://t.co/w8J6lbdIkQ\"> pic.twitter.com/w8J6lbdIkQ </a></p> — Nintendo of America (@NintendoAmerica) <a href=\"https://twitter.com/NintendoAmerica/status/1361676737730519042?ref_src=twsrc%5Etfw\"> 16. Februar 2021 </a></blockquote>  <p> Wenn Sie die neuesten Nachrichten von Nintendo haben möchten, dann schalten Sie die <a href=\"https://www.nintendo.com/nintendo-direct/02-17-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> Nintendo Direct-Seite auf nintendo.com </a> , ab 17:00 Uhr ET (14:00 Uhr PT, 22:00 Uhr GMT). </p> <p> </p> <h2 id=\"what-will-nintendo-reveal-at-nintendo-direct\"> Was wird Nintendo bei Nintendo Direct verraten? </h2> <p> Was Nintendo für eine Ankündigung im Ärmel hat, lässt sich generell nicht sagen. Es wird wahrscheinlich eine Menge Spielnachrichten geben, insbesondere da das Zelda-Franchise kurz vor seinem 35-jährigen Jubiläum steht. </p> <p> Angesichts dessen <a href=\"https://www.makeuseof.com/nintendo-switch-bestselling-console-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> Switch und Switch Lite sind in den USA äußerst beliebte Konsolen </a> , werden sich die Nachrichten wahrscheinlich auf diese aktuellen Konsolen und die für sie verfügbaren Titel konzentrieren. </p> <p> Wenn Sie auf eine Ankündigung zur nächsten Switch-Konsole hoffen, dann dürfen Sie nicht die Luft anhalten. Nintendo ist bezüglich der Zukunft der Switch-Konsole und der Frage, ob eine neue in Sicht ist, entschlossen geblieben. </p> <p> </p> <h2 id=\"keep-up-to-date-with-nintendo-news\"> Bleiben Sie mit Nintendo-News auf dem Laufenden </h2> <p> <img alt=\"Nintendo Switch Family Membership Header\" src=\"images/nintendo-switch-family-header-378.jpg\" loading=\"lazy\"> </p> <p> Nintendo Direct ist Nintendos Weg, seiner treuen Fangemeinde die aktuellsten Neuigkeiten über die Marke zu übermitteln. Egal, ob Sie eine Switch, Switch Lite oder sogar eine ganze Sammlung von Nintendo-Konsolen haben, stellen Sie sicher, dass Sie einschalten. </p>"}