{"title":"Parler kommt nach einem monatelangen Shutdown wieder online","content":"<p> Nachdem er von Big Tech ausgeschlossen wurde, ist Parler endlich wieder im Web aufgetaucht. Die Plattform &quot;Freie Rede&quot; ist jetzt für bestehende Benutzer zugänglich und wird in den kommenden Wochen bald neue Benutzerregistrierungen annehmen. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler taucht nach Big Tech Blackout wieder auf </h2> <p> Parler hat nach einem langen Blackout ein Comeback gefeiert. Das alternative soziale Netzwerk hat bei politischen Konservativen an Zugkraft gewonnen und war <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> gebootet von Amazon Web Services (AWS), Google und Apple </a> nach den Kapitol-Unruhen. Parler wurde vorgeworfen, nicht genug getan zu haben, um gewalttätige Inhalte zu moderieren, was dazu führte, dass sie aus App-Stores und aus dem Web entfernt wurden. </p> <p> Anstelle von AWS verwendet Parler jetzt einen Host namens SkySilk. Die Site registrierte ihren Domainnamen auch bei Epik, einem Registrar, der andere Arten von Netzwerken der &quot;freien Rede&quot; wie Gab betreut. </p> <p> Ein neuer Host- und Domain-Registrar sind nicht die einzigen Änderungen, die Parler vorgenommen hat – Parler ist sogar mit einem neuen Interims-CEO wieder aufgetaucht. Das kommt danach <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> das Parler-Team soll Mitbegründer John Matze gefeuert haben </a> . </p> <p> Mark Meckler wird Matze vorübergehend als CEO ersetzen und war zuvor Mitbegründer der rechten Tea Party Patriots-Gruppe. In einer Erklärung erhalten von <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> Der Hügel </a> , Meckler kündigte Parlers lang erwartete Rückkehr an und sagte: </p> <blockquote> <p> Als Parler im Januar von denen, die zig Millionen Amerikaner zum Schweigen bringen wollten, offline genommen wurde, kam unser Team zusammen, entschlossen, unser Versprechen an unsere engagierte Gemeinschaft zu halten, dass wir stärker denn je zurückkehren würden. Wir freuen uns, alle wieder begrüßen zu dürfen. </p> </blockquote> <p> Meckler fuhr fort und stellte fest, dass Parler sich weiterhin der &quot;Redefreiheit, der Privatsphäre und dem zivilen Dialog&quot; widmen werde. Er versicherte den Benutzern auch, dass &quot;Parler von einem erfahrenen Team geleitet wird und bleiben wird.&quot; </p> <p> Obwohl ältere Konten auf der Plattform gesichert sind, wurden ältere Beiträge (oder &quot;Verhandlungen&quot;) nicht wiederhergestellt. Wenn Sie bereits ein Konto bei Parler haben, können Sie die Site weiterhin nutzen. Andernfalls müssen Sie etwa eine Woche warten, bis Sie sich anmelden können. </p> <p> Aber selbst wenn Sie bereits ein Parler-Konto haben, können bei der Nutzung der Plattform einige technische Schwierigkeiten auftreten. Es scheint, als ob der Dienst noch nicht vollständig wiederhergestellt wurde. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> Die Parler-App bleibt immer noch im Limbo </h2> <p> Parler ist immer noch aus dem Google Play Store und dem Apple App Store verbannt, was seiner Benutzerbasis ernsthaft schaden könnte. So wie es aussieht, könnte die Plattform für eine unbekannte Zeit auf mobilen Geräten nicht verfügbar bleiben. </p> <p> Es kann wahrscheinlich nicht zum Play Store oder App Store zurückkehren, es sei denn, es ändert seine Moderationsrichtlinien, was Parler wahrscheinlich ablehnen wird. </p>"}