{"title":"PS4-Controller funktioniert nicht? So beheben Sie die häufigsten Probleme","content":"<p> Die meiste Zeit funktioniert Ihr PlayStation 4-Controller wahrscheinlich einwandfrei. Aber wenn Ihr DualShock 4 keine Verbindung mehr herstellt oder sich zufällig trennt, ist das frustrierend. </p> <p> Sehen wir uns die Fehlerbehebungen an, wenn Ihr PS4-Controller nicht funktioniert, damit Sie wieder spielen können. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> PS4-Controller lässt sich nicht koppeln oder verbinden </h2> <p> Normalerweise, wenn Sie die <strong> PS-Taste </strong> auf Ihrem Controller sollte es sich einschalten und mit Ihrem System verbinden. Wenn jedoch keine Verbindung hergestellt wird, sehen Sie stattdessen, dass die Lichtleiste auf Ihrem Controller für eine Weile blinkt und dann ausgeschaltet wird. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Dies geschieht normalerweise, wenn Sie Ihren DualShock 4 mit einem anderen Gerät verwendet haben. Zum Beispiel, wenn Sie <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> Koppeln Sie Ihren PS4-Controller mit Ihrem PC </a> oder die Konsole eines Freundes, wird sich dieses Gerät in Zukunft merken. </p> <p> In diesen Fällen müssen Sie Ihren DualShock 4 erneut mit Ihrer eigenen PS4 koppeln. Verbinden Sie dazu Ihren Controller über ein Micro-USB-Kabel mit Ihrer PS4. Stellen Sie sicher, dass Sie ein hochwertiges Kabel verwenden, von dem Sie wissen, dass es ordnungsgemäß funktioniert. </p> <p> </p> <p> Drücken Sie die <strong> PS-Taste </strong> auf Ihrem Controller für einen Moment und das Licht sollte kurz aufleuchten, bevor es blau wird. Dies bedeutet, dass Ihr Controller erfolgreich gekoppelt und verbunden wurde. </p> <p> Wenn Sie Ihren DualShock 4 mit einem anderen Gerät in der Nähe gekoppelt haben, z. Sie sollten daher das Gerät, mit dem Ihr DualShock 4 zuerst verbunden ist, ausschalten und trennen. </p> <p> Nachdem Sie Ihren Controller erneut gekoppelt haben, können Sie das USB-Kabel trennen und Ihren Controller wie gewohnt drahtlos verwenden. Ihre PS4 wird sich daran erinnern, bis Sie den Controller in Zukunft mit einem anderen Gerät koppeln. </p> <p> Denken Sie daran, dass die maximale Anzahl von DualShock 4-Controllern, die Sie gleichzeitig mit der PS4 verbinden können, vier beträgt. Wenn Sie bereits vier Controller angeschlossen haben, müssen Sie einen trennen, um Platz für weitere zu schaffen. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> PS4-Controller trennt sich ständig </h2> <p> Wenn Ihr DualShock 4 während des Spielens zufällig die Verbindung trennt, können Sie einige Abhilfemaßnahmen ausprobieren. </p> <p> Stellen Sie zunächst sicher, dass die Batterie Ihres Controllers aufgeladen ist. Es klingt einfach, aber wenn die Batterie in Ihrem Controller fast leer ist, kann er sich trennen. Um die Akkulaufzeit Ihres Controllers zu überprüfen, halten Sie die <strong> PS-Taste </strong> um das Quick-Menü auf der linken Seite des Bildschirms aufzurufen. Unten sehen Sie ein Controller-Symbol mit Batterieanzeige. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Schließen Sie Ihren Controller an Ihre PS4 an und besuchen Sie das Quick-Menü erneut, um sicherzustellen, dass Sie die Animation zum Laden des Akkus sehen. Nachdem Ihr Controller einige Zeit aufgeladen wurde, versuchen Sie, ihn wie gewohnt zu verwenden. </p> <p> Wenn der Akku nicht Ihr Problem war, stellen Sie sicher, dass Sie Ihren Controller nicht zu weit von Ihrem System entfernt verwenden. Die typische Bluetooth-Reichweite beträgt etwa 9 m; Abhängig von Ihrem Setup können Sie Ihren Controller möglicherweise weiter verwenden oder darauf beschränkt sein, ihn näher zu verwenden. </p> <p> Apropos, Sie sollten versuchen, Interferenzen zwischen Ihrem Controller und der Konsole zu minimieren. Entfernen Sie alle Metallgegenstände zwischen den beiden, wie Regale oder Laptops, die das Signal behindern könnten. Sie sollten Ihre PS4 auch aus einem geschlossenen Raum nehmen, um die Signalübertragung und den Empfang zu verbessern. </p> <p> Denken Sie schließlich daran, dass die PS4 eine Einstellung hat, die Controller ausschaltet, nachdem sie einige Zeit inaktiv waren. Wenn Sie nicht möchten, dass sich Ihr PS4-Controller ausschaltet, wenn Sie Medien-Apps wie YouTube ansehen, gehen Sie zu <strong> Einstellungen &gt; Energiespareinstellungen &gt; Zeit bis zum Ausschalten der Controller einstellen </strong> und wähle <strong> noch nie </strong> . Beachten Sie, dass dies den Akku auch im Leerlauf verbraucht. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> Allgemeine Tipps zum Reparieren eines PlayStation 4-Controllers </h2> <p> Wir haben uns oben spezifische Fixes für einige häufige DualShock 4-Probleme angesehen. Sehen wir uns als Nächstes allgemeinere Lösungen für Probleme mit PS4-Controllern an. Gehen Sie diese durch, wenn Sie weitere Hilfe benötigen. </p> <h3 id=\"restart-your-console\"> 1. Starten Sie Ihre Konsole neu </h3> <p> Während die meisten Controller-Probleme vom Controller selbst herrühren, besteht die Möglichkeit, dass Ihre PS4 das Problem hat. Um dies auszuschließen, sollten Sie Ihre Konsole neu starten, bevor Sie die Fehlerbehebung fortsetzen. </p> <p> Wenn Ihr Controller ausreichend funktioniert, um auf Menüs zuzugreifen, halten Sie die <strong> PS-Taste </strong> um das Quick-Menü zu öffnen, dann gehe zu <strong> Power &gt; PS4 neu starten </strong> um Ihr System neu zu starten. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> Falls Ihr Controller nicht kooperiert, halten Sie die <strong> Leistung </strong> Taste auf deiner PS4-Konsole, bis du zwei Pieptöne hörst. Dadurch wird es vollständig heruntergefahren (keine Lichter auf der Vorderseite) – sobald es ausgeschaltet ist, drücken Sie die <strong> Leistung </strong> erneut, um es wieder einzuschalten. </p> <p> Versuchen Sie, Ihren Controller nach einem Neustart erneut zu verwenden, und sehen Sie, ob das hilft. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. Vergessen Sie Ihren PS4-Controller und koppeln Sie ihn erneut </h3> <p> Wenn Sie einen zweiten PS4-Controller (oder einen PS Move-Controller) haben, können Sie damit auf ein Menü zugreifen, mit dem Sie den Controller mit einem Problem entfernen können. Gehen Sie zu <strong> Einstellungen &gt; Geräte &gt; Bluetooth-Geräte </strong> und wählen Sie die <strong> DualShock 4 </strong> Eintrag - es ist derjenige, der kein grünes Licht daneben hat. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> Drücken Sie im angezeigten Menü die <strong> Optionen </strong> Taste auf deinem Controller und wähle <strong> Gerät vergessen </strong> . Dies führt dazu, dass Ihre PS4 sie aus dem Speicher entfernt, sodass Sie sie erneut koppeln müssen. </p> <p> Dies ist ein guter Zeitpunkt, um eine etwas andere Kopplungsmethode auszuprobieren: Beim Start erneut koppeln. Schalten Sie dazu Ihre PS4 aus (wie zuvor beschrieben). Verbinden Sie den problematischen Controller nach dem Herunterfahren mit einem USB-Kabel mit Ihrer Konsole. Hit the <strong> PS-Taste </strong> um Ihren Controller hoffentlich in einem Vorgang einzuschalten und zu koppeln. </p> <p> Wenn dies nicht funktioniert, schalten Sie Ihre PS4 wieder ein und versuchen Sie, sie wie oben beschrieben zu koppeln. </p> <h3 id=\"hard-reset-your-controller\"> 3. Hard-Reset Ihres Controllers </h3> <p> Wenn das Entfernen und erneute Koppeln des Controllers nicht funktioniert hat, können Sie als nächstes den vollständigen Reset-Vorgang für den DualShock 4 versuchen. Dazu benötigen Sie einen kleinen spitzen Gegenstand, wie eine gebogene Büroklammer oder ein Werkzeug zum Auswerfen der SIM-Karte . </p> <p> Schalten Sie Ihre PS4 aus und drehen Sie dann Ihren Controller um. Sie sehen ein kleines Loch neben der Schraube beim L2-Knopf (auf der rechten Seite des Controllers, wenn er umgedreht wird). Verwenden Sie Ihr spitzes Werkzeug, um den Knopf in diesem Loch etwa fünf Sekunden lang zu drücken und zu halten. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> Wenn Sie dies getan haben, verbinden Sie Ihren Controller erneut über ein USB-Kabel mit Ihrer PS4 und prüfen Sie, ob er erfolgreich gekoppelt wird. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Versuchen Sie den Controller woanders </h3> <p> An dieser Stelle sollten Sie, falls noch nicht geschehen, versuchen, den Controller zu verwenden, der Probleme mit einem anderen Gerät hat. Wenn Sie ähnliche Probleme mit der PS4 eines Freundes oder Ihrem PC haben, ist Ihr Controller wahrscheinlich defekt. </p> <p> Es ist auch eine gute Idee, wenn möglich, einen anderen PS4-Controller mit Ihrer Konsole auszuprobieren. Wenn Sie den DualShock 4 eines Freundes ausleihen, von dem Sie wissen, dass er ordnungsgemäß funktioniert, und feststellen, dass er Probleme mit Ihrem System hat, stimmt wahrscheinlich etwas mit der drahtlosen Konnektivität Ihrer PS4 nicht. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Verwenden Sie den Controller im kabelgebundenen Modus </h3> <p> Bevor Sie den Controller aufgeben, sollten Sie versuchen, mit ihm dauerhaft über ein USB-Kabel zu spielen. Beachten Sie jedoch, dass dies nur für das überarbeitete Modell der PS4-Controller funktioniert. Sie wissen, dass Sie dieses Modell besitzen, wenn sich im Touchpad auf der Vorderseite Ihres Controllers eine Lichtleiste befindet. Wenn nicht, können Sie die kabelgebundene Kommunikation nicht erzwingen. </p> <p> Wenn Sie noch keins haben, kaufen Sie ein langes Kabel, damit Sie weiterhin von der Couch aus spielen können. Das <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Ailun Dreierpack </a> von 10 Fuß Micro-USB-Kabeln ist eine gute kostengünstige Option. </p> <p> Um deine PS4 zu zwingen, Controller über USB zu verbinden, gehe zu <strong> Einstellungen &gt; Geräte &gt; Controller &gt; Kommunikationsmethode </strong> und wähle <strong> Verwenden Sie ein USB-Kabel </strong> . Dadurch wird verhindert, dass der DualShock 4 Bluetooth verwendet, auch wenn er über USB verbunden ist. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> DualShock 4 Hardware-Fix-Optionen </h2> <p> Wie die meisten Hardware haben auch DualShock 4-Controller eine einjährige Garantie. Wenn Sie Ihren PS4-Controller innerhalb des letzten Jahres gekauft haben und ihn mit all den oben genannten Tipps nicht reparieren können, sollten Sie . besuchen <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> Fix &amp; Replace-Seite von PlayStation </a> um einen Reparaturantrag für Ihren Controller zu stellen. </p> <p> Andernfalls können Sie selbst versuchen, Hardwarekorrekturen durchzuführen, indem Sie Ihren Controller öffnen. Aber je nach Problemstellung kann dies schwierig oder unmöglich sein. Wir empfehlen, mit einem lokalen Reparaturtechniker zu sprechen, wenn Sie sich nicht wohl dabei fühlen, dies selbst zu tun. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> Probleme mit dem PS4-Controller, gepatcht </h2> <p> Jetzt wissen Sie, wie Sie die häufigsten Probleme mit dem PS4-Controller beheben können. Spezifischere Probleme, wie z. B. eine nicht mehr funktionierende Schaltfläche, fallen leider unter die oben genannten Hardware-Fix-Lösungen. </p> <p> Hoffentlich war Ihr Problem leicht zu beheben. Aber wenn nicht, und Sie einen neuen PS4-Controller benötigen, haben Sie viele großartige Optionen. </p> <p> <small> Bildquelle: Joeri Mostmans/ <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}