{"title":"Roku möchte Ihre Gedanken zu seiner wiederaufladbaren Fernbedienung","content":"<p> Roku rekrutiert einige Leute für sein Early-Access-Programm, um eine neue Fernbedienung (die sogenannte Roku Voice Remote Pro) mit wiederaufladbarem Akku zu testen. </p> <p> Es ist ein zeitlich begrenztes Angebot, solange der Vorrat reicht, aber Sie müssen trotzdem für die Fernbedienung bezahlen. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> Was ist die Roku-Sprachfernbedienung Pro? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> Endlich eine Fernbedienung mit Akku </a> von <a href=\"https://www.reddit.com/r/Roku/\"> Roku </a> </blockquote>  <p> Als erstes entdeckt von Benutzer Kingtut206 auf <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , rekrutiert Roku Leute für sein Early-Access-Programm, um eine neue Fernbedienung namens Roku Voice Remote Pro zu testen. </p> <p> Die neue Fernbedienung verfügt über eine wiederaufladbare Batterie, einen verlorenen Fernbedienungsfinder (z. B. können Sie &quot;Hey Roku, finde meine Fernbedienung&quot; sagen), eine Freisprechfunktion und persönliche Kurzwahltasten neben den standardmäßigen Markentasten. </p> <p> Wie berichtet von <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> Der Rand </a> , die Fernbedienung wird über Micro-USB aufgeladen, anstatt über das weit überlegene USB-C. Vielleicht wird dies durch Rückmeldungen, die durch das Early-Access-Programm gesammelt wurden, bestätigt. </p> <p> Die Teilnahme am Programm ist nur auf Einladung möglich, obwohl nicht bekannt ist, was Sie qualifiziert. </p> <p> Die Fernbedienung kostet 29,99 US-Dollar und wird voraussichtlich am 19. Februar 2021 ausgeliefert. </p> <p> Es werden nur 2.000 Einheiten verkauft und Roku wird Feedback zu Ihren Erfahrungen mit der Fernbedienung sammeln. Nach dieser Zeit können wir davon ausgehen, dass die Fernbedienung verfeinert wird, bevor sie möglicherweise in den Verkauf kommt. </p>"}