{"title":"So leiten Sie einen Text auf Android weiter","content":"<p> Wenn Sie einen Text von Ihrem Android-Gerät an jemanden weiterleiten möchten, müssen Sie ihn nicht eingeben oder kopieren und einfügen. Stattdessen können Sie die Weiterleitungsfunktion verwenden. </p> <p> Der Vorgang unterscheidet sich geringfügig, je nachdem, welche Messaging-App Sie verwenden. Die Schritte sind jedoch einfach und ungefähr gleich. </p> <p> Wir zeigen Ihnen, wie Sie eine SMS-Textnachricht in der Standard-App Android Messages und dem Samsung-Äquivalent weiterleiten. </p> <h2 id=\"how-to-forward-a-text-on-android-stock\"> So leiten Sie einen Text auf Android weiter (Stock) </h2> <ol> <li> Öffnen Sie in der Standard-App für Android-Nachrichten die Textkonversation, die die Nachricht enthält, die Sie weiterleiten möchten. </li> <li> <strong> drücken und halten </strong> auf der Nachricht. </li> <li> Tippen Sie auf die <strong> drei vertikale Punkte </strong> oben rechts. </li> <li> Wählen Sie aus der Liste aus, an wen Sie die Nachricht weiterleiten möchten. Um es alternativ an jemanden zu senden, der nicht auf dieser Liste steht, tippen Sie auf <strong> Neue Nachricht </strong> . </li> <li> Die weitergeleitete Nachricht wird im Nachrichtenfeld angezeigt. Sie können diese Nachricht bei Bedarf hinzufügen oder ändern. Wenn Sie fertig sind, tippen Sie auf das <strong> Senden-Schaltfläche </strong> (Pfeil nach rechts), um die Nachricht weiterzuleiten. </li> </ol> <p> </p> <h2 id=\"how-to-forward-a-text-on-samsung-phones\"> So leiten Sie einen Text auf Samsung-Telefonen weiter </h2> <p> <strong class=\"gallery__section-title\"> Bildergalerie (3 Bilder) </strong> <img alt=\"forward message android\" src=\"images/forward-message-android-497.jpg\" loading=\"lazy\"> Erweitern <img alt=\"forward message android searching names\" src=\"images/forward-message-android-searching-names-240.jpg\" loading=\"lazy\"> Erweitern <img alt=\"forward message android multiple names selected\" src=\"images/forward-message-android-multiple-names-selected-924.jpg\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <ol> <li> Öffnen Sie die Textunterhaltung, die die Nachricht enthält, die Sie weiterleiten möchten. </li> <li> <strong> drücken und halten </strong> auf der Nachricht. </li> <li> Zapfhahn <strong> Nach vorne </strong> . </li> <li> Finden Sie den Empfänger, entweder über die <strong> Gespräche </strong> oder <strong> Kontakte </strong> Tab. Tippen Sie auf ihren Namen. Sie können bei Bedarf mehrere Empfänger auswählen. </li> <li> Zapfhahn <strong> Getan </strong> . </li> <li> Die weitergeleitete Nachricht wird im Nachrichtenfeld angezeigt. Sie können diese Nachricht bei Bedarf hinzufügen oder ändern. Wenn Sie fertig sind, tippen Sie auf das <strong> Senden-Schaltfläche </strong> (Pfeil nach rechts), um die Nachricht weiterzuleiten. </li> </ol> <p> </p> <p> </p> <h2 id=\"why-can-t-i-forward-a-text-on-android\"> Warum kann ich auf Android keine SMS weiterleiten? </h2> <p> Wenn keine Weiterleitungsoption angezeigt wird, liegt dies wahrscheinlich daran, dass Sie die gesamte Konversation oder mehrere SMS ausgewählt haben. Im Gegensatz zu einigen der <a href=\"https://www.makeuseof.com/tag/messaging-apps-phone-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> beste Messaging-Apps </a> Wie bei WhatsApp können Sie bei den meisten SMS-Apps nicht mehrere Texte gleichzeitig weiterleiten. Wenn dieses Problem auftritt, stellen Sie sicher, dass Sie einen Text auswählen. </p> <p> </p> <h2 id=\"forward-your-calls-on-android\"> Weiterleiten Ihrer Anrufe auf Android </h2> <p> Wussten Sie, dass Textnachrichten nicht das einzige sind, was Sie auf Android weiterleiten können? Sie können auch eine Rufumleitung einrichten, um Ihre Anrufe an eine andere Nummer weiterzuleiten. </p>"}