{"title":"So passen Sie die zsh-Eingabeaufforderung im macOS-Terminal an","content":"<p> Seit dem Update auf Version 10.15 Catalina enthält macOS standardmäßig die Z-Shell (zsh) anstelle von Bash in der Terminal-App. Das heißt, Sie erhalten immer noch das gleiche schwarze Fenster mit weißem Text im Terminal. Das muss nicht so bleiben. </p> <p> Sie können die zsh-Eingabeaufforderung aufpolieren, um sie minimal zu machen und den Platz optimal zu nutzen. Wir zeigen Ihnen, wie Sie die zsh-Eingabeaufforderung in der Terminal-App so anpassen, dass sie sich von dem von Ihnen gewählten Hintergrund abhebt. </p> <h2 id=\"basics-of-the-zsh-prompt\"> Grundlagen der zsh-Eingabeaufforderung </h2> <p> Wenn Sie die Terminal-App starten, werden einige nützliche Informationen angezeigt, wie Ihre letzte Anmeldung und die Eingabeaufforderung. So sieht die Eingabeaufforderung normalerweise standardmäßig aus. </p> <pre><code class=\"hljs ruby\">Last login: Wed Feb 3 22:00:40 on console<br>samir@MacBook-Air ~ %</code></pre> <p> Die zsh-Eingabeaufforderung zeigt eine Textzeichenfolge an, die aus Ihrem Benutzernamen und dem Computermodell besteht, z. B. MacBook Air, MacBook Pro, Mac Mini usw. Die Tilde (~) zeigt die Position der Eingabeaufforderung im Home-Verzeichnis an. </p> <p> <img alt=\"Default View of zsh prompt\" src=\"images/default-view-of-zsh-prompt-685.jpg\" loading=\"lazy\"> </p> <p> </p> <p> </p> <h2 id=\"create-a-z-shell-profile-to-store-all-settings\"> Erstellen Sie ein Z-Shell-Profil, um alle Einstellungen zu speichern </h2> <p> Normalerweise müssen Sie an den Systemdateien herumbasteln, um das Standard-Look zu ändern. Das liegt daran, dass macOS-Updates alle Systemdateien auf die Standardeinstellungen zurücksetzen und Sie alle vorgenommenen Änderungen verlieren. </p> <p> Sie können also für Ihr zsh-Profil eine bestimmte Einstellungsdatei, auch als dotfile bezeichnet, erstellen, um alle gewünschten Änderungen und Einstellungen in der zsh-Eingabeaufforderung zu speichern. </p> <p> Nun, Sie finden diese Punktdatei nicht standardmäßig unter macOS, also müssen Sie eine erstellen. Es wird empfohlen, ein neues .zshrc-Profil zu erstellen, um alle Einstellungen zu speichern, wie die zsh-Eingabeaufforderung aussieht und sich verhält. </p> <p> So erstellen Sie das zsh-Profil (dotfile): </p> <p> 1. Öffnen <strong> Terminal </strong> App. </p> <p> 2. Geben Sie den folgenden Befehl ein und drücken Sie die Eingabetaste. </p> <pre><code class=\"hljs\">touch ~/.zshrc</code></pre> <p> Dadurch wird ein .zshrc-Profil im Home-Verzeichnis Ihres Benutzerkontos erstellt. Sie können es im Finder unter /Benutzer//Pfad sehen, wenn Sie die Anzeige versteckter Systemdateien aktiviert haben. </p> <p> Danach steht das zsh-Profil bei jedem Start von Terminal für die Login- und interaktiven Shells zur Verfügung. Es wird jedoch in den SSH-Sitzungen nicht aktiv sein. </p> <p> Alle Änderungen, die Sie an der zsh-Eingabeaufforderung vornehmen möchten, können in dieses Profil aufgenommen werden. </p> <p> </p> <h2 id=\"customize-the-zsh-prompt-in-terminal\"> Passen Sie die zsh-Eingabeaufforderung im Terminal an </h2> <p> Normalerweise enthält die standardmäßige zsh-Eingabeaufforderung Informationen wie den Benutzernamen, den Computernamen und den Speicherort, beginnend im Home-Verzeichnis des Benutzers. Diese Details werden in der Systemdatei der zsh-Shell am Speicherort /etc/zshrc gespeichert. </p> <pre><code class=\"hljs perl\">PS1=\"%n@%m %1~ %#\"</code></pre> <p> In dieser Variablenfolge: </p> <ul> <li> %n ist der Benutzername Ihres Kontos. </li> <li> %m ist der Modellname des MacBook. </li> <li> Das Symbol %1~ bedeutet den aktuellen Arbeitsverzeichnispfad, in dem das ~ den $HOME-Verzeichnispfad entfernt. </li> <li> %# bedeutet, dass die Eingabeaufforderung # anzeigt, wenn die Shell mit Root-Rechten (Administrator) ausgeführt wird, oder % anbietet, wenn dies nicht der Fall ist. </li> </ul> <p> Um Änderungen an der standardmäßigen zsh-Eingabeaufforderung vorzunehmen, müssen Sie relevante Werte hinzufügen, damit die Eingabeaufforderung anders als die Standardanzeige angezeigt wird. </p> <p> So gehen Sie vor. Öffnen <strong> Terminal </strong> , geben Sie den folgenden Befehl ein und drücken Sie die Eingabetaste. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Es ist leer, wenn Sie zum ersten Mal darauf zugreifen. Sie können eine neue Zeile mit dem Text PROMPT=&#39;...&#39; hinzufügen und relevante Werte in die Ellipsen einfügen. </p> <p> Für eine einfache Änderung der zsh-Eingabeaufforderung können Sie diese Werte in das .zshrc-Profil eingeben. </p> <pre><code class=\"hljs ruby\">PROMPT='%n~$'</code></pre> <p> Schlagen <strong> Strg + Aus </strong> um zu bestätigen, dass diese Änderungen an der Datei vorgenommen wurden, und drücken Sie dann <strong> Strg + X </strong> um den Nano-Editor zu verlassen. </p> <p> <img alt=\"Use only the username in the zsh prompt\" src=\"images/use-only-the-username-in-the-zsh-prompt-531.jpg\" loading=\"lazy\"> </p> <p> Öffne ein neues <strong> Terminal </strong> Fenster, um die gerade vorgenommenen Änderungen zu bestätigen und anzuzeigen. Ihre neue zsh-Eingabeaufforderung zeigt den Benutzernamen, das Home-Verzeichnis und das $-Symbol Ihres Macs am Ende an. </p> <p> </p> <h2 id=\"add-date-and-time-in-the-zsh-prompt\"> Datum und Uhrzeit in der zsh-Eingabeaufforderung hinzufügen </h2> <p> Abgesehen von Ihrem Benutzernamen können Sie das aktuelle Datum oder die aktuelle Uhrzeit anhängen, damit Sie nicht vom aktiven Terminalfenster wegschauen müssen, um diese Informationen zu überprüfen. </p> <p> Starten Sie das Terminal und öffnen Sie das .zshrc-Profil. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Um das Datum in die Eingabeaufforderung aufzunehmen, können Sie %D verwenden, damit das Datum im Format jj-mm-tt angezeigt wird, oder %W, damit es im Format mm/tt/jj angezeigt wird. Dann erscheint die neue Eingabeaufforderung wie </p> <pre><code class=\"hljs ruby\">PROMPT='%n:%W:~$'</code></pre> <p> <img alt=\"How to add date to the zsh prompt\" src=\"images/how-to-add-date-to-the-zsh-prompt-245.jpg\" loading=\"lazy\"> </p> <p> Wenn Sie die Systemzeit in die zsh-Eingabeaufforderung einfügen möchten, fügen Sie %T für die aktuelle Uhrzeit im 24-Stunden-Format hinzu, %t für die Uhrzeit im am/pm- oder 12-Stunden-Format, oder verwenden Sie %*, um die Uhrzeit im 24-Stunden-Format zusammen mit Sekunden. </p> <pre><code class=\"hljs ruby\">PROMPT='%n:%T:~$'</code></pre> <p> <img alt=\"How to show Time on the zsh prompt\" src=\"images/how-to-show-time-on-the-zsh-prompt-258.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-color-to-text-in-the-zsh-prompt\"> Hinzufügen von Farbe zum Text in der zsh-Eingabeaufforderung </h2> <p> Ist Ihnen der weiße Text der zsh-Eingabeaufforderung langweilig? Außer, abgesondert, ausgenommen <a href=\"https://www.makeuseof.com/tag/customize-mac-terminal/\" target=\"_blank\" rel=\"nofollow noopener\"> Ändern der Terminal-App </a> Mit Farben können Sie dem Text etwas Farbe hinzufügen, um eine schöne visuelle Unterbrechung zu erzielen. </p> <p> Starten <strong> Terminal </strong> und öffnen Sie das .zshrc-Profil. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Der zsh unterstützt Farben und Graustufen für den Eingabeaufforderungstext, sodass er den Hintergrund ergänzt. Sie können eine Vordergrundfarbe (Textfarbe) zwischen Schwarz, Weiß, Gelb, Grün, Rot, Blau, Cyan und Magenta auswählen. </p> <p> So verwenden Sie sie. </p> <pre><code class=\"hljs ruby\">PROMPT='%F{cyan}%n%f:~$'</code></pre> <p> <img alt=\"How to add color the zsh prompt\" src=\"images/how-to-add-color-the-zsh-prompt-993.jpg\" loading=\"lazy\"> </p> <p> Wenn Sie einen bestimmten Farbton auswählen möchten, können Sie zwischen 0 bis 256 8-Bit-Farben wählen, die das Terminal unterstützt. So verwenden Sie die Zahlenwerte der Farben. </p> <pre><code class=\"hljs ruby\">PROMPT='%F{51}%n%f:~$'</code></pre> <p> Sie müssen die Standard-Vordergrundfarbvariablen %F und %f zwischen den relevanten Text platzieren, den Sie einfärben möchten. </p> <p> </p> <h2 id=\"adding-visual-effects-in-the-zsh-prompt\"> Hinzufügen von visuellen Effekten in der zsh-Eingabeaufforderung </h2> <p> Wenn es nicht ausreicht, den Text der Eingabeaufforderung einzufärben, können Sie Ihre zsh-Eingabeaufforderung hervorheben, damit sie sich von der Textwand abhebt und Sie sie leicht erkennen können. Für den Anfang können Sie die zsh-Eingabeaufforderung fett formatieren. </p> <pre><code class=\"hljs ruby\">PROMPT='%B%F{51}%n%f%b:~$'</code></pre> <p> Das Hinzufügen von %B am Anfang und das Einfügen von %b am Ende zwischen den relevanten Text macht ihn fett. </p> <p> <img alt=\"How to bold text in the zsh prompt text\" src=\"images/how-to-bold-the-zsh-prompt-text-261.jpg\" loading=\"lazy\"> </p> <p> Ebenso können Sie %S an den Anfang und %s am Ende setzen, um den Text hervorzuheben. Die Hervorhebung trägt dieselbe Farbe, die Sie zwischen den Variablen %S und %s gewählt haben. </p> <pre><code class=\"hljs ruby\">PROMPT='%S%F{51}%n%f%s:~$'</code></pre> <p> <img alt=\"How to Highlight the zsh prompt\" src=\"images/how-to-highlight-the-zsh-prompt-422.jpg\" loading=\"lazy\"> </p> <p> Sie können den Text der zsh-Eingabeaufforderung auch unterstreichen. Um einen Unterstrich an eine Eingabeaufforderung anzuhängen, können Sie die Variable %U am Anfang und %u am Ende des entsprechenden Textes einfügen. </p> <pre><code class=\"hljs ruby\">PROMPT='%U%F{51}%n%f%u:~$'</code></pre> <p> <img alt=\"How to Underline the zsh prompt\" src=\"images/how-to-underline-the-zsh-prompt-962.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-last-login-details-from-the-zsh-prompt\"> Entfernen Sie die letzten Anmeldedaten aus der zsh-Eingabeaufforderung </h2> <p> Das Ausblenden oder Deaktivieren der obersten Zeile, die die letzte Anmeldezeit in der Terminal-App anzeigt, kann Ihrer zsh-Eingabeaufforderung ein saubereres Aussehen verleihen. Sie können den folgenden Befehl verwenden, um diese Informationen auszublenden. </p> <pre><code class=\"hljs\">touch ~/.hushlogin</code></pre> <p> Wenn Sie das Terminal das nächste Mal öffnen, sehen Sie nichts über der zsh-Eingabeaufforderung. </p> <p> </p> <h2 id=\"spice-up-the-zsh-prompt-in-terminal\"> Peppen Sie die zsh-Eingabeaufforderung im Terminal auf </h2> <p> Auch wenn Sie gelegentlich die Terminal-App unter macOS verwenden, können Sie die Anzeige der zsh-Eingabeaufforderung dort anpassen. Sie können Datum und Uhrzeit fett formatieren, unterstreichen, kürzen und sogar einschließen. </p> <p> Nachdem Sie nun damit begonnen haben, den zsh-Prompt anzupassen, experimentieren Sie ein wenig und machen Sie ihn zu Ihrem eigenen. </p>"}