{"title":"So greifen Sie auf Ihre PS4- und PS5-Gameplay-Statistiken für 2020 zu","content":"<p> Sony hat das PlayStation Wrap-Up auf den Markt gebracht, mit dem Sie Ihre PlayStation-Reise im letzten Jahr Revue passieren lassen können. </p> <p> Wir erklären Ihnen, wie Sie auf diese Erfahrung zugreifen können, und machen Sie auf die wenigen Anforderungen aufmerksam. </p> <h2 id=\"what-is-playstation-wrap-up\"> Was ist PlayStation Wrap-Up? </h2> <p> Wie wir berichteten, <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation Wrap-Up ist die Zusammenfassung deines letzten Gaming-Jahres </a> . </p> <p> Es ist eine personalisierte Seite, auf der deine Spielgewohnheiten auf PS4 und PS5 aufgeführt sind, einschließlich der Anzahl der Spiele, die du gespielt hast, wie lange du sie gespielt hast und wie viele Trophäen du dabei verdient hast. </p> <p> Sie können auch ein kostenloses dynamisches Design mit PlayStation-Formen erhalten. Verwirrenderweise ist dies nur für die PS4 und nicht für die neu veröffentlichte PS5 verfügbar. </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> So greifst du auf PlayStation Wrap-Up zu </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> Um Ihren Bericht anzuzeigen, gehen Sie zu <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation Wrap-Up-Website </a> . Sie müssen sich bei Ihrem Sony-Konto anmelden, falls Sie es noch nicht sind. Sobald Sie auf der Seite sind, können Sie nach unten scrollen, um Ihre Statistiken anzuzeigen und das PS4-Design einzulösen. </p> <p> Das Wrap-Up-Erlebnis wird nur bis zum 2. März 2021 verfügbar sein. Zögern Sie daher nicht, wenn Sie teilnehmen möchten. </p> <p> Es gibt Bedingungen, die du erfüllen musst, um PlayStation Wrap-Up nutzen zu können: </p> <ul> <li> Besitzen Sie ein registriertes PSN-Konto in Ihrer Region. </li> <li> Mindestens 18 Jahre alt sein. </li> <li> Zwischen dem 1. Januar 2020 und dem 31. Dezember 2020 mindestens 10 Stunden lang auf einer PS4-Konsole gespielt haben. </li> </ul> <p> Darüber hinaus müssen Benutzer in Europa, dem Nahen Osten, Afrika, Australien, Indien und Russland die Erfassung von <strong> Zusätzliche Daten </strong> . Sie können dies auf der PS4 aktivieren über <strong> die Einstellungen </strong> &gt; <strong> Gerätedaten/Gesundheit &amp; Sicherheit </strong> &gt; <strong> Gerätedaten </strong> . </p> <p> Schließlich können Sie eine E-Mail mit Ihrem PlayStation-Wrap-Up erhalten. Sie müssen sich jedoch für den Erhalt von Marketing-E-Mails angemeldet haben, was Sie über die <strong> Benachrichtigungseinstellungen </strong> in Ihrem PSN-Konto. </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> Wird es eine Zusammenfassung 2021 geben? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> Dies ist das zweite Jahr in Folge, dass Sony die Wrap-Up-Erfahrung durchführt. Da es nur 2020-Daten analysiert, hat es eher einen PS4-Fokus. </p> <p> Hoffentlich macht Sony es nächstes Jahr wieder, wenn die PS5 länger draußen ist und mehr Spiele veröffentlicht wurden. </p>"}