{"title":"So verwenden Sie die Apple Watch Workout-App","content":"<p> Mit der Apple Watch können Sie Ihren Fitnessfortschritt mit nur einem Fingertipp besser verstehen. </p> <p> Wir werfen einen Blick auf alles, was die Apple Watch Workout App zu bieten hat, einschließlich der Funktionsweise der App, der Trainingsarten, die sie verfolgen kann und wie Sie alle gesammelten Informationen anzeigen können. </p> <h2 id=\"getting-started-with-the-workout-app\"> Erste Schritte mit der Trainings-App </h2> <p> Sie können die Workout-App auf einer Apple Watch auf verschiedene Weise öffnen. Klicken Sie zuerst einmal auf das <strong> Digitale Krone </strong> um die Liste der Apps auf Ihrer Uhr anzuzeigen. Wählen Sie dann <strong> Trainieren </strong> . </p> <p> Eine noch schnellere Möglichkeit besteht darin, Siri zu verwenden, entweder durch langes Drücken der <strong> Digitale Krone </strong> oder die Uhr an den Mund heben. Sagen Sie dann einfach &quot;Öffne die Workout-App&quot;. </p> <p> Nach dem Öffnen der App sehen Sie eine Vielzahl von Trainingsarten – von Bogenschießen bis Yoga und allem dazwischen. </p> <p> Der Hauptbildschirm für die Trainingsauswahl wird durch die beliebtesten Optionen hervorgehoben. Scrollen Sie zum Ende der Liste und wählen Sie <strong> Training hinzufügen </strong> um eine Liste anderer Trainingsarten anzuzeigen. Wenn Sie Ihren Trainingstyp aus irgendeinem Grund nicht sehen, können Sie auch auswählen <strong> Andere </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> Sie können die auswählen <strong> drei Punkte </strong> ( <strong> ... </strong> ) bei jedem Trainingstyp, um ein bestimmtes Ziel für Distanz, verbrannte Kalorien oder Zeit festzulegen. Wenn Sie eines dieser Ziele nicht interessiert, tippen Sie einfach auf den Trainingsnamen, um sofort zu beginnen. </p> <p> Auf dem Bildschirm wird ein Countdown von drei Sekunden angezeigt, bevor die Verfolgung beginnt. </p> <p> Alle Funktionen der Workout-App sind verfügbar, ohne dass ein iPhone in der Nähe ist oder wenn Sie nur eine Apple Watch verwenden, die mit einem WLAN- oder Mobilfunksignal verbunden ist. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Verstehen Sie die Trainings-App </h2> <p> Es gibt drei Hauptbildschirme in der App. Sie können zwischen ihnen wechseln, indem Sie nach links oder rechts wischen. </p> <p> Auf dem Hauptbildschirm werden alle Ihre Fortschritte in der von Ihnen ausgewählten Trainingsart angezeigt. Sie sehen die Trainingszeit, die aktiven Kalorien, die Gesamtkalorien und die aktuelle Herzfrequenz. Je nach Trainingstyp wird möglicherweise auch die zurückgelegte Strecke angezeigt. </p> <p> Wenn Sie eine Apple Watch Series 5 oder höher besitzen und das Always-On-Display aktiviert haben, können Sie Ihre Trainingsstatistiken immer sehen. Jeder, der ein älteres Modell besitzt, muss den Bildschirm anheben oder antippen, um diese Informationen anzuzeigen. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Wenn du läufst oder gehst, gibt die Apple Watch bei jedem Kilometer oder Kilometer ein sanftes Tippen und zeigt ein Update mit Tempoinformationen an. Alle fünf Meilen oder Kilometer werden eine Zusammenfassung und ein Tippen auf das Radfahren angezeigt. </p> <p> Wenn du ein Apple Fitness+ Workout machst, kannst du Daten sowohl in der Workout-App als auch auf dem iPhone-, iPad- oder Apple Watch-Bildschirm sehen. </p> <p> </p> <p> Wenn Sie vom Hauptbildschirm nach rechts wischen, werden Ihnen vier verschiedene Optionen angezeigt: <strong> Sperren </strong> , <strong> Neu </strong> , <strong> Ende </strong> , und <strong> Pause </strong> . </p> <p> Auswahl <strong> Sperren </strong> sperrt den Bildschirm, um versehentliches Tippen zu vermeiden. Sie können die Digital Crown drehen, um den Bildschirm zu entsperren. Beachten Sie nur, dass diese Option bei jeder Art von Schwimmtraining automatisch aktiviert wird, um versehentliches Tippen durch Wassertropfen zu verhindern. </p> <p> Wie Sie sich wahrscheinlich vorstellen können, <strong> Neu </strong> beendet das aktuelle Training und ermöglicht es Ihnen, einen neuen Trainingstyp auszuwählen, um erneut zu beginnen. Auswahl <strong> Ende </strong> beendet das aktuelle Training. </p> <p> Sollten Sie einmal unterbrochen werden, können Sie die <strong> Pause </strong> Taste. Durch erneutes Drücken wird die Trainingsverfolgung gestartet. Sie können dies auch tun, indem Sie gleichzeitig die Digital Crown und die Seitentaste drücken. </p> <p> Wenn Sie vom Haupttrainingsbildschirm nach links wischen, werden die Steuerelemente für die Medienwiedergabe angezeigt. So haben Sie beim Training ganz einfach Zugriff auf Ihre Musik oder was auch immer Sie gerade hören. Sie können Titel überspringen, abspielen, anhalten und die Lautstärke erhöhen oder verringern. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Automatische Trainingserinnerungen </h2> <p> Sie müssen sich keine Sorgen machen, wenn Sie vergessen, mit dem Training zu beginnen. Solange Sie watchOS 5 oder höher haben, kann eine Apple Watch automatisch erkennen, wann Sie trainieren. Es tippt Sie auf das Handgelenk und fragt, ob Sie ein Training aufzeichnen möchten, sodass Sie den Trainingstyp ändern, diese Benachrichtigungen für den Tag stummschalten oder diese Benachrichtigung einfach ablehnen können. </p> <p> Es kann zwar einige Minuten dauern, bis die Benachrichtigung angezeigt wird, aber das gesamte Trainingsguthaben wird trotzdem gespeichert. </p> <p> Sie können Trainingserinnerungen für die folgenden Trainingsarten erhalten: Indoor-Walk, Outdoor-Walk, Indoor-Lauf, Outdoor-Lauf, Ellipsentrainer, Ruderer, Poolschwimmen und Freiwasserschwimmen. </p> <p> Um die Funktion ein- oder auszuschalten, gehen Sie zu <strong> Einstellungen &gt; Training &gt; Trainingserinnerung starten </strong> auf deiner Apple Watch. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> Die Apple Watch kann auch erkennen, wann ein Training abgeschlossen ist. Nach einem Antippen wird eine Bildschirmbenachrichtigung mit Optionen zum Beenden oder Unterbrechen des Trainings angezeigt. Sie können die Benachrichtigung auch vollständig verwerfen und das Training fortsetzen. </p> <p> Schalten Sie die Funktion um, indem Sie zu Ihrer Apple Watch gehen und zu . gehen <strong> Einstellungen &gt; Training &gt; Erinnerung an Trainingsende </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Passen Sie die in der Trainings-App angezeigten Daten an </h2> <p> In der Trainingsansicht der Apple Watch kannst du die auf dem Bildschirm angezeigten Informationen für viele verschiedene Trainingsarten anpassen. </p> <p> Öffnen Sie zunächst die begleitende Watch-App auf Ihrem iPhone. In dem <strong> Meine Uhr </strong> Registerkarte auswählen <strong> Trainieren </strong> . Dann wähle <strong> Trainingsansicht </strong> . Oben auf der Seite können Sie auswählen, ob während eines Trainings einzelne oder mehrere Messwerte auf dem Bildschirm angezeigt werden. Wenn Sie auswählen <strong> Einzelner Messwert </strong> , scrollen Sie einfach durch die Digital Crown, um weitere Daten auf Ihrer Apple Watch anzuzeigen. </p> <p> <strong class=\"gallery__section-title\"> Bildergalerie (3 Bilder) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Erweitern <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Erweitern <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <p> Darunter sehen Sie auch eine Reihe verschiedener Trainingsarten, bei denen Sie die auf dem Bildschirm angezeigten Informationen bearbeiten können. Wählen Sie einen Trainingstyp und dann <strong> Bearbeiten </strong> oben rechts auf dem Bildschirm, um anzupassen, was auf dem Bildschirm angezeigt wird und in welcher Reihenfolge. </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Anzeigen von Trainingsdaten in der Fitness-App </h2> <p> Sobald Sie mit dem Training fertig sind, sind alle Daten nur ein paar Fingertipps entfernt auf Ihrem iPhone. </p> <p> Um es zu sehen, öffnen Sie das <strong> Fitness </strong> App. </p> <p> <strong class=\"gallery__section-title\"> Bildergalerie (2 Bilder) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Erweitern <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <p> Unter dem <strong> Zusammenfassung </strong> Registerkarte, wählen Sie <strong> Trainings </strong> . Sie sehen Informationen zu all Ihren Trainingseinheiten. Die Daten sind auch im <strong> Gesundheit </strong> App. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Mit der Apple Watch Workout App ins Schwitzen kommen </h2> <p> Wie Sie sehen, ist die Apple Watch Workout App eine großartige Möglichkeit, alle Ihre verschiedenen Fitnesswerte im Auge zu behalten, während Sie alles tun, vom Schwimmen bis zum Tanzen und vielem mehr. </p> <p> Und wenn Sie bereit sind, die Nacht zu beenden und ins Bett zu gehen, kann Ihre Apple Watch mit der integrierten Schlaf-Tracking-Funktion eine große Hilfe sein. </p>"}