{"title":"So schützen Sie Ihre personenbezogenen Daten vor Arbeitgebern","content":"<p> Überwachungstechnologie ist innerhalb und außerhalb des Büros weit verbreitet. Viele Arbeitgeber verwenden mobile Verwaltungsprodukte für vom Unternehmen ausgegebene Geräte wie Telefone, Laptops und Tablets. Diese enthalten Programme, die Unternehmen vor Diebstahl, Unternehmensspionage oder böswilligen Absichten schützen sollen. </p> <p> All dies ist zwar großartig für den Schutz Ihres Unternehmens, aber nicht gerade das Beste für Sie. Es geht nicht mehr darum <strong> wenn </strong> Ihr Unternehmen verfolgt Sie; Als nächstes müssen Sie sich fragen, wie viele Daten Unternehmen tatsächlich finden können. Überraschenderweise viel. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> Was können Arbeitgeber auf Firmen-WLAN und Remote-Geräten sehen? </h2> <p> Die meisten Menschen wissen nicht, inwieweit Unternehmen Zugriff auf ihre Daten haben oder wie viel davon sie bei der Verwendung von Unternehmensgeräten übertragen. Hier sind einige Beispiele. </p> <h3 id=\"location\"> Ort </h3> <p> Viele Mitarbeiter denken, dass die Verwendung eines virtuellen privaten Netzwerks (VPN) ausreicht, um ihren Arbeitgebern glauben zu lassen, dass sie dort sind, wo sie sein sollen. </p> <p> Es gibt zwar Möglichkeiten, Ihren tatsächlichen Standort auf einem persönlichen Gerät zu verbergen, es ist jedoch nicht ganz narrensicher, insbesondere wenn Sie bei einer Anwendung oder Website mit einer vom Unternehmen ausgestellten E-Mail-Adresse oder Handynummer angemeldet sind. </p> <p> </p> <p> Es kann fast unmöglich sein, Ihren tatsächlichen Standort zu verbergen, wenn Sie vom Unternehmen ausgestellte Geräte verwenden. Telekommunikationsunternehmen können beispielsweise erkennen, wenn Sie eine Verbindung zu einem ihrer Roamingpartner hergestellt haben. </p> <p> Darüber hinaus unterscheiden sich Unternehmens-VPNs von kommerziellen VPNs mit Gateways, die von internen IT-Teams überwacht werden. </p> <h3 id=\"notes-documents-and-emails\"> Notizen, Dokumente und E-Mails </h3> <p> Wenn Sie glauben, dass niemand weiß, dass Sie das Firmen-WLAN genutzt haben, um Ihren nächsten Job zu finden, irren Sie sich. Auch wenn Sie keine Firmen-E-Mail-Adresse verwenden, sind in vielen Unternehmen auf Firmen-Laptops Programme vorinstalliert, die Echtzeit-Aktivitätsprotokolle, Aktualisierungen des Browserverlaufs und zeitgesteuerte Screenshots geöffneter Dokumente und E-Mails enthalten. </p> <p> Unter der Prämisse, sich vor möglichen Datenschutzverletzungen zu schützen, verwenden viele Unternehmen diese auch als Berichtsmechanismen oder Produktivitätstracker. </p> <p> </p> <h3 id=\"online-messaging-history\"> Verlauf der Online-Nachrichten </h3> <p> Trotz des Aufkommens verschlüsselter Plattformen sind Ihre Nachrichten auf Unternehmensgeräten nicht vollständig privat. Bei der Verwendung von Messaging-Plattformen können Unternehmen möglicherweise nicht die genauen Details Ihres Austauschs sehen, aber wahrscheinlich dennoch Metadaten wie Dateigröße und -typ erkennen. </p> <p> Wenn Sie sich dazu entschließen, PDFs in großen Formaten über eine App wie WhatsApp zu senden, wird Ihr Intrusion Detection-System Sie wahrscheinlich auf verdächtiges Verhalten hinweisen. In Übereinstimmung mit den Unternehmensrichtlinien werden Sie möglicherweise aufgefordert, zu beweisen, dass Ihre Handlungen nicht böswillig waren, und müssen möglicherweise eine Freigabe von der Führung zur Freigabe anfordern. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> So vermeiden Sie die Weitergabe personenbezogener Daten an Ihren Arbeitgeber </h2> <p> Es gibt keine absolute Möglichkeit, Ihre persönlichen Daten, Gespräche und Aktivitäten jederzeit vollständig außer Reichweite zu halten. Es gibt jedoch mehrere Möglichkeiten, die Risiken zu mindern. </p> <p> Wir befürworten das Verstecken von Daten vor Ihren Arbeitgebern nicht; Tatsächlich haben sie das Recht, Informationen über ihre Mitarbeiter zu sammeln – selbst wenn sie <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> kann dich legal verfolgen </a> . Aber Sie müssen wissen, wann es angebracht ist, Dinge für sich zu behalten, und das hängt von den einzelnen Unternehmen ab. </p> <h3 id=\"read-company-policies\"> Unternehmensrichtlinien lesen </h3> <p> Bevor Sie über Datentransparenz streiten können, müssen Sie auch verstehen, welche Art von Informationen Sie Ihrem Arbeitgeber wissentlich geben, indem Sie für ihn arbeiten. Nur wenn Sie wissen, was von Ihnen erwartet wird, können Sie die entsprechenden beruflichen Grenzen setzen. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Versuchen Sie, die Richtlinien und Verfahren zur Erfassung von Unternehmensdaten zu verstehen, bevor sie erfasst werden. Von dort aus können Sie effektiv planen, die Bereitstellung von mehr Informationen als erforderlich abzulehnen. </p> <h3 id=\"use-personal-gadgets\"> Persönliche Gadgets verwenden </h3> <p> Es ist zwar immer verlockend, Firmengeräte zu verwenden, um Geld zu sparen, aber in Wirklichkeit ist nichts wirklich kostenlos. Investieren Sie in Laptops, Mobiltelefone und Tablets für den persönlichen Gebrauch. </p> <p> Der Besitz separater persönlicher Geräte ist auch eine großartige Möglichkeit, Grenzen zu setzen, insbesondere wenn Sie aus der Ferne arbeiten. </p> <p> Wenn Sie Ihr eigenes Gerät verwenden, können Sie die verschiedenen Sicherheitsmaßnahmen einrichten und verwalten, die zum Schutz Ihrer Daten vor neugierigen Blicken erforderlich sind. Es mag wie eine unnötige Ausgabe erscheinen, aber es trägt viel dazu bei, Ihren Seelenfrieden zu bewahren. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Verwenden von Gastprofilen auf persönlichen Geräten </h3> <p> Die Verbindung zu einem anderen Netzwerk als Ihrem eigenen ist immer ein Sicherheitsrisiko, selbst wenn es sich am Arbeitsplatz befindet. Die Anmeldung bei einem Firmen-WLAN gibt Ihrem Arbeitgeber die Erlaubnis, auf alles zuzugreifen, von den Metadaten Ihrer Nachrichten bis hin zu den Browserverlaufsprotokollen. </p> <p> Wenn Sie Ihren persönlichen Laptop unbedingt in Firmennetzwerken verwenden müssen, können Sie eine Gästekartei verwenden, um die Datenmenge zu reduzieren, auf die sie aus der Ferne zugreifen können. Alternativ können Sie sich mit dem Datentarif Ihres persönlichen Mobiltelefons oder einem tragbaren Wi-Fi-Gerät verbinden. </p> <h3 id=\"keep-your-passwords-safe\"> Bewahren Sie Ihre Passwörter sicher auf </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Erstellen starker Passwörter Creating </a> ist nicht genug. Sie müssen sicherstellen, dass Ihre Passwörter nicht auf Unternehmensgeräten gespeichert werden. Wenn Sie persönliche Passwörter für Online-Banking-Konten, persönliche E-Mails oder behördliche Websites auf Geräten speichern, die Ihnen nicht gehören, gefährden Sie Ihre Daten sofort, wenn Ihre Unternehmensdatenbank kompromittiert wird. </p> <p> Verwenden Sie nur Ihr persönliches Mobiltelefon oder Ihren Laptop, um auf wichtige Konten zuzugreifen, insbesondere solche, bei denen es um Geld geht. Aktivieren Sie nach Möglichkeit die Zwei-Faktor-Authentifizierung. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> Trennen Sie Arbeit und Privatleben </h2> <p> Arbeitgeber haben das Recht, aus der Ferne auf Ihr vom Unternehmen ausgestelltes Gerät zuzugreifen, wenn sie vermuten, dass Sie an irgendeiner Form von illegalen Aktivitäten teilnehmen, Unternehmensinformationen gefährden oder von Strafverfolgungsbehörden zur Untersuchung aufgefordert werden. </p> <p> Dies ist jedoch bei persönlichen Geräten anders. </p> <p> Ihre Sicherheit ist nur so stark wie die Menschen, mit denen Sie in Kontakt stehen – dazu gehört auch Ihr Arbeitgeber. Die Trennung Ihrer persönlichen und geschäftlichen Geräte ist nur ein Schritt zur Dezentralisierung Ihrer Daten. Durch strenge Sicherheitsmaßnahmen können Sie die Anzahl der Zugriffspunkte für Hacker auf Dokumente, E-Mails und Netzwerke begrenzen. </p> <p> Die Dezentralisierung personenbezogener Daten ist notwendig, da sie Sie als Einzelperson und Ihr Unternehmen vor Diebstahl, Betrug und anderen Formen der Cyberkriminalität schützt. </p>"}