{"title":"So sehen Sie Ihre Spielzeitstatistiken auf der PS5","content":"<p> Wenn Sie gerne sehen, wie viel Zeit Sie mit Spielen verbracht haben, bietet die PS5 eine versteckte aber nützliche Funktion für Sie. Es verfolgt, wie viel Zeit Sie mit Spielen auf dem System verbracht haben. </p> <p> So können Sie überprüfen, wie viel Zeit Sie mit PlayStation 5-Spielen verbracht haben. Was Sie ermutigen könnte, <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> schalte deine PS5 aus </a> öfters. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> So überprüfen Sie Ihre Spielzeitstatistiken auf PlayStation 5 </h2> <p> Wähle auf dem Startbildschirm deiner PS5 oben rechts dein Profilsymbol aus. Sie können drücken <strong> Dreieck </strong> um die Auswahl schnell in diesen Bereich des Bildschirms zu verschieben. Nachdem Sie dieses Menü geöffnet haben, wählen Sie <strong> Profil </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Wechseln Sie nun zum <strong> Spiele </strong> Tab. Hier sehen Sie alle Spiele, die Sie auf Ihrem PlayStation-Konto gespielt haben. Jeder zeigt, wann Sie das Spiel das letzte Mal gespielt haben, sowie Ihre gesamten Spielstunden. Es ist jedoch nicht auf die Minute genau. Die Spielzeit wird auf die Stunde gerundet angezeigt. </p> <p> Hier sehen Sie auch die Spielzeit für Ihre PS4-Titel, auch wenn Sie sie nicht auf PS5 gespielt haben. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> Soweit wir wissen, umfasst diese Spielzeit die gesamte Zeit, die das Spiel lief – nicht nur, wenn Sie aktiv gespielt haben. Das heißt, wenn Sie das Spiel im Pausenmenü verlassen haben, während Sie einen Anruf entgegengenommen oder etwas zu essen bekommen haben, wird diese Zeit in die Gesamtsumme einbezogen. Es ist also vielleicht nicht sehr genau, aber es gibt Ihnen zumindest eine Vorstellung davon, wie lange Sie jeden Titel gespielt haben. </p> <p> </p> <p> Wenn Sie neugierig sind, können Sie auch die Spielzeitstatistiken für Ihre Freunde anzeigen. Wähle aus <strong> Freunde </strong> Registerkarte auf demselben Bildschirm und wählen Sie den Freund aus, über den Sie mehr erfahren möchten. Dies zeigt Ihnen, wie lange sie in ihren Spielen in einem identischen Menü verbracht haben. </p> <p> Wenn Sie nicht möchten, dass Ihre Spielzeitinformationen für andere Spieler sichtbar sind, scrollen Sie nach rechts und wählen Sie <strong> Datenschutzeinstellungen </strong> . In diesem Menü unter dem <strong> Ihre Aktivität </strong> Abschnitt, ändern Sie die Option für <strong> Wer kann deinen Spielverlauf sehen </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Einige Spiele verfolgen auch ihre eigene Spielzeit </h2> <p> Wenn Sie an solchen Daten interessiert sind, öffnen Sie Ihre Lieblingsspiele und sehen Sie, ob sie Ihre Spielzeit verfolgen. Eine gute Anzahl von Titeln enthält die Gesamtspielzeit in Ihrer Speicherdatei, im Pausenmenü oder ähnlichem. </p> <p> Dies ist zwar nicht über alle Spiele hinweg konsistent und kann die während der Pause verbrachte Zeit umfassen oder auch nicht, es kann Ihnen jedoch mehr Einblick in ein Spiel geben, über das Sie mehr erfahren möchten. Einige Online-Spiele, wie Overwatch, verfolgen sogar deine Zeit, die du mit jedem Helden in verschiedenen Modi verbracht hast. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Sehen Sie, wie viel Sie wirklich spielen </h2> <p> Die PS5 macht es einfach zu sehen, wie viel Zeit Sie mit Spielen verbracht haben. Es ist eine kleine, aber sehr geschätzte Funktion, da die PS4 diese Daten nicht leicht zugänglich machte. </p> <p> In der Zwischenzeit gibt es mehr Möglichkeiten, Ihr Spiel auch außerhalb der Konsole selbst zu verwalten. </p> <p> <small> Bildquelle: LightField Studios/ <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}