{"title":"Sie werden bald Spiele mit den MetaHuman-Charakteren von Epic spielen","content":"<p> Wenn Sie denken, dass Spiele jetzt realistisch aussehen, dann warten Sie, bis Sie eine Menge von dem bekommen, was Epic Games mit seiner Unreal Engine in Arbeit hat. Bereiten Sie sich darauf vor, Ihren Verstand umhauen zu lassen. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games enthüllt neue MetaHumans </h2> <p> Sie fragen sich wahrscheinlich, von was für einer Erde wir sprechen. MetaHuman Creator ist das neueste Feature, das Epic Games der Unreal Engine hinzugefügt hat; eine Software-Entwicklungsumgebung, mit der Spieleentwickler ihre Titel erstellen können. </p> <p> Nach einem <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Unreal Engine-Blogpost </a> Ankündigung des aufregenden neuen Entwicklungstools: </p> <blockquote> <p> MetaHuman Creator ist eine Cloud-gestreamte App, die entwickelt wurde, um die digitale menschliche Kreation in Echtzeit von Wochen oder Monaten auf weniger als eine Stunde zu verkürzen, ohne Kompromisse bei der Qualität einzugehen. </p> </blockquote> <p> Es ist also im Wesentlichen eine Möglichkeit für Spieleentwickler, unglaublich realistische menschliche Faksimiles zu erstellen. Schnell. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> Was bedeutet MetaHuman Creator für Entwickler? </h2> <p> </p> <p> Die Auswirkungen, die dies für die Softwareentwicklung hat, sind bahnbrechend (Wortspiel beabsichtigt). Stellen Sie sich vor, wie schnell Entwickler mithilfe von MetaHuman Creator ihre Spielwelten mit NPCs bevölkern werden. Nicht nur das, die digitalen Menschen sehen auch unglaublich aus. </p> <p> Dies bedeutet natürlich auch, dass Entwickler Titel schneller fertigstellen können, sodass Sie nicht durch unzählige Verzögerungen warten müssen. MetaHuman Creator ermöglicht es Entwicklern, ihre NPC-Population schnell aufzubauen, sodass Zeit für andere, dringendere Angelegenheiten bleibt. </p> <p> Aber warum die Notwendigkeit für dieses Werkzeug? Epische Spiele erklärt: </p> <blockquote> <p> Die Schaffung eines qualitativ hochwertigen digitalen Menschen ist schwierig und zeitaufwändig. Diese Anstrengungen zu skalieren, um viele unterschiedliche digitale Menschen in der Qualität zu schaffen, die von Plattformen der nächsten Generation und virtueller High-End-Produktion erforderlich sind, ist in der Tat eine gewaltige Aufgabe. </p> </blockquote> <p> Also, wie gesagt; Das Tool spart Zeit und verbessert den Workflow, sodass Entwickler den Konsolen der neuen Generation die Spiele anbieten können, die sie verdienen. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> Wie wird sich MetaHuman Creator auf Spiele auswirken? </h2> <p> Nun, dank MetaHuman Creator könnten Spiele zunächst viel schneller veröffentlicht werden. Mit leistungsstarken Tools wie diesem könnten Entwickler die Spielmechanik verfeinern oder mehr Zeit damit verbringen, Fehler zu beheben, bevor sie ein kaputtes Spiel veröffentlichen ... </p> <p> Wie auch immer, Bitterkeit beiseite, Epics Entwicklungstool scheint etwas zu sein, das auch Spiele besser aussehen lässt. Sie müssen sich nur die Renderings ansehen, um zu sehen, wie atemberaubend die digitalen Menschen tatsächlich sind. Wenn wir sie jedoch in Spielen sehen, wird die wahre Magie passieren. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> Wann werden wir MetaHumans in Spielen sehen? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> Das ist schwer zu sagen. Derzeit hat Epic die Creator-Software für Early-Access-Tests in den „nächsten Monaten“ festgelegt. Sie werden also in absehbarer Zeit keine MetaHumans sehen. </p> <p> Wenn Sie Lust haben, Ihren eigenen digitalen Menschen zu erstellen, müssen Sie warten, wenn Sie den MetaHuman Creator von Unreal Engine verwenden möchten. Sie können jederzeit versuchen, eines in einem anderen Programm zusammenzustellen, aber es wird sicherlich nicht weniger als eine Stunde dauern! </p>"}