{"title":"So erstellen Sie Ihr eigenes Brettspiel im Tabletop-Simulator","content":"<p> Haben Sie schon einmal darüber nachgedacht, ein Spiel zu entwickeln, das Sie mit Ihren Freunden im Tabletop Simulator (TTS) spielen können? Oder vielleicht sind Sie ein Tabletop-Spieleentwickler, der Prototypen von Spielen sucht und sie online testet. </p> <p> Es gab noch nie einen besseren Zeitpunkt, um die vielseitige Spielumgebung von TTS zu nutzen. Heute zeigen wir Ihnen, wie Sie genau das tun. </p> <h2 id=\"what-is-tabletop-simulator\"> Was ist ein Tabletop-Simulator? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Für diejenigen, die es nicht wissen, bietet Tabletop Simulator (TTS) eine 3D-Umgebung zum Spielen von Tabletop-Spielen, entweder lokal oder online. Es ist eine großartige Möglichkeit geworden, <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> Brettspiele online mit Freunden spielen </a> . </p> <p> Die spielbaren Spiele auf TTS umfassen alles von Poker, Dame, Dungeons &amp; Dragons, Minigolf und sogar die neuesten Brettspiele. Jedes Spiel, das Sie spielen möchten, ist normalerweise entweder als DLC oder im Community-Workshop erhältlich. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> Warum Tabletop-Simulator verwenden? </h2> <p> Wenn Sie jemals versucht haben, ein physisches Tabletop-Spiel zu erstellen, wissen Sie, wie zeitaufwendig es sein kann, Spielelemente nicht nur zu erstellen, sondern auch zu modifizieren oder zu ersetzen, wenn Sie sich entscheiden, das Spiel zu optimieren oder zu überarbeiten. </p> <p> In TTS ist alles, von der Farbe bis zum Gewicht eines Objekts, per Mausklick veränderbar, was den Revisionsprozess reibungslos und schmerzlos macht. </p> <p> Darüber hinaus ist es ganz einfach, Ihr Gameplay live zu streamen und auf sozialen Medien und Streaming-Plattformen zu präsentieren. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> Was Sie brauchen, um loszulegen </h2> <p> Bevor Sie beginnen, benötigen Sie Folgendes: </p> <ul> <li> Ein Steam-Benutzerkonto </li> <li> Tabletop Simulator auf Ihrem PC installiert </li> <li> JPG-Bilder Ihrer Board- und Kartendesigns </li> </ul> <p> <strong> Herunterladen: </strong> Tabletop-Simulator an <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> Dampf </a> (19,99 $) </p> <p> Das Entwerfen von Spielelementen geschieht am besten durch die Illustration von Software oder durch das Scannen von Bildern von physischen Karten, die Sie bereits erstellt haben. Stellen Sie einfach sicher, dass sie JPG-Erweiterungen haben und einzeln gespeichert werden. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Erstellen von Boards und Spielermatten </h2> <p> Stellen Sie beim Entwerfen Ihrer Boards und anderer 2D-Objekte sicher, dass die Auflösung hoch genug ist, um sie ohne Qualitätsverlust richtig dimensionieren zu können. TTS passt die Größe beim Importieren automatisch an, und Sie können die Größe genau nach Ihren Wünschen ändern. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Karten erstellen </h2> <p> Karten in TTS haben drei Aspekte: die Kartenseite, die Kartenrückseite und die versteckte Karte (wie die Karte für andere in der Hand eines Spielers aussieht). Sie müssen für jedes dieser Designs Designs haben, obwohl Sie die Möglichkeit haben, stattdessen einfach die versteckte Karte auf die Rückseite der Karte zu setzen. </p> <h3 id=\"create-and-arrange-card-faces\"> Kartengesichter erstellen und anordnen </h3> <p> Anstatt jede Karte einzeln zu importieren, ist es am besten, alle oder die meisten Karten als einzelnes Deck zu importieren. </p> <p> Um ein Deck zu erstellen, kopieren Sie jedes Design und fügen Sie es auf ein 7x10-Kartenblatt ein. Die Verwendung einer Vorlage wie der folgenden erleichtert Ihnen den Einstieg. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> Die Vorlage beschreibt Slots für jede Karte in Ihrem Deck, sodass Sie bis zu 69 Karten gleichzeitig importieren können. Wenn Sie nicht so viele benötigen, können Sie Slots ungenutzt lassen, und wenn Sie mehr haben, können Sie nach dem Import Decks kombinieren oder Karten duplizieren. </p> <p> Sie müssen diese Vorlage jedoch nicht verwenden. Ein Kartenblatt kann tatsächlich jede beliebige Größe haben und TTS schneidet es automatisch in ein 7x10-Raster. </p> <p> Zu Ihrer Bequemlichkeit sind die obige Vorlage und eine quadratische Kartenvorlage in Ihrem lokalen TTS-Dateiverzeichnis verfügbar. </p> <p> Wenn Sie sich nicht sicher sind, wo sich Ihre lokalen Dateien befinden, können Sie sie in Ihrer Steam-Bibliothek finden, indem Sie das <strong> Eigenschaften </strong> Menü für TTS. Wähle aus <strong> Lokale Dateien </strong> Tab und klicken Sie <strong> Durchsuche </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Kartenrückseiten </h3> <p> Wenn Sie nur ein Design für die gesamte Rückseite des Decks haben möchten, brauchen Sie nur ein einzelnes JPG-Bild des Designs; es wird kein Kartenblatt benötigt. </p> <p> Wenn Ihr Deck mehrere einzigartige Rückseiten haben soll, müssen Sie einen zusätzlichen Kartenbogen mit Rückseitendesigns erstellen, die den Gesichtsdesigns in Ihrem ersten Kartenbogen entsprechen. Platzieren Sie für das Gesichtsdesign in Steckplatz 1 die dafür vorgesehene Rückseite in Steckplatz 1 Ihres Rückblatts. Platzieren Sie für Gesicht zwei die Rückseite in Steckplatz zwei und so weiter. </p> <h3 id=\"hidden-cards\"> Versteckte Karten </h3> <p> Platzieren Sie in Steckplatz 70 des Kartenblatts mit der Aufschrift &quot;Versteckte Karte für andere Spieler&quot; auf der Vorlage ein beliebiges Design, das für die Gegner sichtbar sein soll, wenn sich die Karten in diesem Stapel in der Hand eines Spielers befinden. Dies ist traditionell einfarbig schwarz oder weiß oder weist das Rückendesign des Decks auf. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Elemente importieren </h2> <p> Nachdem Sie Ihre Boards und Decks erstellt haben, können Sie mit dem Importieren beginnen. </p> <p> Bevor Sie tatsächlich einen Server mit Ihrem Spiel hosten, ist es hilfreich, ein Einzelspieler-Spiel zu starten und die Elemente im Voraus zu importieren. Sie können dann das Setup speichern und sofort loslegen, wenn die Spieler eintreffen. </p> <p> Starten Sie TTS und klicken Sie auf <strong> Erstellen </strong> , und wählen Sie dann <strong> Einzelspieler </strong> die Umgebung zu schaffen. Löschen Sie alle von TTS generierten Elemente und wählen Sie den Tisch aus, an dem Ihr Spiel gespielt werden soll. </p> <p> Wenn die Umgebung bereit ist, klicken Sie auf <strong> Objekte </strong> im oberen Menü und wählen Sie dann die <strong> Benutzerdefiniert </strong> Kategorie. </p> <h3 id=\"boards-and-player-mats\"> Bretter und Spielermatten </h3> <p> Wählen <strong> Tafel </strong> von dem <strong> Benutzerdefiniert </strong> Menü und klicken Sie auf eine beliebige Stelle in der Tabelle, an der das Board angezeigt werden soll. Klicken Sie mit der rechten Maustaste auf eine beliebige Stelle, um das Dialogfeld für den Board-Import zu öffnen. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Navigieren Sie zu Ihrem Bild des Boards und TTS wird Sie fragen, ob Sie es in Ihr Steam Cloud-Konto hochladen oder eine lokale Datei behalten möchten. Laden Sie die Dateien in die Cloud hoch, wenn Sie Ihr Spiel jemals online oder auf einem anderen Gerät spielen möchten. </p> <p> Sie können Ihre Bilder optional auf einen anderen Host wie Dropbox, Photobucket oder Imgur hochladen und die URL hier einfügen. Externe Hosts sind jedoch weniger zuverlässig und werden nicht empfohlen. </p> <p> Wenn Sie es in Ihre Steam Cloud hochladen, fordert TTS Sie auf, ihm einen Dateinamen zu geben. Klicken Sie nach Abschluss des Hochladens auf <strong> Importieren </strong> . </p> <p> Wenn das Board importiert ist, können Sie es jetzt mit dem verkleinern oder vergrößern <strong> - </strong> und <strong> + </strong> Tasten auf Ihrer Tastatur. Um es zu fixieren, damit es während des Spiels nicht versehentlich bewegt wird, klicke mit der rechten Maustaste auf das Brett und unter <strong> Umschalten </strong> , klicken <strong> Sperren </strong> . </p> <h3 id=\"card-decks\"> Kartendecks </h3> <p> In dem <strong> Benutzerdefiniertes Objekt </strong> Menü, klick <strong> Deck </strong> . Klicken Sie auf eine beliebige Stelle in der Tabelle, an der das Deck erscheinen soll, und klicken Sie dann mit der rechten Maustaste, um den Import zu starten. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Passen Sie die Einstellungen wie folgt an: </p> <ul> <li> <strong> Art: </strong> Ändern Sie dies, wenn Sie eine andere Form als eine normale rechteckige Karte mit runden Ecken im Sinn haben. </li> <li> <strong> Gesicht: </strong> Drücke den <strong> Lokale Dateien durchsuchen </strong> Knopf und suchen Sie Ihr Gesichtskartenblatt. Auch hier empfehlen wir die Steam Cloud-Option über lokale Dateien oder externe Hosts. </li> <li> <strong> Einzigartige Rückseiten: </strong> Aktivieren Sie diese Option, wenn Ihr Deck mehrere Rückseitendesigns hat, und laden Sie dann Ihr Rückseitenblatt in das . hoch <strong> Zurück </strong> Box. Wenn Sie ein einzelnes Design für das gesamte Deck verwenden, laden Sie stattdessen einfach Ihr Back-Design hoch. </li> <li> <strong> Breite und Höhe: </strong> Passen Sie dies an, wenn Sie ein anderes Verhältnis als die rechteckige Standardkarte 10x7 verwendet haben. </li> <li> <strong> Nummer: </strong> Stellen Sie sicher, dass dies der Anzahl der Karten entspricht, die Sie importieren. </li> <li> <strong> Seitwärts: </strong> Dies ändert die Ausrichtung für die <strong> Alt-Zoom </strong> Funktion in TTS. Lassen Sie es deaktiviert, es sei denn, Sie möchten, dass die Karte seitlich angezeigt wird. </li> <li> <strong> Zurück ist versteckt: </strong> Aktivieren Sie dies, wenn Sie möchten, dass die versteckte Ansicht Ihrer Karten einfach die Rückseiten der Karten ist. </li> </ul> <p> Wenn Ihre Einstellungen korrekt sind, klicken Sie auf <strong> Importieren </strong> . Ihr Deck wird auf dem Tisch erscheinen und Sie können mit dem Mischen und Austeilen beginnen. </p> <p> Wenn Sie möchten, dass Ihre Karten Namen haben, die beim Sortieren helfen, klicken Sie mit der rechten Maustaste auf eine einzelne Karte und klicken Sie auf <strong> Name </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Importieren anderer Spielelemente </h2> <p> Das Importieren anderer 2D-Objekte ähnelt dem Importieren von Boards. Vergiss nicht, dass TTS viele gängige Spielelemente wie Würfel und Figuren enthält, die im Spiel einsatzbereit sind <strong> Objekte </strong> Speisekarte. </p> <p> Wenn Sie benutzerdefinierte 3D-Elemente verwenden möchten, folgen Sie <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> Anleitung von TTS zum Importieren von 3D-Modellen </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Speichern eines kompletten Spiels </h2> <p> Nachdem Sie die Komponenten in einem anfänglichen Einrichtungszustand angeordnet haben, klicken Sie auf die Schaltfläche <strong> Spiele </strong> Schaltfläche im oberen Menü. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Wählen <strong> Speichern &amp; laden </strong> und klicke auf <strong> Spiel speichern </strong> Taste. Gib ihm einen Namen und klicke <strong> speichern </strong> . Jetzt können Sie jedes Mal, wenn Sie Spiele hosten, diese im perfekten Setup neu laden, indem Sie auf die <strong> Speichern &amp; laden </strong> Speisekarte. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Das Beste aus benutzerdefinierten Tabletop-Gaming herausholen </h2> <p> Das Entwerfen und Spielen von benutzerdefinierten Spielen ist im Tabletop-Simulator einfach, sobald Sie wissen, wie es geht. Lade deine Freunde ein oder suche nach bereiten und willigen Testspielern in <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> die TTS-Community </a> . Jetzt können Sie Ihr benutzerdefiniertes Spiel anderen präsentieren! </p>"}