{"title":"So installieren Sie einen intelligenten Garagentor-Controller","content":"<p> Sie möchten Ihr Garagentor mit Ihrem Smartphone oder Tablet steuern? Eine intelligente Steuerung ist eine großartige Option, wenn Sie bereits einen Garagentoröffner in Ihrem Haus installiert haben. </p> <p> Wir zeigen Ihnen, wie Sie eine smarte Garagentorsteuerung installieren. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Unterschiede zwischen einem Opener und einem Controller </h2> <p> Es gibt zwei Hauptunterschiede zwischen einem intelligenten Garagentoröffner und einem Controller. Die erste ist die Größe. </p> <p> Die meisten Öffner sind groß und werden an der Decke Ihrer Garage montiert. Sie verwenden eine mechanische Schiene, um die Tür zu öffnen und zu schließen. Ein Garagentor-Controller hingegen ist eine kleine elektronische Einheit, mit der Sie den Öffner über eine App auf einem Smart-Gerät steuern können. </p> <p> Der zweite Unterschied zwischen diesen beiden Produkten ist der Preis. Garagentoröffner können etwa 300 US-Dollar kosten. Die Installation dieser Öffner erfordert normalerweise die Hilfe eines professionellen Installateurs. </p> <p> Ein Controller benötigt jedoch in der Regel keine professionelle Installation. Stattdessen fungiert der Controller als Ergänzung zu Ihrem bestehenden Öffner. </p> <p> Dies bedeutet, dass Sie für einen Bruchteil des Preises eines neuen Öffners die gleiche Funktionalität nur mit einem Controller erreichen können. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> Was sind die Vorteile eines intelligenten Garagentors? </h2> <p> Es gibt drei Hauptvorteile eines intelligenten Garagentors. </p> <ul> <li> <strong> Sicherheit </strong> —Mit einem intelligenten Garagentor können Sie das Tor von fast überall öffnen und schließen. </li> <li> <strong> Sicherheit </strong> —Die meisten intelligenten Garagentoröffner und -steuerungen warnen Sie, wenn Ihre Garage für eine bestimmte Zeit geöffnet war. </li> <li> <strong> Bequemlichkeit </strong> —Wenn Sie jemals nach Hause zurückkehren mussten, um Ihr Garagentor zu schließen, dann spart eine intelligente Garagentor-App Zeit. Anstatt nach Hause zu fahren, zücken Sie einfach Ihr Telefon. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> So installieren Sie einen intelligenten Garagentor-Controller </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Wenn Sie sich entschieden haben, dass eine intelligente Garagentorsteuerung das Richtige für Sie ist, zeigt Ihnen diese Anleitung, wie Sie eine installieren. In dieser Demonstration, a <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meross MSG100 </a> verwendet wird, aber dieser Vorgang ist ähnlich, wenn Sie eine andere Marke verwenden. Weitere Informationen finden Sie in der Dokumentation Ihres Controllers. </p> <h3 id=\"what-you-ll-need\"> Was du brauchen wirst </h3> <ul> <li> Ein intelligenter Garagencontroller </li> <li> Heftpistole oder Drahthalterungen </li> <li> Garagentor mit eingebautem Autoöffner </li> <li> Kreuzschlitz- und Schlitzschraubendreher </li> <li> Leiter </li> </ul> <h3 id=\"plan-the-installation\"> 1. Planen Sie die Installation </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Bevor Sie Ihren Controller installieren, müssen Sie einige Stellen in Ihrer Garage auskundschaften. Die erste ist eine Stromquelle für den Controller. Der zweite ist der Kabelpfad vom Controller zum an der Tür montierten Sensor, der in Ihrem Kit enthalten ist. Und die dritte ist die Position des Magnetsensors. </p> <p> Dieser Magnetsensor ermöglicht es der Steuerung zu wissen, wann die Tür geöffnet oder geschlossen wird. </p> <p> Die meisten Controller verwenden ein langes Kabel, um den Türsensor anzuschließen. Sie müssen diesen Draht entweder über die Decke oder eine Wand hinunter verlegen, um den Draht aus dem Weg zu halten. </p> <p> Sobald Sie Ihre Installation geplant haben, testen Sie das Sensorkabel vom Controller an der Sensorposition. Dieser Testsitz stellt sicher, dass Ihr Sensorkabel Ihren Controller erreicht. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Schalten Sie die Stromversorgung Ihres Garagentoröffners aus </h3> <p> Die meisten Garagentore werden irgendwo in der Decke mit Strom versorgt. Bei diesen Openern sollten Sie sicherstellen, dass sie nicht angeschlossen sind, bevor Sie fortfahren. </p> <p> Wenn Ihr Öffner keinen Stecker hat und stattdessen an Kabeln angeschlossen ist, die aus der Decke herauskommen, müssen Sie Ihren Unterbrecherkasten finden und den Strom zum Öffner dort abschalten. </p> <p> <strong> Hinweis: </strong> 120-Volt-Hausstrom kann schwere Verletzungen verursachen. Wenn Sie mit der Arbeit mit Elektrizität nicht vertraut sind, hören Sie jetzt auf und wenden Sie sich an einen professionellen Garagentorinstallateur und/oder Elektriker. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Verbinden Sie die mitgelieferten Kabel mit dem Controller </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> An der Meross-Einheit gibt es einen Satz blauer und brauner Drähte, die in die Steuerung installiert werden müssen, um eine Verbindung zum Garagentoröffner herzustellen. Öffnen Sie die Plastikabdeckung des Controllers, und Sie sollten zwei Schraubklemmen sehen. </p> <p> Lösen Sie mit einem kleinen Schlitzschraubendreher die Schrauben an jeder Klemme. Legen Sie Ihre Drähte ein und ziehen Sie die Schrauben fest. Es spielt keine Rolle, welches Kabel wohin führt. </p> <p> Ziehen Sie leicht an den Drähten, um sicherzustellen, dass sie sicher sind. Bringen Sie dann die Abdeckung des Controllers wieder an. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Montieren Sie die Garagentorsteuerung </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Da Sie Ihre Standorte geplant haben, ist es jetzt an der Zeit, Ihren Controller zu montieren. Stellen Sie sicher, dass sich der Controller an einem Ort befindet, an dem er auf die benötigte Leistung zugreifen kann, ohne die Verkabelung zu belasten. </p> <p> Als nächstes entfernen Sie die klebrige Rückseite des Controllers und drücken Sie ihn fest. Wenn Sie einen Controller mit Schraubbefestigung haben, verwenden Sie den Schraubendreher, um den Controller in Position zu sichern. </p> <h3 id=\"mount-the-sensor\"> 5. Montieren Sie den Sensor </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> Als nächstes müssen Sie den Sensor für die Tür montieren. Es wird empfohlen, diesen Sensor so zu platzieren, dass er den Weg der Tür nicht behindert. </p> <p> Außerdem könnten Sie versucht sein, den Sensor in Bodennähe zu montieren. Dies wird nicht empfohlen, da Wasser, das wiederholt direkt auf den Sensor spritzt, diesen beschädigen kann. Nachdem Sie den Sensor positioniert haben, verwenden Sie das mitgelieferte doppelseitige Klebeband oder die Schrauben, um ihn zu befestigen. </p> <p> Auf dem Foto oben wurde der schwarze Sensor neben dem Garagentor montiert, wobei der Magnetteil an der Tür selbst montiert ist. Dieser Sensor verwendet doppelseitiges Klebeband zur Befestigung. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Schließen Sie die Sensorkabel an </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Jetzt ist es Zeit, die Drähte mit dem Sensor und dem Controller zu verbinden. Verlegen Sie die Drähte nach dem Plan, den Sie im ersten Schritt erstellt haben, und befestigen Sie die Drähte mit dem Tacker an der Wand oder Decke. </p> <p> Achten Sie darauf, die Drähte nicht einzuklemmen oder zu knicken, da sie dadurch beschädigt werden können. Wenn sie verlegt sind, verbinden Sie den roten weiblichen Stoßverbinder am Controller mit dem roten männlichen Stoßverbinder am Ende des Sensorkabels. </p> <p> Als nächstes müssen Sie die Abdeckung Ihres Garagentoröffners öffnen. Es sollten vier Drähte vorhanden sein, zwei steuern die Stromversorgung und das Gerät gemeinsam und zwei steuern die Taste an der Wand. </p> <p> </p> <p> Normalerweise stammen diese Drähte von der Decke und sollten gecrimpte Kabelschuhe haben, die sie an der Garagentoröffnereinheit befestigen. Wenn Sie nicht feststellen können, welche Kabel welche sind, halten Sie an und konsultieren Sie die Bedienungsanleitung Ihres Garagentoröffners oder wenden Sie sich an einen zertifizierten Elektriker. </p> <p> Wenn Sie die Drähte gefunden haben, verbinden Sie die braunen und blauen Drähte vom Controller mit den Klemmen am Öffner, die mit der Wandtaste verbunden sind. Auf dem Foto oben wurden die Controller-Drähte in die beiden linken Klemmen eingeführt. </p> <p> Wenn Sie fertig sind, sollten an jedem Wandtaster-Terminal zwei Drähte angeschlossen sein. Befestigen Sie die Abdeckung Ihres Garagentoröffners wieder, schließen Sie den Controller und den Öffner an und die Installation sollte abgeschlossen sein. </p> <p> Im nächsten Schritt verbinden Sie den Controller mit einem drahtlosen Netzwerk. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Verbinden Sie den Controller mit dem WLAN </h3> <p> <strong class=\"gallery__section-title\"> Bildergalerie (3 Bilder) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Erweitern <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Erweitern <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <p> Um die WLAN-Konnektivität einzurichten, haben wir die Meross-App verwendet. Es ist verfügbar für <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> und <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . Dieser Vorgang besteht fast immer aus dem Öffnen der App, dem Identifizieren Ihres Produkts, dem Verbinden der App mit Ihrem WLAN, dem Öffnen des Einstellungsbildschirms und dem Zugriff des Controllers auf Ihr Netzwerk. </p> <p> Öffne hier die App und tippe dann auf <strong> Intelligenter Garagentoröffner </strong> und dann <strong> Start </strong> . Wählen Sie den Hersteller und das Modell des Garagentoröffners aus, den Sie mit der Steuerung verwenden. Stellen Sie sicher, dass Sie die spezifischen Anweisungen für Ihre App befolgen. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Legen Sie das Zeitintervall für das Öffnen/Schließen fest </h3> <p> <strong class=\"gallery__section-title\"> Bildergalerie (3 Bilder) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Erweitern <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Erweitern <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <p> Eine Sache, die Sie vor dem Testen Ihres neuen Controllers einstellen müssen, ist das Timing des Garagentoröffners. In der Meross App können Sie zwischen 10 Sekunden und 40 Sekunden in Fünf-Sekunden-Intervallen wählen oder eine individuelle Einstellung für Türen hinzufügen, die eine gerade Anzahl von Sekunden zum Schließen benötigen. </p> <p> Das Einstellen des Zeitpunkts für Ihre Tür ist einfach, aber Sie müssen es richtig machen. Ein zu kurzes Intervall lässt das Tor teilweise geöffnet, und eine zu lange Einstellung kann den Motor des Garagentoröffners übermäßig belasten. </p> <p> Zum Einstellen des Intervalls benötigen Sie eine Uhr mit Sekundenzeiger oder eine Stoppuhrfunktion. Sie können auch den integrierten Timer Ihres Telefons verwenden. Bereiten Sie Ihren Timer vor und stellen Sie sich in die Nähe des Knopfes Ihres Garagentoröffners. Drücken Sie dann die Taste gleichzeitig mit Start auf Ihrer Stoppuhr oder notieren Sie die Zeit auf dem Sekundenzeiger. </p> <p> Warten Sie, bis sich Ihr Garagentor nicht mehr bewegt und notieren Sie die Zeit. Dies ist Ihr Intervall. Übertragen Sie diese Informationen in die App und die Intervalleinstellung ist abgeschlossen. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Testen Sie die Garagentorsteuerung </h3> <p> Öffnen und schließen Sie die Tür mit Ihrer App einige Male, um sicherzustellen, dass alles funktioniert. Sie sollten jetzt in der Lage sein, Ihr Garagentor mit dem Wandknopf oder der App zu öffnen. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Genießen Sie Ihren intelligenten Garagentor-Controller </h2> <p> Es muss kein Vermögen kosten, Ihre Smart-Home-Technologie in ein Garagentor zu bringen. </p> <p> Die Installation einer neuen intelligenten Garagentorsteuerung bietet Ihnen und Ihrer Familie mehr Flexibilität, Sicherheit und Komfort für Ihr Zuhause. Es bietet auch die Gewissheit, dass Ihr Garagentor von fast überall aus gesteuert werden kann. </p>"}