{"title":"So beheben Sie den BSOD-Stopcode &quot;SYSTEM THREAD EXCEPTION NOT HANDLED&quot; in Windows 10","content":"<p> Die &quot;SYSTEMTHREAD EXCEPTION NOT HANDLED&quot; ist ein häufiger Windows 10-Fehler, der hauptsächlich aufgrund eines veralteten oder inkompatiblen Treibers auftritt. </p> <p> Was die Behebung schwieriger als bei anderen BSODs macht, ist, dass mehrere Treiber das Problem verursachen können und Ihr Computer manchmal nicht alle erkennt. Aus diesem Grund sollten Benutzer als ersten Schritt bei der Behebung dieses Fehlers den genauen Treiber finden, der das Problem verursacht. </p> <p> So beheben Sie den nicht behandelten Fehler der Systemthread-Ausnahme unter Windows 10. </p> <h2 id=\"boot-into-safe-mode\"> 1. Booten Sie in den abgesicherten Modus </h2> <p> Der erste Schritt, den Benutzer unternehmen sollten, bevor sie versuchen, dieses Problem zu beheben, besteht darin, ihren Computer im abgesicherten Modus zu starten. Abhängig von Ihren Präferenzen und ob Sie Ihren Computer über den Anmeldebildschirm starten können, gibt es mehrere Möglichkeiten, dies zu tun: </p> <h3 id=\"boot-into-safe-mode-via-settings\"> Booten Sie in den abgesicherten Modus über die Einstellungen </h3> <ol> <li> Klick auf das <strong> Start </strong> Taste, dann wählen Sie <strong> die Einstellungen </strong> . </li> <li> Navigieren Sie zu <strong> Update &amp; Sicherheit </strong> dann klick auf <strong> Wiederherstellung </strong> . </li> <li> Unter <strong> Fortgeschrittenes Start-up, </strong> klicke auf <strong> Jetzt neustarten. </strong> </li> <li> Wenn Ihr PC neu startet <strong> Wähle eine Option </strong> Bildschirm sollte erscheinen. </li> <li> Von hier aus gehen Sie zu <strong> Problembehandlung &gt; Erweiterte Optionen &gt; Starteinstellungen </strong> . Dann klick auf <strong> Neu starten </strong> </li> <li> Wenn Ihr PC neu startet, drücken Sie <strong> F5 </strong> um Ihren Computer zu booten <strong> Abgesicherten Modus mit Netzwerktreibern </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> Vom Anmeldebildschirm aus </h3> <ol> <li> Einfach gedrückt halten <strong> Verschiebung </strong> und wählen Sie die <strong> Leistung </strong> Taste gefolgt von <strong> Neu starten </strong> . </li> <li> Befolgen Sie die Schritte 4, 5 und 6 aus dem obigen Abschnitt. </li> </ol> <h3 id=\"from-a-blank-screen\"> Von einem leeren Bildschirm </h3> <ol> <li> Wenn Sie den Anmeldebildschirm nicht erreichen können, führen Sie diese Schritte aus. </li> <li> Halten Sie die Ein-/Aus-Taste Ihres Geräts 10 Sekunden lang gedrückt, um es auszuschalten. </li> <li> Drücken Sie den Netzschalter erneut, um es zu starten. </li> <li> Sobald Ihr PC startet, d.h. das Herstellerlogo erscheint, drücken Sie erneut den Power-Button für 10 Sekunden. </li> <li> Drücken Sie den Netzschalter, um Ihr Gerät zu starten. </li> <li> Wenn es richtig gemacht wird, bootet Ihr Computer in die <strong> Windows-Wiederherstellungsumgebung </strong> . </li> <li> Befolgen Sie die Schritte 4, 5 und 6 aus dem ersten Abschnitt. </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. Herausfinden, welcher Fahrer verantwortlich ist </h2> <p> Da der Fehler höchstwahrscheinlich durch einen fehlerhaften Treiber verursacht wird, können Sie das Windows-Protokoll verwenden, um herauszufinden, welcher. </p> <p> Führen Sie dazu einfach diese Schritte aus: </p> <ol> <li> Drücken Sie <strong> Windows-Taste + R </strong> und in der <strong> Lauf </strong> Dialogfeld, Typ <strong> eventvwr. </strong> </li> <li> Navigieren Sie zum <strong> Windows-Protokolle </strong> Menü und erweitern Sie es, dann wählen Sie <strong> System. </strong> </li> <li> Suchen Sie nach einem Protokoll namens <strong> system_thread_Exception_not_handled </strong> und klicken Sie darauf, um herauszufinden, welcher Treiber das Problem verursacht. </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> Normalerweise ist der zugehörige Treiber ein Anzeigetreiber oder ein Netzwerktreiber, da diese berüchtigt dafür sind, diesen BSOD zu verursachen. Wenn die zugehörige Datei zufällig ist <strong> nvlddmkm.sys </strong> , kannst du dir anschauen <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> einige einfache Möglichkeiten, es zu beheben. </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. Rollback oder Update der Treiber </h2> <p> Je nachdem, welcher Treiber für den Fehler „Nicht behandelte Systemthread-Ausnahme“ verantwortlich ist, müssen Sie die zugehörigen Treiber möglicherweise entweder aktualisieren oder neu installieren. </p> <p> Wenn der Treiber längere Zeit nicht aktualisiert wurde, wird das Problem höchstwahrscheinlich durch eine Aktualisierung des Treibers behoben. Wenn der Treiber kürzlich aktualisiert wurde, ist es möglicherweise am besten, den Treiber zurückzusetzen oder die Updates neu zu installieren. </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> So aktualisieren Sie Treiber unter Windows 10 </h3> <ol> <li> Drücken Sie <strong> Windows-Taste + R </strong> und tippe ein <strong> devmgmt.msc </strong> die öffnen <strong> Gerätemanager </strong> . </li> <li> Navigieren Sie zum zugehörigen Gerät und erweitern Sie das Menü. Wenn der Fehler beispielsweise von einem Anzeigetreiber verursacht wurde, müssen Sie die <strong> Display-Adapter </strong> Möglichkeit. </li> <li> Klicken Sie mit der rechten Maustaste auf den Treiber und klicken Sie auf <strong> Treiber aktualisieren </strong> . </li> <li> Klicken Sie im sich öffnenden Dialogfeld auf <strong> Automatisch nach aktualisierter Treibersoftware suchen </strong> . </li> <li> Windows durchsucht dann automatisch das Internet nach den neuesten Treibern und installiert sie. </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> So führen Sie ein Rollback von Treibern unter Windows 10 durch </h3> <ol> <li> Öffnen <strong> Gerätemanager </strong> und navigieren Sie zu dem betreffenden Treiber. </li> <li> Erweitern Sie das Menü und klicken Sie mit der rechten Maustaste auf den Treiber. </li> <li> Klicke auf <strong> Eigenschaften </strong> . </li> <li> Unter dem <strong> Treiber </strong> Registerkarte, klicken Sie auf <strong> Rollback-Treiber </strong> . </li> <li> Windows führt automatisch ein Rollback auf die letzte verfügbare Version des Treibers durch. </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. Benennen Sie die fehlerhafte Datei um </h2> <p> Beim Abrufen des Dateinamens, der mit dem Fehler &quot;Nicht behandelte Systemthread-Ausnahmebedingung&quot; verknüpft ist, sollten Benutzer die Datei umbenennen. Dadurch erstellt Windows eine neue Kopie und installiert sie erneut. Treiberdateien befinden sich unter <strong> C:\\Windows\\System32\\Treiber </strong> </p> <p> Führen Sie diese Schritte aus, um die Datei umzubenennen: </p> <ol> <li> Öffnen <strong> Dateimanager </strong> und gehe zu <strong> C:\\Windows\\System32\\Treiber </strong> </li> <li> Suchen Sie nach dem betroffenen Fahrer </li> <li> Klicken Sie darauf und drücken Sie <strong> F2. </strong> </li> <li> Ersetzen Sie die Dateinamenerweiterung durch <strong> .alt </strong> . </li> <li> Drücken Sie die Eingabetaste und starten Sie Ihren Computer neu. </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. Verwenden Sie SFC und DISM, um Systemdateien zu reparieren </h2> <p> SFC und DISM sind zwei leistungsstarke Tools, die jedem Windows-Benutzer zur Verfügung stehen. In Kombination können sie nahezu alle systembedingten Fehler finden und beheben. Sie sind auch ziemlich einfach auszuführen. </p> <p> </p> <p> Stellen Sie sicher, dass Sie einen Systemwiederherstellungspunkt erstellen, da diese Befehle Systemdateien ändern. </p> <h3 id=\"how-to-use-dism\"> Verwendung von DISM </h3> <ol> <li> Lauf <strong> Eingabeaufforderung </strong> als Administrator </li> <li> Geben Sie in der Konsole ein <strong> DISM /Online /Cleanup-Image /ScanHealth </strong> und drücken Sie die Eingabetaste. </li> <li> Warten Sie, bis Windows den Scanvorgang abgeschlossen hat. Geben Sie dann ein <strong> DISM /Online /Cleanup-Image /RestoreHealth </strong> </li> <li> Windows repariert alle Probleme, die während des Scans gefunden wurden. </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> So verwenden Sie SFC </h3> <ol> <li> Geben Sie in der Suchleiste des Startmenüs ein <strong> cmd </strong> dann rechtsklick auf <strong> Eingabeaufforderung </strong> und führen Sie es als Administrator aus. </li> <li> Geben Sie in der Konsole ein <strong> sfc /scannow </strong> </li> <li> Seien Sie geduldig, da Windows einige Zeit braucht, um beschädigte Systemdateien zu scannen und zu ersetzen. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. Verwenden Sie die Systemwiederherstellung, um Ihren PC wiederherzustellen </h2> <p> Wenn das Problem weiterhin ungelöst bleibt, müssen Sie die Systemwiederherstellung als letzten Ausweg verwenden. Die Systemwiederherstellung ist eine Funktion, die Windows in einen früheren Zustand zurückversetzt. Diese Wiederherstellungspunkte werden regelmäßig und bei der Installation neuer Software erstellt. Alternativ können Sie einstellen <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows zum täglichen Erstellen eines Wiederherstellungspunkts </a> </p> <h3 id=\"how-to-use-system-restore\"> So verwenden Sie die Systemwiederherstellung </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> Geben Sie in der Suchleiste des Startmenüs ein <strong> Schalttafel </strong> und klicken Sie auf Öffnen. </li> <li> Geben Sie in der Suchleiste der Systemsteuerung ein <strong> Wiederherstellung </strong> und öffnen Sie es aus den Ergebnissen. </li> <li> Klicke auf <strong> Offene Systemwiederherstellung </strong> . </li> <li> Klicke auf <strong> Nächster </strong> und wählen Sie einen Wiederherstellungspunkt aus der Liste aus. </li> <li> Klicke auf <strong> Fertig. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> Ausnahme behandelt </h2> <p> Die oben aufgeführten Tipps bieten eine einfache Lösung für die Belästigung, die BSODs wie system_thread_exception_not_handled verursachen. Das Beste daran ist, dass die meisten Tipps auch verwendet werden können, um viele andere häufige Blue Screen of Death (BSOD)-Fehler in Windows zu diagnostizieren. </p>"}