{"title":"So führen Sie einen sauberen Neustart in Windows 10 durch","content":"<p> Sie haben wahrscheinlich eine Vielzahl von Anwendungen von Drittanbietern auf Ihrem Windows-Computer installiert. Keine Sorge, die meisten Leute tun es. </p> <p> Von der Ausführung grundlegender Aufgaben wie dem Surfen im Internet bis hin zum Austeilen komplexer Codezeilen bevorzugen Benutzer alternative Anwendungen aus den in Windows integrierten Anwendungen. Obwohl diese Anwendungen unser Leben erleichtern, stören sie manchmal Systemfunktionen. Diese können von kleineren Pannen bis hin zu kritischen Fehlern und BSODs reichen. </p> <p> Hier kommt Clean Boot ins Spiel. </p> <h2 id=\"what-is-a-windows-clean-boot-anyway\"> Was ist überhaupt ein Windows Clean Boot? </h2> <p> Ein sauberer Neustart von Windows 10 ermöglicht es Benutzern, Anwendungen von Drittanbietern als Fehlerursache auszuschließen. Dies erfolgt durch einfaches Booten des Geräts mit deaktivierten Anwendungen von Drittanbietern. Und obwohl der Name so klingt, als wäre es eine integrierte Windows-Funktion, ist er es nicht. Sie müssen Ihren Computer manuell sauber booten. </p> <p> Die Vorteile eines sauberen Neustarts beschränken sich nicht nur auf die Fehlerdiagnose. Es ist bekannt, dass es hilft, wenn <a href=\"https://www.makeuseof.com/tag/fix-windows-update-error-0x80070057/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows-Updates werden nicht richtig installiert </a> . Es ist auch besonders nützlich, wenn sich Ihr Betriebssystem träge anfühlt und Sie überprüfen möchten, was das Problem möglicherweise verursacht. </p> <p> </p> <p> </p> <h2 id=\"how-to-clean-boot-and-fix-errors\"> So bereinigen Sie den Start und beheben Fehler </h2> <p> Sauberes Booten ist ein relativ einfacher Vorgang, nachdem Benutzer es einige Male versucht haben. </p> <p> Bevor Sie die Schritte auflisten, sollten Benutzer wissen, dass einige Aktionen Administratorrechte erfordern. Ihr Computer funktioniert möglicherweise auch nicht so, wie Sie es gewohnt sind, aber Sie müssen nicht schwitzen. Dies geschieht, weil Benutzer manchmal nicht einmal wissen, dass einige untergeordnete Aufgaben von Software von Drittanbietern erledigt werden. </p> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-128.png\" loading=\"lazy\"> </p> <p> Hier sind die Schritte zum sauberen Booten von Windows 10: </p> <ol> <li> Geben Sie in die Suchleiste des Startmenüs ein <strong> sysconfig </strong> und klicke auf <strong> Systemkonfiguration </strong> . </li> <li> In dem <strong> Systemkonfiguration </strong> Fenster, geh zum <strong> Dienstleistungen </strong> Tab. </li> <li> Überprüf den <strong> Verstecke alle Microsoft-Dienste </strong> Box. </li> <li> Überprüfen Sie alle Dienste in der Liste und klicken Sie auf <strong> Alle deaktivieren </strong> befindet sich unten rechts, dann speichern und beenden. </li> <li> Öffnen Sie nun die <strong> Taskmanager </strong> . Sie können dies tun, indem Sie mit der rechten Maustaste auf die Taskleiste klicken und auswählen <strong> Taskmanager </strong> oder verwenden <strong> Strg + Alt + Entf </strong> . </li> <li> In dem <strong> Taskmanager </strong> Fenster, navigieren Sie zum <strong> Anlaufen </strong> Tab. </li> <li> Wählen Sie alle Dienste nacheinander aus und klicken Sie auf <strong> Deaktivieren </strong> . </li> <li> Ausgang <strong> Taskmanager </strong> und <strong> Neu starten </strong> dein Computer. </li> </ol> <p> <img alt=\"Startup tab in the task manager\" src=\"images/startup-tab-task-manager-383.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"fixing-errors-with-clean-boot\"> Beheben von Fehlern mit Clean Boot </h2> <p> Nachdem Sie die oben aufgeführten Schritte ausgeführt haben, wird Ihr <a href=\"https://www.makeuseof.com/tag/clean-computer-original-state-reinstalling-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> PC bootet in einen sauberen Zustand. </a> Das erste, was Benutzer tun sollten, ist zu warten und zu überprüfen, ob der gleiche Fehler erneut auftritt. Manchmal kann die Fehlerquelle Windows-Systemdateien sein. In diesem Fall wird der Fehler angezeigt, kann jedoch länger dauern als bei einem normalen Start. </p> <p> Wenn der Fehler nicht auftaucht, ist es an der Zeit, die Verdächtigen einzugrenzen. Dies ist eine etwas mühsame Aufgabe, aber leider auch die beste Lösung. Um die Liste einzugrenzen, gehen Sie wie folgt vor: </p> <ol> <li> Öffnen Sie in einem sauberen Boot-Zustand <strong> Systemkonfiguration </strong> . </li> <li> Unter dem <strong> Dienstleistungen </strong> Registerkarte, wählen Sie die obere Hälfte der Liste aus und klicken Sie auf <strong> Aktivieren </strong> . Stellen Sie sicher, dass die <strong> Verstecke alle Microsoft-Dienste </strong> Kästchen ist angekreuzt. </li> <li> Jetzt offen <strong> Taskmanager </strong> und geh zum <strong> Anlaufen </strong> Tab. </li> <li> Aktivieren Sie auf ähnliche Weise die obere Hälfte der Dienste und starten Sie Ihren Computer neu. </li> </ol> <p> Wenn der Fehler nach dem Neustart nicht auftritt, können Sie die ausgewählte Software und Dienste aus der Täterliste ausschließen. Sie müssen diese Schritte wiederholen, bis Sie das zuständige Programm oder den zuständigen Dienst gefunden und deinstalliert haben. </p> <p> </p> <h2 id=\"clean-boot-windows-10-to-isolate-errors\"> Clean Boot Windows 10, um Fehler zu isolieren </h2> <p> Jetzt ist es an der Zeit, Windows 10 standardmäßig neu zu starten. Einfach offen <strong> Systemkonfiguration </strong> und <strong> Taskmanager </strong> und aktivieren Sie alle Dienste und Programme. Es wird empfohlen, dass Benutzer einen sauberen Neustart durchführen, bevor sie auf erweiterte Fehlerbehebungen zurückgreifen, wenn Windows abstürzt oder ein BSOD anzeigt. </p>"}