{"title":"Schauen Sie sich die Browserversion von Microsofts xCloud an","content":"<p> Wenn Sie sehnsüchtig auf Neuigkeiten zum xCloud-Browserport gewartet haben, ist heute Ihr Glückstag, denn Sie können einen Blick darauf werfen, wie es tatsächlich aussieht. </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> Tester enthüllen xCloud-Browser-Screenshots </h2> <p> xCloud ist derzeit auf einer Reihe von Geräten verfügbar, aber wir warten noch darauf, dass Microsoft die Browserversion offiziell veröffentlicht. </p> <p> Details waren ziemlich spärlich ... bis jetzt. Laut einem Bericht von <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> Der Rand </a> , &quot;Quellen, die mit Microsofts Xbox-Plänen vertraut sind&quot;, behaupten, &quot;Mitarbeiter testen jetzt eine Webversion von xCloud vor einer öffentlichen Vorschau&quot;. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Hier ist ein erster Blick auf Microsofts xCloud für das Web <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> — Der Rand (@rand) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> 15. Februar 2021 </a></blockquote>  <p> Vergessen Sie nicht, dass dies nur Bilder von Testern sind, was bedeutet, dass Microsoft – obwohl es unwahrscheinlich ist – das Aussehen der xCloud-Browserversion vollständig ändern könnte. </p> <p> Aus Screenshots geht hervor, dass xCloud ähnlich wie die Android-Version eingerichtet ist, die auf Smartphones und Tablets verfügbar ist. </p> <p> Sie können kürzlich hinzugefügte Spiele oben im Screenshot sehen, gefolgt von einem Abschnitt &quot;In Kürze verfügbar&quot;. Darunter haben Sie verschiedene Optionen, um ein Spielgenre Ihrer Wahl auszuwählen, wobei die vollständige xCloud-Spielbibliothek am Ende der Seite verfügbar ist. </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> Wie greifen Sie in Ihrem Browser auf xCloud zu? </h2> <p> Derzeit können Sie nicht. Die öffentliche Version des Webports von xCloud ist noch nicht verfügbar. Das bedeutet, dass Sie etwas länger warten müssen, wenn Sie über Ihren Browser auf xCloud zugreifen möchten. Angeblich plant Microsoft, den Dienst im zweiten Quartal 2021 öffentlich zu enthüllen. </p> <p> Bis dahin müssen Sie andere Methoden für den Zugriff auf xCloud finden. Derzeit können Sie nur auf Android-Geräten auf den Cloud-Gaming-Dienst zugreifen (Sie benötigen die Browserversion, um auf iOS zu spielen, dank <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> ein Streit zwischen Apple und Microsoft </a> ). </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> Können Sie auf andere Weise auf xCloud-Spiele zugreifen? </h2> <p> Nun ja und nein. Auf xCloud kann man sozusagen auf keine Titel zugreifen. Es sei denn, Sie verwenden dazu ein Android-Gerät und die offizielle Game Pass-App. </p> <p> Die Spiele, die im Cloud-Gaming-Dienst von Microsoft verfügbar sind, sind jedoch alle im Game Pass verfügbar. Tatsächlich erhalten Sie im Rahmen eines Game Pass Ultimate-Abonnements Zugriff auf xCloud. Sie können also weiterhin über Ihre Xbox oder einen Windows-PC auf diese Spiele zugreifen. </p> <p> Also, mit einem Wort, ja. Sie können auf diese Spiele auf andere Weise zugreifen. Verwenden Sie xCloud nur nicht, es sei denn, Sie haben Zugriff auf die Android-Version. </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud: Demnächst auf einem iOS-Gerät in Ihrer Nähe verfügbar </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> Sie sollten nicht lange warten müssen, bis Sie die Cloud-Gaming-Plattform von Microsoft ergattern können. Sobald xCloud getestet wurde, wird Microsoft alle notwendigen Änderungen vornehmen, bevor wir uns alle ansehen und hoffentlich nicht lange danach auch damit spielen. </p>"}