{"title":"Sony FX3-Kamera über Twitter-Leak enthüllt","content":"<p> Es ist erst zwei Wochen her, seit Sony die Veröffentlichung der Sony A1 angekündigt hat, einer 8,6K-Kamera, die 50-MP-Bilder mit bis zu 30 Bildern pro Sekunde aufnehmen kann. Aber rührt das Unternehmen noch ein bisschen mehr? </p> <p> Alles, was wir derzeit haben, sind reine Spekulationen, aber Sony könnte seiner FX-Serie eine neue schlanke und kompakte Kamera hinzufügen. </p> <h2 id=\"a-preview-of-the-sony-fx3\"> Eine Vorschau der Sony FX3 </h2> <p> Am Mittwoch twitterte Nokishita ein Bild der Sony FX3, einer Kamera, die die Canon EOS C70 und die Pocket Cinema 6K von Blackmagic Design herausfordern könnte. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> FX3の画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> #噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> — (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> 10. Februar 2021 </a></blockquote>  <p> Nokishita ist ein japanischer Tech-Blog, der für frühe, genaue Leaks von kommender Foto- und Videoausrüstung berüchtigt ist. Obwohl es sich nicht um eine offizielle Quelle für optische Produktunternehmen handelt, gehen einige Leute so weit zu sagen, dass die von Nokishita geteilten Informationen genauso gut bestätigt werden könnten. </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> TechRadar </a> Nokishita nannte Nokishita einst &quot;den Weihnachtsmann der Kameragerüchte&quot;. Als Antwort auf den obigen Tweet fragte Twitter-Nutzer @miemelaar: &quot;[ist] das echt oder ein Konzept?&quot; und @rauuru_san antwortete mit &quot;Wenn Nokishita es veröffentlicht, ist es das einzig Wahre.&quot; </p> <p> Aber selbst wenn wir davon ausgehen würden, dass das Leck wahr ist, wie viele Informationen bleiben uns dann wirklich? </p> <p> Wir könnten annehmen, dass die FX3 aufgrund ihres Namens Teil der FX-Linie ist, aber die Kamera trägt ein Symbol, das viele Spekulanten verwirrt. Wenn Ihnen das weiße Alpha-Zeichen (α) auf der Vorderseite der Kamera bekannt vorkommt, liegt das daran, dass Sie dasselbe auf den spiegellosen Kameras von Sony finden. </p> <p> Ist die FX3 also eine Cine-Kamera, eine spiegellose Kamera oder eine Art DSLR-ähnlicher Hybrid? Wir müssen warten, bis weitere Details bekannt werden. Lesen Sie bis dahin unseren Artikel über die <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> Hauptunterschiede zwischen spiegellosen Kameras, DSLRs und Camcordern </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> Was bringt die Sony FX3 auf den Tisch? </h2> <p> Seit Nokishitas Tweet gefallen ist, fliegen die angeblichen Produktspezifikationen der Kamera im Internet herum. Allerdings noch nichts aus ebenso seriösen Quellen. </p> <p> Zum Glück sollten wir in den kommenden Wochen mehr über die Sony FX3 erfahren. Japans größte Fotoveranstaltung CP+ 2021 findet vom 25. bis 28. Februar statt. </p>"}