{"title":"So verbessern Sie Ihre Lightroom-Bearbeitungsfähigkeiten: 10 einfache Möglichkeiten","content":"<p> Adobe Lightroom ist eine der bekanntesten Fotobearbeitungsplattformen auf dem Markt. Diese Lösung ist nicht nur wegen ihrer vielen nützlichen Funktionen beliebt, sondern auch wegen ihrer Benutzerfreundlichkeit. </p> <p> Wenn Fotografen ihr Handwerk etwas ernster nehmen möchten, kaufen sie als Erstes eine Bearbeitungssoftware. Aber selbst wenn Sie nur ein Gelegenheitsfotograf sind, bietet Lightroom viele Möglichkeiten, Ihre Freunde zu begeistern. </p> <p> In diesem Handbuch erfahren Sie, wie Sie Ihre Fotos in Lightroom auf einfache Weise verbessern können. Diese Tipps funktionieren sowohl für Lightroom Classic als auch für Lightroom Creative Cloud. </p> <h2 id=\"use-masking\"> 1. Maskierung verwenden </h2> <p> Wenn Sie Ihr Foto standardmäßig schärfen, fügen Sie dem gesamten Bild Details hinzu – sogar die Bereiche, die Sie nicht möchten. Dies kann zu viel Getreide an unerwünschten Stellen führen, wie am Himmel und im Wasser. </p> <p> Sie laufen auch Gefahr, dass Ihr Foto eher wie eine Zeichnung aussieht als wie etwas, das Sie mit Ihrer Kamera aufgenommen haben. Glücklicherweise gibt es eine einfache Lösung. </p> <p> Scrollen Sie in der Lightroom-App nach unten zu <strong> Detail </strong> . Wenn Sie dort sind, gehen Sie zu <strong> Schärfung </strong> &gt; <strong> Maskierung </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Scrollen Sie mit dem Schieberegler, bis die Teile des Bildes, die Sie schärfen möchten, ausgewählt sind. Um zu sehen, was Sie maskieren, drücken Sie die <strong> Alt </strong> gleichzeitig auf Ihrer Tastatur drücken. </p> <p> Wenn Sie den gewünschten Bereich maskiert haben, scrollen Sie den Schärferegler so weit oder so wenig wie nötig. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Verwenden Sie Kameraprofile anstelle der Standard-Adobe-Profile </h2> <p> Wenn Sie ein Bild in RAW hochladen, fügt Adobe standardmäßig eines seiner Programmprofile hinzu. Und während diese Ihr Bild in einigen Fällen möglicherweise besser aussehen lassen, ist es oft besser, ein kameraspezifisches Bild zu wählen. </p> <p> Wenn Sie ein Kameraprofil verwenden, lässt sich das Bild basierend auf dem, was Sie mit Ihrem Gerät aufgenommen haben, einfacher bearbeiten. </p> <p> Um das Profil deines Fotos zu ändern, gehe zu <strong> Profile </strong> &gt; <strong> Kameraabgleich </strong> . Sie können dann wählen aus <strong> Standard </strong> , <strong> Neutral </strong> , <strong> Landschaft </strong> , und andere Blicke. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Merken: </strong> Sie können das Bildprofil nicht so tief ändern, wenn Sie nur JPEGs aufnehmen. Bevor Sie also losgehen, um ein paar Aufnahmen zu machen, stellen Sie Ihre Kamera auf entweder <strong> ROH </strong> oder <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Streichen Sie über Teile Ihres Bildes </h2> <p> Haben Sie jemals die Klarheit, Sättigung oder Details Ihres gesamten Bildes erhöht und ein Meisterwerk erwartet, aber stattdessen ein Bild erhalten, das aussieht, als wäre es in einer Mikrowelle aufgenommen worden? Wenn dies der Fall ist, können Sie stattdessen davon profitieren, nur Teile Ihres Bildes zu optimieren. </p> <p> In Lightroom können Sie auf eine Funktion namens . zugreifen <strong> Bürste </strong> . Sie können damit Teile Ihres Bildes &quot;überstreichen&quot;, während Sie den Rest in Ruhe lassen. </p> <p> Um dieses Tool zu verwenden, gehen Sie zum <strong> Bürste </strong> Symbol auf der rechten Seite Ihres Bildschirms. Sie können Ihren Pinsel vergrößern oder verkleinern, je nachdem, wie viel von dem Bild Sie bearbeiten möchten. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Bevor Sie mit dem Pinseln beginnen, ändern Sie die Bildeigenschaften, die Sie optimieren möchten. Sie können beispielsweise den Klarheitsschieberegler nach oben schieben, wenn Sie einen Teil des Bildes klarer machen möchten. </p> <p> Nachdem Sie diese Funktionen geändert haben, streichen Sie über die Bereiche, die Sie bearbeiten möchten. Drücken Sie <strong> Ö </strong> auf Ihrer Tastatur, um zu sehen, wo Sie überstrichen haben. </p> <p> Wenn Sie in einem bestimmten Bereich zu viel gegangen sind, halten <strong> Minus </strong> ( <strong> - </strong> ) Taste und streichen Sie über diese Teile, um Ihre Änderungen zu löschen. Wissen <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Tastenkombinationen für Adobe Lightroom </a> ist in solchen Situationen praktisch, also vergiss nicht, sie aufzufrischen! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Besäumen Sie Ihre Fotos </h2> <p> Manchmal nimmt Ihre Kamera Fotos auf, bei denen die Kanten unnatürliche Farben aufweisen. Diese werden Sie besonders bei Aufnahmen in grellem Sonnenlicht bemerken. Sie kommen hauptsächlich in Grün- und Violetttönen vor. </p> <p> Scrollen Sie nach unten zu , um Ihre Fotos zu entschärfen <strong> Ausfransen </strong> . Sie können wählen, ob Sie lila oder grüne Fransen loswerden möchten. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> Benutzen <strong> Menge </strong> um zu entscheiden, wie viel Defringe Sie hinzufügen möchten. Verschieben Sie den Farbbalken, bis Sie mit den Ergebnissen zufrieden sind. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Verwenden Sie die Geometrie, um Ihre Fotos zu begradigen </h2> <p> Egal wie sehr Sie sich bemühen, eine Kamera gerade zu halten ist schwierig, es sei denn, Sie haben ein Stativ. Aber dank der Magie der Bearbeitungssoftware ist das Begradigen Ihrer Bilder ganz einfach. </p> <p> In Lightroom können Sie Ihre Fotos automatisch begradigen, indem Sie zum <strong> Ernte </strong> Sektion. Es gibt jedoch einen genaueren Weg, um das gleiche Ergebnis zu erzielen. </p> <p> Wählen Sie auf der rechten Registerkarte die oberste Option aus. Scrollen Sie dann nach unten zu <strong> Geometrie </strong> . Wenn du hier bist, gehe zu <strong> Aufrecht </strong> &gt; <strong> Niveau </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> Sie können auch entlang gerader Linien zeichnen, um das Foto so gerade wie möglich zu machen. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Passen Sie die Größe Ihres Schärfbereichs an </h2> <p> Sie kennen sich jetzt mit Maskieren aus, aber wussten Sie, dass Sie auch bestimmte Bereiche Ihres Fotos schärfen können? </p> <p> Um den Bereich im maskierten Foto auszuwählen, den Sie schärfen möchten, gehen Sie zu <strong> Schärfung </strong> , halte das <strong> Alt </strong> Schlüssel und gehen Sie zu <strong> Radius </strong> . Durch Anpassen dieses Schiebereglers können Sie Ihren Schärfbereich vergrößern oder verkleinern. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> Gehen Sie danach zum <strong> Schärfung </strong> Bar. Halten Sie in ähnlicher Weise die <strong> Alt </strong> Taste und schieben Sie den Schieberegler nach rechts. Dadurch können Sie ganz einfach einen bestimmten Bereich Ihres Fotos schärfen und nicht das gesamte Bild. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Verwenden Sie die Farbpunktkurven </h2> <p> Wenn die Farbe Ihres Bildes auch nach dem Anpassen des Weißabgleichs nicht richtig aussieht, sollten Sie sich die Farbpunktkurven in Lightroom ansehen. Sie können diese verwenden, um bestimmte Farben in Ihrem Bild anzupassen. </p> <p> In der App finden Sie drei verschiedene Farbkurvenfelder: Rot, Blau und Grün. </p> <p> Um zu diesen Farbkurven zu gelangen, scrollen Sie nach unten zu <strong> Punktkurve </strong> . Klicken Sie dann auf die Farbe, die Sie ändern möchten. Sie können dann mit den Farben herumspielen, wie Sie es mit dem Standard tun würden <strong> Punktkurve </strong> Tab. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Geben Sie für jeden Schieberegler eine Zahl ein und passen Sie sie entsprechend an </h2> <p> Neue Fotografen werden oft von der Vielzahl der verfügbaren Bearbeitungsmöglichkeiten begeistert sein. Wenn sie Lightroom öffnen, verschieben sie jeden Balken viel zu weit in die eine oder andere Richtung. Aber anstatt ihr Image zu verbessern, landen sie in einem übertriebenen Durcheinander. </p> <p> Beim Bearbeiten Ihrer Fotos ist es wichtig, kleine Änderungen vorzunehmen. Die Chancen stehen gut, dass Sie bereits ein guter Fotograf sind und das Bild, das Sie aufgenommen haben, nur noch ein wenig nach der Produktion verfeinert werden muss. </p> <p> </p> <p> Anstatt jeden Schieberegler frei zu bewegen, versuchen Sie, die Anzahl der Bereiche zu ändern, um die Sie ändern möchten <strong> +10 </strong> oder <strong> -10 </strong> . Wenn Sie der Meinung sind, dass mehr Arbeit erforderlich ist, wiederholen Sie den Vorgang. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Wenn Sie das Gefühl haben, Ihnen nahe zu sein, bewegen Sie jeden Schieberegler langsam nach links oder rechts, bis Sie zufrieden sind. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Beschneiden Sie Ihre Fotos </h2> <p> Zuschneiden mag offensichtlich erscheinen, aber viele Fotografen nutzen diese Funktion immer noch zu wenig. Es ist auch wichtig, Ihre Bilder zuzuschneiden, je nachdem, wo Sie sie verwenden möchten. Andernfalls werden sie verzerrt. </p> <p> Um Ihre Fotos zuzuschneiden, gehen Sie zum <strong> Ernte </strong> Symbol. Dies ist die zweithöchste von oben. Gehe zu <strong> Seitenverhältnis </strong> , um die Größe zu ändern, und ziehen Sie an den Ecken, um unerwünschte Objekte zu entfernen. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> Nachdem Sie mit dem Zuschneiden fertig sind, klicken Sie auf <strong> Eingeben </strong> auf Ihrem Computer und die Änderungen werden wirksam. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Verwenden Sie das Histogramm </h2> <p> Das Lightroom-Histogramm ist leicht zu ignorieren, aber wichtig zu kennen. Dieses kleine Diagramm zeigt Ihnen, wo Farben und Beleuchtung in Ihrem Bild ungleich sind, sodass Sie eine sauberere Bearbeitung erstellen können. </p> <p> Als Faustregel gilt, dass ein gut bearbeitetes Foto nur wenige Spitzen im Histogramm aufweist. Manchmal ist dies unvermeidlich. Im Allgemeinen sollten Sie jedoch darauf achten, die Grafik so gleichmäßig wie möglich zu gestalten. </p> <p> Je nach verwendeter Lightroom-Version können Sie das Histogramm mehr oder weniger direkt bearbeiten. In Lightroom Classic können Sie auf das Histogramm klicken und Dinge ausgleichen, indem Sie über bestimmte Abschnitte gleiten. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> In Creative Cloud ist das Histogramm ebenfalls in der oberen rechten Ecke sichtbar – aber Sie müssen die Schieberegler selbst ändern, damit das Histogramm verschoben wird. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> Bei beiden Versionen der Plattform ist das Histogramm oben auf Ihrem Bildschirm über den Bearbeitungsfunktionen verfügbar. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> Großartige Bearbeitung ist nicht nur für die Profis </h2> <p> Lightroom ist eine hervorragende Bearbeitungssoftware für alle, die ihre Fotografie auf die nächste Stufe bringen möchten. Und selbst wenn Sie die Plattform noch nie benutzt haben, müssen Sie sich keine Sorgen machen, da sie leicht zu erlernen ist. </p> <p> Denken Sie beim Bearbeiten Ihrer Fotos in Lightroom daran, dass weniger oft mehr ist. Neben diesen Tipps ist es eine gute Idee, nach der Bearbeitung einen Schritt zurückzutreten und später zurückzukehren, um zu sehen, ob sie so gut bearbeitet sind, wie Sie dachten. </p>"}