{"title":"So sehen Sie, wer Ihnen auf Facebook folgt","content":"<p> Wenn es Ihnen genauso wichtig ist, mehr Follower auf Facebook zu bekommen, wie Sie es mögen, Facebook-Freunde zu gewinnen, möchten Sie vielleicht sehen, wer Ihnen auf Facebook folgt. Sie können dies sowohl auf dem Desktop als auch auf dem Handy problemlos tun. </p> <p> So finden Sie heraus, wie viele Follower Sie auf Facebook haben. </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-desktop\"> So sehen Sie, wer Ihnen auf Facebook folgt (Desktop) </h2> <p> Auf dem Desktop sehen Sie, wer Ihnen auf Facebook folgt, aber nicht die Anzahl der Follower. Mit der mobilen Facebook-App können Sie jedoch sehen, wer Ihnen folgt und wie viele Follower Sie haben. </p> <p> <img alt=\"Facebook profile interface with friends\" src=\"images/click-more-and-select-followers-786.jpg\" loading=\"lazy\"> </p> <p> Melden Sie sich zuerst bei Ihrem <a href=\"https://web.facebook.com\" target=\"_blank\" rel=\"nofollow noopener\"> Facebook-Konto </a> über Ihren Browser und verwenden Sie die folgenden Anweisungen, um Ihre Facebook-Follower anzuzeigen: </p> <ol> <li> Klicken Sie nach der Anmeldung auf das <strong> kleines Bildsymbol </strong> neben Ihrem Namen in der Seitenleiste. </li> <li> Klicken Sie im Profilmenü auf <strong> Freunde </strong> . </li> <li> Klicken Sie im Menü Freunde auf das <strong> Mehr </strong> Dropdown nach rechts. </li> <li> Wählen Sie aus der Dropdown-Liste <strong> Anhänger </strong> um alle Ihre Facebook-Follower anzuzeigen. </li> </ol> <p> </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-mobile\"> So sehen Sie, wer Ihnen auf Facebook folgt (Mobil) </h2> <p> Wie bereits erwähnt, können Sie mit der mobilen Facebook-App auf die Liste und die Anzahl der Personen zugreifen, die Ihnen auf Facebook folgen. </p> <p> <strong class=\"gallery__section-title\"> Bildergalerie (3 Bilder) </strong> <img alt=\"Facebook profile about info menu\" src=\"images/tap-see-your-about-info-732.png\" loading=\"lazy\"> Erweitern <img alt=\"Mobile Facebook interface displaying Facebook followers\" src=\"images/tap-see-all-to-load-a-list-of-your-followers-895.png\" loading=\"lazy\"> Erweitern <img alt=\"Mobile Facebook page displaying a list of followers and their numbers\" src=\"images/look-to-the-upper-right-corner-to-see-the-number-of-followers-677.png\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <p> Melden Sie sich über die mobile App bei Ihrem Facebook-Konto an. Folgen Sie dann diesen Anweisungen: </p> <ol> <li> Tippen Sie auf der Startseite der mobilen App auf das runde Bildsymbol neben dem <strong> Was haben Sie auf dem Herzen? </strong> Suchleiste, um Ihr Profil zu laden. </li> <li> Tippen Sie im Profilmenü auf <strong> Sehen Sie sich Ihre Info an </strong> . </li> <li> Scrollen Sie zum Ende der Seite. Dann unter <strong> Anhänger </strong> , Zapfhahn <strong> Alles sehen </strong> um eine Liste aller Ihrer Facebook-Follower zu laden. </li> <li> Schauen Sie in die rechte obere Ecke der Seite (gegenüber <strong> Anhänger </strong> ), um die Anzahl der Personen zu sehen, die Ihnen auf Facebook folgen. </li> </ol> <p> Sie haben nicht die Möglichkeit, Ihre Facebook-Follower zu überprüfen, wenn Sie keine haben. Infolgedessen können Sie Ihre Follower nicht überprüfen, wenn Sie die obigen Schritte ausführen, da es keine gibt. </p> <p> Möglicherweise erhalten Sie diese Option auch nicht, wenn Ihr Facebook-Konto neu ist, da Sie wahrscheinlich noch keine Follower haben. Oder musst du vielleicht <a href=\"https://www.makeuseof.com/tag/quickly-switch-facebook-profiles/\" target=\"_blank\" rel=\"nofollow noopener\"> zu einem anderen Facebook-Konto wechseln </a> . Alternativ ist Ihr Konto möglicherweise nicht so eingestellt, dass Personen Ihnen auf Facebook folgen können – wir erklären Ihnen unten, wie Sie dies ändern können. </p> <p> </p> <p> </p> <h2 id=\"how-to-give-the-public-access-to-follow-you-on-facebook\"> So geben Sie der Öffentlichkeit Zugang, um Ihnen auf Facebook zu folgen </h2> <p> Wenn Sie der Öffentlichkeit untersagt haben, Ihnen zu folgen, schränkt dies manchmal die Chancen ein, mehr Facebook-Follower zu gewinnen. </p> <p> Das liegt daran, dass Personen, die nicht auf Ihrer Freundesliste stehen, Ihnen auf Facebook nicht folgen können, wenn Sie dies nicht erlauben. Sie können Ihre Follow-Präferenz jedoch auf &quot;Öffentlich&quot; festlegen, damit jeder Ihnen folgen kann und nicht nur Ihre Freunde. </p> <p> <strong> Um dies auf dem Desktop zu tun: </strong> </p> <p> <img alt=\"Facebook privacy settings page\" src=\"images/click-on-public-post-and-change-who-can-follow-you-to-public-880.jpg\" loading=\"lazy\"> </p> <ol> <li> Gehen Sie zu Ihrem Profil. </li> <li> Drücke den <strong> Rundes Dropdown-Symbol </strong> in der oberen rechten Ecke der Menüleiste. </li> <li> Wählen Sie aus der Liste <strong> Einstellungen &amp; Datenschutz </strong> . </li> <li> Klicken <strong> die Einstellungen </strong> . </li> <li> Klicken Sie in der Seitenleiste des Menüs Einstellungen auf <strong> Öffentliche Beiträge </strong> . </li> <li> Schauen Sie rechts von der <strong> Wer kann mir folgen </strong> Option und klicken Sie auf die <strong> Freunde </strong> Dropdown-Liste. </li> <li> Wählen <strong> Öffentlichkeit </strong> um jedem Follow-Zugriff zu gewähren, einschließlich denen, die nicht deine Freunde auf Facebook sind. </li> </ol> <p> <strong> Um dies in der mobilen Facebook-App zu tun: </strong> </p> <p> <strong class=\"gallery__section-title\"> Bildergalerie (3 Bilder) </strong> <img alt=\"Facebook menu list\" src=\"images/tap-the-three-menu-bars-and-go-to-settings-170.png\" loading=\"lazy\"> Erweitern <img alt=\"Facebook settings list\" src=\"images/scroll-down-and-select-public-posts-754.png\" loading=\"lazy\"> Erweitern <img alt=\"Facebook followers settings page\" src=\"images/tick-the-public-option-under-who-can-follow-728.png\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <ol> <li> Öffne die mobile Facebook-App und tippe auf das <strong> drei horizontale Menüleisten </strong> rechts neben der Startseite. </li> <li> Scrollen Sie nach unten und wählen Sie <strong> die Einstellungen </strong> . </li> <li> Zapfhahn <strong> Öffentliche Beiträge </strong> . </li> <li> Unter <strong> Wer kann mir folgen </strong> , ankreuzen <strong> Öffentlichkeit </strong> . </li> </ol> <p> </p> <h2 id=\"keep-control-over-your-facebook-followers\"> Behalten Sie die Kontrolle über Ihre Facebook-Follower </h2> <p> Wenn Sie Facebook verwenden, um für Ihre Marke oder Ihr Unternehmen zu werben, ist es notwendig, Ihre Follower im Auge zu behalten. Es ist eine gute Möglichkeit, zu moderieren, was die Leute über Sie sehen können. </p> <p> Wenn Sie mehr Kontrolle über Ihre Facebook-Freunde und -Follower haben möchten, sollten Sie erwägen, sie aus Ihrem Feed auszublenden. </p>"}