{"title":"So setzen Sie Ihre Apple Music-Empfehlungen zurück","content":"<p> Apple Music hatte früher eine leicht zugängliche Möglichkeit, Ihre Musikempfehlungen neu zu kuratieren, indem Sie Ihre Lieblingskünstler und Musikgenres neu auswählen. Leider hat Apple während eines App-Updates diese Methode zum Aktualisieren Ihrer Musikkuration entfernt. </p> <p> Keine Angst, hier finden Sie eine Anleitung zu alternativen Methoden zum Stoppen oder Zurücksetzen Ihrer automatischen Apple Music-Vorschläge. </p> <h2 id=\"apple-music-recommendations-explained\"> Apple Music-Empfehlungen erklärt </h2> <p> Wenn Sie Ihr Apple Music-Konto zum ersten Mal starten, werden Sie aufgefordert, Ihre Favoriten aus einer breiten Liste von Musikgenres und Künstlern auszuwählen. Mit dieser Kuration schlägt Apple Music Playlists, Alben, Künstler und Songs vor, die sich in der Zukunft befinden. </p> <p> Wenn Sie beispielsweise Classic Rock, New Rock und Foo Fighters als Ihre Lieblingsmusik auswählen, würde Apple Music wahrscheinlich sehr ähnliche Hörstationen vorschlagen und kürzlich veröffentlichte Rockmusik bewerben. </p> <p> Änderungen an der App bedeuten, dass Sie Ihre Musikeinstellungen nur noch während der ersten Kontoerstellung kuratieren können, Sie können sie zu einem späteren Zeitpunkt nicht mehr zurücksetzen – obwohl Apple Music seine Vorschläge weiterhin basierend auf Ihren Hörgewohnheiten ändert. </p> <p> Dies ist nur eines von mehreren nützlichen <a href=\"https://www.makeuseof.com/tag/apple-music-features-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Zu verwendende Apple Music-Funktionen </a> . </p> <p> Keine Sorge, es gibt noch einige Möglichkeiten, wie Sie Ihre Apple Music-Kuration zurücksetzen können, indem Sie entweder Ihre Apple-ID-Einstellungen deaktivieren oder Ihr Apple Music-Konto löschen und neu erstellen. </p> <p> Beide Optionen haben Vor- und Nachteile, also lassen Sie uns herausfinden, welche die beste Option für Sie ist. </p> <p> </p> <h2 id=\"turn-off-personalized-recommendations\"> Personalisierte Empfehlungen deaktivieren </h2> <p> Das Deaktivieren personalisierter Empfehlungen für deine Apple-ID ist eine gute Möglichkeit, um keine neuen Vorschläge mehr zu sehen. </p> <p> Wenn Sie diese Option deaktivieren, werden Ihre vorhandenen Kurationsdaten nicht entfernt, d. h. die App erstellt weiterhin Vorschläge basierend auf Ihrer Nutzung. Du wirst sie einfach nicht mehr sehen. Das Deaktivieren personalisierter Empfehlungen wirkt sich auch auf Ihre Empfehlungen in anderen Apple-Dienst-Apps aus, z. B. in Apple Books. </p> <p> So deaktivieren Sie personalisierte Empfehlungen auf einem iPhone: </p> <ol> <li> Öffne das <strong> Apple-Musik </strong> App. </li> <li> Gehe zum <b> Hör jetzt zu </b> Tab. </li> <li> Öffnen Sie Ihr Apple Music-Profil, indem Sie das kreisförmige Symbol mit der Silhouette einer Person in der oberen rechten Ecke des Bildschirms auswählen. Wenn Sie zuvor ein Bild als persönliches Profilbild hochgeladen haben, erscheint dieses anstelle der Silhouette. </li> <li> Wählen <b> Zeige Apple ID </b> die Sie finden können, indem Sie zum unteren Rand des <b> Konto </b> Seite. </li> <li> Ausschalten <b> Personalisierte Empfehlungen </b> . </li> <li> Wählen <b> Getan </b> in der oberen rechten Ecke, und Sie sind fertig. </li> </ol> <p> <strong class=\"gallery__section-title\"> Bildergalerie (3 Bilder) </strong> <img alt=\"Apple Music Lisen Now featuring Halle x Chloe\" src=\"images/apple-music-listen-now-page-713.jpg\" loading=\"lazy\"> Erweitern <img alt=\"Apple Music Account Options Screenshot\" src=\"images/apple-music-account-page-914.jpg\" loading=\"lazy\"> Erweitern <img alt=\"Apple ID Options Screenshot\" src=\"images/apple-id-account-page-817.jpg\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <p> Danach wirken sich alle neuen Musiksuchen, Downloads oder Playthroughs in Apple Music nicht mehr auf Ihre automatischen Vorschläge aus. Dadurch werden Ihre vorherigen Suchen nicht automatisch gelöscht, was bedeutet, dass es eine Weile dauern kann, bis Sie die Auswirkungen dieser Methode bemerken. </p> <p> </p> <h2 id=\"delete-your-apple-music-profile\"> Löschen Sie Ihr Apple Music-Profil </h2> <p> Wenn Sie ein komplettes Apple Music-Makeover mit neuen Musikvorschlägen benötigen, ist es am besten, Ihr Apple Music-Profil zu löschen und neu zu erstellen. </p> <p> Beachten Sie, dass durch das Löschen Ihres Profils Ihre aktuelle Musikbibliothek vollständig entfernt wird. Wenn Sie ein neues Profil erstellen, können Sie völlig neue Musik- und Genreeinstellungen auswählen, aber auch alle vorherigen Apple Music-Verläufe vollständig entfernen. </p> <p> </p> <p> Wenn Sie an einem brandneuen Apple Music-Profil mit neu ausgewählten Favoriten interessiert sind, führen Sie die folgenden Schritte aus, um eines zu erstellen: </p> <ol> <li> Von dem <strong> Hör jetzt zu </strong> Tab, gehen Sie zu Ihrem Apple Music <strong> Konto </strong> , und wählen Sie <b> Profil anzeigen </b> . </li> <li> Wählen <b> Bearbeiten </b> in der Mitte des Bildschirms unter Ihrem Namen. </li> <li> Scrollen Sie zum unteren Bildschirmrand und wählen Sie <b> Profil löschen </b> . Seien Sie gewarnt, dies ist eine dauerhafte Löschung, die ein Zurücksetzen des Kontos erfordert. </li> <li> Richten Sie für sich selbst ein neues Apple Music-Profil ein, das jetzt frei von Ihrer alten Auswahl ist. Wenn Sie personalisierte Empfehlungen wie im obigen Abschnitt beschrieben deaktiviert haben, werden Ihnen keine maßgeschneiderten Musikvorschläge mehr angezeigt. Verlassen <strong> Personalisierte Empfehlungen </strong> on führt dazu, dass Apple Music Musik basierend auf Ihren neuen Hörgewohnheiten vorschlägt. </li> <li> Stöbern Sie frei und genießen Sie eine Vielzahl neu ausgewählter Audiooptionen. </li> </ol> <p> <strong class=\"gallery__section-title\"> Bildergalerie (2 Bilder) </strong> <img alt=\"Apple Music Profile feat Halle x Chloe\" src=\"images/apple-music-profile-page-771.jpg\" loading=\"lazy\"> Erweitern <img alt=\"Apple Music Profile Options Screenshot\" src=\"images/apple-music-edit-profile-page-450.jpg\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> <p> </p> <h2 id=\"spotify-s-recommendations-might-be-better\"> Die Empfehlungen von Spotify könnten besser sein </h2> <p> Wenn Sie mit den Empfehlungen von Apple Music auch nach dem Erstellen eines neuen Profils immer noch nicht zufrieden sind, ist es möglicherweise an der Zeit, stattdessen die Musik-Streaming-Plattform zu wechseln. Apple Music und Spotify haben viele sehr ähnliche Funktionen, aber viele Leute sind der Meinung, dass Spotify beim Vorschlagen neuer Musik weit überlegen ist. </p> <p> Natürlich gibt es auch viele andere Faktoren, die bei der Wahl zwischen Apple Music und Spotify zu berücksichtigen sind. </p>"}