{"title":"So erstellen und verkaufen Sie Lightroom-Voreinstellungen: Die ultimative Anleitung","content":"<p> Heutzutage ist die Bearbeitung von Fotos genauso wichtig wie die Aufnahme, die Sie aufnehmen. Und eine der beliebtesten Plattformen für die Postproduktion ist Adobe Lightroom. </p> <p> Viele Fotografen sparen Stunden bei der Fotobearbeitung, indem sie Voreinstellungen erstellen. Sie können Ihre Voreinstellungen nicht nur schneller bearbeiten, sondern auch mit anderen teilen – und möglicherweise dafür bezahlt werden! </p> <p> In diesem Artikel erfahren Sie, wie Sie mit Lightroom Presets erstellen und online verkaufen. Außerdem erfahren Sie die besten Tipps zur Förderung Ihrer Kunst. </p> <h2 id=\"what-is-a-lightroom-preset\"> Was ist eine Lightroom-Voreinstellung? </h2> <p> Eine Lightroom-Voreinstellung ist eine Maske, die das Aussehen Ihres Fotos ändert, ohne dass Sie alle verschiedenen Schaltflächen in der App anpassen müssen. Das Hinzufügen zu einem Foto dauert Sekunden und ist großartig, wenn Sie ein bestimmtes Erscheinungsbild wünschen. </p> <p> Adobe bietet eine Vielzahl vorgefertigter Voreinstellungen sowohl in der Lightroom Classic- als auch in der Creative Cloud-App. Einige davon eignen sich hervorragend für Bilder, aber Sie werden feststellen, dass viele nicht gut zu Ihrem einzigartigen Stil passen. </p> <p> Um dieses Problem zu lösen, lässt Adobe Benutzern auch die Erstellung eigener Voreinstellungen zu. Sie können dies dann allen Ihren zukünftigen Bildern hinzufügen, um eine ähnliche Stimmung oder ein einheitliches Thema zu erzeugen. </p> <p> </p> <h2 id=\"how-to-create-a-lightroom-preset\"> So erstellen Sie eine Lightroom-Vorgabe </h2> <p> Das Erstellen einer Lightroom-Vorgabe ist einfach. Nachfolgend finden Sie eine Schritt-für-Schritt-Anleitung, wie Sie dies tun: </p> <ol> <li> Öffnen Sie die Lightroom Classic- oder Creative Cloud-App, je nach Wunsch. </li> <li> Importieren Sie Ihre Bilder in Lightroom und nehmen Sie die gewünschten Änderungen vor. </li> <li> Gehe zum <strong> Voreinstellungen </strong> Registerkarte am unteren Bildschirmrand. </li> <li> Klicken Sie oben rechts auf die drei Punkte. Tippen Sie dann auf <strong> Voreinstellung erstellen </strong> . </li> <li> Geben Sie Ihrem Preset einen Namen und drücken Sie <strong> speichern </strong> . </li> </ol> <p> <img alt=\"save a preset in adobe lightroom\" src=\"images/save-preset-screenshot-132.png\" loading=\"lazy\"> </p> <p> Achten Sie beim Bearbeiten Ihrer Fotos unbedingt darauf, dass Ihre Postproduktion nicht schlampig ist. </p> <p> </p> <h2 id=\"how-to-export-a-preset-in-lightroom\"> So exportieren Sie eine Vorgabe in Lightroom </h2> <p> Nachdem Sie Ihre Vorgabe in Lightroom gespeichert haben, können Sie sie auf Ihren Computer oder Ihr Laufwerk exportieren. Gehen Sie dazu folgendermaßen vor: </p> <ol> <li> Klicken Sie mit der rechten Maustaste auf die gespeicherte Voreinstellung und wählen Sie <strong> Export </strong> . <p> <img alt=\"Export Screenshot MUO\" src=\"images/muo-export-screenshot-114.png\" loading=\"lazy\"> </p> </li> <li> Wählen Sie aus, wohin Sie die Vorgabe exportieren möchten. </li> <li> Bestätigen Sie Ihre Auswahl mit einem Klick auf <strong> Export </strong> nochmal. <p> <img alt=\"export lightroom preset to desktop\" src=\"images/export-preset-lightroom-746.png\" loading=\"lazy\"> </p> </li> </ol> <p> </p> <h2 id=\"where-can-you-sell-your-lightroom-presets\"> Wo können Sie Ihre Lightroom-Presets verkaufen? </h2> <p> Bevor Sie Ihre Presets verkaufen, ist es eine gute Idee, Ihre Optionen zu recherchieren und die für Sie am besten geeignete auszuwählen. Hier ist eine Liste einiger beliebter Verkaufsstellen für Lightroom-Voreinstellungen sowie der Vor- und Nachteile ihrer Verwendung. </p> <h3 id=\"your-own-website\"> Ihre eigene Website </h3> <p> Wenn Sie planen, <a href=\"https://www.makeuseof.com/tag/best-website-builders-create-clean-online-portfolio/\" target=\"_blank\" rel=\"nofollow noopener\"> erstelle eine Webseite </a> , oder bereits eine besitzen, können Sie dort Ihre Lightroom-Presets verkaufen und das meiste Geld behalten. </p> <p> Um Ihre Presets auf Ihrer Website zu verkaufen, müssen Sie ein Angebot erstellen und herausfinden, wie Sie das Produkt liefern. Der einfachste Weg, dies zu tun, besteht darin, bei jedem Kauf eine Datei oder einen herunterladbaren Link zu senden. </p> <p> <strong> Die Vorteile einer eigenen Website: </strong> </p> <ul> <li> Die Leute kommen speziell zu Ihnen, was bedeutet, dass Sie nicht mit anderen auf einem Markt konkurrieren müssen. </li> <li> Sie müssen keine Marktplatzgebühren zahlen, was sich im Laufe der Zeit erheblich auf Ihre Gewinne auswirken kann. </li> <li> Sie werden professioneller aussehen. </li> <li> Benutzer werden Ihnen wahrscheinlich mehr auf Ihrer eigenen Website vertrauen als auf einer Shopfront auf einem Online-Marktplatz. </li> </ul> <p> <strong> Die Nachteile einer eigenen Website: </strong> </p> <ul> <li> Wenn Sie noch kein großes Online-Publikum haben, haben Sie möglicherweise Schwierigkeiten, zahlende Kunden zu gewinnen. </li> <li> Die Einrichtung Ihres Shops kostet Zeit und Geld. </li> <li> Sie müssen eine Vielzahl anderer Fähigkeiten erlernen, wie SEO und digitales Marketing. </li> </ul> <p> <strong> Sie sollten in Betracht ziehen, Presets auf Ihrer Website zu verkaufen, wenn Sie: </strong> </p> <ul> <li> Haben Sie eine anständige Online-Präsenz. </li> <li> Sind bereit, SEO und Website-Erstellung zu lernen. </li> </ul> <p> Auch wenn Sie noch keine große Online-Präsenz haben, ist es dennoch eine gute Idee, Ihre Presets trotzdem in Ihren Online-Shop hochzuladen. Wenn Sie dann mehr Follower anziehen, können diese Ihre Produkte kaufen, ohne dass Sie später die gesamte Einrichtungsarbeit erledigen müssen. </p> <h3 id=\"online-creative-marketplaces\"> Kreative Online-Marktplätze </h3> <p> Wenn Sie Ihre Presets nicht auf Ihrer Website verkaufen möchten, können Sie stattdessen aus verschiedenen Online-Marktplätzen auswählen. </p> <p> Einige der beliebtesten Online-Marktplätze für Creatives sind: </p> <ul> <li> <a href=\"https://creativemarket.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Kreativmarkt </a> </li> <li> <a href=\"https://www.etsy.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Etsy </a> </li> <li> <a href=\"https://exchange.adobe.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Exchange </a> </li> <li> <a href=\"https://sellfy.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Sellfy </a> </li> </ul> <p> <strong> Die Vorteile von Online-Marktplätzen: </strong> </p> <ul> <li> Sie müssen sich keine Sorgen um SEO, den Aufbau einer Zielgruppe oder enorme Einrichtungskosten machen. </li> <li> Im Laufe der Zeit werden sich Ihre Einnahmen erhöhen, wenn Sie ein erfolgreicher Verkäufer sind. </li> </ul> <p> <strong> Die Nachteile von Online-Marktplätzen: </strong> </p> <ul> <li> Diese Websites nehmen einen beträchtlichen Teil Ihrer Einnahmen ein. Sie müssen daher mehr verkaufen, als wenn Sie Ihre eigene Website verwenden würden. </li> <li> Sie sind nicht die einzige Person auf dieser Website. Wenn Ihr Stil nicht einzigartig genug ist, werden Sie nicht auffallen und niemand wird Ihre Produkte kaufen. </li> </ul> <p> <strong> Online-Marktplätze sind gut für: </strong> </p> <ul> <li> Benutzer ohne Online-Verkaufserfahrung, die aber verstehen möchten, wie E-Commerce funktioniert. </li> <li> Fotografen, die nicht viel Zeit haben, um einen eigenen Online-Shop einzurichten. </li> <li> Benutzer ohne großes Online-Publikum. </li> </ul> <p> </p> <h2 id=\"how-to-promote-your-presets\"> So bewerben Sie Ihre Voreinstellungen </h2> <p> Sobald Sie Ihre Voreinstellungen erstellt und hochgeladen haben, ist es an der Zeit, die Welt über Ihre Arbeit zu informieren. Es gibt verschiedene Möglichkeiten, Ihre Voreinstellungen zu promoten. Hier sind einige Optionen, die Sie ausprobieren können. </p> <h3 id=\"1-youtube\"> 1. <a href=\"https://www.youtube.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Youtube </a></h3> <p> Obwohl der Aufbau eines YouTube-Kanals Zeit in Anspruch nimmt, eignet sich die Plattform hervorragend, um Ihre Botschaft als Creative zu verbreiten. Das Publikum ist bereits da, was bedeutet, dass Sie nur herausfinden müssen, wie Sie es anziehen können. </p> <p> </p> <p> Um deine Voreinstellungen auf YouTube zu bewerben, musst du zuerst wertvolle Inhalte erstellen. Dokumentieren Sie Ihre Fotoerfahrungen und geben Sie anderen, die bessere Bilder machen möchten, praktische Tipps. Sie können auch darüber sprechen, wie Sie Ihre Voreinstellung erstellt haben, und Tutorials und Tipps geben, wie Benutzer ihre eigenen erstellen können. </p> <h3 id=\"2-instagram\"> 2. <a href=\"https://www.instagram.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Instagram </a></h3> <p> <img alt=\"adobe lightroom presets instagram\" src=\"images/lightroom-instagram-598.jpg\" loading=\"lazy\"> </p> <p> Wie Sie es von einer visuellen Plattform erwarten können, ist Instagram ein weiterer guter Ort, um Ihre Lightroom-Voreinstellungen zu bewerben. Die App hat sich in den letzten Jahren auch stärker in Richtung Online-Handel verlagert, was dazu führte, dass mehr Schöpfer ihre Produkte dort verkaufen. </p> <p> Wie bei YouTube müssen Sie nützliche Inhalte erstellen, bevor Sie Ihre Voreinstellungen verkaufen können. Sprechen Sie beim Hochladen von Bildern darüber, wie Sie sie bearbeitet haben, und geben Sie vielleicht sogar Fototipps. Sie können auch besprechen, was Sie gelernt haben, und andere ermutigen, sich an dem Gespräch zu beteiligen. </p> <p> </p> <p> Denken Sie neben Standard-Posts auch darüber nach, wie Sie Instagram Stories und Reels zu Ihrem Vorteil nutzen können. </p> <h3 id=\"telling-your-friends-and-family\"> 3. Deinen Freunden und deiner Familie davon erzählen </h3> <p> <img alt=\"promote lightroom presets\" src=\"images/promote-presets-to-friends-343.jpg\" loading=\"lazy\"> </p> <p> Haben Sie Freunde und Familie, die sich immer fragen, wie Ihre Fotos so gut aussehen? Nun, sie werden es wissen, sobald sie Ihre Presets gekauft haben. </p> <p> Wenn Sie Presets und andere Artikel online verkaufen, ist Ihr unmittelbarer Kreis ein guter Ausgangspunkt. Auch wenn sie sich nicht so sehr für Fotografie interessieren, werden sie dich trotzdem unterstützen wollen. Oder sie kennen jemanden, der gerne Bilder macht, und wird Sie an sie verweisen. </p> <p> </p> <h2 id=\"share-your-art-with-the-world\"> Teile deine Kunst mit der Welt </h2> <p> Lightroom-Voreinstellungen sind eine großartige Möglichkeit, Ihren Fotografie-Workflow zu optimieren. Es gibt viele Orte, an denen Sie Lightroom-Presets online verkaufen können, jeder mit einzigartigen Vor- und Nachteilen. </p> <p> Um Ihre Presets erfolgreich online zu verkaufen, stellen Sie sicher, dass Ihr Stil einzigartig genug ist, damit andere darauf achten können. Und bevor Sie mit der Übertragung Ihrer Voreinstellungen beginnen, denken Sie daran, viele kostenlose Inhalte bereitzustellen. Dann werden die Leute eher bereit sein, Ihre Produkte zu kaufen. </p>"}