{"title":"So verwalten Sie Benutzergruppen mit Groupadd unter Linux","content":"<p> Die Benutzerverwaltung ist ziemlich einfach, wenn Sie Linux auf Ihrem PC ausführen. Aber für diejenigen, die einen Server mit Tausenden von Benutzern haben, wird die Verwaltung zu einem ernsten Problem, das beachtet werden sollte. </p> <p> Glücklicherweise bieten Ihnen Linux-basierte Betriebssysteme die Möglichkeit, Benutzer auf Ihrem System zu steuern und zu verwalten. Sie können Gruppen erstellen und ihnen Benutzer hinzufügen. Anstatt jedem Benutzer im System Berechtigungen zuzuweisen, können Sie Benutzergruppen einfach autorisieren, indem Sie ihnen Berechtigungen für den Systemworkflow zuweisen. </p> <h2 id=\"create-user-groups-on-linux\"> Erstellen Sie Benutzergruppen unter Linux </h2> <p> Linux enthält einen Standardbefehl zum Erstellen von Benutzergruppen. Du kannst den ... benutzen <strong> Gruppe hinzufügen </strong> Befehl, um Ihrem System neue Gruppen hinzuzufügen. Die grundlegende Syntax des Befehls lautet: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> So erstellen Sie eine neue Benutzergruppe &#39;Autoren&#39;: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> Wenn Sie den oben genannten Befehl ausführen, wird ein neuer Eintrag zum hinzugefügt <strong> /etc/group </strong> und <strong> /etc/gshadow </strong> Dateien auf Ihrem System. Sie können den neuen Gruppeneintrag in den Dateien überprüfen, indem Sie eingeben <strong> Katze /etc/group </strong> und <strong> Katze /etc/gshadow </strong> in Ihrem Terminal. </p> <p> Beachten Sie, dass nur Benutzer mit Administratorrechten Benutzergruppen erstellen können. Vergessen Sie nicht, zum Superuser zu wechseln, bevor Sie den Befehl groupadd ausführen. </p> <p> Wenn Sie versuchen, eine Gruppe mit einem bereits vorhandenen Namen zu erstellen, wird eine Fehlermeldung mit folgendem Inhalt angezeigt: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> Sie können den Fehler jedoch schließen, indem Sie die <strong> -f </strong> oder <strong> --Macht </strong> mit dem Befehl markieren. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Erstellen Sie Benutzergruppen mit eindeutiger GID </h3> <p> Wenn Sie eine neue Benutzergruppe anlegen, weist das System dieser automatisch eine Gruppen-ID oder GID zu. Wenn Sie möchten, dass Ihre Gruppe eine bestimmte Gruppen-ID hat, können Sie dies mit der <strong> -G </strong> oder <strong> --gid </strong> Flagge. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Wenn Sie versuchen, eine bereits vergebene Gruppen-ID zuzuweisen, tritt der folgende Fehler auf. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Es wird zwar nicht empfohlen, aber Sie können das hinzufügen <strong> -Ö </strong> oder <strong> --nicht eindeutig </strong> Flag, um die Gruppen-ID zwangsweise zuzuweisen. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Erstellen Sie Benutzergruppen mit einem Passwort </h3> <p> Obwohl Sie Ihren Gruppen ein Kennwort hinzufügen können, haben diese für einen Benutzer keinen praktischen Nutzen. Das <strong> -p </strong> Flag ermöglicht Ihnen, ein Passwort für Ihre Benutzergruppe anzugeben. </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Erstellen von Systemgruppen unter Linux </h3> <p> Es gibt einen kleinen Unterschied zwischen Systemgruppen und regulären Gruppen. Systemgruppen sind spezielle Gruppen, zu denen die Benutzer gehören, die für die Durchführung von Systemvorgängen wie Sicherung und Wartung verantwortlich sind. </p> <p> Verwenden Sie die <strong> -r </strong> oder <strong> --System </strong> Flag zum Erstellen einer Systemgruppe unter Linux: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Liste der Mitglieder in einer Benutzergruppe abrufen </h3> <p> Um zu wissen, wie viele Mitglieder einer bestimmten Gruppe angehören, können Sie die <strong> getent </strong> Befehl von Ihrem Terminal. Der folgende Befehl zeigt eine Liste aller Mitglieder der Gruppe &#39;Autoren&#39; an: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Benutzer zu Gruppen hinzufügen </h2> <p> Nachdem Sie nun eine Benutzergruppe auf Ihrem System erstellt haben, ist es an der Zeit, ihr einige Benutzer hinzuzufügen. Usermod ist ein leistungsstarkes Befehlszeilen-Dienstprogramm, da es verschiedene Optionen für die Benutzerverwaltung und -moderation enthält. Außerdem können Sie Ihrer Gruppe ganz einfach Benutzer hinzufügen. Die grundlegende Syntax des Befehls lautet: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Hinzufügen eines vorhandenen Benutzers zu Gruppen </h3> <p> Wenn Sie Ihrer Gruppe einen bestehenden Benutzer hinzufügen möchten, <strong> -ein </strong> und <strong> -G </strong> Flaggen sind das, was Sie brauchen. Das <strong> -G </strong> Flagge steht für Gruppen, während die <strong> -ein </strong> steht für anhängen, hinzufügen oder hinzufügen. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> Sie können einen Benutzer auch zu mehreren Gruppen hinzufügen. Sie müssen lediglich die Gruppennamen durch Komma getrennt eingeben. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Hinzufügen eines neuen Benutzers zu einer Gruppe </h3> <p> Du kannst den ... benutzen <strong> useradd </strong> Befehl, wenn du willst <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> fügen Sie Ihrem Linux-System einen neuen Benutzer hinzu </a> . Useradd bietet Ihnen die Möglichkeit, dem Benutzer zum Zeitpunkt seiner Erstellung eine Gruppe zuzuweisen. Das <strong> -G </strong> Flag ermöglicht es Ihnen, dem Benutzer eine Gruppe anzugeben. </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> Das Hinzufügen eines Benutzers zu mehreren Gruppen ist ebenfalls einfach. Übergeben Sie einfach die Gruppennamen durch Komma getrennt im Standardbefehl. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Benutzer aus einer Gruppe entfernen </h2> <p> Sie können Benutzer auch mithilfe von aus einer Gruppe entfernen <strong> Benutzermod </strong> . Beachten Sie, dass in einem Linux-System einem Benutzer mehrere Gruppen zugewiesen werden können. Eine dieser Gruppen wird als primäre Gruppe deklariert, während andere als sekundäre Gruppen bezeichnet werden. </p> <p> Wenn Sie versuchen, einen Nutzer aus einer Gruppe zu entfernen, vergewissern Sie sich, dass er nach dem Entfernen mindestens eine primäre Gruppe hat. Der Benutzer &#39;random&#39; ist beispielsweise ein Teil der Gruppen Admin, Writers und Editors; wobei admin die primäre Gruppe ist und der Rest sekundäre Gruppen. </p> <p> Sie können den Benutzer nur aus den Gruppenautoren und -editoren entfernen. Dazu müssen Sie den Gruppennamen übergeben, bei dem der Benutzer Mitglied bleiben soll. Das heißt, um den Benutzer &#39;random&#39; aus den Gruppeneditoren zu entfernen, wird folgender Befehl verwendet: </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Beachten Sie, dass Sie nur das ausziehen mussten <strong> Flag anhängen (-a) </strong> aus dem Befehl, den Sie verwenden, um einen Benutzer zu einer Gruppe hinzuzufügen. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Gruppen unter Linux löschen </h2> <p> Wenn Sie eine Benutzergruppe nicht mehr auf Ihrem System behalten möchten, können Sie die Gruppe mit der Schaltfläche löschen <strong> Gruppendel </strong> Befehl. Die Syntax des Befehls lautet: </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> Zum Löschen der Benutzergruppe &#39;Autoren&#39;: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Wenn Sie versuchen, eine nicht vorhandene Gruppe zu entfernen, erhalten Sie eine Fehlermeldung mit folgendem Inhalt: </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Verwalten von Benutzergruppen unter Linux </h2> <p> Die Benutzerverwaltung kann schwierig sein, wenn Sie die Linux-Befehle nicht kennen, die Sie verwenden müssen. Es wird wirklich einfach, wenn Sie die In- und Out-Befehle in Bezug auf Moderation und Management kennen. </p> <p> Serveradministratoren sollten versuchen, Linux-Distributionen zu verwenden, die für ihre Anforderungen gut geeignet sind. Auf diese Weise erhalten sie alle Tools und Dienstprogramme, die für die Serververwaltung erforderlich sind, auf Anhieb. </p>"}