{"title":"So erstellen Sie einen Screenshot auf einem Surface Pro-Tablet","content":"<p> Das Erstellen eines Screenshots ist eine einfache, aber unverzichtbare Fähigkeit auf jedem Gerät. Auf dem Surface Pro Tablet können Sie Screenshots mit Tastenkombinationen, dem Snipping-Tool oder sogar der Xbox Game Bar erstellen. Wir zeigen Ihnen, wie Sie mit all diesen Methoden einen Screenshot oder sogar eine Bildschirmaufnahme auf Ihrem Surface-Gerät erstellen können. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Erstellen eines Screenshots mit Tastenkombinationen </h2> <p> Auf den Surface Pro-Geräten ist das Erstellen eines Screenshots mit Tastenkombinationen schnell und einfach. Um einen Screenshot zu machen, halte die <strong> Leistung </strong> und <strong> Lautstärke erhöhen </strong> Schlüssel gleichzeitig. Der Bildschirm sollte blinken und der Screenshot sollte im Screenshot-Ordner unter Bilder auf Ihrem Gerät gespeichert werden. </p> <p> Diese Methode funktioniert für die neueste Surface Pro-Gerätelinie (d. h. Surface Pro 7+, Pro X), Surface Go, Surface Go 2 und die Surface Book-Gerätelinie. </p> <p> Wenn es sich bei Ihrem Surface um ein älteres Modell (Surface 3 oder älter) handelt, ist die Tastenkombination etwas anders. Sie müssen die drücken <strong> Windows-Taste </strong> (nicht die Windows-Taste auf Ihrer Tastatur) und die <strong> Lautstärke runter </strong> gleichzeitig die Taste. Das Gerät speichert Ihren Screenshot in Ihrem Screenshots-Ordner unter Fotos. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> Um einen Screenshot auf Ihrem Surface Duo zu erstellen, halten Sie die <strong> Leistung </strong> Taste und die <strong> Lautstärke runter </strong> Schlüssel. Der Screenshot sollte in der Galerie Ihres Geräts unter Screenshots gespeichert werden. Alternativ können Sie auch einfach die <strong> Leistung </strong> Taste und klicken Sie auf die <strong> Bildschirmfoto </strong> Schaltfläche auf dem Bildschirm. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> So erstellen Sie einen Surface Pro-Screenshot mit Tastenkombinationen </h2> <p> Tastaturkürzel sind eine weitere Möglichkeit, die Bildschirminhalte zu erfassen. </p> <p> Diese Tastenkombinationen funktionieren auf allen Windows-Geräten, also check out <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> andere Screenshot-Methoden unter Windows 10 </a> . Tastenkombinationen funktionieren am besten auf den Geräten der Surface Laptop- und Surface Book-Reihe, aber natürlich funktionieren diese Tastenkombinationen auch, wenn Sie den Tastaturanschluss für Ihr Surface Pro- oder Go-Gerät haben. </p> <h3 id=\"print-screen-methods\"> Bildschirmmethoden drucken </h3> <p> Um einen Screenshot mit der Print Screen-Methode zu erstellen, drücken Sie einfach die <strong> PrtScn </strong> Taste auf Ihrer Tastatur. Dadurch wird ein Screenshot Ihres gesamten Desktops erstellt. Beachten Sie, dass dadurch der Screenshot nicht auf Ihrem Surface gespeichert, sondern Ihrer Zwischenablage hinzugefügt wird. Sie müssen ein Programm wie Microsoft Paint verwenden, um den Screenshot einzufügen. </p> <p> Drücken <strong> Alt + PrtScn </strong> macht nur einen Screenshot Ihres aktuellen Fensters und fügt den Screenshot auf ähnliche Weise Ihrer Zwischenablage hinzu. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Ausschneiden und Skizzieren </h3> <p> Dies ist bei weitem die einfachste Methode, um einen Screenshot auf Ihrem Surface-Gerät zu erstellen. </p> <p> Um Snip and Sketch zu öffnen, drücken Sie die <strong> Windows-Taste + Umschalt + S, </strong> und ein Overlay sollte auf Ihrem Bildschirm erscheinen. Um einen vollständigen Screenshot zu erstellen, drücken Sie die Vollbild-Schaltfläche oben im Overlay. Um nur einen Screenshot Ihres aktuellen Fensters zu erstellen, drücken Sie die Schaltfläche Fensterausschnitt neben der Schaltfläche Vollbild. </p> <p> Sie können auch einen Screenshot von einem bestimmten Bereich Ihres Bildschirms erstellen. Standardmäßig verfügt Snip and Sketch über den rechteckigen Snip. Ziehen Sie einfach mit Ihrem Touchscreen oder Ihrem Trackpad über den Teil, den Sie als Screenshot erstellen möchten. </p> <p> Snip and Sketch gibt Ihnen in Ihrem Benachrichtigungsfeld eine Benachrichtigung, dass Ihr Screenshot in Ihre Zwischenablage kopiert wurde. Wenn Sie darauf klicken, können Sie auf Wunsch über einen Screenshot zeichnen und skizzieren. </p> <p> Um es in Ihren Dateien zu speichern, verwenden Sie <strong> Strg + S </strong> oder die Schaltfläche Speichern in der oberen rechten Ecke, um Ihren Screenshot in einem bestimmten Ordner zu speichern. </p> <h3 id=\"xbox-game-bar\"> Xbox-Spielleiste </h3> <p> Um einen Screenshot mit der Xbox Game Bar aufzunehmen, drücken Sie die <strong> Windows-Taste + G </strong> um es zu öffnen. </p> <p> Von dort aus können Sie auf die Registerkarte Aufnahmen klicken und auf die Schaltfläche Kamera klicken. Mit dieser Methode können Sie auch eine Videoaufnahme Ihres Bildschirms mit Audio erstellen. Ihre gespeicherten Aufnahmen werden im Ordner Videos und im Unterordner Aufnahmen angezeigt. Auf einer Xbox können Sie ähnlich <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> Screenshots und Aufnahmen aufnehmen </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Aufnehmen eines Surface Pro-Screenshots mit dem Surface-Stift </h2> <p> Um einen Screenshot mit dem Surface Pen zu machen, doppelklicken Sie einfach auf den Radierer, und Ihr Gerät sollte Snip and Sketch Ihres gesamten Fensters anzeigen. Von hier aus können Sie Ihren Screenshot skizzieren und exportieren. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> Sie können auch darauf zugreifen, indem Sie auf Ihrem Dock nach Windows Ink Workspace suchen. Wählen Sie hier Vollbild-Snip aus. Sie können die Funktion der Tastenkombinationen Ihres Surface Pen ändern, indem Sie nach Windows Ink Workspace-Einstellungen suchen und nach unten zu Windows Ink Workspace scrollen. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Screenshots auf dem Surface machen, leicht gemacht </h2> <p> Jetzt kennen Sie alle verschiedenen Methoden zum Aufnehmen eines Screenshots oder einer Bildschirmaufnahme auf Ihrem Surface-Gerät. Die Tastenkombinationen sind die beste taktile Möglichkeit, einen Screenshot zu erstellen, wenn Sie das Surface Pro oder das Surface Go verwenden, aber auch die Tastenkombinationen sind einfach. </p>"}