{"title":"So ändern Sie Ihr Netflix-Profilbild","content":"<p> Jedes Ihrer Netflix-Profile kann durch ein anderes Bild dargestellt werden. Wenn Sie Ihr Netflix-Profilbild noch nie geändert haben, warum versuchen Sie es nicht jetzt? </p> <p> In diesem Artikel zeigen wir Ihnen, wie Sie ein Bild aus Ihrer Lieblingssendung auswählen können. Wir zeigen Ihnen auch, wie Sie versteckte Profilbilder auswählen, die in der Vergangenheit verfügbar waren, die Netflix jedoch aus der öffentlichen Ansicht entfernt hat. </p> <h2 id=\"how-to-set-a-netflix-profile-picture\"> So legen Sie ein Netflix-Profilbild fest </h2> <p> Der Prozess zum Auswählen eines Netflix-Profilbilds ist auf jedem Gerät ähnlich, mit leichten Unterschieden. Wir werden behandeln, wie es auf einem Desktop und einem Smart-TV gemacht wird. </p> <h3 id=\"how-to-change-your-netflix-profile-picture-desktop\"> So ändern Sie Ihr Netflix-Profilbild (Desktop) </h3> <p> <img alt=\"netflix choose profile icon desktop\" src=\"images/netflix-choose-profile-icon-desktop-266.png\" loading=\"lazy\"> </p> <ol> <li> Einloggen in <a href=\"https://www.netflix.com\" target=\"_blank\" rel=\"nofollow noopener\"> Netflix.com </a> . </li> <li> Bewegen Sie den Mauszeiger über Ihre <strong> Profilsymbol </strong> oben rechts und klicken Sie auf <strong> Profile verwalten </strong> . </li> <li> Drücke den <strong> Bleistiftsymbol </strong> auf dem Profil, das Sie bearbeiten möchten. </li> <li> Klicken Sie erneut auf Ihrem Profilbild auf das <strong> Bleistiftsymbol </strong> . </li> <li> Klicken Sie auf ein Profilbild aus der Liste, um es auszuwählen. </li> <li> Sie werden gefragt, ob Sie Ihr Profilbild ändern möchten. Klicken <strong> Machen wir das </strong> . </li> <li> Klicken <strong> speichern </strong> . </li> </ol> <h3 id=\"how-to-change-your-netflix-profile-picture-smart-tv\"> So ändern Sie Ihr Netflix-Profilbild (Smart TV) </h3> <ol> <li> Gehen Sie zum Netflix-Startbildschirm. </li> <li> Drücken Sie die <strong> linker Knopf </strong> um das Menü aufzurufen. </li> <li> Drücken Sie die <strong> Hoch-Taste </strong> bis Ihr Profilname markiert ist, und drücken Sie dann die <strong> Bestätigungstaste </strong> . </li> <li> Verwenden Sie die Pfeiltasten, um das Profil zu markieren, das Sie bearbeiten möchten. Drücken Sie dann die <strong> Abwärtstaste </strong> um die hervorzuheben <strong> Bleistiftsymbol </strong> und drücke die <strong> Bestätigungstaste </strong> . </li> <li> Drücken Sie auf dem Bildschirm Profil bearbeiten die Taste <strong> Abwärtstaste </strong> zum Highlight <strong> Symbol </strong> , dann drücke die <strong> Bestätigungstaste </strong> . </li> <li> Verwendung der <strong> Pfeiltasten </strong> Wählen Sie zum Navigieren ein Profilbild aus der Liste mit der <strong> Bestätigungstaste </strong> . </li> <li> Sie werden gefragt, ob Sie Ihr Profilbild ändern möchten. Drücken Sie die <strong> Bestätigungstaste </strong> auswählen <strong> Machen wir das </strong> . </li> </ol> <p> </p> <h2 id=\"how-to-use-hidden-netflix-profile-pictures\"> So verwenden Sie versteckte Netflix-Profilbilder </h2> <p> <img alt=\"netflix manage profiles\" src=\"images/netflix-manage-profiles-358.png\" loading=\"lazy\"> </p> <p> Obwohl es eine große Auswahl an Netflix-Profilbildern gibt, die eine Reihe von <a href=\"https://www.makeuseof.com/tag/netflix-shows-binge-watch/\" target=\"_blank\" rel=\"nofollow noopener\"> die großen Netflix-Originale </a> , einige von ihnen werden nach einer bestimmten Zeit entfernt. </p> <p> Sie behalten das Profilbild in diesem Fall, können es jedoch möglicherweise nicht wiederherstellen, wenn Sie es ändern. </p> <p> Zumindest können Sie dafür nicht die Standard-Netflix-Schnittstelle verwenden. Mit etwas Arbeit können Sie jedoch versteckte Netflix-Profilbilder wiederbeleben, auch wenn Sie sie noch nie zuvor verwendet haben. </p> <p> Zuerst müssen Sie die ID des gewünschten Profilbilds kennen. Sie können die ID nur erhalten, wenn Sie oder jemand, den Sie kennen, das versteckte Profilbild verwendet. Alternativ kann jemand den von Ihnen benötigten Ausweis online gestellt haben. </p> <h3 id=\"how-to-find-a-netflix-profile-picture-id\"> So finden Sie eine Netflix-Profilbild-ID </h3> <p> Um die Profilbild-ID für Ihr aktuelles Bild abzurufen, befolgen Sie diese Anweisungen in Google Chrome für Desktop: </p> <ol> <li> Gehe zum <a href=\"https://www.netflix.com/profiles/manage\" target=\"_blank\" rel=\"nofollow noopener\"> Seite &quot;Profile verwalten&quot; </a> . </li> <li> <strong> Rechtsklick </strong> auf der Seite und klicke <strong> Prüfen </strong> . </li> <li> Drücken Sie <strong> Strg + F </strong> um das Suchfeld aufzurufen und zu suchen nach <strong> Name des Avatars </strong> . </li> <li> Dadurch wird ein Codeabschnitt gefunden, der wie folgt aussieht: </li> </ol> <pre><code class=\"hljs ruby\">\"avatarName\":\"AVATAR\\x7C2b58f9e0-154c-11e9-b321-0abbc59f77ba\\x7Cen\\x7CGB\\x7C70300800\",\"profileName\":\"Joe\"</code></pre> <p> Diese Zeile wird für jedes Netflix-Profil angezeigt, das Sie haben. Im obigen Beispiel weiß ich, dass die Avatar-ID für das Profil &quot;Joe&quot; &quot;AVATAR\\x7C2b58f9e0-154c-11e9-b321-0abbc59f77ba\\x7Cen\\x7CGB\\x7C70300800&quot; lautet. </p> <p> Wenn Ihr Freund ein verstecktes Profilbild hat, das Sie möchten, bitten Sie ihn, die obigen Schritte zu befolgen und Ihnen die Avatar-ID zu geben. </p> <h3 id=\"how-to-set-a-hidden-profile-picture\"> So legen Sie ein verstecktes Profilbild fest </h3> <p> <img alt=\"netflix edit profile id\" src=\"images/netflix-edit-profile-id-124.png\" loading=\"lazy\"> </p> <p> Jetzt haben Sie die Profilbild-ID, folgen Sie diesen Schritten in Google Chrome. Installieren Sie zuerst die <a href=\"https://chrome.google.com/webstore/detail/react-developer-tools/fmkadmapgofadopljbjfkapdkoienihi\" target=\"_blank\" rel=\"nofollow noopener\"> React Developer Tools-Erweiterung </a> . Dann: </p> <ol> <li> Gehe zum <a href=\"https://www.netflix.com/ManageProfiles\" target=\"_blank\" rel=\"nofollow noopener\"> Seite &quot;Profile verwalten&quot; </a> . </li> <li> Drücke den <strong> Bleistiftsymbol </strong> auf dem Profil, das Sie bearbeiten möchten. </li> <li> Klicken Sie erneut auf Ihrem Profilsymbol auf das <strong> Bleistiftsymbol </strong> . </li> <li> <strong> Rechtsklick </strong> auf der Seite und klicke <strong> Prüfen </strong> . </li> <li> Klicken Sie oben in den Entwicklertools auf <strong> Komponenten </strong> . </li> <li> Suchen Sie auf der Registerkarte Komponenten nach der ersten Codezeile mit der Aufschrift <strong> LolopiIcon </strong> und klicken Sie darauf. </li> <li> Klicken Sie im rechten Bereich auf das <strong> Pfeil </strong> neben dem <strong> Symbol </strong> Zeile, um es zu erweitern. </li> <li> Suche nach <strong> Ich würde </strong> Reihe. Klicken Sie auf den Wert in dieser Zeile und ersetzen Sie ihn durch die vollständige ID des gewünschten Profilbilds. </li> <li> Klicken Sie auf der Netflix-Seite auf das erste Profilbild in der ersten Zeile. Obwohl es nicht wie das gewünschte Bild aussehen wird, haben Sie jetzt seine ID hinter den Kulissen geändert. </li> <li> Sie werden gefragt, ob Sie Ihr Profilbild ändern möchten. Klicken <strong> Machen wir das </strong> . Es wird immer noch nicht das richtige Bild angezeigt. </li> <li> Klicken <strong> speichern </strong> . Auch hier wird nicht das richtige Bild angezeigt. </li> <li> Sie kehren zurück zum <strong> Profile verwalten </strong> Seite, auf der Sie jetzt das neue versteckte Profilbild haben. </li> </ol> <p> </p> <h2 id=\"secret-netflix-codes-to-find-movies-and-tv-shows\"> Geheime Netflix-Codes zum Finden von Filmen und Fernsehsendungen </h2> <p> Jetzt wissen Sie, wie Sie Ihr Profilbild ändern können, sei es aus der verfügbaren Auswahl oder zum Entsperren einiger älterer versteckter Bilder. </p> <p> Profilbild-IDs sind nicht die einzigen Geheimcodes, die Sie auf Netflix nutzen können. Es gibt auch Codes, mit denen Sie Nischengenres durchsuchen und neue Inhalte entdecken können. </p>"}