{"title":"So beheben Sie den VIDEO_TDR_FAILURE-BSOD in Windows 10","content":"<p> Der Fehler VIDEO_TDR_FAILURE weist darauf hin, dass Ihre Grafikkarte defekt ist oder die Anzeigetreiber veraltet sind oder nicht funktionieren. Es kann jedoch auch andere Gründe geben, wie zum Beispiel Überhitzung von Komponenten oder beschädigte Systemdateien. TDR ist die Abkürzung für <strong> Zeitüberschreitung, Erkennung und Wiederherstellung </strong> , eine Methode, die von Windows verwendet wird, um fehlerhafte Softwarekomponenten zu identifizieren und zu beheben. </p> <p> Wenn dieser Fehler auftritt, haben Sie keine Angst, denn die folgenden Methoden beheben den Fehler VIDEO_TDR_FAILURE schneller als erwartet. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Aktualisieren und Neuinstallieren von Bildschirmtreibern </h2> <p> Wie oben erwähnt, ist der Fehler normalerweise das Ergebnis fehlerhafter oder veralteter Anzeigetreiber. Daher sollten Sie Ihre Grafikkartentreiber aktualisieren. Wenn das nicht hilft, installieren Sie sie neu. Abhängig von Ihrer Grafikkarte können unterschiedliche Dateinamen für den Fehler auftreten. </p> <ol> <li> Für Nvidia-Benutzer ist es <strong> nvlddmkm.sys </strong> . Wenn Sie ein Nvidia-Benutzer sind, hier sind <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 einfache Möglichkeiten, den Fehler zu beheben. </a> </li> <li> Für AMD-Benutzer wird der Fehler angezeigt als <strong> atikmpag.sys </strong> . </li> <li> Für Intel HD-Benutzer ist der Fehler <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> So aktualisieren Sie die Bildschirmtreiber </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> Drücken Sie <strong> Windows-Taste + R </strong> um den Befehl Ausführen zu öffnen. Eintippen <strong> devmgmt.msc </strong> und drücken Sie die Eingabetaste. </li> <li> In dem <strong> Gerätemanager </strong> Fenster, navigieren Sie zu <strong> Display-Adapter </strong> und erweitern Sie es. </li> <li> Klicken Sie mit der rechten Maustaste auf Ihren Anzeigeadapter und wählen Sie dann <strong> Treiber aktualisieren </strong> . </li> <li> Wählen <strong> Automatisch nach aktualisierter Treibersoftware suchen </strong> . </li> <li> Windows durchsucht automatisch das Internet und lädt die erforderlichen Treiber herunter. Bitte stellen Sie dabei sicher, dass Sie über eine aktive Internetverbindung verfügen. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> So installieren Sie die Bildschirmtreiber neu </h3> <p> Wenn der Video-Tdr-Fehler BSOD nach der Aktualisierung der Anzeigetreiber weiterhin besteht, ist es am besten, diese Treiber neu zu installieren. Es ist ratsam, dies zu tun, während Windows im abgesicherten Modus gestartet wird. Bevor Sie dies tun, sollten Sie jedoch die Website Ihres Grafikkartenherstellers besuchen und die neueste Version der Grafiktreiber herunterladen. </p> <p> Die gängigsten Hersteller sind <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> , und <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intel </a> . </p> <p> Führen Sie die folgenden Schritte aus, um im abgesicherten Modus zu starten: </p> <ol> <li> Drücken Sie <strong> Windows-Taste + R, </strong> und geben Sie im Dialogfeld Ausführen ein <strong> msconfig, </strong> und drücken Sie die Eingabetaste. </li> <li> In dem <strong> Systemkonfiguration </strong> Fenster, klicken Sie auf das <strong> Booten </strong> Tab. </li> <li> Jetzt ankreuzen <strong> Sicherheitsmodus </strong> Kontrollkästchen befindet sich im unteren Bereich. </li> <li> Übernehmen Sie die Einstellungen und starten Sie Ihren Computer neu. </li> </ol> <p> Nach dem Booten im abgesicherten Modus ist es an der Zeit, die Anzeigetreiber neu zu installieren. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> Geben Sie in der Suchleiste des Startmenüs ein <strong> Gerätemanager </strong> und öffnen Sie es. </li> <li> Suchen <strong> Display-Adapter </strong> und erweitern Sie das Menü. </li> <li> Klicken Sie mit der rechten Maustaste auf Ihre GPU und klicken Sie auf <strong> Gerät deinstallieren </strong> . </li> <li> Überprüfen Sie im Deinstallationsassistenten das <strong> Löschen Sie die Treibersoftware für dieses Gerät </strong> Box. </li> <li> Warten Sie, bis Windows das Gerät deinstalliert und Ihren Computer neu startet. </li> <li> Installieren Sie nun die zuvor heruntergeladenen Grafiktreiber neu. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Verwenden Sie SFC, um Systemdateien zu scannen und zu reparieren </h2> <p> SFC ist ein integriertes Windows-Dienstprogramm, mit dem beschädigte Systemdateien gescannt und repariert werden können. Im Falle eines BSOD ist es sehr wahrscheinlich, dass einige Systemdateien beschädigt sind, daher ist die Ausführung dieses Dienstprogramms unerlässlich. Es ist nur einer der <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> mehrere nützliche Dienstprogramme verfügbar </a> einem Windows-Benutzer zur Verfügung. </p> <p> Führen Sie zum Ausführen von SFC einfach diese Schritte aus: </p> <ol> <li> Geben Sie in der Suchleiste des Startmenüs ein <strong> cmd </strong> . </li> <li> Klicken Sie mit der rechten Maustaste auf <strong> Eingabeaufforderung </strong> und wählen Sie <strong> Als Administrator ausführen </strong> . </li> <li> Geben Sie in der Konsole ein <strong> sfc /scannow </strong> und drücken Sie die Eingabetaste. </li> <li> Nachdem der Scan- und Reparaturvorgang abgeschlossen ist, starten Sie Ihren Computer neu. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Starthilfe ausführen Startup </h2> <p> Für Benutzer, die den Fehler erhalten, sobald sie Windows 10 booten oder kurz nach der Anmeldung, ist die Startup-Reparatur ein Glücksfall. Diese Windows-Funktion prüft beim Start auf Anomalien und behebt diese sofort. </p> <p> Da sich dieser Abschnitt an Benutzer richtet, deren Computer durch den Fehler unbrauchbar gemacht wurden, d.h. sie nicht öffnen können <strong> die Einstellungen </strong> , müssen sie einen harten Neustart durchführen, um in die Windows-Wiederherstellungsumgebung (winRE) zu gelangen. </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Führen Sie diese Schritte aus, um in die Windows-Wiederherstellungsumgebung zu booten: </p> <ol> <li> Halten Sie die Power-Taste gedrückt, bis sich Ihr PC ausschaltet. </li> <li> Drücken Sie die Power-Taste erneut, um Ihren PC zu starten. </li> <li> Wiederholen Sie den ersten und zweiten Schritt, bis der PC im Wiederherstellungsmodus startet. Es wird ein Bluescreen sein. </li> <li> Klicken Sie auf dem Wiederherstellungsbildschirm auf <strong> Siehe erweiterte Reparaturoptionen </strong> . </li> <li> Klicken Sie im nächsten Bildschirm auf <strong> Fehlerbehebung </strong> </li> <li> Klicke auf <strong> Erweiterte Optionen </strong> </li> <li> Klicke auf <strong> Starthilfe </strong> und geben Sie Ihre Zugangsdaten ein, wenn Sie dazu aufgefordert werden. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Ändern Sie Ihre Energieverwaltungseinstellungen </h2> <p> Die Energieverwaltungseinstellungen von Windows sind normalerweise gut optimiert, aber manchmal können sie die Grafikverarbeitung Ihres Computers beeinträchtigen. Dies gilt insbesondere, wenn der Computer über eine diskrete GPU verfügt. Die optimalen Einstellungen zur Vermeidung des VIDEO_TDR_FAILURE BSOD sind unten angegeben: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> Geben Sie in der Suchleiste des Startmenüs ein <strong> Schalttafel </strong> und öffnen Sie es. </li> <li> Geben Sie in der Suchleiste der Systemsteuerung &quot;Energieoptionen&quot; ein und drücken Sie die Eingabetaste. </li> <li> Klicke auf <strong> Energieeinstellungen, </strong> und klicken Sie neben dem von Ihnen verwendeten Energiesparplan auf <strong> Planeinstellungen ändern. </strong> </li> <li> Klicke auf <strong> Ändern Sie die erweiterten Energieeinstellungen. </strong> </li> <li> Suchen <strong> PCI-E </strong><strong> xpress </strong> und erweitern Sie es. </li> <li> Drehe die <strong> Linkstatus-Energieverwaltung </strong> Einstellung auf <strong> aus </strong> . </li> <li> Speichern Sie die Änderungen und starten Sie Ihren Computer neu. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Reinigen Sie Ihren Computer </h2> <p> Überhitzung ist nie eine gute Sache und der Grund dafür ist normalerweise Staubansammlung. Es wird empfohlen, dass Benutzer ihre PC-Komponenten jeden Monat von Staub befreien. Aber sei vorsichtig. Es sollte sanft gemacht werden. </p> <p> Achten Sie darauf, die Oberseiten Ihrer Grafikkarte, des CPU-Lüfters, des Netzteils und der Gehäuselüfter zu reinigen. Alles in allem unbedingt vermeiden <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> Wartungsfehler, die die teuren Komponenten beschädigen könnten. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Überprüfen Sie die Hardwarekomponenten </h2> <p> Wenn der Fehler nach dem Ausprobieren aller oben aufgeführten Schritte weiterhin auftritt, liegt möglicherweise ein Fehler in der Hardware selbst vor. Benutzer mit einer dedizierten Grafikkarte sollten diese entfernen und den Computer booten. Wenn der Fehler behoben ist, handelt es sich um einen Hardwarefehler in der GPU selbst. Sie könnten versuchen, den Hersteller zu kontaktieren und versuchen, Ihr Gerät auszutauschen. </p> <p> </p> <p> Wenn Sie Onboard-Grafiken verwenden, versuchen Sie, sie zu deaktivieren und zu booten. Um sie zu deaktivieren, gehen Sie folgendermaßen vor: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> Drücken Sie <strong> Windows-Taste +R, </strong> Art <strong> devmgmt.msc </strong> in das Textfeld Ausführen ein und drücken Sie die Eingabetaste. </li> <li> Im <strong> Gerätemanager </strong> , suchen <strong> Display-Adapter </strong> und erweitern Sie das Menü. </li> <li> Klicken Sie mit der rechten Maustaste auf Ihre Onboard-GPU und klicken Sie auf <strong> Gerät deaktivieren </strong> . </li> <li> Starten Sie den Computer neu und prüfen Sie, ob der Fehler behoben ist. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> Fehler &quot;Video-TDR-Fehler&quot; erfolgreich behoben </h2> <p> Für die meisten Benutzer wird das Problem durch ein einfaches Update oder eine Neuinstallation ihrer Anzeigetreiber behoben. Wenn sich das Problem jedoch verschlimmert, müssen Sie möglicherweise Ihren PC zurücksetzen oder Hardware austauschen. </p>"}