{"title":"So verhindern Sie, dass Windows 10 Ihre heruntergeladenen Dateien blockiert","content":"<p> Wenn Sie versuchen, eine Datei zu öffnen, verhindert Windows 10 möglicherweise, dass Sie sie direkt öffnen. Es zeigt Ihnen eine Sicherheitswarnung an, dass die Datei aus einer unbekannten Quelle stammt und unsicher sein kann. Dies geschieht, wenn ein Windows 10-Feature namens Attachment Manager Dateien blockiert, die es für Ihren PC als unsicher erachtet. </p> <p> Obwohl Sie jede Datei manuell entsperren könnten, kann dies ein ermüdender Prozess sein – insbesondere, wenn Sie dies für fast jede heruntergeladene Datei tun müssen. In diesem Artikel zeigen wir Ihnen, wie Sie verhindern können, dass Windows 10 Ihre heruntergeladenen Dateien blockiert. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> Was ist der Anhangs-Manager in Windows 10? </h2> <p> In Windows 10 gibt es eine Sicherheitsfunktion namens Attachment Manager, die Sie daran hindert, unsichere Dateien zu öffnen. Dies können Dateien sein, die Sie heruntergeladen haben oder <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> Dateien, die Windows als unsichere E-Mail-Anhänge identifiziert </a> . Wenn der Anhangs-Manager eine Datei für unsicher hält, verhindert er, dass Windows 10 sie öffnet und zeigt eine Warnmeldung an. Der Anhangs-Manager klassifiziert Dateien, die Sie herunterladen, basierend auf dem Dateityp und der Dateinamenerweiterung. </p> <p> Der Windows-Anlagen-Manager verwendet die Anwendungsprogrammierschnittstelle (API) von IAttachmentExecute, um den Dateityp und die Dateizuordnung zu ermitteln und die am besten geeignete Aktion zu ermitteln. Wenn Sie Dateien herunterladen und auf Ihrem Datenträger speichern, fügt Windows diesen Dateien bestimmte Metadaten hinzu. Diese Metadaten werden als Anhänge betrachtet. Wenn Windows den Downloaddateien Metadaten als Anhang hinzufügt, wird dies als Zoneninformationen bezeichnet. </p> <p> Jetzt die <strong> Zoneninformationen </strong> liegt die Wurzel der Sache. Wenn der Datei-Explorer eine Datei öffnet, liest er die angehängten Zoneninformationen, die am selben Ort gespeichert sind, und prüft, ob die Datei von einer unbekannten Quelle stammt oder nicht. Wenn Windows feststellt, dass die Datei nicht erkannt wird oder aus unbekannten Quellen stammt, können Sie sie nicht öffnen. </p> <p> Eine Windows SmartScreen-Warnung wird angezeigt, die besagt: </p> <blockquote> <p> Windows SmartScreen hat das Starten einer nicht erkannten App verhindert. Das Ausführen dieser App kann Ihren PC gefährden. </p> </blockquote> <p> Wenn Sie eine blockierte Datei manuell öffnen möchten, klicken Sie mit der rechten Maustaste auf die heruntergeladene Datei und wählen Sie dann <strong> Eigenschaften </strong> . Klicken Sie auf der Registerkarte Allgemein auf <strong> Entsperren </strong> , klicken <strong> Anwenden </strong> und dann klick <strong> OK </strong> . </p> <p> Aber stellen Sie sich vor, Sie müssen dies jedes Mal tun, wenn Sie eine Datei herunterladen – das kann ärgerlich und zeitaufwändig sein. Wenn Sie häufig Dateien aus dem Internet herunterladen oder Dateien als E-Mail-Anhänge erhalten, möchten Sie möglicherweise vollständig verhindern, dass Ihr PC Ihre Dateien blockiert. </p> <p> Um zu verhindern, dass Windows 10 Sie daran hindert, Ihre Dateien zu öffnen, müssen Sie verhindern, dass es den heruntergeladenen Dateien Zoneninformationen hinzufügt. Sie können dies tun, indem Sie den Anhangs-Manager manuell mit dem Editor für lokale Gruppenrichtlinien oder dem Registrierungseditor konfigurieren. </p> <p> Wir zeigen Ihnen, wie Sie dies tun können. Sie müssen als Administrator angemeldet sein oder sollten <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> Administratorrechte anfordern </a> um zu verhindern, dass heruntergeladene Dateien blockiert werden. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Konfigurieren Sie den Anhangs-Manager mit dem Registrierungseditor </h2> <p> Drücken Sie die <strong> Windows-Taste + R </strong> um den Registrierungseditor zu öffnen. Geben Sie dort &quot;regedit&quot; ein und klicken Sie auf <strong> Eingeben </strong> . Eine Aufforderung zur Benutzerkontensteuerung wird angezeigt. Wenn diese Aufforderung angezeigt wird, klicken Sie auf die <strong> Ja </strong> Taste, um fortzufahren. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Navigieren Sie im Registrierungseditor zum Schlüssel Anhänge: <strong> HKEY_CURRENT_USER &gt; Software &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; Richtlinien &gt; Anhänge </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> Wenn der Schlüssel &quot;Anhänge&quot; im Schlüssel &quot;Richtlinien&quot; fehlt, müssen Sie ihn erstellen. Klicken Sie dazu mit der rechten Maustaste auf das <strong> Richtlinien </strong> schlüssel, klick <strong> Neu </strong> , klicken <strong> Schlüssel </strong> . Dadurch wird ein neuer Schlüssel erstellt, den Sie dann &quot;Anhänge&quot; nennen sollten. Wenn Sie feststellen, dass der Schlüssel für Anhänge bereits vorhanden ist, können Sie mit dem nächsten Schritt fortfahren. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> Klicken Sie mit der rechten Maustaste auf das <strong> Anhänge </strong> schlüssel, klick <strong> Neu </strong> und dann auswählen <strong> DWORD (32-Bit) Wert </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Sie werden aufgefordert, diesen neu erstellten DWORD-Wert zu benennen. Nennen Sie es &quot;SaveZoneInformation&quot; und klicken Sie auf <strong> Eingeben </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> Um schließlich den Attachment Manager in Windows 10 zu deaktivieren, doppelklicken Sie auf das neu erstellte <strong> SaveZoneInformation </strong> Wert und ändern Sie seine Wertdaten auf 1. Klicken Sie auf <strong> OK </strong> beenden. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Wenn Sie diese Schritte abgeschlossen haben, schließen Sie den Registrierungseditor und starten Sie Ihren Computer neu, um die Änderungen zu übernehmen. Von hier an hängt jede heruntergeladene Datei keine Zoneninformationen mehr an den alternativen Datenstrom der Datei an. Auf diese Weise können Sie Ihre Dateien problemlos öffnen. </p> <p> Wenn Sie zurückgehen und den Anhangs-Manager aktivieren möchten, können Sie dies tun, indem Sie im Registrierungseditor zum Schlüssel &quot;Anhänge&quot; navigieren: <strong> HKEY_CURRENT_USER &gt; Software &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; Richtlinien &gt; Anhänge </strong> . Doppelklicken Sie hier auf der rechten Seite auf das <strong> SaveZoneInformation </strong> Wert und ändern Sie seine Wertdaten auf 3. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Konfigurieren Sie den Anhangs-Manager mit dem Editor für lokale Gruppenrichtlinien </h2> <p> Der Editor für lokale Gruppenrichtlinien ist nur in den Editionen Windows 10 Enterprise, Education und Pro verfügbar. Daher ist diese Methode nicht anwendbar, wenn Sie die Windows 10 Home Edition besitzen. Wenn Ihr PC unter der Windows 10 Home Edition läuft, müssen Sie den Attachment Manager über den Registrierungseditor konfigurieren. </p> <p> Wenn Sie eine Windows 10-Edition mit dem Editor für lokale Gruppenrichtlinien verwenden, können Sie den Anlagen-Manager mit den hier angegebenen Schritten konfigurieren. </p> <p> Um zu beginnen, drücke <strong> Windows-Taste + R </strong> , geben Sie &quot;gpedit.msc&quot; ein und klicken Sie auf <strong> Eingeben </strong> um den Editor für lokale Gruppenrichtlinien zu öffnen. </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Navigieren Sie zum Anhangsmanager: <strong> Benutzerkonfiguration &gt; Administrative Vorlagen &gt; Windows-Komponenten &gt; Anlagen-Manager </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> Doppelklicken Sie im rechten Bereich des Anhangs-Managers auf das <strong> Bewahren Sie keine Zoneninformationen in Dateianhängen auf </strong> -Richtlinie, um die Einstellungen für die Zoneninformationen zu bearbeiten. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> Es öffnet sich ein Fenster, in dem Sie auswählen können, ob der Anhangsmanager die Zoneninformationen speichern soll oder nicht. </p> <p> Klicken <strong> aktiviert </strong> um zuzulassen, dass der Attachment Manager keine Zoneninformationen speichert. Dadurch wird sichergestellt, dass Windows Ihre Dateien nicht blockiert, wenn Sie sie öffnen. Drücke den <strong> Anwenden </strong> um die Änderungen zu speichern und dann auf . klicken <strong> OK </strong> . </p> <p> Wenn Sie fertig sind, schließen Sie den Editor für lokale Gruppenrichtlinien und starten Sie Ihren PC neu, um die Änderungen zu speichern. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows blockiert Ihre Dateien nicht mehr </h2> <p> Wenn Sie zuvor die meisten heruntergeladenen Dateien manuell entsperren mussten, haben Sie erkannt, wie ermüdend dieser Prozess sein kann. Sobald Sie diese Tipps anwenden, können Sie alle Ihre Dateien problemlos öffnen. </p> <p> Wenn Sie Dateien herunterladen und irgendwie an ihrer Glaubwürdigkeit zweifeln, können Sie sie jederzeit in sicheren isolierten Umgebungen öffnen, um sicherzustellen, dass Ihr PC und Ihre Daten sicher sind. </p>"}