{"title":"Spotify testet Live-Texte in den USA","content":"<p> Singen Sie gerne zu Ihren Lieblingssongs von Spotify mit, müssen aber immer den Text nachschlagen, um sicherzustellen, dass Ihr Karaoke korrekt ist? Du hast Glück. Spotify testet jetzt seine Live-Text-Funktion für einige Leute in den USA. </p> <h2 id=\"spotify-rolls-out-real-time-lyrics\"> Spotify Rolls Out Real-Time Lyrics </h2> <p> Wenn Sie sich in den USA befinden, sehen Sie möglicherweise eine neue Spotify-Funktion, mit der Sie Liedtexte in Echtzeit gegen die Musik anzeigen können, die Sie spielen. Die Texte werden von der Musikdatenfirma Musixmatch bereitgestellt. </p> <p> &quot;Könnte&quot; ist dort das Stichwort, da sich diese noch in einer Testphase befindet. Das bedeutet, dass nur eine Gruppe von Benutzern die Funktion sieht, während Spotify ihre Auswirkungen misst. Es ist nicht bekannt, aus wie vielen Benutzern die Testgruppe besteht. </p> <p> Songtexte sind ein seit langem nachgefragtes Feature für Spotify, daher wäre es überraschend, wenn das Feature nicht schließlich für alle eingeführt würde, aber nichts ist sicher. </p> <p> In einer E-Mail an <a href=\"https://www.engadget.com/spotify-live-lyrics-united-states-test-ios-android-140045159.html\" target=\"_blank\" rel=\"nofollow noopener\"> Engadget </a> , sagte ein Spotify-Sprecher: </p> <blockquote> <p> Wir können bestätigen, dass wir derzeit unsere Songtext-Funktion für eine ausgewählte Anzahl von Nutzern in den USA testen. Bei Spotify führen wir routinemäßig eine Reihe von Tests durch, um unsere Benutzererfahrung zu verbessern. Einige dieser Tests ebnen schließlich den Weg für unsere breitere Benutzererfahrung und andere dienen nur als wichtiges Lernmittel. Wir haben derzeit keine weiteren Neuigkeiten zu teilen. </p> </blockquote> <p> </p> <h2 id=\"are-lyrics-new-for-spotify\"> Sind Songtexte neu für Spotify? </h2> <p> Genau genommen sind Echtzeit-Texte kein neues Feature. Das liegt daran, dass es seit Juni 2020 in Ländern wie Brasilien, Mexiko, Indien und Singapur verfügbar ist. </p> <p> Tatsächlich hatte Spotify schon lange zuvor ein Live-Text-Feature weltweit. Es war auch das Ergebnis einer Partnerschaft mit Musixmatch, obwohl das Feature kurzerhand entfernt wurde, als die Vereinbarung zwischen den beiden Unternehmen auslief. </p> <p> Spotify ersetzte es dann durch eine Integration mit Genius in einem Feature namens &quot;Behind the Lyrics&quot;, das Informationen und lustige Fakten zu einigen Songs anzeigt. Dies ist auch bei Apple Music verfügbar, das selbst auch Live-Texte unterstützt. </p> <p> Engadget berichtet, dass &quot;Behind the Lyrics&quot; von Spotify entfernt wird, wenn die Live-Text-Funktion erweitert wird. Es wird wahrscheinlich nicht von vielen vermisst werden. </p> <p> Für diejenigen in Regionen, die noch keine Live-Texte haben, gibt es die Möglichkeit, <a href=\"https://www.makeuseof.com/tag/lyrics-currently-playing-songs-spotify/\" target=\"_blank\" rel=\"nofollow noopener\"> Verwenden Sie andere Apps, um Songtexte in Spotify anzuzeigen </a> . </p> <p> Natürlich können Sie auch eine der vielen Lyric-Websites im Internet verwenden, die jedoch nicht rechtzeitig zu Ihrer Spotify-Musik angezeigt werden. </p>"}