{"title":"So drehen Sie Ihre PS5 von vertikal in horizontal (oder umgekehrt)","content":"<p> Die PlayStation 5 funktioniert entweder in einem vertikalen oder horizontalen Setup. Wenn Sie Ihre bevorzugte Ausrichtung ändern, ist es ziemlich einfach, Ihre PS5 von vertikal in horizontal (oder umgekehrt) zu verschieben. </p> <p> Sehen wir uns an, wie Sie Ihre PS5 sicher von einer vertikalen Ausrichtung in eine horizontale Ausrichtung auf der Seite und wieder zurück bewegen können. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> Zuerst: Herunterfahren und Trennen der PS5 </h2> <p> Bevor Sie Ihre PlayStation 5 physisch bewegen, ist es wichtig, sie herunterzufahren und alles vom Netz zu trennen. Dies verhindert Schäden am System, die auftreten könnten, wenn Sie es im eingeschalteten Zustand bewegen. </p> <p> Sie sollten Ihre PS5 vollständig ausschalten. Drücken Sie dazu die <strong> PS-Taste </strong> auf Ihrem Controller, um das Schnellmenü am unteren Bildschirmrand aufzurufen. Wählen <strong> Leistung </strong> rechts und wählen Sie <strong> PS5 ausschalten </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Warten Sie, bis die Lichter Ihrer Konsole erloschen sind, und ziehen Sie dann das Netzkabel, das HDMI-Kabel und alles andere, was Sie an das System angeschlossen haben, ab. Jetzt können Sie die Ausrichtung Ihrer PS5 ändern. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Entfernen Sie die Ständerschraube </h2> <p> Wenn Sie Ihre PS5 vertikal aufstellen, mussten Sie eine mitgelieferte Schraube aus einem Fach in der Base nehmen und damit die Base an der Konsole befestigen, wenn sie vertikal sitzt. Daher ist das Entfernen dieser Schraube Ihr erster Schritt, um die Ausrichtung Ihrer Konsole zu ändern. </p> <p> Drehen Sie Ihre PS5 vorsichtig auf die Seite, damit Sie auf den Ständer an der Unterseite zugreifen können. Verwenden Sie einen Schlitzschraubendreher, eine Münze oder ähnliches, um die einzelne silberne Schraube zu entfernen, die die Basis am System befestigt. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Sobald die Schraube gelöst ist, wird die Basis frei. Im Boden befindet sich ein kleines Fach, in dem Sie die Schraube aufbewahren können. Lassen Sie es dort einrasten und schieben Sie es dann in das kleine Loch, um es zu sichern. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> Auch in diesem Fach finden Sie einen kleinen schwarzen Stopper (sofern Sie ihn bei der Ersteinrichtung dort hineinstecken). Entferne diesen Stopfen und verschließe damit das Loch an der Unterseite der PS5, wo du gerade die Schraube herausgenommen hast. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Drehen Sie die Basis </h2> <p> Jetzt möchten Sie die Basis drehen, damit sie in ihrer horizontalen Ausrichtung auf die Konsole passt. Dies schließt auch das kleine Fach, in dem Sie die Schraube platziert haben, und sichert es weiter. </p> <p> Sie sollten die Basis drehen, wenn Sie sie von oben betrachten (gegenüber von der Stelle, an der Sie gerade die Schraube aufbewahrt haben). Wenn Sie den erhöhten Teil des Ständers als &quot;Norden&quot; behandeln, müssen Sie das äußere Teil des Ständers nach &quot;Nordwesten&quot; drehen, wie unten gezeigt. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Dies ist die richtige Ausrichtung für die horizontale Verwendung des Ständers. Es klickt und stoppt sanft, wenn Sie es an der richtigen Stelle haben. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Bringen Sie den Ständer in der horizontalen Position an </h2> <p> Jetzt kannst du den Ständer an deiner PS5 befestigen, während sie horizontal sitzt. Stellen Sie sicher, dass das System richtig sitzt – das PS-Logo sollte nach oben zeigen. </p> <p> Auf der Rückseite Ihres Systems, unter und in der Nähe der beiden USB-Anschlüsse, sehen Sie einige PlayStation-Controller-Symbole auf der Konsole. Schieben Sie die äußeren Arme der Basis (die Sie gerade gedreht haben) auf das System, wo dieses Muster auf jeder Seite endet. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Drücken Sie die Clips, um sie zu sichern, aber beachten Sie, dass der Ständer in dieser Position nicht vollständig eingerastet ist (wie bei der Schraube bei vertikaler Aufstellung). Gehen Sie beim Abstellen des Systems vorsichtig vor und beachten Sie, dass der Ständer verrutschen könnte, wenn Sie daran ziehen. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Jetzt sind Sie bereit, Ihre PS5 in horizontaler Ausrichtung zu verwenden. Stecken Sie alle Kabel wieder ein und starten Sie es, um wieder zu spielen. Wenn Sie die Standard-PS5 haben, legen Sie Discs mit der Vorderseite nach oben in dieser Ausrichtung ein. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> So ändern Sie Ihre PS5 wieder von horizontal in vertikal </h2> <p> Möchten Sie Ihre PS5 wieder vertikal ausrichten oder richten Sie Ihre PS5 zunächst horizontal ein und möchten jetzt vertikal gehen? In jedem Fall ist es einfach, den obigen Vorgang in umgekehrter Reihenfolge durchzuführen. Stellen Sie sicher, dass Sie zuerst Ihre PS5 herunterfahren und vom Netz trennen, wenn sie derzeit eingeschaltet ist oder sich im Ruhemodus befindet. </p> <p> </p> <p> Um in eine vertikale Ausrichtung zu wechseln, hebe zuerst deine PS5 an und ziehe den Ständer vorsichtig aus dem System, um ihn zu entfernen. Als nächstes sollten Sie den äußeren Arm der Basis drehen. Von oben betrachtet sollte der Arm &quot;nördlich&quot; sein, in einer Linie mit dem erhöhten Teil. Stellen Sie sicher, dass Sie das sanfte Klicken spüren, damit Sie wissen, dass es an der richtigen Stelle ist. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> Positioniere deine PS5 so, dass du auf die Unterseite zugreifen kannst, und entferne dann den schwarzen Stopfen aus dem Loch in der Mitte – er befindet sich ungefähr in der Mitte der Lüftungsöffnungen. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Setzen Sie diesen schwarzen Stopfen in das kleine Loch im Fach an der Unterseite des Sockels. Der Stopper sollte genau an seiner Stelle einrasten. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> Als nächstes entfernen Sie die Schraube aus dem gleichen Fach in der Basis. Jetzt müssen Sie den Ständer in der richtigen Position anbringen. Stelle dazu deine PS5 auf, sodass die Rückseite der Konsole nach oben zeigt, wie unten gezeigt. </p> <p> Nehmen Sie den Ständer und platzieren Sie ihn so, dass das Loch für die Schraube mit dem Schraubenloch übereinstimmt, aus dem Sie gerade den Stopfen entfernt haben. Positionieren Sie die Clips am Arm der Basis an der Rückseite Ihres Systems unter dem Stromanschluss. Der Ständer sollte sich leicht aufstellen lassen. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Ziehen Sie nun die Schraube mit einem Schraubendreher oder ähnlichem fest. Sobald Sie fertig sind und sich der Ständer fest anfühlt, können Sie Ihre PS5 vertikal verwenden. Schließen Sie alle Kabel wieder an, um den Job abzuschließen. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> Sollten Sie Ihre PS5 vertikal oder horizontal aufstellen? </h2> <p> Sony unterstützt die Verwendung Ihrer PS5 sowohl vertikal als auch horizontal, es gibt also keinen richtigen oder falschen Weg, solange Ihr System genügend Luftstrom erhält. Welche Ausrichtung Sie verwenden sollten, hängt von Ihren Bedürfnissen ab. </p> <p> </p> <p> Wenn Sie viel Platz haben und es nichts ausmacht, dass die PS5 viel horizontalen Platz beansprucht, ist der horizontale Look glatt. Für diejenigen mit dem Standardmodell PS5 erleichtert es auch das Einlegen von Discs, da das Etikett immer nach oben zeigen sollte. Dies ist bei der vertikalen Ausrichtung, bei der das Disc-Etikett nach links zeigen sollte, etwas schwieriger zu merken. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> Möglicherweise haben Sie jedoch keinen Platz in Ihrem Unterhaltungssystem, um die horizontale Aufstellung unterzubringen. In diesen Fällen ist es am besten, vertikal zu gehen. Die PS5 ist in jedem Fall eine riesige Konsole, aber wenn sie vertikal aufgestellt wird, sitzt sie gut neben Ihrem Fernsehständer oder ähnlichem. Dies ist das Setup, das ich verwende, wie im folgenden Bild gezeigt. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> Unabhängig davon, welche Ausrichtung Sie für Ihre PS5 wählen, stellen Sie sicher, dass Sie den Ständer verwenden. Es hält das System vom Boden fern, was den Luftstrom verbessert. Der Ständer sichert auch die PS5 und macht es schwieriger, sie umzustoßen und möglicherweise zu beschädigen. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> Richten Sie Ihre PS5 ein und beginnen Sie mit dem Spielen </h2> <p> Jetzt wissen Sie, wie Sie Ihre PS5 in wenigen Minuten von vertikal auf horizontal und wieder zurück ändern können. Sobald Ihr System eingerichtet ist, starten Sie es und genießen Sie einige der besten Titel der PS5. </p> <p> Vergessen Sie nicht, dass fast die gesamte Bibliothek der PS4 auch auf der PS5 funktioniert, sodass Sie viel mehr genießen können. </p> <p> <small> Bildquelle: Alex Van Aken/ <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}