{"title":"So erstellen oder bearbeiten Sie ein Muster in Adobe Illustrator","content":"<p> Erstellen Sie ein Muster in Adobe Illustrator und können Sie es schnell auf Formen, Striche und sogar Text anwenden. Sie können etwas Einfaches erstellen, wie ein Punktmuster, oder etwas Komplexeres. Sie können sogar einen Teil einer vorhandenen Vektorgrafik verwenden und auch daraus ein Muster machen. </p> <p> Muster eignen sich hervorragend für Hintergründe, Texturen und mehr. Hier erfahren Sie, wie Sie die Musterwerkzeuge von Illustrator verwenden und Ihre eigenen Muster erstellen und bearbeiten. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Verwenden der Standardmuster in Adobe Illustrator </h2> <p> Illustrator wird mit mehreren integrierten Mustern geliefert. Sie sind nicht nur nützlich, sondern auch eine gute Möglichkeit, die Funktionsweise von Mustern zu erkennen. Diese Muster geben Ihnen auch eine Vorstellung davon, wie Sie Ihre eigenen Muster verwenden können, nachdem Sie sie erstellt haben. </p> <p> </p> <p> Muster finden Sie in Ihrem Farbfeldfenster. Wenn es noch nicht geöffnet ist, gehen Sie zu <strong> Fenster &gt; Farbfelder </strong> aus dem oberen Menü. Neben Volltonfarben enthält Ihr Farbfeldfenster möglicherweise bereits einige Muster – dies sind jedoch nicht die einzigen Muster, die Illustrator hat. </p> <p> Drücke den <strong> Swatch-Bibliothek </strong> Symbol unten links in Ihrem Swatch-Fenster. Bewegen Sie den Mauszeiger über <strong> Muster </strong> , und wählen Sie dann eine der Musterfeldbibliotheken aus. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Sie können diese Farbfelder jetzt wie bei Volltonfarben anwenden. Hier sehen Sie Muster aus dem <strong> Natur_Foliage </strong> Bibliothek als Füllungen und Striche sowie auf Text angewendet. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> So erstellen Sie ein grundlegendes sich wiederholendes Muster in Illustrator </h2> <p> Sie können jeden Vektor in ein Muster umwandeln, sei es etwas, das Sie bereits entworfen haben oder etwas, das Sie mit dieser speziellen Absicht erstellen. Sie können dies mit einer ganzen Vektorgrafik, einer einzelnen Ebene oder allem dazwischen tun. </p> <p> Sie müssen nur auswählen, was Sie in ein Muster umwandeln möchten, und es dann in das Farbfeldfenster ziehen. Zum Beispiel könnten Sie dieses Katzenauge in Ihre Farbfelder ziehen. Dadurch würde ein Mustermuster erstellt, mit dem Sie dann ein Rechteck oder eine andere Form füllen können. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> Alternativ können Sie dasselbe mit dem gesamten Vektor tun. In beiden Fällen erstellt Illustrator ein Muster aus dem, was Sie in das Farbfeldfenster ziehen. Sie können das Muster einfach wie jedes normale Farbmuster auftragen. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Wenn Sie im Fenster „Farbfelder“ auf Ihr Mustermuster doppelklicken, wird das <strong> Musteroptionen </strong> Fenster. Sie können dies auch direkt aus öffnen <strong> Windows &gt; Musteroptionen </strong> im oberen Menü. </p> <p> Hier können Sie Ihr Muster weiter bearbeiten, einschließlich dessen, wie es sich wiederholt und wie groß die Lücken zwischen den einzelnen Iterationen Ihres Bildes sind. Hier bearbeiten Sie auch direkt Ihr Schnittdesign. Die nicht abgeblendete Version des Bildes kann wie gewohnt bearbeitet werden. Sie können Farben ändern, Ebenen verschieben usw. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> Es gibt verschiedene Dinge, die Sie mit dem Musteroptionen-Fenster tun können. Sie können Ihr Bild beispielsweise in einem versetzten Ziegellayout wiederholen und die Lücke zwischen den einzelnen Teilen des Musters verringern. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> Bringen Sie die Teile Ihres Musters nahe genug zusammen, und Sie können sie überlappen lassen. Auf diese Weise können Sie eine Art Kachelmuster wie das unten gezeigte erstellen. Probieren Sie die verschiedenen Überlappungseinstellungen in den Musteroptionen aus, um etwas zu finden, das für Sie funktioniert. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> So erstellen Sie ein nahtloses Muster in Adobe Illustrator </h2> <p> Wenn Sie ein nahtloses geometrisches Muster erstellen möchten, müssen Sie sicherstellen, dass Ihr Design symmetrisch ist. Zum Beispiel muss eine Linie, die 10px oben auf der linken Seite Ihres Musters beginnt, 10px oben auf der rechten Seite enden. Wenn es sich wiederholt, müssen diese Punkte zusammengeführt werden. </p> <p> Erstellen Sie dazu ein neues Dokument mit quadratischen Abmessungen. Aktivieren Sie die Rasterüberlagerung, indem Sie drücken <strong> Strg + &quot; </strong> ( <strong> Befehl + &quot; </strong> auf dem Mac). Auch Smart Guides sind nützlich – aktivieren Sie sie mit <strong> Strg + U </strong> ( <strong> Befehl + U + </strong> auf dem Mac). Wenn deine Lineale nicht sichtbar sind, drücke <strong> Strg + R </strong> ( <strong> Befehlstaste + R </strong> auf dem Mac), um sie zu aktivieren. </p> <p> Sie finden diese Einstellungen auch unter <strong> Aussicht </strong> im oberen Menü, aber wir empfehlen die Verwendung von <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Die Tastenkombinationen von Illustrator </a> wo Sie Zeit sparen können. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Legen Sie Ihr Design im Quadrat aus. Alle Teile, die über die Kanten gehen, müssen auf der anderen Seite ausgerichtet werden. Das <strong> Ausrichten </strong> Werkzeug ( <strong> Fenster &gt; Ausrichten </strong> ) kann Ihnen dabei helfen, die Dinge richtig aufeinander abzustimmen. Klicken Sie auf die Lineale und ziehen Sie sie hinein, um Ihre eigenen Hilfslinien dort zu erstellen, wo Sie sie benötigen. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> Es ist wichtig, auch eine Hintergrundfarbe zu haben, auch wenn sie weiß ist. Stellen Sie sicher, dass dies perfekt zu den Kanten der Zeichenfläche passt, da Sie es zum Beschneiden des überflüssigen Materials benötigen. </p> <p> Wählen Sie alles aus mit <strong> Strg + A </strong> ( <strong> Befehl + A </strong> auf dem Mac) und drücke dann <strong> Umschalt + M </strong> um die zu aktivieren <strong> Shape Builder </strong> Werkzeug. Diese finden Sie auch in der Toolbox. Runter halten <strong> Alt </strong> ( <strong> Möglichkeit </strong> auf dem Mac). Dies stellt die <strong> Shape Builder </strong> Werkzeug in den Subtraktionsmodus. </p> <p> Wenn Sie mit diesem Werkzeug über Teile Ihres Designs fahren, sollten Sie sehen, dass sich die Farbe leicht ändert. Klicken Sie auf die Bereiche, die Sie nicht möchten, und Illustrator entfernt diese Teile und lässt nur die Bits übrig, die sich mit dem Hintergrundquadrat überlappen. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> Sobald dies erledigt ist, wählen Sie alles aus und ziehen Sie es in Ihre Farbfelder, um es in ein Muster zu verwandeln. Um Ihr Muster in einem neuen Dokument zu verwenden, können Sie es in einer Farbfeldbibliothek speichern oder Ihre Adobe Cloud-Bibliothek verwenden. </p> <p> Alternativ können Sie es auch einfach aus diesem Swatch-Fenster kopieren und in ein anderes Swatch-Fenster in einem anderen Dokument einfügen. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Sie können dieses Muster jetzt wie jedes andere Muster anwenden. Wenn Sie es richtig gemacht haben, sollte alles ohne Lücken ausgerichtet sein. Nehmen Sie bei Bedarf Anpassungen in Ihrem Musterdokument vor. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> Wann sollten Sie Muster in Adobe Illustrator verwenden? </h2> <p> Die offensichtlichste Verwendung für Muster besteht darin, wiederholbare Kacheln für Hintergründe zu erstellen, aber Sie können sie auch zum Ausfüllen von Formen verwenden, um ihnen eine Textur zu verleihen. Mit Mustern gefüllter Text ist eine weitere gute Verwendung und kann Ihre Typografie wirklich hervorheben. </p> <p> Wenn Sie möchten, können Sie sogar Ihre eigenen Muster manuell erstellen, indem Sie das gleiche Bild immer wieder kopieren und einfügen. Es mag Gelegenheiten geben, in denen Sie dies tun möchten, aber meistens ist die Fähigkeit von Illustrator, die Mustererstellung zu automatisieren, der richtige Weg. </p> <p> Dies ist nur eine von vielen Möglichkeiten, wie Illustrator Ihnen das Leben erleichtern kann und Ihnen mehr Zeit für die Arbeit an Ihren Designs gibt. </p>"}