{"title":"Twitter soll die persönlichen Konten von Regierungsbeamten kennzeichnen","content":"<p> Twitter wird bald damit beginnen, die persönlichen Konten von Regierungsbeamten mit Labels zu versehen. Die Labels sollen Benutzern helfen, Personen, die mit der Regierung in Verbindung stehen, leicht zu identifizieren. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Mehr Regierungsbeamte werden auf Twitter ein Label erhalten </h2> <p> Laut einem Beitrag auf <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> der Twitter-Blog </a> , wird die Plattform am 17. Februar 2021 damit beginnen, die persönlichen Konten von &quot;Staatsoberhäuptern&quot; zu kennzeichnen. Sie wird auch Etiketten auf Konten anbringen, die mit staatsnahen Medien verbunden sind. </p> <p> Twitter erweitert auch die Reichweite seiner Labels, um Regierungsbeamte in mehr Ländern abzudecken. Zu diesen Standorten gehören Kanada, Kuba, Ecuador, Ägypten, Deutschland, Honduras, Indonesien, Iran, Italien, Japan, Saudi-Arabien, Serbien, Spanien, Thailand, die Türkei und die Vereinigten Arabischen Emirate. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Bildquelle: Twitter </p> <p> Die Plattform hofft, dass diese Labels den Benutzern helfen, &quot;eine fundiertere Erfahrung auf Twitter zu machen&quot;, und plant auch, den Text des Labels zu optimieren, um &quot;mehr Spezifität&quot; durch &quot;Unterscheidung zwischen Einzelpersonen und Institutionen&quot; zu erzielen. </p> <p> Twitters erste Welle von Labels für regierungsnahe Konten wurde im August 2020 eingeführt. Anfangs galten diese Labels nur für die mit den fünf Ländern im Sicherheitsrat der Vereinten Nationen verbundenen Beamten und umfassten nicht die persönlichen Konten dieser Beamten. </p> <p> Das heißt, diese Labels sind nicht <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> eklatanter Stoß auf Fehlinformationen </a> , aber Sie helfen den Nutzern trotzdem, mehr Kontext zu dem zu erhalten, was sie lesen und von wem sie stammen. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter wird seine Labels nur weiter ausbauen </h2> <p> Am Ende seines Blog-Posts stellte Twitter fest, dass es hofft, seine Labels im Laufe der Zeit auf &quot;weitere Länder&quot; auszudehnen. Das Label erscheint als blassgraue Flagge auf dem Twitter-Profil einer Person und wird Ihnen in den kommenden Wochen wahrscheinlich häufiger begegnen. </p>"}