{"title":"US-Regierung möchte Informationen zur Genauigkeit von App-Datenschutzetiketten erhalten","content":"<p> Mit seinen iOS 14 App Privacy Labels im App Store bietet Apple Benutzern eine neue Möglichkeit, mehr über die Apps zu erfahren, die sie verwenden – und wie diese Apps sie möglicherweise verfolgen. </p> <p> Aber es scheint, dass es auch eine Dose Würmer für sich selbst eröffnet hat, da Apple nun dazu gedrängt wird, für die Richtigkeit dieser Etiketten zu bürgen, die die Entwickler bereits im Dezember an Apple übermittelt haben. </p> <h2 id=\"concerns-over-accuracy\"> Bedenken hinsichtlich der Genauigkeit </h2> <p> Wie bemerkt von <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumors </a> , Apple hat a erhalten <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Brief </a> vom U.S. House Committee on Energy and Commerce mit der Bitte um Klarstellung der von den Entwicklern bereitgestellten Genauigkeit seiner App-Datenschutzlabels. </p> <p> Diese Labels sind eine in manchen Quartalen mit Spannung erwartete, in anderen gefürchtete Funktion von iOS 14, die Entwickler dazu zwingen wird, offener mit der Interaktion ihrer Apps mit Benutzerdaten umzugehen. Dies bedeutet, dass Benutzer eine fundiertere Entscheidung treffen können, wenn es um die Vor- und Nachteile der Verwendung bestimmter Apps geht. </p> <p> </p> <p> In seinem Schreiben fragt der Ausschuss für Energie und Handel des US-Repräsentantenhauses Apple nach Berichten, die darauf hindeuten, dass bestimmte App-Datenschutzlabels Benutzern „irreführende und falsche“ Informationen liefern könnten. Das basiert auf einem Bericht, der letzten Monat veröffentlicht wurde und behauptet, dass viele Apps mit einem sauberen Gesundheitszeugnis nicht ganz so unschuldig sind, wie sie vermuten. </p> <p> Ein potenzielles Problem mit der iOS 14-Funktion besteht darin, dass es auf die Ehrlichkeit der Entwickler angewiesen ist, um zu sagen, wie Daten gesammelt werden, und um zu bestätigen, dass diese Informationen korrekt sind. Apple selbst weist darauf hin, dass die Informationen &quot;nicht von Apple verifiziert wurden&quot;. </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Anfordern einer Antwort von Apple </h2> <p> Obwohl es wahrscheinlich ist, dass die meisten Entwickler fair spielen und sich an das Ehrensystem halten, ist dies keine Selbstverständlichkeit. Apple prüft die gesendeten Informationen routinemäßig. Die enorme Anzahl an Apps im App Store macht es Apple jedoch unmöglich, jeden einzelnen Eintrag persönlich zu verifizieren. </p> <p> Der Brief des Ausschusses für Energie und Handel des US-Repräsentantenhauses fährt fort, dass: </p> <blockquote> <p> „Wir fordern Apple auf, die Gültigkeit seiner App-Datenschutzlabels zu verbessern, um sicherzustellen, dass Verbraucher aussagekräftige Informationen über die Datenpraktiken ihrer Apps erhalten und dass Verbraucher durch diese potenziell irreführenden Praktiken nicht geschädigt werden.“ </p> </blockquote> <p> Der Ausschuss hat Apple gebeten, mehr Details zu seinem Audit-Prozess anzugeben, ob App-Datenschutzlabels korrigiert werden, wenn sie sich als unwahr herausstellen, Details dazu, was passiert, wenn Entwickler ungenaue Informationen bereitstellen, und mehr. </p> <p> Sie bitten Apple, bis zum 23. Februar mit den angeforderten Informationen zu antworten. </p> <p> <small> Bildquelle: Jason Dent/ <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Unsplash CC </a></small> </p>"}