{"title":"Volkswagen setzt Microsoft Azure in selbstfahrenden Autos ein","content":"<p> Microsoft möchte gerne in den Markt für selbstfahrende Autos einsteigen, hat aber keine Erfahrung im Entwerfen und Bauen eines Autos. Es kann jedoch den Kopf eines smarten Autos liefern, und Volkswagen ist daran interessiert, die Dienste von Microsoft für seine eigenen Fahrzeuge zu nutzen. </p> <h2 id=\"microsoft-and-volkswagen-s-partnership-for-automatic-cars\"> Partnerschaft von Microsoft und Volkswagen für automatische Autos </h2> <p> Die Nachricht von dieser Partnerschaft wurde am <a href=\"https://www.reuters.com/article/us-microsoft-volkswagen/volkswagen-taps-microsofts-cloud-to-develop-self-driving-software-idUSKBN2AB0SZ\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> . Volkswagen holt Microsoft für den Einstieg in die Welt der selbstfahrenden Autos. </p> <p> Volkswagen besitzt tatsächlich ein paar verschiedene Autofirmen, wie Audi, Porshe und Lamborghini. Das Problem war, dass die Ingenieure in jedem Unternehmen ihren eigenen Weg gingen, um ein selbstfahrendes Auto zu entwickeln, anstatt Informationen miteinander zu teilen. </p> <p> Um dieses Problem zu lösen, hat Volkswagen alle seine selbstfahrenden Autoingenieure in eine große Gruppe namens Car.Software zusammengefasst. Die Idee war, dass sich der Konzern vereinen und eine einzige Smart-Car-Plattform schaffen könnte, die Volkswagen für alle seine Autos nutzen kann. </p> <p> Wie sich jedoch herausstellte, verwendeten verschiedene Ingenieure bei Car.Software immer noch unterschiedliche Plattformen, um ihren Code zu entwickeln. Daher wandte sich Volkswagen an Microsoft, um jedem eine Basisplattform zum Arbeiten zu bieten. </p> <p> Dies bedeutet nicht, dass die Autos von Volkswagen mit Windows 10 laufen. Microsoft hat eine andere Plattform namens Azure, die darauf ausgelegt ist, Internet of Things (IoT)-Geräte zu verbinden. </p> <p> Wenn Ihnen das bekannt vorkommt, liegt es daran, dass es sich um denselben Service handelt <a href=\"https://www.makeuseof.com/microsoft-powered-self-driving-car/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft hat Cruise für seine selbstfahrenden Autos angeboten </a> . Jetzt ist klar, dass der Cruise-Deal kein einmaliger Deal war; Microsoft meint es ernst damit, Autos auf Azure zum Laufen zu bringen. </p> <p> Angesichts der Leistung von Azure für Microsoft überrascht es nicht, dass der Softwareriese zuschlagen will, während das Eisen heiß ist. Die Kombination von Microsofts Azure- und Xbox-Diensten hat <a href=\"https://www.makeuseof.com/microsoft-reveals-record-profits/\" target=\"_blank\" rel=\"nofollow noopener\"> hat dem Unternehmen während der Pandemie einen ordentlichen Gewinn eingebracht </a> . </p> <p> Daher besteht ein großer Anreiz, Azure in selbstfahrende Autos zu integrieren, um ihm eine noch größere Präsenz in der Welt der intelligenten Geräte zu verleihen. Ob Azure ein wichtiger Akteur in der Smart-Car-Welt wird, ist noch offen. </p> <p> </p> <h2 id=\"starting-the-engine-for-microsoft-azure\"> Starten der Engine für Microsoft Azure </h2> <p> Microsoft Azure ist bereits ein großer Geldverdiener für den Technologieriesen, was das Unternehmen in eine perfekte Position bringt, um in neue Gebiete vorzustoßen. Sowohl Cruise als auch die selbstfahrenden Autos von Volkswagen werden Microsoft Azure als Grundlage verwenden, das möglicherweise ein wichtiger Akteur in der Zukunft des Automobils werden kann. </p> <p> In einer seltsamen Wendung des Schicksals breitet sich die alte Rivalität zwischen Microsoft und Apple in der Welt der Smart Cars aus. Statt nur Autohersteller mit dem „smarten“ Teil zu beliefern, will Apple bis 2024 komplette „Apple Cars“ produzieren. </p> <p> <small> Bildquelle: Andrey Suslov / <a href=\"https://www.shutterstock.com/image-vector/autonomous-smart-car-scans-road-operates-635238704\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}