{"title":"VW behauptet, Apple werde es in der Autoindustrie nicht leicht haben","content":"<p> Herbert Diess, der Vorstandsvorsitzende des Volkswagen Konzerns, hat mögliche Auswirkungen eines Apple Cars auf die Automobilindustrie heruntergespielt und erklärt, VW habe „keine Angst“ vor dem Projekt Titan. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW &quot;Keine Angst&quot; vor einem Apple-Auto </h2> <p> Obwohl Diess einräumt, dass ein Auto der Marke Apple durchaus Sinn machen kann, glaubt er nicht, dass Apple aufgrund des intensiven Wettbewerbs die Automobillandschaft &quot;über Nacht&quot; dominieren könnte. Stahl zu schneiden und Autos an wählerische Verbraucher zu verkaufen, sei ein schwieriges Geschäft, deutete er an und fügte hinzu, dass dies kein Feld sei, das ein Unternehmen einfach &quot;auf einen Schlag übernehmen&quot; könne. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> gibt weiter, was Diess der Frankfurter Allgemeinen Sonntagszeitung in einem Interview sagte: </p> <blockquote> <p> Die Autoindustrie ist keine typische Technologiebranche, die man mit einem Schlag übernehmen könnte. Apple wird das nicht über Nacht schaffen. Trotzdem haben wir keine Angst. </p> </blockquote> <p> Dennoch wäre ein Fahrzeug der Marke Apple angesichts der Kompetenzen von Apple in den Bereichen Batterien, Software, Industriedesign und seiner scheinbar endlosen Ressourcen sinnvoll, fügte die Führungskraft hinzu. Apple bietet außer dem car keine autobezogenen Produkte an <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> CarPlay-Dashboard-Software </a> das lässt ein Autoradio oder eine Headunit als Display und Controller für ein iPhone fungieren. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> Das am schlechtesten gehütete Geheimnis der Branche </h2> <p> Pläne für Project Titan (der interne Codename für ein Apple Car) sind trotz einer Flut neuer Gerüchte immer noch nicht öffentlich <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple suchte eine Partnerschaft mit Hyundai/Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple soll mit anderen Automobilherstellern gesprochen haben </a> und Vertragshersteller – darunter Magna, Nissan und Foxconn – über den Bau ihres autonom fahrenden Fahrzeugs. Quellen sagen, dass ein Apple Car möglicherweise kein Lenkrad hat, weil es anfangs möglicherweise <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> Fokus auf Essenslieferung und Robotaxi-Operationen </a> bevor sie an Verbraucher verkauft werden. </p> <p> </p> <p> Die größte Erkenntnis aus Herberts Kommentar wäre, dass die Automobilindustrie dem Projekt Titan große Aufmerksamkeit geschenkt hat. Schon allein der Gedanke, dass Apple in diesen Sektor einsteigt, macht einige der Top-Manager nervös. Die Geschichte ist jedoch voll von Menschen, die es besser hätten wissen sollen, als Apple dafür zu verspotten, dass er eine neue Produktkategorie betreten hat. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Wie Palm-CEO über das iPhone lachte </h2> <p> Das beste Beispiel dafür ist der ehemalige Palm-CEO Ed Colligan. Nur wenige Wochen vor der ursprünglichen iPhone-Einführung im Jahr 2007 lachte Colligan über die Idee, dass ein Unternehmen, das dafür bekannt ist, hübsche Computer zu entwickeln, Kunden im wettbewerbsorientierten Smartphone-Sektor gewinnen könnte, und sagte: </p> <blockquote> <p> Wir haben hier einige Jahre lang gelernt und gekämpft, um herauszufinden, wie man ein anständiges Telefon herstellt. PC-Leute werden das nicht einfach herausfinden. Sie werden nicht einfach reingehen. </p> </blockquote> <p> Ähnlich wie Colligan Apple als &quot;PC-Typen&quot; bezeichnete, versucht der Volkswagen-Chef, die Vorstellung herunterzuspielen, dass ein Technologieunternehmen Kunden im Automobilbau gewinnen könnte. Die Geschichte wird zeigen, ob Herberts Kommentar besser altert als der von Colligan. </p>"}