{"title":"Was ist MTA-STS und wie schützt es Ihre E-Mails?","content":"<p> E-Mails sind der größte Übeltäter hinter den meisten Cyberangriffen. Es ist ein einfacher Zugangspunkt für Malware, Adware, Spam und Phishing und bietet Bedrohungsakteuren unbegrenzte Möglichkeiten, an Ihre persönlichen Daten zu gelangen. </p> <p> Um diese Bedrohungen zu mindern, sollten sowohl für private als auch für geschäftliche E-Mail-Konten strenge Sicherheitsmaßnahmen ergriffen werden. </p> <h2 id=\"email-security-and-encryption\"> E-Mail-Sicherheit und -Verschlüsselung </h2> <p> Trotz der Popularität anderer Kommunikationsarten ist E-Mail-Messaging immer noch die größte Form der Übertragung von Daten für Einzelpersonen oder Organisationen. Die Sicherung Ihrer E-Mail-Inhalte ist eine lebenswichtige Notwendigkeit. </p> <p> E-Mail-Sicherheit umfasst die Überprüfung und Verschlüsselung des gesamten ein- und ausgehenden E-Mail-Verkehrs. Die Verschlüsselung spielt eine wichtige Rolle, um die Privatsphäre von E-Mail-Inhalten zu wahren, indem sie sichere SMTP-Verbindungen (Simple Mail Transfer Protocol) gewährleistet. </p> <p> Bis vor kurzem war die Verschlüsselung nur eine optionale Voraussetzung für SMTP. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> Wie funktioniert die E-Mail-Verschlüsselung? </h2> <p> Bei der E-Mail-Verschlüsselung wird Ihrem Nachrichteninhalt eine Chiffre oder ein Stück Code hinzugefügt, wodurch er nicht entziffert werden kann. Durch die Umwandlung von E-Mail-Daten in Code werden die Inhalte vor unbefugter Offenlegung geschützt. Einfach gesagt, Ihre E-Mail ist verschlüsselt. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> Als zusätzliche Sicherheit verwendet der Verschlüsselungsprozess öffentliche und private Schlüssel, bei denen verschlüsselte Schlüssel ausgetauscht werden, um die verschlüsselten E-Mails zu sperren und zu entsperren. Der Absender verschlüsselt die E-Mail mit Public-Key-Kryptographie und anschließend verwendet der Empfänger einen privaten Schlüssel, um die empfangene Nachricht zu entschlüsseln. </p> <p> Die Verschlüsselung wird auf den gesamten Verlauf einer E-Mail angewendet, von Anfang bis Ende. Als Best Practice sollten alle ein- und ausgehenden E-Mails verschlüsselt werden – nicht nur diejenigen, die vertrauliche Informationen enthalten. Dadurch wird verhindert, dass die Bedrohungsakteure einen Einstiegspunkt in Ihr System erhalten. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> Hintergrund und Probleme mit SMTP </h2> <p> Als das SMTP-Protokoll 1982 eingeführt wurde, war die E-Mail-Verschlüsselung noch keine gängige Praxis und standardmäßig wurden E-Mails im Klartext gesendet und empfangen. Um die Sicherheit auf Transportebene einzuführen, wurde Ende der 1990er Jahre der Befehl STARTTLS hinzugefügt, der die Verschlüsselungsoption durch die <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> TLS-Protokoll (Transport Layer Security) </a> . </p> <p> So vielversprechend das TLS-Upgrade auch klang, es ließ zwei Sicherheitslücken intakt: </p> <ol> <li> Die Verschlüsselungsoption war genau das: <strong> Optional </strong> . Ungesicherte E-Mails waren immer noch weit verbreitet, was zu einem Anstieg der Cyberangriffe führte. </li> <li> Selbst mit STARTTLS gab es keine Möglichkeit, die Identität des Absenderservers zu authentifizieren, da SMTP-Server Zertifikate nicht validieren. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> Die Ankunft von MTA-STS </h2> <p> Im Jahr 2019 trat Google endlich auf den Plan und kündigte die Einführung des neuen MTA-STS-Standards (Mail Transfer Agent/Strict Transport Security) an ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> Dies gibt den E-Mail-Dienstanbietern die Möglichkeit, TLS zur Sicherung von SMTP-Verbindungen vorzuschreiben und bietet auch die Möglichkeit, die E-Mail-Zustellung an MX-Hosts zu verweigern, die kein TLS mit einem zuverlässigen Serverzertifikat anbieten. </p> <p> MTA-STS kümmert sich schließlich um alle bisherigen Probleme mit SMTP, indem es die Verschlüsselung zwischen den kommunizierenden SMTP-Servern durchsetzt. Aber wie funktioniert es eigentlich? Lass es uns herausfinden! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> Wie funktioniert MTA-STS? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS beginnt, indem es einen SMTP-Server anweist, nur unter zwei Bedingungen mit einem anderen SMTP-Server zu kommunizieren: </p> <ol> <li> Der SMTP-Server <strong> Muss </strong> verschlüsselt werden. </li> <li> Der Domainname im Zertifikat des Servers stimmt mit der Domain in der Richtlinie überein und die Zertifikate sind aktuell. </li> </ol> <p> Durch die Verwendung einer Kombination aus DNS und HTTPS zum Veröffentlichen einer Richtlinie informiert MTA-STS den Absender über die Vorgehensweise, wenn ein verschlüsselter Kommunikationskanal nicht initiiert werden kann. </p> <p> Es ist einfach, MTA-STS auf der Empfängerseite zu implementieren, aber für den Absender eine unterstützende Mailserver-Software wie <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> sollte benutzt werden. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> Welche Art von Angriffen schwächt MTA-STS ab? </h2> <p> Die folgenden Bedrohungen werden direkt getroffen, wenn MTA-STS auf Ihre E-Mail-Kommunikation angewendet wird: </p> <p> <strong> Man-in-the-Middle (MITM)-Angriffe: </strong> Dieser Angriff wird ausgeführt, wenn ein Angreifer mitten in die Kommunikation zwischen zwei Parteien eingreift, um Daten zu stehlen oder zu verändern. Im Falle einer E-Mail wären das normalerweise zwei miteinander kommunizierende SMTP-Server. Durch den Einsatz von MTA-STS können diese Angriffe leicht verhindert werden. </p> <p> <strong> Downgrade-Angriffe: </strong> Ein Bedrohungsakteur zwingt einen Netzwerkkanal, in einen unsicheren Datenübertragungsmodus zu wechseln. Dieser Angriff könnte beispielsweise einen Website-Besucher von einer HTTPS-Version einer Website zu einer HTTP-Version umleiten. MTA-STS hilft bei der Bekämpfung dieser Angriffe, indem es unbefugten Zugriff verhindert. </p> <p> <strong> DNS-Spoofing-Angriffe: </strong> Diese listigen Angriffe ändern die DNS-Einträge des beabsichtigten Ziels eines Benutzers und täuschen ihn vor, dass er eine legitime Site oder Domain besucht. Die Implementierung von MTA-STS trägt erheblich zur Abwehr dieser Angriffe bei. </p> <p> </p> <p> Da wir nun mit dem MTA-STS vertraut sind, ist es an der Zeit, einen neuen Berichtsstandard für SMTP namens TLS-Berichterstellung zu verwenden. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> Was ist SMTP-TLS-Berichterstellung (TLS-RPT)? </h2> <p> Genau wie MTA-STS ist TLS-RPT ein Berichtsstandard, der Verbindungsprobleme und Diskrepanzen zwischen sendenden Anwendungen erkennt. Nach der Aktivierung werden täglich Berichte zu Verbindungsproblemen gesendet, die von externen Servern beim Senden von E-Mails aufgetreten sind. </p> <p> Betrachten Sie es als ein Tool zur Fehlerbehebung, bei dem die Berichte verwendet werden können, um potenzielle Probleme und Konfigurationsprobleme einzuschätzen und zu sortieren. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> Welche Art von Problemen behebt TLS-RPT? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Diagnoseberichte: </strong> Die TLS-Berichterstellung bietet Diagnoseberichte im JSON-Dateiformat mit umfassenden Details zu eingehenden E-Mails mit Zustellproblemen. Es erkennt auch E-Mails, die beispielsweise aufgrund eines Downgrade-Angriffs zurückgewiesen oder nicht zugestellt wurden. </p> <p> <strong> Verbesserte Sichtbarkeit: </strong> Durch die Aktivierung von TLS-RPT können Sie die Sichtbarkeit auf all Ihren E-Mail-Kanälen verbessern. Auf diese Weise haben Sie alle Daten im Blick, die auf Sie zukommen, zu denen auch fehlgeschlagene Nachrichten gehören. </p> <p> <strong> Tägliche Berichte: </strong> Die Diagnoseberichte werden mindestens einmal täglich gesendet, um die MTA-STS-Richtlinien eingehend zu behandeln und zu beobachten. Die Berichte enthalten auch Verkehrsstatistiken sowie detaillierte Informationen zu Fehlern und fehlgeschlagenen Zustellungen. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Wenn alles andere fehlschlägt, setzt sich die Verschlüsselung durch </h2> <p> Aufgrund der sich ständig weiterentwickelnden Natur von Cyber-Bedrohungen sind strenge Sicherheitsmaßnahmen und Kryptographie ein Muss für eine sichere E-Mail-Zustellung. </p> <p> Dank der verschiedenen E-Mail-Anbieter mit starken Verschlüsselungsfunktionen und den MTA-STS-Standards sind vollständig sichere E-Mail-Übertragungen keine weit hergeholte Realität mehr. </p>"}