{"title":"Wie man ein YouTube-Video wiederholt","content":"<p> Möchten Sie ein YouTube-Video loopen? Ob Ihr Lieblingslied oder eine lustige Zusammenstellung, Sie müssen die Seite nicht neu laden, wenn Sie ein YouTube-Video wiederholen möchten. </p> <p> Wir zeigen Ihnen, wie Sie ein YouTube-Video auf Desktop- und Mobilgeräten wiederholen können. </p> <h2 id=\"how-to-loop-a-youtube-video-on-desktop\"> Wie man ein YouTube-Video auf dem Desktop wiederholt </h2> <ol> <li> Gehen Sie zu dem Video, das Sie wiederholen möchten. </li> <li> <strong> Rechtsklick </strong> das Video (nicht drumherum). Das YouTube-Kontextmenü wird geöffnet. </li> <li> Klicken <strong> Schleife </strong> . <p> <img alt=\"youtube video loop desktop\" src=\"images/youtube-video-loop-desktop-114.jpg\" loading=\"lazy\"> </p> </li> </ol> <p> Wenn das Video zu Ende ist, wird es automatisch geloopt. Um zu bestätigen, dass es aktiviert ist, <strong> Rechtsklick </strong> das Video und Sie sehen ein Häkchen neben <strong> Schleife </strong> (auf die Sie erneut klicken können, um sie zu deaktivieren). </p> <p> </p> <p> </p> <h2 id=\"how-to-loop-a-youtube-video-on-mobile\"> Wie man ein YouTube-Video auf dem Handy wiederholt </h2> <p> Leider ist das Loopen eines YouTube-Videos in der mobilen App nicht ganz so einfach wie auf dem Desktop. Stattdessen müssen Sie das Video in eine Playlist einfügen. So geht&#39;s: </p> <ol> <li> Gehen Sie zu dem Video, das Sie wiederholen möchten. </li> <li> Halten Sie unter dem Video die <strong> speichern </strong> Taste. </li> <li> Zapfhahn <strong> Neue Playlist </strong> . </li> <li> Geben Sie einen Namen für die Wiedergabeliste ein, wählen Sie a <strong> Privatsphäre </strong> Einstellung und tippen Sie auf <strong> Erstellen </strong> . </li> <li> Zapfhahn <strong> Siehe Liste </strong> Um zur neuen Playlist zu gelangen (oder zum Startbildschirm der App zu gehen, tippen Sie auf <strong> Bibliothek </strong> aus dem unteren Menü und geben Sie Ihre Wiedergabeliste ein). </li> <li> Tippen Sie auf die <strong> Mischen </strong> Symbol (zwei ineinander verschlungene Pfeile). <p> <strong class=\"gallery__section-title\"> Bildergalerie (3 Bilder) </strong> <img alt=\"youtube android save\" src=\"images/youtube-android-save-686.jpg\" loading=\"lazy\"> Erweitern <img alt=\"youtube android new playlist\" src=\"images/youtube-android-new-playlist-719.jpg\" loading=\"lazy\"> Erweitern <img alt=\"youtube android repeat playlist\" src=\"images/youtube-android-repeat-playlist-472.jpg\" loading=\"lazy\"> Erweitern </p> <p> Schließen </p> </li> <li> Spielen Sie das Video ab und tippen Sie auf den Pfeil in der unteren rechten Ecke des Videos. Tippen Sie dort auf das <strong> Schleife </strong> Symbol (zwei Pfeile, die ein Rechteck bilden). </li> </ol> <p> Wenn das Video zu Ende ist, wird es automatisch geloopt. Natürlich können Sie dieser Playlist auch mehrere Videos hinzufügen. </p> <p> </p> <h2 id=\"how-to-use-an-external-service-to-loop-a-youtube-video\"> So verwenden Sie einen externen Dienst zum Loopen eines YouTube-Videos </h2> <p> Wenn Sie die oben genannten nativen Methoden aus irgendeinem Grund nicht verwenden möchten, können Sie auch einen externen Dienst namens . verwenden <a href=\"https://www.youtuberepeater.com\" target=\"_blank\" rel=\"nofollow noopener\"> YouTube-Repeater </a> . </p> <p> Um dies einfach zu verwenden, gehen Sie zu dem YouTube-Video, das Sie loopen möchten. Ersetzen Sie in der URL-Leiste <strong> youtube.com </strong> mit <strong> youtuberepeater.com </strong> , und gehen Sie dann zu dieser neuen URL. </p> <p> Zum Beispiel, wenn Sie eine Schleife <strong> youtube.com/watch?v=n9xhJrPXop4 </strong> , du würdest es ändern in <strong> youtuberepeater.com/watch?v=n9xhJrPXop4 </strong> . </p> <p> Dies funktioniert nicht bei Videos, bei denen der Uploader das Einbetten des Videos außerhalb von YouTube nicht zugelassen hat. Daher ist die Verwendung einer der beiden oben genannten Methoden die ideale Wahl. </p>"}