{"title":"Was ist ein Kopfhörertreiber und wie beeinflusst er den Klang?","content":"<p> Kopfhörer sind erstaunliche Technik. </p> <p> Sie wurden für normale Leute entwickelt, die im Bett oder auf dem Weg zur Arbeit Musik hören, und für Profis, die sauber klingendes Audio zum Bearbeiten von Musik und Videos benötigen. Aus diesem Grund gibt es verschiedene Arten von Kopfhörern. Egal, ob Sie stundenlang trainieren oder Audio mischen, es gibt einen Kopfhörer für Sie. </p> <p> In diesen Kopfhörern befinden sich <strong> Fahrer </strong> die sich stark in der Größe unterscheiden und unterschiedlich hergestellt werden, je nachdem, für wen die Kopfhörer bestimmt sind. Diese Treiber beeinflussen natürlich den Klang, der in Ihre Ohren ertönt. </p> <h2 id=\"what-is-a-headphone-driver\"> Was ist ein Kopfhörertreiber? </h2> <p> <img alt=\"Open Back Headphone Driver\" src=\"images/open-back-headphone-driver-548.jpg\" loading=\"lazy\"> </p> <p> Ein Kopfhörertreiber ist im Wesentlichen ein kleiner Lautsprecher, der elektrische Signale in Töne umwandelt, die wir hören können. Diese Treiber können je nach Kopfhörertyp und Verwendungszweck stark variieren. </p> <p> Ohrhörer haben beispielsweise sehr kleine Treiber, die nur 8 mm groß sein können, wobei die größeren Treiber einen Durchmesser von etwa 15 mm haben. Die Größe von Over-Ear-Kopfhörern ist etwas drastischer, von 20 mm bis 70 mm. </p> <p> Kopfhörertreiber bestehen aus drei Komponenten: dem <strong> Magnet </strong> , <b> Schwingspulen </b> , und der <strong> Membran </strong> . </p> <ul> <li> Das <strong> Magnet </strong> erzeugt ein Magnetfeld und besteht normalerweise aus Kobalt oder Ferrit. </li> <li> <strong> Schwingspulen </strong> Lassen Sie elektrische Ströme durch sie fließen, bewegen Sie das Zwerchfell, um dann Geräusche zu erzeugen, die wir hören können. Diese Spulen, die normalerweise aus verschiedenen Kupfersorten bestehen, helfen dabei, die elektrischen Signale in Schall umzuwandeln. </li> <li> Das <strong> Membran </strong> vibriert und erzeugt Schallwellen aus den elektrischen Strömen, die durch die Schwingspulen fließen. </li> </ul> <p> </p> <h2 id=\"types-of-headphone-drivers\"> Arten von Kopfhörertreibern </h2> <p> Nicht alle Treiber funktionieren genau gleich, wobei einige je nach den verwendeten Materialien, dem Entwicklungsprozess und der Technik einen besseren Klang erzeugen als andere. </p> <h3 id=\"dynamic-drivers\"> Dynamische Treiber </h3> <p> <img alt=\"Bose Headphones which use a type of Dynamic Driver\" src=\"images/dynamic-driver-415.jpg\" loading=\"lazy\"> </p> <p> Die gebräuchlichste Art von Kopfhörertreiber ist der <strong> dynamischer Fahrer </strong> . Diese Treiber funktionieren genauso wie oben beschrieben. Wenn die Membran vibriert, verdrängt sie die Luft um sie herum und erzeugt den Klang, den Sie hören. Je mehr Luftverdrängung, desto höher das produzierte Volumen. Diese Luftverdrängung trägt auch zu einer realistischen Basswiedergabe bei. </p> <p> Dynamische Treiber eignen sich hervorragend zur Erzeugung niedriger Frequenzen, die bei höheren Lautstärken zu harmonischen Verzerrungen führen können, die für unsere Ohren nicht sehr gut klingen. Diese Treiber sind jedoch nicht alle schlecht, da sie billig in der Herstellung sind, was zu weniger teuren Kopfhörern für den Verbraucher führt und auch einfacher mit Strom versorgt wird. Nicht alle dynamischen Treiber sind gleich aufgebaut, da ihre Klangqualität je nach Gehäuse und verwendetem Material unterschiedlich sein kann. </p> <h3 id=\"balanced-armature-drivers\"> Balanced Armature Treiber Driver </h3> <p> <img alt=\"Apple wired earbuds, which use a balanced armature driver\" src=\"images/apple-wired-earbuds-which-use-a-balanced-armature-driver-119.jpg\" loading=\"lazy\"> </p> <p> <strong> Balanced Armature Treiber </strong> sind klein und finden sich hauptsächlich in Ohrhörern. Diese Treiber bestehen aus einem Arm in den Spulen mit zwei Magneten auf beiden Seiten. Dadurch kann der Arm zu einem der beiden Magneten schwenken, ausgeglichen werden und die Membran bewegen, um Klang zu erzeugen. Aufgrund der Arbeitsweise des Treibers verdrängt er keine Luft wie der dynamische Treiber, was zu einem Mangel an Bass führt. </p> <p> Bei Balanced Armature-Treibern fehlen auch zusätzliche Belüftungsöffnungen, die zu einer besseren Schallisolierung beitragen. Wie bei jedem Treiber kann die Klangqualität je nach Innen- und Außendesign der Ohrhörer variieren. Einige Hersteller können sogar einen dynamischen Treiber hinzufügen, um einen satteren Klang mit besserer Basswiedergabe zu erzielen. </p> <p> </p> <h3 id=\"planar-magnetic-drivers\"> Planare magnetische Treiber </h3> <p> <img alt=\"Open Back Headphones using Planar Magnetic Drivers\" src=\"images/open-back-headphones-using-planar-magnetic-drivers-408.jpg\" loading=\"lazy\"> </p> <p> <strong> Planare magnetische Treiber </strong> finden sich normalerweise in offenen Kopfhörern und sind normalerweise teurer als dynamische Treiber. Anstatt Schwingspulen zu verwenden, versuchen planare magnetische Treiber, die Membran von den Magneten auf beiden Seiten gleichmäßig zu vibrieren, um einen Klang zu erzeugen. Da diese Treiber entweder größere oder mehrere Magnete verwenden, um die Membran gleichmäßig zu vibrieren, sind diese Kopfhörer in der Regel etwas schwerer. </p> <p> Offene Kopfhörer haben auch mehr Schallverlust als ein normales Paar geschlossener Kopfhörer, die dynamische Treiber verwenden, da die Treiber vollständig offen sind und nichts sie bedeckt. Dies macht sie nicht zur besten Wahl, um in der Öffentlichkeit Musik zu hören; Aus diesem Grund sind sie jedoch fantastisch für den Heimgebrauch. </p> <p> Durch mehr Luftverdrängung tritt mehr Schallverlust auf, wodurch Sie einen volleren Klang mit hervorragender Basswiedergabe erhalten, was sie perfekt für den Heimgebrauch macht. </p> <h3 id=\"electrostatic-drivers\"> Elektrostatische Treiber </h3> <p> <img alt=\"Open Back Headphones That Require an Amplifier\" src=\"images/open-back-headphones-that-require-an-amplifier-271.jpg\" loading=\"lazy\"> </p> <p> <strong> Elektrostatisch </strong><strong> Fahrer </strong> sind aufgrund ihres hohen Preises und ihrer Nischennutzung eher selten und finden sich hauptsächlich in offenen Kopfhörern. </p> <p> Diese Treiber verwenden statische Elektrizität, um Ton zu erzeugen. Die Membran wird zwischen zwei entgegengesetzt geladenen leitfähigen Platten hin und her gezogen, wodurch sich die elektrischen Signale kontinuierlich ändern und einen verzerrungsfreien Klang erzeugen. Ähnlich wie bei planaren Magnettreibern ermöglicht dieses Design auch eine größere Luftverdrängung, wodurch der Hörer einen besser klingenden Bass erhält. </p> <p> Aufgrund der Funktionsweise elektrostatischer Treiber benötigen sie Hochspannungssignale, sodass Sie sie mit einem Verstärker verwenden müssen. Diese Signale sind in den meisten Kopfhörerbuchsen für Verbraucher und sogar in einigen professionellen Verstärkern unerreichbar. Um Kopfhörer mit elektrostatischen Treibern zu verwenden, benötigen Sie einen elektrostatischen Verstärker, der sehr teuer ist. </p> <p> </p> <p> Obwohl elektrostatische Treiber Ihnen eine hervorragende Klangbühne mit geringen Verzerrungen bieten, ist es besser, ein anderes Paar offener Kopfhörer mit planaren magnetischen Treibern zu verwenden. Diese bieten Ihnen ein ähnliches Hörerlebnis wie elektrostatische Treiber, kosten jedoch weniger und sind einfacher zu handhaben. </p> <p> </p> <h2 id=\"which-headphone-driver-should-you-get\"> Welchen Kopfhörertreiber sollten Sie kaufen? </h2> <p> <img alt=\"Razer Gaming Headphones\" src=\"images/razer-gaming-headphones-992.jpg\" loading=\"lazy\"> </p> <p> Kopfhörer sind für viele verschiedene Arten von Menschen gebaut. Wenn Sie ein Musiker sind, der zum Mischen von Audio nur zu Hause Kopfhörer verwendet, sollten Sie vielleicht einen offenen Kopfhörer mit einem planaren magnetischen Treiber verwenden. </p> <p> Wenn Sie ein Läufer sind, ist die Anschaffung eines großen Kopfhörers mit offener Rückseite möglicherweise nicht die beste Wahl für Sie. Hier sind Ohrhörer mit kleinen, aber gut klingenden Balanced-Armature-Treibern praktisch. Es gibt ein Paar brillant klingender Kopfhörer, die nur für Sie entwickelt wurden. Jetzt ist es an der Zeit, sie zu finden. </p>"}