{"title":"Wie die besten Instant Messaging-Dienste End-to-End-Verschlüsselung verwenden","content":"<p> Persönliche Daten sind wichtiger denn je. Regierungen, Unternehmen und Cyberkriminelle sehnen sich nach den personenbezogenen Daten von Menschen, um ihren Interessen zu dienen. Verschiedene Online-Plattformen haben es leicht gemacht, dass personenbezogene Daten ohne unser Wissen weitergegeben werden. </p> <p> Aus diesem Grund ist es wichtig zu wissen, wie die Plattformen, die Sie online nutzen, Ihre Privatsphäre schützen. Einer der wichtigsten Faktoren, auf die Sie bei der Betrachtung der Schutzmaßnahmen von Messaging-Anwendungen achten sollten, ist die Ende-zu-Ende-Verschlüsselung. </p> <p> In Anbetracht der Notwendigkeit, dem Datenschutz Priorität einzuräumen, haben immer mehr Messaging-Anwendungen bedeutende Schritte unternommen, um eine Ende-zu-Ende-Verschlüsselung zu implementieren. </p> <h2 id=\"what-is-end-to-end-encryption\"> Was ist Ende-zu-Ende-Verschlüsselung? </h2> <p> </p> <p> Ende-zu-Ende-Verschlüsselung ist <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> eine Methode zur Verschlüsselung der Kommunikation </a> damit Dritte nicht auf Informationen zugreifen können, die zwischen Personen ausgetauscht werden, die sich gegenseitig Nachrichten senden. </p> <p> Bei der Ende-zu-Ende-Verschlüsselung wird ein geheimer Code anstelle von Klartext verwendet, um den Inhalt der Nachrichten zu verbergen. Das bedeutet, dass nur diejenigen, die auf einer Ende-zu-Ende-verschlüsselten Plattform kommunizieren, die untereinander gesendeten Nachrichten lesen können. </p> <p> Schauen wir uns an, wie drei beliebte sichere Messaging-Dienste, Signal, WhatsApp und Telegram, eine Ende-zu-Ende-Verschlüsselung verwenden. </p> <p> </p> <h2 id=\"signal\"> Signal </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signal gilt als eine der sichersten Messaging-Anwendungen. Die gesamte Kommunikation auf der Plattform ist standardmäßig Ende-zu-Ende verschlüsselt. </p> <p> Signal sichert keine Nachrichten in der Cloud, wodurch das Risiko von böswilligen Akteuren verringert wird, die alternative Methoden zur Informationsbeschaffung verwenden. Es verschlüsselt auch die Metadaten von Nachrichten, sodass Ort und Zeitpunkt von Nachrichtenaktivitäten nicht verfolgt werden. </p> <p> Mit einer Open-Source-Verschlüsselungs-Engine profitiert die Öffentlichkeit von einer höheren Transparenz der Technologie hinter ihren Messaging-Aktivitäten. Benutzer können sich die technischen Details genauer ansehen, um die Methoden zum Schutz ihrer Privatsphäre besser zu verstehen. </p> <p> Open-Source-Plattformen können Software auf lange Sicht viel einfacher und sicherer machen. Die Benutzer können nicht nur besser verstehen, wie die Software funktioniert, sondern sie können auch versuchen, ihre eigene Version der Anwendung einzurichten, die für ihre individuellen Sicherheitsanforderungen besser geeignet ist. </p> <p> Signal verwendet eine Kombination von OTR, die als Multi-Party Off-the-Record Messaging bezeichnet wird und es ermöglicht, Nachrichten in Gruppenchats durchgängig zu verschlüsseln. Die Risiken von Datenschutzverletzungen können mit steigender Teilnehmerzahl in einem Netzwerk steigen. Mit einem Ende-zu-Ende verschlüsselten Gruppenchat werden solche Risiken deutlich reduziert. </p> <p> </p> <h2 id=\"whatsapp\"> WhatsApp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp war eine der ersten beliebten Messaging-Anwendungen, die eine Ende-zu-Ende-Verschlüsselung ermöglichte. Es verwendet eine Ende-zu-Ende-Verschlüsselung für Nachrichten und Anrufe. </p> <p> WhatsApp verwendet das von Open Whisper Systems, dem Team hinter Signal Messenger, entwickelte Ende-zu-Ende-Verschlüsselungsprotokoll. Dies ist ein großes Plus für die Anwendung, wenn man bedenkt, wie sicher das Verschlüsselungsprotokoll von Signal ist. </p> <p> </p> <p> WhatsApps eigene proprietäre Bereitstellung bedeutet, dass es möglicherweise nicht so häufig von einer Vielzahl von Sicherheitsforschern untersucht wird wie die vollständig Open-Source-Software von Signal. </p> <p> Trotz der Verschlüsselung von Nachrichten könnten andere Wege genutzt werden, um mehr über den Versand von Nachrichten auf WhatsApp zu erfahren, da Nachrichten in der Cloud gesichert werden können und Metadaten in der App nicht verschlüsselt sind. Dies macht es einfacher, die Zeit und den Ort von Nachrichten zu kennen. Darüber hinaus tauchten Berichte über WhatsApp-Gruppenchats auf, die in der Google-Suche indiziert wurden, die die Sicherheit ihrer Gruppenchats in Frage stellten. </p> <p> </p> <h2 id=\"telegram\"> Telegramm </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegram wird für seine Verschlüsselung und seine selbstzerstörenden Nachrichten geliebt. Leider gibt es bei Telegram mehrere Probleme mit der End-to-End-Verschlüsselung, die vielen Benutzern möglicherweise nicht so offensichtlich erscheinen. </p> <p> Bei Telegram ist die Ende-zu-Ende-Verschlüsselung standardmäßig nicht aktiviert. Es wird nur angeboten, wenn Benutzer zu geheimen Chats wechseln. Für technisch nicht versierte Benutzer birgt dies Sicherheitsrisiken, die ihnen möglicherweise nicht einmal bewusst sind. </p> <p> Telegram kann auf Nachrichten zugreifen, die auf seinen Servern gespeichert sind, die in seiner Cloud gesichert sind. Einige glauben, dass dies zusätzliche Angriffsvektoren darstellt, die zu Verletzungen personenbezogener Daten führen könnten, wenn Cyberkriminelle versuchen, Messaging-Daten aus der Anwendung zu stehlen. </p> <p> Davon abgesehen sind alle geheimen Chats in Telegram gerätespezifisch, was bedeutet, dass auf Nachrichten, die Sie über geheime Chats senden, nur von dem Gerät aus zugegriffen werden kann, von dem sie gesendet wurden. </p> <p> Während die geheimen Chats von Telegram Ende-zu-Ende-verschlüsselt sind, sind Gruppenchats dies nicht. Dies bedeutet, dass Benutzer möglicherweise mehrere Geräte für denselben Gruppenchat verwenden können. Die Chat-Protokolle können von den Benutzern auf mehrere Geräte heruntergeladen werden. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Geheime Chats an <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #Telegramm </a> bedeutet, dass Ihre Nachrichten durch eine Ende-zu-Ende-Verschlüsselung geschützt sind und nach einer bestimmten Zeit gelöscht werden. <br><br> So aktivieren Sie diese Funktion. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> – Kaspersky (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 31. Januar 2021 </a></blockquote>  <p> Telegram erstellt Link-Vorschauen auf seinen Remote-Servern sowohl aus normalen als auch aus geheimen Chats. Wenn ein Benutzer zum ersten Mal einen Link in einem geheimen Chat eingibt, warnt ihn die Anwendung, dass Links an entfernte Server gesendet werden. Dies wird als Sicherheitsschwäche angesehen, da das Senden von in einem privaten Chat geteilten Links an einen Remote-Server dem Zweck der End-to-End-Verschlüsselung zuwiderläuft. </p> <p> Das Verschlüsselungsprotokoll von Telegram, MTProto, ist für den Zugriff auf eine Server-API von Anwendungen auf Mobilgeräten ausgelegt. Es ist proprietär und nur teilweise Open Source. Dies stellt in Frage, wie viel Kontrolle und Verständnis die Öffentlichkeit über die Verschlüsselungsmethoden hat, die zum Schutz ihrer Nachrichten verwendet werden. </p> <p> Glücklicherweise wurde die Messaging-Anwendung nicht ernsthaft wegen Datenschutzverletzungen angeklagt, aber es ist besorgniserregend zu wissen, dass es ihren Betreibern möglich ist, auf Ihre Nachrichten zuzugreifen. </p> <p> Trotz der Bedenken können viele durch die verschiedenen rechtlichen Hürden beruhigt sein, die übersprungen werden müssten, um auf Nachrichten zuzugreifen. Telegram hat in der Vergangenheit deutlich gemacht, wie schwierig es für Menschen ist, auf Nachrichten auf seiner Plattform zuzugreifen. Auf Schlüssel müsste von verschiedenen Gerichtsbarkeiten zugegriffen werden, was viele Leute frustrieren würde. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> Auswahl der sichersten Messaging-Anwendung </h2> <p> Obwohl Signal vielleicht nicht so beliebt ist wie WhatsApp, hat sein Protokoll mit der Ende-zu-Ende-Verschlüsselung wesentlich zum Erfolg von WhatsApp beigetragen. Obwohl die Methoden der Ende-zu-Ende-Verschlüsselung denen von WhatsApp ähneln, gilt es für die Ende-zu-Ende-Verschlüsselung als besser als WhatsApp. Es zeichnet sich dadurch aus, dass es zusätzliche Schritte zum Schutz der Benutzer unternimmt. </p> <p> Die Entscheidung von Telegram, der Ende-zu-Ende-Verschlüsselung keine Priorität zu geben, wurde auf seine Präferenz für Bequemlichkeit zurückgeführt. Wo es an Verschlüsselung fehlt, macht es das mit seinen indirekten Methoden zum Schutz von Benutzern mit Cloud-Verschlüsselung und Speicherung von Schlüsseln in verschiedenen Rechtsordnungen wett. </p>"}