{"title":"Was ist der Unterschied zwischen LAN und WAN im Netzwerk?","content":"<p> Wenn Sie sich mit Computernetzwerken beschäftigt haben, sind Sie wahrscheinlich auf die Begriffe &quot;LAN&quot; und &quot;WAN&quot; gestoßen. Was bedeutet jedoch jede einzelne und was sind die Unterschiede, wenn Sie ein LAN vs. </p> <p> Lassen Sie uns diese beiden Technologien untersuchen und wo jede einzelne glänzt. </p> <h2 id=\"what-does-lan-stand-for\"> Wofür steht &quot;LAN&quot;? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> Bildquelle: Medikament Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Ein LAN ist ein &quot;Local Area Network&quot;. Dieser Begriff beschreibt ein Netzwerk, in dem alle verbundenen Geräte nahe beieinander liegen. Sie befinden sich alle in einem &quot;lokalen Gebiet&quot;, daher der Name. </p> <p> Wenn ein Computer eine Verbindung zu einem LAN herstellt, erhält er eine lokale Internetprotokoll-(IP-)Adresse. Dies funktioniert ähnlich wie die IP-Adresse, die Sie erhalten, wenn Sie online gehen. Eine lokale IP-Adresse funktioniert jedoch nur für andere Computer im selben LAN wie Sie. Sie können beispielsweise keine lokale IP verwenden, um sich über das Internet mit Ihrem PC zu verbinden. </p> <p> Die physische Grenze Ihres Heim-LANs wird Ihr Haus wahrscheinlich nicht verlassen. Wenn Sie Ihr Telefon oder Laptop mit in den Garten nehmen, um frische Luft zu schnappen, ist es natürlich immer noch im LAN. In den meisten Fällen befinden sich jedoch alle Ihre mit dem Netzwerk verbundenen Geräte sicher in den vier Wänden Ihres Hauses. </p> <p> Auch Firmen und Institute stellen LANs her. Beispielsweise kann eine Universität alle PCs ihrer Bibliothek mit einem Netzwerk verbinden, damit alle miteinander kommunizieren können. Unternehmen nutzen LANs auch gerne, weil es Mitarbeitern ermöglicht, Dateien und Korrespondenz aneinander zu senden, ohne online gehen zu müssen. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> Wofür steht „WAN“? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Bildnachweis: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Auf der anderen Seite haben wir das Wide Area Network oder WAN. Wenn Sie diesen Artikel lesen, sind Sie bereits mit einem WAN verbunden – wir nennen es gerne das Internet. </p> <p> Das &quot;Breite&quot; im Wide Area Network ist sehr variabel. Wenn Sie sich mit einem externen Server in derselben Stadt wie Sie verbinden, ist das ein WAN. Es gilt auch als WAN, wenn Sie sich mit einem Server in einem Land auf der anderen Seite des Planeten verbinden. </p> <p> Daher wird ein WAN normalerweise verwendet, um jedes Netzwerk zu beschreiben, mit dem Sie eine Verbindung herstellen und das hinter Ihrem Router existiert. Es spielt keine Rolle, ob der Server eine Meile oder einen Kontinent entfernt ist; es ist immer noch &quot;breit&quot;. </p> <p> Das Internet ist nicht das einzige WAN da draußen. Unternehmen nutzen WANs gut, um Büros in verschiedenen Ländern zu verbinden. Wenn ein Unternehmen beispielsweise ein Büro in New York, Tokio und Sydney hat, kann es ein eigenes WAN-System mieten, um miteinander zu kommunizieren. </p> <p> Aber warte eine Minute; Warum bauen Unternehmen ihr eigenes WAN, wenn sie einfach alles mit dem Internet verbinden können? Das Problem bei dieser Lösung ist, dass das Unternehmen ISP-Gebühren zahlen muss und wenn etwas schief geht, müssen sie mit dem ISP ringen, um das Problem zu beheben. </p> <p> Darüber hinaus ist das Internet darauf ausgelegt, sich mit vielen PCs auf der ganzen Welt zu verbinden. Wenn ein Unternehmen seine PCs nur mit anderen Büro-PCs verbinden möchte, kann es sich über ein eigenes WAN vor Online-Bedrohungen schützen. Dies wird als &quot;Intranet&quot; bezeichnet. </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> Wann sollte man ein LAN oder ein WAN verwenden? </h2> <p> Wenn Sie eine Verbindung zu einem anderen Gerät herstellen möchten, das Sie besitzen, können Sie dies über LAN oder WAN tun. Aber was sind die Vor- und Nachteile der einzelnen und welche sollten Sie verwenden? </p> <p> Angenommen, Sie haben eine neue drahtlose Festplatte, die mit Ihrem Router verbunden wird, und Sie haben die Wahl, Verbindungen aus dem Internet (ein WAN) zuzulassen oder nur lokal (LAN) zu halten. Welche Sie wählen, hängt davon ab, was Sie von der Festplatte erwarten. </p> <p> Die Bereitstellung von WAN-Funktionen für die Festplatte ist aus Gründen der Bequemlichkeit fantastisch. Dadurch wird es ins Internet gestellt, sodass Sie von überall auf der Welt darauf zugreifen können. Als solche werden Sie nie wieder ohne Ihre Dateien stecken bleiben; Sie werden nur eine Internetverbindung entfernt sein. </p> <p> WAN-Verbindungen ermöglichen jedoch auch anderen Personen den Zugriff auf Ihre Geräte. Wenn die Sicherheit Ihrer Festplatte nicht auf dem neuesten Stand ist, können Hacker den gleichen Weg wie Sie verwenden, um alle Ihre Daten anzuzeigen und wichtige Dinge zu kopieren oder zu löschen. </p> <p> Das Versetzen der Festplatte in den Nur-LAN-Modus hingegen schützt sie vor einigen Möglichkeiten, die ein Hacker einschlagen kann. Es ist nicht undurchdringlich. Zum Beispiel könnte jemand Ihren PC verwenden, um auf die Festplatte zuzugreifen. Es ist jedoch viel sicherer, als die Festplatte Tag und Nacht über das WAN zu übertragen. </p> <p> Wenn Sie die Sicherheit wirklich, wirklich erhöhen möchten, können Sie die Festplatte mit einem Luftspalt versehen. Air-Gapping bedeutet, dass er und jeder PC im selben Netzwerk nicht mit einem WAN verbunden sind – wie zum Beispiel mit dem Internet. </p> <p> Ein <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> Air-Gap-Computer ist nicht vollständig vor Online-Bedrohungen geschützt </a> , aber es verringert drastisch die Wahrscheinlichkeit eines Angriffs. Hacker müssen Menschen manipulieren, damit sie ihren Wünschen nachkommen, um ein Gerät mit Luftspalt anzugreifen, und verwenden dabei Social-Engineering-Taktiken, um ihren Willen durchzusetzen. </p> <p> Wenn Sie sich also entscheiden, ein Gerät ins Internet zu stellen oder es in Ihrem Heim-LAN zu sperren, müssen Sie überlegen, ob Sie tatsächlich eine Verbindung über das Internet herstellen. Wenn Sie das nicht glauben, deaktivieren Sie am besten die WAN-Funktionen und halten Sie Hacker in Schach. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> Verwandelt die Verbindung mit dem Internet ein LAN in ein WAN? </h2> <p> Angenommen, Sie haben ein LAN eingerichtet, in dem alle Ihre Geräte mit einem Router verbunden sind. Ihnen ist langweilig, also setzen Sie sich an Ihren Computer und gehen zu Netflix. Jetzt ist Ihr PC mit einem WAN verbunden: dem Internet. </p> <p> Da Ihr PC jedoch mit einem WAN verbunden ist, bedeutet dies, dass er nicht mehr Teil eines LANs ist? Glücklicherweise kann ein Gerät gleichzeitig Teil eines LAN und eines WAN sein. </p> <p> Erinnern Sie sich, wie wir gesagt haben, dass LAN-Geräte ihre eigene lokale IP-Adresse haben? Dies bedeutet nicht, dass es auch keine Internet-IP-Adresse erhalten kann. Wenn Sie diesen Artikel auf einem Gerät lesen, das mit einem Router verbunden ist, hat es sogar beides! </p> <p> Wenn Sie es selbst überprüfen möchten, haben wir es abgedeckt <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> So überprüfen Sie Ihre IP-Adresse unter Windows </a> . Wenn du mobil bist, kannst du es trotzdem <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Finden Sie Ihre IP-Adressen auf Android oder iPhone </a> . </p> <p> Sobald Sie die Statistiken haben, sollten Sie zwei IP-Adressen sehen. Der erste beginnt mit „192.168“ – das ist Ihre lokale IP-Adresse. Sie verwenden diesen, wenn Sie sich von einem anderen im selben Netzwerk mit Ihrem aktuellen Gerät verbinden möchten. </p> <p> Der zweite sieht auf zwei Arten aus, je nachdem, ob Sie IPv4 oder IPv6 verwenden. Wenn Sie v4 verwenden, sollte es wie Ihre lokale IP-Adresse aussehen, aber es beginnt nicht mit &quot;192.168&quot;. Wenn es IPv6 ist, sollte es ein Durcheinander von Buchstaben und Zahlen sein, die durch Doppelpunkte in acht Blöcke aufgeteilt werden. </p> <p> In jedem Fall ist diese Adresse Ihre Internet-IP-Adresse. Das wird verwendet, wenn Sie sich mit einem anderen Server im Internet verbinden, damit er mit Ihnen kommunizieren kann. zum Beispiel, um Ihnen die Fernsehsendung zu senden, die Sie auf Netflix ansehen. </p> <p> In gewisser Weise kann man sich das Internet als ein riesiges Netzwerk von LANs vorstellen. Wenn Sie Netflix ansehen, erhält Ihr PC (in Ihrem persönlichen LAN) Daten von den Netflix-Servern (die sich in seinem eigenen LAN befinden). Jedes LAN ist wie ein Haus in einer Stadt, während die Internetverbindung wie die Straßen und Straßen ist, die sie alle miteinander verbinden. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> Die Verwechslung von LAN vs. WAN beseitigen </h2> <p> LANs und WANs arbeiten oft zusammen, aber sie funktionieren auf unterschiedliche Weise. Jetzt kennen Sie den Unterschied zwischen den beiden und wissen, wann Sie sie verwenden. </p> <p> Wussten Sie, dass Sie ein LAN-Spiel einrichten können, damit Personen im selben Netzwerk miteinander spielen können? Es ist eine großartige Möglichkeit, Zeit mit Freunden zu verbringen, ohne die Latenzprobleme, die Internet-Spiele manchmal haben. </p> <p> <small> Bildnachweis: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}