{"title":"Was ist Unix-Zeit und wann war die Unix-Epoche?","content":"<p> Warum hat Unix ein eigenes Zeitkonzept? Was ist die Epoche und was ist das Y2038-Problem? </p> <p> Unix-Zeit ist ein Mittel zur Darstellung eines bestimmten Datums und einer bestimmten Uhrzeit, das von Linux, macOS und vielen anderen interoperablen Systemen verwendet wird. Es ist so weit verbreitet, dass Sie es wahrscheinlich verwenden, ohne sich dessen bewusst zu sein. Sobald Sie jedoch die Unix-Zeit verstanden haben, werden Sie sie in vielen Kontexten entdecken. Mehrere Tools können Ihnen helfen, mit der Unix-Zeit zu arbeiten. </p> <h2 id=\"what-is-the-purpose-of-unix-time\"> Was ist der Zweck von Unix-Zeit? </h2> <p> Die Unix-Zeit ist eine Anzahl der Gesamtsekunden seit einer festen Uhrzeit und einem festen Datum. Es handelt sich um ein Datums-/Uhrzeit- (oder Zeitstempel-) Format, das sich von den menschenlesbaren Daten und Uhrzeiten unterscheidet, an die wir gewöhnt sind. Das ist rein aus Effizienzgründen. Es nimmt viel weniger Platz in Anspruch, eine einzelne Zahl, die Sekunden darstellt, zu speichern, als separate Werte für Jahr, Monat, Stunde usw. </p> <p> Aus heutiger Sicht ist der Raumunterschied natürlich gar nicht so groß. Bedenken Sie jedoch, dass Unix in den späten 1960er Jahren entstand, als der verfügbare Speicherplatz viel kleiner war. Zeitstempel werden auch häufig verwendet, sodass sich ihr Speicher summiert. Jeder Datei sind beispielsweise drei Zeitstempel zugeordnet. </p> <p> Das Format ist so gut wie unmöglich in Ihrem Kopf zu übersetzen, es sei denn, Sie sind ein mathematisches Genie. Aber es hat immer noch einige Vorteile gegenüber besser lesbaren Alternativen wie <strong> Mi, 21 Okt 2015 07:28:00 GMT </strong> . Auf einen Blick können Sie ganz einfach zwei Unix-Zeitstempel bestellen. Es ist normalerweise auch schneller, den Unterschied zwischen zwei Zeitstempeln zu berechnen. Dies gilt insbesondere für Termine, die nahe beieinander liegen, beispielsweise an benachbarten Tagen. </p> <p> <img alt=\"A screenshot from the Epoch Converter site showing Unix Time\" src=\"images/epoch-converter-110.png\" loading=\"lazy\"> </p> <h3 id=\"about-the-epoch\"> Über die Epoche </h3> <p> Die Unix-Zeit ist also eine Gesamtanzahl von Sekunden seit einem bestimmten Zeitpunkt. Aber was ist das für ein Zeitpunkt? Es ist <strong> 00:00:00 UTC </strong> auf <strong> 1. Januar 1970 </strong> . Dies wird oft als die Unix-Epoche bezeichnet. Programmierer wählten dieses Datum aus Bequemlichkeit für die Epoche, da es das nächstgelegene runde Datum war, als sie die Unix-Zeit erfanden. </p> <p> Vielleicht haben Sie dieses Datum gesehen, wenn etwas schief gelaufen ist. Es ist eindeutig ein Fehler, aber einer, der sehr seltsam aussieht, wenn er ein Datum vor der Geburt vieler von uns ergibt! Es ist jedoch völlig verständlich, wenn Sie die Unix-Zeit kennen. Wenn ein System versucht, einen Zeitstempel anzuzeigen, der keinen Wert hat, wird er oft in 0 übersetzt und führt zu dem genauen Epochesdatum. </p> <p> </p> <h2 id=\"the-unix-time-data-format\"> Das Unix-Zeitdatenformat </h2> <p> Genau genommen gibt es keinen. Der ursprüngliche Datentyp war ein 32-Bit-Integer, und dies bleibt auch in viel leistungsfähigeren Systemen oft der Fall. </p> <p> Mit diesem Datentyp kann der Wert insgesamt 2^32 Sekunden speichern, was etwas mehr als 136 Jahren entspricht. Dieser Wert ist normalerweise vorzeichenbehaftet, was bedeutet, dass er negativ oder positiv sein kann. Es repräsentiert also normalerweise 68 Jahre auf beiden Seiten der Epoche, d. </p> <p> Dies ist natürlich noch eine begrenzte Zeit. Das Zeitstempelformat wurde jedoch hauptsächlich für Konzepte wie die Dateiänderung verwendet. Die Notwendigkeit bestand sehr darin, die Zeit nahe der Gegenwart darzustellen und nicht die alte Geschichte oder weit in die Zukunft. Selbst bei Anwendungen wie Kalendern besteht selten die Notwendigkeit, Daten über mehrere Jahrzehnte in der Zukunft darzustellen. </p> <p> Das heißt aber nicht, dass diese begrenzte Zeitspanne ohne Probleme ist… </p> <h3 id=\"the-year-2038-problem\"> Das Jahr 2038-Problem </h3> <p> Der Y2K-Bug ( <a href=\"https://www.makeuseof.com/tag/worst-programming-mistakes-in-history/\" target=\"_blank\" rel=\"nofollow noopener\"> einer der schlimmsten Programmierfehler der Geschichte </a> ) betroffene Computersysteme, die Jahre als zweistellige Werte speicherten. Als das Jahr 2000 kam, behandelten solche Systeme es wie 1900. Die Katastrophe war allerdings nicht so katastrophal wie befürchtet, vor allem, weil viele Leute im Vorfeld viel Zeit und Mühe aufgewendet haben, um sich darauf vorzubereiten. </p> <p> Wenn Sie im vorherigen Abschnitt aufgepasst haben, haben Sie möglicherweise ein ähnliches Problem entdeckt, das die Unix-Zeit beeinträchtigen könnte. Nun, die Unix-Zeit hat ihr eigenes Datenproblem: das Y2k38-Problem. (Es wird oft als Problem bezeichnet, nicht als Fehler; vielleicht sind wir seit dem Jahr 2000 optimistischer geworden!) Wenn die Unix-Zeit im Jahr 2038 buchstäblich abläuft, werden die Systeme neue Daten entweder als 1902 oder 1970 behandeln. werde einfach ganz scheitern. </p> <p> Zumindest wird uns dieses Problem nicht um Mitternacht an Silvester treffen. Die letzte Sekunde der 32-Bit-Unix-Zeit wird auf den 19. März fallen. Eventuell werden wir die meisten Systeme bis 2038 aufrüsten oder sie sind bis dahin sowieso veraltet. </p> <p> </p> <h2 id=\"some-useful-timestamp-resources\"> Einige nützliche Zeitstempel-Ressourcen </h2> <p> Das <a href=\"https://www.epochconverter.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Epochenkonverter </a> site ist möglicherweise der umfassendste Zeitstempelkonverter, der verfügbar ist. Es beginnt mit der Anzeige der aktuellen Unix-Zeit – in Echtzeit – und fügt darüber hinaus fast alle erdenklichen Funktionen hinzu. Seine Hauptverwendung ist die Konvertierung zwischen Zeitstempeln und menschenlesbaren Daten in beide Richtungen. </p> <p> Dan’s Tools ist eine riesige Sammlung nützlicher Web-Apps, darunter a <a href=\"https://www.unixtimestamp.com/index.php\" target=\"_blank\" rel=\"nofollow noopener\"> Zeitstempelkonverter </a> . Es ist einfacher, hat aber eine sehr saubere Präsentation und ist einfach zu bedienen. </p> <p> <a href=\"https://time.is/Unix_time_now\" target=\"_blank\" rel=\"nofollow noopener\"> Zeit ist </a> präsentiert einen weiteren, noch minimalistischeren Look. Es zeigt die Zeit in einer Reihe von Formaten an, einschließlich der Unix-Zeit. Es enthält die aktuelle Uhrzeit im Seitentitel, was nützlich ist. </p> <p> <img alt=\"A screenshot of the Time.is websites showing Unix Time\" src=\"images/time-is-177.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"using-unix-time-with-command-line-tools\"> Verwenden von Unix-Zeit mit Befehlszeilentools </h2> <p> Unter Linux und macOS ist die <strong> Datum </strong> Programm ist das zentrale Dienstprogramm für den Umgang mit Datum/Uhrzeit, einschließlich Unix-Zeitstempeln. Ohne Argumente aufgerufen, gibt es das aktuelle Datum/die aktuelle Uhrzeit in einem für Menschen lesbaren Format zurück: </p> <pre><code class=\"hljs ruby\">$ date<br>Wed Feb 10 12:28:30 GMT 2021</code></pre> <p> Wenn Sie das aktuelle Datum/die aktuelle Uhrzeit in Unix-Zeit benötigen, verwenden Sie die <strong> +%s </strong> Streit: </p> <pre><code class=\"hljs ruby\">$ date +%s<br>1612960114</code></pre> <p> Sie können von einem menschenlesbaren Datum in einen Zeitstempel umwandeln, indem Sie die <strong> -d </strong> markieren, wenn Ihre Version von <strong> Datum </strong> unterstützt es. Die meisten Linux-Versionen sollten standardmäßig: </p> <pre><code class=\"hljs ruby\">$ date -d \"Jan 2 1970\" +%s<br>82800</code></pre> <p> Unter macOS, <strong> Datum </strong> ist ein anderes Programm, das einen anderen Satz von Flags erfordert: </p> <pre><code class=\"hljs perl\">$ date -j -f \"%b %d %Y %T\" \"Jan 02 1970 00:00:00\" \"+%s\"<br>82800</code></pre> <p> In die andere Richtung können Sie einen Unix-Zeitstempel mit der <strong> -r </strong> Flagge: </p> <pre><code class=\"hljs ruby\">$ date -r 1600000000<br>Sun 13 Sep 2020 13:26:40 BST</code></pre> <p> Einige andere Programme verwenden die <strong> %s </strong> Format, um mit der Unix-Zeit umzugehen. Wenn Sie beispielsweise das Änderungsdatum einer Datei in Unix-Zeit anzeigen möchten, mit dem <a href=\"https://www.makeuseof.com/ls-command-linux/\" target=\"_blank\" rel=\"nofollow noopener\"> Linux-Version von <strong> ls </strong></a> , können Sie Folgendes verwenden: </p> <pre><code class=\"hljs perl\">$ ls -l --time-style=+%s index.tmp.html<br>-rw-r--r-- 1 ubuntu ubuntu 17862 1521649818 index.tmp.html</code></pre> <p> </p> <h2 id=\"how-to-use-unix-time-in-programming-languages\"> Wie man Unix-Zeit in Programmiersprachen verwendet </h2> <p> PHP hat die <strong> Zeit() </strong> Funktion, die den aktuellen Unix-Zeitstempel zurückgibt. Es ist <strong> Datum() </strong> Die Funktion verwendet einen Zeitstempel als zweites Argument: </p> <pre><code class=\"hljs ruby\">$ php -r 'echo date(\"Y-m-d\", time());'<br>2021-02-11</code></pre> <p> JavaScript nähert sich den Dingen auf interessante Weise. Es hat ein <strong> Datum.jetzt() </strong> -Methode, um die Anzahl der Millisekunden seit der Unix-Epoche zu erhalten. Natürlich können Sie dies durch 1.000 teilen und das Ergebnis runden, um die äquivalente Unix-Zeit in Sekunden zu erhalten: </p> <pre><code class=\"hljs perl\">> Math.floor(Date.now() / 1000)<br>1613083012</code></pre> <p> </p> <h2 id=\"understanding-unix-time\"> Unix-Zeit verstehen </h2> <p> Unix-Zeit ist ein einfaches Konzept, das an vielen Stellen auftaucht. Wenn Sie es einmal verstanden haben, können Sie es zum Beispiel bei der Berechnung von Zeitunterschieden sehr nützlich finden. Sie können auch erkennen, wann dies die Ursache für bestimmte Fehler sein kann. </p> <p> Konzepte wie die Epoche und Zeitstempel sind ein wichtiger Bestandteil der ersten Schritte mit Linux. Um mehr über Essentials zu erfahren, wie zum Beispiel <strong> ls </strong> , lesen Sie unseren Leitfaden zu den grundlegenden Linux-Befehlen. </p>"}