{"title":"5 cosas que pueden hacer que te expulsen permanentemente de Facebook","content":"<p> Facebook no es tan conocido como Twitter por eliminar cuentas. Sin embargo, hay algunos delitos prohibibles a los que Facebook responde con algo más que una etiqueta de advertencia. </p> <p> Aquí, exploramos los términos y condiciones de Facebook y dónde la compañía traza la línea, observando ejemplos históricos de usuarios que Facebook &quot;des-plataforma&quot; por su comportamiento. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> La postura de Facebook sobre las prohibiciones permanentes </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> A diferencia de otros sitios de redes sociales, Facebook no enumera muchas ofensas que resultan en una prohibición permanente. En cambio, cita las ofensas repetidas en lugar de la gravedad de las ofensas como factor principal. Como resultado, en teoría, cualquier violación de Facebook repetida con la frecuencia suficiente podría resultar en un bloqueo de perfil. </p> <p> Sin embargo, pocas actividades resultan en una prohibición total y Facebook es sorprendentemente laxo con algunas actividades ilegales reconocidas. Por ejemplo, la venta de &quot;bienes regulados&quot; como armas y marihuana no está permitida en el Marketplace de Facebook, pero Facebook no lo incluye como un delito prohibible. </p> <p> Facebook prefiere marcar o eliminar contenido publicación por publicación en lugar de eliminar perfiles. Sin embargo, existen excepciones. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Uso indebido de herramientas y datos </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> Los Términos de servicio de Facebook establecen tres delitos prohibidos. La primera es una colección de acciones, que el resto de este artículo analiza con mayor detalle. El segundo y el tercero son más específicos y tienen que ver con el mal uso de las herramientas y los datos de Facebook. </p> <p> Este término de servicio común prohíbe el acceso y el uso de partes del sitio que se supone que están reservadas para los desarrolladores. También prohíbe el uso de herramientas de sitios públicos de una manera deliberadamente maliciosa, como usar Facebook para propagar virus y malware. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Amenazas a la seguridad pública </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Uno de los únicos casos en los que Facebook dice que deshabilita cuentas es el de &quot;riesgo real de daño físico o amenazas directas a la seguridad pública&quot;. Facebook también elimina los perfiles que &quot;proclaman una misión violenta o están involucrados en actos violentos&quot;. </p> <p> Esta fue la razón fundamental para prohibir indefinidamente al entonces presidente Donald Trump después de un motín en el Capitolio de Estados Unidos en enero de 2021. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Asociación con grupos violentos </h2> <p> Facebook adoptó su postura sobre el contenido dañino y amenazante al nivel asociativo en octubre de 2020 cuando eliminó los perfiles asociados con la conspiración QAnon incluso si los perfiles individuales no tenían contenido violento. El grupo de conspiración ha provocado episodios violentos desde 2016. </p> <p> </p> <p> Facebook también prohibió al grupo musical Trapt por publicaciones que hagan referencia al grupo de odio Proud Boys. La organización política extremista ha estado involucrada en la violencia callejera en los Estados Unidos y Canadá desde 2016. </p> <p> La compañía también se reserva el derecho de deshabilitar cuentas si esas cuentas representan un riesgo legal para Facebook. Además, Facebook es más inflexible que otras plataformas de redes sociales en cuanto a trabajar con organizaciones policiales y de divulgación cuando se encuentra con este tipo de contenido. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Comprometer la seguridad de otras cuentas </h2> <p> Otro de los raros delitos prohibidos en las listas de Facebook es &quot;comprometer la seguridad de otras cuentas y nuestros servicios&quot;. Poner en peligro la seguridad de los servicios de Facebook se parece mucho al malware y al mal uso que se mencionan en los términos de servicio. Sin embargo, la idea de comprometer la seguridad de otras cuentas apunta hacia el doxxing. </p> <p> </p> <p> Doxxing es la divulgación de información confidencial del mundo real de un usuario de redes sociales, que puede incluir su dirección de casa o trabajo, número de teléfono privado o ubicación física en tiempo real. Esta práctica a menudo se realiza con la intención de causarle daño a esa persona. </p> <p> </p> <h2 id=\"misinformation\"> 5. Información errónea </h2> <p> </p> <p> Las pautas oficiales de Facebook dicen que Facebook no elimina la información errónea, sino que elige etiquetarla para que pueda contribuir a los diálogos sin engañar a los demás. Sin embargo, varios titulares de cuentas suspendidas dicen que su eliminación se debe a lo que Facebook llama &quot;Noticias falsas&quot;. </p> <p> Hay varias razones por las que esto sucede. En algunos casos, Facebook determina que las noticias falsas también son perjudiciales para la salud personal o pública. </p> <p> Esto era <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> La explicación de Facebook para eliminar al teórico de la conspiración David Icke </a> por afirmar, entre otras cosas, que Internet 5G causa Covid-19. Facebook también dijo que Icke había &quot;violado repetidamente&quot; las políticas. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Políticas de Facebook y su cuenta </h2> <p> En su mayor parte, Facebook no se opone a usted siempre que no haga un mal uso de la plataforma para causar daño a otros. Sin embargo, hay ciertos problemas en los que la empresa traza una línea en la arena. </p> <p> Si no infringe estos términos de servicio, debe mantenerse a salvo de una prohibición permanente de Facebook. </p>"}