{"title":"8 formas en que las redes sociales pueden ayudarlo a aprender un nuevo idioma","content":"<p> ¿Todavía tienes pesadillas con los libros de texto en español y las clases de francés mal enseñadas que recibiste en la escuela? No temáis. Gracias a Internet, aprender un nuevo idioma en estos días puede ser divertido y accesible. </p> <p> Las redes sociales, en particular, han ayudado a conectar a millones de estudiantes de idiomas en todo el mundo. Ya sea que esté aprendiendo algo popular como el alemán o algo más oscuro como las Islas Feroe, encontrará una amplia gama de recursos para ayudarlo en su viaje. </p> <p> Aquí hay algunas formas en que puede usar las redes sociales para aprender su próximo idioma extranjero. </p> <h2 id=\"join-facebook-groups\"> 1. Únete a grupos de Facebook </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> En Facebook, encontrará grupos para casi todos los idiomas imaginables. Encontrará comunidades de expatriados recién trasladados que buscan mejorar sus habilidades, así como grupos para estudiantes de todo el mundo. Para aprovechar al máximo su experiencia, debe unirse a ambos. </p> <p> Para encontrar los grupos de Facebook adecuados, puede hacer una simple búsqueda en línea. Alternativamente, puede encontrar lo que está buscando desde Facebook. Para hacer esto, vaya a Grupos y busque su idioma. A continuación, obtendrá una lista de comunidades que satisfacen estas necesidades. </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> Si estudias en una escuela de idiomas local, también puedes crear tu propio grupo para conectarte con tus compañeros de clase. Para hacer esto, <strong> Vaya a Grupos&gt; Crear nuevo grupo </strong> . Luego puede editar la configuración y comenzar a invitar miembros. </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2.Haz uso de Reddit </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit es un foro en línea popular que es una mina de oro para los estudiantes de idiomas. Encontrará subreddits tanto para idiomas específicos como para el aprendizaje de idiomas en general. </p> <p> Cuando te unes a un subreddit, descubrirás muchos consejos y sugerencias útiles de otros estudiantes que han recorrido tu camino. También encontrarás muchos memes con los que sin duda te relacionarás. </p> <p> Para encontrar un subreddit, vaya a la barra de búsqueda en la parte superior y escriba su idioma. Una vez que se hayan cargado los resultados, vale la pena unirse a grupos de aprendizaje específicos y culturales para aprender más sobre las costumbres locales. </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. Conéctese con hablantes nativos </h2> <p> La mejor manera de aprender un idioma rápidamente es hablando con personas que ya lo hablan. Y las redes sociales pueden ser un gran lugar para encontrar a estos oradores. Es posible que deba comunicarse con algunas personas, pero eventualmente, encontrará a alguien dispuesto a dedicar algo de tiempo para ayudarlo. </p> <p> Cuando se conecte con hablantes nativos en las redes sociales, concéntrese primero en construir una amistad. Si estás en la misma ciudad que ellos, ofrécete a conocerlos y paga por un café. Para aquellos que están más lejos, ofrezca ayudarlos a aprender uno de los idiomas que ya habla. </p> <p> Los pasos para estos son similares en cada plataforma de redes sociales. En Instagram o Twitter, sígalos y envíe un mensaje (si su configuración de privacidad lo permite). Puede adoptar un enfoque similar en Facebook, aunque algunas personas pueden estar menos dispuestas a aceptar solicitudes de amistad de personas que no conocen. </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. Cree su propio contenido de redes sociales </h2> <p> No solo necesitas consumir en las redes sociales para ayudarte a aprender un idioma. Intente crear sus propias publicaciones también. Hacerlo no solo le ayudará a practicar su expresión oral y escrita; también puede descubrir nuevos usuarios con los que practicar. </p> <p> Tienes muchas opciones a la hora de crear contenido. En Twitter, puede unirse a conversaciones o escribir algunos de sus tweets en su idioma de destino. Con Instagram, puede escribir leyendas, crear gráficos y grabarse a sí mismo hablando. </p> <p> Cuando cree su propio contenido de redes sociales, también recibirá comentarios de hablantes nativos. Además de eso, también puede hacer crecer su cartera y aprender algunas habilidades nuevas útiles. </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. Configure sus aplicaciones en el idioma que está aprendiendo </h2> <p> Cambiar la configuración de su teléfono es una manera fácil de empezar a pensar en su idioma de destino y sentirse cómodo leyéndolo. También agregará docenas de palabras nuevas a su vocabulario. </p> <p> </p> <p> Todas las grandes redes sociales tienen configuraciones dentro de la aplicación donde puedes cambiar tu idioma. En Instagram, por ejemplo, vaya a <strong> Cuenta&gt; Idioma </strong> . A continuación, verá un menú desplegable de todos los idiomas que puede utilizar. </p> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (2 imágenes) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> Expandir <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> También puede cambiar todos los idiomas de sus aplicaciones a la vez usando la configuración de su teléfono. Ir <strong> Ajustes </strong> &gt; <strong> General&gt; Idioma y región </strong> . A partir de ahí, verá una lista de todos los idiomas disponibles. Tenga en cuenta que para idiomas más pequeños, es posible que no pueda optimizar su cuenta. </p> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (2 imágenes) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> Expandir <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. Aproveche al máximo los hashtags </h2> <p> El uso y la búsqueda de hashtags es una forma poderosa de encontrar más usuarios en el idioma que está aprendiendo. Al usar una variedad, puede conectarse y consumir el contenido tanto de hablantes nativos como de otros estudiantes. </p> <p> Para encontrar el tipo de contenido que está buscando, piense en lo que usarán otros alumnos. También puede encontrar contenido de hablantes nativos buscando temas existentes en cualquier país. A menudo, puede encontrarlos en publicaciones y artículos de tendencia. </p> <p> Para buscar hashtags, use la función de búsqueda en cualquier aplicación de redes sociales que esté usando. También puede hacer clic en las publicaciones que las usan y encontrar los resultados presentados. </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. Siga las cuentas en su idioma de destino </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> Cada cuenta interesante que sigue en inglés probablemente también tenga un equivalente en su idioma de destino. Pueden ser publicaciones masivas o pueden ser hablantes cotidianos que se sienten más cómodos creando obras en su idioma materno. </p> <p> </p> <p> También debería comprobar si sus revistas, equipos deportivos y artistas musicales favoritos tienen cuentas en su idioma de destino. Muchos de los clubes deportivos más grandes del mundo, por ejemplo, tienen cuentas en inglés, español y más. </p> <p> Al seguir cuentas en el idioma que desea aprender, una buena regla general es seguirlas solo si encuentra que su contenido en inglés es igual de interesante. De lo contrario, terminarás ignorándolos y dejando de seguirlos más tarde. </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. Siga las aplicaciones de aprendizaje de idiomas en las redes sociales </h2> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (2 imágenes) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> Expandir <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> Las aplicaciones de aprendizaje de idiomas a menudo también tienen perfiles activos en las redes sociales. Estos son excelentes para obtener consejos generales y relacionarse con luchas comunes que todos enfrentan, ya sea que estén aprendiendo noruego o japonés. </p> <p> Algunas cuentas que vale la pena seguir son Babbel, Busuu y Duolingo. </p> <p> Sin embargo, no solo necesita usar estas aplicaciones para el consumo. Siéntase libre de agregar sus pensamientos en los comentarios. Incluso podrías hacer nuevos amigos, incluso si están aprendiendo un idioma completamente diferente al tuyo. </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> Haga que aprender un idioma sea divertido con las redes sociales </h2> <p> Así que ahí lo tienes. Ahora tienes una idea más clara del uso de las redes sociales para que tu viaje de aprendizaje de idiomas sea divertido. Si bien el trabajo con libros de texto sigue siendo importante, no debería ser su única opción. </p> <p> Incluso si no puede optimizar la aplicación para su idioma de destino, todavía encontrará muchos hablantes nativos y compañeros de aprendizaje con los que conectarse. </p> <p> La clave para aprender un idioma con las redes sociales es participar y consumir. Cuando lo haga, encontrará su experiencia más satisfactoria y aprenderá palabras que los libros de texto nunca le enseñaron. </p>"}