{"title":"Apple corrige un error del instalador de macOS Big Sur que podría provocar la pérdida de datos","content":"<p> Apple ha corregido un error crítico en el instalador de macOS Big Sur que solía mostrar un mensaje de error al intentar actualizar una Mac sin el espacio de almacenamiento requerido disponible. </p> <p> Una actualización revisada de macOS Big Sur 11.2.1, ahora disponible en la <a href=\"https://apps.apple.com/app/macos-big-sur/id1526878132?mt=12\" target=\"_blank\" rel=\"nofollow noopener\"> Mac App Store </a> , Comprueba correctamente si tiene suficiente espacio libre antes de que comience la instalación, dijo Macintosh en <a href=\"https://twitter.com/ClassicII_MrMac/status/1361428354306633728\" target=\"_blank\" rel=\"nofollow noopener\"> Gorjeo </a> . </p> <p> macOS Big Sur requiere 35 gigabytes de espacio de almacenamiento libre en el disco de inicio de su computadora, excluyendo el instalador de 13 gigabytes en sí. </p> <p> Esto no podría haber ocurrido antes, ya que una de las consecuencias del instalador defectuoso es la posible pérdida de datos. Para las personas que no han desarrollado el hábito de <a href=\"https://www.makeuseof.com/how-to-back-up-mac/\" target=\"_blank\" rel=\"nofollow noopener\"> hacer una copia de seguridad de su Mac con Time Machine </a> , este error bastante básico podría tener consecuencias terribles. </p> <h2 id=\"how-to-install-the-new-update\"> Cómo instalar la nueva actualización </h2> <p> La nueva actualización está disponible a través de <strong> Preferencias del sistema&gt; Actualización de software </strong> en tu Mac. Si hay actualizaciones disponibles, al presionar el botón &quot;Actualizar ahora&quot; se instalarán. Es posible que se le solicite que ingrese su contraseña de administrador. </p> <p> No verá la actualización si la versión revisada de macOS Big Sur 11.2.1 ya está instalada en su computadora. El instalador revisado tiene un número de compilación de &quot;20D75&quot;. Para ver el número de compilación del software macOS Big Sur que está instalado en su Mac, haga clic en el menú Apple y elija la opción etiquetada &quot;Acerca de esta Mac&quot;. </p> <p> </p> <p> Con la ventana Acerca de esta Mac abierta, haga clic en la pestaña &quot;Descripción general&quot;. Verá el nombre del software del sistema operativo macOS en su computadora, seguido de su número de versión. Para revelar también el número de compilación, simplemente haga clic en el número de versión. </p> <p> Puede ver qué versión de macOS es la más reciente en un documento de soporte en <a href=\"https://support.apple.com/HT201260\" target=\"_blank\" rel=\"nofollow noopener\"> Sitio web de Apple </a> . </p> <p> </p> <h2 id=\"big-sur-s-broken-free-space-check\"> Comprobación de espacio libre roto de Big Sur </h2> <p> El problema ha salido a la luz recientemente gracias al Sr. Macintosh, que originalmente informó del problema. La publicación descubrió que la actualización de Big Sur se descargaría sin problemas, pero se negó a comenzar porque &quot;Se produjo un error al preparar la actualización del software&quot;. </p> <p> El problema se atribuyó a un error en la verificación de espacio libre de Big Sur. Macintosh dice que la gente se ha estado quejando de esto desde que salió la primera versión pública de macOS Big Sur en noviembre de 2020. Después de que la publicación alertara a Apple sobre el problema, la compañía se ha movido rápidamente para eliminar el desagradable error. </p> <p> </p> <p> &quot;La actualización comenzará incluso si solo le queda un 1% de espacio libre y fallará&quot;. <a href=\"https://mrmacintosh.com/big-sur-upgrade-not-enough-hd-space-serious-issue-possible-data-loss/\" target=\"_blank\" rel=\"nofollow noopener\"> el cargo </a> explica. Y con la unidad de arranque casi al 100 por ciento llena, el instalador se quedaba atascado en un ciclo de arranque sin fin al intentar finalizar el procedimiento de instalación. </p> <p> &quot;Esto le impide acceder a sus datos&quot;, advirtió el Sr. Macintosh. </p> <p> La única forma de solucionarlo requería borrar y reinstalar el software macOS. Pero con la actualización revisada ahora disponible en la Mac App Store, los propietarios de Mac pueden seguir con su vida diaria sin preocuparse si la actualización a Big Sur podría limpiar su disco de inicio. </p>"}