{"title":"BitPay lleva Bitcoin a Apple Pay","content":"<p> Los usuarios de BitPay en los EE. UU. Ahora pueden agregar sus tarjetas bitcoin prepagas a la aplicación Wallet de Apple y <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> úsalo para pagar cosas con Apple Pay </a> . Los clientes que no sean de Apple pronto podrán agregar sus tarjetas BitPay de la marca MasterCard a Google Pay y Samsung Pay. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> Cómo agregar su tarjeta BitPay a Apple Wallet </h2> <p> Para agregar su tarjeta BitPay a un dispositivo Apple, abra la aplicación Wallet en su iPhone y toque &quot;+&quot; en la esquina superior derecha, luego siga las instrucciones en pantalla para terminar de agregar la tarjeta. </p> <p> Con su BitPay en la aplicación Wallet, puede agregar la tarjeta a Apple Pay yendo a <strong> Configuración&gt; Wallet y Apple Pay </strong> , luego toca la opción etiquetada &quot;Agregar tarjeta&quot;. Para convertirse en usuario de BitPay y solicitar su tarjeta prepaga, descargue la aplicación BitPay Wallet desde el <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> Tienda de aplicaciones </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Una nueva forma de gastar con Apple Pay </h2> <p> Una publicación sobre el <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog de BitPay </a> dice que agregar una tarjeta BitPay a Apple Pay es una forma conveniente de gastar criptomonedas en más lugares que antes. &quot;Tenemos miles de clientes de la aplicación BitPay Wallet que utilizan la tarjeta BitPay y que siempre están buscando nuevos lugares y formas de gastar sus criptomonedas&quot;, dijo Stephen Pair, CEO de BitPay <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> presione soltar </a> . </p> <p> </p> <p> Con Apple Pay, los titulares de tarjetas BitPay pueden realizar compras sin contacto seguras en tiendas físicas, aplicaciones compatibles con Apple Pay y en la web. La compañía señala que los clientes que esperan la entrega de una tarjeta de plástico pueden agregar su contraparte virtual a Apple Wallet a través de la aplicación oficial BitPay Wallet. Hacerlo le permitirá comenzar a gastar de inmediato. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> ¿Qué es la tarjeta BitPay? </h2> <p> Una tarjeta prepaga que utiliza la red Mastercard, la tarjeta BitPay facilita la realización de pagos sin contacto y con PIN, así como la extracción de efectivo de cualquier cajero automático compatible. Con la aplicación, los clientes pueden hacer cosas como ver su saldo, solicitar un nuevo PIN, recargar instantáneamente, así como convertir criptomonedas en moneda fiduciaria (que luego se carga en la tarjeta, lista para gastar en cualquier lugar donde se acepte el débito Mastercard a nivel mundial). </p> <blockquote> <p> Para los usuarios avanzados de blockchain, la aplicación BitPay Wallet admite una variedad de opciones para comprar y almacenar cripto y realizar pagos en línea. Los usuarios pueden comprar instantáneamente tarjetas de regalo de cientos de los principales minoristas en la tienda y en línea. </p> </blockquote> <p> La tarjeta tiene un chip EMV y se puede bloquear en caso de emergencia con la aplicación. </p> <p> Según la compañía, el soporte para Google Pay y Samsung Pay está previsto &quot;a finales de este trimestre&quot;. En cuanto a la aplicación BitPay, actualmente admite Bitcoin, Bitcoin Cash y Ether, así como cuatro monedas estables vinculadas al dólar, USDC, GUSD, PAX y criptomonedas BUSD. </p>"}