{"title":"Cómo instalar un controlador de puerta de garaje inteligente","content":"<p> ¿Quiere controlar la puerta de su garaje con su teléfono inteligente o tableta? Un controlador inteligente es una excelente opción si ya tiene un abre-puertas de garaje instalado en su hogar. </p> <p> Le mostraremos cómo instalar un controlador de puerta de garaje inteligente. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Diferencias entre un abridor y un controlador </h2> <p> Hay dos diferencias principales entre un abridor de puerta de garaje inteligente y un controlador. El primero es el tamaño. </p> <p> La mayoría de los abridores son grandes y se montan en el techo de su garaje. Utilizan una pista mecánica para abrir y cerrar la puerta. Un controlador de puerta de garaje, por otro lado, es una pequeña unidad electrónica que le permite controlar el abridor mediante una aplicación en un dispositivo inteligente. </p> <p> La segunda distinción entre estos dos productos es el precio. Los abre-puertas de garaje pueden costar alrededor de $ 300. La instalación de estos abridores generalmente requiere la ayuda de un instalador profesional. </p> <p> Sin embargo, un controlador no suele necesitar una instalación profesional. En cambio, el controlador funciona como un complemento de su abridor existente. </p> <p> Esto significa que por una fracción del precio de un abridor nuevo, puede lograr la misma funcionalidad con solo usar un controlador. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> ¿Cuáles son los beneficios de una puerta de garaje inteligente? </h2> <p> Hay tres beneficios principales de tener una puerta de garaje inteligente. </p> <ul> <li> <strong> Seguridad </strong> —Una puerta de garaje inteligente le permite abrir y cerrar la puerta desde casi cualquier lugar. </li> <li> <strong> Seguridad </strong> —La mayoría de los controladores y abre-puertas de garaje inteligentes le avisan cuando su garaje ha estado abierto durante un período de tiempo específico. </li> <li> <strong> Conveniencia </strong> —Si alguna vez ha tenido que volver a casa para cerrar la puerta de su garaje, tener una aplicación inteligente para puertas de garaje le ahorrará tiempo. En lugar de conducir a casa, simplemente saque su teléfono. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> Cómo instalar un controlador de puerta de garaje inteligente </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Si ha decidido que un controlador de puerta de garaje inteligente es adecuado para usted, esta guía le mostrará cómo instalar uno. En esta demostración, un <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meross MSG100 </a> se utiliza, pero este proceso es similar si se utiliza otra marca. Consulte la documentación de su controlador para obtener más detalles. </p> <h3 id=\"what-you-ll-need\"> Lo que necesitarás </h3> <ul> <li> Un controlador de garaje inteligente </li> <li> Soportes para pistola de grapas o alambre </li> <li> Puerta de garaje con abridor automático instalado </li> <li> Destornilladores Philips y ranurados </li> <li> Escalera </li> </ul> <h3 id=\"plan-the-installation\"> 1. Planifique la instalación </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Antes de instalar su controlador, deberá explorar algunos lugares en su garaje. La primera es una fuente de alimentación para el controlador. El segundo es la ruta del cable desde el controlador hasta el sensor montado en la puerta incluido en su kit. Y el tercero es la ubicación del sensor magnético. </p> <p> Este sensor magnético permite al controlador saber cuándo se abre o se cierra la puerta. </p> <p> La mayoría de los controladores utilizan un cable largo para conectarse al sensor de la puerta. Deberá pasar este cable a través del techo o por una pared para mantener el cable fuera del camino. </p> <p> Una vez que haya planeado su instalación, pruebe el ajuste del cable del sensor desde el controlador hasta la ubicación del sensor. Este ajuste de prueba asegura que el cable del sensor llegue a su controlador. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Apague la energía de su abre-puertas de garaje </h3> <p> La mayoría de las puertas de garaje están conectadas a la corriente en algún lugar del techo. Para esos abridores, querrá asegurarse de que estén desenchufados antes de continuar. </p> <p> Si su abridor no tiene un enchufe y, en cambio, está conectado al cableado que sale del techo, entonces deberá encontrar su caja de interruptores y desconectar la energía del abridor allí. </p> <p> <strong> Nota: </strong> La corriente doméstica de 120 voltios puede causar lesiones graves. Si no se siente cómodo trabajando con electricidad, deténgase ahora y consulte a un instalador o electricista profesional de puertas de garaje. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Conecte los cables incluidos al controlador </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> En la unidad Meross, hay un conjunto de cables azul y marrón que deben instalarse en el controlador para conectarse al abre-puertas de garaje. Abra la cubierta de plástico del controlador y debería ver dos terminales de tornillo. </p> <p> Con un destornillador plano pequeño, afloje los tornillos de cada terminal. Inserta tus cables y aprieta los tornillos. No importa qué cable vaya a dónde. </p> <p> Dale un suave tirón a los cables para asegurarte de que estén seguros. Luego, vuelva a colocar la cubierta del controlador. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Monte el controlador de la puerta del garaje </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Dado que ha planificado sus ubicaciones, ahora es el momento de montar su controlador. Asegúrese de que el controlador esté en un lugar donde pueda acceder a la energía que necesita sin poner tensión en ningún cableado. </p> <p> A continuación, retire la parte trasera adhesiva del controlador y presiónela en su lugar. Si tiene un controlador con un montaje de tornillo, utilice el destornillador para fijar el controlador en su posición. </p> <h3 id=\"mount-the-sensor\"> 5. Monte el sensor </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> A continuación, deberá montar el sensor para la puerta. Se recomienda que este sensor se coloque donde no obstruya el paso de la puerta. </p> <p> Además, puede tener la tentación de montar el sensor cerca del suelo. Esto no se recomienda, ya que el agua que salpica repetidamente directamente sobre el sensor puede dañarlo. Una vez que haya colocado el sensor, use la cinta de doble cara o los tornillos suministrados para asegurarlo. </p> <p> En la foto de arriba, el sensor negro se ha montado al lado de la puerta del garaje con la parte del imán montada en la propia puerta. Este sensor utiliza cinta de doble cara para el montaje. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Conecte los cables del sensor </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Ahora es el momento de conectar los cables al sensor y al controlador. Usando el plan que hizo en el primer paso, enrute los cables y use la pistola de grapas para asegurar los cables a la pared o al techo. </p> <p> Asegúrese de no pellizcar ni torcer los cables, ya que esto puede dañarlos. Cuando estén enrutados, conecte el conector trasero hembra rojo del controlador al conector trasero macho rojo al final del cable del sensor. </p> <p> A continuación, deberá abrir la tapa del abre-puertas de garaje. Debe haber cuatro cables presentes, dos de alimentación de control y comunes a la unidad, y dos de control del botón en la pared. </p> <p> </p> <p> Por lo general, estos cables se originan en el techo y deben tener terminales de horquilla engarzados que los aseguren a la unidad del abre-puertas de garaje. Si no puede determinar qué cables son cuáles, deténgase y consulte el manual del propietario del abre-puertas de garaje o consulte a un electricista certificado. </p> <p> Si ha encontrado los cables, conecte los cables marrón y azul del controlador a los terminales del abridor que están conectados al botón de la pared. En la foto de arriba, los cables del controlador se han insertado en los dos terminales más a la izquierda. </p> <p> Cuando haya terminado, debe haber dos cables conectados a cada terminal de botón de pared. Vuelva a fijar la cubierta del abre-puertas de garaje, conecte el controlador y el abre-puertas y la instalación debería estar completa. </p> <p> En el siguiente paso, conectará el controlador a una red inalámbrica. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Conecte el controlador a Wi-Fi </h3> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (3 imágenes) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Expandir <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Expandir <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> Para configurar la conectividad Wi-Fi, usamos la aplicación Meross. Está disponible para <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> y <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Androide </a> . Este proceso casi siempre consiste en abrir la aplicación, identificar su producto, conectar la aplicación a su Wi-Fi, abrir la pantalla de Configuración y permitir que el controlador acceda a su red. </p> <p> Aquí, abra la aplicación, luego toque <strong> Abre-puerta de garaje inteligente </strong> y entonces <strong> Comienzo </strong> . Seleccione el fabricante y modelo del abre-puertas de garaje que está utilizando con el controlador. Asegúrese de seguir las instrucciones específicas de su aplicación. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Configure el intervalo de tiempo de apertura / cierre. </h3> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (3 imágenes) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Expandir <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Expandir <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> Una cosa que es importante configurar antes de probar su nuevo controlador es la sincronización del abridor de la puerta del garaje. En la aplicación Meross, puede seleccionar entre 10 y 40 segundos en intervalos de cinco segundos, o puede agregar una configuración personalizada para las puertas que tardan un número par de segundos en cerrarse. </p> <p> Establecer el tiempo para su puerta es fácil, pero debe hacerlo bien. Un intervalo demasiado corto dejará la puerta parcialmente abierta y un ajuste demasiado largo puede causar una tensión indebida en el motor del abre-puertas de garaje. </p> <p> Para establecer el intervalo, necesitará un reloj con segundero o función de cronómetro. También puede utilizar el temporizador integrado de su teléfono. Prepare su temporizador y párese cerca del botón de apertura de la puerta de su garaje. Luego presione el botón al mismo tiempo que presiona iniciar en su cronómetro, o anote la hora en la manecilla de los segundos. </p> <p> Espere hasta que la puerta de su garaje deje de moverse y registre el tiempo. Este es tu intervalo. Transfiera esa información a la aplicación y la configuración del intervalo estará completa. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Pruebe el controlador de la puerta del garaje </h3> <p> Usando su aplicación, abra y cierre la puerta varias veces solo para asegurarse de que todo esté funcionando. Ahora debería poder usar el botón de pared o la aplicación para abrir la puerta de su garaje. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Disfrute de su controlador de puerta de garaje inteligente </h2> <p> Llevar la tecnología de su hogar inteligente a la puerta de un garaje no tiene por qué costar una fortuna. </p> <p> La instalación de un nuevo controlador de puerta de garaje inteligente le brinda a usted y a su familia más flexibilidad, seguridad y conveniencia para su hogar. También brinda la tranquilidad de saber que la puerta de su garaje se puede controlar desde casi cualquier lugar. </p>"}