{"title":"Cómo reparar el uso elevado de CPU ejecutable del servicio Antimalware en Windows 10","content":"<p> Si su computadora se siente lenta o no responde, es mejor verificar si algún proceso está consumiendo la memoria y la CPU. Es probable que el proceso sea el ejecutable del servicio antimalware. Este problema común surge cuando Windows Defender no se ha configurado correctamente o hay malware en su sistema que interfiere con su funcionamiento. </p> <p> Así es como se corrige el error de uso elevado de CPU de Antimalware Service Executable en Windows 10. </p> <h2 id=\"optimize-windows-defender-scheduling-options\"> 1. Optimizar las opciones de programación de Windows Defender </h2> <p> Antimalware Service Executable da como resultado un alto uso de la CPU cuando está programado para ejecutar un análisis completo de su sistema a intervalos regulares. Es mejor reprogramar estos escaneos para un momento en el que sea menos probable que intente realizar tareas intensivas de la CPU, o tal vez incluso usar su computadora. </p> <p> A continuación, le indicamos cómo cambiar la programación de Windows Defender: </p> <ol> <li> En la barra de búsqueda del menú Inicio, escriba &quot;programador de tareas&quot; y haga clic en <strong> Programador de tareas </strong> . </li> <li> En el panel de navegación de la izquierda, vaya a <strong> Biblioteca del programador de tareas&gt; Microsoft&gt; Windows&gt; Windows Defender </strong> . Puede hacer esto expandiendo cada una de las bibliotecas mencionadas anteriormente. </li> <li> En el <strong> Windows Defender </strong> biblioteca, haga doble clic en <strong> Análisis programado de Windows Defender </strong> en el panel del medio. </li> <li> Bajo la <strong> Condiciones </strong> pestaña, desmarque todas las opciones y haga clic en Aceptar. Esto elimina todos los análisis programados. </li> </ol> <p> <img alt=\"Windows Defender Scheduled scan entry in Task Scheduler\" src=\"images/windows-defender-scheduled-scans-807.jpg\" loading=\"lazy\"> </p> <h3 id=\"create-new-scheduled-scans\"> Crear nuevos análisis programados </h3> <p> Los usuarios deben crear nuevos análisis programados para que su computadora permanezca protegida. Es mejor personalizarlo según sus necesidades. Puede programarlos en momentos en los que sepa que no realizará tareas pesadas de la CPU. Pero la frecuencia debe ser al menos una vez a la semana. </p> <p> Para crear una nueva programación de Windows Defender, siga estos pasos: </p> <ol> <li> Abierto <strong> Programador de tareas </strong> y una vez más navegar a <strong> Biblioteca del programador de tareas&gt; Microsoft&gt; Windows&gt; Windows Defender </strong> </li> <li> Haga doble clic <strong> Windows Defender programado </strong><strong> Escanear </strong> . </li> <li> Bajo la <strong> Disparadores </strong> pestaña, haga clic en <strong> Nuevo </strong> . </li> <li> Aquí puede elegir la frecuencia con la que se ejecutará el análisis. </li> <li> Aplicar la configuración y salir. </li> </ol> <p> <img alt=\"Adding a new trigger toWindows Defender Scheduled scan using Task Scheduler\" src=\"images/new-trigger-defender-513.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-windows-defender-to-its-own-exclusion-list\"> 2. Agregue Windows Defender a su propia lista de exclusión </h2> <p> Al realizar un análisis completo del sistema, Windows Defender revisa todos los archivos de su sistema. Esto se incluye a sí mismo, lo que puede provocar algunos problemas, por lo general, un rendimiento lento del sistema. Los usuarios pueden evitar esto agregando Antimalware Service Executable a la lista de exclusión de Windows Defender. </p> <p> Esto se puede hacer siguiendo estos pasos: </p> <ol> <li> prensa <strong> CTRL + Mayús + ESC </strong> para lanzar el <strong> Administrador de tareas </strong> . </li> <li> Bajo la <strong> Procesos </strong> pestaña buscar <strong> Servicio antimalware ejecutable. </strong> Haga clic derecho y seleccione <strong> Abrir localización de archivo </strong> . </li> <li> En la barra de direcciones ubicada en la parte superior del Explorador de Windows, copie la ruta del archivo (CTRL + C). </li> <li> En la barra de búsqueda del menú Inicio, ingrese &quot;Seguridad de Windows&quot; y abra la aplicación. Tiene un icono de escudo azul. </li> <li> Haga clic en <strong> Protección contra virus y amenazas </strong> y posteriormente haga clic en <b> Administrar la configuración </b> . </li> <li> Desplácese hacia abajo hasta encontrar <strong> Exclusiones </strong> y luego haga clic en <strong> Agregar o quitar exclusiones </strong> . </li> <li> Haga clic en <strong> Agregar una exclusión </strong> luego haga clic en Archivo. </li> <li> En la barra de direcciones de la ventana del Explorador de archivos, pegue la ruta que había copiado anteriormente (CTRL + V). </li> <li> Buscar <strong> MsMpEng.exe </strong> y haga clic en abrir. </li> <li> El archivo ahora se excluirá de todos los análisis futuros de Windows Defender. </li> </ol> <p> <img alt=\"Adding an entry to windows defender exclusion list\" src=\"images/windows-defender-exclusion-add-843.jpg\" loading=\"lazy\"> </p> <p> </p> <p> </p> <h2 id=\"repair-corrupt-windows-defender-files-using-sfc\"> 3. Reparar archivos corruptos de Windows Defender usando SFC </h2> <p> SFC es una utilidad de Windows incorporada que escanea y repara automáticamente cualquier archivo del sistema dañado. Esto es lo que ayudará a reparar archivos corruptos de Windows Defender. </p> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-224.jpg\" loading=\"lazy\"> </p> <p> Para usar esto, haga lo siguiente: </p> <ol> <li> En la barra de búsqueda del menú Inicio, escriba <strong> cmd </strong> y abrir <strong> Símbolo del sistema </strong> . </li> <li> En la consola, escriba <strong> sfc / scannow </strong> y presione Enter. </li> <li> Windows tardará algún tiempo en escanear y reparar los archivos del sistema corruptos, incluidos los de Windows Defender. </li> </ol> <p> </p> <h2 id=\"disable-windows-defender\"> 4. Deshabilitar Windows Defender </h2> <p> Cuando todo lo demás falla, es hora de deshabilitar Windows Defender por completo. Antes de hacerlo, asegúrese de <a href=\"https://www.makeuseof.com/tag/best-antivirus-for-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> descargar e instalar software antivirus de terceros </a> para mantener su computadora segura. </p> <p> Para deshabilitar Windows Defender, siga estos pasos: </p> <ol> <li> En la barra de búsqueda del menú Inicio, escriba Seguridad de Windows y ábralo. </li> <li> En el tablero, haga clic en <strong> Protección contra virus y amenazas </strong> y luego haga clic en <strong> Administrar configuraciones </strong> . </li> <li> Cambiar <strong> Protección en tiempo real </strong> desactivado. </li> <li> Sal y reinicia tu computadora. </li> </ol> <p> <img alt=\"Disable Windows Defender Protection Temporarily\" src=\"images/disable-windows-defender-protection-temporarily-744.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-clean-boot-to-check-whether-a-third-party-app-may-be-responsible\"> 5. Use un arranque limpio para verificar si una aplicación de terceros puede ser responsable </h2> <p> A veces, las aplicaciones de terceros pueden interferir con los procesos del sistema. También es posible que el software de terceros se interprete erróneamente como malware. Para descartar aplicaciones de terceros como el motivo del problema, los usuarios deben realizar un inicio limpio. </p> <p> Estos son los pasos sobre cómo hacerlo: </p> <ol> <li> prensa <strong> Tecla de Windows + R </strong> para abrir el comando Ejecutar. Tipo <strong> msconfig </strong> y presione Enter. </li> <li> En el <strong> Configuración del sistema </strong> ventana, ve a <strong> </strong><strong> Servicios </strong> . </li> <li> Comprobar el <strong> Esconder todos los servicios de Microsoft </strong> opción. Luego proceda a verificar todos los servicios en la lista. </li> <li> Haga clic en <strong> Desactivar todo </strong> . </li> <li> Guardar y Salir. </li> <li> Ahora abierto <strong> Administrador de tareas </strong> presionando <strong> CTRL + Mayús + ESC </strong> . </li> <li> Bajo la <strong> Puesta en marcha </strong> pestaña, haga clic en cada servicio uno por uno y haga clic en <strong> Desactivar </strong> . </li> <li> Sal y reinicia tu computadora. </li> </ol> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-853.png\" loading=\"lazy\"> </p> <p> La computadora ahora se iniciará con todas las aplicaciones de terceros deshabilitadas. Los usuarios deben verificar si todavía tienen el problema y, si no es así, es mejor desinstalar las aplicaciones instaladas recientemente, ya que son las culpables. </p> <p> </p> <h2 id=\"check-for-malware-using-third-party-antivirus\"> 6. Compruebe si hay software malicioso con un antivirus de terceros </h2> <p> Hay virus que afectan directamente a Windows Defender y pueden interrumpir su funcionamiento o deshabilitarlo por completo. En tales casos, la única solución es escanear la computadora con un software antivirus de terceros. </p> <p> Pero primero, para asegurarse de que Windows Defender se haya infectado, verifique si la protección en tiempo real se desactiva automáticamente. Recuerde, siempre debe asegurarse de que <a href=\"https://www.makeuseof.com/easy-ways-boost-security-microsoft-defender-and-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows Defender está trabajando a su máximo potencial. </a> </p> <p> En algunos casos, los usuarios han informado que no pueden eliminar los archivos infectados (detectados por el propio Windows Defender) con Windows Defender. </p> <p> <img alt=\"Windows Defender dashboard displaying current threats\" src=\"images/current-threats-windows-defender-707.jpg\" loading=\"lazy\"> </p> <p> Para verificar este problema, simplemente siga estos pasos: </p> <ol> <li> En la barra de búsqueda del menú Inicio, escriba <strong> Seguridad de Windows </strong> e inicie la aplicación. </li> <li> En el tablero, haga clic en <strong> Protección contra virus y amenazas </strong> . </li> <li> Debajo <strong> Amenazas actuales, </strong> haga clic en <strong> Proteccion </strong><strong> historia </strong> . </li> <li> Debajo <strong> Amenazas en cuarentena </strong> , haga clic en <strong> Ver historia completa </strong> . </li> <li> Ahora haga clic en cualquier amenaza de la lista y seleccione <strong> Eliminar </strong> . </li> <li> Si Windows Defender elimina el archivo, entonces todo está funcionando bien, pero si no puede eliminar el archivo o hay una animación de espera infinita, entonces Windows Defender ha sido infectado. </li> </ol> <p> </p> <p> </p> <h2 id=\"fixing-the-antimalware-service-executable-high-cpu-usage-bug\"> Corrección del error de uso elevado de CPU ejecutable del servicio Antimalware </h2> <p> El uso de los consejos anteriores mejorará el rendimiento y la capacidad de respuesta de su computadora. Solo asegúrese de que su computadora nunca quede desprotegida contra el malware. Se recomienda que descargue algún otro software antivirus antes de deshabilitar Windows Defender. </p>"}