{"title":"Cómo mejorar sus habilidades de edición de Lightroom: 10 formas sencillas","content":"<p> Adobe Lightroom es una de las plataformas de edición de fotografías más conocidas del mercado. Esta solución es popular no solo porque tiene muchas funciones útiles, sino también por su facilidad de uso. </p> <p> Cuando los fotógrafos buscan tomarse su oficio un poco más en serio, lo primero que harán es comprar software de edición. Pero incluso si solo eres un fotógrafo casual, Lightroom ofrece muchas formas de sorprender a tus amigos. </p> <p> En esta guía, descubrirá varias formas sencillas de mejorar sus fotografías en Lightroom. Estos consejos funcionan tanto para Lightroom Classic como para Lightroom Creative Cloud. </p> <h2 id=\"use-masking\"> 1. Utilice enmascaramiento </h2> <p> Si enfoca su foto de manera predeterminada, agregará detalles a toda la imagen, incluso a las áreas que no desea. Esto puede dejarte con mucho grano en lugares indeseables, como el cielo y el agua. </p> <p> También corre el riesgo de hacer que su foto parezca más un dibujo que algo que tomó con su cámara. Afortunadamente, existe una solución sencilla. </p> <p> En la aplicación Lightroom, desplácese hacia abajo para <strong> Detalle </strong> . Cuando estés allí, ve a <strong> Afilado </strong> &gt; <strong> Enmascaramiento </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Desplace el control deslizante hasta que se seleccionen las partes de la imagen que desea enfocar. Para ver lo que está enmascarando, presione el <strong> Alt </strong> en su teclado al mismo tiempo. </p> <p> Una vez que haya enmascarado el área que desea, mueva el control deslizante de nitidez tanto o tan poco como necesite. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Utilice perfiles de cámara en lugar de los predeterminados de Adobe </h2> <p> Si carga una imagen en RAW, Adobe agregará uno de sus perfiles de programa de forma predeterminada. Y aunque estos pueden hacer que su imagen se vea mejor en algunos casos, a menudo es mejor elegir una cámara específica. </p> <p> Cuando usa un perfil de cámara, la imagen será más fácil de editar según lo que tomó con su dispositivo. </p> <p> Para cambiar el perfil de su foto, vaya a <strong> Perfiles </strong> &gt; <strong> Coincidencia de cámara </strong> . A continuación, puede elegir entre <strong> Estándar </strong> , <strong> Neutral </strong> , <strong> Paisaje </strong> y otros looks. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Recuerda: </strong> no puede cambiar el perfil de la imagen con tanta profundidad si solo toma archivos JPEG. Por lo tanto, antes de salir a tomar algunas fotos, configure la cámara en <strong> CRUDO </strong> o <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Cepille partes de su imagen </h2> <p> ¿Alguna vez ha aumentado la claridad, la saturación o el detalle de toda su imagen, esperando una obra maestra, pero en su lugar obtiene una imagen que parece tomada en un microondas? Si es así, podría beneficiarse modificando solo partes de su imagen. </p> <p> En Lightroom, puede acceder a una función llamada <strong> Cepillo </strong> . Puede usar esto para &quot;cepillar&quot; partes de su imagen mientras deja el resto solo. </p> <p> Para utilizar esta herramienta, vaya a la <strong> Cepillo </strong> en el lado derecho de la pantalla. Puede hacer que su pincel sea más grande o más pequeño, según la cantidad de la imagen que desee editar. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Antes de comenzar a cepillar, cambie las características de la imagen que desea modificar. Por ejemplo, puede subir el control deslizante de claridad si desea aclarar una parte de la imagen. </p> <p> Después de cambiar estas características, pase el pincel sobre las áreas que desea editar. prensa <strong> O </strong> en su teclado para ver dónde ha pasado. </p> <p> Si ha repasado demasiado en un área en particular, mantenga <strong> Menos </strong> ( <strong> - </strong> ) Y cepille esas partes para borrar sus ediciones. Conocimiento <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> atajos de teclado para Adobe Lightroom </a> es útil para estas situaciones, ¡así que no olvide repasarlas! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Elimina tus fotos </h2> <p> A veces, su cámara tomará fotos donde los bordes tengan colores poco naturales. Los notará especialmente cuando tome fotografías bajo la luz solar intensa. Vienen principalmente en tonos de verde y morado. </p> <p> Para borrar sus fotos, desplácese hacia abajo hasta <strong> Desinfectar </strong> . Puede optar por deshacerse de los flecos morados o verdes. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> Usar <strong> Monto </strong> para decidir la cantidad de eliminación que le gustaría agregar. Desliza la barra de colores hasta que estés satisfecho con los resultados. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Utilice geometría para enderezar sus fotos </h2> <p> No importa cuánto lo intente, sostener una cámara recta es difícil a menos que tenga un trípode. Pero gracias a la magia del software de edición, es fácil enderezar las imágenes. </p> <p> En Lightroom, puede enderezar automáticamente sus fotos yendo a la <strong> Cultivo </strong> sección. Sin embargo, existe una forma más precisa de lograr el mismo resultado. </p> <p> En la pestaña de la derecha, elija la opción superior. Luego, desplácese hacia abajo para <strong> Geometría </strong> . Cuando estés aquí, ve a <strong> Vertical </strong> &gt; <strong> Nivel </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> También puede dibujar a lo largo de líneas rectas para que la foto sea lo más recta posible. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Ajuste el tamaño de su área de nitidez </h2> <p> Ahora sabe sobre el enmascaramiento, pero ¿sabía que también puede enfocar áreas específicas de su foto? </p> <p> Para seleccionar el área dentro de la foto enmascarada que desea enfocar, vaya a <strong> Afilado </strong> , sostener el <strong> Alt </strong> clave, y dirígete a <strong> Radio </strong> . Ajustar este control deslizante le permite agrandar o reducir su área de afilado. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> Después de esto, sube al <strong> Afilado </strong> bar. Del mismo modo, mantenga pulsado el <strong> Alt </strong> y mueva el control deslizante hacia la derecha. Esto le facilitará la nitidez de un área específica de su foto, en lugar de la imagen completa. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Utilice las curvas de puntos de color </h2> <p> Si el color de su imagen no se ve bien incluso después de ajustar el balance de blancos, es posible que desee comprobar las curvas de puntos de color en Lightroom. Puede usarlos para ajustar ciertos colores en su imagen. </p> <p> Encontrará tres paneles de curvas de colores diferentes en la aplicación: rojo, azul y verde. </p> <p> Para llegar a estas curvas de color, desplácese hacia abajo para <strong> Curva de puntos </strong> . Luego, haga clic en el color que desea cambiar. Luego puede jugar con los colores de la misma manera que lo haría en el estándar <strong> Curva de puntos </strong> pestaña. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Escriba un número para cada control deslizante y modifíquelo en consecuencia </h2> <p> A menudo, los nuevos fotógrafos se emocionarán con la cantidad de opciones de edición disponibles para ellos. Cuando abran Lightroom, deslizarán cada barra demasiado en cualquier dirección. Pero en lugar de mejorar su imagen, terminan con un desastre sobreditado. </p> <p> Al editar tus fotos, la clave es realizar pequeños cambios. Lo más probable es que ya seas un buen fotógrafo y la imagen que hayas tomado solo necesite un poco de ajuste de posproducción. </p> <p> </p> <p> En lugar de mover libremente cada control deslizante, intente cambiar el número en las áreas que desea cambiar por <strong> +10 </strong> o <strong> -10 </strong> . Si cree que se necesita más trabajo, repita el proceso. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Cuando sienta que está cerca, mueva lentamente cada control deslizante hacia la izquierda o hacia la derecha hasta que esté feliz. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Recorta tus fotos </h2> <p> Recortar puede parecer obvio, pero muchos fotógrafos aún infrautilizan la función. También es importante recortar las imágenes en función de dónde las vaya a utilizar. De lo contrario, se distorsionarán. </p> <p> Para recortar sus fotos, vaya a la <strong> Cultivo </strong> icono. Este es el segundo más alto desde la cima. Ir <strong> Relación de aspecto </strong> para cambiar el tamaño y arrastre las esquinas para deshacerse de los objetos no deseados. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> Una vez que haya terminado de recortar, presione el <strong> Ingresar </strong> en su computadora, y los cambios entrarán en vigencia. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Utilice el histograma </h2> <p> El histograma de Lightroom es fácil de ignorar, pero es esencial conocerlo. Este pequeño gráfico le mostrará dónde los colores y la iluminación son desiguales en su imagen, lo que le permitirá crear una edición más limpia. </p> <p> Como regla general, una foto bien editada tendrá algunos picos en el histograma. A veces, esto es inevitable. Pero, en general, debe procurar que el gráfico sea lo más uniforme posible. </p> <p> Dependiendo de la versión de Lightroom que utilice, puede manipular el histograma de forma más o menos directa. En Lightroom Classic, puede hacer clic en el histograma e igualar las cosas deslizando ciertas secciones. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> En Creative Cloud, el histograma es igualmente visible en la esquina superior derecha, pero debe cambiar los controles deslizantes usted mismo para que el histograma se mueva. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> En ambas versiones de la plataforma, el histograma está disponible en la parte superior de la pantalla sobre las funciones de edición. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> La gran edición no es solo para los profesionales </h2> <p> Lightroom es un excelente software de edición para cualquiera que busque llevar su fotografía al siguiente nivel. E incluso si nunca antes ha usado la plataforma, no debe preocuparse, ya que es fácil de aprender. </p> <p> Cuando edite sus fotos en Lightroom, recuerde que, a menudo, menos es más. Además de considerar estos consejos, es una buena idea dar un paso atrás después de editar y volver más tarde para ver si están tan bien editados como pensaba. </p>"}