{"title":"Consulte la versión del navegador de xCloud de Microsoft","content":"<p> Si ha estado esperando ansiosamente noticias sobre el puerto del navegador xCloud, entonces hoy es su día de suerte porque puede echar un vistazo a cómo se ve realmente. </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> Los probadores revelan capturas de pantalla del navegador xCloud </h2> <p> xCloud está disponible actualmente en una variedad de dispositivos, pero todavía estamos esperando que Microsoft lance oficialmente la versión del navegador. </p> <p> Los detalles han sido bastante escasos ... hasta ahora. Según un informe de <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> El borde </a> , &quot;fuentes familiarizadas con los planes de Xbox de Microsoft&quot; afirman que &quot;los empleados ahora están probando una versión web de xCloud antes de una vista previa pública&quot;. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> A continuación, presentamos un primer vistazo a xCloud para la web de Microsoft <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> - The Verge (@verge) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> 15 de febrero de 2021 </a></blockquote>  <p> No olvide que estas son solo imágenes de probadores, lo que significa que, aunque es poco probable, Microsoft podría cambiar el aspecto de la versión del navegador xCloud por completo. </p> <p> De las capturas de pantalla, parece que xCloud está configurado de manera muy similar a la versión de Android, que está disponible en teléfonos inteligentes y tabletas. </p> <p> Puedes ver los juegos agregados recientemente en la parte superior de la captura de pantalla, seguidos de la sección &quot;Próximamente&quot;. Debajo de eso, tiene varias opciones para seleccionar un género de juego de su elección, con la biblioteca completa de juegos xCloud disponible en la parte inferior de la página. </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> ¿Cómo se accede a xCloud en su navegador? </h2> <p> Actualmente, no puedes. La versión pública del puerto web de xCloud aún no está disponible. Lo que significa que debe esperar un poco más si desea acceder a xCloud a través de su navegador. Al parecer, Microsoft tiene planes de revelar el servicio públicamente en el segundo trimestre de 2021. </p> <p> Hasta entonces, tendrá que encontrar otros métodos para acceder a xCloud. Actualmente, solo puede acceder al servicio de juegos en la nube en dispositivos Android (necesita la versión del navegador para jugar en iOS, gracias a <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> una disputa entre Apple y Microsoft </a> ). </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> ¿Se puede acceder a los juegos de xCloud de otra manera? </h2> <p> Bueno, sí y no. No puede acceder a ningún título en xCloud, por así decirlo. No, a menos que use un dispositivo Android y la aplicación oficial Game Pass para hacerlo. </p> <p> Sin embargo, los juegos disponibles en el servicio de juegos en la nube de Microsoft están disponibles en Game Pass. De hecho, obtienes acceso a xCloud como parte de una suscripción a Game Pass Ultimate. Por lo tanto, aún puede acceder a esos juegos a través de su Xbox o una PC con Windows. </p> <p> Entonces, en una palabra, sí. Puedes acceder a esos juegos de otra forma. Simplemente no use xCloud, a menos que tenga acceso a la versión de Android. </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud: Próximamente en un dispositivo iOS cercano </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> No deberías tener que esperar mucho hasta que puedas hacerte con la plataforma de juegos en la nube de Microsoft. Una vez que xCloud haya pasado por las pruebas, Microsoft hará los cambios necesarios antes de permitirnos echarle un vistazo y, con suerte, no mucho después, jugarlo también. </p>"}