{"title":"Cómo hacer tu propio juego de mesa en Tabletop Simulator","content":"<p> ¿Alguna vez pensaste en crear un juego para jugar con tus amigos en Tabletop Simulator (TTS)? O tal vez eres un desarrollador de juegos de mesa que busca crear prototipos de juegos y probarlos en línea. </p> <p> Nunca ha habido un mejor momento para aprovechar el versátil entorno de juego de TTS. Hoy te enseñaremos a hacer precisamente eso. </p> <h2 id=\"what-is-tabletop-simulator\"> ¿Qué es el simulador de mesa? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Para aquellos que no lo saben, Tabletop Simulator (TTS) proporciona un entorno 3D para jugar juegos de mesa, ya sea localmente o en línea. Se ha convertido en una excelente manera de <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> jugar juegos de mesa en línea con amigos </a> . </p> <p> Los juegos jugables en TTS incluyen de todo, desde póquer, damas, Dungeons &amp; Dragons, minigolf e incluso los últimos juegos de mesa. Cualquier juego que quieras jugar normalmente está disponible como DLC o en el taller de la comunidad. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> ¿Por qué utilizar Tabletop Simulator? </h2> <p> Si alguna vez ha intentado crear un juego de mesa físico, sabe cuánto tiempo puede llevar, no solo crear elementos del juego, sino también modificarlos o reemplazarlos cuando decida modificar o revisar el juego. </p> <p> En TTS, todo, desde el color hasta el peso de un objeto, se puede cambiar con un clic del mouse, lo que hace que el proceso de revisión sea suave y sin dolor. </p> <p> Además, es fácil transmitir en vivo tu juego y mostrarlo en las redes sociales y plataformas de transmisión. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> Qué necesitará para comenzar </h2> <p> Antes de comenzar, necesitará lo siguiente: </p> <ul> <li> Una cuenta de usuario de Steam </li> <li> Simulador de mesa instalado en su PC </li> <li> Imágenes JPG de su tablero y diseños de tarjetas. </li> </ul> <p> <strong> Descargar: </strong> Simulador de mesa activado <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> Vapor </a> ($ 19,99) </p> <p> La mejor forma de diseñar elementos de juego es ilustrando software o escaneando imágenes de tarjetas físicas que ya hayas creado. Solo asegúrese de que tengan extensiones JPG y se guarden individualmente. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Creación de tableros y tapetes de jugador </h2> <p> Cuando esté diseñando sus tableros y otros objetos 2D, asegúrese de que la resolución sea lo suficientemente alta como para que pueda dimensionarla correctamente sin perder calidad. TTS lo dimensionará automáticamente cuando lo importe, y podrá cambiar su tamaño exactamente como desee. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Creando Tarjetas </h2> <p> Las cartas en TTS tienen tres aspectos: la cara de la carta, el dorso de la carta y la carta oculta (cómo se verá la carta para los demás en la mano de un jugador). Deberá tener diseños para cada uno de estos, aunque tiene la opción de simplemente hacer que la tarjeta oculta esté en la parte posterior de la tarjeta. </p> <h3 id=\"create-and-arrange-card-faces\"> Crear y organizar caras de tarjetas </h3> <p> En lugar de importar cada carta una por una, es mejor importar todas o la mayoría de las cartas como una sola baraja. </p> <p> Para crear una baraja, copie y pegue cada diseño en una hoja de cartón de 7 x 10. El uso de una plantilla como la que se muestra a continuación lo ayudará a comenzar. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> La plantilla delinea ranuras para cada carta en su mazo, lo que le permite importar hasta 69 cartas a la vez. Si no necesita tantos, puede dejar los espacios sin usar y, si tiene más, puede combinar mazos o duplicar cartas después de la importación. </p> <p> Sin embargo, no es necesario que utilice esta plantilla. Una hoja de tarjeta puede, de hecho, ser de cualquier tamaño, y TTS la cortará automáticamente en una cuadrícula de 7x10. </p> <p> Para su comodidad, la plantilla anterior y una plantilla de tarjeta cuadrada están disponibles en su directorio de archivos local de TTS. </p> <p> Si no está seguro de dónde están sus archivos locales, puede encontrarlos a través de su biblioteca de Steam abriendo el <strong> Propiedades </strong> menú para TTS. Selecciona el <strong> Archivos locales </strong> pestaña y haga clic en <strong> Navegar </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Reverso de tarjetas </h3> <p> Si solo desea un diseño para la parte posterior de toda la plataforma, todo lo que necesita es una sola imagen JPG del diseño; no será necesaria ninguna hoja de tarjeta. </p> <p> Si su mazo va a tener múltiples respaldos únicos, deberá crear una hoja de tarjeta adicional con diseños de reverso que correspondan a los diseños de caras en su primera hoja de tarjetas. Para el diseño de la cara en la ranura uno, coloque su parte posterior designada en la ranura uno de su hoja posterior. Para la cara dos, coloque su espalda en la ranura dos, y así sucesivamente. </p> <h3 id=\"hidden-cards\"> Cartas ocultas </h3> <p> En la ranura 70 de la hoja de cartas, etiquetada &quot;Carta oculta para otros jugadores&quot; en la plantilla, coloque el diseño que desee que sea visible para los oponentes cuando las cartas de este mazo estén en la mano de un jugador. Esto es tradicionalmente en blanco o negro sólido, o presenta el diseño de la parte posterior de la plataforma. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Importación de elementos </h2> <p> Ahora que ha creado sus tableros y mazos, está listo para comenzar a importar. </p> <p> Antes de alojar un servidor con tu juego, es útil comenzar un juego para un jugador e importar los elementos con anticipación. Luego puede guardar la configuración y estar listo para comenzar inmediatamente cuando lleguen los jugadores. </p> <p> Inicie TTS y haga clic en <strong> Crear </strong> y luego seleccione <strong> Un solo jugador </strong> para crear el medio ambiente. Elimine cualquier elemento generado por TTS y seleccione la mesa en la que desea que se juegue su juego. </p> <p> Con el entorno listo, haga clic en el <strong> Objetos </strong> en el menú superior y, a continuación, seleccione el <strong> Personalizado </strong> categoría. </p> <h3 id=\"boards-and-player-mats\"> Tableros y tapetes de jugador </h3> <p> Seleccione <strong> Junta </strong> desde el <strong> Personalizado </strong> menú y haga clic en cualquier lugar de la mesa en el que desee que aparezca el tablero. Haga clic con el botón derecho en cualquier lugar para abrir el cuadro de diálogo de importación de la placa. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Busque su imagen del tablero y TTS le preguntará si desea cargarla en su cuenta de Steam Cloud o mantener un archivo local. Sube los archivos a la nube si planeas jugar tu juego en línea o en un dispositivo diferente. </p> <p> Opcionalmente, puede cargar sus imágenes en otro host, como Dropbox, Photobucket o Imgur, y pegar la URL aquí. Sin embargo, los hosts externos son menos confiables y no se recomiendan. </p> <p> Cuando lo cargue en su Steam Cloud, TTS le pedirá que le dé un nombre de archivo. Una vez finalizada la carga, haga clic en <strong> Importar </strong> . </p> <p> Con el tablero importado, ahora puede reducirlo o agrandarlo con el <strong> - </strong> y <strong> + </strong> teclas de su teclado. Para bloquearlo en su lugar para que no se mueva accidentalmente durante el juego, haga clic con el botón derecho en el tablero y debajo <strong> Alterna </strong> , haga clic en <strong> Cerrar con llave </strong> . </p> <h3 id=\"card-decks\"> Barajas de cartas </h3> <p> En el <strong> Objeto personalizado </strong> menú, haga clic en <strong> Plataforma </strong> . Haga clic en cualquier lugar de la mesa donde desee que aparezca el mazo y luego haga clic con el botón derecho para iniciar la importación. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Ajuste la configuración de la siguiente manera: </p> <ul> <li> <strong> Tipo: </strong> Cambie esto si tiene una forma específica en mente que no sea una tarjeta rectangular de esquina redonda normal. </li> <li> <strong> Cara: </strong> Haga clic en el <strong> Examinar archivos locales </strong> abotone y busque su hoja de la tarjeta de la cara. Nuevamente, recomendamos la opción Steam Cloud sobre archivos locales o hosts externos. </li> <li> <strong> Espaldas únicas: </strong> Marque esta opción si su mazo tendrá varios diseños de dorso y luego cargue la hoja de su dorso en el <strong> atrás </strong> caja. Si está utilizando un solo diseño para toda la plataforma, simplemente cargue su diseño posterior. </li> <li> <strong> Anchura y altura: </strong> Ajústelo si utilizó una proporción diferente a la de la tarjeta rectangular estándar, 10x7. </li> <li> <strong> Número: </strong> Asegúrese de que coincida con la cantidad de tarjetas que está importando. </li> <li> <strong> Oblicuo: </strong> Esto cambia la orientación de la <strong> Zoom alternativo </strong> función en TTS. Déjelo sin marcar a menos que desee que la tarjeta aparezca de lado. </li> <li> <strong> La espalda está oculta: </strong> Marque esto si desea que la vista oculta de sus cartas sea simplemente el reverso de las cartas. </li> </ul> <p> Cuando su configuración sea correcta, haga clic en <strong> Importar </strong> . Tu mazo aparecerá en la mesa y podrás empezar a barajar y repartir. </p> <p> Si desea que sus tarjetas tengan nombres para ayudar con la clasificación, haga clic con el botón derecho en una sola tarjeta y haga clic en <strong> Nombre </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Importación de otros elementos del juego </h2> <p> Importar otros objetos 2D es similar al proceso de importar tableros. No olvide que TTS tiene muchos elementos de juego comunes, como dados y figuras, listos para usar en el <strong> Objetos </strong> menú. </p> <p> Si tiene elementos 3D personalizados que desea utilizar, siga <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> Guía de TTS para importar modelos 3D </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Guardar un juego completo </h2> <p> Después de organizar los componentes en un estado de configuración inicial, haga clic en el <strong> Juegos </strong> en el menú superior. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Seleccione <strong> Guardar carga </strong> y haga clic en el <strong> Guardar partida </strong> botón. Dale un nombre y haz clic <strong> Ahorrar </strong> . Ahora, siempre que organice juegos, puede volver a cargarlo en la configuración perfecta accediendo al <strong> Guardar carga </strong> menú. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Aprovechar al máximo los juegos de mesa personalizados </h2> <p> Diseñar y jugar juegos personalizados es simple en Tabletop Simulator una vez que sepa cómo hacerlo. Invita a tus amigos o busca probadores de juego listos y dispuestos en <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> la comunidad TTS </a> . ¡Ahora puedes mostrar tu juego personalizado a los demás! </p>"}