{"title":"Comida para el cerebro del tamaño de un bocado: 5 sitios para aprender cosas nuevas de manera corta y divertida","content":"<p> Documentales de menos de un minuto. Episodios de podcast de solo 60 segundos. Infografías animadas para explicar temas complejos. Aquí es donde puede aprender más sobre el mundo en cápsulas rápidas de conocimiento interesante. </p> <p> En una era de períodos de atención cortos y actualizaciones de 280 caracteres, incluso el aprendizaje debe realizarse en pequeñas dosis. Es por eso que hay creadores de contenido que se especializan en hacer piezas informativas y entretenidas que casi no toman tiempo en nuestras ocupadas vidas. Desde mini-documentales de personas y temas fascinantes hasta guías de redes sociales sobre temas de moda, dale a tu mente algo de comida para el cerebro del tamaño de un bocado para masticar. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Documentos de 60 segundos </a> (Web): perfiles de personas y temas interesantes en 60 segundos </h2> <p> </p> <p> ¿Tienes un minuto? 60 Second Docs tiene una historia interesante para contarte sobre una persona interesante y, a su vez, un tema interesante. Cada documental tiene solo 60 segundos de duración, pero cubre lo mejor que necesita saber sobre el tema. </p> <p> Lo mejor es que 60 Second Docs se centra en perfiles de personas reales, en lugar de conceptos o tendencias. Por lo general, esa persona está haciendo algo único, ya sea iniciar una nueva tendencia, explorar un tema nuevo o traspasar los límites de alguna manera. Al hacerlo sobre la persona, no solo obtienes más información sobre el aspecto humano del sujeto único, sino que también se siente más real y emocional. </p> <p> Todos los 60 Second Docs están disponibles en su canal de YouTube o en las redes sociales. Es una buena idea seguirlos en cualquier red social que frecuenta, viendo todos los videos nuevos en su totalidad cada vez que publiquen una actualización. </p> <p> Si te gustan los documentales más largos, consulta el <strong> Selección oficial </strong> en el sitio web de 60 Second Docs. Aquí, los editores eligen documentales de 10 a 20 minutos que otros han filmado, sobre temas que creen que debería ver. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Entonces quieres hablar sobre </a> (Instagram): Mini guías de temas políticos y sociales </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> ¿Quién sabía que en un mundo de selfies de influencers y hashtags promocionados por marcas, Instagram proporcionaría una plataforma para educar? So You Want To Talk About (Sywtta) utiliza los formatos de publicaciones de múltiples imágenes de Instagram para crear miniguías sobre temas políticos y sociales. </p> <p> Los temas que Sywtta elige generalmente tratan temas de tendencia como la cancelación de préstamos estudiantiles, los derechos negros y la historia, falacias lógicas, vacunas COVID-19 y mucho más. Cada diapositiva utiliza una tipografía bellamente formateada para informarle sobre el tema y, además, cada diapositiva es como una minilección en sí misma. Cada guía se convierte en un curso intensivo rápido e informativo, sin tener demasiados datos. </p> <p> En un momento en el que debe estar atento a <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> noticias sesgadas o falsas </a> , también es importante tener en cuenta las filosofías de lo que está leyendo. Cuando se trata de política, Sywtta propaga los puntos de vista de las políticas progresistas y de izquierda. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> Ciencia de 60 segundos </a> (Podcast): Explicaciones de audio breves sobre ciencia, salud y tecnología </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Si prefiere escuchar su información que leer o mirar, consulte el podcast 60-Second Science. Realizado por el equipo de Scientific American, este podcast diario aborda temas de ciencia, medicina y tecnología, y explica un tema en una breve ráfaga. Si bien ya no se limita al límite de tiempo de un minuto, cada episodio aún dura menos de cinco minutos. </p> <p> Cada podcast tiene diferentes anfitriones del equipo de Scientific American, que cubren temas como COVID, animales y aves, ADN y medicina, ciencias ambientales, etc. Disfrutan de altos valores de producción, incorporan sonidos del mundo real sobre el tema de discusión y a menudo agregan clips de voz de expertos. </p> <p> Para navegar por los archivos de episodios pasados, diríjase al sitio web oficial de 60-Second Science. Aquí, puede filtrar los episodios por tema (salud, mente, sostenibilidad, tecnología, ciencias). Si no desea información en ráfagas breves, pruebe el podcast completo Science Talk. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Animagraffs </a> (Web): Infografías animadas de alta calidad para explicar las cosas </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> ¿Cómo funciona la criptomoneda? ¿Cuáles son los entresijos del seguro de automóvil? ¿Cómo haces un moonwalk? El diseñador y animador Jacob O&#39;Neal divide temas complejos en explicaciones simples y dibuja infografías animadas de alta calidad para ilustrarlos. </p> <p> Animagraffs es una colección de explicaciones breves a través de guías visuales, utilizando GIF animados. Jacob utiliza una variedad de técnicas de diseño, como vistas transversales para ilustrar cada parte de un instrumento, o imágenes grandes con partes móviles donde puedes acercar y alejar como Google Maps. Cada estilo se adapta al tema que está aprendiendo. </p> <p> Los sujetos también tienen una amplia gama, que incluye cómo corre un guepardo, cómo funcionan los coches eléctricos, cómo emite un altavoz, etc. También debe consultar la sección &quot;Trabajo del cliente&quot;, donde Jacob muestra las asignaciones pagas para las marcas. No se preocupe, aunque son anuncios, son informativos y divertidos. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Gran gran historia </a> (YouTube): Documentales cortos verdaderos fascinantes e interesantes </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story concluyó sus operaciones a fines de 2020, pero no antes de dejar cinco años de deliciosos documentales cortos. Sumérjase en los archivos para encontrar videos de aproximadamente 5 minutos sobre una variedad de temas interesantes y personas fascinantes de todo el mundo. </p> <p> Desde una película que se proyecta en un teatro indio durante 24 años hasta el increíble helado turco que no se derrite, cada video corto es una mirada de alta calidad y bien investigada sobre el tema. A diferencia de la mayoría de los otros videos de este tipo, los creadores de videos de Great Big Story a menudo viajan por el mundo para ponerse en el medio de la historia. Ordene por los más populares o use las diversas listas de reproducción personalizadas recomendadas por los creadores. </p> <p> En el canal, también encontrará algunos videos más largos, de unos 10 a 15 minutos de duración. Suelen ser listas y compilaciones, que incluyen algunos clips de los videos más cortos. Si tiene tiempo para averiguar más sobre el mundo que nos rodea, no puede equivocarse con esto. Incluso después de bajar las persianas, Great Big Story es una de las más <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> Canales fascinantes y educativos en YouTube. </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Utilice el aprendizaje por goteo para conquistar temas extensos </h2> <p> Estos sitios web y podcasts se centran en convertir cada tema nuevo en un paquete de información compacto y entretenido. Es una buena forma de aprender cosas nuevas en pequeños bocados. Pero también puede aplicar la misma filosofía para aprender sobre temas más complejos y amplios. </p> <p> Cada vez más, el aprendizaje por goteo o el microaprendizaje es una forma popular de obtener una educación. Recibiendo <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> lecciones pequeñas todos los días </a> , puede abordar temas como programación, diseño, desarrollo de aplicaciones, gestión de productos y más. Una búsqueda rápida en la web debería ayudarlo a encontrar una versión de aprendizaje por goteo de lo que esté buscando para educarse. </p>"}