{"title":"Cómo mantener sus datos personales a salvo de los empleadores","content":"<p> La tecnología de vigilancia es rampante dentro y fuera de la oficina. Muchos empleadores utilizan productos de administración de dispositivos móviles para dispositivos de la empresa, como teléfonos, computadoras portátiles y tabletas. Estos contienen programas diseñados para proteger a las empresas contra robos, espionaje corporativo o intenciones maliciosas. </p> <p> Sin embargo, si bien todo esto es excelente para proteger a su empresa, no son exactamente lo mejor para usted. Ya no es una cuestión de <strong> Si </strong> su empresa lo está rastreando; lo siguiente que debe preguntar es, ¿cuántos datos pueden encontrar las empresas? Sorprendentemente, mucho. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> ¿Qué pueden ver los empleadores en los dispositivos remotos y Wi-Fi de la empresa? </h2> <p> La mayoría de las personas no se dan cuenta de hasta qué punto las empresas tienen acceso a sus datos o cuánto de ellos registran cuando utilizan los dispositivos de la empresa. Aquí hay unos ejemplos. </p> <h3 id=\"location\"> Localización </h3> <p> Muchos empleados piensan que usar una red privada virtual (VPN) es suficiente para que sus empleadores crean que están donde se supone que deben estar. </p> <p> Si bien hay formas de ocultar su ubicación real en un dispositivo personal, no es completamente infalible, especialmente cuando se inicia sesión en cualquier aplicación o sitio web con una dirección de correo electrónico o un número de teléfono móvil emitidos por la empresa. </p> <p> </p> <p> Puede ser casi imposible ocultar su ubicación real cuando se utilizan dispositivos proporcionados por la empresa. Por ejemplo, las empresas de telecomunicaciones pueden detectar cuándo se ha conectado con alguno de sus socios de roaming. </p> <p> Además, las VPN corporativas son diferentes de las VPN comerciales con puertas de enlace monitoreadas por equipos de TI internos. </p> <h3 id=\"notes-documents-and-emails\"> Notas, documentos y correos electrónicos </h3> <p> Si cree que nadie sabe que ha estado utilizando la red Wi-Fi de la empresa para encontrar su próximo trabajo, está equivocado. Incluso si no está utilizando una dirección de correo electrónico de la empresa, muchas empresas tienen programas preinstalados en las computadoras portátiles de la empresa que incluyen registros de actividad en tiempo real, actualizaciones del historial de navegación y capturas de pantalla cronometradas de documentos abiertos y correos electrónicos. </p> <p> Con la premisa de protegerse contra posibles violaciones de datos, muchas empresas también las utilizan como mecanismos de informes o rastreadores de productividad. </p> <p> </p> <h3 id=\"online-messaging-history\"> Historial de mensajes en línea </h3> <p> A pesar del auge de las plataformas cifradas, la realidad es que sus mensajes no son del todo privados en los dispositivos corporativos. Al utilizar plataformas de mensajería, es posible que las empresas no puedan ver los detalles exactos de sus intercambios, pero es probable que aún puedan reconocer metadatos como el tamaño y el tipo de archivo. </p> <p> Con esto, si decide enviar archivos PDF de gran tamaño a través de una aplicación como WhatsApp, el sistema de detección de intrusos de su empresa probablemente lo señalará por comportamiento sospechoso. De acuerdo con las pautas corporativas, es posible que le pidan que demuestre que sus acciones no fueron maliciosas y es posible que deba solicitar la aprobación del liderazgo para su autorización. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> Cómo evitar compartir datos personales con su empleador </h2> <p> No existe una forma absoluta de mantener su información personal, conversaciones y actividades completamente fuera de su alcance en todo momento. Sin embargo, hay varias formas de mitigar los riesgos. </p> <p> No apoyamos la ocultación de datos a sus empleadores; de hecho, tienen derecho a recopilar información sobre sus empleados, incluso <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> capaz de rastrearte legalmente </a> . Pero necesita saber cuándo es apropiado guardar las cosas para usted, y eso depende de las empresas individuales. </p> <h3 id=\"read-company-policies\"> Leer las políticas de la empresa </h3> <p> Antes de poder discutir sobre la transparencia de los datos, también debe comprender el tipo de información que le está dando a su empleador a sabiendas al trabajar para él. Solo cuando sepa lo que se espera podrá establecer los límites profesionales adecuados. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Intente comprender las políticas y los procedimientos de recopilación de datos de la empresa antes de recopilarlos. A partir de ahí, puede hacer un plan eficaz para optar por no proporcionar más información de la necesaria. </p> <h3 id=\"use-personal-gadgets\"> Utilizar gadgets personales </h3> <p> Si bien siempre es tentador usar dispositivos de la empresa para ahorrar dinero, la realidad es que nada es realmente gratis. Invierta en computadoras portátiles, teléfonos móviles y tabletas para uso personal. </p> <p> Tener dispositivos personales separados también es una excelente manera de establecer límites, especialmente cuando se trabaja de forma remota. </p> <p> El uso de su propio dispositivo le brinda la capacidad de establecer y administrar las diversas prácticas de seguridad necesarias para mantener sus datos a salvo de miradas indiscretas. Puede parecer un gasto innecesario, pero es muy útil para preservar su tranquilidad. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Usar perfiles de invitado en dispositivos personales </h3> <p> Conectarse a cualquier red que no sea la suya es siempre un riesgo de seguridad, incluso si está en las instalaciones del trabajo. Iniciar sesión en una red Wi-Fi de empresa le da permiso a su empleador para acceder a todo, desde los metadatos de sus mensajes hasta los registros del historial de navegación. </p> <p> Si absolutamente necesita usar su computadora portátil personal en las redes de la empresa, puede optar por usar un perfil de invitado para reducir la cantidad de datos a los que pueden acceder de forma remota. Alternativamente, puede conectarse con el plan de datos de su teléfono móvil personal o dispositivo Wi-Fi portátil. </p> <h3 id=\"keep-your-passwords-safe\"> Mantenga sus contraseñas seguras </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Creando contraseñas seguras </a> no es suficiente. Debe asegurarse de que sus contraseñas no se guarden en los dispositivos de la empresa. Guardar contraseñas personales para cuentas bancarias en línea, correos electrónicos personales o sitios web gubernamentales en dispositivos que no posee pone sus datos en riesgo inmediato si la base de datos de su empresa está comprometida. </p> <p> Use solo su teléfono móvil o computadora portátil personal para acceder a cuentas importantes, especialmente aquellas en las que hay dinero de por medio. Siempre que sea posible, habilite la autenticación de dos factores. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> Separe su trabajo y su vida personal </h2> <p> Los empleadores tienen derecho a acceder a su dispositivo proporcionado por la empresa de forma remota si sospechan que está participando en cualquier forma de actividad ilegal, poniendo en riesgo la información de la empresa o solicitada por la policía para una investigación. </p> <p> Sin embargo, esto es diferente a los dispositivos personales. </p> <p> Su seguridad es tan fuerte como las personas con las que está en contacto, eso incluye a su empleador. Mantener separados sus dispositivos personales y de trabajo es solo un paso hacia la descentralización de sus datos. Si aplica fuertes medidas de seguridad, puede limitar la cantidad de puntos de acceso que tienen los piratas informáticos a documentos, correos electrónicos y redes. </p> <p> La descentralización de los datos personales es necesaria porque lo protege a usted, como individuo, y a su empresa del robo, fraude y otras formas de ciberdelito. </p>"}