{"title":"Cómo los principales servicios de mensajería instantánea utilizan el cifrado de extremo a extremo","content":"<p> Los datos personales son más importantes que nunca. Los gobiernos, las empresas y los ciberdelincuentes anhelan que los datos personales de las personas sirvan a sus intereses. Diferentes plataformas en línea han facilitado la divulgación de datos personales sin nuestro conocimiento. </p> <p> Por esta razón, es importante comprender bien cómo las plataformas que utiliza en línea protegen su privacidad. Uno de los factores clave a tener en cuenta al considerar las medidas de protección de las aplicaciones de mensajería es el cifrado de extremo a extremo. </p> <p> Reconociendo la necesidad de priorizar la privacidad de los datos, más aplicaciones de mensajería han dado pasos importantes para implementar el cifrado de un extremo a otro. </p> <h2 id=\"what-is-end-to-end-encryption\"> ¿Qué es el cifrado de extremo a extremo? </h2> <p> </p> <p> El cifrado de extremo a extremo es <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> un método para cifrar las comunicaciones </a> para que terceros no puedan acceder a la información compartida entre personas que se envían mensajes entre sí. </p> <p> Con el cifrado de extremo a extremo, se utiliza un código secreto, en lugar de texto sin formato, para ocultar el contenido de los mensajes. Esto significa que solo aquellos que se comunican en una plataforma encriptada de un extremo a otro pueden leer los mensajes que se envían entre ellos. </p> <p> Veamos cómo tres populares servicios de mensajería segura, Signal, WhatsApp y Telegram, utilizan el cifrado de extremo a extremo. </p> <p> </p> <h2 id=\"signal\"> Señal </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signal se considera una de las aplicaciones de mensajería más seguras. Toda la comunicación en la plataforma está encriptada de un extremo a otro de forma predeterminada. </p> <p> Signal no realiza copias de seguridad de los mensajes en la nube, lo que reduce los riesgos de que los malos actores utilicen métodos alternativos para adquirir información. También cifra los metadatos de los mensajes para que no se rastree la ubicación y la hora de las actividades de mensajería. </p> <p> Con un motor de cifrado de código abierto, el público se beneficia de niveles más altos de transparencia en la tecnología detrás de sus actividades de mensajería. Los usuarios pueden mirar más de cerca los detalles técnicos para comprender mejor los métodos utilizados para proteger su privacidad. </p> <p> Las plataformas de código abierto pueden hacer que el software sea mucho más fácil y seguro de usar a largo plazo. Las personas no solo pueden comprender mejor cómo funciona el software, sino que también pueden intentar configurar su propia versión de la aplicación, que podría ser más adecuada para sus necesidades de seguridad únicas. </p> <p> Signal utiliza una combinación de OTR, conocida como mensajería multipartita no registrada, que hace posible cifrar los mensajes de un extremo a otro en los chats grupales. Los riesgos de violación de datos pueden aumentar a medida que aumenta el número de participantes en una red. Con el chat grupal encriptado de un extremo a otro, estos riesgos se reducen significativamente. </p> <p> </p> <h2 id=\"whatsapp\"> Whatsapp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp fue una de las primeras aplicaciones de mensajería populares que permitió el cifrado de extremo a extremo. Utiliza cifrado de extremo a extremo para mensajes y llamadas. </p> <p> WhatsApp utiliza el protocolo de cifrado de extremo a extremo desarrollado por Open Whisper Systems, el equipo detrás de Signal Messenger. Esta es una gran ventaja para la aplicación, considerando lo seguro que es el protocolo de cifrado de Signal. </p> <p> </p> <p> El uso de WhatsApp de su propia implementación patentada significa que es posible que no sea examinado con tanta frecuencia por una amplia gama de investigadores de seguridad como el software de código abierto de Signal. </p> <p> A pesar del cifrado de los mensajes, se podrían utilizar otras formas para obtener más información sobre los mensajes que se envían en WhatsApp, ya que se puede hacer una copia de seguridad de los mensajes en la nube y los metadatos de la aplicación no están cifrados. Esto facilita saber la hora y la ubicación de los mensajes. Además, surgieron informes de chats grupales de WhatsApp indexados en la búsqueda de Google que cuestionaban la seguridad de sus chats grupales. </p> <p> </p> <h2 id=\"telegram\"> Telegrama </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegram es amado por su uso de cifrado y sus mensajes autodestructivos. Lamentablemente, existen varias preocupaciones de cifrado de extremo a extremo con Telegram que pueden no parecer tan obvias para muchos usuarios. </p> <p> En Telegram, el cifrado de extremo a extremo no está habilitado de forma predeterminada. Solo se ofrece cuando los usuarios cambian a chats secretos. Para los usuarios que no tienen una inclinación técnica, esto presenta riesgos de seguridad de los que es posible que ni siquiera sean conscientes. </p> <p> Telegram puede acceder a los mensajes almacenados en sus servidores que están respaldados en su nube. Algunos creen que esto presenta vectores adicionales de ataque que podrían conducir a violaciones de datos personales en los casos en que los ciberdelincuentes intentan robar datos de mensajería de la aplicación. </p> <p> Dicho esto, todos los chats secretos en Telegram son específicos del dispositivo, lo que significa que solo se puede acceder a los mensajes que envías a través de chats secretos desde el dispositivo desde el que se enviaron. </p> <p> Si bien los chats secretos de Telegram están encriptados de un extremo a otro, los chats grupales no lo están. Esto significa que los usuarios pueden utilizar varios dispositivos para el mismo chat grupal. Los usuarios pueden descargar los registros de chat en varios dispositivos. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Charlas secretas en <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #Telegrama </a> significa que sus mensajes están protegidos por cifrado de extremo a extremo y se eliminan después de un período de tiempo establecido. <br><br> A continuación, le indicamos cómo puede activar esta función. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> - Kaspersky (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 31 de enero de 2021 </a></blockquote>  <p> Telegram crea vistas previas de enlaces en sus servidores remotos de chats tanto normales como secretos. Cuando un usuario escribe un enlace por primera vez en un chat secreto, la aplicación le advierte que los enlaces se enviarán a servidores remotos. Esto se considera una debilidad de seguridad, ya que el envío de enlaces compartidos en un chat privado a un servidor remoto va en contra del propósito del cifrado de extremo a extremo. </p> <p> El protocolo de encriptación de Telegram, MTProto, está diseñado para acceder a una API de servidor desde aplicaciones en dispositivos móviles. Es propietario y solo parcialmente de código abierto. Esto pone en duda cuánto control y comprensión tiene el público sobre los métodos de cifrado que se utilizan para proteger sus mensajes. </p> <p> Afortunadamente, la aplicación de mensajería no se ha enfrentado a reclamos serios sobre violaciones de datos, pero es preocupante saber que sus operadores pueden acceder a sus mensajes. </p> <p> A pesar de las preocupaciones, muchos pueden sentirse tranquilos por los diversos obstáculos legales que tendrían que superar para acceder a los mensajes. Telegram ha dejado claro en el pasado lo difícil que es para las personas acceder a los mensajes en su plataforma. Se necesitaría acceder a las claves desde diferentes jurisdicciones, lo que frustraría a muchas personas. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> Elección de la aplicación de mensajería más segura </h2> <p> Aunque Signal puede no ser tan popular como WhatsApp, su protocolo ha sido un factor importante que contribuyó al éxito de WhatsApp con el cifrado de extremo a extremo. Si bien sus métodos de cifrado de extremo a extremo son similares a los de WhatsApp, se considera que es mejor que WhatsApp para el cifrado de extremo a extremo. Se distingue por tomar medidas adicionales para proteger a los usuarios. </p> <p> La decisión de Telegram de no priorizar el cifrado de extremo a extremo se ha atribuido a su preferencia por la conveniencia. Donde carece de cifrado, lo compensa con sus métodos indirectos de proteger a los usuarios con cifrado en la nube y almacenamiento de claves en diferentes jurisdicciones legales. </p>"}