{"title":"Cómo restablecer tus recomendaciones de Apple Music","content":"<p> Apple Music solía poseer una forma de fácil acceso para volver a seleccionar sus recomendaciones musicales al volver a seleccionar sus artistas y géneros musicales favoritos. Desafortunadamente, durante una actualización de la aplicación, Apple eliminó este método para actualizar la selección de música. </p> <p> No temas, aquí hay una guía sobre métodos alternativos para detener o restablecer tus sugerencias automáticas de Apple Music. </p> <h2 id=\"apple-music-recommendations-explained\"> Explicación de las recomendaciones de Apple Music </h2> <p> Cuando inicia inicialmente su cuenta de Apple Music por primera vez, le pide que seleccione sus favoritos de una amplia lista de géneros musicales y artistas. Esta selección es la forma en que Apple Music sugerirá listas de reproducción, álbumes, artistas y canciones en el futuro. </p> <p> Por ejemplo, si seleccionara Classic Rock, New Rock y Foo Fighters como algunas de sus opciones musicales favoritas, Apple Music probablemente sugeriría estaciones de escucha muy similares y promoverá la música rock recientemente lanzada. </p> <p> Los cambios en la aplicación significan que ahora solo puede seleccionar sus preferencias musicales durante la creación inicial de la cuenta, no puede restablecerlas en una fecha posterior, aunque Apple Music continuará modificando sus sugerencias según sus hábitos de escucha. </p> <p> Este es solo uno de varios útiles <a href=\"https://www.makeuseof.com/tag/apple-music-features-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Funciones de Apple Music para usar </a> . </p> <p> No se preocupe, todavía hay algunas formas de restablecer su selección de Apple Music deshabilitando sus preferencias de ID de Apple o eliminando y recreando su cuenta de Apple Music. </p> <p> Ambas opciones tienen ventajas y desventajas, así que averigüemos cuál es la mejor opción para usted. </p> <p> </p> <h2 id=\"turn-off-personalized-recommendations\"> Desactivar recomendaciones personalizadas </h2> <p> Desactivar Recomendaciones personalizadas para su ID de Apple es una buena manera de dejar de ver nuevas sugerencias en el futuro. </p> <p> Deshabilitar esta opción no eliminará sus datos de curación existentes, lo que significa que la aplicación continuará generando sugerencias basadas en su uso. Simplemente ya no los verás. Cerrar Recomendaciones personalizadas también afectará sus recomendaciones en otras aplicaciones de servicio de Apple, como Apple Books. </p> <p> A continuación, se explica cómo deshabilitar las recomendaciones personalizadas en un iPhone: </p> <ol> <li> Abre el <strong> Música de Apple </strong> aplicación. </li> <li> Ve a la <b> Escucha ahora </b> pestaña. </li> <li> Abra su perfil de Apple Music seleccionando el icono circular con la silueta de una persona en la esquina superior derecha de la pantalla. Si anteriormente ha subido una imagen como foto de perfil personal, aparecerá en lugar de la silueta. </li> <li> Seleccione <b> Ver ID de Apple </b> que se puede localizar desplazándose hasta la parte inferior de la <b> Cuenta </b> página. </li> <li> Apagar <b> Recomendaciones personalizadas </b> . </li> <li> Seleccione <b> Hecho </b> en la esquina superior derecha y ya está. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (3 imágenes) </strong> <img alt=\"Apple Music Lisen Now featuring Halle x Chloe\" src=\"images/apple-music-listen-now-page-713.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple Music Account Options Screenshot\" src=\"images/apple-music-account-page-914.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple ID Options Screenshot\" src=\"images/apple-id-account-page-817.jpg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> Después de hacer esto, cualquier búsqueda, descarga o reproducción de música nueva en Apple Music ya no afectará sus sugerencias automáticas. Esto no eliminará automáticamente sus búsquedas anteriores, lo que significa que puede tomar un poco de tiempo notar los efectos de este método. </p> <p> </p> <h2 id=\"delete-your-apple-music-profile\"> Eliminar su perfil de Apple Music </h2> <p> Si necesita un cambio de imagen completo de Apple Music con sugerencias de música fresca, la mejor opción es eliminar y recrear su perfil de Apple Music. </p> <p> Es importante tener en cuenta que eliminar su perfil eliminará por completo su biblioteca de música actual. La creación de un nuevo perfil le permitirá seleccionar nuevas preferencias de música y género, pero también eliminará por completo cualquier historial anterior de Apple Music. </p> <p> </p> <p> Si está interesado en un nuevo perfil de Apple Music con favoritos recién seleccionados, siga estos pasos para crear uno: </p> <ol> <li> Desde el <strong> Escucha ahora </strong> pestaña, vaya a su Apple Music <strong> Cuenta </strong> y seleccione <b> Ver perfil </b> . </li> <li> Seleccione <b> Editar </b> en el centro de la pantalla debajo de su nombre. </li> <li> Desplácese hasta la parte inferior de la pantalla y seleccione <b> Borrar perfil </b> . Tenga en cuenta que se trata de una eliminación permanente que requerirá un restablecimiento de la cuenta. </li> <li> Configure un nuevo perfil de Apple Music para usted que ahora está libre de sus selecciones anteriores. Si desactivó Recomendaciones personalizadas como se describe en la sección anterior, ya no experimentará sugerencias de música personalizadas. Partida <strong> Recomendaciones personalizadas </strong> on dará como resultado que Apple Music sugiera música basada en sus nuevos hábitos de escucha. </li> <li> Navegue libremente y disfrute de una amplia gama de opciones de audio recién seleccionadas. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (2 imágenes) </strong> <img alt=\"Apple Music Profile feat Halle x Chloe\" src=\"images/apple-music-profile-page-771.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple Music Profile Options Screenshot\" src=\"images/apple-music-edit-profile-page-450.jpg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> </p> <h2 id=\"spotify-s-recommendations-might-be-better\"> Las recomendaciones de Spotify podrían ser mejores </h2> <p> Si aún no está satisfecho con las recomendaciones de Apple Music incluso después de crear un nuevo perfil, podría ser el momento de cambiar de plataforma de transmisión de música. Apple Music y Spotify tienen muchas características muy similares, pero mucha gente siente que Spotify es muy superior a la hora de sugerir música nueva. </p> <p> Por supuesto, hay muchos otros factores a considerar al elegir entre Apple Music y Spotify también. </p>"}