{"title":"Cómo convertir tu PS5 de vertical a horizontal (o viceversa)","content":"<p> La PlayStation 5 funciona en una configuración vertical u horizontal. Si cambia de opinión sobre su orientación preferida, es bastante fácil mover su PS5 de vertical a horizontal (o viceversa). </p> <p> Veamos cómo mover de forma segura su PS5 de una orientación vertical a una horizontal de lado, y viceversa. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> Primero: apague y desconecte su PS5 </h2> <p> Antes de realizar cualquier trabajo de movimiento físico de su PlayStation 5, es importante apagarlo y desconectarlo todo. Esto evitará daños en el sistema que podrían ocurrir si lo mueve mientras está encendido. </p> <p> Debes apagar completamente tu PS5. Para hacer esto, presione el <strong> Botón PS </strong> en su controlador para que aparezca el menú rápido en la parte inferior de la pantalla. Seleccione <strong> Energía </strong> a la derecha y elige <strong> Apague la PS5 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Espere hasta que las luces de su consola se apaguen, luego desconecte el cable de alimentación, el cable HDMI y cualquier otra cosa que haya conectado al sistema. Ahora estás listo para cambiar la orientación de tu PS5. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Quite el tornillo del soporte </h2> <p> Cuando configuraste tu PS5 verticalmente, tenías que sacar un tornillo incluido de un compartimiento en la base y usarlo para asegurar la base a la consola cuando está colocada verticalmente. Como resultado, quitar este tornillo es su primer paso para cambiar la orientación de su consola. </p> <p> Gira suavemente tu PS5 de costado para que puedas acceder al soporte en la parte inferior. Utilice un destornillador de punta plana, una moneda o similar para quitar el tornillo plateado que sujeta la base al sistema. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Una vez que el tornillo esté suelto, la base se soltará. Hay un pequeño compartimento en la base donde puedes guardar el tornillo. Ajústelo en su lugar allí, luego deslícelo en el pequeño agujero para mantenerlo asegurado. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> También en este compartimento, encontrará un pequeño tapón negro (siempre que lo coloque allí durante la configuración inicial). Retire este tapón y utilícelo para tapar el orificio en la parte inferior de la PS5 donde acaba de sacar el tornillo. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Girar la base </h2> <p> Ahora, querrá girar la base para que encaje en la consola en su orientación horizontal. Esto también cierra el pequeño compartimento donde colocó el tornillo, asegurándolo aún más. </p> <p> Debe girar la base cuando la mire desde la parte superior (opuesta a donde acaba de guardar el tornillo). Si trata la parte elevada del soporte como &quot;norte&quot;, deberá rotar la pieza exterior del soporte hacia el &quot;noroeste&quot;, como se muestra a continuación. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Ésta es la orientación correcta para usar el soporte horizontalmente. Hará clic y se detendrá suavemente cuando lo tenga en el lugar correcto. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Coloque el soporte en posición horizontal </h2> <p> Ahora, puede conectar el soporte a su PS5 mientras está sentado horizontalmente. Asegúrese de que el sistema esté colocado correctamente: el logotipo de PS debe estar hacia arriba. </p> <p> En la parte posterior de su sistema, debajo y cerca de los dos puertos USB, verá algunos símbolos del controlador de PlayStation impresos en la consola. Deslice los brazos exteriores de la base (que acaba de girar) en el sistema alrededor de donde termina este patrón en cada lado. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Empuje los clips para asegurarlos, pero tenga en cuenta que en esta posición, el soporte no está completamente bloqueado en su lugar (como ocurre con el tornillo cuando se coloca verticalmente). Sea cuidadoso cuando deje el sistema y tenga en cuenta que el soporte podría resbalar si tira de él. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Ahora estás listo para usar tu PS5 en orientación horizontal. Vuelva a conectar todos los cables y enciéndalo para volver a tocar. Si tiene la PS5 estándar, insertará los discos boca arriba en esta orientación. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> Cómo cambiar tu PS5 de horizontal a vertical </h2> <p> ¿Desea volver a la orientación vertical de su PS5, o tal vez inicialmente configuró su PS5 en forma horizontal y desea ir vertical ahora? De cualquier manera, es fácil seguir el proceso anterior en orden inverso. Asegúrate de apagar y desconectar tu PS5 primero, si está encendida o en modo de reposo. </p> <p> </p> <p> Para cambiar a una orientación vertical, primero levante su PS5 y tire suavemente del soporte del sistema para quitarlo. A continuación, debe girar el brazo exterior de la base. Al mirarlo desde arriba, el brazo debe estar &quot;norte&quot;, en línea con la parte elevada. Asegúrese de sentir el clic suave, para que sepa que está en el lugar correcto. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> Coloque su PS5 de manera que pueda acceder a la parte inferior, luego retire el tapón negro del orificio en el medio, que se encuentra aproximadamente en el medio de las rejillas de ventilación. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Coloque este tapón negro dentro del pequeño orificio del compartimento en la parte inferior de la base. El tapón debe encajar en su lugar. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> A continuación, retire el tornillo del mismo compartimento en la base. Ahora, deberá colocar el soporte en su posición correcta. Para hacerlo, levante su PS5 de modo que la parte posterior de la consola quede hacia arriba, como se muestra a continuación. </p> <p> Tome el soporte y colóquelo de modo que el orificio del tornillo quede alineado con el orificio del que acaba de quitar el tapón. Coloque los clips en el brazo de la base en la parte posterior de su sistema debajo del conector de alimentación. El soporte debe alinearse fácilmente. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Ahora, use un destornillador o similar para apretar el tornillo. Una vez que haya terminado y el soporte se sienta firmemente sujeto, estará listo para usar su PS5 verticalmente. Vuelva a conectar todos los cables para completar el trabajo. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> ¿Debería colocar su PS5 vertical u horizontalmente? </h2> <p> Sony admite el uso de su PS5 tanto vertical como horizontalmente, por lo que no hay una forma correcta o incorrecta de hacerlo, siempre que su sistema tenga suficiente flujo de aire. La orientación que debe utilizar depende de sus necesidades. </p> <p> </p> <p> Si tiene mucho espacio y no le importa que la PS5 ocupe mucho espacio horizontal, el aspecto horizontal es elegante. Para aquellos con el modelo estándar PS5, también facilita un poco el proceso de inserción de discos, ya que la etiqueta siempre debe mirar hacia arriba. Esto es un poco más difícil de recordar con la orientación vertical, donde la etiqueta del disco debe mirar hacia la izquierda. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> Sin embargo, es posible que no tenga espacio dentro de su sistema de entretenimiento para acomodar la configuración horizontal. En estos casos, ir en vertical es su mejor opción. La PS5 es una consola enorme de cualquier manera, pero cuando se coloca verticalmente, se sienta muy bien al lado de su soporte de TV o similar. Esta es la configuración que utilizo, como se muestra en la imagen de abajo. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> Cualquiera que sea la orientación que elija para su PS5, asegúrese de usar el soporte. Mantiene el sistema fuera del suelo, lo que mejora el flujo de aire. El soporte también asegura la PS5, lo que hace que sea más difícil volcarla y dañarla. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> Configura tu PS5 y empieza a jugar </h2> <p> Ahora sabes cómo cambiar tu PS5 de vertical a horizontal y viceversa en solo unos minutos. Una vez que su sistema esté configurado, enciéndalo y disfrute de algunos de los mejores títulos de la PS5. </p> <p> No olvide que casi toda la biblioteca de la PS4 también funciona en la PS5, lo que le brinda mucho más para disfrutar. </p> <p> <small> Crédito de la imagen: Alex Van Aken / <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}