{"title":"Cómo mejorar su conciencia plena con buenas prácticas de seguridad","content":"<p> La ciberseguridad no debe tomarse a la ligera. Por otra parte, la amenaza constante de que los piratas informáticos adquieran sus datos personales es un pensamiento aterrador y puede causar un estrés considerable. Pero no debe preocuparse si protege su dispositivo correctamente. </p> <p> Para protegerse y proteger a otros usuarios de las amenazas en línea, debe trabajar en tres cualidades clave: conocimiento, vigilancia y previsión. Estos, junto con prácticas de seguridad confiables, pueden mejorar su seguridad y atención general. </p> <h2 id=\"learn-about-online-threats-and-how-to-handle-them\"> Obtenga información sobre las amenazas en línea y cómo manejarlas </h2> <p> Si no sabe cómo son las amenazas en línea, no puede defenderse de ellas, al menos no de manera efectiva o constante. Conozca todos los <a href=\"https://www.makeuseof.com/tag/viruses-spyware-malware-etc-explained-understanding-online-threats/\" target=\"_blank\" rel=\"nofollow noopener\"> tipos comunes de malware que enfrentan los usuarios en la actualidad </a> , desde virus hasta mensajes de phishing. Al mismo tiempo, explore las buenas medidas de seguridad que puede tomar. </p> <p> El conocimiento de ciberseguridad le muestra exactamente qué señales sospechosas debe buscar y cómo comportarse con ellas. En otras palabras, su mente se vuelve más clara y enfocada. </p> <p> </p> <p> Aprender todo lo que hay sobre el malware y cómo los piratas informáticos lo exponen significa que puede detectarlos y esquivarlos. Desafortunadamente, muchas personas no reconocen completamente los peligros en línea hasta que son víctimas. Pero incluso esto es información valiosa y un impulso para su conocimiento de la situación. </p> <p> Estudios como &quot;Evaluación de la presencia de la atención plena en grupos de ciberseguridad y no cibernéticos&quot; de Christopher Wilder en <a href=\"https://nsuworks.nova.edu/cgi/viewcontent.cgi?article=2100&context=gscis_etd\" target=\"_blank\" rel=\"nofollow noopener\"> NSUWorks </a> confirmar la importancia del conocimiento y la experiencia para mantenerse seguro mientras está en línea. </p> <p> Básicamente, tenga un interés activo en combatir a los piratas informáticos. </p> <p> </p> <h2 id=\"manage-your-security-with-reliable-anti-malware-services\"> Administre su seguridad con servicios antimalware confiables </h2> <p> Desarrolle una sólida comprensión de la ciberseguridad y habrá dado un buen primer paso para prevenir ataques a usted mismo, a su familia, amigos y colegas. Sin embargo, aún necesita defensas reales para atrapar las amenazas que se le escabullen. </p> <p> Una vez más, la investigación es clave. Invertir en <a href=\"https://www.makeuseof.com/tag/best-security-antivirus-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> las mejores herramientas antivirus informáticas </a> que puede encontrar puede tener un precio, pero vale la pena. </p> <p> Su confianza y seguridad aumentan, al mismo tiempo que le permite concentrarse en prácticas de seguridad que los servicios anti-malware no cubren. </p> <p> </p> <h2 id=\"create-secure-passwords-to-strengthen-your-security\"> Cree contraseñas seguras para fortalecer su seguridad </h2> <p> <img alt=\"Purple Lock and Key Password\" src=\"images/purple-lock-and-key-password-821.png\" loading=\"lazy\"> </p> <p> Sus contraseñas son los principales obstáculos entre los piratas informáticos y la información de sus cuentas. Cada nueva plataforma a la que se une se convierte en un punto de ataque potencial más, por lo que debe protegerlos a todos, idealmente con claves de cifrado únicas y complicadas (es decir, contraseñas, códigos de acceso o frases de contraseña). </p> <p> Aplicar esta medida tanto como sea posible no solo lo mantiene seguro, sino que le brinda control sobre su propia seguridad. </p> <p> Y, por lo menos, llevar un registro de sus contraseñas es un buen ejercicio para su memoria y habilidades de administración. Tu atención plena como un todo se vuelve completamente activa. </p> <p> </p> <p> </p> <h2 id=\"regularly-back-up-data-for-peace-of-mind\"> Realice copias de seguridad de los datos con regularidad para su tranquilidad </h2> <p> La verdad es que los ataques online pueden ocurrir con mucha facilidad. Todo lo que realmente se necesita, por ejemplo, es un error de juicio y hacer clic en algo que no debería tener. </p> <p> Sin embargo, en lugar de entrar en pánico y evitar Internet por completo, apéguese a prácticas de seguridad conocidas, como hacer copias de seguridad de sus datos. </p> <p> Esta es una de las formas más sencillas de prepararse en caso de que algo salga mal. Guarde sus archivos más importantes o incluso todo en su disco duro en un dispositivo externo. Luego, si el ransomware se dirige a usted o su computadora falla, sus datos estarán sanos y salvos. Se trata de darte tranquilidad. </p> <p> </p> <h2 id=\"create-mindful-home-and-work-environments\"> Cree entornos de trabajo y hogar conscientes </h2> <p> </p> <p> Un gran problema cuando se trata de ciberataques es que pueden afectar tanto a tus contactos como a ti. Tener cuidado con los correos electrónicos, las cuentas de redes sociales, etc., mantiene a muchas personas a salvo. Y no solo estamos hablando de su familia y amigos. </p> <p> Las empresas enteras a menudo están en riesgo, incluidos sus empleados y clientes. Según estadísticas sobre <a href=\"https://www.varonis.com/blog/cybersecurity-statistics/\" target=\"_blank\" rel=\"nofollow noopener\"> Varonis </a> , la piratería involucró el 45 por ciento de las filtraciones de datos en 2020, mientras que el 22 por ciento ocurrió a través de phishing y el 17 por ciento a través de malware. </p> <p> Esto muestra lo esencial que es un sistema de ciberseguridad completo y en el que la atención individual juega un papel clave. Todos en sus diferentes círculos sociales deben seguir las buenas prácticas de seguridad. Si no es así, encuentre una forma sutil de educarlos y motivarlos. </p> <p> </p> <p> </p> <h2 id=\"prioritize-tackling-security-weaknesses\"> Priorizar la lucha contra las debilidades de seguridad </h2> <p> Es fácil perder de vista cuánto implica la ciberseguridad. Además de sentirse desanimado, es posible que se estire demasiado mientras intenta abordar todo al mismo tiempo. </p> <p> Además, la multitarea puede hacer que preste menos atención a las partes individuales de su seguridad. </p> <p> Asegúrese de que su mente esté realmente concentrada y sea eficiente tomándose el tiempo para fortalecer todas sus defensas. Una vez que configure su software anti-malware, por ejemplo, concéntrese en administrar personalmente los aspectos más pequeños pero no menos riesgosos de su estilo de vida. Cada pequeño paso aumenta su conciencia y seguridad en línea. </p> <p> Aprender como <a href=\"https://www.makeuseof.com/spot-a-fake-linkedin-profile/\" target=\"_blank\" rel=\"nofollow noopener\"> detectar y denunciar perfiles falsos de LinkedIn </a> . Limite lo que su cuenta de correo electrónico debe contarse como spam. Si recibe un SMS sospechoso de una organización con la que está asociado, comuníquese directamente con la empresa y asegúrese de que el mensaje realmente provenga de ellos. </p> <p> </p> <h2 id=\"manage-stress-levels-boost-your-alertness\"> Manejar los niveles de estrés; Aumente su estado de alerta </h2> <p> <img alt=\"Stressed in Front of Computer\" src=\"images/stressed-in-front-of-computer-973.jpg\" loading=\"lazy\"> </p> <p> Sobre todo, no descuides tu atención emocional. Demasiado estrés afecta el estado de alerta y la productividad en todos los aspectos de la vida. Es una mentalidad peligrosa cuando se toman decisiones importantes o se enfrenta una estafa de phishing inteligente. </p> <p> Saber que está seguro cuando está activo en línea es un sentimiento bastante bueno, pero vea qué más puede hacer para mantener un estado de ánimo positivo. Tome descansos frecuentes, especialmente en el trabajo difícil. Encuentre entretenimiento, actividades de acondicionamiento físico o cualquier otra cosa que pueda ayudarlo a recargar sus baterías y concentrarse. </p> <p> </p> <h2 id=\"cybersecurity-depends-on-mindfulness\"> La ciberseguridad depende de la atención plena </h2> <p> El software solo puede hacer mucho para mantenerlo seguro en línea. Debe tomar el asunto en sus propias manos, y su mejor herramienta en esto es la atención plena. Con tiempo, conocimiento y experiencia, puede desarrollarlo y perfeccionarlo. </p> <p> Las prácticas de seguridad para el hogar y el trabajo pueden ayudarlo a estar más alerta y productivo, sin mencionar que es más seguro estar cerca. Comience con pasos básicos y avance hacia formas más complicadas de convertir su computadora en una fortaleza, con su mente como fuerza motriz. </p>"}