{"title":"Cómo ver quién te sigue en Facebook","content":"<p> Si te interesa conseguir más seguidores en Facebook tanto como te gusta hacer crecer tus amigos en Facebook, entonces quizás quieras ver quién te sigue en Facebook. Puede hacer esto fácilmente tanto en computadoras de escritorio como en dispositivos móviles. </p> <p> A continuación, le indicamos cómo saber cuántos seguidores tiene en Facebook. </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-desktop\"> Cómo ver quién te sigue en Facebook (escritorio) </h2> <p> En el escritorio, puede ver quién lo sigue en Facebook, pero no la cantidad de seguidores. Sin embargo, la aplicación móvil de Facebook te permite ver quién te sigue y el número de tus seguidores. </p> <p> <img alt=\"Facebook profile interface with friends\" src=\"images/click-more-and-select-followers-786.jpg\" loading=\"lazy\"> </p> <p> Primero, inicie sesión en su <a href=\"https://web.facebook.com\" target=\"_blank\" rel=\"nofollow noopener\"> cuenta de Facebook </a> a través de su navegador y utilice las siguientes instrucciones para ver a sus seguidores de Facebook: </p> <ol> <li> Una vez que haya iniciado sesión, haga clic en el <strong> icono de imagen pequeña </strong> junto a su nombre en la barra lateral. </li> <li> En el menú Perfil, haga clic en <strong> Amigos </strong> . </li> <li> Dentro del menú Amigos, haga clic en el <strong> Más </strong> menú desplegable a la derecha. </li> <li> En la lista desplegable, seleccione <strong> Seguidores </strong> para ver todos tus seguidores de Facebook. </li> </ol> <p> </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-mobile\"> Cómo ver quién te sigue en Facebook (móvil) </h2> <p> Como dijimos anteriormente, la aplicación móvil de Facebook te permite acceder a la lista y la cantidad de personas que te siguen en Facebook. </p> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (3 imágenes) </strong> <img alt=\"Facebook profile about info menu\" src=\"images/tap-see-your-about-info-732.png\" loading=\"lazy\"> Expandir <img alt=\"Mobile Facebook interface displaying Facebook followers\" src=\"images/tap-see-all-to-load-a-list-of-your-followers-895.png\" loading=\"lazy\"> Expandir <img alt=\"Mobile Facebook page displaying a list of followers and their numbers\" src=\"images/look-to-the-upper-right-corner-to-see-the-number-of-followers-677.png\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> Inicie sesión en su cuenta de Facebook a través de la aplicación móvil. Luego siga estas instrucciones: </p> <ol> <li> En la página de inicio de la aplicación móvil, toque el icono de imagen redonda junto al <strong> ¿Qué tienes en mente? </strong> barra de búsqueda para cargar su perfil. </li> <li> En el menú de perfil, toque <strong> Ver su información acerca de </strong> . </li> <li> Desplazarse hasta la parte inferior de la página. Entonces bajo <strong> Seguidores </strong> , grifo <strong> Ver todo </strong> para cargar una lista de todos tus seguidores de Facebook. </li> <li> Mire la esquina superior derecha de la página (enfrente <strong> Seguidores </strong> ) para ver la cantidad de personas que lo siguen en Facebook. </li> </ol> <p> No tendrá la opción de verificar sus seguidores de Facebook si no tiene ninguno. Como resultado, seguir los pasos anteriores no le permitirá verificar a sus seguidores, ya que no hay ninguno. </p> <p> Es posible que tampoco obtenga esta opción si su cuenta de Facebook es nueva, ya que es probable que aún no tenga seguidores. O puede que necesites <a href=\"https://www.makeuseof.com/tag/quickly-switch-facebook-profiles/\" target=\"_blank\" rel=\"nofollow noopener\"> cambiar a una cuenta de Facebook diferente </a> . Como alternativa, es posible que su cuenta no esté configurada para permitir que las personas lo sigan en Facebook; le explicaremos cómo cambiar esto a continuación. </p> <p> </p> <p> </p> <h2 id=\"how-to-give-the-public-access-to-follow-you-on-facebook\"> Cómo dar acceso público a que te siga en Facebook </h2> <p> A veces, si ha impedido que el público lo siga, limita las posibilidades de obtener más seguidores en Facebook. </p> <p> Eso es porque las personas que no están en tu lista de amigos no pueden seguirte en Facebook si no les permites. Sin embargo, puedes establecer tu preferencia de seguimiento como &quot;Público&quot; para que cualquiera pueda seguirte, en lugar de solo tus amigos. </p> <p> <strong> Para hacer esto en el escritorio: </strong> </p> <p> <img alt=\"Facebook privacy settings page\" src=\"images/click-on-public-post-and-change-who-can-follow-you-to-public-880.jpg\" loading=\"lazy\"> </p> <ol> <li> Ve a tu perfil. </li> <li> Haga clic en el <strong> icono desplegable redondo </strong> en la esquina superior derecha de la barra de menú. </li> <li> De la lista, seleccione <strong> Configuración y privacidad </strong> . </li> <li> Hacer clic <strong> Ajustes </strong> . </li> <li> En la barra lateral del menú Configuración, haga clic en <strong> Publicaciones públicas </strong> . </li> <li> Mire a la derecha del <strong> ¿Quién puede seguirme? </strong> opción y haga clic en la <strong> Amigos </strong> desplegable. </li> <li> Seleccione <strong> Público </strong> para dar acceso de seguimiento a cualquier persona, incluidos aquellos que no son tus amigos en Facebook. </li> </ol> <p> <strong> Para hacer esto en la aplicación móvil de Facebook: </strong> </p> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (3 imágenes) </strong> <img alt=\"Facebook menu list\" src=\"images/tap-the-three-menu-bars-and-go-to-settings-170.png\" loading=\"lazy\"> Expandir <img alt=\"Facebook settings list\" src=\"images/scroll-down-and-select-public-posts-754.png\" loading=\"lazy\"> Expandir <img alt=\"Facebook followers settings page\" src=\"images/tick-the-public-option-under-who-can-follow-728.png\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <ol> <li> Abra la aplicación móvil de Facebook y toque el <strong> tres barras de menú horizontales </strong> a la derecha de la página de inicio. </li> <li> Desplácese hacia abajo y seleccione <strong> Ajustes </strong> . </li> <li> Grifo <strong> Publicaciones públicas </strong> . </li> <li> Debajo <strong> ¿Quién puede seguirme? </strong> , garrapata <strong> Público </strong> . </li> </ol> <p> </p> <h2 id=\"keep-control-over-your-facebook-followers\"> Mantenga el control sobre sus seguidores de Facebook </h2> <p> Si usa Facebook para promocionar su marca o negocio, es necesario realizar un seguimiento de sus seguidores. Es una buena forma de moderar lo que la gente puede ver sobre ti. </p> <p> Si desea tener más control sobre sus amigos y seguidores de Facebook, debería considerar ocultarlos de su feed. </p>"}