{"title":"Cómo evitar que Windows 10 bloquee sus archivos descargados","content":"<p> Cuando intenta abrir un archivo, Windows 10 puede evitar que lo abra directamente. Le mostrará una advertencia de seguridad de que el archivo se originó en una fuente desconocida y puede ser inseguro. Esto sucede cuando una función de Windows 10 llamada Attachment Manager bloquea archivos que considera inseguros para su PC. </p> <p> Si bien puede desbloquear manualmente cada archivo, este puede ser un proceso agotador, especialmente si tiene que hacerlo para casi todos los archivos que descarga. En este artículo, le mostraremos cómo puede evitar que Windows 10 bloquee sus archivos descargados. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> ¿Qué es el Administrador de archivos adjuntos en Windows 10? </h2> <p> En Windows 10, hay una función de seguridad llamada Administrador de archivos adjuntos que le impide abrir archivos no seguros. Estos pueden ser archivos que haya descargado o <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> archivos que Windows identifica como adjuntos de correo electrónico no seguros </a> . Si el Administrador de archivos adjuntos considera que un archivo no es seguro, evita que Windows 10 lo abra y muestra un mensaje de advertencia. El Administrador de archivos adjuntos clasifica los archivos que descarga según el tipo de archivo y la extensión del nombre del archivo. </p> <p> El Administrador de archivos adjuntos de Windows utiliza la interfaz de programación de aplicaciones (API) IAttachmentExecute para encontrar el tipo de archivo, la asociación de archivos y determinar la acción más apropiada a tomar. Cuando descarga archivos y los guarda en su disco, Windows agrega metadatos específicos a estos archivos. Estos metadatos se consideran adjuntos. Cuando Windows agrega metadatos a los archivos de descarga como un archivo adjunto, esto se conoce como información de zona. </p> <p> Ahora el <strong> Información de zona </strong> es donde radica la raíz del asunto. Cuando el Explorador de archivos abre un archivo, lee la información de la Zona adjunta almacenada en la misma ubicación y verifica si el archivo proviene de una fuente desconocida o no. Si Windows descubre que el archivo no se reconoce o proviene de fuentes desconocidas, le impide abrirlo. </p> <p> Aparecerá una advertencia de Windows SmartScreen indicando: </p> <blockquote> <p> Windows SmartScreen impidió que se iniciara una aplicación no reconocida. La ejecución de esta aplicación puede poner en riesgo su PC. </p> </blockquote> <p> Si desea abrir manualmente un archivo bloqueado, haga clic con el botón derecho en el archivo descargado y luego seleccione <strong> Propiedades </strong> . En la pestaña General, haga clic en <strong> Desatascar </strong> , haga clic en <strong> Solicitar </strong> y luego haga clic en <strong> OK </strong> . </p> <p> Pero, imagine que tiene que hacer esto cada vez que descarga un archivo, eso puede resultar molesto y consumir mucho tiempo. Si a menudo descarga archivos de Internet o recibe archivos como archivos adjuntos de correo electrónico, es posible que desee evitar completamente que su PC bloquee sus archivos. </p> <p> Para evitar que Windows 10 le impida abrir sus archivos, debe evitar que agregue información de zona a los archivos que descarga. Puede hacerlo configurando el Administrador de archivos adjuntos manualmente utilizando el Editor de políticas de grupo local o el Editor del registro. </p> <p> Le proporcionaremos los pasos para hacerlo. Debe iniciar sesión como administrador o debe <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> solicitar derechos de administrador </a> para poder evitar que se bloqueen los archivos descargados. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Configurar el Administrador de archivos adjuntos mediante el Editor del registro </h2> <p> presione el <strong> Tecla de Windows + R </strong> para abrir el Editor del registro. Desde allí, escriba &quot;Regedit&quot; y haga clic en <strong> Ingresar </strong> . Aparecerá un mensaje de Control de cuentas de usuario. Cuando aparezca este mensaje, haga clic en el <strong> sí </strong> botón para continuar. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Navegue hasta la clave Adjuntos en el Editor del registro: <strong> HKEY_CURRENT_USER&gt; Software&gt; Microsoft&gt; Windows&gt; CurrentVersion&gt; Políticas&gt; Adjuntos </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> Si la clave Adjuntos no está dentro de la clave Políticas, tendrá que crearla. Para hacer esto, haga clic derecho en el <strong> Políticas </strong> clave, haga clic en <strong> Nuevo </strong> , haga clic en <strong> Clave </strong> . Esto creará una nueva clave, que luego debe nombrar &quot;Archivos adjuntos&quot;. Si encuentra que la clave Adjuntos ya está presente, puede pasar al siguiente paso. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> Haga clic derecho en el <strong> Archivos adjuntos </strong> clave, haga clic en <strong> Nuevo </strong> y luego seleccione <strong> Valor DWORD (32 bits) </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Se le pedirá que nombre este valor DWORD recién creado. Nómbrelo &quot;SaveZoneInformation&quot; y haga clic en <strong> Ingresar </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> Finalmente, para deshabilitar el Administrador de archivos adjuntos en Windows 10, haga doble clic en el recién creado <strong> SaveZoneInformation </strong> valor y cambie sus datos de valor a 1. Haga clic en <strong> OK </strong> para terminar. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Cuando complete estos pasos, cierre el Editor del Registro y reinicie su computadora para aplicar los cambios. A partir de aquí, cualquier archivo que descargue ya no adjuntará información de zona al flujo de datos alternativo del archivo. Esto le permitirá abrir sus archivos sin ninguna dificultad. </p> <p> Si desea volver atrás y habilitar el Administrador de archivos adjuntos, puede hacerlo navegando hasta la clave Archivos adjuntos en el Editor del registro: <strong> HKEY_CURRENT_USER&gt; Software&gt; Microsoft&gt; Windows&gt; CurrentVersion&gt; Políticas&gt; Adjuntos </strong> . Desde aquí, en el lado derecho, haga doble clic en el <strong> SaveZoneInformation </strong> value y cambie sus datos de valor a 3. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Configurar el administrador de archivos adjuntos mediante el editor de políticas de grupo local </h2> <p> El Editor de políticas de grupo local solo está disponible en las ediciones Windows 10 Enterprise, Education y Pro. Como resultado, este método no es aplicable si posee la edición Windows 10 Home. Si su PC funciona con la edición Windows 10 Home, deberá configurar el Administrador de archivos adjuntos a través del Editor del registro. </p> <p> Si está utilizando una edición de Windows 10 que tiene el Editor de políticas de grupo local, puede configurar el Administrador de archivos adjuntos siguiendo los pasos que se indican aquí. </p> <p> Para comenzar, presione <strong> Tecla de Windows + R </strong> , escriba &quot;gpedit.msc&quot; y haga clic en <strong> Ingresar </strong> para abrir el Editor de políticas de grupo local. </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Navegue hasta el Administrador de archivos adjuntos: <strong> Configuración de usuario&gt; Plantillas administrativas&gt; Componentes de Windows&gt; Administrador de archivos adjuntos </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> En el panel derecho del Administrador de archivos adjuntos, haga doble clic en el <strong> No conserve la información de la zona en archivos adjuntos </strong> política para editar la configuración de Información de zona. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> Aparecerá una ventana en la que puede elegir si el administrador de archivos adjuntos debe o no debe conservar la información de la zona. </p> <p> Hacer clic <strong> Activado </strong> para permitir que Attachment Manager no conserve la información de la zona. Esto asegurará que Windows no bloquee sus archivos cada vez que los abra. Haga clic en el <strong> Solicitar </strong> para guardar los cambios y luego haga clic en <strong> OK </strong> . </p> <p> Cuando termine, cierre el Editor de políticas de grupo local y reinicie su PC para guardar los cambios. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows ya no bloqueará sus archivos </h2> <p> Si anteriormente hubiera tenido que desbloquear manualmente la mayoría de los archivos que descargó, se habría dado cuenta de lo agotador que podría ser ese proceso. Una vez que aplique estos consejos, tendrá la libertad de abrir todos sus archivos con facilidad. </p> <p> Si descarga archivos y de alguna manera duda de su credibilidad, siempre puede abrirlos en entornos aislados y seguros para asegurarse de que su PC y sus datos estén seguros. </p>"}