{"title":"Cómo reproducir un video de YouTube","content":"<p> ¿Quieres hacer un bucle de un video de YouTube? Ya sea su canción favorita o una compilación divertida, no necesita volver a cargar la página si desea repetir un video de YouTube. </p> <p> Le mostraremos cómo reproducir un video de YouTube en computadoras de escritorio y dispositivos móviles. </p> <h2 id=\"how-to-loop-a-youtube-video-on-desktop\"> Cómo reproducir un video de YouTube en el escritorio </h2> <ol> <li> Vaya al video que desea reproducir. </li> <li> <strong> Botón derecho del ratón </strong> el video (no a su alrededor). Se abrirá el menú contextual de YouTube. </li> <li> Hacer clic <strong> Círculo </strong> . <p> <img alt=\"youtube video loop desktop\" src=\"images/youtube-video-loop-desktop-114.jpg\" loading=\"lazy\"> </p> </li> </ol> <p> Cuando el video llega al final, se repetirá automáticamente. Para confirmar que está habilitado, <strong> botón derecho del ratón </strong> el video y verá una marca junto a <strong> Círculo </strong> (que puede volver a hacer clic para desactivar). </p> <p> </p> <p> </p> <h2 id=\"how-to-loop-a-youtube-video-on-mobile\"> Cómo reproducir un video de YouTube en un dispositivo móvil </h2> <p> Desafortunadamente, reproducir un video de YouTube en la aplicación móvil no es tan sencillo como lo es en el escritorio. En su lugar, debe poner el video en una lista de reproducción. He aquí cómo hacer esto: </p> <ol> <li> Vaya al video que desea reproducir. </li> <li> Debajo del video, mantén presionado el <strong> Ahorrar </strong> botón. </li> <li> Grifo <strong> Nueva lista de reproducción </strong> . </li> <li> Ingrese un nombre para la lista de reproducción, elija un <strong> Intimidad </strong> ajuste y toque <strong> Crear </strong> . </li> <li> Grifo <strong> Ver lista </strong> para ir a la nueva lista de reproducción (o vaya a la pantalla de inicio de la aplicación, toque <strong> Biblioteca </strong> en el menú inferior e ingrese su lista de reproducción). </li> <li> Toque en el <strong> Barajar </strong> icono (dos flechas entrelazadas). <p> <strong class=\"gallery__section-title\"> Galería de imágenes (3 imágenes) </strong> <img alt=\"youtube android save\" src=\"images/youtube-android-save-686.jpg\" loading=\"lazy\"> Expandir <img alt=\"youtube android new playlist\" src=\"images/youtube-android-new-playlist-719.jpg\" loading=\"lazy\"> Expandir <img alt=\"youtube android repeat playlist\" src=\"images/youtube-android-repeat-playlist-472.jpg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> </li> <li> Reproduzca el video y toque la flecha en la esquina inferior derecha del video. Desde allí, toque el <strong> Círculo </strong> icono (dos flechas que forman un rectángulo). </li> </ol> <p> Cuando el video llega al final, se repetirá automáticamente. Por supuesto, también puede agregar varios videos a esta lista de reproducción. </p> <p> </p> <h2 id=\"how-to-use-an-external-service-to-loop-a-youtube-video\"> Cómo utilizar un servicio externo para reproducir un video de YouTube </h2> <p> Si no desea utilizar los métodos nativos anteriores por cualquier motivo, también puede utilizar un servicio externo llamado <a href=\"https://www.youtuberepeater.com\" target=\"_blank\" rel=\"nofollow noopener\"> Repetidor de YouTube </a> . </p> <p> Para usar esto fácilmente, vaya al video de YouTube que desea reproducir. En la barra de URL, reemplace <strong> youtube.com </strong> con <strong> youtuberepeater.com </strong> , luego vaya a esta nueva URL. </p> <p> Por ejemplo, si quisiera hacer un bucle <strong> youtube.com/watch?v=n9xhJrPXop4 </strong> , lo cambiarías a <strong> youtuberepeater.com/watch?v=n9xhJrPXop4 </strong> . </p> <p> Esto no funcionará en videos en los que la persona que subió el video no ha permitido que el video se incruste fuera de YouTube. Como tal, usar uno de los dos métodos anteriores es la opción ideal. </p>"}