{"title":"Cámara Sony FX3 revelada a través de una fuga de Twitter","content":"<p> Solo han pasado dos semanas desde que Sony anunció el lanzamiento de la Sony A1, una cámara de 8.6K que puede capturar imágenes de 50MP a hasta 30 fps. Pero, ¿la empresa está levantando algo más? </p> <p> Todo lo que tenemos ahora es mera especulación, pero Sony podría agregar una nueva cámara elegante y compacta a su serie FX. </p> <h2 id=\"a-preview-of-the-sony-fx3\"> Una vista previa de la Sony FX3 </h2> <p> El miércoles, Nokishita tuiteó una imagen de la Sony FX3, una cámara que podría estar buscando desafiar la EOS C70 de Canon y la Pocket Cinema 6K de Blackmagic Design. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> ソ ニ ー FX3 の 画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> # 噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> - 軒 下 デ ジ カ メ 情報 局 (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> 10 de febrero de 2021 </a></blockquote>  <p> Nokishita es un blog de tecnología japonés que es famoso por las filtraciones tempranas y precisas de los próximos equipos de fotografía y video. A pesar de no ser una fuente oficial para ninguna compañía de productos ópticos, algunas personas llegan a decir que la información compartida por Nokishita también podría estar confirmada. </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> TechRadar </a> Una vez llamó a Nokishita &quot;el Papá Noel de los rumores de las cámaras&quot;. En respuesta al tweet anterior, el usuario de Twitter @miemelaar preguntó &quot;¿[es] esto real o un concepto?&quot; y @rauuru_san respondió con &quot;si Nokishita lo publica, es el verdadero negocio&quot;. </p> <p> Pero incluso si asumiéramos que la filtración era cierta, ¿cuánta información nos deja eso realmente? </p> <p> Podríamos suponer que la FX3 es parte de la línea FX por su nombre, pero la cámara tiene un símbolo que deja confundidos a muchos especuladores. Si esa marca Alpha blanca (α) en la parte frontal de la cámara le parece familiar, es porque puede encontrar la misma en las cámaras sin espejo de Sony. </p> <p> Entonces, ¿la FX3 es una cámara de cine, una cámara sin espejo o algún tipo de híbrido estilo DSLR? Tendremos que esperar a que salgan más detalles. Hasta entonces, considere leer nuestro artículo sobre <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> diferencias clave entre cámaras sin espejo, DSLR y videocámaras </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> ¿Qué aportará la Sony FX3 a la mesa? </h2> <p> Desde que cayó el tweet de Nokishita, las supuestas especificaciones del producto de la cámara han estado volando por la web. Sin embargo, todavía no hay nada de ninguna fuente que sea igualmente confiable. </p> <p> Afortunadamente, deberíamos averiguar más sobre la Sony FX3 en las próximas semanas. El evento de fotografía más grande de Japón, CP + 2021, se realizará del 25 al 28 de febrero. </p>"}