{"title":"Cómo tomar una captura de pantalla en una tableta Surface Pro","content":"<p> Tomar una captura de pantalla es una habilidad simple pero esencial en cualquier dispositivo. En la tableta Surface Pro, puede tomar capturas de pantalla usando atajos de teclado, la herramienta de recorte o incluso la barra de juegos de Xbox. Le mostraremos cómo utilizar todos estos métodos para tomar una captura de pantalla o incluso una grabación de pantalla en su dispositivo Surface. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Tomar una captura de pantalla usando combinaciones de botones </h2> <p> En la línea de dispositivos Surface Pro, tomar una captura de pantalla usando combinaciones de botones es rápido y fácil. Para tomar una captura de pantalla, mantenga presionado el <strong> Energía </strong> y <strong> Sube el volumen </strong> clave al mismo tiempo. La pantalla debe parpadear y la captura de pantalla debe guardarse en la carpeta de captura de pantalla en Imágenes en su dispositivo. </p> <p> Este método funciona para la última línea de dispositivos Surface Pro (es decir, Surface Pro 7+, Pro X), Surface Go, Surface Go 2 y la línea de dispositivos Surface Book. </p> <p> Si su Surface es un modelo anterior (Surface 3 o anterior), la combinación de botones es un poco diferente. Tienes que presionar el <strong> Botón de Windows </strong> (no la tecla de Windows en su teclado) y la <strong> Bajar volumen </strong> botón al mismo tiempo. El dispositivo guardará su captura de pantalla en su carpeta de capturas de pantalla en Fotos. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> Del mismo modo, para tomar una captura de pantalla en Surface Duo, mantenga presionado el <strong> Energía </strong> botón y el <strong> Bajar volumen </strong> clave. La captura de pantalla debe guardarse en la galería de su dispositivo en Capturas de pantalla. Alternativamente, puede simplemente mantener presionado el <strong> Energía </strong> y haga clic en el <strong> Captura de pantalla </strong> botón en la pantalla. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> Cómo tomar una captura de pantalla de Surface Pro usando atajos de teclado </h2> <p> Los atajos de teclado son otra forma en que puede capturar lo que está en su pantalla. </p> <p> Estos atajos de teclado funcionan en todos los dispositivos Windows, así que echa un vistazo <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> otros métodos de captura de pantalla en Windows 10 </a> . Los atajos de teclado funcionan mejor en la línea de dispositivos Surface Laptop y Surface Book, pero, por supuesto, si tiene el accesorio de teclado para su dispositivo Surface Pro o Go, estos atajos también funcionan. </p> <h3 id=\"print-screen-methods\"> Métodos de pantalla de impresión </h3> <p> Para tomar una captura de pantalla usando el método Imprimir pantalla, simplemente presione el <strong> PrtScn </strong> botón en su teclado. Esto tomará una captura de pantalla de todo su escritorio. Tenga en cuenta que esto no guardará la captura de pantalla en su Surface, pero la agregará a su portapapeles. Tienes que usar un programa como Microsoft Paint para pegar la captura de pantalla. </p> <p> Prensado <strong> Alt + PrtScn </strong> tomará una captura de pantalla de su ventana actual solamente y de manera similar agregará la captura de pantalla a su portapapeles. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Recortar y dibujar </h3> <p> Este es, con mucho, el método más fácil de tomar una captura de pantalla en su dispositivo Surface. </p> <p> Para abrir Snip and Sketch, presione el <strong> Tecla de Windows + Mayús + S, </strong> y debería aparecer una superposición en su pantalla. Para tomar una captura de pantalla completa, presione el botón Pantalla completa en la parte superior de la superposición. Para tomar una captura de pantalla de su ventana actual, presione el botón Recorte de ventana junto al botón Pantalla completa. </p> <p> También puede tomar una captura de pantalla de un área específica de su pantalla. Por defecto, Snip and Sketch tiene el Rectangular Snip. Simplemente arrastre sobre la parte que desea capturar usando su pantalla táctil o su trackpad. </p> <p> Snip and Sketch te dará una notificación en tu panel de notificaciones para decir que tu captura de pantalla se copió en tu portapapeles. Si hace clic en él, puede dibujar y esbozar una captura de pantalla si lo desea. </p> <p> Para guardarlo en sus archivos, use <strong> Ctrl + S </strong> o el botón Guardar en la esquina superior derecha para guardar su captura de pantalla en una carpeta específica. </p> <h3 id=\"xbox-game-bar\"> Barra de juegos de Xbox </h3> <p> Para tomar una captura de pantalla con la barra de juegos de Xbox, presione el <strong> Tecla de Windows + G </strong> Para abrirlo. </p> <p> Desde allí, puede hacer clic en la pestaña Capturas y hacer clic en el Botón de cámara. Este método también le permitirá tomar una captura de video de su pantalla con audio. Sus capturas guardadas aparecerán en la carpeta Videos y la subcarpeta Capturas. En una Xbox, también puedes <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> capturar capturas de pantalla y grabaciones </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Tomar una captura de pantalla de Surface Pro con el lápiz para Surface </h2> <p> Para tomar una captura de pantalla con el Lápiz para Surface, simplemente haga doble clic en el borrador y su dispositivo debería mostrar Recorte y boceto de toda la ventana. Desde aquí, puede dibujar y exportar su captura de pantalla. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> También puede acceder a esto buscando Windows Ink Workspace en su base. Desde aquí, seleccione Recorte de pantalla completa. Puede modificar lo que hacen los accesos directos de los botones de su Surface Pen buscando Configuración del espacio de trabajo de Windows Ink y desplazándose hacia abajo hasta el Espacio de trabajo de Windows Ink. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Hacer una captura de pantalla en Surface, simplificado </h2> <p> Ahora conoce todos los métodos para tomar una captura de pantalla o grabar la pantalla en su dispositivo Surface. Las combinaciones de botones son la mejor forma táctil de tomar una captura de pantalla si estás usando Surface Pro o Surface Go, pero los atajos de teclado también son fáciles. </p>"}