{"title":"Cómo utilizar la aplicación Apple Watch Workout","content":"<p> Comprender mejor su progreso físico está a solo un toque de distancia con el Apple Watch. </p> <p> Estamos analizando todo lo que la aplicación Apple Watch Workout tiene para ofrecer, incluido cómo funciona la aplicación, qué tipos de entrenamiento puede rastrear y cómo ver toda la información que recopila. </p> <h2 id=\"getting-started-with-the-workout-app\"> Introducción a la aplicación Workout </h2> <p> Puede abrir la aplicación Workout en un Apple Watch de varias formas. Primero, haga clic una vez en el <strong> Corona digital </strong> para que aparezca la lista de aplicaciones en su reloj. Luego seleccione <strong> Ejercicio </strong> . </p> <p> Una forma aún más rápida es usar Siri, ya sea presionando prolongadamente el <strong> Corona digital </strong> o llevándose el reloj a la boca. Luego, solo di &quot;Abre la aplicación Workout&quot;. </p> <p> Después de abrir la aplicación, verá una amplia variedad de tipos de ejercicios, desde tiro con arco hasta yoga y todo lo demás. </p> <p> La pantalla principal de selección de entrenamiento está resaltada por las opciones más populares. Desplácese hasta el final de la lista y seleccione <strong> Agregar entrenamiento </strong> para ver una lista de otros tipos de ejercicios. Si por alguna razón no ve su tipo de entrenamiento, también puede seleccionar <strong> Otro </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> Puede seleccionar el <strong> tres puntos </strong> ( <strong> ... </strong> ) en cada tipo de entrenamiento para establecer un objetivo particular de distancia, calorías quemadas o tiempo. Si alguno de esos objetivos no le interesa, simplemente toque el nombre del entrenamiento para comenzar de inmediato. </p> <p> Habrá una cuenta regresiva de tres segundos en la pantalla antes de que comience el seguimiento. </p> <p> Todas las funciones de la aplicación Workout están disponibles sin un iPhone cerca o simplemente usando un Apple Watch conectado a una señal de Wi-Fi o celular. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Comprender la aplicación de entrenamiento </h2> <p> Hay tres pantallas principales en la aplicación. Puede cambiar entre ellos deslizando el dedo hacia la izquierda o hacia la derecha. </p> <p> La pantalla principal mostrará todo su progreso en el tipo de entrenamiento que ha seleccionado. Verá el tiempo de entrenamiento, las calorías activas, el total de calorías y la frecuencia cardíaca actual. Dependiendo de su tipo de entrenamiento, también puede ver la distancia recorrida. </p> <p> Si tiene un Apple Watch Series 5 o posterior y tiene la pantalla siempre encendida habilitada, siempre puede ver las estadísticas de su entrenamiento. Cualquiera con un modelo anterior deberá levantar o tocar la pantalla para ver esta información. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Cuando corres o caminas, el Apple Watch te dará un toque suave cada milla o kilómetro y mostrará una actualización con información sobre el ritmo. Se producirá un resumen de ciclismo y un toque cada cinco millas o kilómetros. </p> <p> Si está haciendo un entrenamiento Apple Fitness +, puede ver datos tanto en la aplicación Workout como en la pantalla del iPhone, iPad o Apple Watch. </p> <p> </p> <p> Deslizar el dedo hacia la derecha desde la pantalla principal le mostrará cuatro opciones diferentes: <strong> Cerrar con llave </strong> , <strong> Nuevo </strong> , <strong> Final </strong> , y <strong> Pausa </strong> . </p> <p> Seleccionar <strong> Cerrar con llave </strong> bloqueará la pantalla para evitar toques accidentales. Puede girar la corona digital para desbloquear la pantalla. Solo para tener en cuenta, esta opción se activará automáticamente durante cualquier tipo de entrenamiento de natación para evitar golpes accidentales de gotas de agua. </p> <p> Como probablemente puedas adivinar, <strong> Nuevo </strong> finaliza el entrenamiento actual y le permite elegir un nuevo tipo de ejercicio para comenzar de nuevo. Seleccionar <strong> Final </strong> terminará el entrenamiento actual. </p> <p> Si alguna vez lo interrumpen, puede seleccionar el <strong> Pausa </strong> botón. Si lo presiona de nuevo, se iniciará el seguimiento del entrenamiento. También puede hacer esto presionando la corona digital y el botón lateral simultáneamente. </p> <p> Al deslizar el dedo hacia la izquierda desde la pantalla principal de entrenamiento, se muestran los controles de reproducción de medios. Esa es una manera fácil de acceder a su música o cualquier otra cosa que esté escuchando mientras hace ejercicio. Puede omitir pistas, reproducir, pausar y subir o bajar el volumen. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Recordatorios automáticos de entrenamiento </h2> <p> No hay necesidad de preocuparse si se olvida de comenzar un entrenamiento. Siempre que tenga watchOS 5 o posterior, un Apple Watch puede reconocer automáticamente cuando está haciendo ejercicio. Te tocará la muñeca y te preguntará si deseas grabar un entrenamiento, lo que te permitirá cambiar el tipo de entrenamiento, silenciar estas notificaciones del día o simplemente descartar esta notificación. </p> <p> Si bien la notificación puede tardar unos minutos en aparecer, todo el crédito de entrenamiento aún se guarda. </p> <p> Puede recibir recordatorios de ejercicios para los siguientes tipos de ejercicios: caminata en interiores, caminata al aire libre, carrera en interiores, carrera al aire libre, elíptica, remo, natación en piscina y natación en aguas abiertas. </p> <p> Para activar o desactivar la función, dirígete a <strong> Configuración&gt; Entrenamiento&gt; Recordatorio de inicio de entrenamiento </strong> en tu Apple Watch. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> El Apple Watch también puede detectar cuándo se completa un entrenamiento. Después de un toque, verá una notificación en pantalla con opciones para finalizar o pausar el entrenamiento. También puede descartar completamente la notificación y continuar con el entrenamiento. </p> <p> Cambie la función dirigiéndose a su Apple Watch y yendo a <strong> Configuración&gt; Entrenamiento&gt; Recordatorio de finalización del entrenamiento </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Personalice los datos que se muestran en la aplicación Workout </h2> <p> En la vista de entrenamiento de Apple Watch, puede personalizar la información que se muestra en la pantalla para muchos tipos de entrenamiento diferentes. </p> <p> Para comenzar, abra la aplicación complementaria Watch en su iPhone. En el <strong> Mi reloj </strong> pestaña seleccionar <strong> Ejercicio </strong> . Entonces escoge <strong> Vista de entrenamiento </strong> . En la parte superior de la página, puede seleccionar si desea mostrar una o varias métricas en pantalla durante un entrenamiento. Si seleccionas <strong> Métrica única </strong> , simplemente desplácese por Digital Crown para ver más datos en su Apple Watch. </p> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (3 imágenes) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Expandir <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Expandir <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> Debajo de eso, también puede ver varios tipos de entrenamiento diferentes donde puede editar la información que se muestra en la pantalla. Seleccione un tipo de entrenamiento y luego elija <strong> Editar </strong> en la parte superior derecha de la pantalla para personalizar lo que se muestra en la pantalla y en qué orden. </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Visualización de datos de entrenamiento en la aplicación Fitness </h2> <p> Una vez que haya terminado con un entrenamiento, todos los datos están a solo unos toques de distancia en su iPhone. </p> <p> Para verlo, abre el <strong> Aptitud física </strong> aplicación. </p> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (2 imágenes) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> Bajo la <strong> Resumen </strong> pestaña, seleccione <strong> Entrenamientos </strong> . Verás información sobre todos tus entrenamientos. Los datos también están disponibles en el <strong> Salud </strong> aplicación. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Romper a sudar con la aplicación Apple Watch Workout </h2> <p> Como puede ver, la aplicación Apple Watch Workout es una excelente manera de ayudar a realizar un seguimiento de todas sus diferentes métricas de condición física mientras hace de todo, desde nadar hasta bailar y mucho más. </p> <p> Y cuando esté listo para terminar la noche y acostarse, su Apple Watch puede ser de gran ayuda con la función de seguimiento del sueño incorporada. </p>"}