{"title":"Cómo personalizar el indicador zsh en la terminal macOS","content":"<p> Desde la actualización a la versión 10.15 de Catalina, macOS incluye Z shell (zsh) de forma predeterminada en lugar de Bash en la aplicación Terminal. Dicho esto, todavía obtienes la misma ventana negra con texto blanco dentro de la Terminal. Las cosas no tienen por qué seguir así. </p> <p> Puede arreglar el indicador zsh para que sea mínimo y aprovechar al máximo el espacio. Le mostraremos cómo personalizar el indicador zsh en la aplicación Terminal para que se destaque en el fondo que elija. </p> <h2 id=\"basics-of-the-zsh-prompt\"> Conceptos básicos del indicador zsh </h2> <p> Cuando inicia la aplicación Terminal, muestra información útil, como su último inicio de sesión y el símbolo del sistema. Así es como suele verse el mensaje de forma predeterminada. </p> <pre><code class=\"hljs ruby\">Last login: Wed Feb 3 22:00:40 on console<br>samir@MacBook-Air ~ %</code></pre> <p> El indicador zsh muestra una cadena de texto que consta de su nombre de usuario y el modelo de la computadora, como MacBook Air, MacBook Pro, Mac Mini, etc. La tilde (~) indica la ubicación de la solicitud en el directorio de inicio. </p> <p> <img alt=\"Default View of zsh prompt\" src=\"images/default-view-of-zsh-prompt-685.jpg\" loading=\"lazy\"> </p> <p> </p> <p> </p> <h2 id=\"create-a-z-shell-profile-to-store-all-settings\"> Cree un perfil de Z Shell para almacenar todas las configuraciones </h2> <p> Por lo general, tienes que jugar con los archivos del sistema para cambiar el aspecto predeterminado. Esto se debe a que las actualizaciones de macOS restablecen todos los archivos del sistema a los valores predeterminados y perderá todos los cambios que realice. </p> <p> De modo que puede crear un archivo de configuración específico, conocido como dotfile, para que su perfil zsh almacene todos los cambios y configuraciones que desee en el indicador zsh. </p> <p> Bueno, no encontrará este archivo de puntos de forma predeterminada en macOS, por lo que tendrá que crear uno. Se recomienda crear un nuevo perfil .zshrc para almacenar todas las configuraciones, como se ve y se comporta el indicador zsh. </p> <p> A continuación, se explica cómo crear el perfil zsh (dotfile): </p> <p> 1. Abrir <strong> Terminal </strong> aplicación. </p> <p> 2. Escriba el siguiente comando y presione la tecla Retorno. </p> <pre><code class=\"hljs\">touch ~/.zshrc</code></pre> <p> Eso creará un perfil .zshrc en el directorio de inicio de su cuenta de usuario. Puede verlo en la ruta / Usuario // en el Finder si ha habilitado la visualización de archivos ocultos del sistema. </p> <p> Después de eso, el perfil zsh estará disponible para el inicio de sesión y los shells interactivos cada vez que inicie Terminal. Sin embargo, no estará activo en las sesiones SSH. </p> <p> Todos los cambios que desee realizar en el indicador zsh se pueden incluir en este perfil. </p> <p> </p> <h2 id=\"customize-the-zsh-prompt-in-terminal\"> Personalizar el indicador zsh en la terminal </h2> <p> Por lo general, el indicador zsh predeterminado contiene información como el nombre de usuario, el nombre de la máquina y la ubicación, comenzando en el directorio de inicio del usuario. Estos detalles se almacenan en el archivo de sistema del shell zsh en la ubicación / etc / zshrc. </p> <pre><code class=\"hljs perl\">PS1=\"%n@%m %1~ %#\"</code></pre> <p> En esta cadena de variables: </p> <ul> <li> % n es el nombre de usuario de su cuenta. </li> <li> % m es el nombre del modelo de MacBook. </li> <li> El símbolo% 1 ~ significa la ruta del directorio de trabajo actual donde ~ elimina la ubicación del directorio $ HOME. </li> <li> % # significa que el indicador mostrará # si el shell se está ejecutando con privilegios de root (administrador), u ofrece% si no lo hace. </li> </ul> <p> Para realizar cualquier cambio en el mensaje zsh predeterminado, tendrá que agregar valores relevantes para que el mensaje aparezca de manera diferente al predeterminado. </p> <p> He aquí cómo hacerlo. Abierto <strong> Terminal </strong> , escriba el siguiente comando y presione enter. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Estará en blanco si accede a él por primera vez. Puede agregar una nueva línea con el texto PROMPT = &#39;...&#39; e incluir valores relevantes en las elipses. </p> <p> Para una modificación simple del indicador zsh, puede escribir estos valores en el perfil .zshrc. </p> <pre><code class=\"hljs ruby\">PROMPT='%n~$'</code></pre> <p> Pegar <strong> Ctrl + O </strong> para confirmar la realización de esos cambios en el archivo, y luego presione <strong> Ctrl + X </strong> para salir del editor nano. </p> <p> <img alt=\"Use only the username in the zsh prompt\" src=\"images/use-only-the-username-in-the-zsh-prompt-531.jpg\" loading=\"lazy\"> </p> <p> Abra una nueva <strong> Terminal </strong> ventana para confirmar y ver los cambios que acaba de realizar. Su nuevo indicador zsh mostrará el nombre de usuario de su mac, el directorio de inicio y el símbolo $ al final. </p> <p> </p> <h2 id=\"add-date-and-time-in-the-zsh-prompt\"> Agregar fecha y hora en el indicador zsh </h2> <p> Además de su nombre de usuario, puede agregar la fecha u hora actual para que no tenga que apartar la mirada de la ventana de Terminal activa para verificar esa información. </p> <p> Inicie la Terminal y abra el perfil .zshrc. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Para incluir la fecha en el mensaje, puede usar% D para que la fecha aparezca en formato aa-mm-dd o% W para que aparezca en formato mm / dd / aa. Entonces el nuevo mensaje aparecerá como </p> <pre><code class=\"hljs ruby\">PROMPT='%n:%W:~$'</code></pre> <p> <img alt=\"How to add date to the zsh prompt\" src=\"images/how-to-add-date-to-the-zsh-prompt-245.jpg\" loading=\"lazy\"> </p> <p> Si desea incluir la hora del sistema en el indicador zsh, agregue% T para la hora actual en formato de 24 horas,% t para que la hora aparezca en formato am / pm o 12 horas, o use% * para mostrar la la hora en formato de 24 horas junto con los segundos. </p> <pre><code class=\"hljs ruby\">PROMPT='%n:%T:~$'</code></pre> <p> <img alt=\"How to show Time on the zsh prompt\" src=\"images/how-to-show-time-on-the-zsh-prompt-258.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-color-to-text-in-the-zsh-prompt\"> Agregar color al texto en el indicador zsh </h2> <p> ¿Estás aburrido con el texto blanco del indicador zsh? Aparte de <a href=\"https://www.makeuseof.com/tag/customize-mac-terminal/\" target=\"_blank\" rel=\"nofollow noopener\"> modificar la aplicación Terminal </a> con colores, puede agregar algo de color al texto para obtener un buen descanso visual. </p> <p> Lanzamiento <strong> Terminal </strong> y abra el perfil .zshrc. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> El zsh admite colores y tonos de gris en el texto del mensaje de modo que complemente el fondo. Puede elegir un color de primer plano (texto) entre negro, blanco, amarillo, verde, rojo, azul, cian y magenta. </p> <p> He aquí cómo utilizarlos. </p> <pre><code class=\"hljs ruby\">PROMPT='%F{cyan}%n%f:~$'</code></pre> <p> <img alt=\"How to add color the zsh prompt\" src=\"images/how-to-add-color-the-zsh-prompt-993.jpg\" loading=\"lazy\"> </p> <p> Si desea elegir un tono específico, puede elegir entre 0 y 256 colores de 8 bits que admite la Terminal. A continuación, se explica cómo utilizar los valores numéricos de los colores. </p> <pre><code class=\"hljs ruby\">PROMPT='%F{51}%n%f:~$'</code></pre> <p> Debe colocar las variables de color de primer plano predeterminadas% F y% f entre el texto relevante que desea colorear. </p> <p> </p> <h2 id=\"adding-visual-effects-in-the-zsh-prompt\"> Adición de efectos visuales en el indicador zsh </h2> <p> Si colorear el texto del mensaje no es suficiente, puede resaltar su mensaje zsh para que se destaque en medio de la pared de texto y pueda identificarlo fácilmente. Para empezar, puede poner en negrita el indicador zsh. </p> <pre><code class=\"hljs ruby\">PROMPT='%B%F{51}%n%f%b:~$'</code></pre> <p> Agregar% B al principio y poner% b al final entre el texto relevante lo pondrá en negrita. </p> <p> <img alt=\"How to bold text in the zsh prompt text\" src=\"images/how-to-bold-the-zsh-prompt-text-261.jpg\" loading=\"lazy\"> </p> <p> Del mismo modo, puede poner% S al principio y% s al final para resaltar el texto. El resaltado tendrá el mismo color que ha elegido para aparecer entre las variables% S y% s. </p> <pre><code class=\"hljs ruby\">PROMPT='%S%F{51}%n%f%s:~$'</code></pre> <p> <img alt=\"How to Highlight the zsh prompt\" src=\"images/how-to-highlight-the-zsh-prompt-422.jpg\" loading=\"lazy\"> </p> <p> También puede subrayar el texto del indicador zsh. Para agregar un subrayado a un mensaje, puede incluir la variable% U al principio y% u al final del texto relevante. </p> <pre><code class=\"hljs ruby\">PROMPT='%U%F{51}%n%f%u:~$'</code></pre> <p> <img alt=\"How to Underline the zsh prompt\" src=\"images/how-to-underline-the-zsh-prompt-962.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-last-login-details-from-the-zsh-prompt\"> Eliminar los detalles del último inicio de sesión del indicador zsh </h2> <p> Ocultar o deshabilitar la línea superior que revela la última hora de inicio de sesión en la aplicación Terminal puede darle a su mensaje zsh un aspecto más limpio. Puede utilizar el siguiente comando para ocultar esa información. </p> <pre><code class=\"hljs\">touch ~/.hushlogin</code></pre> <p> La próxima vez que abra la Terminal, no verá nada encima del indicador zsh. </p> <p> </p> <h2 id=\"spice-up-the-zsh-prompt-in-terminal\"> Dale sabor al indicador zsh en la terminal </h2> <p> Incluso si ocasionalmente usa la aplicación Terminal en macOS, puede modificar la forma en que aparece el mensaje zsh allí. Puede resaltar, subrayar, acortar e incluso incluir la fecha y la hora. </p> <p> Ahora que ha comenzado a personalizar el indicador zsh, experimente un poco y hágalo suyo. </p>"}