{"title":"Cómo administrar grupos de usuarios con Groupadd en Linux","content":"<p> La administración de usuarios es bastante sencilla si está ejecutando Linux en su computadora personal. Pero, para aquellos que tienen un servidor con miles de usuarios, la administración se convierte en un tema serio que debe ser atendido. </p> <p> Afortunadamente, los sistemas operativos basados ​​en Linux le brindan una forma de controlar y administrar usuarios en su sistema. Puede crear grupos y agregarles usuarios. Luego, en lugar de asignar permisos a todos los usuarios del sistema, puede autorizar fácilmente los grupos de usuarios proporcionándoles privilegios asociados con el flujo de trabajo del sistema. </p> <h2 id=\"create-user-groups-on-linux\"> Crear grupos de usuarios en Linux </h2> <p> Linux viene con un comando predeterminado para crear grupos de usuarios. Puedes usar el <strong> groupadd </strong> comando para agregar nuevos grupos a su sistema. La sintaxis básica del comando es: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> Para crear un nuevo grupo de usuarios &#39;escritores&#39;: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> Ejecutar el comando mencionado anteriormente agregará una nueva entrada al <strong> / etc / group </strong> y <strong> / etc / gshadow </strong> archivos en su sistema. Puede verificar la nueva entrada de grupo en los archivos escribiendo <strong> gato / etc / group </strong> y <strong> gato / etc / gshadow </strong> en tu terminal. </p> <p> Tenga en cuenta que solo los usuarios con permisos administrativos pueden crear grupos de usuarios. No olvide cambiar a superusuario antes de ejecutar el comando groupadd. </p> <p> Si intenta crear un grupo con un nombre que ya existe, verá un error que dice: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> Sin embargo, puede descartar el error utilizando el <strong> -F </strong> o <strong> --fuerza </strong> bandera con el comando. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Crear grupos de usuarios con GID único </h3> <p> Cuando crea un nuevo grupo de usuarios, el sistema le asigna automáticamente un ID de grupo o GID. Si desea que su grupo tenga un ID de grupo específico, puede hacerlo usando el <strong> -gramo </strong> o <strong> --gid </strong> bandera. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Si intenta asignar un ID de grupo que ya está en uso, se producirá el siguiente error. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Aunque no es recomendable pero puedes agregar el <strong> -o </strong> o <strong> --no único </strong> bandera para asignar a la fuerza el ID de grupo. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Crear grupos de usuarios con contraseña </h3> <p> Aunque puede agregar una contraseña a sus grupos, no son de utilidad práctica para un usuario. La <strong> -pag </strong> flag le permite especificar una contraseña para su grupo de usuarios. </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Crear grupos de sistemas en Linux </h3> <p> Existe una ligera diferencia entre los grupos del sistema y los grupos regulares. Los grupos de sistemas son grupos especiales que incluyen a los usuarios responsables de realizar las operaciones del sistema, como la copia de seguridad y el mantenimiento. </p> <p> Utilizar el <strong> -r </strong> o <strong> --sistema </strong> bandera para crear un grupo de sistemas en Linux: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Obtener lista de miembros en un grupo de usuarios </h3> <p> Para saber cuántos miembros forman parte de un grupo específico, puede utilizar el <strong> getent </strong> comando desde su terminal. El siguiente comando mostrará una lista de todos los miembros presentes en el grupo &#39;escritores&#39;: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Agregar usuarios a grupos </h2> <p> Ahora que ha creado un grupo de usuarios en su sistema, es hora de agregarle algunos usuarios. Usermod es una poderosa utilidad de línea de comandos, ya que contiene varias opciones asociadas con la administración y moderación de usuarios. También le permite agregar usuarios a su grupo fácilmente. La sintaxis básica del comando es: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Agregar un usuario existente a grupos </h3> <p> Si desea agregar un usuario existente a su grupo, el <strong> -a </strong> y <strong> -GRAMO </strong> banderas son lo que necesitas. La <strong> -GRAMO </strong> bandera representa grupos, mientras que la <strong> -a </strong> significa anexar, agregar o agregar. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> También puede agregar un usuario a varios grupos. Todo lo que tiene que hacer es ingresar los nombres de los grupos separados por comas. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Agregar un nuevo usuario a un grupo </h3> <p> Puedes usar el <strong> useradd </strong> comando cuando quieras <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> agregue un nuevo usuario a su sistema Linux </a> . Useradd le proporciona una forma de asignar un grupo al usuario en el momento de su creación. La <strong> -GRAMO </strong> flag le permite especificar un grupo para el usuario. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <p> Agregar un usuario a varios grupos también es fácil. Simplemente pase los nombres de los grupos separados por comas en el comando predeterminado. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Eliminar usuarios de un grupo </h2> <p> También puede eliminar usuarios de un grupo utilizando <strong> usermod </strong> . Tenga en cuenta que en un sistema Linux, se pueden asignar varios grupos a un usuario. Uno de esos grupos se declara como grupo primario, mientras que otros se denominan grupos secundarios. </p> <p> Si está intentando eliminar a un usuario de un grupo, asegúrese de que tenga al menos un grupo principal después de la eliminación. Por ejemplo, el usuario &quot;aleatorio&quot; es parte de los grupos de administradores, escritores y editores; donde admin es el grupo principal y el resto son grupos secundarios. </p> <p> Solo puede eliminar al usuario del grupo de redactores y editores. Y para hacerlo, debe pasar el nombre del grupo del que desea que el usuario siga siendo miembro. Esto significa que, para eliminar el usuario &#39;aleatorio&#39; de los editores de grupo, se utiliza el siguiente comando: </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> Observe que todo lo que tenía que hacer era quitarle el <strong> añadir bandera (-a) </strong> del comando que usa para agregar un usuario a un grupo. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Eliminar grupos en Linux </h2> <p> Cuando ya no desee mantener un grupo de usuarios en su sistema, puede eliminar el grupo usando el <strong> groupdel </strong> mando. La sintaxis del comando es: </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> Para eliminar el grupo de usuarios &#39;escritores&#39;: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Si intenta eliminar un grupo que no existe, recibirá un error que indica: </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Administrar grupos de usuarios en Linux </h2> <p> La gestión de usuarios puede resultar complicada si no conoce los comandos de Linux que necesita utilizar. Se vuelve realmente fácil una vez que conoces la entrada y salida de los comandos relacionados con la moderación y la gestión. </p> <p> Los administradores de servidores deben intentar utilizar distribuciones de Linux que se adapten bien a sus necesidades. De esta manera, obtendrán todas las herramientas y utilidades necesarias para la administración del servidor de inmediato. </p>"}