{"title":"Cómo enviar y recibir mensajes de texto en su iPad","content":"<p> ¿Estás cansado de tener que mantener tu iPhone a tu lado para asegurarte de no perderte ningún mensaje de texto importante? Afortunadamente, existe una forma sencilla de configurar tu iPad para enviar y recibir mensajes de texto. </p> <p> Con iCloud, Apple ofrece una opción fácil para sincronizar sus mensajes de texto desde su iPhone a su iPad, lo que le permite enviar y recibir mensajes desde cualquier dispositivo. Los siguientes pasos lo configurarán para hacerlo en poco tiempo. </p> <h2 id=\"before-you-begin\"> Antes de que empieces </h2> <p> Debe asegurarse de tener acceso a ambos dispositivos, ya que deberá ajustar la configuración para <a href=\"https://www.makeuseof.com/tag/how-to-sync-iphone-and-ipad/\" target=\"_blank\" rel=\"nofollow noopener\"> sincroniza tu iPhone y iPad juntos </a> . </p> <p> Además, su iPhone deberá estar encendido y conectado a una red Wi-Fi o celular. Esto se debe a que los mensajes de texto que envíe desde su iPad pasarán por el iPhone. </p> <p> También debe asegurarse de haber iniciado sesión en iMessage con el mismo ID de Apple en ambos dispositivos. Hágalo con los siguientes pasos: </p> <ol> <li> Abre el <strong> Ajustes </strong> aplicación. </li> <li> Grifo <strong> Inicie sesión en su [dispositivo] </strong> . </li> <li> Ingrese su nombre de usuario y contraseña de Apple ID. </li> <li> Si se le solicita, ingrese el <strong> código de verificación de seis dígitos </strong> enviado a su dispositivo de confianza o número de teléfono y complete el inicio de sesión. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (3 imágenes) </strong> <img alt=\"Opening Settings on iPhone\" src=\"images/settings-icon-1-698.jpg\" loading=\"lazy\"> Expandir <img alt=\"Signing into iCloud Account on iPhone\" src=\"images/sign-into-icloud-account-1-448.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple ID Verification Code\" src=\"images/icloud-verification-code-400.jpg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> Ahora que tiene sus dispositivos y ha iniciado sesión con el mismo ID de Apple, está listo para comenzar. </p> <p> </p> <p> </p> <h2 id=\"step-1-set-up-your-iphone\"> Paso 1. Configura tu iPhone </h2> <p> Primero debe asegurarse de que su iPhone esté configurado para permitir el reenvío de mensajes. Así es cómo: </p> <ol> <li> Abierto <strong> Ajustes </strong> en tu iPhone. </li> <li> Seleccione <strong> Mensajes </strong> . </li> <li> Encender <strong> iMessage </strong> con el conmutador si aún no está activado. </li> <li> Siguiente seleccione <strong> Reenvío de mensajes de texto </strong> . </li> <li> Elige cuál <strong> dispositivos </strong> puede enviar y recibir mensajes de texto desde su iPhone. </li> <li> Si no está utilizando la autenticación de dos factores para su ID de Apple, <strong> código de verificación </strong> aparece en cada uno de sus otros dispositivos: ingrese ese código en su iPhone. Si está utilizando la autenticación de dos factores, puede omitir este paso. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (3 imágenes) </strong> <img alt=\"Turn on Text Message Forwarding on iPhone\" src=\"images/iphone-imessage-to-icloud-1-438.jpg\" loading=\"lazy\"> Expandir <img alt=\"Text Message Forwarding from an iPhone\" src=\"images/text-message-forwarding-from-iphone-234.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple ID Verification Code\" src=\"images/icloud-verification-code-439.jpg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> </p> <h2 id=\"step-2-set-up-your-ipad\"> Paso 2. Configura tu iPad </h2> <p> Cada mensaje que envía y recibe en su iPad se guarda en iCloud. Debes asegurarte de que Mensajes para iCloud esté activado para tu iPad. A continuación, le indicamos cómo hacerlo: </p> <ol> <li> Abierto <strong> Ajustes </strong> en tu iPad. </li> <li> Selecciona tu <strong> ID de apple </strong> nombre de la cuenta. </li> <li> Seleccione <strong> iCloud </strong> . </li> <li> Encender <strong> Mensajes </strong> . </li> </ol> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (2 imágenes) </strong> <img alt=\"Opening iCloud Settings on iPad\" src=\"images/opening-apple-id-settings-on-ipad-295.jpg\" loading=\"lazy\"> Expandir <img alt=\"Turn on Messages on iPad\" src=\"images/turn-on-messages-on-ipad-637.jpg\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> </p> <h2 id=\"texting-from-your-iphone-or-your-ipad-made-easy\"> Enviar mensajes de texto desde su iPhone o iPad de forma fácil </h2> <p> Ahora que tiene todo configurado, todo lo que necesita hacer es abrir la aplicación Mensajes en su iPad para ver todas sus conversaciones o comenzar una nueva como lo haría normalmente en el iPhone. </p> <p> Ya no tendrá que cargar con todos sus dispositivos para asegurarse de no perderse ningún mensaje de texto importante, siempre que su iPhone esté encendido y conectado a una red Wi-Fi o celular. </p>"}