{"title":"Cómo crear y vender ajustes preestablecidos de Lightroom: la guía definitiva","content":"<p> En estos días, editar fotos es tan importante como la toma que captura. Y una de las plataformas más populares para realizar postproducción es Adobe Lightroom. </p> <p> Muchos fotógrafos ahorran horas en el procesamiento de fotografías mediante la creación de ajustes preestablecidos. Pero más allá de permitirle editar fotos más rápido, también puede compartir sus ajustes preestablecidos con otros, ¡y potencialmente recibir un pago por hacerlo! </p> <p> En este artículo, aprenderá a crear ajustes preestablecidos con Lightroom y venderlos en línea. También descubrirás los mejores consejos para promocionar tu arte. </p> <h2 id=\"what-is-a-lightroom-preset\"> ¿Qué es un ajuste preestablecido de Lightroom? </h2> <p> Un ajuste preestablecido de Lightroom es una máscara que cambia el aspecto de su foto sin necesidad de ajustar todos los botones diferentes dentro de la aplicación. Se necesitan segundos para agregar a una foto y es genial cuando buscas una apariencia específica. </p> <p> Adobe tiene una variedad de ajustes preestablecidos listos para usar en las aplicaciones Lightroom Classic y Creative Cloud. Algunos de estos funcionan muy bien para imágenes, pero encontrará que muchos no se adaptan bien a su estilo único. </p> <p> Para abordar este problema, Adobe también permite a los usuarios crear sus propios ajustes preestablecidos. Luego, puede agregar esto a todas sus imágenes futuras para crear un estado de ánimo similar o un tema consistente. </p> <p> </p> <h2 id=\"how-to-create-a-lightroom-preset\"> Cómo crear un ajuste preestablecido de Lightroom </h2> <p> Crear un ajuste preestablecido de Lightroom es fácil. A continuación se muestra un tutorial paso a paso sobre cómo hacer esto: </p> <ol> <li> Abra la aplicación Lightroom Classic o Creative Cloud, según sus preferencias. </li> <li> Importe sus imágenes a Lightroom y realice las modificaciones que considere necesarias. </li> <li> Ve a la <strong> Preajustes </strong> pestaña en la parte inferior de la pantalla. </li> <li> Haga clic en los tres puntos en la parte superior derecha. Luego, toca <strong> Crear preajuste </strong> . </li> <li> Dale un nombre a tu preset y presiona <strong> Ahorrar </strong> . </li> </ol> <p> <img alt=\"save a preset in adobe lightroom\" src=\"images/save-preset-screenshot-132.png\" loading=\"lazy\"> </p> <p> Al editar sus fotos, es esencial asegurarse de que su postproducción no sea descuidada. </p> <p> </p> <h2 id=\"how-to-export-a-preset-in-lightroom\"> Cómo exportar un ajuste preestablecido en Lightroom </h2> <p> Después de guardar su ajuste preestablecido en Lightroom, es hora de exportarlo a su computadora o unidad de disco. Para hacer esto, siga estos pasos: </p> <ol> <li> Haga clic con el botón derecho en el ajuste preestablecido guardado y seleccione <strong> Exportar </strong> . <p> <img alt=\"Export Screenshot MUO\" src=\"images/muo-export-screenshot-114.png\" loading=\"lazy\"> </p> </li> <li> Elija dónde desea exportar el ajuste preestablecido. </li> <li> Confirme su elección haciendo clic en <strong> Exportar </strong> de nuevo. <p> <img alt=\"export lightroom preset to desktop\" src=\"images/export-preset-lightroom-746.png\" loading=\"lazy\"> </p> </li> </ol> <p> </p> <h2 id=\"where-can-you-sell-your-lightroom-presets\"> ¿Dónde puede vender sus ajustes preestablecidos de Lightroom? </h2> <p> Antes de vender sus ajustes preestablecidos, es una buena idea investigar sus opciones y elegir la que mejor se ajuste a sus necesidades. Aquí hay una lista de algunos lugares populares para vender ajustes preestablecidos de Lightroom, así como las ventajas y desventajas de usarlos. </p> <h3 id=\"your-own-website\"> Tu propio sitio web </h3> <p> Si planeas <a href=\"https://www.makeuseof.com/tag/best-website-builders-create-clean-online-portfolio/\" target=\"_blank\" rel=\"nofollow noopener\"> crear una página web </a> o ya posee uno, puede vender sus ajustes preestablecidos de Lightroom allí y quedarse con la mayor parte del dinero. </p> <p> Para vender sus ajustes preestablecidos en su sitio web, deberá crear una lista y averiguar cómo entregará el producto. La forma más sencilla de hacerlo es enviando un archivo o un enlace descargable cada vez que se realiza una compra. </p> <p> <strong> Ventajas de tener su propio sitio web: </strong> </p> <ul> <li> Las personas acuden específicamente a usted, lo que significa que no tiene que competir con otros en un mercado. </li> <li> No es necesario que pague tarifas de mercado, que pueden tener un impacto notable en sus ganancias con el tiempo. </li> <li> Te verás más profesional. </li> <li> Es probable que los usuarios confíen más en usted en su propio sitio web que en una tienda en un mercado en línea. </li> </ul> <p> <strong> Los contras de tener su propio sitio web: </strong> </p> <ul> <li> Si aún no tiene una gran audiencia en línea, es posible que tenga dificultades para atraer clientes de pago. </li> <li> Configurar su tienda requerirá tiempo y dinero. </li> <li> Necesitará aprender muchas otras habilidades, como SEO y marketing digital. </li> </ul> <p> <strong> Debería considerar vender ajustes preestablecidos en su sitio web si: </strong> </p> <ul> <li> Tener una presencia en línea de tamaño decente. </li> <li> Están dispuestos a aprender SEO y creación de sitios web. </li> </ul> <p> Incluso si aún no tiene una gran presencia en línea, es una buena idea cargar sus ajustes preestablecidos en su tienda en línea de todos modos. Luego, a medida que atraiga a más seguidores, ellos podrán comprar sus productos sin que usted tenga que hacer todo el trabajo de configuración más tarde. </p> <h3 id=\"online-creative-marketplaces\"> Mercados creativos en línea </h3> <p> Si no desea vender sus ajustes preestablecidos en su sitio web, puede elegir entre varios mercados en línea. </p> <p> Algunos de los mercados en línea más populares para creativos son: </p> <ul> <li> <a href=\"https://creativemarket.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Mercado creativo </a> </li> <li> <a href=\"https://www.etsy.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Etsy </a> </li> <li> <a href=\"https://exchange.adobe.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Exchange </a> </li> <li> <a href=\"https://sellfy.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Sellfy </a> </li> </ul> <p> <strong> Ventajas de los mercados online: </strong> </p> <ul> <li> No necesita preocuparse por el SEO, la creación de una audiencia o los enormes costos de configuración. </li> <li> Con el tiempo, sus ganancias se acumularán si es un vendedor exitoso. </li> </ul> <p> <strong> Los contras de los mercados online: </strong> </p> <ul> <li> Estos sitios web toman una parte considerable de sus ganancias. Por lo tanto, necesita vender más de lo que haría si usara su propio sitio web. </li> <li> No eres la única persona en ese sitio web. Si su estilo no es lo suficientemente único, no se destacará y nadie comprará sus productos. </li> </ul> <p> <strong> Los mercados online son buenos para: </strong> </p> <ul> <li> Usuarios sin experiencia en ventas en línea, pero que desean comprender cómo funciona el comercio electrónico. </li> <li> Fotógrafos sin mucho tiempo para montar su propia tienda online. </li> <li> Usuarios sin una gran audiencia online. </li> </ul> <p> </p> <h2 id=\"how-to-promote-your-presets\"> Cómo promocionar sus ajustes preestablecidos </h2> <p> Una vez que haya creado y cargado sus ajustes preestablecidos, es hora de que el mundo sepa sobre su trabajo. Hay una variedad de formas en las que puede promocionar sus ajustes preestablecidos. Aquí hay algunas opciones que puede probar. </p> <h3 id=\"1-youtube\"> 1. <a href=\"https://www.youtube.com/\" target=\"_blank\" rel=\"nofollow noopener\"> YouTube </a></h3> <p> Aunque crear un canal de YouTube lleva tiempo, la plataforma es excelente para difundir su mensaje como creativo. La audiencia ya está ahí, lo que significa que todo lo que necesitas hacer es descubrir cómo atraerla. </p> <p> </p> <p> Para promocionar sus ajustes preestablecidos en YouTube, primero deberá crear contenido valioso. Documente sus experiencias fotográficas y ofrezca consejos prácticos a otras personas que buscan tomar mejores fotografías. También puede hablar sobre cómo hizo su ajuste preestablecido y proporcionar tutoriales y consejos sobre cómo las personas pueden crear el suyo. </p> <h3 id=\"2-instagram\"> 2. <a href=\"https://www.instagram.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Instagram </a></h3> <p> <img alt=\"adobe lightroom presets instagram\" src=\"images/lightroom-instagram-598.jpg\" loading=\"lazy\"> </p> <p> Como es de esperar de una plataforma visual, Instagram es otro buen lugar para promocionar sus ajustes preestablecidos de Lightroom. La aplicación también ha dado un giro más hacia el comercio en línea en los últimos años, lo que ha dado lugar a que más creadores vendan sus productos allí. </p> <p> Al igual que con YouTube, deberá crear contenido útil antes de poder vender sus ajustes preestablecidos. Al cargar imágenes, hable sobre cómo las editó y tal vez incluso ofrezca consejos de fotografía. También puede discutir lo que aprendió y alentar a otros a unirse a la conversación. </p> <p> </p> <p> Además de las publicaciones estándar, piense en cómo puede usar Instagram Stories y Reels para su beneficio también. </p> <h3 id=\"telling-your-friends-and-family\"> 3. Decirle a sus amigos y familiares </h3> <p> <img alt=\"promote lightroom presets\" src=\"images/promote-presets-to-friends-343.jpg\" loading=\"lazy\"> </p> <p> ¿Tienes amigos y familiares que siempre se preguntan cómo se ven tan bien tus fotos? Bueno, lo sabrán tan pronto como hayan comprado tus ajustes preestablecidos. </p> <p> Al vender ajustes preestablecidos y otros elementos en línea, su círculo inmediato es un excelente lugar para comenzar. Incluso si no están demasiado interesados ​​en la fotografía, querrán apoyarte. O tal vez conozcan a alguien a quien le guste tomar fotografías y lo recomendarán. </p> <p> </p> <h2 id=\"share-your-art-with-the-world\"> Comparta su arte con el mundo </h2> <p> Los ajustes preestablecidos de Lightroom son una excelente manera de optimizar su flujo de trabajo fotográfico, pero también puede usar sus ediciones para ayudar a otros. Hay muchos lugares para vender ajustes preestablecidos de Lightroom en línea, cada uno con ventajas y desventajas únicas. </p> <p> Para vender con éxito sus ajustes preestablecidos en línea, asegúrese de que su estilo sea lo suficientemente único para que otros presten atención. Y antes de comenzar a presionar sus ajustes preestablecidos, recuerde proporcionar una gran cantidad de contenido gratuito. Entonces, la gente estará más dispuesta a comprar sus productos. </p>"}