{"title":"¿Cuál es la diferencia entre LAN y WAN en redes?","content":"<p> Si ha metido la nariz en las redes informáticas, es muy probable que haya encontrado los términos &quot;LAN&quot; y &quot;WAN&quot;. Sin embargo, ¿qué significa cada uno y cuáles son las diferencias cuando se compara una LAN con una WAN? </p> <p> Exploremos ambas tecnologías y dónde brilla cada una. </p> <h2 id=\"what-does-lan-stand-for\"> ¿Qué significa &quot;LAN&quot;? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> Crédito de la imagen: Drug Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Una LAN es una &quot;red de área local&quot;. Este término describe una red en la que todos los dispositivos conectados están cerca unos de otros. Todos están en un &quot;área local&quot;, de ahí el nombre. </p> <p> Cuando una computadora se conecta a una LAN, obtiene una dirección de protocolo de Internet (IP) local. Esto funciona de manera similar a la dirección IP que obtiene cuando se conecta. Sin embargo, una dirección IP local solo funciona para otras computadoras en la misma LAN que usted. No puede usar una IP local para conectarse a su PC a través de Internet, por ejemplo. </p> <p> Es probable que el borde físico de la LAN de su hogar no salga de su casa. Por supuesto, si lleva su teléfono o computadora portátil a su jardín para tomar aire fresco, todavía está en la LAN. Sin embargo, la mayoría de las veces, todos sus dispositivos conectados a la red están seguros dentro de las cuatro paredes de su hogar. </p> <p> Las empresas e institutos también fabrican LAN. Por ejemplo, una universidad puede conectar todas las PC de su biblioteca a una red para que puedan comunicarse entre sí. A las empresas también les gusta usar LAN porque les permite a los trabajadores enviarse archivos y correspondencia entre sí sin necesidad de conectarse a Internet. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> ¿Qué significa &quot;WAN&quot;? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Crédito de la imagen: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Por otro lado, tenemos la red de área amplia o WAN. Si está leyendo este artículo, ya está conectado a una WAN; nos gusta llamarlo Internet. </p> <p> El &quot;ancho&quot; en la red de área amplia es muy variable. Si se conecta a un servidor externo en la misma ciudad que usted, es una WAN. También se considera una WAN si se conecta a un servidor en un país del otro lado del planeta. </p> <p> Como tal, una WAN se usa generalmente para describir cualquier red a la que se conecte que exista más allá de su enrutador. No importa si el servidor está a una milla o un continente; todavía es &quot;ancho&quot;. </p> <p> Internet no es la única WAN que existe. Las empresas hacen un buen uso de las WAN para conectar oficinas que se encuentran en diferentes países. Por ejemplo, si una empresa tiene una oficina en Nueva York, Tokio y Sydney, puede contratar su propio sistema WAN para que puedan comunicarse entre sí. </p> <p> Pero espere un minuto; ¿Por qué las empresas crean su propia WAN cuando simplemente pueden conectar todo a Internet? El problema con esta solución es que la empresa tendrá que pagar las tarifas del ISP y, si algo sale mal, tendrá que luchar con dicho ISP para solucionarlo. </p> <p> No solo eso, sino que Internet está diseñado para conectarse a muchas PC en todo el mundo. Si una empresa solo quiere que sus PC se conecten a otras PC de oficina, pueden usar su propia WAN para protegerse de las amenazas en línea. Esto se denomina &quot;intranet&quot;. </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> Cuándo usar una LAN o una WAN </h2> <p> Cuando desee conectarse a otro dispositivo de su propiedad, puede optar por hacerlo a través de LAN o WAN. Pero, ¿cuáles son los beneficios y los inconvenientes de cada uno y cuáles debería utilizar? </p> <p> Supongamos que tiene un nuevo disco duro inalámbrico que se conecta a su enrutador y tiene la opción de permitir conexiones desde Internet (una WAN) o mantenerlo solo local (LAN). El que elija depende de lo que desee del disco duro. </p> <p> Proporcionar capacidades WAN al disco duro es fantástico por comodidad. Esto lo coloca en Internet, lo que significa que puede conectarse desde cualquier parte del mundo. Como tal, nunca más se quedará atascado sin sus archivos; solo estarán a una conexión a Internet de distancia. </p> <p> Sin embargo, las conexiones WAN también permiten que otras personas accedan a sus dispositivos. Si la seguridad de su disco duro no está a la altura, los piratas informáticos pueden usar la misma ruta que usted para ver todos sus datos y copiar o eliminar cosas importantes. </p> <p> Poner el disco duro en modo solo LAN, por otro lado, lo protege de algunas de las vías que puede tomar un hacker. No es impermeable. Por ejemplo, alguien podría usar su PC para acceder al disco duro. Sin embargo, es mucho más seguro que transmitir el disco duro en la WAN todos los días y todas las noches. </p> <p> Si realmente desea reforzar la seguridad, puede hacer un air-gap en el disco duro. El espacio aéreo significa que él y todos los PC de la misma red no están conectados a una WAN, como Internet, por ejemplo. </p> <p> Un <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> la computadora con espacio de aire no es totalmente segura contra las amenazas en línea </a> , pero reduce drásticamente la posibilidad de un ataque. Los piratas informáticos necesitan manipular a los seres humanos para que sigan sus órdenes para atacar un dispositivo con espacio de aire, utilizando tácticas de ingeniería social para salirse con la suya. </p> <p> Como tal, al elegir entre poner un dispositivo en Internet o mantenerlo bloqueado en la LAN de su hogar, debe considerar si realmente se conectará a él a través de Internet. Si no cree que lo hará, es mejor desactivar sus capacidades WAN y mantener a raya a los piratas informáticos. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> ¿La conexión a Internet convierte una LAN en una WAN? </h2> <p> Digamos que tiene una LAN configurada donde todos sus dispositivos están conectados a un enrutador. Estás aburrido, así que te conectas a tu computadora y te diriges a Netflix. Ahora, su PC está conectada a una WAN: Internet. </p> <p> Sin embargo, debido a que su PC está conectada a una WAN, ¿significa eso que ya no es parte de una LAN? Afortunadamente, un dispositivo puede ser parte de una LAN y una WAN al mismo tiempo. </p> <p> ¿Recuerda cómo dijimos que los dispositivos LAN tienen su propia dirección IP local? Esto no significa que tampoco pueda obtener una dirección IP de Internet. De hecho, si está leyendo este artículo en un dispositivo conectado a un enrutador, ¡tendrá ambos! </p> <p> Si desea comprobarlo usted mismo, hemos cubierto <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> cómo verificar su dirección IP en Windows </a> . Si está en un dispositivo móvil, aún puede <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> encuentre sus direcciones IP en Android o iPhone </a> . </p> <p> Una vez que tenga las estadísticas, debería ver dos direcciones IP. El primero comenzará con &quot;192.168&quot;, que es su dirección IP local. Utilice este si desea conectarse a su dispositivo actual desde otro en la misma red. </p> <p> El segundo se verá de dos maneras, dependiendo de si está en IPv4 o IPv6. Si tiene la versión 4, debería parecerse a su dirección IP local, pero no comenzará con &quot;192.168&quot;. Si es IPv6, debería ser un lío de letras y números, divididos en ocho bloques por dos puntos. </p> <p> De cualquier manera, esa dirección es su dirección IP de Internet. Eso se usa cuando te conectas a otro servidor en Internet para que pueda hablar contigo; por ejemplo, para enviarte ese programa de televisión que estás viendo en Netflix. </p> <p> En cierto modo, puede imaginarse Internet como una enorme red de LAN. Cuando mira Netflix, su PC (en su LAN personal) obtiene datos de los servidores de Netflix (que se encuentran en su propia LAN). Cada LAN es como una casa en una ciudad, mientras que la conectividad a Internet es como las carreteras y calles que las conectan a todas. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> Eliminando la confusión de LAN vs. WAN </h2> <p> Las LAN y las WAN a menudo funcionan en conjunto, pero funcionan de diferentes maneras. Ahora sabe la diferencia entre los dos y cuándo usar cada uno. </p> <p> ¿Sabía que puede configurar un juego LAN para que las personas de la misma red puedan jugar entre sí? Es una excelente manera de pasar tiempo con amigos sin los problemas de latencia que a veces tienen los juegos de Internet. </p> <p> <small> Crédito de la imagen: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}