{"title":"Cómo arreglar el código de detención BSOD &quot;EXCEPCIÓN DEL HILO DEL SISTEMA NO MANEJADO&quot; en Windows 10","content":"<p> La &quot;EXCEPCIÓN DEL HILO DEL SISTEMA NO MANEJADA&quot; es un error común de Windows 10 que ocurre principalmente debido a un controlador desactualizado o incompatible. </p> <p> Lo que hace que sea más complicado de solucionar que otros BSOD es que varios controladores pueden causar el problema y, a veces, es posible que su computadora no los detecte a todos. Es por eso que el primer paso que los usuarios deben tomar al abordar este error es encontrar el controlador exacto que está causando el problema. </p> <p> Así es como se corrige el error de excepción de subproceso del sistema no manejado en Windows 10. </p> <h2 id=\"boot-into-safe-mode\"> 1. Arranque en modo seguro </h2> <p> El primer paso que los usuarios deben tomar antes de intentar solucionar este problema es iniciar su computadora en modo seguro. Dependiendo de sus preferencias y de si puede iniciar su computadora en la pantalla de inicio de sesión, hay varias formas de hacerlo: </p> <h3 id=\"boot-into-safe-mode-via-settings\"> Arrancar en modo seguro a través de la configuración </h3> <ol> <li> Haga clic en el <strong> Comienzo </strong> , luego seleccione <strong> Ajustes </strong> . </li> <li> Navegar a <strong> Actualización y seguridad </strong> luego haga clic en <strong> Recuperación </strong> . </li> <li> Debajo <strong> Inicio avanzado, </strong> haga clic en <strong> Reiniciar ahora. </strong> </li> <li> Cuando su PC reinicia el <strong> Elige una opcion </strong> debería aparecer la pantalla. </li> <li> Desde aqui ve a <strong> Solucionar problemas&gt; Opciones avanzadas&gt; Configuración de inicio </strong> . Luego haga clic en <strong> Reanudar </strong> </li> <li> Cuando su PC se reinicie, presione <strong> F5 </strong> para arrancar su computadora en <strong> Modo seguro con funciones de red </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> Desde la pantalla de inicio de sesión </h3> <ol> <li> Simplemente mantén presionado <strong> Cambiar </strong> y seleccione el <strong> Energía </strong> botón seguido de <strong> Reanudar </strong> . </li> <li> Siga los pasos 4, 5 y 6 de la sección anterior. </li> </ol> <h3 id=\"from-a-blank-screen\"> Desde una pantalla en blanco </h3> <ol> <li> Si no puede acceder a la pantalla de inicio de sesión, siga estos pasos. </li> <li> Mantenga presionado el botón de encendido de su dispositivo durante 10 segundos para apagarlo. </li> <li> Presione el botón de encendido nuevamente para iniciarlo. </li> <li> Tan pronto como su PC se inicie, es decir, aparezca el logotipo del fabricante, presione el botón de encendido nuevamente durante 10 segundos. </li> <li> Presione el botón de encendido para iniciar su dispositivo. </li> <li> Si se hace correctamente, su computadora se iniciará en el <strong> Entorno de recuperación de Windows </strong> . </li> <li> Siga los pasos 4, 5 y 6 de la primera sección. </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. Encontrar qué conductor es responsable </h2> <p> Dado que lo más probable es que el error sea causado por un controlador que no funciona correctamente, puede utilizar el registro de Windows para averiguar cuál. </p> <p> Para hacer esto, simplemente siga estos pasos: </p> <ol> <li> prensa <strong> Tecla de Windows + R </strong> y en el <strong> Correr </strong> cuadro de diálogo, escriba <strong> eventvwr. </strong> </li> <li> Navega al <strong> Registros de Windows </strong> menú y expandirlo, luego seleccione <strong> Sistema. </strong> </li> <li> Busque un registro llamado <strong> system_thread_exception_not_handled </strong> y haga clic en él para averiguar qué controlador está causando el problema. </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> Por lo general, el controlador asociado será un controlador de pantalla o un controlador de red, ya que estos son conocidos por causar este BSOD. Si el archivo asociado resulta ser <strong> nvlddmkm.sys </strong> , puedes echar un vistazo a <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> algunas formas fáciles de solucionarlo. </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. Revertir o actualizar los controladores </h2> <p> Dependiendo de qué controlador es responsable del error de excepción de subproceso del sistema no manejado, es posible que deba actualizar o reinstalar los controladores asociados. </p> <p> Si el controlador no se ha actualizado durante mucho tiempo, lo más probable es que la actualización del controlador solucione el problema. Si el controlador se actualizó recientemente, entonces puede ser mejor revertir el controlador o reinstalar las actualizaciones. </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> Cómo actualizar controladores en Windows 10 </h3> <ol> <li> prensa <strong> Tecla de Windows + R </strong> y escribe <strong> devmgmt.msc </strong> para abrir el <strong> Administrador de dispositivos </strong> . </li> <li> Navegue hasta el dispositivo asociado y expanda el menú. Por ejemplo, si el error fue causado por un controlador de pantalla, tendría que expandir el <strong> Adaptadores de pantalla </strong> opción. </li> <li> Haga clic derecho en el controlador y haga clic en <strong> Actualizar controlador </strong> . </li> <li> En el cuadro de diálogo que se abre, haga clic en <strong> Busque automáticamente el software del controlador actualizado </strong> . </li> <li> Windows buscará automáticamente en la web los controladores más recientes y los instalará. </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> Cómo revertir los controladores en Windows 10 </h3> <ol> <li> Abierto <strong> Administrador de dispositivos </strong> y navegue hasta el controlador en cuestión. </li> <li> Expanda el menú y haga clic con el botón derecho en el controlador. </li> <li> Haga clic en <strong> Propiedades </strong> . </li> <li> Bajo la <strong> Conductor </strong> pestaña, haga clic en <strong> Controlador de retroceso </strong> . </li> <li> Windows retrocederá automáticamente a la última versión disponible del controlador. </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. Cambie el nombre del archivo defectuoso </h2> <p> Al recuperar el nombre de archivo asociado con el error de excepción de subproceso del sistema no manejado, los usuarios deben cambiar el nombre del archivo. Hacer esto hará que Windows cree una nueva copia y la reinstale. Los archivos del controlador se encuentran en <strong> C: \\ Windows \\ System32 \\ drivers </strong> </p> <p> Siga estos pasos para cambiar el nombre del archivo: </p> <ol> <li> Abierto <strong> Explorador de archivos </strong> E ir a <strong> C: \\ Windows \\ System32 \\ drivers </strong> </li> <li> Busque el conductor afectado </li> <li> Haga clic en él y presione <strong> F2. </strong> </li> <li> Reemplace la extensión del nombre de archivo con <strong> .viejo </strong> . </li> <li> Presiona Enter y reinicia tu computadora. </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. Utilice SFC y DISM para reparar archivos del sistema </h2> <p> SFC y DISM son dos poderosas herramientas disponibles a disposición de todos los usuarios de Windows. En combinación, pueden encontrar y corregir casi cualquier error relacionado con el sistema. También son bastante simples de ejecutar. </p> <p> </p> <p> Asegúrese de crear un punto de restauración del sistema, ya que estos comandos alteran los archivos del sistema. </p> <h3 id=\"how-to-use-dism\"> Cómo utilizar DISM </h3> <ol> <li> Correr <strong> Símbolo del sistema </strong> como administrador </li> <li> En la consola, escriba <strong> DISM / Online / Cleanup-Image / ScanHealth </strong> y presione Entrar. </li> <li> Espere a que Windows termine de escanear. Luego escribe <strong> DISM / Online / Cleanup-image / RestoreHealth </strong> </li> <li> Windows reparará todos los problemas que se encontraron durante el análisis. </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> Cómo utilizar SFC </h3> <ol> <li> En la barra de búsqueda del menú Inicio, escriba <strong> cmd </strong> luego haga clic derecho en <strong> Símbolo del sistema </strong> y ejecútelo como administrador. </li> <li> En la consola, ingrese <strong> sfc / scannow </strong> </li> <li> Tenga paciencia, ya que Windows tardará en escanear y reemplazar los archivos del sistema corruptos. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. Utilice Restaurar sistema para restaurar su PC </h2> <p> Si el problema sigue sin resolverse, tendrá que utilizar Restaurar sistema como último recurso. Restaurar sistema es una función que restaura Windows a un estado anterior. Estos puntos de restauración se crean periódicamente y al instalar software nuevo. Alternativamente, puede configurar <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows para crear un punto de restauración diario </a> </p> <h3 id=\"how-to-use-system-restore\"> Cómo utilizar Restaurar sistema </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> En la barra de búsqueda del menú Inicio, escriba <strong> Panel de control </strong> y haga clic en abrirlo. </li> <li> En la barra de búsqueda del Panel de control, ingrese <strong> Recuperación </strong> y ábralo de los resultados. </li> <li> Haga clic en <strong> Abrir recuperación del sistema </strong> . </li> <li> Haga clic en <strong> próximo </strong> y seleccione un punto de restauración de la lista. </li> <li> Haga clic en <strong> Terminar. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> Excepción manejada </h2> <p> Los consejos enumerados anteriormente brindan una solución fácil para las molestias que causan los BSOD como system_thread_exception_not_handled. La mejor parte es que la mayoría de los consejos se pueden usar para diagnosticar muchos otros errores comunes de la pantalla azul de la muerte (BSOD) en Windows también. </p>"}