{"title":"Cómo acceder a las estadísticas de juego de PS4 y PS5 para 2020","content":"<p> Sony ha lanzado PlayStation Wrap-Up, que le permite reflexionar sobre su viaje a PlayStation durante el último año. </p> <p> Le diremos cómo acceder a esta experiencia y le informaremos de los pocos requisitos. </p> <h2 id=\"what-is-playstation-wrap-up\"> ¿Qué es PlayStation Wrap-Up? </h2> <p> Como informamos, <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation Wrap-Up es el resumen de tu último año de juego. </a> . </p> <p> Es una página personalizada que detalla sus hábitos de juego de PS4 y PS5, incluida la cantidad de juegos que ha jugado, cuánto tiempo los jugó y cuántos trofeos ganó en el camino. </p> <p> También puede obtener un tema dinámico gratuito con formas de PlayStation. Confusamente, esto solo está disponible para la PS4 y no para la PS5 recién lanzada. </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> Cómo acceder al resumen de PlayStation </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> Para ver su informe, vaya al <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> Sitio web de PlayStation Wrap-Up </a> . Deberá iniciar sesión en su cuenta de Sony, si aún no lo ha hecho. Una vez que esté en la página, puede desplazarse hacia abajo para ver sus estadísticas y canjear el tema de PS4. </p> <p> La experiencia Wrap-Up solo estará disponible hasta el 2 de marzo de 2021. Por lo tanto, no se demore si desea participar. </p> <p> Hay condiciones que debes cumplir para poder utilizar el resumen de PlayStation: </p> <ul> <li> Tenga una cuenta de PSN registrada en su región. </li> <li> Ser mayor de 18 años. </li> <li> Haber jugado juegos durante al menos 10 horas en una consola PS4 entre el 1 de enero de 2020 y el 31 de diciembre de 2020. </li> </ul> <p> Además, los usuarios de Europa, Oriente Medio, África, Australia, India y Rusia deben haber habilitado la recopilación de <strong> Datos adicionales </strong> . Puede habilitar esto en la PS4 a través de <strong> Ajustes </strong> &gt; <strong> Datos del dispositivo / Salud y seguridad </strong> &gt; <strong> Datos del dispositivo </strong> . </p> <p> Finalmente, puede recibir un correo electrónico con el resumen de su PlayStation. Sin embargo, debe haber optado por recibir correos electrónicos de marketing, lo que puede hacer a través del <strong> Configuracion de notificaciones </strong> en su cuenta de PSN. </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> ¿Habrá un resumen de 2021? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> Este es el segundo año consecutivo que Sony lleva a cabo la experiencia Wrap-Up. Dado que solo está analizando datos de 2020, tiene más un enfoque de PS4. </p> <p> Con suerte, Sony lo volverá a hacer el próximo año, cuando la PS5 haya estado fuera por más tiempo y tenga más juegos lanzados. </p>"}