{"title":"Cómo arreglar el BSOD VIDEO_TDR_FAILURE en Windows 10","content":"<p> El error VIDEO_TDR_FAILURE significa que su tarjeta gráfica está defectuosa o que los controladores de pantalla pueden estar desactualizados o funcionar mal. Pero podría haber otras razones, como el sobrecalentamiento de los componentes o los archivos del sistema corruptos. TDR es la abreviatura de <strong> Tiempo de espera, detección y recuperación </strong> , un método utilizado por Windows para identificar y reparar componentes de software que funcionan mal. </p> <p> Si se encuentra con este error, no tema porque los siguientes métodos solucionarán el error VIDEO_TDR_FAILURE más rápido de lo esperado. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Actualice y reinstale los controladores de pantalla </h2> <p> Como se mencionó anteriormente, el error suele ser el resultado de un mal funcionamiento o de controladores de pantalla desactualizados. Por lo tanto, debe actualizar los controladores de su tarjeta gráfica. Si eso no lo soluciona, vuelva a instalarlos. Dependiendo de su tarjeta gráfica, puede encontrar diferentes nombres de archivo relacionados con el error. </p> <ol> <li> Para los usuarios de Nvidia, es <strong> nvlddmkm.sys </strong> . Si eres usuario de Nvidia, aquí tienes <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 formas sencillas de corregir el error. </a> </li> <li> Para los usuarios de AMD, el error aparece como <strong> atikmpag.sys </strong> . </li> <li> Para los usuarios de Intel HD, el error es <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> Cómo actualizar los controladores de pantalla </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> prensa <strong> Tecla de Windows + R </strong> para abrir el comando Ejecutar. Escribir <strong> devmgmt.msc </strong> y presione Entrar. </li> <li> En el <strong> Administrador de dispositivos </strong> ventana, navega a <strong> Adaptadores de pantalla </strong> y expandirlo. </li> <li> Haga clic con el botón derecho en su adaptador de pantalla, luego seleccione <strong> Actualizar controlador </strong> . </li> <li> Seleccione <strong> Busque automáticamente el software del controlador actualizado </strong> . </li> <li> Windows buscará automáticamente en la web y descargará los controladores necesarios. Asegúrese de tener una conexión a Internet activa mientras lo hace. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> Cómo reinstalar los controladores de pantalla </h3> <p> Si el BSOD de falla de tdr de video persiste después de actualizar los controladores de pantalla, es mejor reinstalar estos controladores. Es recomendable hacerlo mientras Windows se inicia en modo seguro. Pero antes de hacer eso, debe dirigirse al sitio web del fabricante de su tarjeta gráfica y descargar la última versión de los controladores gráficos. </p> <p> Las manufacturas más comunes son <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> , y <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intel </a> . </p> <p> Para arrancar en modo seguro, siga estos pasos: </p> <ol> <li> prensa <strong> Tecla de Windows + R, </strong> y en el cuadro de diálogo Ejecutar, escriba <strong> msconfig, </strong> y presione Entrar. </li> <li> En el <strong> Configuración del sistema </strong> ventana, haga clic en el <strong> Bota </strong> pestaña. </li> <li> Ahora marque el <strong> Modo seguro </strong> casilla de verificación ubicada hacia la parte inferior. </li> <li> Aplica la configuración y reinicia tu computadora. </li> </ol> <p> Después de arrancar en modo seguro, es hora de reinstalar los controladores de pantalla. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> En la barra de búsqueda del menú Inicio, escriba <strong> Administrador de dispositivos </strong> y ábrelo. </li> <li> Buscar <strong> Adaptadores de pantalla </strong> y expanda el menú. </li> <li> Haga clic derecho en su GPU y haga clic en <strong> Desinstalar dispositivo </strong> . </li> <li> En el asistente de desinstalación, asegúrese de marcar el <strong> Eliminar el software del controlador para este dispositivo </strong> caja. </li> <li> Espere a que Windows desinstale el dispositivo y reinicie su computadora. </li> <li> Ahora, reinstale los controladores de gráficos que descargó anteriormente. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Utilice SFC para escanear y reparar archivos del sistema </h2> <p> SFC es una utilidad de Windows incorporada que se puede utilizar para escanear y reparar archivos corruptos del sistema. En el caso de un BSOD, es muy probable que algunos archivos del sistema estén corruptos, por lo que ejecutar esta utilidad es imperativo. Es solo uno de los <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> varias utilidades útiles disponibles </a> a disposición de un usuario de Windows. </p> <p> Para ejecutar SFC, simplemente siga estos pasos: </p> <ol> <li> En la barra de búsqueda del menú Inicio, escriba <strong> cmd </strong> . </li> <li> Haga clic derecho en <strong> Símbolo del sistema </strong> y seleccione <strong> Ejecutar como administrador </strong> . </li> <li> En la consola, escriba <strong> sfc / scannow </strong> y presione Entrar. </li> <li> Una vez finalizado el proceso de escaneo y reparación, reinicie su computadora. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Ejecute la reparación de inicio </h2> <p> Para los usuarios que obtienen el error tan pronto como inician Windows 10 o poco después de iniciar sesión, la reparación de inicio es una bendición. Esta función de Windows busca anomalías durante el inicio y las corrige de inmediato. </p> <p> Dado que esta sección está dirigida a usuarios cuyas computadoras se han vuelto inutilizables debido al error, es decir, no pueden abrir <strong> Ajustes </strong> , tendrán que reiniciar para ingresar al Entorno de recuperación de Windows (winRE). </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Siga estos pasos para iniciar el entorno de recuperación de Windows: </p> <ol> <li> Mantenga presionado el botón de Encendido hasta que su PC se apague. </li> <li> Presione el botón de Encendido nuevamente para iniciar su PC. </li> <li> Repita el primer y segundo paso hasta que la PC se inicie en el modo de recuperación. Será una pantalla azul. </li> <li> En la pantalla de recuperación, haga clic en <strong> Ver opciones de reparación avanzadas </strong> . </li> <li> En la siguiente pantalla, haga clic en <strong> Solucionar problemas </strong> </li> <li> Haga clic en <strong> Opciones avanzadas </strong> </li> <li> Haga clic en <strong> Reparación inicial </strong> e ingrese sus credenciales cuando se le solicite. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Cambie la configuración de administración de energía </h2> <p> La configuración de administración de energía de Windows generalmente está bien optimizada, pero a veces pueden interferir con la forma en que su computadora maneja los gráficos. Esto es especialmente cierto cuando la computadora tiene una GPU discreta. La configuración óptima para evitar obtener el BSOD VIDEO_TDR_FAILURE se proporciona a continuación: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> En la barra de búsqueda del menú Inicio, escriba <strong> Panel de control </strong> y ábrelo. </li> <li> En la barra de búsqueda del Panel de control, ingrese &quot;opciones de energía&quot; y presione Entrar. </li> <li> Haga clic en <strong> Opciones de poder, </strong> y junto al plan de energía que estás usando, haz clic en <strong> Cambiar la configuración del plan. </strong> </li> <li> Haga clic en <strong> Cambie la configuración avanzada de energía. </strong> </li> <li> Buscar <strong> PCI E </strong><strong> xpress </strong> y expandirlo. </li> <li> Gire el <strong> Administración de energía del estado del enlace </strong> ajuste a <strong> Apagado </strong> . </li> <li> Guarde los cambios y reinicie su computadora. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Limpia tu computadora </h2> <p> El sobrecalentamiento nunca es algo bueno y, por lo general, la razón es la acumulación de polvo. Se recomienda que los usuarios limpien los componentes de su PC de cualquier polvo todos los meses. Pero ten cuidado. Debe hacerse con cuidado. </p> <p> Asegúrese de limpiar la parte superior de la tarjeta gráfica, el ventilador de la CPU, la fuente de alimentación y los ventiladores del gabinete. Con todo, asegúrese de evitar <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> errores de mantenimiento que podrían dañar los costosos componentes. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Verifique los componentes de hardware </h2> <p> Si el error sigue apareciendo después de intentar todo lo mencionado anteriormente, es posible que haya una falla en el hardware. Los usuarios que tengan una tarjeta gráfica dedicada deben quitarla e iniciar la computadora. Si se resuelve el error, entonces es una falla de hardware en la propia GPU. Puede intentar ponerse en contacto con el fabricante e intentar reemplazar su unidad. </p> <p> </p> <p> Cuando utilice gráficos integrados, intente desactivarlos y arrancar. Para deshabilitarlos, siga estos pasos: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> prensa <strong> Tecla de Windows + R, </strong> tipo <strong> devmgmt.msc </strong> en el cuadro de texto Ejecutar y presione Entrar. </li> <li> En <strong> Administrador de dispositivos </strong> , buscar <strong> Adaptadores de pantalla </strong> y expanda el menú. </li> <li> Haga clic con el botón derecho en su GPU integrada y haga clic en <strong> Desactivar dispositivo </strong> . </li> <li> Reinicie la computadora y verifique si el error está resuelto. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> Error &quot;Video TDR Failure&quot; resuelto correctamente </h2> <p> Para la mayoría de los usuarios, una simple actualización o reinstalación de sus controladores de pantalla solucionará el problema. Pero si las cosas empeoran, es posible que deba reiniciar su PC o reemplazar algún hardware. </p>"}