{"title":"Cómo crear o editar un patrón en Adobe Illustrator","content":"<p> Cree un patrón en Adobe Illustrator y podrá aplicarlo rápidamente a formas, trazos e incluso texto. Puede hacer algo simple, como un patrón de puntos, o hacer algo más complejo. Incluso puede usar una parte de un gráfico vectorial existente y convertirlo en un patrón también. </p> <p> Los patrones son ideales para fondos, texturas y más. A continuación, le mostramos cómo utilizar las herramientas de patrones de Illustrator y cómo crear y editar sus propios patrones. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Uso de los patrones predeterminados en Adobe Illustrator </h2> <p> Illustrator viene con varios patrones integrados. Además de ser útiles por sí mismos, también son una buena forma de ver cómo funcionan los patrones. Estos patrones también le darán una idea sobre cómo usar sus propios patrones una vez que los haya creado. </p> <p> </p> <p> Puedes encontrar patrones en tu ventana Muestras. Si aún no está abierto, vaya a <strong> Ventana&gt; Muestras </strong> en el menú superior. Además de los colores sólidos, es posible que ya haya algunos patrones en la ventana Muestras, pero estos no son los únicos patrones que tiene Illustrator. </p> <p> Haga clic en el <strong> Biblioteca de muestras </strong> en la parte inferior izquierda de la ventana Swatch. Coloca el cursor sobre <strong> Patrón </strong> y luego elija una de las bibliotecas de muestras de patrones. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Ahora puede aplicar estas muestras como lo haría con colores sólidos. Aquí, puede ver patrones de la <strong> Nature_Foliage </strong> biblioteca aplicada como rellenos y trazos, así como al texto. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> Cómo hacer un patrón repetitivo básico en Illustrator </h2> <p> Puede convertir cualquier vector en un patrón, ya sea algo que ya haya diseñado o algo que cree con esta intención específica en mente. Puede hacerlo con un gráfico vectorial completo, una sola capa o cualquier cosa intermedia. </p> <p> Todo lo que tiene que hacer es seleccionar lo que desea convertir en un patrón y luego arrastrarlo a la ventana Muestras. Por ejemplo, podrías arrastrar este ojo de gato a tus Muestras. Eso crearía una muestra de patrón, que luego podría usar para rellenar un rectángulo o cualquier otra forma. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> Alternativamente, puede hacer lo mismo con todo el vector. En cualquier caso, Illustrator creará un patrón a partir de lo que arrastre a la ventana Muestras. Simplemente puede aplicar la muestra como lo haría con cualquier muestra de color normal. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Si hace doble clic en su muestra de patrón en la ventana Muestras, se abrirá el <strong> Opciones de patrón </strong> ventana. También puede abrir esto directamente desde <strong> Ventanas&gt; Opciones de patrón </strong> en el menú superior. </p> <p> Aquí, puede editar aún más su patrón, incluida la forma en que se repite y qué tan grandes son los espacios entre cada iteración de su imagen. También edita el diseño de su patrón directamente aquí. La versión de la imagen que no está atenuada se puede editar normalmente. Puede cambiar colores, mover capas, etc. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> Hay varias cosas que puede hacer con la ventana Opciones de patrón. Puede, por ejemplo, repetir su imagen en un diseño de ladrillo escalonado y reducir el espacio entre cada parte del patrón. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> Acerque las partes de su patrón lo suficiente y podrá hacer que se superpongan. Al hacerlo, puede crear una especie de patrón de mosaico como el que se muestra a continuación. Pruebe todas las diferentes configuraciones de superposición en Opciones de patrón para encontrar algo que funcione para usted. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> Cómo crear un patrón sin costuras en Adobe Illustrator </h2> <p> Si desea crear un patrón geométrico sin costuras, debe asegurarse de que haya simetría en todo su diseño. Por ejemplo, una línea que comienza 10px hacia arriba en el lado izquierdo de su patrón tiene que terminar 10px hacia arriba en el lado derecho. Cuando se repita, esos puntos deberán sumarse. </p> <p> Para hacer esto, cree un nuevo documento con dimensiones cuadradas. Habilite la superposición de cuadrícula presionando <strong> Ctrl + &quot; </strong> ( <strong> Cmd + &quot; </strong> en Mac). Las guías inteligentes también son útiles; habilítelas con <strong> Ctrl + U </strong> ( <strong> Cmd + U </strong> en Mac). Si sus reglas no son visibles, presione <strong> Ctrl + R </strong> ( <strong> Cmd + R </strong> en Mac) para habilitarlos. </p> <p> También puede encontrar estas configuraciones en <strong> Vista </strong> en el menú superior, pero recomendamos usar <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Teclas de método abreviado de Illustrator </a> donde puedas para ahorrar tiempo. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Extiende tu diseño en el cuadrado. Cualquier parte que pase por los bordes deberá alinearse en el otro lado. La <strong> Alinear </strong> herramienta ( <strong> Ventana&gt; Alinear </strong> ) pueden ayudarlo a alinear las cosas correctamente. Haga clic y arrastre desde las reglas para crear sus propias guías donde las necesite. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> También es importante tener un color de fondo, incluso si es blanco. Asegúrese de que se ajuste perfectamente a los bordes de la mesa de trabajo porque lo necesita para recortar el material superfluo. </p> <p> Seleccione todo con <strong> Ctrl + A </strong> ( <strong> Cmd + A </strong> en Mac) y luego presione <strong> Mayús + M </strong> para activar el <strong> Constructor de formas </strong> herramienta. Esto también se puede encontrar en la caja de herramientas. Sujetar <strong> Alt </strong> ( <strong> Opción </strong> en Mac). Esto pone el <strong> Constructor de formas </strong> herramienta en modo de resta. </p> <p> Al pasar el cursor sobre partes de su diseño con esta herramienta, debería ver que cambian de color ligeramente. Haga clic en las áreas que no desea e Illustrator eliminará esas partes, dejando solo los bits que se superponen con el cuadrado de fondo. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> Una vez hecho esto, seleccione todo y arrástrelo a sus muestras para convertirlo en un patrón. Para usar su patrón en un documento nuevo, puede guardarlo en una biblioteca de muestras o usar su biblioteca de Adobe Cloud. </p> <p> Alternativamente, también puede copiarlo desde esta ventana Swatch y pegarlo en otra ventana Swatch en un documento diferente. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Ahora puede aplicar este patrón como lo haría con cualquier otro. Si lo ha hecho bien, todo debería alinearse sin espacios. Realice ajustes en su documento de patrón si es necesario. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> ¿Cuándo debería utilizar patrones en Adobe Illustrator? </h2> <p> El uso más obvio de los patrones es crear mosaicos repetibles para fondos, pero puede usarlos para completar formas y darles textura también. El texto relleno de patrón es otro buen uso y puede hacer que su tipografía realmente se destaque. </p> <p> Si lo desea, incluso puede crear sus propios patrones manualmente, copiando y pegando la misma imagen una y otra vez. Puede haber ocasiones en las que desee hacer eso, pero la mayoría de las veces, la capacidad de Illustrator para automatizar la creación de patrones será el camino a seguir. </p> <p> Es solo una de las muchas formas en que Illustrator puede hacer su vida más fácil, dándole más tiempo para trabajar en sus diseños. </p>"}