{"title":"Canon lanza una aplicación de selección de fotografías que encuentra tus mejores tomas","content":"<p> Detrás de casi todas las fotos de imágenes perfectas hay un rollo de cámara lleno de otras fotos que se ven casi exactamente iguales. No es raro que los fotógrafos casi siempre mantengan presionado el botón del obturador, por temor a perderse un momento fugaz. </p> <p> Revisar docenas o incluso cientos de fotos para elegir sus favoritas y limpiar el espacio de almacenamiento puede ser un proceso largo y molesto. Afortunadamente, Canon ha lanzado una nueva aplicación que lo hace automáticamente por usted. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> Tome fácilmente un rollo de fotos hasta las mejores </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon EE. UU. </a> ha lanzado una aplicación de selección de fotografías en <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> Tienda de aplicaciones </a> que le permite encontrar rápida y fácilmente sus mejores fotos. La aplicación en sí es gratuita, pero para usarla, tendrá que obtener una suscripción por $ 14.99 / año o $ 2.99 / mes. Ambas opciones de suscripción tienen una prueba de tres días. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> El vicepresidente ejecutivo de Canon USA, Tatsuro &quot;Tony&quot; Kano, explica: </p> <blockquote> <p> En el mundo en constante cambio y abrumador de hoy, donde se capturan y almacenan miles de fotos en el teléfono inteligente de una persona, los consumidores necesitan una herramienta fotográfica experta, confiable e intuitiva que les ayude a decidir las mejores fotos basándose en años de tecnología y conocimientos confiables. </p> </blockquote> <p> La aplicación de Canon, simplemente llamada Photo Culling, funciona con una IA llamada Aprendizaje de inteligencia de fotografía o PHIL, para abreviar. PHIL sugiere qué fotos debe conservar y cuáles debe eliminar según cuál de las dos opciones de selección de fotos seleccione. </p> <p> La primera opción, <strong> Eliminación completa </strong> , es genial para <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> mejor fotografía de retrato </a> . Cuando se selecciona esta opción, PHIL determinará sus mejores fotos calificándolas en función de cuatro factores: nitidez, ruido, emociones y si los ojos del sujeto están cerrados (si corresponde). </p> <p> Mientras tanto, el <strong> Eliminación similar </strong> La opción elige tus mejores tomas comparando puntuaciones entre fotos similares. Por ejemplo, digamos que tomó un montón de fotos de las nubes y luego un montón de fotos de algunas flores. La aplicación separaría las fotos de nubes y las fotos de flores en grupos separados. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Cualquiera que sea la opción de selección que elija, si el puntaje de una foto está por encima del puntaje objetivo que estableció, entonces la foto se considera un guardián. PHIL luego sugerirá eliminar las fotos restantes que no obtuvieron una puntuación lo suficientemente alta. En caso de que no esté de acuerdo con PHIL, no se preocupe. Aún tienes control total sobre todas tus tomas. </p> <p> </p> <p> Otras características de la aplicación incluyen el recuento de fotos y la información de visualización del espacio de almacenamiento, los álbumes de fotos, la configuración de parámetros para las puntuaciones de las fotos y la opción de usar el modo oscuro. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> ¿Descargarás la aplicación Photo Culling de Canon? </h2> <p> Parece que la aplicación de selección de fotografías de Canon tiene todo lo que necesita para que el proceso de elección de las mejores fotografías sea menos tedioso. Sin embargo, al final del día, depende de usted decidir si odia la selección de fotografías lo suficiente como para justificar pagar por algo que podría hacer usted mismo (aunque probablemente muy lentamente y aburrido). </p> <p> En el momento de escribir este artículo, la aplicación no está disponible para Android, pero quizás Canon tenga eso en las tarjetas para el futuro. </p>"}