{"title":"Cómo ver tus estadísticas de tiempo de juego en la PS5","content":"<p> Si le gusta ver cuánto tiempo ha pasado jugando, la PS5 tiene una función oculta pero útil para usted. Realiza un seguimiento de cuánto tiempo ha pasado jugando juegos en el sistema. </p> <p> A continuación, le mostramos cómo comprobar cuánto tiempo ha pasado jugando juegos de PlayStation 5. Lo que puede animarte a <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> apaga tu PS5 </a> más a menudo. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> Cómo verificar sus estadísticas de tiempo de juego en PlayStation 5 </h2> <p> En la pantalla de inicio de tu PS5, selecciona el ícono de tu perfil en la parte superior derecha. Puedes presionar <strong> Triángulo </strong> para mover la selección a esa área de la pantalla rápidamente. Después de abrir ese menú, elija <strong> Perfil </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Ahora, cambie al <strong> Juegos </strong> pestaña. Aquí verá todos los juegos que ha jugado en su cuenta de PlayStation. Cada uno muestra la última vez que jugó al juego, así como el total de horas de juego. Sin embargo, no es exacto al minuto. Verá el tiempo de juego redondeado a la hora. </p> <p> También verá el tiempo de reproducción de sus títulos de PS4 aquí, incluso si no los ha jugado en PS5. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> Por lo que sabemos, este tiempo de juego incluye todo el tiempo que se estuvo ejecutando el juego, no solo cuando estuvo jugando activamente. Esto significa que si dejaste el juego en el menú de pausa mientras atendías una llamada telefónica o comías algo, ese tiempo se incluirá en el total. Por lo tanto, puede que no sea muy preciso, pero al menos te dará una idea de cuánto tiempo has jugado cada título. </p> <p> </p> <p> Si tiene curiosidad, también puede ver las estadísticas de tiempo de juego de sus amigos. Selecciona el <strong> Amigos </strong> pestaña en la misma pantalla y elija el amigo del que desea obtener más información. Esto le mostrará cuánto tiempo han pasado en sus juegos en un menú idéntico. </p> <p> Si no desea que la información de su tiempo de juego sea visible para otros jugadores, desplácese hacia la derecha y elija <strong> La configuración de privacidad </strong> . En ese menú, debajo del <strong> Tu actividad </strong> sección, cambie la opción para <strong> Quién puede ver tu historial de juegos </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Algunos juegos también registran su propio tiempo de juego </h2> <p> Si está interesado en datos como este, asegúrese de abrir sus juegos favoritos y ver si llevan un registro de cuánto tiempo ha pasado jugando. Una buena cantidad de títulos incluyen el tiempo total de reproducción en su archivo guardado, dentro del menú de pausa o similar. </p> <p> Si bien esto no es consistente en todos los juegos, y puede incluir o no el tiempo pasado mientras está en pausa, puede brindarle más información sobre un juego del que desea saber más. Algunos juegos en línea, como Overwatch, incluso registran el tiempo que pasas con cada héroe en todos los modos. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Mira cuánto juegas realmente </h2> <p> La PS5 facilita ver cuánto tiempo ha pasado jugando. Es una característica pequeña pero muy apreciada, ya que la PS4 no hizo que estos datos fueran fácilmente accesibles. </p> <p> Mientras tanto, también hay más formas de administrar su juego fuera de la propia consola. </p> <p> <small> Crédito de la imagen: LightField Studios / <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}