{"title":"Disney + tiene cerca de 100 millones de suscriptores","content":"<p> Nunca subestimes a Disney. Si bien Disney + solo se lanzó en los EE. UU. En noviembre de 2019, el servicio de transmisión ahora cuenta con casi 100 millones de suscriptores. Es un crecimiento que ni siquiera la empresa esperaba. </p> <h2 id=\"how-many-customers-does-disney-have\"> ¿Cuántos clientes tiene Disney +? </h2> <p> Como se anunció en el <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Informe de ganancias de Disney Q1 2021 </a> , Disney + tiene 94,9 millones de suscriptores en todo el mundo, al 2 de enero de 2021. </p> <p> Significa que la cifra no tiene en cuenta los suscriptores obtenidos a través del lanzamiento exitoso de WandaVision. No sería injusto suponer que Disney + ahora tiene más de 100 millones de suscriptores. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Las últimas cifras se informaron en diciembre de 2020, cuando Disney anunció que había obtenido 86 millones de suscriptores para su servicio de transmisión titular. El salto desde entonces probablemente se pueda atribuir a un fuerte contenido exclusivo como la segunda temporada de The Mandalorian y la película Soul de Pixar. </p> <p> Los ingresos mensuales promedio por suscriptor cayeron de $ 5.56 hace un año a $ 4.04 en la actualidad, lo que puede explicarse principalmente por el costo más barato del servicio en India e Indonesia. </p> <p> Hulu y ESPN +, servicios de transmisión también propiedad de Disney, también experimentaron un fuerte crecimiento. El primero creció un 30% año tras año a 39,4 millones de suscriptores, mientras que el segundo creció un 83% año tras año para un total de 12,1 millones de suscriptores. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney lanzó recientemente un paquete que combina todos sus servicios de transmisión </a> , por lo que está claro que la empresa sigue respaldando los tres. </p> <p> Star también se lanzará pronto en muchas regiones, lo que proporcionará un gran impulso a la cantidad de películas y programas de televisión que ofrece Disney +. </p>"}