{"title":"DeviantArt agrega una barra lateral y grupos a su aplicación móvil","content":"<p> Cada artista visual tiene su propio proceso creativo único, pero es común, especialmente en la era digital actual, que el último paso en ese proceso sea compartir su obra terminada en línea. </p> <p> Atrás quedaron los días en los que tenía que encontrar museos que llevaran sus pinturas o fotografías para que la gente las vea. En su lugar, elija la plataforma que más le atraiga y publique. </p> <p> Fundada en 2000, DeviantArt es una de las comunidades artísticas más antiguas de Internet. DeviantArt lanzó su aplicación móvil en 2017, y su última actualización es pequeña pero significativa. </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt para dispositivos móviles mejora su navegación </h2> <p> DeviantArt ha mejorado la interfaz de usuario de su aplicación móvil, agregando una barra lateral muy similar a la del sitio web de DeviantArt. La barra lateral le brinda acceso rápido a la página de inicio, los desviados (artistas) que sigue y los grupos. </p> <p> <strong class=\"gallery__section-title\"> Galería de imágenes (2 imágenes) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> Expandir <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> Expandir </p> <p> Cerca </p> <p> El acceso al último elemento de esa lista es particularmente notable porque antes de esta actualización, los grupos de DeviantArt solo estaban disponibles en el sitio web. Los grupos de DeviantArt funcionan de manera similar a <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> Grupos de Facebook </a> —Colecciones de usuarios que se han unido en la plataforma con intereses u objetivos comunes. </p> <p> En la barra lateral, puede tocar <strong> Mis grupos </strong> para ver todos los grupos de los que forma parte, o <strong> Grupos recomendados </strong> para ver los grupos que DeviantArt cree que serían adecuados para usted. También puede anclar sus grupos favoritos en la parte superior de la barra lateral para facilitar el acceso. </p> <p> Si dirige su propio grupo, es posible que aparezca en la sección recomendada para otros desviados que puedan estar interesados ​​en unirse. Si no está interesado en un grupo, puede tocar los tres puntos a la derecha de su nombre para eliminar la recomendación. </p> <p> Cuando visite un grupo en la aplicación, verá tanto sus desviaciones (envíos) como sus publicaciones. Los administradores de grupo pueden publicar actualizaciones en su grupo desde el feed de publicaciones. </p> <p> <strong> Descargar: </strong> DeviantArt para <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Androide </a> (Libre) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> ¿Dónde comparte sus creaciones en línea? </h2> <p> Si eres un artista, diseñador o fotógrafo que ha estado en Internet durante mucho tiempo, es probable que hayas estado en DeviantArt en algún momento. La comunidad no parece estar tan animada como a principios de la década de 2000, pero el volumen de trabajos presentados se ha disparado en los últimos años. </p> <p> Con una base de usuarios tan activa, debería ser de suma importancia para DeviantArt mejorar su aplicación móvil. Al momento de escribir este artículo, la aplicación tiene una calificación de 2.6 / 5.0 en la App Store y 3.2 / 5.0 en Google Play. </p>"}