{"title":"Diez cosas que no sabías que Google Docs podía hacer","content":"<p> Google Doc puede parecer básico en la superficie, pero la herramienta de productividad en la nube tiene muchas características pasadas por alto que pueden ayudarlo a hacer más en el trabajo. </p> <p> En este artículo, veremos varias funciones de Google Doc que probablemente no conocía y cómo puede usarlas para ahorrar tiempo en la creación de contenido. </p> <p> Tenga en cuenta que se puede acceder a estas funciones principalmente en la versión de escritorio de la herramienta Google Docs. Se indicarán aquellas que también se pueden utilizar en la versión móvil. </p> <h2 id=\"voice-typing\"> 1. Escritura por voz </h2> <p> Para usar la función de escritura por voz, abra un documento y haga clic en <strong> Herramientas </strong> desde la barra de menú en la parte superior de la página. Seleccione <strong> Escritura por voz </strong> desde el menú desplegable. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> Aparecerá un micrófono en su pantalla, con un menú de idioma donde puede seleccionar su idioma preferido. Cuando esté listo para decir su texto, haga clic en el micrófono o presione <strong> Cmd + Mayús + S </strong> (si está usando una Mac) o <strong> Ctrl + Mayús + S </strong> (si está usando una PC con Windows) para comenzar a grabar. </p> <p> Para agregar puntuación entre el texto, diga el nombre del signo de puntuación que desea agregar, como &quot;punto&quot;, &quot;coma&quot; o &quot;signo de interrogación&quot;. Puede dar instrucciones de formato como &quot;nueva línea&quot; o &quot;nuevo párrafo&quot;, o &quot;dejar de escuchar&quot; si desea tomar un descanso de la escritura por voz, y &quot;reanudar&quot; cuando esté listo para continuar. </p> <p> Busque los comandos de edición avanzados de este <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> lista de comandos </a> en la página de soporte de Google. </p> <p> También puede utilizar esta función para transcribir cualquier audio. Simplemente reproduzca el audio (desde su teléfono o cualquier otro dispositivo) a la conversión de voz a texto, y debe escribirlo por usted. Es posible que deba realizar algunas modificaciones, pero habría ahorrado mucho tiempo. </p> <p> </p> <p> La función de escritura por voz solo está disponible en el escritorio, pero solo funciona en el navegador Chrome. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Edición sin conexión </h2> <p> A muchas personas les encanta Google Docs por su función de guardar instantáneamente en la nube, pero puede ser un inconveniente si no tienes acceso a Internet por un tiempo. La buena noticia es que aún puede acceder y editar sus archivos sin conexión. </p> <p> Esta función solo está disponible en Google Chrome y deberá instalar y activar la <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Extensión de Chrome sin conexión de Google Docs </a> . Además, asegúrese de no estar navegando en modo privado. </p> <p> Esta función debe implementarse cuando esté en línea, pero una vez que lo haya hecho, puede escribir y editar texto sin conexión, y luego se guardarán en la nube cuando tenga acceso a Internet. Así es cómo. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> Para hacer posible <strong> abrir y guardar archivos de Google Docs sin conexión </strong> , seguir <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> estas instrucciones </a> . Esta función está disponible en PC, iOS y Android. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Seguimiento / restauración del historial de versiones del documento </h2> <p> Si está trabajando en un documento solo o con otras personas, puede realizar un seguimiento de los cambios en el documento mediante la función Historial de versiones. </p> <p> También puede restaurar el documento a una versión anterior de forma temporal o permanente; una función que puede salvarle la vida si elimina accidentalmente partes de su documento y no puede utilizar el <strong> Deshacer </strong> botón para restaurarlos. </p> <p> Para usar la función de historial de versiones, haga clic en <strong> Archivo </strong> en la barra de menú y seleccione <strong> Historial de versiones </strong> desde el menú desplegable. Verá que también puede nombrar una versión, por lo que puede usar eso para realizar un seguimiento de los cambios continuos en el documento, especialmente si otros usuarios están haciendo ediciones en el mismo documento. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Esta función solo está disponible en el escritorio. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Modo de sugerencia y revisión </h2> <p> Si bien es genial colaborar con otros y editar un documento juntos, puede ser difícil (y complicado) realizar un seguimiento de los cambios que cada persona ha realizado. </p> <p> La función Sugerencias le permite simplemente sugerir ediciones si no desea modificar el documento por completo. Sus sugerencias aparecerán en el editor como comentarios en la barra lateral, y el editor puede realizar cambios instantáneos al aceptar la sugerencia. También puede mantener hilos de conversación con <strong> Respuesta </strong> , para que pueda dar y recibir comentarios directamente en la página del documento sin tener que enviar correos electrónicos de un lado a otro. </p> <p> Para sugerir ediciones, haga clic en el icono de lápiz para el modo de edición en la esquina superior derecha de su documento abierto, luego seleccione <strong> Sugerencia </strong> . </p> <p> Para ver el documento sin las sugerencias, haga clic en <strong> Visita </strong> . Podrá leer sin los tachados y las ventanas emergentes de comentarios. </p> <p> Para ahorrar tiempo, puede aceptar o rechazar todas las sugerencias a la vez. Hacer clic <strong> Herramientas </strong> , luego seleccione <strong> Revisar las ediciones sugeridas </strong> . Hacer clic <strong> Aceptar todo </strong> o <strong> Rechazar todo </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Esta función solo está disponible en el escritorio. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Agregar fuentes </h2> <p> Si alguna vez quieres <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> estiliza tu texto </a> para adaptarse a su mensaje, también puede hacerlo con Google Docs. Además de las 24 fuentes predeterminadas que ya están programadas en la herramienta Google Docs, puede agregar varias fuentes geniales de su elección para amplificar su texto visualmente. </p> <p> Para agregar fuentes, simplemente haga clic en <strong> Fuentes </strong> en la barra de menú y seleccione <strong> Más fuentes </strong> . Seleccione tantas fuentes como desee de la colección proporcionada. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Esta función solo está disponible en el escritorio. </p> <p> </p> <h2 id=\"compare-documents\"> 6. Comparar documentos </h2> <p> Esta es otra función que puede utilizar para realizar un seguimiento de los cambios realizados en un documento por usted mismo o un colaborador. Es especialmente útil para documentos grandes y, como sugiere el nombre, puede comparar dos documentos para ver las diferencias entre ellos. </p> <p> Para usar esta función, abra el documento base para el que desea hacer una comparación, luego haga clic en el <strong> Herramientas </strong> y seleccione <strong> Comparar documentos </strong> . </p> <p> En el cuadro de diálogo que aparece, seleccione el documento con el que desea compararlo desde su unidad y haga clic en <strong> Comparar </strong> . En el <strong> Atribuir diferencias a </strong> campo, ingrese el nombre del colaborador que será el autor de las ediciones sugeridas en el documento final. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> Las diferencias se mostrarán de la misma manera que en el <strong> Sugerencia </strong> modo que discutimos anteriormente, y también puede aceptar o rechazar las ediciones. </p> <p> Esta función solo está disponible en el escritorio. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Buscar y reemplazar </h2> <p> Si alguna vez necesita reemplazar varias instancias de un error dentro de su texto, Google Docs facilita hacerlo con la función Buscar y reemplazar. </p> <p> Para los usuarios que están familiarizados con la función Buscar y reemplazar en Microsoft Word, esto funciona igual. </p> <p> Para encontrar una palabra o frase en particular en su documento, use el atajo <strong> Ctrl + F </strong> en una PC con Windows o <strong> Comando + F </strong> en una Mac. Ingresa la palabra en el campo &quot;Buscar en documento&quot;. </p> <p> Para reemplazar el texto encontrado, haga clic en los tres puntos en el lado derecho y seleccione <strong> Encontrar y reemplazar </strong> . </p> <p> Luego, ingrese el texto en el <strong> Encontrar </strong> campo, y el texto de reemplazo en el <strong> Reemplazar con </strong> campo. Desplácese por las instancias de texto con el cursor hacia arriba y hacia abajo y haga clic en <strong> Reemplazar </strong> para intercambiarlos individualmente. O haga clic en <strong> Reemplaza todo </strong> para reemplazar todo el texto seleccionado a la vez. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Use un diccionario </h2> <p> Para ayudarte a concentrarte y evitar tener que cambiar entre pestañas cuando buscas el significado de una palabra, Google Docs tiene un diccionario integrado en la aplicación. </p> <p> Cuando esté escribiendo y necesite buscar una palabra, resalte la palabra, luego haga clic derecho y seleccione <strong> Definir </strong> del menú. La herramienta Diccionario buscará la definición de la palabra en Internet y aparecerá en el lado derecho de la pantalla. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Agregue acentos de idioma </h2> <p> Dígale adiós a la memorización de atajos de teclado de acento o a copiar / pegar letras acentuadas de otros documentos. </p> <p> Para usar letras acentuadas, debe descargar <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> el complemento &quot;Easy Accents&quot; </a> . Le permite insertar acentos para 20 idiomas diferentes directamente desde una barra lateral en su documento. </p> <p> Descargue el complemento Google Doc abriendo el <strong> Herramientas </strong> menú, luego haga clic en <strong> Complementos </strong> y <strong> Obtener complementos </strong> . En el cuadro de Google Marketplace que aparece, busque <strong> Acentos fáciles </strong> y haga clic en el botón azul de instalación para agregarlo a su colección de complementos de Google Docs. </p> <p> Después de la instalación, haga clic en el <strong> Complementos </strong> menú para seleccionar el complemento Easy Accents y comenzar a agregar los acentos correctos en todas sus palabras extranjeras. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Este complemento solo está disponible en computadoras de escritorio, pero los teclados móviles generalmente admiten acentos de idioma, por lo que podrá escribir texto con tildes en su teléfono sin el complemento. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Cree accesos directos personalizados </h2> <p> La mayoría de la gente está familiarizada con <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Atajos de Microsoft Word </a> , pero también puedes crear tus propios atajos en Google Docs. Para crear accesos directos personalizados, haga clic en <strong> Herramientas&gt; Preferencias&gt; Sustitución. </strong> Verá que ya hay algunos atajos de fracciones y símbolos (como cambiar 3/4 a ¾), pero siéntase libre de agregar algunos de los suyos. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Esta función solo está disponible en el escritorio. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Haga más con Google Docs </h2> <p> Ahora que ha aprendido estas herramientas de Google Docs, puede ponerlas en práctica mientras crea su próximo documento. ¡Con suerte, te facilitarán las cosas! </p>"}