{"title":"¿El controlador PS4 no funciona? Cómo solucionar los problemas más comunes","content":"<p> La mayoría de las veces, su controlador de PlayStation 4 probablemente funcione bien. Pero cuando su DualShock 4 deja de conectarse o se desconecta al azar, es frustrante. </p> <p> Veamos las correcciones para cuando su controlador de PS4 no funciona, para que pueda volver a jugar. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> El controlador PS4 no se empareja ni se conecta </h2> <p> Normalmente, cuando presiona el <strong> Botón PS </strong> en su controlador, debe encenderse y conectarse a su sistema. Sin embargo, cuando no se está conectando, verá que la barra de luz de su controlador parpadea un poco y luego se apaga. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Esto suele suceder si ha utilizado su DualShock 4 con otro dispositivo. Por ejemplo, si tu <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> empareja tu controlador de PS4 con tu PC </a> o la consola de un amigo, recordará ese dispositivo en el futuro. </p> <p> Deberá volver a emparejar su DualShock 4 con su propia PS4 en estos casos. Para hacer esto, conecte su controlador a su PS4 usando un cable micro-USB. Asegúrese de utilizar un cable de alta calidad que sepa que funciona correctamente. </p> <p> </p> <p> presione el <strong> Botón PS </strong> en su controlador por un momento, y la luz debe parpadear brevemente antes de volverse azul. Esto significa que su controlador se ha emparejado y conectado correctamente. </p> <p> Si tiene su DualShock 4 emparejado con otro dispositivo cercano, como su teléfono o una PlayStation 5, hacer esto probablemente encenderá y conectará el controlador a ese dispositivo. Por lo tanto, debe apagar y desconectar cualquier dispositivo al que esté conectado su DualShock 4 primero. </p> <p> Después de volver a emparejar su controlador, puede desconectar el cable USB y usar su controlador de forma inalámbrica como de costumbre. Tu PS4 lo recordará hasta que emparejes el controlador con otro dispositivo en el futuro. </p> <p> Tenga en cuenta que la cantidad máxima de controladores DualShock 4 que puede tener conectados a la PS4 a la vez es cuatro. Si ya tiene cuatro controladores conectados, deberá desconectar uno para dejar espacio para más. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> El controlador de PS4 se sigue desconectando </h2> <p> Si su DualShock 4 se desconecta aleatoriamente mientras juega, hay un par de soluciones que puede probar. </p> <p> Primero, asegúrese de que la batería de su controlador esté cargada. Suena simple, pero si la batería de su controlador está casi agotada, es posible que se desconecte. Para comprobar la duración de la batería de su controlador, mantenga <strong> Botón PS </strong> para abrir el menú rápido en el lado izquierdo de la pantalla. Verá un icono de controlador con pantalla de batería en la parte inferior. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Conecte su controlador a su PS4 y visite el Menú rápido nuevamente para asegurarse de ver la animación de carga de la batería. Después de que su controlador se cargue por un tiempo, intente usarlo normalmente. </p> <p> Si la batería no fue su problema, asegúrese de que no está tratando de usar su controlador demasiado lejos de su sistema. El alcance típico de Bluetooth es de alrededor de 30 pies; Dependiendo de su configuración, es posible que pueda usar su controlador más allá de esto, o estar restringido a usarlo más cerca. </p> <p> Hablando de esto, debe intentar minimizar la interferencia entre su controlador y la consola. Retire cualquier objeto metálico entre los dos, como estantes o computadoras portátiles, que podrían inhibir la señal. También debe sacar su PS4 de cualquier espacio cerrado en el que se encuentre para una mejor transmisión y recepción de la señal. </p> <p> Finalmente, recuerde que la PS4 tiene una configuración que apaga los controladores después de que están inactivos durante algún tiempo. Si no desea que su controlador de PS4 se apague cuando está viendo aplicaciones de medios como YouTube, vaya a <strong> Configuración&gt; Configuración de ahorro de energía&gt; Establecer tiempo hasta que los controladores se apaguen </strong> y elige <strong> Nunca </strong> . Tenga en cuenta que esto consumirá la batería incluso cuando esté inactivo. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> Consejos generales para arreglar un controlador de PlayStation 4 </h2> <p> Hemos analizado soluciones específicas para algunos problemas comunes de DualShock 4 anteriores. A continuación, veamos soluciones más generales para problemas con los controladores de PS4. Repase estos si necesita más ayuda. </p> <h3 id=\"restart-your-console\"> 1. Reinicie su consola </h3> <p> Si bien la mayoría de los problemas con el controlador provienen del controlador en sí, existe la posibilidad de que su PS4 sea la que tenga el problema. Para descartar esto, debe reiniciar su consola antes de continuar con la resolución de problemas. </p> <p> Si su controlador funciona lo suficiente como para acceder a los menús, mantenga presionado el <strong> Botón PS </strong> para abrir el Menú rápido, luego vaya a <strong> Energía&gt; Reiniciar PS4 </strong> para reiniciar su sistema. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> En caso de que su controlador no coopere, mantenga presionado el <strong> Energía </strong> en su consola PS4 hasta que escuche dos pitidos. Esto lo apagará por completo (sin luces en el frente); una vez que esté apagado, presione el <strong> Energía </strong> de nuevo para volver a encenderlo. </p> <p> Intente usar su controlador nuevamente después de reiniciar y vea si eso ayuda. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. Olvídese y vuelva a emparejar su controlador PS4 </h3> <p> Si tiene un segundo controlador de PS4 (o un controlador de PS Move), puede usarlo para acceder a un menú que le permite eliminar el controlador que tiene un problema. Dirigirse a <strong> Configuración&gt; Dispositivos&gt; Dispositivos Bluetooth </strong> y seleccione el <strong> DualShock 4 </strong> entrada: es la que no tiene una luz verde al lado. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> En el menú resultante, presione el <strong> Opciones </strong> botón en su controlador y elija <strong> Olvidar dispositivo </strong> . Esto hará que tu PS4 lo elimine de la memoria, por lo que tendrás que volver a emparejarlo. </p> <p> Este es un buen momento para probar un método de emparejamiento ligeramente diferente: volver a emparejarlo al inicio. Para hacer esto, apague su PS4 (como se explicó anteriormente). Una vez que se apague, conecte el controlador problemático a su consola con un cable USB. Golpea el <strong> Botón PS </strong> para encender y emparejar su controlador en un proceso. </p> <p> Si esto no funciona, vuelva a encender su PS4 e intente emparejarla de la manera normal, como se indicó anteriormente. </p> <h3 id=\"hard-reset-your-controller\"> 3. Restablecimiento completo de su controlador </h3> <p> Si quitar y volver a emparejar el controlador no funcionó, puede intentar el procedimiento de reinicio completo para el DualShock 4. Necesitará un objeto pequeño con punta, como un clip de papel doblado o una herramienta de expulsión de la tarjeta SIM, para hacer esto . </p> <p> Apaga tu PS4 y luego voltea el control. Verá un pequeño orificio al lado del tornillo junto al botón L2 (en el lado derecho del controlador cuando se le da la vuelta). Use su herramienta puntiaguda para presionar y mantener presionado el botón dentro de este orificio durante aproximadamente cinco segundos. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> Una vez que haya hecho esto, conecte su controlador a su PS4 nuevamente a través de un cable USB y vea si se empareja correctamente. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Pruebe el controlador en otro lugar </h3> <p> En este punto, si aún no lo ha hecho, debería intentar usar el controlador que tiene problemas con otro dispositivo. Si tiene problemas similares en la PS4 de un amigo o en su PC, es probable que su controlador esté defectuoso. </p> <p> También es una buena idea probar otro controlador de PS4 con su consola, si es posible. Si toma prestado el DualShock 4 de un amigo que sabe que funciona correctamente y descubre que tiene problemas con su sistema, es probable que algo esté mal con la conectividad inalámbrica de su PS4. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Utilice el controlador en modo cableado </h3> <p> Antes de renunciar al controlador, debería intentar jugar con él conectado permanentemente a través de un cable USB. Sin embargo, tenga en cuenta que esto solo funciona para el modelo revisado de controladores de PS4. Sabrá que tiene este modelo si hay una barra de luz dentro del panel táctil en la parte frontal de su controlador. De lo contrario, no puede forzar la comunicación por cable. </p> <p> Si aún no tiene uno, compre un cable largo para que pueda disfrutar de los juegos desde el sofá. La <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Paquete de tres Ailun </a> de cables micro-USB de 10 pies es una buena opción rentable. </p> <p> Para obligar a su PS4 a conectar controladores a través de USB, diríjase a <strong> Configuración&gt; Dispositivos&gt; Controladores&gt; Método de comunicación </strong> y elige <strong> Utilice un cable USB </strong> . Esto evitará que el DualShock 4 utilice Bluetooth, incluso cuando esté conectado a través de USB. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> Opciones de reparación de hardware DualShock 4 </h2> <p> Como la mayoría del hardware, los controladores DualShock 4 tienen una garantía de un año. Si compró su controlador de PS4 en el último año y no puede solucionarlo con todos los consejos anteriores, debe visitar <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> Página de reparación y reemplazo de PlayStation </a> para realizar una solicitud de reparación en su controlador. </p> <p> De lo contrario, puede intentar arreglar el hardware por su cuenta abriendo su controlador. Pero dependiendo del problema específico, esto puede ser difícil o imposible. Recomendamos hablar con un técnico de reparación local si no se siente cómodo haciéndolo usted mismo. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> Problemas con el controlador de PS4, parcheado </h2> <p> Ahora sabe cómo solucionar los problemas más comunes del controlador de PS4. Problemas más específicos, como un botón que deja de funcionar, desafortunadamente caen dentro de las soluciones de reparación de hardware mencionadas anteriormente. </p> <p> Con suerte, su problema fue fácil de solucionar. Pero si no es así, y necesita elegir un nuevo controlador de PS4, tiene muchas opciones excelentes. </p> <p> <small> Crédito de la imagen: Joeri Mostmans / <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}