{"title":"El cofundador de Netflix critica la estrategia de video de Apple TV +","content":"<p> El exjefe de Netflix, Marc Randolph, criticó la estrategia de video de Apple, diciendo que Apple TV + se está quedando atrás de la competencia debido a las ofertas gratuitas de la compañía y la falta de contenido atractivo. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple no transmite &quot;con ambos pies&quot; </h2> <p> Si le pregunta al ex CEO y cofundador de Netflix, Marc Randolph, Apple TV ha estado plagado de un problema de carga gratuita que ha contribuido al crecimiento anémico del servicio en comparación con Netflix, Disney + y otros servicios de transmisión exitosos. </p> <p> Hablando a <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Yahoo Finanzas </a> , dijo que Apple TV + está desperdiciando energía en promociones y ofertas gratuitas, mientras que debería enfocarse en agregar más contenido de calidad para aumentar el valor. </p> <blockquote> <p> Si Apple dedicara una cuarta parte del tiempo al contenido que a los sorteos, realmente podrían jugar. No tienen excusa [y] todavía no están metidos con los dos pies. Realmente tienen que hacer lo emprendedor y caminar hasta el borde del acantilado y saltar. </p> </blockquote> <p> Saltar por el borde del acantilado puede ser más fácil decirlo que hacerlo porque Apple TV + carece del poder de mercado de Disney y del reconocimiento de marca de Netflix. Ahora mismo, se trata de <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney + contra Netflix </a> y qué servicio de transmisión ofrece la mejor relación calidad-precio a los clientes potenciales. </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV + tiene la tasa de abandono más alta </h2> <p> Randolph se opone a los obsequios y promociones en el mercado de transmisión, sugiriendo que Apple TV + ‌ tiene la &quot;tasa de abandono más alta&quot; entre los principales servicios. </p> <blockquote> <p> No puedes seguir reemplazando a la gente. Tienes que darles una razón para quedarse. </p> </blockquote> <p> MoffettNathanson-HarrisX descubrió que el 29 por ciento de los que se inscribieron de forma gratuita no planean volver a suscribirse una vez que expire su prueba gratuita, según lo informado por <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> Variedad </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> Ofertas de Apple TV + gratis </h2> <p> Apple ha estado ofreciendo 12 meses de servicio gratuito de Apple TV + a todos los que compren un nuevo dispositivo elegible de la compañía, como un nuevo iPhone. Mientras tanto, <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple ha ampliado las suscripciones gratuitas de un año </a> dos veces para los que se inscribieron en 2019. </p> <p> </p> <p> Es una señal clara de que la propia Apple no cree que el servicio proporcione suficiente contenido para justificar el precio inicial de $ 5 / mes. Mírelo de otra manera: si Apple TV + hubiera superado las proyecciones internas, Apple ya se habría jactado de los números de suscriptores. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney + y Netflix ofrecen una competencia seria </h2> <p> Hace solo 15 meses que Apple TV + hizo su debut en noviembre de 2019. Disney + siguió poco después. Apple no está revelando cuántos suscriptores de pago tiene Apple TV +, pero Disney acaba de superar los 94 millones de suscriptores, superando con creces incluso sus propias expectativas. </p> <p> En comparación, Netflix contaba con 204 millones de clientes de pago a fines de 2020. Disney espera poder igualar a Netflix en términos de suscriptores en solo 12 meses. </p> <p> </p> <p> Randolph dice que Disney + &quot;se abrió camino hasta una posición realmente sólida&quot; gracias al contenido. &quot;Es realmente una guerra de quién está preparado para hacer el contenido&quot;, agregó. </p> <blockquote> <p> Estamos viendo el desarrollo de nuevas reglas del juego. Esto no es solo un anuncio, esto no es solo una promoción, lo que tienes que demostrar es que tienes el contenido, el contenido, el contenido. </p> </blockquote> <p> De hecho, el juego trata sobre el contenido. Por ejemplo, como se describe en <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> sus planes para 2021 </a> , Netflix lanzará una nueva película original cada semana durante todo el año. Por el contrario, Apple TV + presenta un puñado de películas como el drama de la Segunda Guerra Mundial protagonizado por Tom Hanks Greyhound (basado en hechos reales), el drama original Palmer protagonizado por Justin Timberlake y On The Rocks de Sofia Coppola, por nombrar solo algunos. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> Enfoque de combustión lenta de Apple </h2> <p> Lo que Randolph no reconoce es que Netflix y Disney + tenían cantidades masivas de contenido desde el primer día, mientras que Apple TV + está construyendo su biblioteca de contenido desde cero. </p> <p> Apple obviamente ha optado por un enfoque de combustión lenta, como lo demuestra la escasez de programas en relación con Disney + y Netflix. No importa cómo se mire, su estrategia con Apple TV + parece requerir atraer a las personas con ofertas gratuitas con la esperanza de que el servicio acumule suficiente contenido de calidad para convertir a los clientes gratuitos en suscriptores de pago. </p>"}