{"title":"El iPhone 13 podría presumir de una pantalla &quot;Siempre encendida&quot;","content":"<p> Apple presentó su pantalla &quot;siempre encendida&quot; para el Apple Watch Series 5 en 2019. Un par de años después, podría configurarse para llegar al iPhone, según el reportero Max Weinbach, quien compartió la información con el canal de YouTube <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> TodoApplePro </a> . </p> <p> El informe afirma que el iPhone 13, si así es como Apple decide nombrarlo, tendrá permanentemente algunas secciones de la pantalla iluminadas para mostrar ciertos detalles. </p> <h2 id=\"how-always-on-display-will-work\"> Cómo funcionará la pantalla &quot;Siempre activa&quot; </h2> <p> Estos detalles podrían incluir los íconos del reloj y la batería. Permanecerían visibles incluso cuando el iPhone está bloqueado, lo que significa que el usuario no lo está utilizando activamente. Las notificaciones, como los avisos de nuevos mensajes, solo se iluminarían temporalmente. </p> <p> Esta sería la primera vez que el iPhone viene con tecnología de pantalla &quot;siempre encendida&quot;. Sin embargo, de ninguna manera sería la primera vez que una tecnología similar llega a un teléfono inteligente. Nokia introdujo una función de pantalla &quot;siempre encendida&quot; ya en 2009. Más recientemente, se ha convertido en una función ampliamente disponible en varios teléfonos Android, incluidos los modelos fabricados por Huawei, Motorola, Samsung, Google y otros. </p> <p> La gran ventaja obvia de &quot;siempre encendido&quot; es que no requiere que el usuario despierte o desbloquee su teléfono para acceder a la información, incluso si es algo tan pequeño como verificar la hora. </p> <p> La desventaja es que consume una duración adicional de la batería, lo que ya puede ser algo premium en los teléfonos inteligentes. Sin embargo, las pantallas AMOLED pueden reducir este impacto de la batería activando solo aquellos píxeles en la pantalla que son necesarios para mostrar la información. </p> <p> En otras palabras, esta pantalla &quot;siempre encendida&quot; siempre está encendida en un sentido técnico, aunque la mayor parte de la pantalla está apagada y solo algunas partes permanecen iluminadas todo el tiempo. Esto significa que el efecto sobre la duración de la batería no es tan importante como podría ser de otro modo. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> Qué esperar del iPhone 13 </h2> <p> Es probable que el iPhone de próxima generación llegue en septiembre de 2021. Según Weinbach, contará con el mismo diseño de chasis general que la serie iPhone 12, aunque habrá algunas actualizaciones bajo el capó. </p> <p> Estos incluirán imanes MagSafe más fuertes, un sistema de cámara mejorado para tomar imágenes de la luna y las estrellas, lente de cámara ultra ancha en toda la línea de iPhone, video en modo retrato (en lugar de imágenes fijas), respaldo mate refinado y A- chip de serie. Un informe anterior ha afirmado que Apple podría <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> introducir Touch ID en pantalla </a> como alternativa a Face ID. </p> <p> Dado que todavía falta más de medio año, podrían surgir muchos detalles nuevos antes de que Apple muestre su próximo iPhone en el tercer trimestre. No obstante, parece que los rumores ya están empezando a entrar en acción. ¡Mira este espacio! </p>"}