{"title":"El gobierno de EE. UU. Desea saber sobre la precisión de las etiquetas de privacidad de las aplicaciones","content":"<p> Con sus etiquetas de privacidad de la aplicación iOS 14 en la App Store, Apple ofrece a los usuarios una nueva forma de empoderarse al tener más conocimiento sobre las aplicaciones que usan, y cómo esas aplicaciones podrían rastrearlas. </p> <p> Pero parece que también podría abrir una lata de gusanos para sí mismo, ya que ahora se está presionando a Apple para que responda por la precisión de estas etiquetas, que los desarrolladores comenzaron a enviar a Apple en diciembre. </p> <h2 id=\"concerns-over-accuracy\"> Preocupaciones por la precisión </h2> <p> Como lo señaló <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumors </a> , Apple ha recibido una <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> letra </a> del Comité de Energía y Comercio de la Cámara de Representantes de EE. UU., pidiéndole que aclare la información sobre la precisión proporcionada por el desarrollador de sus etiquetas de privacidad de aplicaciones. </p> <p> Estas etiquetas son una característica muy esperada en algunos trimestres y temida en otros de iOS 14 que obligará a los desarrolladores a ser más abiertos sobre cómo interactúan sus aplicaciones con los datos del usuario. Significa que los usuarios podrán tomar una decisión más informada cuando se trata de los beneficios y los inconvenientes de usar ciertas aplicaciones. </p> <p> </p> <p> En su carta, el Comité de Energía y Comercio de la Cámara de Representantes de EE. UU. Pregunta a Apple sobre informes que sugieren que ciertas etiquetas de privacidad de aplicaciones pueden proporcionar a los usuarios información &quot;engañosa y falsa&quot;. Eso se basa en un informe, publicado el mes pasado, que afirma que muchas aplicaciones con un buen estado de salud pueden no ser tan inocentes como sugieren. </p> <p> Un problema potencial con la función iOS 14 es que depende de la honestidad del desarrollador para decir cómo se recopilan los datos, así como para confirmar que esta información es precisa. La propia Apple señala que la información &quot;no ha sido verificada por Apple&quot;. </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Solicitar una respuesta de Apple </h2> <p> Aunque parece probable que la mayoría de los desarrolladores jueguen limpio y acaten el sistema de honor, eso no es algo que pueda darse por sentado. Apple auditará de forma rutinaria la información que se envía. Sin embargo, la enorme cantidad de aplicaciones en la App Store hace que sea imposible para Apple verificar personalmente cada listado. </p> <p> La carta del Comité de Energía y Comercio de la Cámara de Representantes de EE. UU. Continúa diciendo que: </p> <blockquote> <p> &quot;Instamos a Apple a mejorar la validez de sus etiquetas de privacidad de aplicaciones para garantizar que los consumidores reciban información significativa sobre las prácticas de datos de sus aplicaciones y que estas prácticas potencialmente engañosas no perjudiquen a los consumidores&quot;. </p> </blockquote> <p> El comité le ha pedido a Apple que brinde más detalles sobre su proceso de auditoría, si las etiquetas de privacidad de la aplicación se corregirán si se determina que son falsas, detalles sobre lo que sucede cuando los desarrolladores brindan información inexacta y más. </p> <p> Le están pidiendo a Apple que responda con la información solicitada antes del 23 de febrero. </p> <p> <small> Crédito de la imagen: Jason Dent / <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Unsplash CC </a></small> </p>"}