{"title":"El navegador Edge de Microsoft fue anfitrión de emuladores secretos de juegos de Nintendo","content":"<p> Microsoft ha eliminado una serie de emuladores de juegos ilegales que se esconden en su tienda de extensiones de navegador Microsoft Edge. La tienda de extensiones de Microsoft Edge albergaba decenas de emuladores, lo que permitía a los usuarios jugar varios juegos icónicos, ninguno de los cuales se publicó legalmente en la tienda. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft elimina emuladores de extensión de borde ilegales </h2> <p> En la tienda de extensiones de Microsoft Edge acechaban algunos de los juegos más icónicos de todos los tiempos, incluidos Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2 e incluso Minecraft. Cada juego se lanzó dentro del navegador en una ventana de emulador y permitió a los usuarios jugar a través de cada título en su totalidad. </p> <p> Sin embargo, ninguno de los títulos clásicos enumeró a los desarrolladores de juegos oficiales, como Nintendo, Sega, Atari y sí, incluso Microsoft. Los nombres de los desarrolladores enumerados incluían Gamelands, Kday y StayReal, todos los cuales son completamente ficticios y no tienen vínculos con los desarrolladores originales. </p> <p> Curiosamente, la cuenta oficial de Twitter de Microsoft Edge Development, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , publicado sobre los emuladores, que parece promocionar los juegos disponibles en la tienda de extensiones del navegador. No captamos el tweet original que promocionaba los emuladores, pero hay una copia disponible a través de <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Resetera </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> ¿Son ilegales los emuladores? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Los emuladores te permiten ejecutar diferentes programas </a> en tu ordenador. También puedes usar un emulador para jugar juegos antiguos. </p> <p> Si bien los emuladores en sí mismos no son ilegales, descargar contenido con derechos de autor para reproducir en un emulador sí lo es. El tweet de la cuenta oficial de Microsoft Edge Development fue un movimiento extraño ya que los emuladores descargaron una copia nueva de la ROM del juego para que el usuario la jugara. </p> <p> El tema del abandonware también es un área gris. Los juegos abandonados ya no se publican y ya no están disponibles para la venta en línea o en una tienda. Sin embargo, en muchos casos, los derechos de autor de estos juegos no han expirado, pero el titular de los derechos de autor no hace cumplir activamente sus derechos. </p> <p> </p> <p> En muchos casos, abandonware es ilegal. Aún así, no hay casos judiciales relacionados con abandonware, o al menos ninguno relacionado con un antiguo desarrollador de juegos que procesa a alguien por descargar un título de abandonware. </p> <p> En este ejemplo exacto, la emulación de estos juegos antiguos dentro de un navegador web es ilegal. Además, Nintendo es conocido por eliminar cualquier sitio o servicio que intente replicar o redistribuir su propiedad intelectual. </p> <p> Actualmente, los juegos se han eliminado de la tienda de extensiones de Microsoft Edge. Además, aún no se sabe cómo terminaron los juegos emulados en la tienda de extensiones o quién los puso allí. No hace falta decir que es poco probable que regresen. </p>"}