{"title":"Google lanza IA experimental que simula la sinestesia","content":"<p> Wassily Kandinsky abandonó su carrera de derecho para estudiar pintura en la Academia de Bellas Artes de Munich. Se le atribuye el mérito de ser uno de los fundadores de la abstracción pura en la pintura, y eso podría deberse a la forma intrigante en que percibía los colores y las formas. </p> <p> Esta herramienta de inteligencia artificial le permite tomar prestados los oídos de Kandinsky. Ahora puedes escuchar lo que hizo mientras pintaba (o al menos, la interpretación de Google de lo que describió). </p> <h2 id=\"what-if-you-could-hear-color\"> ¿Y si pudieras oír el color? </h2> <p> En colaboración con el Centre Pompidou de París, Google Arts &amp; Culture ha lanzado un proyecto experimental llamado <a href=\"https://artsandculture.google.com/experiment/sgF5ivv105ukhA\" target=\"_blank\" rel=\"nofollow noopener\"> Juega un Kandinsky </a> . </p> <p> Como sugiere su nombre, la herramienta interactiva le permite experimentar las pinturas abstractas de Wassily Kandinsky en forma musical. Kandinsky era un pintor ruso que padecía una afección neurológica llamada sinestesia. </p> <p> <img alt=\"A screenshot of the second part of Play a Kandinsky\" src=\"images/play-kandinsky-screenshot-2-986.png\" loading=\"lazy\"> </p> <p> La partitura, compuesta por Antoine Bertin y NSDOS, se inspiró en música de la época de Kandinsky y se generó en Transformer de Google. <a href=\"https://www.makeuseof.com/tag/what-are-neural-networks/\" target=\"_blank\" rel=\"nofollow noopener\"> red neuronal </a> . </p> <p> Al hacer clic <strong> Experimento de lanzamiento </strong> , se reproduce música y la IA le pide que haga clic en un círculo en el medio de la pantalla varias veces. Cada vez que lo hagas, los colores del círculo y el fondo detrás de él cambiarán, así como la música. </p> <p> La sinestesia es una condición que afecta su percepción: estimular un sentido desencadena una experiencia automática e involuntaria en otro. Por ejemplo, un sinestésico (una persona con sinestesia) podría pensar en el número &quot;4&quot; y ver rojo o probar manzanas cuando escuche la palabra &quot;amigo&quot;. </p> <p> Para Kandinsky, tener sinestesia significaba que veía colores cuando escuchaba música y escuchaba música mientras pintaba. &quot;El sonido de los colores es tan definido que sería difícil encontrar a alguien que expresara un amarillo brillante con notas graves o un lago oscuro con agudos&quot;, dijo una vez. </p> <p> <img alt=\"Yellow-Red-Blue (1925), by Wassily Kandinsky\" src=\"images/yellow-red-blue-kandinsky-947.png\" loading=\"lazy\"> </p> <p> En 1925, creó una obra maestra que llamó Amarillo-Rojo-Azul (en la foto de arriba). Fue una pintura al óleo que lo distinguió de los influyentes movimientos artísticos de su época, a saber, el constructivismo y el suprematismo. </p> <p> La tercera parte de Play a Kandinsky te permite escuchar la pintura en una sinfonía clásica de siete movimientos. Sus generosos usos de azul y amarillo en fuerte contraste entre sí siguen el <a href=\"https://www.makeuseof.com/how-to-use-color-theory-elevate-your-creative-projects/\" target=\"_blank\" rel=\"nofollow noopener\"> teoría del color </a> del poeta alemán Johann Wolfgang von Goethe. </p> <p> Google atribuye colores y formas a Kandinsky de la misma manera que atribuirías las teclas y cuerdas de un instrumento a un músico. &quot;Un artista extraordinariamente dotado, organizó los sonidos de color en sinfonías de color&quot;, el <a href=\"https://artsandculture.google.com/story/the-sound-of-colours/0ALymHuhPl1jLg\" target=\"_blank\" rel=\"nofollow noopener\"> historia </a> lee. </p> <p> </p> <h2 id=\"there-s-more-to-art-than-meets-the-eye\"> Hay más en el arte de lo que se ve </h2> <p> Nunca sabremos exactamente qué escuchó Kandinsky mientras trabajaba, pero son proyectos como este los que realmente despiertan la creatividad y la introspección. </p> <p> Tal vez haya algún tipo de conexión entre el arte y la música que la mayoría de nosotros no podemos entender completamente. El experimento de Google hace un buen trabajo al explorar esa posibilidad. </p> <p> <small> Crédito de la imagen: Wassily Kandinsky / <a href=\"https://commons.wikimedia.org/wiki/File:Kandinsky_-_Gelb-Rot-Blau,_1925.jpg\" rel=\"nofollow noopener\" target=\"_blank\"> Wikimedia Commons </a></small> </p>"}