{"title":"Google está agregando compatibilidad con Face ID a Chrome para iOS","content":"<p> Google está probando una nueva función de seguridad en Chrome 89 para iOS que utiliza la autenticación biométrica del iPhone para proteger sus pestañas de navegación privada. Actualmente limitado a personas en el canal beta de Chrome, esto le permitirá bloquear sus pestañas de incógnito con Face ID o Touch ID. </p> <h2 id=\"even-more-private-private-browsing\"> Navegación privada aún más privada </h2> <p> Todas las pestañas de incógnito protegidas con Face o Touch ID aparecen borrosas en el selector de pestañas. Las pestañas bloqueadas vuelven a ser visibles una vez que se confirman con la autenticación biométrica del ‌iPhone‌. </p> <p> Esta útil función no solo aumenta su privacidad, sino que también refuerza su seguridad mientras realiza múltiples tareas en las aplicaciones de su iPhone o iPad. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> señala que no todos los usuarios beta pueden acceder a la nueva opción de bloqueo debido a un componente del lado del servidor. </p> <p> </p> <h2 id=\"how-s-this-useful\"> ¿Cómo es esto útil? </h2> <p> También es útil para esos momentos en los que un amigo puede pedirle prestado su iPhone para buscar rápidamente algo en línea. Con la protección Face ID para el modo de navegación privada de Chrome, no podrán ver sus sitios web de incógnito abiertos al cambiar de pestaña. </p> <p> </p> <p> &quot;Incógnito&quot; es un nombre comercial para el modo de navegación privada de Chrome. En modo incógnito, puede navegar por la web sin que Chrome guarde información sobre la sesión. Cuando cierras una ventana de incógnito, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> toda la información de esa sesión desaparece </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> Cómo habilitar Face o Touch ID en Chrome </h2> <p> Esta próxima función nueva debe activarse manualmente en la sección Privacidad de la configuración de la aplicación de Chrome. Hay un bloqueo de privacidad similar en otras aplicaciones de Google. </p> <p> En la aplicación de búsqueda nativa, por ejemplo, la autenticación biométrica del iPhone confirma su identidad cuando vuelve a una sesión de incógnito después de 15 minutos. Una autenticación opcional Face o Touch ID también está disponible en Google Drive para proteger sus archivos cuando sale de la aplicación. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> ¿Cuándo se lanzará oficialmente la función? </h2> <p> Aún no se sabe cuándo la nueva opción de bloqueo podría lanzarse para todos, pero se espera que Chrome 89 se lance para el consumo público el próximo mes. Google también podría decidir no lanzar la función en absoluto a pesar de estar incluida en las notas de lanzamiento oficiales. </p>"}