{"title":"Ingrese a la tercera dimensión: trabajar con flujos de trabajo 3D en Adobe After Effects","content":"<p> Si está buscando mejorar su flujo de trabajo de Adobe After Effects, eventualmente deberá comenzar a lidiar con el eje Z, lo que le permitirá manipular la profundidad 3D de un objeto. </p> <p> Esto abre una gama de nuevos elementos visuales y estilos con los que trabajar, pero también crea sus propios conjuntos de limitaciones y consideraciones. </p> <p> En este artículo, cubriremos cómo habilitar y trabajar con capas 3D, así como cómo agregar y animar cámaras 3D para crear movimientos dinámicos. También se examinará un escenario en el que animamos y movemos texto en un espacio 3D. </p> <p> ¡Saltemos! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> Cómo habilitar y animar capas 3D </h2> <p> Dentro de su composición, puede alternar sus capas en su línea de tiempo para habilitarlas como 3D. </p> <p> Este es un proceso muy sencillo. Simplemente encuentra el <strong> Cubo </strong> para sus capas en su línea de tiempo, y haga clic en el cuadro debajo de él para habilitar 3D para esa capa. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> Una vez hecho esto, es probable que no vea ningún cambio inmediato. Sin embargo, si navega a sus parámetros de posición, escala y rotación en su capa, verá que ha aparecido un tercer conjunto de números ajustables. </p> <p> Estos nuevos números ahora dictan su rotación, posición y escala en el eje Z en el espacio 3D. Al igual que con sus otros parámetros, pueden ser fotogramas clave para permitir la animación y la manipulación. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> Como ejemplo, creemos una composición y una capa de texto con algunas palabras. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Una vez hecho esto, habilite la capa 3D. Tenga en cuenta que si planea utilizar el <strong> Alinear </strong> para asegurarse de que su capa esté perfectamente centrada, deberá hacer esto antes de habilitar 3D. Esto se debe a que <strong> Alinear </strong> La herramienta solo funciona en capas 2D. </p> <p> Ahora que nuestra capa de texto es una capa 3D, podemos moverla en el espacio 3D a lo largo del eje Z. Entonces, hagamos que el texto se mueva &quot;hacia la pantalla&quot;. </p> <p> Primero, configuraremos nuestro parámetro Z-Axis. De forma predeterminada, se establece en cero. Vamos a ponerlo en <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Ahora, navegaremos dos segundos hacia abajo en nuestra línea de tiempo y estableceremos nuestro valor del eje Z en <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> Con este cambio, ahora deberíamos ver que el texto se mueve &quot;hacia&quot; la pantalla. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> ¿Qué son las cámaras 3D? </h2> <p> Hemos animado con éxito un objeto en el espacio 3D en After Effects. Pero, ¿qué sucede si tiene varios objetos y desea crear una sensación de que el espectador se acerca o se aleja de ellos? </p> <p> Simplemente podría animar cada elemento individual para que se mueva hacia usted, pero eso requeriría mucho tiempo y no sería particularmente eficiente. Aquí es donde usaría una cámara 3D. </p> <p> </p> <p> Si usa software 3D como Cinema 4D o Blender, es probable que haya usado cámaras 3D antes. Si alguna vez ha jugado un juego de computadora, también ha experimentado una cámara 3D que mueve su vista en un mundo 3D. </p> <p> Todo esto puede parecer complejo al principio, pero las cámaras 3D funcionan como lo haría una cámara real. Le brindan un campo de visión que se puede manipular y mover en un espacio 3D. </p> <p> Trabajemos en un ejemplo. </p> <h3 id=\"setting-up-a-3d-camera\"> Configurar una cámara 3D </h3> <p> Para comenzar, cree varias capas de texto 3D y colóquelas secuencialmente en el eje Z. </p> <p> En este ejemplo, una brecha de <strong> 3000 píxeles </strong> entre cada capa se ha utilizado. La primera capa se sitúa en cero, la siguiente en 3.000, la siguiente en 6.000 y así sucesivamente. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Ahora es el momento de crear una cámara 3D haciendo clic en <strong> Capa </strong> &gt; <strong> Nuevo </strong> &gt; <strong> Cámara </strong> , sobre la cual verá una ventana para ajustar la configuración de su nueva capa de cámara. Estos vienen en dos tipos: <strong> Un nodo </strong> y <strong> Dos nodos </strong> . </p> <p> La <strong> Un nodo </strong> La cámara está diseñada para operar y emular una cámara del mundo real lo más cerca posible, y el punto de enfoque se designa manualmente mediante el movimiento de la cámara. </p> <p> A <strong> Dos nodos </strong> La cámara está diseñada para seguir un único punto de interés, lo que la hace ideal para orbitar o seguir un objeto en movimiento. </p> <p> En este escenario, el <strong> Un nodo </strong> se utilizará la cámara. Notará una serie de configuraciones adicionales en la ventana, como <strong> Zoom </strong> , <strong> Punto de vista </strong> , <strong> Habilitar la profundidad de campo </strong> , y <strong> Longitud focal </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Estos están diseñados para reflejar la configuración de la cámara del mundo real. Si sabe cómo funcionan, no dude en jugar con ellos. De lo contrario, puede elegir una serie de ajustes preestablecidos en la esquina superior derecha. </p> <p> Vamos a seleccionar el <strong> 35 mm </strong> preestablecido por ahora. Ahora que nuestra capa de cámara está configurada y en la escena, no verá mucha diferencia al principio. </p> <h3 id=\"using-3d-camera-navigation\"> Uso de la navegación de la cámara 3D </h3> <p> Hay dos métodos mediante los cuales puede ajustar y animar la vista de la cámara. La más precisa es ingresando diferentes <strong> Posición </strong> valores en el <strong> Transformar </strong> ajustes para la capa de la cámara. A continuación, puede crear fotogramas clave como lo haría al animar cualquier otra capa. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> A medida que mueva la cámara, notará que todos los demás objetos 3D de su escena se moverán en relación con ella. Tenga en cuenta que la cámara <strong> no afecta a las capas 2D </strong> . </p> <p> Por lo tanto, configuremos nuestra cámara para que se mueva en el eje Z de cero a 9,000 en un intervalo de cuatro segundos, y hagamos un fotograma clave de nuestro movimiento. </p> <p> ¡Ahí tienes! Si lo ha configurado correctamente, las palabras deben empujar &quot;hacia&quot; usted, &quot;a través&quot; del campo de visión y &quot;detrás&quot; del espectador. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> Otras formas de mover la cámara 3D </h3> <p> Si prefiere ser un poco más experimental y menos orientado a los números con su cámara, existen otros medios para moverse, navegar y adaptarse. La <strong> Orbita </strong> , <strong> Sartén </strong> , y <strong> Muñequita </strong> Las herramientas en la parte superior de la barra de herramientas le permiten hacer esto. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> Con estos, puede hacer clic y arrastrar para moverse de un lado a otro ( <strong> Sartén) </strong> , rotar alrededor ( <strong> Orbita </strong> ) y acercar y alejar ( <strong> Muñequita </strong> ). Estos controles son menos precisos que ingresar números, pero son excelentes para planificar los movimientos y animaciones de la cámara. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> La práctica conduce a la perfección </h2> <p> Ahora debería poder crear y animar capas 3D a lo largo del eje Z, y también trabajar con cámaras 3D para navegar con múltiples objetos 3D. </p> <p> Si le gusta trabajar en un espacio 3D, es posible que desee explorar las posibilidades más avanzadas que puede ofrecer una pieza de software 3D más dedicada, como Blender. </p>"}