{"title":"Informe: Android 12 contará con un modo de una mano","content":"<p> Hemos llegado oficialmente a la fase del ciclo de vida de Android 11 donde los rumores de Android 12 comienzan a salir con toda su fuerza. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> Desarrolladores XDA </a> ha informado que Google está trabajando en un modo de una mano para Android 12 que hará que sea mucho más fácil navegar por el teléfono con una sola mano. Ya sea que tenga manos grandes o pequeñas, esto podría abrir una forma completamente nueva de interactuar con su dispositivo Android. </p> <p> Por supuesto, muchos fabricantes de dispositivos y <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> Los desarrolladores de software han introducido soluciones para mejorar la usabilidad con una sola mano. </a> . Aún así, será mucho más agradable usarlo cuando esté integrado directamente en el sistema operativo. </p> <h2 id=\"android-12-s-one-handed-mode\"> Modo de una mano de Android 12 </h2> <p> Según el informe, Google planea agregar la función de una mano a AOSP, que es la versión de código abierto de Android que cualquier desarrollador de software puede usar en sus dispositivos. Eso también significa que los OEM que aún tienen que desarrollar su propio modo con una mano tendrán una manera fácil de implementar la función en sus dispositivos. </p> <p> Lo que el informe no indicó fue si Google requeriría que los fabricantes de teléfonos usen la función de una mano de Android 12 o si sería opcional. </p> <p> Como todavía es increíblemente temprano, no sabemos exactamente cómo funcionará el modo de una mano de Android 12. Si la capacidad pasada de Google para agregar funciones al sistema operativo es una indicación, esperaríamos que la empresa hiciera un buen trabajo con la implementación. Google puede optar por reducir toda la pantalla a una esquina del dispositivo para facilitar el acceso. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> El informe también indica que el modo de una mano de Android 12 tendrá una forma de activarlo usando el modo tradicional de tres botones junto con el modo de navegación gestual más nuevo. </p> <p> Como se mencionó, muchos fabricantes de equipos originales de teléfonos inteligentes ya han implementado la función en su propia versión modificada de Android. Por ejemplo, Huawei realmente intentó enviar su versión de la función a AOSP, pero Google la rechazó. Quizás Google lo rechazó porque la compañía sabía que tenía la intención de traer su propia versión de la función. </p> <p> Debido a que esta filtración es tan temprana, aún no hay fotos que demuestren la función, por lo que tendremos que esperar hasta que Android 12 se acerque a su lanzamiento. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> ¿Cuándo se lanzará Android 12? </h2> <p> Lamentablemente, no sabemos exactamente cuándo se lanzará Android 12 al público (aunque no lo será por un tiempo). Tampoco sabemos exactamente cuándo estará disponible esta función para los desarrolladores o para las versiones Beta o Stable de Android. </p> <p> Como siempre ocurre con las nuevas funciones de Android, tendremos que esperar y ver si se trata del sistema operativo. </p>"}