{"title":"JPG vs JPEG: ¿Cuál es la diferencia entre estos formatos de archivo de imagen?","content":"<p> No todos los formatos de archivo de imagen son iguales. De hecho, muchos de ellos se crearon para abordar un problema que un formato ya existente no podía resolver. El JPEG, por ejemplo, surgió porque los tamaños de los archivos de imagen consumían demasiado espacio de almacenamiento. </p> <p> Lo crea o no, las extensiones de archivo JIF, JPEG y JPG se refieren más o menos a lo mismo. Para entender por qué el formato de archivo tiene tantos nombres, necesitamos desentrañar un poco de historia complicada. </p> <h2 id=\"what-is-a-jpeg\"> ¿Qué es un JPEG? </h2> <p> El acrónimo JPEG significa Joint Photographic Experts Group; el tipo de archivo recibió el nombre del subcomité que ayudó a crear el estándar JPEG Interchange Format (JIF). Fue publicado por primera vez en 1992 por la Organización Internacional de Normalización (ISO). </p> <p> Los archivos JPEG son imágenes rasterizadas fijas de 24 bits, con ocho bits en cada canal del modelo de color RGB. Esto no deja espacio para un canal alfa, lo que significa que, si bien los archivos JPEG pueden admitir más de 16 millones de colores, no pueden admitir transparencias. </p> <p> Cuando una imagen se guarda como JPEG, algunos de sus datos se descartan en un proceso denominado con pérdida <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Compresión de archivo </a> . A su vez, la imagen ocupa un 50-75 por ciento menos de espacio de almacenamiento (en comparación con formatos más antiguos como BMP) con poca o ninguna pérdida perceptible en la calidad de la imagen. </p> <p> La compresión JPEG se basa en una técnica de compresión de imágenes con pérdida llamada transformada de coseno discreta (DCT), que fue propuesta por primera vez por el ingeniero eléctrico Nasir Ahmed en 1972. </p> <h3 id=\"what-is-a-jif\"> ¿Qué es un JIF? </h3> <p> Puede pensar que un archivo JIF es como un JPEG en su forma &quot;más pura&quot;. Sin embargo, el formato ya no se usa mucho porque presenta algunas limitaciones frustrantes. Por ejemplo, las definiciones de aspecto de color y píxel de un JIF causaron problemas de compatibilidad entre codificadores y decodificadores (visores). </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> Afortunadamente, estos problemas se abordaron posteriormente mediante otras normas &quot;complementarias&quot; que se basaron en el JIF. El primero de ellos fue el formato de intercambio de archivos JPEG (JFIF), y más tarde, el <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Formato de archivo de imagen intercambiable </a> (Exif) y perfiles de color ICC. </p> <p> JPEG / JFIF es el formato más popular actualmente para almacenar y transmitir imágenes fotográficas en Internet, mientras que JPEG / Exif es para cámaras digitales y otros dispositivos de captura de imágenes. La mayoría de la gente no distingue la diferencia entre estas variaciones y simplemente se refiere a ambas como solo JPEG. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> ¿Qué es un JPG2 o JPF? </h3> <p> En 2000, el grupo JPEG lanzó otro formato de archivo de imagen llamado JPEG 2000 (sus extensiones de archivo son JPG2 y JPF). Estaba destinado a ser un sucesor del JPEG, pero no era tan popular. Incluso cuando su método de codificación avanzado a menudo conducía a imágenes de mejor calidad. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Crédito de la imagen: Dake / <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> El formato de archivo JPEG 2000 fracasó por un pequeño número de razones. Por un lado, se basaba en un código completamente nuevo y, por lo tanto, no era compatible con JPEG. Además de eso, el manejo de archivos JPEG 2000 requería más memoria para procesar, lo que en ese entonces era un factor decisivo. Después de todo, la computadora promedio en ese momento solo tenía 64 MB de memoria. </p> <p> El JPEG 2000 ha experimentado un pequeño resurgimiento ahora que el hardware de la computadora, en general, ha mejorado enormemente durante los últimos 20 años, pero el formato de archivo todavía está muy infrautilizado. El único navegador de Internet que tiene soporte para archivos JPEG 2000 en el momento de escribir este artículo es Safari. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG frente a JPG </h3> <p> Las primeras versiones de Windows (específicamente los sistemas de archivos MS-DOS 8.3 y FAT-16) tenían un límite máximo de 3 letras cuando se trataba de la longitud de las extensiones de archivo. JPEG tuvo que acortarse a JPG para no exceder el límite. Las computadoras Mac y Linux nunca tuvieron tal cosa, por lo que los usuarios continuarían guardando imágenes como JPEG. </p> <p> </p> <p> Programas de edición de imágenes populares que funcionaron en diferentes sistemas operativos, como Photoshop y <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> Cañutillo </a> —Con el tiempo establecería su extensión de archivo JPEG predeterminada en JPG en un intento de minimizar la confusión. </p> <p> Y así es como terminamos con dos extensiones de archivo para el mismo formato: JPEG y JPG. Al elegir cómo guardar su imagen, no hay diferencia entre ellos. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG vs. PNG: ¿Cuál es mejor? </h2> <p> </p> <p> El JPEG y el PNG se lanzaron en la misma década, y cada formato de archivo resolvió un problema de imagen digital diferente al que se enfrentaba el mundo de la tecnología en ese entonces. Se podría decir que es natural que se comparen constantemente ... y lo son, incluso hasta el día de hoy. Entre JPEG y PNG, ¿qué formato de archivo de imagen reina supremo? </p> <p> Honestamente, la respuesta depende del tipo de imagen que esté guardando. </p> <p> Los archivos JPEG son más adecuados para fotografías porque utilizan compresión con pérdida para mantener tamaños de archivo razonables. Las fotografías son imágenes tan grandes y detalladas que los artefactos de compresión (distorsiones sutiles de la imagen causadas por la compresión) no se notan mucho en ellas. </p> <p> Por otro lado, las imágenes con puntos nítidos, bordes nítidos y con grandes áreas de un color (por ejemplo, logotipos vectoriales, pixel art, etc.) no se ven del todo bien cuando se guardan como JPEG. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Crédito de la imagen: Axel Grimard / <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Aquí es donde puede entrar el archivo Portable Network Graphics (PNG). Desarrollado por el Grupo de desarrollo de PNG cuatro años después del lanzamiento de JPEG, PNG admite la transparencia y la compresión de datos sin pérdidas. Por lo tanto, los PNG se utilizan a menudo si se debe mantener la calidad de la imagen y el tamaño del archivo no es un problema. </p> <p> Una buena regla general es mantener JPEG para fotografías y guardar PNG para imágenes con transparencia e imágenes no fotográficas. Para obtener más información sobre los diferentes tipos de archivos (no solo imágenes), consulte nuestra guía para <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> saber cuándo utilizar qué formato de archivo. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG y JPG tienen el mismo formato de archivo </h2> <p> A pesar de la confusión que ha causado el JPEG con sus muchas actualizaciones y variaciones, la eventual inundación de imágenes digitales en Internet a mediados de los 90 fue indudablemente causada principalmente por su lanzamiento. </p> <p> La próxima vez que esté listo para exportar una foto desde un editor de imágenes y se le presente la larga lista de formatos disponibles, recuerde: JPEG y JPG son lo mismo. </p>"}