{"title":"Juegos de rol de computadora frente a juegos de rol clásicos: ¿Qué significa CRPG en 2021?","content":"<p> La historia de los juegos de rol por computadora es tan larga como la historia de los videojuegos, evolucionando y creciendo juntos a lo largo de los años. Y así como los CRPG evolucionaron, mejorando los gráficos, agregando o eliminando mecánicas de juego, también lo hicieron el significado y la terminología utilizados para describirlos. </p> <p> El acrónimo CRPG, que tradicionalmente significaba Computer Role Playing Game, amplió su significado con el tiempo para incluir juegos de rol para diferentes plataformas. Ahora ha adoptado un nuevo significado. Aunque su nuevo significado no es completamente diferente del original, ahora describe un subgénero específico de RPG. </p> <h2 id=\"the-history-of-crpgs\"> La historia de los CRPG </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> La historia de los CRPG comenzó en la década de 1970 con el lanzamiento de la primera adaptación de videojuego del juego de rol de mesa Dungeons &amp; Dragons, Dungeon. El juego estaba disponible originalmente en Atari (puedes jugarlo a través de <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, un servicio de transmisión de juegos en Plex </a> ). </p> <p> Aunque la jugabilidad de Dungeon se basaba principalmente en texto, describía completamente los movimientos de tu grupo de varios personajes en un entorno de fantasía mientras implementaba la mayoría de los principios básicos de Dungeons &amp; Dragons. </p> <p> En ese entonces, los etiquetamos RPG de computadora para diferenciarlos de sus contrapartes de mesa, que eran mucho más populares en ese momento, y simplemente los conocíamos como juegos de rol. </p> <p> En la década de 1990, los CRPG estaban en plena floración, ahora podían mostrar un mundo de fantasía en su totalidad, al menos en una perspectiva de arriba hacia abajo o vista isométrica. Tal fue el caso de Ultima VII, uno de los CRPG más interactivos que ha jugado este escritor. </p> <p> Puedes moverte o interactuar con casi todo lo que ves: puedes fabricar armas, tocar instrumentos e incluso llevar a tu miembro del grupo muerto fuera de una mazmorra hasta la sala del trono del rey para que resucita </p> <p> Baldur&#39;s Gate fue uno de los que mejor emuló la experiencia de los juegos de rol de mesa. Adaptó el conjunto de reglas de Dungeons &amp; Dragons 2nd Edition (AKA Advanced Dungeons &amp; Dragons) en un isométrico <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> CRPG pausable en tiempo real </a> . Este tipo de CRPG enfatizaba las tácticas en la batalla, la progresión del personaje, la toma de decisiones y fomentaba la exploración. </p> <p> </p> <p> Hoy, en un mundo donde las consolas dominan el mercado, los videojuegos de rol se han vuelto más populares que los juegos de rol de mesa. En la medida en que en el uso actual, el acrónimo RPG se refiere más a su versión de videojuego. Llamarías a Dungeon&#39;s &amp; Dragons un juego de rol de mesa, en lugar de solo un juego de rol. </p> <p> Con la evolución de los gráficos, las mecánicas de juego de CRPG se adaptaron a los estándares gráficos modernos. Las series de CRPG como The Elder Scrolls, Gothic o The Witcher revolucionaron el género, introduciendo algunas mecánicas de juego nuevas y lanzando otras. </p> <p> Estos juegos de rol están más orientados a la acción y de ritmo rápido, ubicándose de alguna manera, aunque no completamente, dentro del subgénero de hack and slash (¡sin embargo, estos siguen siendo juegos de rol sólidos!) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Una nueva ola de CRPG </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> Sin embargo, yendo en contra de la tendencia actual de la industria de los videojuegos de apostar por el realismo gráfico, llegó una nueva ola de CRPG. Los juegos de rol de la vieja escuela o clásicos influyen mucho en estos juegos y hacen énfasis en la mecánica del juego y la inmersión, más que en las imágenes. </p> <p> Por lo general, son juegos isométricos, con batallas tácticas en pausa en tiempo real o por turnos. Estos CRPG también hacen todo lo posible para ser lo más inmersivos posible, proporcionándote bloques algo grandes de prosa bien elaborada y una sólida historia de fondo. </p> <p> La mayoría de ellos se basan en el texto en lugar de la actuación de voz para la mayoría de los diálogos, al igual que los CRPG de la vieja escuela. Algunos de estos CRPG incluyen Pillars of Eternity, Divinity: Original Sin o Pathfinder: Kingmaker. </p> <p> Estos juegos también enfatizan las tácticas de batalla, la progresión de los personajes, la toma de decisiones y fomentan la exploración, como lo hacían los CRPG de la vieja escuela. Por estas razones, los consideramos más relacionados con los juegos de rol clásicos que con la mayoría de los juegos de rol modernos. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> Qué significa CRPG en 2021 </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> Desde la década de 2000, RPG se había convertido en el término estándar para referirse a cualquier videojuego de rol. Pero alrededor de 2015, lanzaron Divinity: Original Sin y Pillars of Eternity. </p> <p> Estos juegos de rol fueron una desviación de la toma orientada a la acción de los juegos de rol modernos, aunque son muy similares a los títulos más antiguos tanto en estética como en mecánica de juego. Fue en esta época cuando surgió la necesidad de un nuevo término para diferenciar estos juegos de rol de los juegos de rol modernos. </p> <p> Aunque la gente ha usado los términos &quot;vieja escuela&quot; y &quot;RPG clásico&quot; en línea durante años para describir estos juegos, este último es el que se quedó. Así como los videojuegos de rol modernos reclamaron el acrónimo RPG para sí mismos, la gente ahora llama a los juegos de rol de la vieja escuela &quot;CRPG&quot;. </p>"}