{"title":"Los AirTags tan esperados finalmente podrían debutar en marzo","content":"<p> Se rumorea que los AirTags de Apple, un rastreador de ubicación en miniatura para llaves y otros objetos pequeños, están a la vuelta de la esquina desde 2019.Sin embargo, seis semanas después de 2021, aún no han sido anunciados por Apple, y mucho menos para comenzar a enviar. A los consumidores. </p> <p> Eso bien podría cambiar el próximo mes, según el eterno informador de Apple, Jon Prosser. En un tweet enviado el viernes 12 de febrero, Prosser afirmó que &quot;los AirTags todavía están en marcha para marzo. No he oído hablar de más retrasos esta vez&quot;. </p> <h2 id=\"what-to-expect-from-airtags\"> Qué esperar de AirTags </h2> <p> Prosser se refiere a un retraso anterior que informó a fines del año pasado, antes del evento de medios de Apple del 13 de octubre. En ese momento, Prosser señaló en <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800\" target=\"_blank\" rel=\"nofollow noopener\"> Gorjeo </a> que había escuchado de sus fuentes (aparentemente bien situadas) que &quot;Apple ha retrasado el anuncio y lanzamiento de AirTags hasta marzo de 2021&quot;. Al cabo de medio año, parece que no habrá más retrasos que detengan el lanzamiento de AirTags. Uno esperaría, al menos. </p> <p> Según se informa, AirTags utilizará la tecnología de banda ultra ancha de Apple para permitir que los iPhones determinen su ubicación precisa con un alto grado de precisión. Supuestamente usarán señales de audio y un marcador virtual aumentado para mostrar exactamente dónde se encuentra el objeto, adjunto a las AirTags. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Los AirTags todavía están activos para marzo. <br><br> No he oído hablar de más retrasos esta vez. 🤞 </p> - Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1360265330296250377?ref_src=twsrc%5Etfw\"> 12 de febrero de 2021 </a></blockquote>  <p> Encontrar los AirTag individuales será <a href=\"https://www.makeuseof.com/apple-find-my-items-hidden-tab/\" target=\"_blank\" rel=\"nofollow noopener\"> hecho a través de la aplicación &quot;Find My&quot; de iOS </a> , que también permite a los usuarios rastrear sus iPhones, iPads, Mac y otros dispositivos Apple. Los AirTags serán el rival de Apple de los populares productos de rastreo Bluetooth de compañías como Tile. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Entonces, sobre AirTags. <br><br> Este me duele el corazón ... <br><br> Me han dicho que Apple ha retrasado el anuncio y el lanzamiento de AirTags hasta marzo de 2021. 😳 <a href=\"https://t.co/xtUvCAFmoE\"> https://t.co/xtUvCAFmoE </a> <a href=\"https://t.co/DIUlcp01Xy\"> pic.twitter.com/DIUlcp01Xy </a></p> - Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800?ref_src=twsrc%5Etfw\"> 9 de octubre de 2020 </a></blockquote>  <p> Apple aún tiene que anunciar un evento especial de marzo, en el que se podrían anunciar los AirTags. Sin embargo, si alberga uno, estará en consonancia con los últimos años. Durante seis de los últimos 10 años, Apple ha organizado un evento en marzo en el que mostró nuevos productos. </p> <p> El año pasado, se rumoreaba mucho un evento, pero no tuvo lugar, probablemente debido al inicio de la pandemia de COVID-19 en los EE. UU. Y en otros lugares. Sin embargo, ahora que Apple cambió a eventos virtuales, esto no le impedirá organizar otro evento el próximo mes. Alternativamente, Apple podría anunciar los AirTags a través de un comunicado de prensa. </p> <p> </p> <h2 id=\"expect-a-new-ipad-pro-as-well\"> Espere un nuevo iPad Pro también </h2> <p> Es posible que este tampoco sea el único producto nuevo de Apple el próximo mes. Prosser también respondió a una pregunta sobre el próximo iPad Pro de Apple, diciendo que &quot;también está [programado] para marzo, hasta donde yo sé&quot;. </p> <p> Si bien Prosser se ha equivocado antes, tiene un récord general impresionante cuando se trata de anuncios precisos de Apple. ¿Los AirTags y el iPad Pro de próxima generación estarán entre ellos? No hay que esperar mucho hasta que lo averigüemos. </p> <p> <small> Crédito de la imagen: iphonedigital / <a href=\"https://www.flickr.com/photos/137872055@N03/22522566994/\" target=\"_blank\" rel=\"nofollow noopener\"> Flickr </a></small> </p>"}