{"title":"La última actualización de WatchOS defiende contra el error de Apple Watch-Bricking","content":"<p> La última actualización de watchOS de Apple, la versión de software 7.3.1, incluye una solución muy importante: resolver un error que impide que algunos dispositivos Apple Watch Series 5 y Apple Watch SE se carguen cuando ingresan al modo de reserva de energía. </p> <p> La compañía también ha lanzado un nuevo programa de reparación gratuito para los dispositivos afectados que están atrapados en este modo de bajo consumo y no pueden salir de él. Este error esencialmente &quot;bloquea&quot; su Apple Watch, haciéndolo ya no funcional. </p> <h2 id=\"the-power-reserve-mode-bug\"> El error del modo de reserva de energía </h2> <p> El modo de reserva de energía se inicia cuando un Apple Watch tiene poca batería. Impide que su Apple Watch se comunique con su iPhone. También evita que los usuarios accedan a otras funciones del Apple Watch. Para salir del modo de reserva de energía, los usuarios deben cargar su Apple Watch. </p> <p> En un <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> página de soporte sobre el error y el programa de reparación </a> , con fecha del 15 de febrero, Apple comienza señalando: </p> <blockquote> <p> Un número muy reducido de clientes con modelos Apple Watch Series 5 o Apple Watch SE que ejecutan watchOS 7.2 o 7.3 han experimentado un problema con su reloj que no se carga después de ingresar a la reserva de energía. </p> </blockquote> <p> Para saber si tiene un modelo de Apple Watch afectado, Apple recomienda colocar su reloj en un cargador y esperar al menos 30 minutos. Si no se carga, comuníquese con el Soporte técnico de Apple y ellos se encargarán de una reparación gratuita por correo. </p> <p> Los relojes serán examinados para comprobar que son elegibles y, siempre que lo sean, la reparación se realizará de forma gratuita y el Reloj reparado se devolverá a su propietario. </p> <p> No está claro exactamente cuántos relojes Apple se ven seriamente afectados por el error. Sin embargo, parece que el problema solo afecta a un subconjunto de los modelos Apple Watch Series 5 o Apple Watch SE, y no a otros modelos. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> Cómo actualizar a WatchOS 7.3.1 </h2> <p> Para aquellos que no han experimentado el error, vale la pena actualizar a la última versión de watchOS solo para protegerse de que suceda potencialmente. </p> <p> La importancia de la corrección de errores está indicada por el hecho de que Apple lanzó inmediatamente watchOS 7.3.1 a todos los usuarios. Esto contrasta con la forma en que normalmente emite actualizaciones de software al ponerlas a disposición inicialmente para los desarrolladores para las pruebas beta. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple lanzó watchOS 7.3 </a> a finales de enero. </p> <p> Los usuarios pueden descargar watchOS 7.3.1 usando la aplicación Apple Watch en iPhone. Para hacer esto, deben ir a <strong> General&gt; Actualización de software </strong> . Su Apple Watch debe tener al menos un 50 por ciento de batería para poder actualizarse. También debe estar muy cerca de su iPhone. </p>"}