{"title":"LastPass lo restringirá a un tipo de dispositivo a menos que pague","content":"<p> LastPass, el popular administrador de contraseñas, está experimentando un gran cambio. Pronto, quienes utilicen el servicio de forma gratuita solo podrán hacerlo en computadoras o teléfonos móviles, pero no en ambos, a menos que paguen. </p> <p> Significa que LastPass ya no es una opción atractiva como administrador de contraseñas gratuito. En un mundo en el que cambiamos constantemente entre computadoras y teléfonos móviles, tener un administrador de contraseñas que solo funcione para un tipo de dispositivo es inútil. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> ¿Qué está cambiando en LastPass Free? </h2> <p> Como se anunció en el <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog de LastPass </a> , se están realizando cambios para la versión gratuita del administrador de contraseñas. </p> <p> Actualmente, LastPass Free le permite utilizar el servicio en todos sus dispositivos. Ya sea que use LastPass en su computadora, tableta o dispositivo móvil, no importa. Todo eso es gratis. Eso debe cambiar el 16 de marzo de 2021. </p> <p> A partir de entonces, LastPass Free solo incluirá un número ilimitado de dispositivos de un tipo: ordenadores o móviles. </p> <p> Para LastPass, las computadoras se clasifican como cualquier computadora de escritorio o portátil, mientras que los móviles son teléfonos móviles, tabletas y relojes inteligentes. </p> <p> Cuando inicie sesión por primera vez en LastPass el 16 de marzo, deberá configurar su tipo de dispositivo activo. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> Por ejemplo, si elige computadoras como su tipo de dispositivo, podrá usar LastPass en sus dispositivos de escritorio y portátiles. Sin embargo, si desea utilizar LastPass en cualquier dispositivo móvil, deberá actualizar a LastPass Premium. </p> <p> En cierto modo, esto está volviendo al LastPass de antaño. La posibilidad de usar LastPass de forma gratuita en computadoras de escritorio y dispositivos móviles solo estuvo disponible en 2015. Antes de eso, tenía que pagar por el soporte móvil. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> El soporte de LastPass también está cambiando </h2> <p> LastPass también está cambiando la forma en que brinda soporte. A partir del 17 de mayo de 2021, la asistencia por correo electrónico solo estará disponible para los clientes Premium y Family. </p> <p> Los usuarios gratuitos se quedarán atrapados con los artículos de ayuda disponibles en el sitio web de soporte de LastPass, o pueden pedir ayuda dentro de la comunidad de LastPass. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> Todos deberían usar un administrador de contraseñas </a> . Lo más probable es que necesite usarlo en computadoras de escritorio y dispositivos móviles. LastPass lo sabe y confía en que los usuarios se actualicen al servicio pago, que actualmente tiene un 25% de descuento por $ 27 al año. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> ¿Es hora de cambiar el administrador de contraseñas? </h2> <p> Si usa LastPass Free, es probable que esto le haya hecho considerar cambiarse. Si es así, existen muchos otros excelentes administradores de contraseñas que puede usar en todos sus dispositivos de forma gratuita. </p> <p> Por otra parte, tal vez piense que es justo que pague una pequeña cantidad a LastPass en apoyo del servicio que brinda. </p>"}