{"title":"La IA de detección de discurso de odio de Facebook está dando sus frutos","content":"<p> Facebook está mejorando su eficiencia para reconocer y eliminar contenido que incita al odio. La plataforma <a href=\"https://transparency.facebook.com/community-standards-enforcement\" target=\"_blank\" rel=\"nofollow noopener\"> Informe de cumplimiento de normas comunitarias </a> muestra una reducción significativa en la prevalencia del discurso de odio en el último trimestre de 2020. </p> <h2 id=\"hate-speech-on-facebook-has-dipped\"> El discurso de odio en Facebook ha caído </h2> <p> En el Informe de cumplimiento de los estándares comunitarios de Facebook de octubre a diciembre de 2020, la plataforma reveló importantes mejoras en la forma en que Facebook está manejando el discurso de odio. Guy Rosen, vicepresidente de integridad de Facebook, hizo una publicación en <a href=\"https://about.fb.com/news/2021/02/community-standards-enforcement-report-q4-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> el blog Acerca de Facebook </a> para resaltar su éxito. </p> <p> Por cada 10,000 visitas de contenido de Facebook, solo de siete a ocho fueron vistas de contenido de odio. Facebook también tomó medidas en relación con 6,3 millones de publicaciones sobre acoso e intimidación, un aumento de las 2,5 millones de publicaciones del tercer trimestre. </p> <p> La plataforma también pudo capturar 6,4 millones de piezas de contenido de odio organizado, lo que es una mejora enorme en comparación con los cuatro millones de piezas de contenido que Facebook eliminó en el trimestre anterior. </p> <p> El Informe de cumplimiento de los estándares comunitarios mostró mejoras similares en Instagram. Se eliminaron cinco millones de publicaciones relacionadas con el acoso y la intimidación en Instagram, junto con 6.6 millones de contenido que contenía discursos de odio y 308,000 piezas de contenido de odio organizado. Todos estos números superan las estadísticas registradas en el tercer trimestre. </p> <p> También mejoró la tasa proactiva de Facebook, también conocida como la cantidad de contenido que Facebook elimina antes de que un usuario lo informe. Para el acoso y la intimidación, la tasa proactiva de la plataforma aumentó del 26 al 49 por ciento en Facebook y del 55 al 80 por ciento en Instagram. </p> <p> <img alt=\"Facebook graph for bullying\" src=\"images/facebook-content-takedowns-q4-715.png\" loading=\"lazy\"> Crédito de imagen: Facebook </p> <p> <a href=\"https://www.makeuseof.com/facebooks-ai-tackles-hateful-content/\" target=\"_blank\" rel=\"nofollow noopener\"> La IA de detección del odio de Facebook </a> ha desempeñado un papel importante en el impulso de su respuesta al discurso de odio. Rosen señala que la plataforma ha realizado mejoras en su IA &quot;donde los matices y el contexto son esenciales, como el discurso de odio o la intimidación y el acoso&quot;, lo que finalmente ayudó a reducir la cantidad de contenido de odio en Facebook. </p> <p> Mike Schroepfer, director de tecnología de Facebook, hizo una publicación separada en <a href=\"https://about.fb.com/news/2021/02/update-on-our-progress-on-ai-and-hate-speech-detection/\" target=\"_blank\" rel=\"nofollow noopener\"> el blog Acerca de Facebook </a> para celebrar los logros de la IA en constante mejora de Facebook. A pesar de sus logros recientes, Schroepfer espera que la IA de Facebook pueda mejorar &quot;al ver contenido en contexto en diferentes idiomas, culturas y geografías&quot;. </p> <p> </p> <h2 id=\"facebook-s-ai-is-getting-smarter\"> La IA de Facebook se está volviendo más inteligente </h2> <p> Facebook comenzó a confiar más en su sistema de inteligencia artificial para ayudar a evaluar el contenido de odio debido a la pandemia actual de COVID-19. Rosen señaló que es probable que el equipo de Facebook aún se vea afectado por la pandemia &quot;hasta que haya una vacuna disponible&quot;. </p> <p> Aunque los moderadores de Facebook algún día volverán a trabajar con normalidad, no parece que la IA de la plataforma vaya a ninguna parte. Facebook solo ha hecho que su IA sea más inteligente y eficiente, y no parece que Facebook planee dejar de progresar pronto. </p>"}