{"title":"Mark Zuckerberg de Facebook asumió personalmente el impulso de privacidad de Apple","content":"<p> Según se informa, el CEO de Facebook, Mark Zuckerberg, dijo a los empleados de Facebook que &quot;tenemos que infligir dolor&quot; a Apple por tratar tan mal al gigante de las <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> Wall Street Journal </a> informes. </p> <p> Zuckerberg supuestamente hizo el comentario en 2018 después de que los jefes ejecutivos de Apple y Facebook se enfrentaran por el escándalo de Cambridge Analytica, en el que se accedió a los datos personales de millones de usuarios de Facebook sin su consentimiento para publicidad política. </p> <h2 id=\"apple-vs-facebook\"> Apple contra Facebook </h2> <p> En ese momento, el CEO de Apple, Tim Cook, fue interrogado en una entrevista sobre cómo respondería si estuviera en la situación de Zuckerberg, enfrentando la crisis. &quot;No estaría en esta situación&quot;, dijo Cook. </p> <p> El Wall Street Journal afirma que, si bien Zuckerberg comentó que las palabras de Cook eran &quot;extremadamente simplistas&quot; y &quot;en absoluto alineadas con la verdad&quot;, entre bastidores fue considerablemente más severo en su evaluación. </p> <p> Desde entonces, la relación entre las dos empresas de tecnología no ha mejorado. Apple ha redoblado su postura orientada a la privacidad, con Cook proclamando que la privacidad es uno de los <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> preocupaciones más urgentes del mundo </a> . iOS 14 contiene múltiples funciones relacionadas con la privacidad, con las que Facebook se ha opuesto, alegando que tienen el potencial de dañar a las pequeñas empresas. </p> <p> Durante la última llamada trimestral de inversores de Facebook, Zuckerberg etiquetó a Apple &quot; <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> uno de los mayores competidores [de Facebook] </a> &quot;como resultado de estas nuevas medidas de protección de la privacidad.&quot; Apple puede decir que están haciendo esto para ayudar a la gente, pero los movimientos siguen claramente sus intereses competitivos &quot;, dijo Zuckerberg. </p> <p> </p> <p> Supuestamente, Facebook está preparando un caso antimonopolio contra Apple que convertiría el tiroteo entre los dos titanes de Silicon Valley en una batalla legal total. El informe del Wall Street Journal señala que &quot;es probable que los acuerdos regulatorios y las decisiones legales potenciales afecten a cientos de millones de teléfonos de consumidores en los próximos años&quot;. </p> <p> </p> <h2 id=\"different-approaches\"> Diferentes aproximaciones </h2> <p> El portavoz de Facebook, Dani Lever, le dijo al Wall Street Journal que, &quot;Apple afirma que se trata de privacidad, pero se trata de ganancias, y nos unimos a otros para señalar su comportamiento anticompetitivo y de auto preferencia&quot;. Ella dijo que Facebook está &quot;deliberadamente enfrentando a Apple&quot; en nombre de las pequeñas empresas y desarrolladores que se ven perjudicados por la función de privacidad de aplicaciones de Apple. </p> <p> Si bien Lever negó que la batalla entre las dos empresas sea personal, va más allá de unos pocos puntos de discordia entre dos grandes empresas de tecnología. El modelo de negocio financiado por publicidad en el que opera Facebook es extremadamente diferente al modelo financiado por hardware que impulsa a Apple. Es probable que ninguna de las dos empresas, ni sus líderes, retrocedan en sus creencias fundamentales sobre cómo construir el futuro de la tecnología. </p> <p> El hecho de que el CEO de Apple, Tim Cook, discuta la privacidad en términos morales muestra cuán personal, en cierto nivel, es esto realmente. </p> <p> <small> Crédito de la imagen: Wikipedia / <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Anthony Quintano CC </a></small> </p>"}