{"title":"Microsoft intentó comprar Pinterest, pero el trato está desactivado ... por ahora","content":"<p> Microsoft se acercó recientemente a Pinterest con respecto a un posible acuerdo de adquisición que habría ascendido a una de las adquisiciones más grandes de la historia de Redmond. Actualmente, las conversaciones no están activas, pero la escala de la fusión propuesta marca aún más los planes de crecimiento de Microsoft. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft quiere comprar Pinterest </h2> <p> Según lo informado por el <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Tiempos financieros </a> , Microsoft intentó comprar Pinterest, el tablón de anuncios para aficionados más grande del mundo. </p> <p> Pinterest está valorado actualmente en alrededor de $ 51 mil millones y su valor de mercado ha aumentado más del 600 por ciento durante la pandemia de COVID-19 a medida que las personas se conectan durante los bloqueos. La noticia del posible acuerdo de adquisición hizo que las acciones de Pinterest subieran un 7 por ciento antes de que los mercados abrieran el jueves 11 de febrero. </p> <p> La medida habría colocado a Pinterest en el establo cada vez mayor de importantes adquisiciones tecnológicas de Microsoft. En 2016, Microsoft adquirió LinkedIn en un acuerdo de $ 26 mil millones, seguido de la compra de Github por $ 7,5 mil millones en 2018. </p> <p> Eso sin mencionar que Microsoft es propietario de Minecraft, compró $ 2.5 mil millones en 2014 y la adquisición en curso de la importante compañía de juegos, ZeniMax, por $ 7.5 mil millones. ZeniMax es la empresa matriz de estudios de juegos como Bethesda Softworks, id Software, Alpha Dog Games y Tango Gameworks. </p> <p> Además, hubo un <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> intento fallido de comprar TikTok </a> Activos en Norteamérica, Australia y Nueva Zelanda a mediados de 2020. El acuerdo finalmente fracasó, pero se valoró entre $ 20 y 30 mil millones y se produjo después de que el ex presidente <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Trump amenazó con prohibir </a> la red social para compartir videos de los EE. UU. por completo. </p> <p> Si el acuerdo de Pinterest se hubiera llevado a cabo, o de hecho, si finaliza en una fecha posterior, se convertirá en la mayor adquisición de Microsoft hasta la fecha. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> ¿Por qué Microsoft está comprando tantas empresas tecnológicas? </h2> <p> Microsoft no tiene escasez de efectivo y quiere expandir su imperio. Sus propias acciones han aumentado un 80 por ciento desde el inicio de la pandemia COVID-19 y recientemente revelaron sus ganancias récord. </p> <p> </p> <p> La adquisición de otra plataforma, como Pinterest, es un boleto a los datos para otros servicios de Microsoft. El gran volumen de datos generados por plataformas como LinkedIn es la herramienta perfecta para entrenar sus tecnologías de IA. Además, asumir y administrar un enorme servicio en línea como Pinterest también sirve como anuncio para su plataforma Azure. </p> <p> Como también alude el informe del Financial Times, hablar de una fusión tan enorme entre dos empresas tecnológicas también pondría a prueba la administración del presidente Biden. ¿Está contenta la nueva administración de permitir que gigantes tecnológicos como Microsoft, Google y Facebook compren a la competencia? Sólo el tiempo dirá. </p>"}