{"title":"Microsoft lanza su nueva aplicación de Office para iPad","content":"<p> Microsoft ha lanzado su aplicación de Office unificada para la tableta de Apple. Con él, Word, Excel y PowerPoint ahora están disponibles como una sola descarga en el iPhone y iPad en el <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> Tienda de aplicaciones </a> . Microsoft todavía ofrece estas aplicaciones para iPad como descargas independientes. </p> <h2 id=\"better-late-than-never\"> Mejor tarde que nunca </h2> <p> &quot;Estamos combinando las aplicaciones de Word, Excel y PowerPoint que conoce en una sola aplicación optimizada para iPadOS&quot;, escribió Microsoft en las notas de la versión que acompañan a la descarga. Esta es una gran noticia si usa Office y desea trabajar sobre la marcha. Para aquellos que buscan <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> convertir su iPad en un reemplazo de computadora portátil </a> , este es un comunicado crucial. </p> <p> Las aplicaciones están disponibles de forma gratuita, pero la edición y otras funciones avanzadas requieren una suscripción a Office 365. Para aquellos que se preguntan, Microsoft ofrece varias opciones de suscripción en la aplicación a partir de $ 6.99 por mes. </p> <p> Si solo necesita un procesador de texto en su iPad, podría ser una mejor idea considerar alternativas en <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> Resumen de MUO de las mejores aplicaciones de procesamiento de texto para iPad </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> Una experiencia de oficina móvil unificada </h2> <p> Para ser claros, esta es una actualización de Office existente para iOS, no una versión nueva. La <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> La aplicación de Office todo en uno hizo su debut en el iPhone </a> y Android en febrero de 2020. No está claro qué le tomó a Microsoft un año completo agregar versiones optimizadas para iPad de Word, Excel y PowerPoint a la mezcla, pero es mejor tarde que nunca. </p> <p> </p> <p> Antes de hoy, las aplicaciones de productividad incluidas en la suite brindaban una experiencia deficiente en el iPad porque solían ejecutarse en modo de ventana. Pero con la última actualización ahora disponible, los clientes de Apple ahora pueden tener la experiencia nativa de Office en su iPhone, iPad o iPod touch, independientemente del tamaño de la pantalla. </p> <p> </p> <h2 id=\"ipad-specific-features\"> Funciones específicas del iPad </h2> <p> Microsoft ha estado agregando nuevas funciones optimizadas para tabletas a sus ofertas de Office móvil de forma regular. Por ejemplo, las versiones móviles de Word, Excel y PowerPoint han adquirido recientemente soporte para los gestos del mouse y del trackpad. Las aplicaciones también son compatibles con la función de multitarea de lado a lado Split View de iOS. </p> <p> Si bien las ediciones móvil y de escritorio de Office no tienen todas las mismas características, el nuevo Office para iOS presenta algunas características nuevas. Estos le permiten hacer cosas como firmar documentos con su Apple Pencil o el dedo, crear rápidamente archivos PDF a partir de sus documentos, convertir imágenes en texto y tablas, etc. </p> <p> </p> <p> Además, ahora puede insertar fácilmente la fecha, la forma, la imagen y las notas en archivos PDF. En cuanto a los usuarios avanzados, ahora pueden acceder a las acciones basadas en imágenes de Office (como Crear PPT, Crear PDF y más) a través del menú Compartir multipropósito de iOS. &quot;Además, si hay capturas de pantalla recientes al abrir la aplicación de Office, estas aparecen como una sugerencia para convertir a PDF o PPT&quot;, señala la compañía. </p> <p> Microsoft también realizará algunos cambios en su suite Office para Mac y Windows. Según el fabricante de Windows, las próximas actualizaciones de Office para escritorio en 2021 contarán con licencias perpetuas, además de otras mejoras. </p>"}