{"title":"Microsoft lanza Azure al espacio con la computadora 2 de HPE Spaceborne","content":"<p> Microsoft está llegando más allá del borde del planeta para brindar servicios extraterrestres. La compañía trabajará con Hewlett Packard Enterprises para conectarse a una PC en la Estación Espacial Internacional (ISS) a través de su plataforma Azure. </p> <p> Spaceborne Computer-2 se conectará a Azure a través de las estaciones terrestres de la NASA y HPE, entregando una gran potencia de procesamiento de datos a la estación espacial. </p> <h2 id=\"azure-heads-into-space\"> Azure se dirige al espacio </h2> <p> Como se informó en <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> el Blog de Microsoft Azure </a> , el Spaceborne Computer-2 (SBC-2) proporcionará a los astronautas de la ISS tecnologías más similares a sus homólogos terrestres. </p> <p> La esperanza es que reduzca drásticamente la cantidad de tiempo que se necesita para transferir datos entre la ISS y la Tierra, así como también reducir la cantidad de ancho de banda requerido para el procesamiento y análisis. </p> <blockquote> <p> Los astronautas y los exploradores espaciales merecen acceso a las mejores tecnologías de computación en la nube y al procesamiento avanzado en el último extremo. A veces, el análisis debe realizarse de inmediato en el borde donde cada momento que pasa cuenta, y otras veces el análisis es tan enormemente complejo que solo se puede realizar con el poder de la nube de hiperescala. </p> </blockquote> <p> El Spaceborne Computer-2 utiliza el sistema Edgeline Converged Edge de Hewlett Packard Enterprises, que está &quot;diseñado a propósito para los entornos extremos hostiles&quot; y traerá montones de funciones de Azure a la ISS. </p> <p> Cuando la conexión esté en funcionamiento, el SBC-2 permitirá la investigación en áreas que incluyen el modelado meteorológico para futuras misiones a Marte, análisis de plantas e hidropónicos para respaldar el crecimiento de alimentos y cultivos en el espacio, e imágenes médicas en la propia ISS (para respaldar la atención médica de los astronautas). ). </p> <p> El Dr. Mark Fernandez, arquitecto de soluciones de sistemas de borde convergente en HPE e investigador principal de Spaceborne Computer-2, dijo: </p> <blockquote> <p> Al unir Spaceborne Computer-2 de HPE, que se basa en el sistema Edgeline Converged Edge de HPE para capacidades avanzadas de computación en el borde y de inteligencia artificial, con Microsoft Azure para conectarse a la nube, estamos permitiendo que los exploradores espaciales transmitan sin problemas grandes conjuntos de datos hacia y desde Earth y benefíciese de una experiencia de borde a nube </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> La siguiente fase de la iniciativa espacial Azure de Microsoft </h2> <p> El anuncio de Microsoft es un paso más para su <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Espacio Microsoft Azure </a> iniciativa, que lanzó en octubre de 2020. </p> <p> La iniciativa Azure Space es el esfuerzo de Microsoft para dar &quot;el próximo gran salto en la computación en la nube&quot;, llevando su plataforma de computación en la nube Azure al espacio. </p> <p> </p> <p> Azure Space ha trabajado anteriormente con el proyecto SpaceX Starlink para entregar banda ancha satelital a su Azure Modular Datacenter (MDC) y continúa su trabajo en el proyecto Azure Orbital, que extenderá la conectividad entre sus centros de datos en la nube utilizando tecnología satelital. </p>"}