{"title":"Nintendo confirma la próxima presentación de Nintendo Direct","content":"<p> Nintendo ha publicado detalles de cuándo será su próxima presentación de Nintendo Direct, y no tendrá que esperar mucho para recibir noticias del creador de Mario. </p> <h2 id=\"nintendo-direct-reveals-forthcoming-presentation-date\"> Nintendo Direct revela la próxima fecha de presentación </h2> <p> ¿Quieres saber qué tiene planeado Nintendo para el próximo año? En ese caso, deberá sintonizar la próxima presentación de Nintendo Direct y escucharla de ellos. </p> <p> El próximo Nintendo Direct tendrá lugar el 17 de febrero, según se confirma en un tweet de Nintendo of America. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Sintonice el 17 de febrero a las 2 p.m. PT para un <a href=\"https://twitter.com/hashtag/NintendoDirect?src=hash&ref_src=twsrc%5Etfw\"> #NintendoDirect </a> transmisión en vivo con aproximadamente 50 minutos de información centrada en juegos disponibles como Super <a href=\"https://twitter.com/hashtag/SmashBrosUltimate?src=hash&ref_src=twsrc%5Etfw\"> #SmashBrosUltimate </a> y juegos llegando a <a href=\"https://twitter.com/hashtag/NintendoSwitch?src=hash&ref_src=twsrc%5Etfw\"> #NintendoSwitch </a> en el primer semestre de 2021. <a href=\"https://t.co/fbG3hEtD0Q\"> https://t.co/fbG3hEtD0Q </a> <a href=\"https://t.co/w8J6lbdIkQ\"> pic.twitter.com/w8J6lbdIkQ </a></p> - Nintendo of America (@NintendoAmerica) <a href=\"https://twitter.com/NintendoAmerica/status/1361676737730519042?ref_src=twsrc%5Etfw\"> 16 de febrero de 2021 </a></blockquote>  <p> Si quieres las últimas noticias de Nintendo, sintoniza el <a href=\"https://www.nintendo.com/nintendo-direct/02-17-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> Página de Nintendo Direct en nintendo.com </a> , desde las 17:00 ET (14:00 PT, 22:00 GMT). </p> <p> </p> <h2 id=\"what-will-nintendo-reveal-at-nintendo-direct\"> ¿Qué revelará Nintendo en Nintendo Direct? </h2> <p> En general, es imposible decir lo que Nintendo tiene bajo la manga para un anuncio. Es probable que haya algunas noticias sobre juegos, especialmente con la franquicia de Zelda acercándose a su 35 aniversario. </p> <p> Dado que <a href=\"https://www.makeuseof.com/nintendo-switch-bestselling-console-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> Switch y Switch Lite son consolas muy populares en los Estados Unidos. </a> , es probable que las noticias se centren en las consolas actuales y los títulos disponibles para ellas. </p> <p> Si espera un anuncio sobre la próxima consola Switch, no debe contener la respiración. Nintendo se ha mantenido decididamente cautelosa sobre el futuro de la consola Switch y si tiene una nueva en el horizonte. </p> <p> </p> <h2 id=\"keep-up-to-date-with-nintendo-news\"> Manténgase al día con las noticias de Nintendo </h2> <p> <img alt=\"Nintendo Switch Family Membership Header\" src=\"images/nintendo-switch-family-header-378.jpg\" loading=\"lazy\"> </p> <p> Nintendo Direct es la forma de Nintendo de brindar a su base de fanáticos leales las noticias más actualizadas sobre la marca. Entonces, ya sea que tenga un Switch, Switch Lite o incluso una colección completa de consolas Nintendo, asegúrese de sintonizar. </p>"}