{"title":"Otra marca no oficial de placa frontal de PS5 está en escena","content":"<p> dbrand, que fabrica máscaras, pantallas y carcasas para una variedad de dispositivos, se ha unido al cebo de Sony y lanzó su propia placa frontal no oficial de PS5. </p> <h2 id=\"dbrand-releases-darkplates\"> dbrand lanza Darkplates </h2> <p> Si está buscando personalizar su PS5, dbrand es la última compañía en ofrecer carátulas de terceros no oficiales para la consola de nueva generación. Los llaman Darkplates, porque son placas frontales negras. </p> <p> Puede ver las placas en el <a href=\"https://dbrand.com/shop/special-edition/ps5\" target=\"_blank\" rel=\"nofollow noopener\"> tienda dbrand </a> , donde puede comprar las placas frontales negras mate por $ 49.00 (en el momento de escribir este artículo). </p> <p> También puede elegir lo que dbrand llama una &quot;piel intermedia&quot;, que es una pegatina de vinilo que se coloca sobre el panel central negro de alto brillo de la PS5. Esto cuesta $ 11.95 adicionales y está disponible en una variedad de colores y diseños. </p> <p> <img alt=\"dbrand shell texture detail\" src=\"images/dbrand-shell-texture-detail-544.png\" loading=\"lazy\"> </p> <p> También notará que se jacta de la textura de su placa frontal. Esto es similar a <a href=\"https://www.makeuseof.com/sony-how-ps5-controller-textured-playstation-symbols/\" target=\"_blank\" rel=\"nofollow noopener\"> los pequeños símbolos de PlayStation que encontrarás en el DualSense </a> , otros accesorios oficiales de PS5 y las placas frontales originales que vienen adjuntas a la consola cuando la compras. Similares, pero ¿son igualmente impresionantes? </p> <p> </p> <h2 id=\"will-dbrand-last\"> ¿Durará dbrand? </h2> <p> Sin duda has visto nuestro <a href=\"https://www.makeuseof.com/cmp-shells-ps5-faceplate-colors/\" target=\"_blank\" rel=\"nofollow noopener\"> Cobertura de la placa frontal con respecto a las carcasas CMP </a> , lo que hizo que el regreso de Sony fuera bastante auto-triunfante. Algunos podrían decir que su regreso fue arrogante, ya que declaró legalmente intocables sus nuevas carátulas. Ya veremos. </p> <p> </p> <p> Esto hace que te preguntes por qué dbrand se ha molestado. Sony categóricamente <strong> No </strong> tome amablemente a CMP Shells, primero porque su antigua marca era demasiado similar a PlayStation (PlateStation). </p> <p> Entonces, Sony se opuso porque decidió que las placas frontales eran parte del diseño de la consola y, por lo tanto, copiarlas era una infracción a la propiedad intelectual. Cue el golpe del martillo de prohibición. CMP Shells terminó la producción, cancelando todos los pedidos antes de resurgir en su nueva forma. </p> <p> dbrand ya se encuentra en su cuarta ola de preventas de clientes potencialmente insatisfechos, por lo que debe ser rápido si desea obtener una de las plantillas personalizadas. Si las placas realmente llegarán a la producción es otra cuestión. Sony bien podría volver a derribar el mazo. </p> <p> </p> <h2 id=\"should-you-buy-a-dbrand-faceplate\"> ¿Debería comprar una placa frontal de dbrand? </h2> <p> Al igual que con la saga CMP Shells, recomendamos a cualquiera que esté interesado en personalizar sus carátulas de PS5 que tenga cuidado. Estos son productos de terceros, por lo que no tiene forma de confirmar su calidad más que lo que le dice la marca. </p> <p> Además, dada la insistencia de Sony en que PlateStation (ahora CMP Shells) tuvo que cesar la producción, no será una sorpresa si no marca rápidamente a sus abogados para que también se pongan en contacto con dbrand. </p> <p> En resumen, tenga cuidado si desea personalizar sus carátulas. CMP Shells reembolsó a todos sus clientes la primera vez. Pero eso no significa que otra marca lo hará. </p> <p> </p> <h2 id=\"do-you-really-need-to-customize-your-ps5\"> ¿Realmente necesitas personalizar tu PS5? </h2> <p> <img alt=\"ps5\" src=\"images/ps5-183.jpg\" loading=\"lazy\"> </p> <p> Si no está satisfecho con la apariencia de su PS5, siempre puede modificarla de otras formas (significativamente menos costosas). Siempre puede agregar una máscara de vinilo a la consola si desea que se vea diferente. </p> <p> La PS5 solo se lanzó en noviembre de 2020. Quizás intente jugar algunos juegos antes de sentir la irresistible necesidad de cambiar la apariencia estética de su consola. </p>"}