{"title":"Parler vuelve a estar en línea después de un cierre de un mes","content":"<p> Después de ser excluido por Big Tech, Parler finalmente ha resurgido en la web. La plataforma de &quot;libertad de expresión&quot; ahora es accesible para los usuarios existentes y pronto comenzará a aceptar nuevos registros de usuarios en las próximas semanas. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler resurge después del apagón de la gran tecnología </h2> <p> Parler ha regresado luego de un largo apagón. La red social alternativa ha ido ganando terreno entre los políticos conservadores, y fue <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> iniciado por Amazon Web Services (AWS), Google y Apple </a> tras los disturbios del Capitolio. Parler fue acusado de no hacer lo suficiente para moderar el contenido violento, lo que resultó en su eliminación de las tiendas de aplicaciones y la web. </p> <p> En lugar de AWS, Parler ahora usa un host llamado SkySilk. El sitio también registró su nombre de dominio con Epik, un registrador que atiende a otros tipos de redes de &quot;libertad de expresión&quot; como Gab. </p> <p> Un nuevo host y registrador de dominios no son los únicos cambios que ha realizado Parler; Parler incluso ha resurgido con un nuevo CEO interino. Esto viene después <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> el equipo de Parler supuestamente despidió al cofundador John Matze </a> . </p> <p> Mark Meckler reemplazará temporalmente a Matze como director ejecutivo y anteriormente cofundó el grupo derechista Tea Party Patriots. En una declaración obtenida por <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> La colina </a> , Meckler anunció el tan esperado regreso de Parler, diciendo: </p> <blockquote> <p> Cuando Parler fue desconectado en enero por aquellos que desean silenciar a decenas de millones de estadounidenses, nuestro equipo se unió, decidido a mantener nuestra promesa a nuestra comunidad altamente comprometida de que regresaríamos más fuertes que nunca. Estamos encantados de darles la bienvenida a todos. </p> </blockquote> <p> Meckler continuó, y señaló que Parler seguirá dedicado a &quot;la libertad de expresión, la privacidad y el diálogo civil&quot;. También aseguró a los usuarios que &quot;Parler está a cargo de un equipo experimentado y está aquí para quedarse&quot;. </p> <p> Aunque las cuentas más antiguas de la plataforma están respaldadas, las publicaciones más antiguas (o &quot;parleys&quot;) no se han restaurado. Si ya tiene una cuenta en Parler, puede continuar usando el sitio. De lo contrario, tendrá que esperar aproximadamente una semana hasta que pueda registrarse. </p> <p> Pero incluso si ya tiene una cuenta de Parler, es posible que encuentre algunas dificultades técnicas al usar la plataforma. Parece que el servicio aún no se ha restaurado por completo. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> La aplicación Parler aún permanece en el limbo </h2> <p> Parler todavía está prohibido en Google Play Store y Apple App Store, lo que podría dañar gravemente su base de usuarios. Tal como está, la plataforma podría no estar disponible en dispositivos móviles durante un período de tiempo desconocido. </p> <p> Es probable que no pueda regresar a Play Store o App Store a menos que cambie sus políticas de moderación, que es algo que Parler probablemente se negará a hacer. </p>"}