{"title":"Pronto jugarás juegos con personajes metahumanos épicos","content":"<p> Si crees que los juegos se ven realistas ahora, espera hasta que veas lo que Epic Games tiene en marcha con su Unreal Engine. Prepárate para alucinar. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games presenta nuevos metahumanos </h2> <p> Probablemente se esté preguntando de qué tierra estamos hablando. MetaHuman Creator es la última característica que Epic Games ha agregado a Unreal Engine; un entorno de desarrollo de software, que los desarrolladores de juegos pueden utilizar para crear sus títulos. </p> <p> Según un <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Entrada de blog de Unreal Engine </a> anunciando la nueva y emocionante herramienta de desarrollo: </p> <blockquote> <p> MetaHuman Creator es una aplicación en la nube diseñada para llevar la creación humana digital en tiempo real de semanas o meses a menos de una hora, sin comprometer la calidad. </p> </blockquote> <p> Por lo tanto, es esencialmente una forma para que los desarrolladores de juegos creen facsímiles humanos increíblemente realistas. Rápido. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> ¿Qué significa MetaHuman Creator para los desarrolladores? </h2> <p> </p> <p> Las implicaciones que esto tiene para el desarrollo de software son un cambio de juego (juego de palabras). Imagínese lo rápido que los desarrolladores poblarán sus mundos de juego con NPC, usando MetaHuman Creator. No solo eso, sino que los humanos digitales también se ven increíbles. </p> <p> Obviamente, esto también significará que los desarrolladores pueden terminar los títulos más rápido, por lo que no tendrá que esperar a través de innumerables retrasos. MetaHuman Creator permite a los desarrolladores construir rápidamente su población de NPC, dejando tiempo para otros asuntos más urgentes. </p> <p> Pero, ¿por qué la necesidad de esta herramienta? Epic Games explica: </p> <blockquote> <p> Crear un ser humano digital de alta calidad es difícil y requiere mucho tiempo. Escalar ese esfuerzo para crear muchos humanos digitales diversos de la calidad requerida por las plataformas de próxima generación y la producción virtual de alta gama es una tarea formidable. </p> </blockquote> <p> Entonces, como dijimos; la herramienta ahorra tiempo y mejora el flujo de trabajo, lo que permite a los desarrolladores ofrecer a las consolas de nueva generación los juegos que se merecen. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> ¿Cómo afectará MetaHuman Creator a los juegos? </h2> <p> Bueno, gracias a MetaHuman Creator, los juegos podrían lanzarse mucho más rápido, para empezar. Con herramientas poderosas como esta a su disposición, los desarrolladores podrían perfeccionar la mecánica del juego o dedicar más tiempo a corregir errores antes de lanzar un juego roto ... </p> <p> De todos modos, dejando de lado la amargura, la herramienta de desarrollo de Epic parece algo que también hará que los juegos se vean mejor. Solo tiene que mirar los renders para ver cuán impresionantes son en realidad los humanos digitales. Sin embargo, cuando los veamos en los juegos, es cuando sucederá la verdadera magia. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> ¿Cuándo veremos metahumanos en los juegos? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> Esto es dificil de decir. Actualmente, Epic ha vinculado el software Creator para pruebas de acceso anticipado en los &quot;próximos meses&quot;. Así que no verás a ningún MetaHumans pronto. </p> <p> Si te apetece intentar crear tu propio ser humano digital, debes esperar si quieres usar MetaHuman Creator de Unreal Engine. Siempre puedes intentar armar uno en otro programa, ¡pero ciertamente no te llevará menos de una hora! </p>"}