{"title":"Puede obtener el nuevo Microsoft Teams Pro gratis","content":"<p> Hace un tiempo, cubrimos un servicio de suscripción planificado para Microsoft Teams llamado &quot;Teams Pro&quot;, que desbloqueará funciones adicionales para el software. Sin embargo, Microsoft ha dejado constancia de que algunas personas obtendrán Teams Pro sin cargo adicional a sus planes actuales. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Declaración de Microsoft sobre las suscripciones gratuitas de Teams Pro </h2> <p> En caso de que necesite un recordatorio, ya cubrimos este tema en nuestro artículo sobre <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro agregando seminarios web al servicio </a> . </p> <p> Ahora, un artículo de <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> sobre el mismo tema ha recibido una declaración de Microsoft. La declaración es una buena noticia para las personas preocupadas por pagar más por los seminarios web: </p> <blockquote> <p> El 9 de febrero, publicamos una publicación de MC sobre un nuevo plan de servicio Teams Pro. Para aclarar, no hay cambios en las licencias de productos existentes con la adición de este nuevo plan de servicio. Más bien, el plan de servicio se agregará automáticamente a las licencias de Microsoft 365 y Office 365 E5 / E3 / A5 / A3, y Microsoft 365 Business Standard / Business Premium, y permitirá a los usuarios que tienen licencia para estos SKU recibir automáticamente las capacidades que se implementan en Equipos en un futuro próximo. </p> </blockquote> <p> Microsoft continúa afirmando que los administradores no necesitan hacer nada para activar estas nuevas funciones. Además, cualquier persona con una licencia compatible como la que se enumera anteriormente obtendrá estas nuevas y brillantes funciones sin cargo adicional. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Obtener más por lo mismo con Microsoft Teams </h2> <p> Microsoft está implementando un nuevo plan de suscripción de Teams Pro que desbloquea seminarios web y más, pero no todos tendrán que pagar más por ello. Si está suscrito a una de las licencias anteriores, puede esperar obtener todas las funciones de Teams Pro sin costo adicional. </p> <p> Eso no quiere decir que las personas sin Teams Pro se quedarán en la sombra. Por ejemplo, pronto todos tendrán acceso a una útil función de resumen en Microsoft Teams. </p> <p> <small> Crédito de la imagen: Postmodern Studio / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}