{"title":"¿Qué es MTA-STS y cómo protege sus correos electrónicos?","content":"<p> El correo electrónico es el mayor culpable de la mayoría de los ciberataques. Es un punto de fácil acceso para malware, adware, spam y phishing, y brinda infinitas oportunidades para que los actores de amenazas se apoderen de su información personal. </p> <p> Para mitigar estas amenazas, se deben implementar estrictas medidas de seguridad para las cuentas de correo electrónico tanto individuales como comerciales. </p> <h2 id=\"email-security-and-encryption\"> Seguridad y cifrado de correo electrónico </h2> <p> A pesar de la popularidad de otros modos de comunicación, la mensajería por correo electrónico sigue siendo la forma más grande de datos en tránsito para cualquier individuo u organización. Asegurar el contenido de su correo electrónico es una necesidad vital. </p> <p> La seguridad del correo electrónico implica la inspección y el cifrado de todo el tráfico de correo electrónico entrante y saliente. El cifrado juega un papel vital para mantener intacta la privacidad del contenido del correo electrónico al garantizar conexiones SMTP (Protocolo simple de transferencia de correo) seguras. </p> <p> Hasta hace poco, el cifrado era solo un requisito opcional para SMTP. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> ¿Cómo funciona el cifrado de correo electrónico? </h2> <p> El cifrado de correo electrónico es un proceso de agregar un cifrado o un fragmento de código al contenido de su mensaje, lo que lo hace indescifrable. Al convertir los datos del correo electrónico en código, los contenidos están protegidos contra la exposición no autorizada. En pocas palabras, su correo electrónico está codificado. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> Como seguridad adicional, el proceso de cifrado utiliza claves públicas y privadas donde se intercambian claves cifradas para bloquear y desbloquear los correos electrónicos codificados. El remitente cifra el correo electrónico mediante criptografía de clave pública y, posteriormente, el destinatario utiliza una clave privada para descifrar el mensaje recibido. </p> <p> El cifrado se aplica a todo el recorrido de un correo electrónico, de principio a fin. Como práctica recomendada, todos los correos electrónicos entrantes y salientes deben estar cifrados, no solo los que contienen información confidencial. Esto evita que los actores de la amenaza obtengan cualquier punto de entrada a su sistema. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> Antecedentes y problemas con SMTP </h2> <p> Cuando entró en vigor el protocolo SMTP en 1982, el cifrado de correo electrónico no era una práctica común y, de forma predeterminada, los correos electrónicos se enviaban y recibían en texto sin formato. Para introducir seguridad a nivel de transporte, el comando STARTTLS se agregó a fines de la década de 1990, que ofrecía la opción de cifrado <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> Protocolo TLS (seguridad de la capa de transporte) </a> . </p> <p> Tan prometedora como sonaba la actualización de TLS, dejó dos lagunas de seguridad intactas: </p> <ol> <li> La opción de cifrado era solo eso: <strong> Opcional </strong> . Los correos electrónicos no seguros seguían proliferando, lo que provocó un aumento en los ataques cibernéticos. </li> <li> Incluso con STARTTLS implementado, no había forma de autenticar la identidad del servidor del remitente, ya que los servidores SMTP no validan los certificados. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> La llegada de MTA-STS </h2> <p> En 2019, Google finalmente dio un paso al frente y anunció la adopción del nuevo estándar MTA-STS (Mail Transfer Agent / Strict Transport Security) ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> Esto brinda a los proveedores de servicios de correo la capacidad de imponer TLS para proteger las conexiones SMTP y también ofrece la opción de denegar la entrega de correo electrónico a hosts MX que no ofrecen TLS con un certificado de servidor confiable. </p> <p> MTA-STS finalmente se encarga de todos los problemas anteriores con SMTP al hacer cumplir el cifrado entre los servidores SMTP que se comunican. Pero, ¿cómo funciona realmente? ¡Vamos a averiguar! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> ¿Cómo funciona MTA-STS? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS comienza a funcionar indicando a un servidor SMTP que solo se comunique con otro servidor SMTP en dos condiciones: </p> <ol> <li> El servidor SMTP <strong> deber </strong> estar encriptado. </li> <li> El nombre de dominio en el certificado del servidor coincide con el dominio en la política y los certificados están actualizados. </li> </ol> <p> Al utilizar una combinación de DNS y HTTPS para publicar una política, MTA-STS informa a la parte remitente cómo proceder si no se puede iniciar un canal de comunicación cifrado. </p> <p> Es fácil implementar MTA-STS en el extremo del destinatario, pero para el remitente, un software de servidor de correo de apoyo como <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> debería ser usado. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> ¿Qué tipo de ataques mitiga MTA-STS? </h2> <p> Las siguientes amenazas se enfrentan de frente si se aplica MTA-STS a sus comunicaciones por correo electrónico: </p> <p> <strong> Ataques de hombre en el medio (MITM): </strong> Este ataque se lleva a cabo cuando un atacante intercede en medio de la comunicación entre dos partes para robar o alterar datos. En el caso de un correo electrónico, eso normalmente significaría dos servidores SMTP en comunicación. Al emplear MTA-STS, estos ataques se pueden prevenir fácilmente. </p> <p> <strong> Ataques de degradación: </strong> Un actor de amenazas obliga a un canal de red a cambiar a un modo de transmisión de datos inseguro. Por ejemplo, este ataque puede redirigir a un visitante del sitio web de una versión HTTPS de un sitio a una versión HTTP. MTA-STS ayuda a combatir estos ataques evitando cualquier acceso no autorizado. </p> <p> <strong> Ataques de suplantación de DNS: </strong> Estos ataques astutos cambian los registros DNS del destino previsto de un usuario y lo engañan haciéndole creer que está visitando un sitio o dominio legítimo. La implementación de MTA-STS ayuda enormemente a mitigar estos ataques. </p> <p> </p> <p> Ahora que estamos familiarizados con MTA-STS, es hora de ponernos en contacto con un nuevo estándar de informes para SMTP conocido como informes TLS. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> ¿Qué son los informes SMTP TLS (TLS-RPT)? </h2> <p> Al igual que MTA-STS, TLS-RPT es un estándar de informes que detecta problemas de conectividad y discrepancias entre aplicaciones de envío. Una vez habilitado, envía informes diarios sobre cualquier problema de conexión experimentado por servidores externos mientras le envía correos electrónicos. </p> <p> Piense en ello como una herramienta de resolución de problemas en la que los informes se pueden utilizar para evaluar y clasificar posibles problemas y problemas de configuración. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> ¿Qué tipo de problemas resuelve TLS-RPT? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Informe de diagnóstico: </strong> Los informes TLS ofrecen informes de diagnóstico en formato de archivo JSON que contienen detalles completos sobre los correos electrónicos entrantes que enfrentan problemas de entrega. También detecta correos electrónicos que rebotaron o no se entregaron debido a un ataque de degradación, por ejemplo. </p> <p> <strong> Visibilidad mejorada: </strong> Al habilitar TLS-RPT, puede mejorar la visibilidad en todos sus canales de correo electrónico. Esto le permite vigilar todos los datos que se dirigen hacia usted, que también incluyen mensajes fallidos. </p> <p> <strong> Reportes diarios: </strong> Los informes de diagnóstico se envían al menos una vez al día para cubrir y observar en profundidad las políticas de MTA-STS. Los informes también incluyen estadísticas de tráfico, así como información detallada sobre errores y entregas fallidas. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Cuando todo lo demás falla, prevalece el cifrado </h2> <p> Debido a la naturaleza en constante evolución de las amenazas cibernéticas, las estrictas medidas de seguridad y la criptografía son imprescindibles para la entrega segura de correos electrónicos. </p> <p> Gracias a los diversos proveedores de correo electrónico que ofrecen sólidas capacidades de cifrado y los estándares MTA-STS, las transferencias de correo electrónico totalmente seguras ya no son una realidad descabellada. </p>"}