{"title":"¿Qué es un controlador de auriculares y cómo afecta al sonido?","content":"<p> Los auriculares son piezas de tecnología asombrosas. </p> <p> Están diseñados para personas comunes que escuchan música en la cama o en sus desplazamientos y para profesionales que necesitan un audio con un sonido limpio para editar música y videos. Hay varios tipos de auriculares por esta misma razón. Ya sea que esté haciendo ejercicio o mezclando audio durante horas, hay un par de auriculares para usted. </p> <p> Dentro de estos auriculares hay <strong> conductores </strong> que varían drásticamente en tamaño y se fabrican de manera diferente según para quién son los auriculares. Estos controladores, por supuesto, afectan el sonido que suena en sus oídos. </p> <h2 id=\"what-is-a-headphone-driver\"> ¿Qué es un controlador de auriculares? </h2> <p> <img alt=\"Open Back Headphone Driver\" src=\"images/open-back-headphone-driver-548.jpg\" loading=\"lazy\"> </p> <p> Un controlador de auriculares es esencialmente un pequeño altavoz que convierte las señales eléctricas en sonidos que podemos escuchar. Estos controladores pueden variar mucho en tamaño según el tipo de auriculares y para qué se utilizan. </p> <p> Por ejemplo, los auriculares tienen controladores muy pequeños que pueden ser tan pequeños como 8 mm, y los controladores más grandes tienen alrededor de 15 mm de diámetro. Los auriculares supraaurales varían en tamaño un poco más drásticamente, desde 20 mm hasta 70 mm. </p> <p> Los controladores de auriculares constan de tres componentes: el <strong> imán </strong> , <b> bobinas de voz </b> , y el <strong> diafragma </strong> . </p> <ul> <li> La <strong> imán </strong> crea un campo magnético y generalmente está hecho de cobalto o ferrita. </li> <li> <strong> Bobinas de voz </strong> permitir que las corrientes eléctricas pasen a través de ellos, moviendo el diafragma para luego generar sonidos que podamos escuchar. Estas bobinas, generalmente compuestas de varios tipos de cobre, ayudan a convertir las señales eléctricas en sonido. </li> <li> La <strong> diafragma </strong> vibra, produciendo ondas sonoras de las corrientes eléctricas que pasan a través de las bobinas de voz. </li> </ul> <p> </p> <h2 id=\"types-of-headphone-drivers\"> Tipos de controladores de auriculares </h2> <p> No todos los controladores funcionan exactamente igual, algunos producen mejor audio que otros según los materiales utilizados y el proceso y la técnica de ingeniería. </p> <h3 id=\"dynamic-drivers\"> Controladores dinámicos </h3> <p> <img alt=\"Bose Headphones which use a type of Dynamic Driver\" src=\"images/dynamic-driver-415.jpg\" loading=\"lazy\"> </p> <p> El tipo más común de controlador de auriculares es el <strong> conductor dinámico </strong> . Estos controladores funcionan como se explicó anteriormente. Cuando el diafragma vibra, desplaza el aire a su alrededor, creando el sonido que estás escuchando. Cuanto mayor es el desplazamiento de aire, mayor es el volumen producido. Este desplazamiento de aire también ayuda a crear una respuesta de graves realista. </p> <p> Los controladores dinámicos son excelentes para producir bajas frecuencias, que a volúmenes más altos pueden resultar en una distorsión armónica que no suena muy bien para nuestros oídos. Sin embargo, estos controladores no son del todo malos, ya que son baratos de producir, lo que resulta en auriculares menos costosos para el consumidor, además de ser más fáciles de alimentar. No todos los controladores dinámicos se crean por igual, ya que su calidad de sonido puede diferir según la carcasa y los materiales utilizados. </p> <h3 id=\"balanced-armature-drivers\"> Controladores de armadura equilibrada </h3> <p> <img alt=\"Apple wired earbuds, which use a balanced armature driver\" src=\"images/apple-wired-earbuds-which-use-a-balanced-armature-driver-119.jpg\" loading=\"lazy\"> </p> <p> <strong> Controladores de armadura equilibrada </strong> son pequeños y se encuentran principalmente en auriculares. Estos controladores consisten en un brazo dentro de las bobinas con dos imanes a cada lado. Esto permite que el brazo gire hacia cualquiera de los imanes, equilibrándose y moviendo el diafragma para producir sonido. Debido a la forma en que funciona el controlador, no desplaza el aire como el controlador dinámico, lo que resulta en una falta de graves. </p> <p> Los controladores de armadura equilibrada también carecen de salidas de aire adicionales que ayudan a un mejor aislamiento del sonido. Al igual que con todos los controladores, la calidad del sonido puede variar según el diseño de los auriculares por dentro y por fuera. Algunos fabricantes pueden incluso agregar un controlador dinámico para crear un sonido más rico con una mejor respuesta de graves. </p> <p> </p> <h3 id=\"planar-magnetic-drivers\"> Controladores magnéticos planos </h3> <p> <img alt=\"Open Back Headphones using Planar Magnetic Drivers\" src=\"images/open-back-headphones-using-planar-magnetic-drivers-408.jpg\" loading=\"lazy\"> </p> <p> <strong> Controladores magnéticos planos </strong> se encuentran típicamente en auriculares abiertos y generalmente tienen un precio más alto que los controladores dinámicos. En lugar de usar bobinas de voz, los controladores magnéticos planos intentan hacer vibrar uniformemente el diafragma de los imanes a cada lado para producir sonido. Dado que estos controladores usan imanes más grandes o múltiples para vibrar uniformemente el diafragma, estos auriculares tienden a ser un poco más pesados. </p> <p> Los audífonos abiertos también tienen más fugas de sonido que un par normal de audífonos cerrados que usan controladores dinámicos, ya que los controladores están completamente abiertos sin nada que los cubra. Esto los convierte en la mejor opción para escuchar música en público; sin embargo, son fantásticos para usar en el hogar por esta misma razón. </p> <p> Se producen más fugas de sonido debido a un mayor desplazamiento de aire, lo que le brinda un sonido más completo con una excelente respuesta de graves, lo que los hace perfectos para uso en el hogar. </p> <h3 id=\"electrostatic-drivers\"> Controladores electrostáticos </h3> <p> <img alt=\"Open Back Headphones That Require an Amplifier\" src=\"images/open-back-headphones-that-require-an-amplifier-271.jpg\" loading=\"lazy\"> </p> <p> <strong> Electrostático </strong><strong> conductores </strong> son menos comunes debido a su alto precio y usos específicos y se encuentran principalmente en auriculares abiertos. </p> <p> Estos controladores utilizan electricidad estática para ayudar a producir sonido. El diafragma se mueve hacia adelante y hacia atrás entre dos placas conductoras cargadas de manera opuesta, lo que permite un cambio continuo en las señales eléctricas, produciendo un sonido libre de distorsiones. Similar a los controladores magnéticos planos, este diseño también permite un mayor desplazamiento de aire, dejando al oyente con un mejor sonido de graves. </p> <p> Debido a la forma en que funcionan los controladores electrostáticos, requieren señales de alto voltaje, lo que requiere que los use con un amplificador. Estas señales son inalcanzables en la mayoría de las tomas de auriculares de consumo, así como incluso en algunos amplificadores profesionales. Para usar auriculares con controladores electrostáticos, necesitará un amplificador electrostático, que es muy caro. </p> <p> </p> <p> Aunque los controladores electrostáticos le brindan un excelente escenario de sonido con poca distorsión, es mejor optar por otro par de auriculares abiertos que utilicen controladores magnéticos planos. Estos le brindarán una experiencia auditiva similar a los controladores electrostáticos, pero costarán menos y es más fácil trabajar con ellos. </p> <p> </p> <h2 id=\"which-headphone-driver-should-you-get\"> ¿Qué controlador de auriculares debería obtener? </h2> <p> <img alt=\"Razer Gaming Headphones\" src=\"images/razer-gaming-headphones-992.jpg\" loading=\"lazy\"> </p> <p> Los auriculares están diseñados para muchos tipos diferentes de personas. Si eres un músico que solo usa audífonos en casa para mezclar audio, tal vez deberías usar un par de audífonos abiertos con un controlador magnético plano. </p> <p> Si eres un corredor, comprar un par de audífonos grandes con la parte trasera abierta puede no ser la mejor opción para ti. Ahí es donde los auriculares con controladores de armadura equilibrados pequeños pero de gran sonido serán útiles. Hay un par de auriculares que suenan brillantemente construidos especialmente para ti. Ahora es el momento de encontrarlos. </p>"}