{"title":"¿Qué es la época de Unix y cuándo fue la época de Unix?","content":"<p> ¿Por qué Unix tiene su propio concepto de tiempo? ¿Cuál es la época y cuál es el problema de Y2038? </p> <p> La hora Unix es un medio para representar una fecha y hora específicas, utilizada por Linux, macOS y muchos otros sistemas interoperables. Está tan extendido que probablemente lo esté utilizando sin darse cuenta. Sin embargo, una vez que comprenda el tiempo de Unix, lo detectará en muchos contextos. Varias herramientas pueden ayudarlo a trabajar con tiempo Unix. </p> <h2 id=\"what-is-the-purpose-of-unix-time\"> ¿Cuál es el propósito de Unix Time? </h2> <p> El tiempo de Unix es un recuento de segundos totales desde una fecha y hora fija. Es un formato de fecha / hora (o marca de tiempo) que se ve diferente de las fechas y horas legibles por humanos a las que estamos acostumbrados. Esto es puramente por razones de eficiencia. Se necesita mucho menos espacio para almacenar un solo número que representa segundos que para almacenar valores separados para el año, mes, hora, etc. </p> <p> Por supuesto, en términos modernos, la diferencia de espacio no es tanta. Pero considere que Unix se originó a fines de la década de 1960 cuando el almacenamiento disponible era mucho más pequeño. Las marcas de tiempo también se usan mucho, por lo que su almacenamiento se acumula. Por ejemplo, cada archivo tiene tres marcas de tiempo asociadas. </p> <p> El formato es prácticamente imposible de traducir en tu cabeza a menos que seas un genio matemático. Pero todavía tiene algunas ventajas sobre alternativas más legibles como <strong> Mié, 21 de Octubre de 2015 07:28:00 GMT </strong> . Puede solicitar dos marcas de tiempo de Unix muy fácilmente, de un vistazo. También suele ser más rápido calcular la diferencia entre dos marcas de tiempo. Esto es particularmente cierto para fechas cercanas, como en días adyacentes. </p> <p> <img alt=\"A screenshot from the Epoch Converter site showing Unix Time\" src=\"images/epoch-converter-110.png\" loading=\"lazy\"> </p> <h3 id=\"about-the-epoch\"> Sobre la Época </h3> <p> Entonces, el tiempo de Unix es una cuenta total de segundos desde un punto específico en el tiempo. Pero, ¿cuál es ese momento en el tiempo? Su <strong> 00:00:00 UTC </strong> en <strong> 1 de enero de 1970 </strong> . Esto a menudo se conoce como la época de Unix. Los programadores eligieron esta fecha para la época por conveniencia, ya que era la fecha más cercana cuando inventaron la hora Unix. </p> <p> Es posible que haya visto esta fecha cuando algo salió mal. Claramente es un error, pero se ve muy extraño cuando resulta en una fecha anterior a la época en que muchos de nosotros nacimos. Sin embargo, es completamente comprensible cuando se conoce la época de Unix. Si algún sistema está intentando mostrar una marca de tiempo que no tiene ningún valor, a menudo se traducirá a 0 y dará como resultado la fecha de época exacta. </p> <p> </p> <h2 id=\"the-unix-time-data-format\"> El formato de datos de tiempo de Unix </h2> <p> Estrictamente hablando, no hay ninguno. El tipo de datos original era un entero de 32 bits y, a menudo, este sigue siendo el caso, incluso en sistemas mucho más potentes. </p> <p> Este tipo de datos permite que el valor almacene un total de 2 ^ 32 segundos, que es un poco más de 136 años. Este valor suele estar firmado, lo que significa que puede ser negativo o positivo. Por lo tanto, generalmente representa 68 años a cada lado de la época, es decir, 1902-2038. </p> <p> Este es todavía un período limitado, por supuesto. Pero el uso principal del formato de marca de tiempo fue para conceptos como la modificación de archivos. La necesidad era más que representar un tiempo cercano al presente, más que la historia antigua o el futuro lejano. Incluso para aplicaciones como calendarios, rara vez es necesario representar fechas de más de algunas décadas en el futuro. </p> <p> Pero eso no significa que este período de tiempo limitado no tenga problemas ... </p> <h3 id=\"the-year-2038-problem\"> El problema del año 2038 </h3> <p> El error Y2K ( <a href=\"https://www.makeuseof.com/tag/worst-programming-mistakes-in-history/\" target=\"_blank\" rel=\"nofollow noopener\"> uno de los peores errores de programación de la historia </a> ) sistemas informáticos afectados que almacenaban años como valores de dos dígitos. Cuando llegó el año 2000, dichos sistemas lo trataron como si fuera 1900. En realidad, esto no fue tan catastrófico como se temía, principalmente porque muchas personas dedicaron mucho tiempo y esfuerzo a prepararse para ello. </p> <p> Si prestaste atención en la sección anterior, es posible que hayas detectado un problema similar que podría afectar la hora de Unix. Bueno, la hora de Unix tiene un problema de datos propio: el problema Y2k38. (A menudo se lo denomina un problema, no un error; ¡quizás nos hemos vuelto más optimistas desde el año 2000!) Cuando el tiempo de Unix literalmente se agote en 2038, los sistemas tratarán las nuevas fechas como 1902 o 1970. O posiblemente &#39; Simplemente fallaré por completo. </p> <p> Al menos este problema no nos golpeará al filo de la medianoche de la víspera de Año Nuevo. El último segundo del tiempo Unix de 32 bits caerá el 19 de marzo. En la eventualidad, es probable que actualice la mayoría de los sistemas para 2038 o estarán obsoletos de todos modos. </p> <p> </p> <h2 id=\"some-useful-timestamp-resources\"> Algunos recursos útiles sobre marcas de tiempo </h2> <p> La <a href=\"https://www.epochconverter.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Convertidor de época </a> site es posiblemente el conversor de marcas de tiempo más completo disponible. Comienza mostrando la hora actual de Unix, en tiempo real, y agrega casi todas las funciones imaginables encima. Su uso principal es la conversión entre marcas de tiempo y fechas legibles por humanos, en ambas direcciones. </p> <p> Dan&#39;s Tools es una gran colección de aplicaciones web útiles, una de las cuales es <a href=\"https://www.unixtimestamp.com/index.php\" target=\"_blank\" rel=\"nofollow noopener\"> convertidor de marca de tiempo </a> . Es más básico, pero tiene una presentación muy limpia y es fácil de usar. </p> <p> <a href=\"https://time.is/Unix_time_now\" target=\"_blank\" rel=\"nofollow noopener\"> Tiempo es </a> presenta otro aspecto aún más minimalista. Muestra la hora en varios formatos, incluida la hora Unix. Incluye la hora actual en el título de su página, lo cual es útil. </p> <p> <img alt=\"A screenshot of the Time.is websites showing Unix Time\" src=\"images/time-is-177.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"using-unix-time-with-command-line-tools\"> Uso de Unix Time con herramientas de línea de comandos </h2> <p> En Linux y macOS, el <strong> fecha </strong> El programa es la utilidad principal para lidiar con la fecha / hora, incluidas las marcas de tiempo de Unix. Llamado sin ningún argumento, devuelve la fecha / hora actual en un formato legible por humanos: </p> <pre><code class=\"hljs ruby\">$ date<br>Wed Feb 10 12:28:30 GMT 2021</code></pre> <p> Si necesita la fecha / hora actual en tiempo Unix, use el <strong> +% s </strong> argumento: </p> <pre><code class=\"hljs ruby\">$ date +%s<br>1612960114</code></pre> <p> Puede convertir una fecha legible por humanos en una marca de tiempo utilizando el <strong> -D </strong> marca si tu versión de <strong> fecha </strong> lo apoya. La mayoría de las versiones de Linux deberían, de forma predeterminada: </p> <pre><code class=\"hljs ruby\">$ date -d \"Jan 2 1970\" +%s<br>82800</code></pre> <p> En macOS, <strong> fecha </strong> es un programa diferente, que requiere un conjunto diferente de banderas: </p> <pre><code class=\"hljs perl\">$ date -j -f \"%b %d %Y %T\" \"Jan 02 1970 00:00:00\" \"+%s\"<br>82800</code></pre> <p> Yendo en la otra dirección, puede convertir desde una marca de tiempo Unix usando el <strong> -r </strong> bandera: </p> <pre><code class=\"hljs ruby\">$ date -r 1600000000<br>Sun 13 Sep 2020 13:26:40 BST</code></pre> <p> Algunos otros programas utilizan <strong> %s </strong> formato para hacer frente a la hora Unix. Por ejemplo, si desea mostrar la fecha de modificación de un archivo en tiempo Unix, con el <a href=\"https://www.makeuseof.com/ls-command-linux/\" target=\"_blank\" rel=\"nofollow noopener\"> Versión de Linux de <strong> ls </strong></a> , puede utilizar lo siguiente: </p> <pre><code class=\"hljs perl\">$ ls -l --time-style=+%s index.tmp.html<br>-rw-r--r-- 1 ubuntu ubuntu 17862 1521649818 index.tmp.html</code></pre> <p> </p> <h2 id=\"how-to-use-unix-time-in-programming-languages\"> Cómo utilizar Unix Time en lenguajes de programación </h2> <p> PHP tiene el <strong> hora() </strong> función que devuelve la marca de tiempo actual de Unix. Su <strong> fecha() </strong> La función toma una marca de tiempo como segundo argumento: </p> <pre><code class=\"hljs ruby\">$ php -r 'echo date(\"Y-m-d\", time());'<br>2021-02-11</code></pre> <p> JavaScript se acerca a las cosas de una manera interesante. Tiene un <strong> Date.now () </strong> método para obtener el número de milisegundos desde la época de Unix. Por supuesto, puede dividir esto por 1,000 y redondear el resultado para obtener el tiempo Unix equivalente en segundos: </p> <pre><code class=\"hljs perl\">> Math.floor(Date.now() / 1000)<br>1613083012</code></pre> <p> </p> <h2 id=\"understanding-unix-time\"> Entendiendo el tiempo de Unix </h2> <p> El tiempo Unix es un concepto simple que surge en muchos lugares. Una vez que lo entienda, puede resultarle bastante útil, por ejemplo, al calcular las diferencias de tiempo. También puede reconocer cuándo puede ser la causa de ciertos errores. </p> <p> Conceptos como la época y las marcas de tiempo son una parte importante para comenzar con Linux. Para obtener más información sobre elementos esenciales como <strong> ls </strong> , consulte nuestra guía de comandos básicos de Linux. </p>"}