{"title":"Roku quiere tus pensamientos sobre su control remoto recargable","content":"<p> Roku está reclutando a algunas personas para que se unan a su Programa de acceso anticipado, con el fin de probar un nuevo control remoto (llamado Roku Voice Remote Pro) que cuenta con una batería recargable. </p> <p> Es una oferta por tiempo limitado hasta agotar existencias, aunque todavía tiene que pagar por el control remoto. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> ¿Qué es Roku Voice Remote Pro? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> Finalmente un control remoto con batería recargable </a> de <a href=\"https://www.reddit.com/r/Roku/\"> Roku </a> </blockquote>  <p> Como lo descubrió por primera vez el usuario Kingtut206 en <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , Roku está reclutando personas para su Programa de acceso anticipado para probar un nuevo control remoto llamado Roku Voice Remote Pro. </p> <p> El nuevo control remoto cuenta con una batería recargable, un buscador remoto perdido (por ejemplo, puede decir &quot;Oye, Roku, encuentra mi control remoto&quot;), voz manos libres y botones de acceso directo personales junto con los botones de marca estándar. </p> <p> Según lo informado por <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> El borde </a> , el control remoto se carga a través de micro-USB, en lugar del muy superior USB-C. Quizás los comentarios recopilados a través del Programa de acceso temprano reconozcan esto. </p> <p> La participación en el programa es solo por invitación, aunque se desconoce qué lo califica. </p> <p> El control remoto cuesta $ 29,99 y se espera que se envíe el 19 de febrero de 2021. </p> <p> Solo se venderán 2,000 unidades y Roku recopilará comentarios sobre su experiencia con el control remoto. Después de ese tiempo, podemos asumir que el control remoto se perfeccionará antes de que potencialmente se ponga a la venta general. </p>"}