{"title":"Spotify está probando letras en vivo en los EE. UU.","content":"<p> ¿Te gusta cantar tus canciones favoritas de Spotify, pero siempre tienes que buscar la letra para asegurarte de que tu karaoke sea preciso? Estás de suerte. Spotify ahora está probando su función de letras en vivo para algunas personas en los EE. UU. </p> <h2 id=\"spotify-rolls-out-real-time-lyrics\"> Spotify lanza letras en tiempo real </h2> <p> Si se encuentra en los EE. UU., Es posible que vea una nueva función de Spotify que le permite mostrar letras en tiempo real contra la música que está reproduciendo. Las letras son proporcionadas por la compañía de datos musicales Musixmatch. </p> <p> &quot;Poder&quot; es la palabra clave allí, ya que todavía se encuentra en una fase de prueba. Eso significa que solo un grupo de usuarios verá la función mientras Spotify mide su impacto. Se desconoce cuántos usuarios componen el grupo de prueba. </p> <p> Las letras han sido una función solicitada durante mucho tiempo para Spotify, por lo que sería sorprendente si la función no se implementara finalmente para todos, pero nada es seguro. </p> <p> En un correo electrónico a <a href=\"https://www.engadget.com/spotify-live-lyrics-united-states-test-ios-android-140045159.html\" target=\"_blank\" rel=\"nofollow noopener\"> Engadget </a> , un portavoz de Spotify dijo: </p> <blockquote> <p> Podemos confirmar que actualmente estamos probando nuestra función de letras para un número selecto de usuarios en los EE. UU. En Spotify, realizamos de forma rutinaria una serie de pruebas en un esfuerzo por mejorar nuestra experiencia de usuario. Algunas de esas pruebas terminan allanando el camino para nuestra experiencia de usuario más amplia y otras sirven solo como un aprendizaje importante. No tenemos más noticias que compartir en este momento. </p> </blockquote> <p> </p> <h2 id=\"are-lyrics-new-for-spotify\"> ¿Son las letras nuevas para Spotify? </h2> <p> Estrictamente hablando, las letras en tiempo real no son una característica nueva. Eso es porque ha estado disponible en países como Brasil, México, India y Singapur desde junio de 2020. </p> <p> De hecho, mucho antes de eso, Spotify tenía una función de letras en vivo en todo el mundo. También se produjo como resultado de una asociación con Musixmatch, aunque la función se eliminó sin ceremonias cuando finalizó el acuerdo entre las dos compañías. </p> <p> Spotify luego lo reemplazó con una integración con Genius, en una función denominada &quot;Behind the Lyrics&quot;, que muestra información y datos divertidos sobre algunas canciones. Esto también es algo que está disponible en Apple Music, que a su vez también admite letras en vivo. </p> <p> Engadget informa que &quot;Behind the Lyrics&quot; se eliminará de Spotify si la función de letras en vivo se amplía. Es probable que muchos no se lo pierdan. </p> <p> Para aquellas personas en regiones que aún no tienen letras en vivo, existe la opción de <a href=\"https://www.makeuseof.com/tag/lyrics-currently-playing-songs-spotify/\" target=\"_blank\" rel=\"nofollow noopener\"> usar otras aplicaciones para ver letras en Spotify </a> . </p> <p> Por supuesto, también puede usar uno de los muchos sitios web de letras de Internet, aunque estos no se mostrarán a tiempo con su música de Spotify. </p>"}