{"title":"Surface Duo obtiene una fecha de lanzamiento en el Reino Unido y una caída de precio","content":"<p> Surface Duo de Microsoft no tuvo una recepción de lanzamiento tan fantástica, pero parece que la compañía está ansiosa por hacer mejores primeras impresiones fuera de los EE. UU. La compañía no solo está recortando el precio de Surface Duo, sino que también tiene una fecha de lanzamiento confirmada para el mercado del Reino Unido. </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> Preparativos finales en el extranjero de Microsoft para Surface Duo </h2> <p> Esta noticia nos llega de <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . Si recuerdas, cuando se lanzó Surface Duo, <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> no recibió buenas críticas </a> . Un punto de fricción central fue lo defectuoso que era el sistema operativo del Duo, pero otro fue su precio deslumbrante de $ 1399.99. </p> <p> Microsoft ha estado trabajando arduamente para solucionar los principales problemas que encontraron los revisores, pero su alto precio aún se mantuvo donde estaba. Sin embargo, Microsoft planea darle a Surface Duo una caída de precio significativa a $ 999.99. </p> <p> Es probable que esta caída sea en preparación para su lanzamiento en el extranjero, ya que los críticos de todo el mundo se preparan para desglosar el Surface Duo centímetro a centímetro. Con este precio reducido, más las correcciones recientes del sistema operativo Surface Duo, la maravilla de doble pantalla aún puede causar una impresión positiva en el extranjero. </p> <p> Microsoft también ha confirmado cuándo los fanáticos del Reino Unido pueden probar Surface Duo por sí mismos. Si se encuentra en el Reino Unido, esté atento a los minoristas de electrónica el 18 de febrero de 2021. </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> Arañando la superficie de los planes de Microsoft en el extranjero </h2> <p> Si bien Surface Duo luchó por causar una buena impresión en los EE. UU., Todavía puede haber esperanzas en el extranjero. Con todas las correcciones al sistema operativo de Surface Duo combinadas con esta caída de precio, el césped puede terminar siendo más verde en el otro lado. </p> <p> Si desea saber qué tipo de parches ha impulsado Microsoft para Surface Duo, la compañía lanzó recientemente algunas actualizaciones de estabilidad para solucionar los errores antes del debut internacional de Duo. </p> <p> <small> Crédito de la imagen: Jack Skeens / <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}