{"title":"Tarjeta de salud inteligente versus pasaporte de vacunación digital: ¿Cuál es la gran diferencia?","content":"<p> La pandemia de COVID-19 ha hecho tambalear los sistemas de salud. Ahora, la perspectiva de los pasaportes sanitarios digitales y las tarjetas sanitarias inteligentes se está acelerando a medida que los gobiernos y las empresas intentan volver a la normalidad. </p> <p> Entonces, ¿qué es una tarjeta sanitaria inteligente y es lo mismo que un pasaporte sanitario? </p> <h2 id=\"what-is-a-smart-health-card\"> ¿Qué es una tarjeta sanitaria inteligente? </h2> <p> Una tarjeta sanitaria inteligente es un plástico delgado con un chip de circuito integrado que contiene datos cifrados. </p> <p> Lo que lo hace inteligente es el chip que actúa como una supercomputadora. El chip se puede programar para realizar diferentes acciones con numerosas aplicaciones, mientras que los lectores conectados a un sistema informático pueden acceder o actualizar los datos del chip. </p> <p> Puede parecer una tarjeta de crédito, pero funciona de manera diferente. Utilizada en muchos países de Europa y en todo el mundo, una tarjeta sanitaria inteligente almacena información sanitaria, cobertura de seguro y otros datos médicos vitales. </p> <p> </p> <h2 id=\"advantages-of-using-a-smart-health-card\"> Ventajas de utilizar una tarjeta sanitaria inteligente </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Asistencia sanitaria en Francia: ¿Qué es una &quot;Carte Vitale&quot;? <a href=\"https://t.co/5VVcTjZyxh\"> https://t.co/5VVcTjZyxh </a> <a href=\"https://t.co/6I0TCy70wg\"> pic.twitter.com/6I0TCy70wg </a></p> - FrenchEntrée (@FrenchEntree) <a href=\"https://twitter.com/FrenchEntree/status/738646709308379136?ref_src=twsrc%5Etfw\"> 3 de junio de 2016 </a></blockquote>  <p> Entre muchas otras ventajas de utilizar este sistema, la más importante es mejorar la atención crítica o de emergencia. Las tarjetas de salud inteligentes brindan acceso inmediato a los datos de salud o registros médicos de un paciente en caso de emergencia. </p> <p> Por ejemplo, un respondedor de emergencia con un lector de tarjetas portátil tendrá información inmediata sobre el paciente mientras se encuentra en la ambulancia de camino al hospital. Esto es aún más importante cuando el paciente está inconsciente, no responde o simplemente no puede decirle al respondedor su información médica. </p> <p> Imagine un respondedor que pueda enviar datos críticos del paciente al personal de la sala de emergencias antes de que llegue la ambulancia. Ayudará al personal de la sala de emergencias a preparar lo que se necesita para tratar al paciente incluso antes de su llegada. </p> <p> La transferencia rápida y eficiente de datos del paciente durante cuidados críticos puede mejorar en gran medida el tiempo de respuesta, salvando así vidas. </p> <h3 id=\"seamless-transfer-of-data\"> Transferencia perfecta de datos </h3> <p> El uso de este sistema también proporciona una transferencia más precisa y fluida de la información del paciente del personal de la sala de emergencias a los proveedores de atención médica en la atención hospitalaria. </p> <p> Los médicos no tendrán que depender de la memoria del paciente para <a href=\"https://www.makeuseof.com/tag/google-store-medical-data-cloud/\" target=\"_blank\" rel=\"nofollow noopener\"> recuperar datos médicos críticos </a> , lo que reduce las posibilidades de error. Aparte de esto, un sistema de tarjeta de salud inteligente ofrece un intercambio fluido de información del paciente entre médicos. </p> <p> Disminuye las posibilidades de filtrar datos críticos del paciente (que pueden usarse para <a href=\"https://www.makeuseof.com/tag/the-10-pieces-of-information-identity-thieves-are-looking-for/\" target=\"_blank\" rel=\"nofollow noopener\"> el robo de identidad </a> ). Esto sucede a menudo cuando la información del paciente se comparte por fax, teléfono o correo electrónico. </p> <h3 id=\"easier-storage-and-retrieval-of-medical-records\"> Almacenamiento y recuperación más fáciles de registros médicos </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"it\" dir=\"ltr\"> Tessera sanitaria: come richiederne un duplicato <a href=\"https://t.co/2GrFWpanC2\"> https://t.co/2GrFWpanC2 </a> <a href=\"https://t.co/JKR6ampnXq\"> pic.twitter.com/JKR6ampnXq </a></p> - CataniaToday (@CataniaToday) <a href=\"https://twitter.com/CataniaToday/status/1359189830937300995?ref_src=twsrc%5Etfw\"> 9 de febrero de 2021 </a></blockquote>  <p> El sistema proporciona a los pacientes una forma cómoda y sencilla de llevar los resultados de las pruebas de laboratorio o las notas del médico. </p> <p> Es como tener una base de datos de información médica (pruebas, tratamientos y archivos previos para la cobertura del seguro) en una pequeña tarjeta en la billetera del paciente. Ya no es necesario cargar con pedazos de papel para una cita con el médico. </p> <h3 id=\"reduces-medical-errors-and-duplicate-testing\"> Reduce los errores médicos y las pruebas duplicadas </h3> <p> El sistema de salud del país puede incluso beneficiarse de esto, ya que se pueden evitar errores médicos y pruebas duplicadas. Los errores médicos que vienen con la entrada de datos incorrecta, las barreras del idioma o la falta de comunicación se pueden minimizar a través de este sistema. </p> <p> El error humano a veces puede causar una falta de coincidencia entre los pacientes y los registros. Tener una tarjeta de salud inteligente permite a los proveedores de atención médica hacer coincidir al paciente con los registros de salud correctos fácilmente. Esto reduce las posibilidades de tener registros duplicados o múltiples pruebas redundantes, lo que podría costar mucho dinero. Podría ahorrarle al sistema de salud gastos innecesarios. </p> <h3 id=\"more-accurate-verification-of-insurance-coverage\"> Verificación más precisa de la cobertura del seguro </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> ¿Descanso en la ciudad? ¿Viaje de trabajo? ¿Vacaciones? Para su tranquilidad, lleve siempre consigo su Tarjeta Sanitaria Europea. <a href=\"https://t.co/31zoREZAEy\"> https://t.co/31zoREZAEy </a> <a href=\"https://twitter.com/hashtag/EHIC?src=hash&ref_src=twsrc%5Etfw\"> #EHIC </a> <a href=\"https://t.co/o05Jx8aIwq\"> pic.twitter.com/o05Jx8aIwq </a></p> - Comisión Europea 🇪🇺 (@EU_Commission) <a href=\"https://twitter.com/EU_Commission/status/893485278114992128?ref_src=twsrc%5Etfw\"> 4 de agosto de 2017 </a></blockquote>  <p> El robo de identidad médica se ha convertido en un problema grave en los últimos años. El delito implica el uso fraudulento de la información del seguro médico para acceder a los servicios de atención médica o recibir un reembolso. En pocas palabras, una persona que no está cubierta por una póliza puede robar la información del seguro médico de otra persona para obtener beneficios. </p> <p> Las infracciones del sistema de atención médica o de seguros médicos a menudo filtran información confidencial de identificación personal (PII) que los piratas informáticos pueden vender en la web oscura. La PII puede incluir información sobre el seguro médico. </p> <p> Esto es lo que usan los ladrones para acceder a servicios de salud a los que no deberían tener acceso. Pueden comprar medicamentos recetados o presentar reclamaciones de seguros fraudulentas por procedimientos que nunca se realizaron. </p> <p> Un sistema de tarjetas de salud inteligente puede prevenir todo esto, ya que la mayoría usa protocolos de autenticación y seguridad. Algunos pueden usar autenticación de 2 factores (2FA) o autenticación de múltiples factores (MFA), mientras que otros tienen una función biométrica que busca las huellas dactilares del paciente para verificar su identidad. </p> <p> </p> <h2 id=\"disadvantages-of-using-a-smart-health-card-system\"> Desventajas de utilizar un sistema de tarjeta sanitaria inteligente </h2> <p> Los problemas de privacidad siguen siendo la mayor preocupación que disuade a los usuarios de adaptar la tecnología para fines médicos. Muchos han expresado su preocupación por brindar a las personas un fácil acceso a una multitud de datos confidenciales, como tratamientos, registros de enfermedades y medicamentos. Y con la noticia de que los sistemas de salud y seguros se están convirtiendo en víctimas de violaciones de datos, estas preocupaciones no son exactamente infundadas. </p> <p> Tener todos los registros en un solo lugar puede ser conveniente, pero un solo <a href=\"https://www.makeuseof.com/tag/healthcare-new-attack-vector-scammers-id-thieves/\" target=\"_blank\" rel=\"nofollow noopener\"> Filtración de datos </a> podría dejar datos altamente confidenciales en las manos equivocadas. </p> <h3 id=\"creating-digital-divide\"> Creando brecha digital </h3> <p> Luego está el problema de crear una brecha digital. Muchos argumentan que las tarjetas sanitarias inteligentes solo pueden ser utilizadas por hospitales y comunidades con acceso al sistema. Para aprovechar esta tecnología, la máquina de un hospital debe admitir el mismo software, la misma interfaz de lector de tarjetas inteligentes y debe ser compatible con el hardware necesario. </p> <p> Hablando de hardware, también está la cuestión de los costos adicionales. El hardware para el sistema, el software para el lector y la red con la base de datos podrían costar millones y su mantenimiento podría costar aún más. Incluso las tarjetas de plástico en sí mismas cuestan dinero para producirlas. </p> <p> ¿Quién va a pagar la inversión inicial? Además, ¿cuánto tiempo pasará antes de que esta inversión inicial genere beneficios para el gobierno y sus ciudadanos? </p> <h3 id=\"bugs-and-power-failures\"> Errores y fallas de energía </h3> <p> Por supuesto, este tipo de tecnología no es inmune a errores, fallas o ciberataques que pueden causar filtraciones de datos. Un solo dispositivo sin parches en el sistema puede convertirse en una puerta de entrada para el malware que puede causar daños a la red y la base de datos. </p> <p> También existen preocupaciones sobre los cortes de energía. ¿Cómo se puede sostener esto en comunidades con energía limitada o problemas de infraestructura eléctrica? Incluso los sistemas de energía más sofisticados pueden fallar en desastres importantes. Imagínese no tener acceso a datos médicos durante un desastre. </p> <p> </p> <h2 id=\"smart-healthcare-vs-digital-vaccination-passport\"> Smart Healthcare vs. Pasaporte de vacunación digital </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Grandes nombres en tecnología y atención médica, incluidos Mayo Clinic, Evernorth de Cigna y Microsoft, se están uniendo para crear un pasaporte de vacunación digital COVID-19. <a href=\"https://t.co/KgTVjq9lUe\"> https://t.co/KgTVjq9lUe </a> <a href=\"https://t.co/ZiJIE8xoTY\"> pic.twitter.com/ZiJIE8xoTY </a></p> - Salud del mástil (@MastAnalytics) <a href=\"https://twitter.com/MastAnalytics/status/1351683116990164993?ref_src=twsrc%5Etfw\"> 20 de enero de 2021 </a></blockquote>  <p> Se ha hablado de un pasaporte de vacunación digital para viajar y acceder a conciertos o tertulias post-Covid. Si bien un pasaporte sanitario digital puede parecer similar a las tarjetas sanitarias inteligentes que se utilizan en países como Alemania, Francia y Austria, existen diferencias clave. </p> <p> </p> <p> Primero, el pasaporte digital de la vacuna COVID-19 vendrá en forma de un certificado digital descargado en el teléfono de una persona. El certificado digital o pasaporte de la vacuna Covid es un pase con el nombre del paciente y los detalles de su vacuna Covid (fecha de administración, fabricante de la vacuna, ubicación de la vacuna). Es un documento digital de una página con un código de barras o un código QR que se puede escanear en los puntos de entrada. </p> <p> A diferencia de la tarjeta sanitaria inteligente, el pasaporte sanitario digital no está destinado a ser una tarjeta de plástico física. </p> <p> Solo tendrá información relacionada con las pruebas de COVID-19 de la persona, los registros de vacunación y los centros de atención médica donde se realizaron esas vacunas y pruebas. No tendrá el historial médico completo del paciente. </p> <p> Estos pasaportes de salud digitales darán a las personas acceso a reuniones como conciertos y lugares de trabajo donde estarán en contacto con muchas personas o les darán acceso a países una vez que los viajes adquieran cierta sensación de normalidad. Las personas que no tienen un teléfono inteligente pueden imprimir sus códigos, escaneados en el punto de entrada. </p> <h3 id=\"breach-of-privacy-and-curtailment-of-human-rights\"> Violación de la privacidad y restricción de los derechos humanos </h3> <p> Si bien muchos están ansiosos por recibir el jab, descargar un pasaporte de vacunación digital y volver a la normalidad, algunos están haciendo sonar la alarma sobre las posibles repercusiones de la introducción de esta tecnología. Expertos y defensores de los derechos humanos advierten a los desarrolladores que aborden los posibles problemas de privacidad de los datos y derechos humanos que podría traer un pasaporte de vacunación. </p> <p> Investigación publicada por el <a href=\"https://socialsciences.exeter.ac.uk/media/universityofexeter/collegeofsocialsciencesandinternationalstudies/lawimages/research/Policy_brief_-_Digital_Health_Passports_COVID-19_-_Beduschi.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Facultad de Derecho de la Universidad de Exeter </a> advierte cómo este pasaporte podría restringir los derechos humanos fundamentales, incluido el derecho a la privacidad, la libertad de movimiento y reunión pacífica. </p> <p> Según el informe, el problema proviene del uso que hace el pasaporte de información de salud personal confidencial (¿cómo se almacenará, quién tendrá acceso a ella?) Y cómo puede crear una nueva división entre las personas en función de su estado de salud. </p> <p> El pasaporte también puede potencialmente determinar o limitar el grado en que una persona disfruta de derechos y libertades. El uso de pasaportes sanitarios digitales, advierten los expertos, podría profundizar las desigualdades entre las comunidades que tienen acceso inmediato a vacunas o pasaportes sanitarios y las que no. </p> <p> </p> <h2 id=\"future-of-healthcare\"> Futuro de la asistencia sanitaria </h2> <p> Países como Francia han estado utilizando tarjetas sanitarias inteligentes desde la década de los 90, y otros países siguieron su ejemplo a principios de la década de 2000. </p> <p> La adopción de esta tecnología ha sido bastante lenta en países como los EE. UU., Y han señalado los problemas de privacidad como la principal preocupación. Si bien la adopción de este sistema tiene muchas ventajas, también existen varias desventajas que merecen una consideración cuidadosa. </p>"}