{"title":"Twitter para etiquetar las cuentas personales de los funcionarios gubernamentales","content":"<p> Twitter pronto comenzará a colocar etiquetas en las cuentas personales de los funcionarios del gobierno. Se supone que las etiquetas ayudan a los usuarios a identificar fácilmente a cualquier persona asociada con el gobierno. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Más funcionarios gubernamentales recibirán una etiqueta en Twitter </h2> <p> Según una publicación en <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> el blog de Twitter </a> , la plataforma comenzará a etiquetar las cuentas personales de los &quot;jefes de estado&quot; el 17 de febrero de 2021. También colocará etiquetas en las cuentas asociadas con los medios afiliados al estado. </p> <p> Twitter también está ampliando el alcance de sus etiquetas para cubrir a funcionarios gubernamentales en más países. Estas ubicaciones incluyen Canadá, Cuba, Ecuador, Egipto, Alemania, Honduras, Indonesia, Irán, Italia, Japón, Arabia Saudita, Serbia, España, Tailandia, Turquía y los Emiratos Árabes Unidos. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Crédito de imagen: Twitter </p> <p> La plataforma espera que estas etiquetas ayuden a los usuarios a &quot;tener una experiencia más informada en Twitter&quot; y también planea modificar el texto de la etiqueta para &quot;agregar más especificidad&quot; al &quot;diferenciar entre individuos e instituciones&quot;. </p> <p> La primera ola de etiquetas de Twitter para cuentas afiliadas al gobierno se lanzó en agosto de 2020. Inicialmente, estas etiquetas solo se aplicaban a los funcionarios asociados con los cinco países en el Consejo de Seguridad de las Naciones Unidas y no incluían las cuentas personales de esos funcionarios. </p> <p> Dicho esto, estas etiquetas no son un <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> pinchazo flagrante a la desinformación </a> , pero aún así ayudarán a los usuarios a obtener más contexto sobre lo que están leyendo y de quién proviene. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter solo continuará expandiendo sus etiquetas </h2> <p> Al final de la publicación de su blog, Twitter señaló que espera expandir sus etiquetas a &quot;países adicionales con el tiempo&quot;. La etiqueta aparece como una bandera gris pálido en el perfil de Twitter de una persona y es probable que la encuentre con más frecuencia en las próximas semanas. </p>"}