{"title":"Una enorme actualización de Microsoft Edge se dirige a ti","content":"<p> Microsoft está trabajando muy duro para hacer que su navegador de Internet, Edge, sea lo mejor que puede ser. Ahora, la compañía está aportando tres características importantes, y las cosas se ven optimistas para el futuro de Edge. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Lo que Microsoft ha planeado para Edge </h2> <p> La gran actualización del parachoques fue captada por <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows más reciente </a> . Las tres funciones están programadas para venir en una gran actualización, por lo que vale la pena estar atento a Edge en un futuro cercano. </p> <p> En primer lugar, Microsoft Edge está obteniendo soporte para widgets web. Estos widgets son una forma práctica de obtener un vistazo rápido de información vital a lo largo del día. El gigante del software quiere experimentar con widgets de todas las formas y tamaños, pero ha decidido comenzar con un widget de noticias para comenzar. </p> <p> A continuación, Microsoft Edge está obteniendo una función de búsqueda de pestañas. Si esto le suena familiar, es probable que haya leído el <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> especulación inicial de que Edge obtenga una herramienta de búsqueda de pestañas </a> . Afortunadamente, esta especulación se ha convertido en una realidad y Microsoft planea llevar la función de Chrome a Edge. </p> <p> Finalmente, podrá administrar todas sus extensiones de Edge desde un solo menú. Aparecerá como una pieza de rompecabezas en la barra de tareas de su navegador, y cuando haga clic en ella, le mostrará todas las extensiones que ha instalado junto con una forma rápida de habilitar y deshabilitar cada una. </p> <p> No está seguro de cuándo se lanzará exactamente esta actualización, pero Windows Latest lo tiene anclado para &quot;la próxima gran actualización&quot;. Como tal, no pasará mucho tiempo hasta que Microsoft Edge se convierta en una opción atractiva para las personas que buscan algo nuevo. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: ¿la próxima gran novedad? </h2> <p> Durante mucho tiempo, los navegadores de Microsoft fueron considerados administradores de descargas avanzados para instalar Chrome o Firefox. Sin embargo, desde que Microsoft adoptó una base de código Chromium para su navegador, ha pasado de ser el hazmerreír del mundo de los navegadores. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCounter </a> enumera Microsoft Edge como el segundo navegador de Windows más utilizado en los EE. UU. al momento de escribir este artículo. Ya sabíamos que Firefox estaba siendo dejado en el polvo por Edge, pero desde entonces, la brecha solo se ha ensanchado. </p> <p> Ahora, Edge representa el 5,25 por ciento de la cuota de mercado de EE. UU., En comparación con el 3,35 por ciento que posee Firefox. Ambos están muy lejos del 45,83 por ciento de Chrome, pero es un comienzo. </p> <p> Como tal, si anteriormente le has dado la vuelta al navegador de Microsoft, ahora es un buen momento para darle una segunda oportunidad. Quién sabe, ¡es posible que el mejor navegador de Microsoft lo haya conquistado! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Llevando el navegador al límite </h2> <p> Si no ha sido fanático de los navegadores de Microsoft en el pasado, es un buen momento para entrar y ver de qué se trata el alboroto. Se está trabajando en una gran actualización, y solo mejorará a partir de aquí. </p> <p> Microsoft sabe que tiene una fórmula ganadora. De hecho, la compañía informó recientemente que 600 millones de personas en todo el mundo ahora usan Edge para navegar por la web. </p> <p> <small> Crédito de la imagen: DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}