{"title":"VW afirma que Apple no tendrá un viaje fácil en la industria automotriz","content":"<p> Herbert Diess, director ejecutivo de Volkswagen Group, ha minimizado cualquier impacto potencial de un Apple Car en la industria automotriz, diciendo que VW &quot;no tiene miedo&quot; del Proyecto Titán. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW &quot;No le teme&quot; a un Apple Car </h2> <p> Aunque Diess reconoce que un automóvil de la marca Apple puede tener sentido, no cree que Apple pueda dominar el panorama de la fabricación de automóviles &quot;de la noche a la mañana&quot; debido a la intensa competencia. Cortar acero y vender autos a consumidores exigentes es un negocio difícil, insinuó, y agregó que este no es un campo en el que una sola compañía pueda &quot;hacerse cargo de un solo golpe&quot;. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> transmite lo que Diess le dijo a Frankfurter Allgemeine Sonntagszeitung en una entrevista: </p> <blockquote> <p> La industria del automóvil no es un sector tecnológico típico que pueda hacerse cargo de un solo golpe. Apple no se las arreglará de la noche a la mañana. Aún así, no tenemos miedo. </p> </blockquote> <p> Aún así, un vehículo de la marca Apple tendría sentido dadas las competencias de Apple en baterías, software, diseño industrial y sus recursos aparentemente infinitos, agregó el ejecutivo. Apple no ofrece ningún producto relacionado con el automóvil aparte de los <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Software de tablero CarPlay </a> que permite que la radio del coche o la unidad principal actúen como pantalla y controlador para un iPhone. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> El secreto peor guardado de la industria </h2> <p> Los planes para el Proyecto Titan (el nombre en clave interno de un Apple Car) aún no son públicos a pesar de una serie de rumores recientes que dicen <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple buscaba asociarse con Hyundai / Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Se dice que Apple ha hablado con otras empresas de automóviles. </a> y fabricantes contratados, incluidos Magna, Nissan y Foxconn, sobre la construcción de su vehículo de conducción autónoma. Las fuentes dicen que un Apple Car puede carecer de volante porque inicialmente puede <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> centrarse en la entrega de alimentos y las operaciones de robotaxi </a> antes de venderse a los consumidores. </p> <p> </p> <p> La conclusión más importante del comentario de Herbert sería que la industria del automóvil ha estado prestando mucha atención al Proyecto Titán. Claramente, la sola idea de que Apple entre en este sector está poniendo nerviosos a algunos de los altos ejecutivos. Dicho esto, la historia está llena de gente que debería haber sabido mejor que ridiculizar a Apple por ingresar a una nueva categoría de productos. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Cómo el CEO de Palm se rió del iPhone </h2> <p> El mejor ejemplo de ello es el ex director ejecutivo de Palm, Ed Colligan. Apenas unas semanas antes del lanzamiento original del iPhone en 2007, Colligan se rió de la idea de que una empresa conocida por diseñar computadoras bonitas pudiera ganar clientes en el competitivo sector de los teléfonos inteligentes, diciendo: </p> <blockquote> <p> Hemos aprendido y luchado durante algunos años aquí para descubrir cómo hacer un teléfono decente. Los chicos de PC no se van a dar cuenta de esto. No van a entrar simplemente. </p> </blockquote> <p> Al igual que Colligan describió a Apple como &quot;chicos de PC&quot;, el jefe de Volkswagen está tratando de restar importancia a la idea de que una empresa de tecnología podría ganar clientes en el negocio de la fabricación de automóviles. La historia mostrará si el comentario de Herbert envejecerá mejor que el de Colligan. </p>"}