{"title":"10 choses que vous ne saviez pas que Google Docs pouvait faire","content":"<p> Google Doc peut sembler basique à première vue, mais l&#39;outil de productivité dans le cloud comporte de nombreuses fonctionnalités négligées qui peuvent vous aider à en faire plus au travail. </p> <p> Dans cet article, nous examinerons plusieurs fonctionnalités de Google Doc que vous ne connaissiez probablement pas et comment vous pouvez les utiliser pour gagner du temps lors de la création de contenu. </p> <p> Veuillez noter que ces fonctionnalités sont principalement accessibles sur la version de bureau de l&#39;outil Google Docs. Ceux qui peuvent également être utilisés sur la version mobile seront indiqués. </p> <h2 id=\"voice-typing\"> 1. Saisie vocale </h2> <p> Pour utiliser la fonction de saisie vocale, ouvrez un document et cliquez sur <strong> Outils </strong> dans la barre de menu en haut de la page. Sélectionner <strong> Saisie vocale </strong> de la liste déroulante. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> Un microphone apparaîtra sur votre écran, avec un menu de langue où vous pourrez sélectionner votre langue préférée. Lorsque vous êtes prêt à prononcer votre texte, cliquez sur le microphone ou appuyez sur <strong> Cmd + Maj + S </strong> (si vous utilisez un Mac) ou <strong> Ctrl + Maj + S </strong> (si vous utilisez un PC Windows) pour démarrer l&#39;enregistrement. </p> <p> Pour ajouter de la ponctuation entre le texte, dites le nom du signe de ponctuation que vous souhaitez ajouter, comme « point », « virgule » ou « point d&#39;interrogation ». Vous pouvez donner des instructions de formatage telles que « nouvelle ligne » ou « nouveau paragraphe », ou « arrêter d&#39;écouter » si vous souhaitez faire une pause dans la saisie vocale, et « reprendre » lorsque vous êtes prêt à continuer. </p> <p> Recherchez les commandes d&#39;édition avancées à partir de ce <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> liste de commandes </a> sur la page d&#39;assistance de Google. </p> <p> Vous pouvez également utiliser cette fonctionnalité pour transcrire n&#39;importe quel audio. Jouez simplement l&#39;audio (depuis votre téléphone ou tout autre appareil) vers la voix-texte, et il devrait le taper pour vous. Vous devrez peut-être faire quelques modifications, mais vous auriez gagné beaucoup de temps. </p> <p> </p> <p> La fonction de saisie vocale n&#39;est disponible que sur le bureau, mais elle ne fonctionne que sur le navigateur Chrome. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Édition hors ligne </h2> <p> De nombreuses personnes adorent Google Docs pour sa fonctionnalité de sauvegarde instantanée dans le cloud, mais cela peut être gênant si vous n&#39;avez pas accès à Internet pendant un certain temps. La bonne nouvelle est que vous pouvez toujours accéder à vos fichiers et les modifier hors ligne. </p> <p> Cette fonctionnalité n&#39;est disponible que sur Google Chrome, et vous devrez installer et activer le <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Extension Chrome hors connexion Google Docs </a> . Assurez-vous également que vous ne naviguez pas en mode privé. </p> <p> Cette fonctionnalité doit être mise en place lorsque vous êtes en ligne, mais une fois cela fait, vous pouvez écrire et modifier du texte hors ligne, puis ils seront enregistrés dans le cloud lorsque vous aurez accès à Internet. Voici comment. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> Pour permettre de <strong> ouvrir et enregistrer les fichiers Google Docs hors connexion </strong> , poursuivre <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> ces instructions </a> . Cette fonctionnalité est disponible sur PC, iOS et Android. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Suivi/restauration de l&#39;historique des versions du document </h2> <p> Si vous travaillez sur un document seul ou avec d&#39;autres, vous pouvez suivre les modifications apportées au document à l&#39;aide de la fonction Historique des versions. </p> <p> Vous pouvez également restaurer le document à une version précédente temporairement ou définitivement ; une fonctionnalité qui peut vous sauver la vie si vous supprimez accidentellement des parties de votre document et ne pouvez pas utiliser le <strong> annuler </strong> bouton pour les restaurer. </p> <p> Pour utiliser la fonction d&#39;historique des versions, cliquez sur <strong> Déposer </strong> dans la barre de menus et sélectionnez <strong> Historique des versions </strong> de la liste déroulante. Vous verrez que vous pouvez également nommer une version, vous pouvez donc l&#39;utiliser pour suivre les modifications continues dans le document, en particulier si d&#39;autres utilisateurs apportent des modifications au même document. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Cette fonctionnalité n&#39;est disponible que sur le bureau. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Mode de suggestion et de révision </h2> <p> Bien qu&#39;il soit formidable de collaborer avec d&#39;autres et de modifier un document ensemble, il peut être difficile (et désordonné) de suivre les modifications que chaque personne a apportées. </p> <p> La fonctionnalité de suggestion vous permet de suggérer simplement des modifications si vous ne souhaitez pas modifier complètement le document. Vos suggestions apparaîtront à l&#39;éditeur sous forme de commentaires dans la barre latérale, et l&#39;éditeur peut apporter des modifications instantanées en acceptant la suggestion. Vous pouvez également poursuivre des fils de conversation avec <strong> Réponse </strong> , afin que vous puissiez donner et recevoir des commentaires directement sur la page du document sans avoir à envoyer d&#39;e-mails dans les deux sens. </p> <p> Pour suggérer des modifications, cliquez sur l&#39;icône en forme de crayon pour le mode Modification dans le coin supérieur droit de votre document ouvert, puis sélectionnez <strong> Suggérer </strong> . </p> <p> Pour afficher le document sans les suggestions, cliquez sur <strong> Affichage </strong> . Vous pourrez lire sans les barrés et les pop-ups de commentaires. </p> <p> Pour gagner du temps, vous pouvez accepter ou rejeter toutes les suggestions à la fois. Cliquez sur <strong> Outils </strong> , puis sélectionnez <strong> Examiner les modifications suggérées </strong> . Cliquez sur <strong> Accepter tout </strong> ou alors <strong> Tout rejeter </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Cette fonctionnalité n&#39;est disponible que sur le bureau. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Ajouter des polices </h2> <p> Si jamais tu veux <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> styliser votre texte </a> en fonction de votre message, vous pouvez également le faire avec Google Docs. Outre les 24 polices par défaut déjà programmées dans l&#39;outil Google Docs, vous pouvez ajouter plusieurs polices sympas de votre choix pour amplifier visuellement votre texte. </p> <p> Pour ajouter des polices, cliquez simplement sur <strong> Polices </strong> dans la barre de menu et sélectionnez <strong> Plus de polices </strong> . Sélectionnez autant de polices que vous le souhaitez dans la collection fournie. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Cette fonctionnalité n&#39;est disponible que sur le bureau. </p> <p> </p> <h2 id=\"compare-documents\"> 6. Comparez les documents </h2> <p> Il s&#39;agit d&#39;une autre fonctionnalité que vous pouvez utiliser pour suivre les modifications apportées à un document par vous-même ou un collaborateur. Il est particulièrement utile pour les documents volumineux et, comme son nom l&#39;indique, vous pouvez comparer deux documents pour voir les différences entre eux. </p> <p> Pour utiliser cette fonctionnalité, ouvrez le document de base pour lequel vous souhaitez effectuer une comparaison, puis cliquez sur le bouton <strong> Outils </strong> et sélectionnez <strong> Comparer les documents </strong> . </p> <p> Dans la boîte de dialogue qui s&#39;affiche, sélectionnez le document avec lequel vous souhaitez le comparer depuis votre Drive, puis cliquez sur <strong> Comparer </strong> . Dans le <strong> Attribuer les différences à </strong> champ, saisissez le nom du collaborateur qui sera l&#39;auteur des modifications suggérées dans le document final. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> Les différences apparaîtront de la même manière que dans le <strong> Suggérer </strong> nous avons discuté ci-dessus, et vous pouvez également accepter ou rejeter les modifications. </p> <p> Cette fonctionnalité n&#39;est disponible que sur le bureau. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Rechercher et remplacer </h2> <p> Si vous devez remplacer plusieurs instances d&#39;une erreur dans votre texte, Google Docs vous permet de le faire facilement grâce à la fonction Rechercher et remplacer. </p> <p> Pour les utilisateurs familiarisés avec la fonctionnalité Rechercher et remplacer dans Microsoft Word, cela fonctionne de la même manière. </p> <p> Pour rechercher un mot ou une expression en particulier dans votre document, utilisez le raccourci <strong> Ctrl + F </strong> sur un PC Windows ou <strong> Commande + F </strong> sur un Mac. Saisissez le mot dans le champ &quot;Rechercher dans le document&quot;. </p> <p> Pour remplacer le texte trouvé, cliquez sur les trois points sur le côté droit et sélectionnez <strong> Trouver et remplacer </strong> . </p> <p> Ensuite, entrez le texte dans le <strong> Trouve </strong> et le texte de remplacement dans le <strong> Remplacer par </strong> domaine. Faites défiler les instances de texte avec le curseur haut et bas et cliquez sur <strong> Remplacer </strong> pour les échanger individuellement. Ou cliquez <strong> Remplace tout </strong> pour remplacer tout le texte sélectionné à la fois. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Utilisez un dictionnaire </h2> <p> Pour vous aider à vous concentrer et éviter d&#39;avoir à basculer entre les onglets lorsque vous recherchez le sens d&#39;un mot, Google Docs dispose d&#39;un dictionnaire intégré à l&#39;application. </p> <p> Lorsque vous tapez et que vous devez rechercher un mot, mettez le mot en surbrillance, puis faites un clic droit et sélectionnez <strong> Définir </strong> du menu. L&#39;outil Dictionnaire recherchera la définition du mot sur Internet et elle apparaîtra sur le côté droit de votre écran. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Ajouter des accents de langue </h2> <p> Dites adieu à la mémorisation des raccourcis clavier accentués ou au copier/coller des lettres accentuées d&#39;autres documents. </p> <p> Pour utiliser des lettres accentuées, il faudrait télécharger <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> le module complémentaire &quot;Easy Accents&quot; </a> . Il vous permet d&#39;insérer des accents pour 20 langues différentes directement à partir d&#39;une barre latérale dans votre document. </p> <p> Téléchargez le module complémentaire Google Doc en ouvrant le <strong> Outils </strong> menu, puis cliquez sur <strong> Modules complémentaires </strong> et <strong> Obtenir des modules complémentaires </strong> . Dans la zone Google Marketplace qui s&#39;affiche, recherchez <strong> Accents faciles </strong> et cliquez sur le bouton d&#39;installation bleu pour l&#39;ajouter à votre collection de modules complémentaires Google Docs. </p> <p> Après l&#39;installation, cliquez sur le <strong> Modules complémentaires </strong> menu pour sélectionner le module complémentaire Easy Accents et commencer à ajouter des accents corrects sur tous vos mots étrangers. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Ce module complémentaire n&#39;est disponible que sur le bureau, mais les claviers mobiles prennent généralement en charge les accents de langue afin que vous puissiez écrire du texte avec des accents sur votre téléphone sans le module complémentaire. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Créer des raccourcis personnalisés </h2> <p> La plupart des gens connaissent <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Raccourcis Microsoft Word </a> , mais vous pouvez également créer vos propres raccourcis dans Google Docs. Pour créer des raccourcis personnalisés, cliquez sur <strong> Outils &gt; Préférences &gt; Substitution. </strong> Vous constaterez qu&#39;il existe déjà quelques raccourcis pour les fractions et les symboles (comme changer 3/4 en ¾), mais n&#39;hésitez pas à en ajouter quelques-uns. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Cette fonctionnalité n&#39;est disponible que sur le bureau. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Faites-en plus avec Google Docs </h2> <p> Maintenant que vous avez appris ces outils Google Docs, vous pouvez les utiliser lors de la création de votre prochain document. Espérons qu&#39;ils vous facilitent les choses ! </p>"}