{"title":"5 choses qui peuvent vous faire bannir définitivement de Facebook","content":"<p> Facebook n&#39;est pas aussi connu que Twitter pour supprimer des comptes. Cependant, il existe certaines infractions interdites auxquelles Facebook répond par plus qu&#39;une simple étiquette d&#39;avertissement. </p> <p> Ici, nous explorons les termes et conditions de Facebook et où l&#39;entreprise trace la ligne, en examinant des exemples historiques d&#39;utilisateurs que Facebook a &quot;déformés&quot; pour leur comportement. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> La position de Facebook sur les interdictions permanentes </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> Contrairement à d&#39;autres sites de médias sociaux, Facebook ne répertorie pas beaucoup d&#39;infractions entraînant une interdiction permanente. Au lieu de cela, il cite les récidives plutôt que la gravité des infractions comme facteur principal. Par conséquent, en théorie, toute violation de Facebook répétée assez souvent pourrait entraîner un blocage du profil. </p> <p> Cependant, peu d&#39;activités entraînent une interdiction complète et Facebook est étonnamment laxiste avec certaines activités illégales reconnues. Par exemple, la vente de « produits réglementés » comme des armes à feu et de la marijuana n&#39;est pas autorisée sur le marché de Facebook, mais Facebook ne le répertorie pas comme une infraction pouvant être interdite. </p> <p> Facebook préfère signaler ou supprimer du contenu poste par poste plutôt que de supprimer des profils. Cependant, il existe des exceptions. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Utilisation abusive des outils et des données </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> Les conditions d&#39;utilisation de Facebook énoncent trois infractions interdites. Le premier est une collection d&#39;actions, que le reste de cet article examine plus en détail. Les deuxième et troisième sont plus spécifiques et concernent l&#39;utilisation abusive des outils et des données de Facebook. </p> <p> Cette condition d&#39;utilisation commune interdit l&#39;accès et l&#39;utilisation de parties du site censées être réservées aux développeurs. Il interdit également d&#39;utiliser des outils de sites publics d&#39;une manière délibérément malveillante, comme l&#39;utilisation de Facebook pour diffuser des virus et des logiciels malveillants. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Menaces à la sécurité publique </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> L&#39;un des seuls cas dans lesquels Facebook déclare désactiver les comptes est celui du &quot;risque réel de dommages physiques ou de menaces directes pour la sécurité publique&quot;. Facebook supprime également les profils qui « proclament une mission violente ou se livrent à la violence ». </p> <p> C&#39;était la justification de l&#39;interdiction indéfinie du président de l&#39;époque, Donald Trump, après une émeute au Capitole des États-Unis en janvier 2021. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Association avec des groupes violents </h2> <p> Facebook a pris sa position sur les contenus nuisibles et menaçants au niveau associatif en octobre 2020 lorsqu&#39;il a supprimé les profils associés au complot QAnon même si les profils individuels n&#39;avaient aucun contenu violent. Le groupe complot a conduit à des épisodes violents depuis 2016. </p> <p> </p> <p> Facebook a également interdit le groupe musical Trapt pour des publications faisant référence au groupe haineux The Proud Boys. L&#39;organisation politique extrémiste est impliquée dans la violence de rue aux États-Unis et au Canada depuis 2016. </p> <p> La société se réserve également le droit de désactiver des comptes si ces comptes présentent un risque juridique pour Facebook. De plus, Facebook est plus catégorique que les autres plateformes de médias sociaux quant à la collaboration avec les organismes d&#39;application de la loi et de sensibilisation lorsqu&#39;ils rencontrent ce type de contenu. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Compromettre la sécurité d&#39;autres comptes </h2> <p> Une autre des rares infractions interdites sur les listes Facebook est « compromettre la sécurité d&#39;autres comptes et de nos services ». Compromettre la sécurité des services de Facebook ressemble beaucoup aux logiciels malveillants et aux abus mentionnés dans les conditions d&#39;utilisation. Cependant, l&#39;idée de compromettre la sécurité d&#39;autres comptes pointe vers le doxxing. </p> <p> </p> <p> Doxxing est la publication d&#39;informations sensibles du monde réel d&#39;un utilisateur de médias sociaux, y compris potentiellement son adresse personnelle ou professionnelle, son numéro de téléphone privé ou son emplacement physique en temps réel. Cette pratique est souvent pratiquée dans l&#39;intention de causer du tort à cette personne. </p> <p> </p> <h2 id=\"misinformation\"> 5. La désinformation </h2> <p> </p> <p> Les directives officielles de Facebook disent que Facebook ne supprime pas la désinformation, choisissant plutôt de l&#39;étiqueter afin qu&#39;elle puisse contribuer aux dialogues sans induire les autres en erreur. Cependant, un certain nombre de titulaires de comptes suspendus affirment que leur suppression résultait de ce que Facebook appelle des « fausses nouvelles ». </p> <p> Il y a un certain nombre de raisons pour lesquelles cela se produit. Dans certains cas, Facebook détermine que les fausses nouvelles sont également nocives pour la santé personnelle ou publique. </p> <p> C&#39;était <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> L&#39;explication de Facebook pour supprimer le théoricien du complot David Icke </a> pour avoir affirmé, entre autres, que l&#39;Internet 5G cause le Covid-19. Facebook a également déclaré qu&#39;Icke avait &quot;violé à plusieurs reprises&quot; les politiques. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Politiques Facebook et votre compte </h2> <p> Dans la plupart des cas, Facebook ne vous conteste pas tant que vous n&#39;abusez pas de la plate-forme pour nuire à autrui. Cependant, il existe certains problèmes pour lesquels l&#39;entreprise trace une ligne dans le sable. </p> <p> Si vous n&#39;enfreignez pas ces conditions d&#39;utilisation, vous devez rester à l&#39;abri d&#39;une interdiction permanente de Facebook. </p>"}