{"title":"Apple corrige un bug du programme d&#39;installation de macOS Big Sur qui pourrait entraîner une perte de données","content":"<p> Apple a corrigé un bogue critique dans le programme d&#39;installation de macOS Big Sur qui envoyait un message d&#39;erreur lors de la tentative de mise à niveau d&#39;un Mac sans l&#39;espace de stockage requis disponible. </p> <p> Une mise à jour révisée de macOS Big Sur 11.2.1, désormais disponible dans le <a href=\"https://apps.apple.com/app/macos-big-sur/id1526878132?mt=12\" target=\"_blank\" rel=\"nofollow noopener\"> Mac App Store </a> , vérifie correctement si vous avez suffisamment d&#39;espace libre avant le début de l&#39;installation, a déclaré M. Macintosh sur <a href=\"https://twitter.com/ClassicII_MrMac/status/1361428354306633728\" target=\"_blank\" rel=\"nofollow noopener\"> Twitter </a> . </p> <p> macOS Big Sur nécessite 35 gigaoctets d&#39;espace de stockage gratuit sur le disque de démarrage de votre ordinateur, à l&#39;exclusion du programme d&#39;installation de 13 gigaoctets lui-même. </p> <p> Cela n&#39;aurait pas pu arriver plus tôt car l&#39;une des conséquences d&#39;un programme d&#39;installation défectueux est une perte potentielle de données. Pour les personnes qui n&#39;ont pas pris l&#39;habitude de régulièrement <a href=\"https://www.makeuseof.com/how-to-back-up-mac/\" target=\"_blank\" rel=\"nofollow noopener\"> sauvegarder leur Mac avec Time Machine </a> , ce bug assez basique pourrait potentiellement avoir des conséquences terribles. </p> <h2 id=\"how-to-install-the-new-update\"> Comment installer la nouvelle mise à jour </h2> <p> La nouvelle mise à jour est disponible via <strong> Préférences système &gt; Mise à jour logicielle </strong> sur votre Mac. Si des mises à jour sont disponibles, appuyez sur le bouton « Mettre à jour maintenant » pour les installer. Vous serez peut-être invité à saisir votre mot de passe administrateur. </p> <p> Vous ne verrez pas la mise à jour si la version révisée de macOS Big Sur 11.2.1 est déjà installée sur votre ordinateur. Le programme d&#39;installation révisé porte le numéro de build &quot;20D75&quot;. Pour voir le numéro de build du logiciel macOS Big Sur installé sur votre Mac, cliquez sur le menu Pomme et choisissez l&#39;option intitulée « À propos de ce Mac ». </p> <p> </p> <p> Avec la fenêtre À propos de ce Mac ouverte, cliquez sur l&#39;onglet &quot;Aperçu&quot;. Vous verrez le nom du logiciel du système d&#39;exploitation macOS sur votre ordinateur, suivi de son numéro de version. Pour révéler également le numéro de build, cliquez simplement sur le numéro de version. </p> <p> Vous pouvez voir quelle version de macOS est la dernière dans un document d&#39;assistance sur <a href=\"https://support.apple.com/HT201260\" target=\"_blank\" rel=\"nofollow noopener\"> Le site d&#39;Apple </a> . </p> <p> </p> <h2 id=\"big-sur-s-broken-free-space-check\"> Vérification de l&#39;espace libre cassé de Big Sur </h2> <p> Le problème a récemment été révélé grâce à M. Macintosh, qui a initialement signalé le problème. La publication a découvert que la mise à jour de Big Sur se téléchargeait sans problème, mais refusait de démarrer car &quot;Une erreur s&#39;est produite lors de la préparation de la mise à jour du logiciel&quot;. </p> <p> Le problème a été attribué à une erreur dans la vérification de l&#39;espace libre de Big Sur. M. Macintosh dit que les gens se plaignent de cela depuis la sortie de la première version publique de macOS Big Sur en novembre 2020. Après que la publication ait alerté Apple du problème, la société a agi rapidement pour éliminer le méchant bogue. </p> <p> </p> <p> « La mise à niveau démarrera même s&#39;il ne vous reste que 1% d&#39;espace libre et échouera » <a href=\"https://mrmacintosh.com/big-sur-upgrade-not-enough-hd-space-serious-issue-possible-data-loss/\" target=\"_blank\" rel=\"nofollow noopener\"> la poste </a> explique. Et avec le lecteur de démarrage presque plein à 100 %, le programme d&#39;installation se retrouverait bloqué dans une boucle de démarrage sans fin en essayant de terminer la procédure d&#39;installation. </p> <p> &quot;Cela vous empêche d&#39;accéder à vos données&quot;, a averti M. Macintosh. </p> <p> La seule façon de le réparer nécessitait d&#39;effacer et de réinstaller le logiciel macOS. Mais avec la mise à jour révisée désormais disponible dans le Mac App Store, les propriétaires de Mac peuvent vaquer à leurs occupations quotidiennes sans se soucier de savoir si la mise à jour vers Big Sur peut effacer leur disque de démarrage. </p>"}