{"title":"Bite-Sized Brain Food : 5 sites pour apprendre de nouvelles choses de manière courte et amusante","content":"<p> Documentaires de moins d&#39;une minute. Épisodes de podcast de seulement 60 secondes. Infographie animée pour expliquer des sujets complexes. Voici où vous pouvez en apprendre davantage sur le monde dans des capsules rapides de connaissances engageantes. </p> <p> À une époque de courte durée d&#39;attention et de mises à jour de 280 caractères, même l&#39;apprentissage doit se faire à petites doses. C&#39;est pourquoi il existe des créateurs de contenu spécialisés dans la création d&#39;articles informatifs et divertissants qui ne prennent presque pas de temps dans notre vie bien remplie. Des mini-documentaires sur des personnes et des sujets fascinants aux guides de médias sociaux sur des sujets d&#39;actualité, donnez à votre esprit une bouchée de nourriture pour le cerveau à mâcher. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 60 secondes de documents </a> (Web) : profils de personnes et de sujets intéressants en 60 secondes </h2> <p> </p> <p> Vous avez une minute ? 60 Second Docs a une histoire sympa à vous raconter sur une personne intéressante, et à son tour, un sujet sympa. Chaque documentaire ne dure que 60 secondes, mais il couvre les meilleures choses que vous devez savoir sur le sujet. </p> <p> La partie la plus cool est que 60 Second Docs se concentre sur des profils de personnes réelles, plutôt que sur des concepts ou des tendances. Habituellement, cette personne fait quelque chose d&#39;unique, que ce soit pour lancer une nouvelle tendance, explorer un nouveau sujet ou repousser les limites d&#39;une manière ou d&#39;une autre. En parlant de la personne, non seulement vous obtenez un meilleur aperçu de l&#39;aspect humain du sujet unique, mais cela vous semble également plus réel et émotionnel. </p> <p> Tous les 60 Second Docs sont disponibles sur leur chaîne YouTube ou sur leurs réseaux sociaux. C&#39;est une bonne idée de les suivre sur n&#39;importe quel réseau social que vous fréquentez, en regardant chaque nouvelle vidéo dans son intégralité chaque fois qu&#39;ils publient une mise à jour. </p> <p> Si vous aimez les documentaires plus longs, cochez la case <strong> Sélection officielle </strong> sur le site Web de 60 Second Docs. Ici, les éditeurs choisissent des documentaires de 10 à 20 minutes que d&#39;autres ont tournés, sur des sujets qu&#39;ils pensent que vous devriez regarder. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Alors vous voulez parler de </a> (Instagram) : Mini-guides sur des sujets politiques et sociaux </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> Qui savait que dans un monde de selfies d&#39;influenceurs et de hashtags promus par la marque, Instagram fournirait une plate-forme pour éduquer ? So You Want To Talk About (Sywtta) utilise les formats de publication à images multiples d&#39;Instagram pour créer des mini-guides sur des sujets politiques et sociaux. </p> <p> Les sujets choisis par Sywtta traitent généralement de sujets d&#39;actualité tels que l&#39;annulation des prêts étudiants, les droits et l&#39;histoire des Noirs, les erreurs logiques, les vaccins COVID-19 et bien plus encore. Chaque diapositive utilise une typographie magnifiquement formatée pour vous renseigner sur le sujet, et de plus, chaque diapositive est comme une mini-leçon en soi. Chaque guide devient un cours accéléré rapide et informatif, sans être trop chargé en données. </p> <p> À un moment où vous devez être vigilant sur <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> fausses nouvelles ou fausses nouvelles </a> , il est également important de noter les philosophies de ce que vous lisez. Lorsqu&#39;il s&#39;agit de politique, Sywtta propage les points de vue des politiques progressistes et de gauche. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> Sciences 60 secondes </a> (Podcast) : brèves explications audio sur la science, la santé et la technologie </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Si vous préférez écouter vos informations plutôt que de lire ou de regarder, consultez le podcast 60-Second Science. Réalisé par l&#39;équipe de Scientific American, ce podcast quotidien aborde des sujets scientifiques, médicaux et technologiques, et explique un sujet en une courte rafale. Bien qu&#39;il ne se limite plus à la durée d&#39;une minute, chaque épisode dure toujours moins de cinq minutes. </p> <p> Chaque podcast a des hôtes différents de l&#39;équipe Scientific American, couvrant des sujets tels que COVID, animaux et oiseaux, ADN et médecine, sciences de l&#39;environnement, etc. Ils apprécient les valeurs de production élevées, incorporant des sons du monde réel sur le point de discussion et ajoutant souvent des clips vocaux d&#39;experts. </p> <p> Pour parcourir les archives des épisodes passés, rendez-vous sur le site officiel de 60-Second Science. Ici, vous pouvez filtrer les épisodes par sujet (santé, esprit, durabilité, technologie, sciences). Si vous ne voulez pas d&#39;informations sous forme de courtes rafales, essayez le podcast complet Science Talk. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Animographies </a> (Web) : infographies animées de haute qualité pour expliquer les choses </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> Comment fonctionne la crypto-monnaie ? Quels sont les tenants et aboutissants de l&#39;assurance automobile ? Comment faire un moonwalk ? Le concepteur et animateur Jacob O&#39;Neal décompose des sujets complexes en explications simples et dessine des infographies animées de haute qualité pour les illustrer. </p> <p> Animagraffs est une collection de courtes explications à travers des guides visuels, utilisant des GIF animés. Jacob utilise une variété de techniques de conception, comme des vues en coupe pour illustrer chaque partie d&#39;un instrument, ou de grandes images avec des parties mobiles où vous pouvez zoomer et dézoomer comme Google Maps. Chaque style convient au sujet que vous étudiez. </p> <p> Les sujets sont également très variés, notamment comment court un guépard, comment fonctionnent les voitures électriques, comment un haut-parleur émet du son, etc. Vous devriez également consulter la section « Travail client », où Jacob présente des missions rémunérées pour les marques. Ne vous inquiétez pas, même si ce sont des publicités, elles sont néanmoins informatives et amusantes. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Grande grande histoire </a> (YouTube): De vrais documentaires fascinants et intéressants </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story a clôturé ses opérations fin 2020, mais pas avant de laisser cinq ans de délicieux courts documentaires. Plongez dans les archives pour trouver des vidéos d&#39;environ 5 minutes sur une gamme de sujets intéressants et des personnes fascinantes du monde entier. </p> <p> D&#39;un film diffusé dans un théâtre indien pendant 24 ans à l&#39;incroyable glace turque qui ne fond pas, chaque courte vidéo est un regard de haute qualité et bien documenté sur le sujet. Contrairement à la plupart des autres vidéos de ce type, les créateurs de vidéos de Great Big Story parcourent souvent le monde pour se mettre au milieu de l&#39;histoire. Triez par les plus populaires ou utilisez les différentes listes de lecture personnalisées recommandées par les créateurs. </p> <p> Sur la chaîne, vous trouverez également des vidéos plus longues, d&#39;environ 10 à 15 minutes. Ce sont généralement des listes et des compilations, qui incluent quelques extraits des vidéos les plus courtes. Si vous avez le temps d&#39;en savoir plus sur le monde qui nous entoure, vous ne pouvez pas vous tromper avec ces derniers. Même après avoir baissé ses volets, Great Big Story est l&#39;un des plus <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> des chaînes fascinantes et éducatives sur YouTube </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Utilisez l&#39;apprentissage au goutte à goutte pour conquérir de grands sujets </h2> <p> Ces sites Web et podcasts visent à transformer chaque nouveau sujet en un ensemble d&#39;informations compact et divertissant. C&#39;est une belle façon d&#39;apprendre de nouvelles choses en petites bouchées. Mais vous pouvez également appliquer la même philosophie à l&#39;apprentissage de sujets plus complexes et plus vastes. </p> <p> De plus en plus, l&#39;apprentissage au goutte à goutte ou le micro-apprentissage est un moyen populaire d&#39;obtenir une éducation. En recevant <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> des petits cours tous les jours </a> , vous pouvez aborder des sujets tels que la programmation, la conception, le développement d&#39;applications, la gestion de produits, etc. Une recherche rapide sur le Web devrait vous aider à trouver une version d&#39;apprentissage au goutte à goutte de tout ce que vous cherchez à vous instruire. </p>"}