{"title":"BitPay apporte Bitcoin à Apple Pay","content":"<p> Les utilisateurs de BitPay aux États-Unis peuvent désormais ajouter leurs cartes bitcoin prépayées à l&#39;application Wallet d&#39;Apple et <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> utilisez-le pour payer des choses avec Apple Pay </a> . Les clients non Apple pourront bientôt ajouter leurs cartes BitPay de marque MasterCard à Google Pay et Samsung Pay. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> Comment ajouter votre carte BitPay à Apple Wallet </h2> <p> Pour ajouter votre carte BitPay à un appareil Apple, ouvrez l&#39;application Wallet sur votre iPhone et appuyez sur &quot;+&quot; dans le coin supérieur droit, puis suivez les instructions à l&#39;écran pour terminer l&#39;ajout de la carte. </p> <p> Avec votre BitPay dans l&#39;application Wallet, vous pouvez ajouter la carte à Apple Pay en accédant à <strong> Paramètres &gt; Portefeuille et Apple Pay </strong> , puis appuyez sur l&#39;option intitulée « Ajouter une carte ». Pour devenir un utilisateur BitPay et commander votre carte prépayée, téléchargez l&#39;application BitPay Wallet depuis le <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> Magasin d&#39;applications </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Une nouvelle façon de dépenser avec Apple Pay </h2> <p> Un article sur le <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> Blogue BitPay </a> dit que l&#39;ajout d&#39;une carte BitPay à Apple Pay est un moyen pratique de dépenser des crypto-monnaies dans plus d&#39;endroits qu&#39;auparavant. &quot;Nous avons des milliers de clients de l&#39;application BitPay Wallet utilisant la carte BitPay qui sont toujours à la recherche de nouveaux endroits et de nouveaux moyens de dépenser leur crypto&quot;, a déclaré Stephen Pair, PDG de BitPay, dans un <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> communiqué de presse </a> . </p> <p> </p> <p> Avec Apple Pay, les détenteurs de cartes BitPay peuvent effectuer des achats sans contact sécurisés dans les magasins physiques, les applications prenant en charge Apple Pay et sur le Web. La société note que les clients qui attendent la livraison d&#39;une carte en plastique peuvent ajouter son équivalent virtuel à Apple Wallet via l&#39;application officielle BitPay Wallet. Cela vous permettra de commencer à dépenser immédiatement. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> Qu&#39;est-ce que la carte BitPay ? </h2> <p> Carte prépayée utilisant le réseau Mastercard, la carte BitPay permet d&#39;effectuer facilement des paiements sans contact et des paiements par code PIN, ainsi que de retirer de l&#39;argent dans n&#39;importe quel guichet automatique compatible. Avec l&#39;application, les clients peuvent faire des choses comme consulter leur solde, demander un nouveau code PIN, recharger instantanément, ainsi que convertir la crypto-monnaie en monnaie fiduciaire (qui est ensuite chargée sur la carte, prête à être dépensée partout où le débit Mastercard est accepté dans le monde). </p> <blockquote> <p> Pour les utilisateurs de blockchain puissants, l&#39;application BitPay Wallet prend en charge un éventail d&#39;options pour acheter et stocker des cryptos et effectuer des paiements en ligne. Les utilisateurs peuvent acheter instantanément des cartes-cadeaux auprès de centaines de grands détaillants en magasin et en ligne. </p> </blockquote> <p> La carte est dotée d&#39;une puce EMV et peut être verrouillée en cas d&#39;urgence avec l&#39;application. </p> <p> Selon la société, la prise en charge de Google Pay et de Samsung Pay est prévue &quot;plus tard ce trimestre&quot;. Quant à l&#39;application BitPay, elle prend actuellement en charge Bitcoin, Bitcoin Cash et Ether, ainsi que quatre monnaies stables liées au dollar, USDC, GUSD, PAX et BUSD. </p>"}