{"title":"Comment réparer le BSOD VIDEO_TDR_FAILURE dans Windows 10","content":"<p> L&#39;erreur VIDEO_TDR_FAILURE signifie que votre carte graphique est défectueuse ou que les pilotes d&#39;affichage sont peut-être obsolètes ou défectueux. Mais il peut y avoir d&#39;autres raisons, telles que la surchauffe des composants ou des fichiers système corrompus. TDR est l&#39;abréviation de <strong> Délai d&#39;expiration, détection et récupération </strong> , une méthode utilisée par Windows pour identifier et réparer les composants logiciels défectueux. </p> <p> Si vous rencontrez cette erreur, n&#39;ayez crainte, car les méthodes suivantes corrigeront l&#39;erreur VIDEO_TDR_FAILURE plus rapidement que prévu. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Mettre à jour et réinstaller les pilotes d&#39;affichage </h2> <p> Comme mentionné ci-dessus, l&#39;erreur est généralement le résultat de pilotes d&#39;affichage défectueux ou obsolètes. Ainsi, vous devez mettre à jour les pilotes de votre carte graphique. Si cela ne résout pas le problème, réinstallez-les. Selon votre carte graphique, vous pouvez rencontrer différents noms de fichiers relatifs à l&#39;erreur. </p> <ol> <li> Pour les utilisateurs de Nvidia, c&#39;est <strong> nvlddmkm.sys </strong> . Si vous êtes un utilisateur Nvidia, voici <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 façons simples de corriger l&#39;erreur. </a> </li> <li> Pour les utilisateurs d&#39;AMD, l&#39;erreur apparaît comme <strong> atikmpag.sys </strong> . </li> <li> Pour les utilisateurs d&#39;Intel HD, l&#39;erreur est <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> Comment mettre à jour les pilotes d&#39;affichage </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> presse <strong> Touche Windows + R </strong> pour ouvrir la commande Exécuter. Tapez <strong> devmgmt.msc </strong> et appuyez sur Entrée. </li> <li> Dans le <strong> Gestionnaire de périphériques </strong> fenêtre, accédez à <strong> Prises d&#39;écran </strong> et l&#39;étendre. </li> <li> Cliquez avec le bouton droit sur votre carte graphique, puis sélectionnez <strong> Mettre à jour le pilote </strong> . </li> <li> Sélectionner <strong> Rechercher automatiquement le logiciel pilote mis à jour </strong> . </li> <li> Windows recherchera automatiquement sur le Web et téléchargera les pilotes requis. Assurez-vous d&#39;avoir une connexion Internet active pendant cette opération. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> Comment réinstaller les pilotes d&#39;affichage </h3> <p> Si le BSOD d&#39;échec du tdr vidéo persiste après la mise à jour des pilotes d&#39;affichage, il est préférable de réinstaller ces pilotes. Il est conseillé de le faire pendant que Windows est démarré en mode sans échec. Mais avant de faire cela, vous devez vous rendre sur le site Web du fabricant de votre carte graphique et télécharger la dernière version des pilotes graphiques. </p> <p> Les fabrications les plus courantes sont <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> DMLA </a> , et <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intelligence </a> . </p> <p> Pour démarrer en mode sans échec, procédez comme suit : </p> <ol> <li> presse <strong> Touche Windows + R, </strong> et dans la boîte de dialogue Exécuter, tapez <strong> msconfig, </strong> et appuyez sur Entrée. </li> <li> Dans le <strong> Configuration du système </strong> fenêtre, cliquez sur le <strong> Botte </strong> languette. </li> <li> Cochez maintenant la <strong> Mode sans échec </strong> case à cocher située vers le bas. </li> <li> Appliquez les paramètres et redémarrez votre ordinateur. </li> </ol> <p> Après avoir démarré en mode sans échec, il est temps de réinstaller les pilotes d&#39;affichage. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> Dans la barre de recherche du menu Démarrer, tapez <strong> Gestionnaire de périphériques </strong> et ouvrez-le. </li> <li> Chercher <strong> Prises d&#39;écran </strong> et développez le menu. </li> <li> Faites un clic droit sur votre GPU et cliquez sur <strong> Désinstaller l&#39;appareil </strong> . </li> <li> Dans l&#39;assistant de désinstallation, assurez-vous de vérifier le <strong> Supprimer le logiciel pilote pour cet appareil </strong> boîte. </li> <li> Attendez que Windows désinstalle l&#39;appareil et redémarre votre ordinateur. </li> <li> Maintenant, réinstallez les pilotes graphiques que vous avez téléchargés précédemment. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Utilisez SFC pour analyser et réparer les fichiers système </h2> <p> SFC est un utilitaire Windows intégré qui peut être utilisé pour analyser et réparer les fichiers système corrompus. Dans le cas d&#39;un BSOD, il est fort probable que certains fichiers système soient corrompus, il est donc impératif d&#39;exécuter cet utilitaire. Ce n&#39;est qu&#39;un des <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> plusieurs utilitaires utiles disponibles </a> à la disposition d&#39;un utilisateur Windows. </p> <p> Pour exécuter SFC, suivez simplement ces étapes : </p> <ol> <li> Dans la barre de recherche du menu Démarrer, tapez <strong> cmd </strong> . </li> <li> Faites un clic droit sur <strong> Invite de commandes </strong> et sélectionnez <strong> Exécuter en tant qu&#39;administrateur </strong> . </li> <li> Dans la console, tapez <strong> sfc/scannow </strong> et appuyez sur Entrée. </li> <li> Une fois le processus d&#39;analyse et de réparation terminé, redémarrez votre ordinateur. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Exécutez la réparation de démarrage </h2> <p> Pour les utilisateurs qui obtiennent l&#39;erreur dès qu&#39;ils démarrent Windows 10 ou peu de temps après la connexion, la réparation de démarrage est une aubaine. Cette fonctionnalité Windows recherche les anomalies au démarrage et les corrige immédiatement. </p> <p> Étant donné que cette section est destinée aux utilisateurs dont les ordinateurs ont été rendus inutilisables en raison de l&#39;erreur, c&#39;est-à-dire qu&#39;ils ne peuvent pas ouvrir <strong> Paramètres </strong> , ils devront redémarrer durement pour entrer dans l&#39;environnement de récupération Windows (winRE). </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Suivez ces étapes pour démarrer dans l&#39;environnement de récupération Windows : </p> <ol> <li> Appuyez sur le bouton d&#39;alimentation et maintenez-le enfoncé jusqu&#39;à ce que votre PC s&#39;éteigne. </li> <li> Appuyez à nouveau sur le bouton d&#39;alimentation pour démarrer votre PC. </li> <li> Répétez les première et deuxième étapes jusqu&#39;à ce que le PC démarre en mode de récupération. Ce sera un écran bleu. </li> <li> Sur l&#39;écran de récupération, cliquez sur <strong> Voir les options de réparation avancées </strong> . </li> <li> Sur l&#39;écran suivant, cliquez sur <strong> Dépannage </strong> </li> <li> Cliquer sur <strong> Options avancées </strong> </li> <li> Cliquer sur <strong> Réparation de démarrage </strong> et entrez vos informations d&#39;identification lorsque vous y êtes invité. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Modifiez vos paramètres de gestion de l&#39;alimentation </h2> <p> Les paramètres de gestion de l&#39;alimentation de Windows sont généralement bien optimisés, mais ils peuvent parfois interférer avec la façon dont votre ordinateur gère les graphiques. Cela est particulièrement vrai lorsque l&#39;ordinateur dispose d&#39;un GPU discret. Les paramètres optimaux pour éviter d&#39;obtenir le BSOD VIDEO_TDR_FAILURE sont donnés ci-dessous : </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> Dans la barre de recherche du menu Démarrer, tapez <strong> Panneau de commande </strong> et ouvrez-le. </li> <li> Dans la barre de recherche du Panneau de configuration, entrez &quot;options d&#39;alimentation&quot; et appuyez sur Entrée. </li> <li> Cliquer sur <strong> Options d&#39;alimentation, </strong> et à côté du plan d&#39;alimentation que vous utilisez, cliquez sur <strong> Modifier les paramètres du forfait. </strong> </li> <li> Cliquer sur <strong> Modifiez les paramètres d&#39;alimentation avancés. </strong> </li> <li> Chercher <strong> PCI E </strong><strong> xpress </strong> et l&#39;étendre. </li> <li> Tourne le <strong> Gestion de l&#39;alimentation de l&#39;état du lien </strong> réglage sur <strong> Désactivé </strong> . </li> <li> Enregistrez les modifications et redémarrez votre ordinateur. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Nettoyez votre ordinateur </h2> <p> La surchauffe n&#39;est jamais une bonne chose, et généralement, la raison en est l&#39;accumulation de poussière. Il est recommandé aux utilisateurs de nettoyer tous les mois les composants de leur PC de toute poussière. Mais fais attention. Il faut le faire doucement. </p> <p> Assurez-vous de nettoyer le dessus de votre carte graphique, du ventilateur du processeur, du bloc d&#39;alimentation et des ventilateurs de l&#39;armoire. Dans l&#39;ensemble, assurez-vous d&#39;éviter <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> des erreurs de maintenance qui pourraient endommager les composants coûteux. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Vérifiez les composants matériels </h2> <p> Si l&#39;erreur persiste après avoir essayé tout ce qui est indiqué ci-dessus, il se peut qu&#39;il y ait un défaut dans le matériel lui-même. Les utilisateurs qui ont une carte graphique dédiée doivent la retirer et démarrer l&#39;ordinateur. Si l&#39;erreur est résolue, il s&#39;agit d&#39;un défaut matériel dans le GPU lui-même. Vous pouvez essayer de contacter le fabricant et essayer de faire remplacer votre appareil. </p> <p> </p> <p> Lorsque vous utilisez des graphiques intégrés, essayez de les désactiver et de démarrer. Pour les désactiver, procédez comme suit : </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> presse <strong> Touche Windows +R, </strong> taper <strong> devmgmt.msc </strong> dans la zone de texte Exécuter et appuyez sur Entrée. </li> <li> Dans <strong> Gestionnaire de périphériques </strong> , chercher <strong> Prises d&#39;écran </strong> et développez le menu. </li> <li> Faites un clic droit sur votre GPU intégré et cliquez sur <strong> Désactiver l&#39;appareil </strong> . </li> <li> Redémarrez l&#39;ordinateur et vérifiez si l&#39;erreur est résolue. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> Erreur &quot;Échec du TDR vidéo&quot; résolue avec succès </h2> <p> Pour la plupart des utilisateurs, une simple mise à jour ou réinstallation de leurs pilotes d&#39;affichage résoudra le problème. Mais si le problème s&#39;aggrave, vous devrez peut-être réinitialiser votre PC ou remplacer du matériel. </p>"}