{"title":"Canon lance une application d&#39;élimination de photos qui trouve vos meilleurs clichés","content":"<p> Derrière presque chaque photo parfaite se trouve une pellicule pleine d&#39;autres photos qui lui ressemblent presque exactement. Il n&#39;est pas rare que les photographes maintiennent presque toujours leur déclencheur enfoncé, de peur de rater un moment fugace. </p> <p> Passer en revue des dizaines, voire des centaines de photos pour choisir vos favoris et libérer de l&#39;espace de stockage peut être un processus long et ennuyeux. Heureusement, Canon a publié une nouvelle application qui le fait automatiquement pour vous. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> Prenez facilement un rouleau de photos jusqu&#39;aux meilleurs </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon États-Unis </a> a lancé une application d&#39;élimination de photos sur le <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> Magasin d&#39;applications </a> qui vous permet de trouver rapidement et facilement vos meilleures photos. L&#39;application elle-même est gratuite, mais pour l&#39;utiliser, vous devrez vous abonner à 14,99 $/an ou 2,99 $/mois. Les deux options d&#39;abonnement ont une période d&#39;essai de trois jours. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> Le vice-président exécutif de Canon USA, Tatsuro &quot;Tony&quot; Kano, explique : </p> <blockquote> <p> Dans le monde d&#39;aujourd&#39;hui en constante évolution et accablant, où des milliers de photos sont capturées et stockées dans le smartphone d&#39;une personne, les consommateurs ont besoin d&#39;un outil photo expert, fiable et intuitif pour les aider à choisir les meilleures photos sur la base d&#39;années de connaissances et de technologies fiables. </p> </blockquote> <p> L&#39;application Canon, simplement nommée Photo Culling, fonctionne sur une IA appelée Photography Intelligence Learning ou PHIL en abrégé. PHIL suggère les photos que vous devez conserver et celles que vous devez supprimer en fonction de l&#39;une des deux options de sélection de photos que vous sélectionnez. </p> <p> La première option, <strong> Abattage entier </strong> , est idéal pour <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> meilleure photographie de portrait </a> . Lorsque cette option est sélectionnée, PHIL déterminera vos meilleures photos en les notant en fonction de quatre facteurs : la netteté, le bruit, les émotions et si les yeux de votre sujet sont fermés (le cas échéant). </p> <p> Pendant ce temps, le <strong> Abattage similaire </strong> L&#39;option choisit vos meilleurs clichés en comparant les scores entre des photos similaires. Par exemple, disons que vous avez pris un tas de photos des nuages, puis un tas de photos de quelques fleurs. L&#39;application séparerait les photos de nuages ​​et les photos de fleurs en groupes distincts. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Quelle que soit l&#39;option d&#39;élimination que vous choisissez, si le score d&#39;une photo dépasse le score cible que vous avez défini, la photo est considérée comme un gardien. PHIL proposera alors de supprimer les photos restantes qui n&#39;ont pas obtenu un score suffisamment élevé. Dans le cas où vous n&#39;êtes pas d&#39;accord avec PHIL, ne vous inquiétez pas. Vous avez toujours un contrôle total sur tous vos coups. </p> <p> </p> <p> Les autres fonctionnalités de l&#39;application incluent le nombre de photos et les informations d&#39;affichage de l&#39;espace de stockage, les albums photo, les paramètres des partitions photo et la possibilité d&#39;utiliser le mode sombre. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> Allez-vous télécharger l&#39;application Photo Culling de Canon ? </h2> <p> Il semblerait que l&#39;application de sélection de photos de Canon ait tout ce dont vous avez besoin pour rendre le processus de sélection de vos meilleures photos moins fastidieux. Cependant, en fin de compte, c&#39;est à vous de décider si vous détestez suffisamment l&#39;élimination des photos pour justifier de payer pour quelque chose que vous pourriez faire vous-même (bien que probablement très lentement et ennuyé). </p> <p> Au moment de la rédaction de cet article, l&#39;application n&#39;est pas disponible pour Android, mais Canon l&#39;a peut-être dans les cartes pour l&#39;avenir. </p>"}