{"title":"Comment réparer le code d&#39;arrêt BSOD &quot;SYSTEM THREAD EXCEPTION NOT HANDLED&quot; dans Windows 10","content":"<p> L&#39;&quot;EXCEPTION DE FILETAGE SYSTÈME NON GÉRÉE&quot; est une erreur courante de Windows 10 qui se produit principalement en raison d&#39;un pilote obsolète ou incompatible. </p> <p> Ce qui le rend plus difficile à réparer que les autres BSOD, c&#39;est que plusieurs pilotes peuvent être à l&#39;origine du problème et que parfois votre ordinateur ne les détecte pas tous. C&#39;est pourquoi la première étape que les utilisateurs doivent prendre lorsqu&#39;ils s&#39;attaquent à cette erreur est de trouver le pilote exact à l&#39;origine du problème. </p> <p> Voici comment corriger l&#39;erreur d&#39;exception de thread système non gérée sous Windows 10. </p> <h2 id=\"boot-into-safe-mode\"> 1. Démarrez en mode sans échec </h2> <p> La première étape que les utilisateurs doivent suivre avant de tenter de résoudre ce problème consiste à démarrer leur ordinateur en mode sans échec. Selon vos préférences et si vous êtes en mesure de démarrer votre ordinateur dans l&#39;écran de connexion, il existe plusieurs façons de procéder : </p> <h3 id=\"boot-into-safe-mode-via-settings\"> Démarrez en mode sans échec via les paramètres </h3> <ol> <li> Clique sur le <strong> Démarrer </strong> bouton, puis sélectionnez <strong> Paramètres </strong> . </li> <li> Aller vers <strong> Mise à jour et sécurité </strong> puis cliquez sur <strong> Récupération </strong> . </li> <li> En dessous de <strong> Démarrage avancé, </strong> cliquer sur <strong> Redémarrer maintenant. </strong> </li> <li> Lorsque votre PC redémarre le <strong> Choisis une option </strong> l&#39;écran devrait apparaître. </li> <li> De là, allez à <strong> Dépannage &gt; Options avancées &gt; Paramètres de démarrage </strong> . Cliquez ensuite sur <strong> Redémarrer </strong> </li> <li> Lorsque votre PC redémarre, appuyez sur <strong> F5 </strong> pour démarrer votre ordinateur dans <strong> Mode sans échec avec réseau </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> Depuis l&#39;écran de connexion </h3> <ol> <li> Maintenez simplement enfoncé <strong> Changement </strong> et sélectionnez le <strong> Pouvoir </strong> bouton suivi de <strong> Redémarrer </strong> . </li> <li> Suivez les étapes 4, 5 et 6 de la section ci-dessus. </li> </ol> <h3 id=\"from-a-blank-screen\"> À partir d&#39;un écran vide </h3> <ol> <li> Si vous ne parvenez pas à accéder à l&#39;écran de connexion, procédez comme suit. </li> <li> Maintenez enfoncé le bouton d&#39;alimentation de votre appareil pendant 10 secondes pour l&#39;éteindre. </li> <li> Appuyez à nouveau sur le bouton d&#39;alimentation pour le démarrer. </li> <li> Dès que votre PC démarre, c&#39;est-à-dire que le logo du fabricant apparaît, appuyez à nouveau sur le bouton d&#39;alimentation pendant 10 secondes. </li> <li> Appuyez sur le bouton d&#39;alimentation pour démarrer votre appareil. </li> <li> Si cela est fait correctement, votre ordinateur démarrera dans le <strong> Environnement de récupération Windows </strong> . </li> <li> Suivez les étapes 4, 5 et 6 de la première section. </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. Trouver quel conducteur est responsable </h2> <p> Étant donné que l&#39;erreur est probablement causée par un pilote défectueux, vous pouvez utiliser le journal Windows pour savoir lequel. </p> <p> Pour ce faire, suivez simplement ces étapes : </p> <ol> <li> presse <strong> Touche Windows + R </strong> et dans le <strong> Cours </strong> boîte de dialogue, tapez <strong> eventvwr. </strong> </li> <li> Naviguez vers le <strong> Journaux Windows </strong> menu et développez-le, puis sélectionnez <strong> Système. </strong> </li> <li> Recherchez un journal nommé <strong> system_thread_exception_not_handled </strong> et cliquez dessus pour savoir quel pilote est à l&#39;origine du problème. </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> Habituellement, le pilote associé sera un pilote d&#39;affichage ou un pilote réseau, car ils sont connus pour être à l&#39;origine de ce BSOD. Si le fichier associé est <strong> nvlddmkm.sys </strong> , vous pouvez consulter <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> quelques moyens faciles de le réparer. </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. Restauration ou mise à jour des pilotes </h2> <p> Selon le pilote responsable de l&#39;erreur d&#39;exception de thread système non gérée, vous devrez peut-être mettre à jour ou réinstaller les pilotes associés. </p> <p> Si le pilote n&#39;a pas été mis à jour depuis longtemps, la mise à jour du pilote résoudra probablement le problème. Si le pilote a été mis à jour récemment, il peut être préférable de restaurer le pilote ou de réinstaller les mises à jour. </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> Comment mettre à jour les pilotes sur Windows 10 </h3> <ol> <li> presse <strong> Touche Windows + R </strong> et tapez <strong> devmgmt.msc </strong> pour ouvrir le <strong> Gestionnaire de périphériques </strong> . </li> <li> Accédez à l&#39;appareil associé et développez le menu. Par exemple, si l&#39;erreur était causée par un pilote d&#39;affichage, vous devrez développer le <strong> Prises d&#39;écran </strong> option. </li> <li> Faites un clic droit sur le pilote et cliquez sur <strong> Mettre à jour le pilote </strong> . </li> <li> Dans la boîte de dialogue qui s&#39;ouvre, cliquez sur <strong> Rechercher automatiquement le logiciel pilote mis à jour </strong> . </li> <li> Windows recherchera alors automatiquement sur le Web les derniers pilotes et les installera. </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> Comment restaurer les pilotes sous Windows 10 </h3> <ol> <li> Ouvert <strong> Gestionnaire de périphériques </strong> et accédez au pilote en question. </li> <li> Développez le menu et faites un clic droit sur le pilote. </li> <li> Cliquer sur <strong> Propriétés </strong> . </li> <li> Sous le <strong> Conducteur </strong> onglet, cliquez sur <strong> Faire reculer le pilote </strong> . </li> <li> Windows reviendra automatiquement à la dernière version disponible du pilote. </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. Renommez le fichier défectueux </h2> <p> Lors de la récupération du nom de fichier associé à l&#39;erreur d&#39;exception de thread système non gérée, les utilisateurs doivent renommer le fichier. Cela obligera Windows à créer une nouvelle copie et à la réinstaller. Les fichiers du pilote se trouvent à <strong> Pilotes C:\\ Windows\\ System32\\ </strong> </p> <p> Suivez ces étapes pour renommer le fichier : </p> <ol> <li> Ouvert <strong> Explorateur de fichiers </strong> et allez à <strong> C:\\Windows\\System32\\drivers </strong> </li> <li> Recherchez le pilote concerné </li> <li> Cliquez dessus et appuyez sur <strong> F2. </strong> </li> <li> Remplacez l&#39;extension du nom de fichier par <strong> .vieille </strong> . </li> <li> Appuyez sur Entrée et redémarrez votre ordinateur. </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. Utilisez SFC et DISM pour réparer les fichiers système </h2> <p> SFC et DISM sont deux outils puissants disponibles à la disposition de chaque utilisateur Windows. En combinaison, ils peuvent trouver et corriger presque toutes les erreurs liées au système. Ils sont également assez simples à exécuter. </p> <p> </p> <p> Assurez-vous de créer un point de restauration système car ces commandes modifient les fichiers système. </p> <h3 id=\"how-to-use-dism\"> Comment utiliser DISM </h3> <ol> <li> Cours <strong> Invite de commandes </strong> en tant qu&#39;administrateur </li> <li> Dans la console, tapez <strong> DISM /En ligne /Cleanup-Image /ScanHealth </strong> et appuyez sur Entrée. </li> <li> Attendez que Windows ait terminé la numérisation. Tapez ensuite <strong> DISM /En ligne /Cleanup-image /RestoreHealth </strong> </li> <li> Windows réparera tous les problèmes détectés lors de l&#39;analyse. </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> Comment utiliser SFC </h3> <ol> <li> Dans la barre de recherche du menu Démarrer, tapez <strong> cmd </strong> puis clic droit sur <strong> Invite de commandes </strong> et lancez-le en tant qu&#39;administrateur. </li> <li> Dans la console, entrez <strong> sfc/scannow </strong> </li> <li> Soyez patient car Windows prendra du temps pour analyser et remplacer les fichiers système corrompus. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. Utilisez la restauration du système pour restaurer votre PC </h2> <p> Si le problème n&#39;est toujours pas résolu, vous devrez utiliser la restauration du système en dernier recours. La restauration du système est une fonctionnalité qui restaure Windows à un état antérieur. Ces points de restauration sont créés périodiquement et lors de l&#39;installation de nouveaux logiciels. Alternativement, vous pouvez définir <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows pour créer un point de restauration quotidiennement </a> </p> <h3 id=\"how-to-use-system-restore\"> Comment utiliser la restauration du système </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> Dans la barre de recherche du menu Démarrer, tapez <strong> Panneau de commande </strong> et cliquez sur l&#39;ouvrir. </li> <li> Dans la barre de recherche du Panneau de configuration, entrez <strong> Récupération </strong> et ouvrez-le à partir des résultats. </li> <li> Cliquer sur <strong> Ouvrir la restauration du système </strong> . </li> <li> Cliquer sur <strong> Suivant </strong> et sélectionnez un point de restauration dans la liste. </li> <li> Cliquer sur <strong> Finir. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> Exception gérée </h2> <p> Les astuces répertoriées ci-dessus fournissent une solution simple aux nuisances causées par les BSOD tels que system_thread_exception_not_handled. La meilleure partie est que la plupart des conseils peuvent également être utilisés pour diagnostiquer de nombreuses autres erreurs courantes d&#39;écran bleu de la mort (BSOD) dans Windows. </p>"}