{"title":"Comment envoyer et recevoir des messages texte sur votre iPad","content":"<p> Êtes-vous fatigué de devoir garder votre iPhone à vos côtés pour vous assurer de ne manquer aucun SMS important ? Heureusement, il existe un moyen simple de configurer votre iPad pour envoyer et recevoir des messages texte à la place. </p> <p> En utilisant iCloud, Apple offre une option simple pour synchroniser vos textes de votre iPhone vers votre iPad, vous permettant d&#39;envoyer et de recevoir des messages depuis l&#39;un ou l&#39;autre appareil. Les étapes suivantes vous permettront de le faire en un rien de temps. </p> <h2 id=\"before-you-begin\"> Avant que tu commences </h2> <p> Vous devez vous assurer que vous avez accès à vos deux appareils, car vous devrez ajuster les paramètres pour <a href=\"https://www.makeuseof.com/tag/how-to-sync-iphone-and-ipad/\" target=\"_blank\" rel=\"nofollow noopener\"> synchronisez votre iPhone et iPad ensemble </a> . </p> <p> De plus, votre iPhone devra être allumé et connecté au Wi-Fi ou à un réseau cellulaire. En effet, les textes que vous envoyez depuis votre iPad seront acheminés via l&#39;iPhone. </p> <p> Vous devez également vous assurer que vous êtes connecté à iMessage avec le même identifiant Apple sur les deux appareils. Faites-le avec les étapes suivantes : </p> <ol> <li> Ouvrez le <strong> Paramètres </strong> application. </li> <li> Robinet <strong> Connectez-vous à votre [Appareil] </strong> . </li> <li> Saisissez votre nom d&#39;utilisateur et votre mot de passe Apple ID. </li> <li> Si vous y êtes invité, entrez le <strong> code de vérification à six chiffres </strong> envoyé à votre appareil ou numéro de téléphone de confiance et connectez-vous. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (3 images) </strong> <img alt=\"Opening Settings on iPhone\" src=\"images/settings-icon-1-698.jpg\" loading=\"lazy\"> Développer <img alt=\"Signing into iCloud Account on iPhone\" src=\"images/sign-into-icloud-account-1-448.jpg\" loading=\"lazy\"> Développer <img alt=\"Apple ID Verification Code\" src=\"images/icloud-verification-code-400.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> Maintenant que vous avez vos appareils et que vous êtes connecté avec le même identifiant Apple, vous êtes prêt à commencer. </p> <p> </p> <p> </p> <h2 id=\"step-1-set-up-your-iphone\"> Étape 1. Configurez votre iPhone </h2> <p> Vous devez d&#39;abord vous assurer que votre iPhone est configuré pour permettre le transfert de messages. Voici comment: </p> <ol> <li> Ouvert <strong> Paramètres </strong> sur votre iPhone. </li> <li> Sélectionner <strong> messages </strong> . </li> <li> Allumer <strong> iMessage </strong> avec la bascule s&#39;il n&#39;est pas déjà activé. </li> <li> Sélectionnez ensuite <strong> Transfert de message texte </strong> . </li> <li> Choisis lequel <strong> dispositifs </strong> pouvez envoyer et recevoir des messages texte depuis votre iPhone. </li> <li> Si vous n&#39;utilisez pas l&#39;authentification à deux facteurs pour votre identifiant Apple, un <strong> code de vérification </strong> apparaît sur chacun de vos autres appareils : saisissez ce code sur votre iPhone. Si vous utilisez l&#39;authentification à deux facteurs, vous pouvez ignorer cette étape. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (3 images) </strong> <img alt=\"Turn on Text Message Forwarding on iPhone\" src=\"images/iphone-imessage-to-icloud-1-438.jpg\" loading=\"lazy\"> Développer <img alt=\"Text Message Forwarding from an iPhone\" src=\"images/text-message-forwarding-from-iphone-234.jpg\" loading=\"lazy\"> Développer <img alt=\"Apple ID Verification Code\" src=\"images/icloud-verification-code-439.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> </p> <h2 id=\"step-2-set-up-your-ipad\"> Étape 2. Configurez votre iPad </h2> <p> Chaque message que vous envoyez et recevez sur votre iPad est enregistré dans iCloud. Vous devez vous assurer que Messages pour iCloud est activé pour votre iPad. Voici comment procéder : </p> <ol> <li> Ouvert <strong> Paramètres </strong> sur votre iPad. </li> <li> Sélectionnez votre <strong> identifiant Apple </strong> nom du compte. </li> <li> Sélectionner <strong> iCloud </strong> . </li> <li> Allumer <strong> messages </strong> . </li> </ol> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (2 images) </strong> <img alt=\"Opening iCloud Settings on iPad\" src=\"images/opening-apple-id-settings-on-ipad-295.jpg\" loading=\"lazy\"> Développer <img alt=\"Turn on Messages on iPad\" src=\"images/turn-on-messages-on-ipad-637.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> </p> <h2 id=\"texting-from-your-iphone-or-your-ipad-made-easy\"> Envoyer des SMS depuis votre iPhone ou votre iPad en toute simplicité </h2> <p> Maintenant que vous avez tout configuré, tout ce que vous avez à faire est d&#39;ouvrir l&#39;application Messages sur votre iPad pour voir toutes vos conversations ou en démarrer une nouvelle comme vous le feriez habituellement sur l&#39;iPhone. </p> <p> Plus besoin de transporter tous vos appareils pour vous assurer de ne manquer aucun message texte important, tant que votre iPhone est allumé et connecté au Wi-Fi ou à un réseau cellulaire. </p>"}