{"title":"Comment accéder à vos statistiques de jeu PS4 et PS5 pour 2020","content":"<p> Sony a lancé le PlayStation Wrap-Up, qui vous permet de réfléchir à votre parcours PlayStation au cours de la dernière année. </p> <p> Nous allons vous expliquer comment accéder à cette expérience et vous sensibiliser aux quelques exigences. </p> <h2 id=\"what-is-playstation-wrap-up\"> Qu&#39;est-ce que le récapitulatif PlayStation ? </h2> <p> Comme nous l&#39;avons signalé, <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation Wrap-Up est le résumé de votre dernière année de jeu </a> . </p> <p> Il s&#39;agit d&#39;une page personnalisée qui détaille vos habitudes de jeu sur PS4 et PS5, y compris le nombre de jeux auxquels vous avez joué, le temps que vous avez passé à les jouer et le nombre de trophées que vous avez gagnés en cours de route. </p> <p> Vous pouvez également obtenir un thème dynamique gratuit avec des formes PlayStation. De manière confuse, cela n&#39;est disponible que pour la PS4 et non pour la nouvelle PS5. </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> Comment accéder à PlayStation Wrap-Up </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> Pour consulter votre rapport, rendez-vous sur le <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> Site Web de synthèse PlayStation </a> . Vous devrez vous connecter à votre compte Sony, si ce n&#39;est déjà fait. Une fois sur la page, vous pouvez faire défiler vers le bas pour afficher vos statistiques et utiliser le thème PS4. </p> <p> L&#39;expérience Wrap-Up ne sera disponible que jusqu&#39;au 2 mars 2021. En tant que tel, ne tardez pas si vous souhaitez y participer. </p> <p> Vous devez remplir certaines conditions pour utiliser PlayStation Wrap-Up : </p> <ul> <li> Avoir un compte PSN enregistré dans votre région. </li> <li> Être âgé de 18 ans ou plus. </li> <li> Avoir joué à des jeux pendant au moins 10 heures sur une console PS4 entre le 1er janvier 2020 et le 31 décembre 2020. </li> </ul> <p> De plus, les utilisateurs en Europe, au Moyen-Orient, en Afrique, en Australie, en Inde et en Russie doivent avoir activé la collecte de <strong> Donnée supplémentaire </strong> . Vous pouvez l&#39;activer sur la PS4 via <strong> Paramètres </strong> &gt; <strong> Données de l&#39;appareil/Santé et sécurité </strong> &gt; <strong> Données de l&#39;appareil </strong> . </p> <p> Enfin, vous pouvez recevoir un e-mail contenant votre PlayStation Wrap-Up. Cependant, vous devez avoir choisi de recevoir des e-mails marketing, ce que vous pouvez faire via le <strong> Paramètres de notification </strong> dans votre compte PSN. </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> Y aura-t-il un bilan 2021 ? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> C&#39;est la deuxième année consécutive que Sony propose l&#39;expérience Wrap-Up. Comme il n&#39;analyse que les données de 2020, il se concentre davantage sur la PS4. </p> <p> Espérons que Sony le refera l&#39;année prochaine, lorsque la PS5 sera sortie plus longtemps et que plus de jeux seront sortis. </p>"}