{"title":"Comment boucler une vidéo YouTube","content":"<p> Voulez-vous boucler une vidéo YouTube ? Qu&#39;il s&#39;agisse de votre chanson préférée ou d&#39;une compilation amusante, vous n&#39;avez pas besoin de recharger la page si vous souhaitez répéter une vidéo YouTube. </p> <p> Nous allons vous montrer comment boucler une vidéo YouTube sur ordinateur et mobile. </p> <h2 id=\"how-to-loop-a-youtube-video-on-desktop\"> Comment boucler une vidéo YouTube sur le bureau </h2> <ol> <li> Accédez à la vidéo que vous souhaitez boucler. </li> <li> <strong> Clic-droit </strong> la vidéo (pas autour). Le menu contextuel YouTube s&#39;ouvrira. </li> <li> Cliquez sur <strong> Boucle </strong> . <p> <img alt=\"youtube video loop desktop\" src=\"images/youtube-video-loop-desktop-114.jpg\" loading=\"lazy\"> </p> </li> </ol> <p> Lorsque la vidéo arrive à la fin, elle se mettra automatiquement en boucle. Pour confirmer qu&#39;il est activé, <strong> clic-droit </strong> la vidéo et vous verrez une coche à côté de <strong> Boucle </strong> (sur lequel vous pouvez cliquer à nouveau pour désactiver). </p> <p> </p> <p> </p> <h2 id=\"how-to-loop-a-youtube-video-on-mobile\"> Comment boucler une vidéo YouTube sur mobile </h2> <p> Malheureusement, la mise en boucle d&#39;une vidéo YouTube sur l&#39;application mobile n&#39;est pas aussi simple que sur le bureau. Au lieu de cela, vous devez mettre la vidéo dans une liste de lecture. Voici comment procéder : </p> <ol> <li> Accédez à la vidéo que vous souhaitez boucler. </li> <li> Sous la vidéo, maintenez la touche <strong> Sauvegarder </strong> bouton. </li> <li> Robinet <strong> Nouvelle playlist </strong> . </li> <li> Saisissez un nom pour la liste de lecture, choisissez un <strong> Intimité </strong> réglage et appuyez sur <strong> Créer </strong> . </li> <li> Robinet <strong> Voir la liste </strong> pour accéder à la nouvelle liste de lecture (ou accéder à l&#39;écran d&#39;accueil de l&#39;application, appuyez sur <strong> Bibliothèque </strong> dans le menu du bas et entrez votre liste de lecture). </li> <li> Appuyez sur le <strong> Mélanger </strong> icône (deux flèches entrelacées). <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (3 images) </strong> <img alt=\"youtube android save\" src=\"images/youtube-android-save-686.jpg\" loading=\"lazy\"> Développer <img alt=\"youtube android new playlist\" src=\"images/youtube-android-new-playlist-719.jpg\" loading=\"lazy\"> Développer <img alt=\"youtube android repeat playlist\" src=\"images/youtube-android-repeat-playlist-472.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> </li> <li> Lisez la vidéo et appuyez sur la flèche dans le coin inférieur droit de la vidéo. À partir de là, appuyez sur le <strong> Boucle </strong> icône (deux flèches formant un rectangle). </li> </ol> <p> Lorsque la vidéo arrive à la fin, elle se mettra automatiquement en boucle. Bien sûr, vous pouvez également ajouter plusieurs vidéos à cette liste de lecture. </p> <p> </p> <h2 id=\"how-to-use-an-external-service-to-loop-a-youtube-video\"> Comment utiliser un service externe pour boucler une vidéo YouTube </h2> <p> Si vous ne souhaitez pas utiliser les méthodes natives ci-dessus pour une raison quelconque, vous pouvez également utiliser un service externe appelé <a href=\"https://www.youtuberepeater.com\" target=\"_blank\" rel=\"nofollow noopener\"> Répéteur YouTube </a> . </p> <p> Pour l&#39;utiliser facilement, accédez à la vidéo YouTube que vous souhaitez boucler. Dans la barre d&#39;URL, remplacez <strong> youtube.com </strong> avec <strong> youtuberepeater.com </strong> , puis accédez à cette nouvelle URL. </p> <p> Par exemple, si vous vouliez boucler <strong> youtube.com/watch?v=n9xhJrPXop4 </strong> , vous le changeriez en <strong> youtuberepeater.com/watch?v=n9xhJrPXop4 </strong> . </p> <p> Cela ne fonctionnera pas sur les vidéos pour lesquelles l&#39;utilisateur n&#39;a pas autorisé l&#39;intégration de la vidéo en dehors de YouTube. En tant que tel, l&#39;utilisation de l&#39;une des deux méthodes ci-dessus est le choix idéal. </p>"}