{"title":"Comment faire passer votre PS5 de vertical à horizontal (ou vice versa)","content":"<p> La PlayStation 5 fonctionne dans une configuration verticale ou horizontale. Si vous changez d&#39;avis sur votre orientation préférée, il est assez facile de déplacer votre PS5 de la verticale à l&#39;horizontale (ou vice-versa). </p> <p> Voyons comment déplacer en toute sécurité votre PS5 d&#39;une orientation verticale à horizontale sur le côté, et inversement. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> Premièrement : éteignez et débranchez votre PS5 </h2> <p> Avant d&#39;effectuer tout travail de déplacement physique de votre PlayStation 5, il est important de l&#39;éteindre et de tout débrancher. Cela évitera d&#39;endommager le système qui pourrait survenir si vous le déplacez pendant qu&#39;il est allumé. </p> <p> Vous devez éteindre complètement votre PS5. Pour ce faire, appuyez sur la <strong> Bouton PS </strong> sur votre manette pour afficher le menu rapide en bas de l&#39;écran. Sélectionner <strong> Pouvoir </strong> à droite et choisissez <strong> Éteindre la PS5 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Attendez que les lumières de votre console s&#39;éteignent, puis débranchez le câble d&#39;alimentation, le câble HDMI et tout ce que vous avez connecté au système. Vous êtes maintenant prêt à changer l&#39;orientation de votre PS5. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Retirez la vis du support </h2> <p> Lorsque vous installiez votre PS5 verticalement, vous deviez retirer une vis incluse d&#39;un compartiment de la base et l&#39;utiliser pour fixer la base à la console lorsqu&#39;elle se trouvait verticalement. En conséquence, le retrait de cette vis est votre première étape pour changer l&#39;orientation de votre console. </p> <p> Retournez doucement votre PS5 sur le côté pour pouvoir accéder au support en bas. Utilisez un tournevis à tête plate, une pièce de monnaie ou un outil similaire pour retirer la seule vis argentée qui maintient la base au système. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Une fois la vis desserrée, la base se dégagera. Il y a un petit compartiment dans la base où vous pouvez ranger la vis. Enclenchez-le à cet endroit, puis glissez-le dans le petit trou pour le maintenir en place. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> Également dans ce compartiment, vous trouverez un petit bouchon noir (tant que vous l&#39;y mettez lors de la configuration initiale). Retirez ce bouchon et utilisez-le pour boucher le trou au bas de la PS5 où vous venez de retirer la vis. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Faire pivoter la base </h2> <p> Maintenant, vous voudrez faire pivoter la base pour qu&#39;elle s&#39;adapte à la console dans son orientation horizontale. Cela ferme également le petit compartiment où vous avez placé la vis, la fixant davantage. </p> <p> Vous devez faire pivoter la base en la regardant par le haut (à l&#39;opposé de l&#39;endroit où vous venez de ranger la vis). Si vous traitez la partie surélevée du support comme « nord », vous devrez faire pivoter la partie extérieure du support vers le « nord-ouest », comme indiqué ci-dessous. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Il s&#39;agit de l&#39;orientation correcte pour utiliser le support horizontalement. Il cliquera et s&#39;arrêtera doucement lorsque vous l&#39;aurez au bon endroit. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Fixez le support en position horizontale </h2> <p> Maintenant, vous pouvez attacher le support à votre PS5 lorsqu&#39;il est assis horizontalement. Assurez-vous que le système est installé dans le bon sens --- le logo PS doit être orienté vers le haut. </p> <p> À l&#39;arrière de votre système, en dessous et à proximité des deux ports USB, vous verrez des symboles de contrôleur PlayStation imprimés sur la console. Glissez les bras extérieurs de la base (que vous venez de faire pivoter) sur le système autour de l&#39;endroit où ce motif se termine de chaque côté. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Appuyez sur les clips pour les fixer, mais sachez que dans cette position, le support n&#39;est pas complètement verrouillé en place (comme c&#39;est le cas avec la vis lorsqu&#39;il est placé verticalement). Soyez doux lorsque vous posez le système et sachez que le support peut glisser si vous tirez dessus. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Vous êtes maintenant prêt à utiliser votre PS5 en orientation horizontale. Rebranchez tous les câbles et démarrez-le pour reprendre la lecture. Si vous avez la PS5 standard, vous insérerez les disques face vers le haut dans cette orientation. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> Comment changer votre PS5 de l&#39;horizontale à la verticale </h2> <p> Vous voulez revenir à une orientation verticale pour votre PS5, ou peut-être avez-vous initialement configuré votre PS5 sous forme horizontale et souhaitez-vous passer à la verticale maintenant ? Dans tous les cas, il est facile de suivre le processus ci-dessus dans l&#39;ordre inverse. Assurez-vous d&#39;abord d&#39;éteindre et de débrancher votre PS5, si elle est actuellement allumée ou en mode repos. </p> <p> </p> <p> Pour passer à une orientation verticale, soulevez d&#39;abord votre PS5 et retirez doucement le support du système pour le retirer. Ensuite, vous devez faire pivoter le bras extérieur de la base. En le regardant de haut, le bras doit être &quot;au nord&quot;, aligné avec la partie surélevée. Assurez-vous de sentir le léger clic, afin que vous sachiez qu&#39;il est au bon endroit. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> Positionnez votre PS5 de manière à pouvoir accéder au bas, puis retirez le bouchon noir du trou au milieu, il est situé à peu près au milieu des évents. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Placez ce bouchon noir à l&#39;intérieur du petit trou dans le compartiment sur le dessous de la base. Le bouchon doit s&#39;enclencher à sa place. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> Ensuite, retirez la vis du même compartiment dans la base. Maintenant, vous devrez attacher le support dans sa bonne position. Pour ce faire, placez votre PS5 vers le haut de manière à ce que l&#39;arrière de la console soit orienté vers le haut, comme indiqué ci-dessous. </p> <p> Prenez le support et placez-le de sorte que le trou pour la vis soit aligné avec le trou de vis dont vous venez de retirer le bouchon. Positionnez les clips sur le bras de la base à l&#39;arrière de votre système sous le connecteur d&#39;alimentation. Le support doit s&#39;aligner facilement. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Maintenant, utilisez un tournevis ou similaire pour serrer la vis. Une fois que vous avez terminé et que le support est fermement attaché, vous êtes prêt à utiliser votre PS5 verticalement. Rebranchez tous les câbles pour terminer le travail. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> Devriez-vous placer votre PS5 verticalement ou horizontalement ? </h2> <p> Sony prend en charge l&#39;utilisation de votre PS5 à la fois verticalement et horizontalement, il n&#39;y a donc pas de bonne ou de mauvaise façon de le faire, tant que votre système reçoit un flux d&#39;air suffisant. L&#39;orientation à utiliser dépend de vos besoins. </p> <p> </p> <p> Si vous avez beaucoup d&#39;espace et que cela ne vous dérange pas que la PS5 occupe beaucoup d&#39;espace horizontal, l&#39;aspect horizontal est élégant. Pour ceux qui ont le modèle standard PS5, cela facilite également le processus d&#39;insertion des disques, car l&#39;étiquette doit toujours être tournée vers le haut. C&#39;est un peu plus difficile à retenir avec l&#39;orientation verticale, où l&#39;étiquette du disque doit être tournée vers la gauche. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> Cependant, il se peut que vous n&#39;ayez pas d&#39;espace à l&#39;intérieur de votre système de divertissement pour accueillir la configuration horizontale. Dans ces cas, aller à la verticale est votre meilleur pari. La PS5 est une énorme console de toute façon, mais lorsqu&#39;elle est placée verticalement, elle se trouve bien à côté de votre meuble TV ou similaire. C&#39;est la configuration que j&#39;utilise, comme le montre l&#39;image ci-dessous. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> Quelle que soit l&#39;orientation que vous choisissez pour votre PS5, assurez-vous d&#39;utiliser le support. Il maintient le système hors du sol, ce qui améliore la circulation de l&#39;air. Le support sécurise également la PS5, la rendant plus difficile à renverser et potentiellement l&#39;endommager. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> Configurez votre PS5 et commencez à jouer </h2> <p> Vous savez maintenant comment faire passer votre PS5 de la verticale à l&#39;horizontale et vice-versa en quelques minutes seulement. Une fois votre système configuré, lancez-le et profitez de certains des meilleurs titres de la PS5. </p> <p> N&#39;oubliez pas que la quasi-totalité de la bibliothèque de la PS4 fonctionne également sur la PS5, ce qui vous donne beaucoup plus à apprécier. </p> <p> <small> Crédit d&#39;image: Alex Van Aken/ <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}