{"title":"Comment gérer les groupes d&#39;utilisateurs avec Groupadd sur Linux","content":"<p> La gestion des utilisateurs est assez simple si vous utilisez Linux sur votre ordinateur personnel. Mais, pour ceux qui ont un serveur avec des milliers d&#39;utilisateurs, la gestion devient un problème sérieux dont il faut s&#39;occuper. </p> <p> Heureusement, les systèmes d&#39;exploitation basés sur Linux vous offrent un moyen de contrôler et de gérer les utilisateurs sur votre système. Vous pouvez créer des groupes et y ajouter des utilisateurs. Ensuite, au lieu d&#39;attribuer des autorisations à chaque utilisateur du système, vous pouvez facilement autoriser des groupes d&#39;utilisateurs en leur fournissant des privilèges associés au flux de travail du système. </p> <h2 id=\"create-user-groups-on-linux\"> Créer des groupes d&#39;utilisateurs sur Linux </h2> <p> Linux est livré avec une commande par défaut pour créer des groupes d&#39;utilisateurs. Vous pouvez utiliser le <strong> groupeajouter </strong> afin d&#39;ajouter de nouveaux groupes à votre système. La syntaxe de base de la commande est : </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> Pour créer un nouveau groupe d&#39;utilisateurs « écrivains » : </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> L&#39;exécution de la commande mentionnée ci-dessus ajoutera une nouvelle entrée au <strong> /etc/groupe </strong> et <strong> /etc/gshadow </strong> fichiers sur votre système. Vous pouvez vérifier la nouvelle entrée de groupe dans les fichiers en tapant <strong> chat /etc/groupe </strong> et <strong> chat /etc/gshadow </strong> dans votre terminal. </p> <p> Notez que seuls les utilisateurs disposant d&#39;autorisations administratives peuvent créer des groupes d&#39;utilisateurs. N&#39;oubliez pas de passer en superutilisateur avant d&#39;exécuter la commande groupadd. </p> <p> Si vous essayez de créer un groupe avec un nom qui existe déjà, vous verrez une erreur indiquant : </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> Cependant, vous pouvez ignorer l&#39;erreur en utilisant le <strong> -F </strong> ou alors <strong> --Obliger </strong> flag avec la commande. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Créer des groupes d&#39;utilisateurs avec un GID unique </h3> <p> Lorsque vous créez un nouveau groupe d&#39;utilisateurs, le système lui attribue automatiquement un ID de groupe ou un GID. Si vous voulez que votre groupe ait un identifiant de groupe spécifique, vous pouvez le faire en utilisant le <strong> -g </strong> ou alors <strong> --gid </strong> drapeau. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Si vous essayez d&#39;attribuer un ID de groupe déjà utilisé, l&#39;erreur suivante se produira. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Bien que ce ne soit pas recommandé, vous pouvez ajouter le <strong> -o </strong> ou alors <strong> --non unique </strong> pour attribuer de force l&#39;ID de groupe. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Créer des groupes d&#39;utilisateurs avec un mot de passe </h3> <p> Bien que vous puissiez ajouter un mot de passe à vos groupes, ils ne sont d&#39;aucune utilité pratique pour un utilisateur. le <strong> -p </strong> flag vous permet de spécifier un mot de passe pour votre groupe d&#39;utilisateurs. </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Créer des groupes système sous Linux </h3> <p> Il existe une légère différence entre les groupes système et les groupes réguliers. Les groupes système sont des groupes spéciaux qui incluent les utilisateurs chargés d&#39;effectuer des opérations système telles que la sauvegarde et la maintenance. </p> <p> Utilisez le <strong> -r </strong> ou alors <strong> --système </strong> flag pour créer un groupe système sous Linux : </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Obtenir la liste des membres d&#39;un groupe d&#39;utilisateurs </h3> <p> Pour savoir combien de membres font partie d&#39;un groupe spécifique, vous pouvez utiliser le <strong> obtenir </strong> commande depuis votre terminal. La commande suivante affichera une liste de tous les membres présents dans le groupe &#39;writers&#39; : </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Ajouter des utilisateurs aux groupes </h2> <p> Maintenant que vous avez créé un groupe d&#39;utilisateurs sur votre système, il est temps d&#39;y ajouter des utilisateurs. Usermod est un utilitaire de ligne de commande puissant car il contient diverses options associées à la gestion et à la modération des utilisateurs. Il vous permet également d&#39;ajouter facilement des utilisateurs à votre groupe. La syntaxe de base de la commande est : </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Ajouter un utilisateur existant aux groupes </h3> <p> Si vous souhaitez ajouter un utilisateur existant à votre groupe, le <strong> -une </strong> et <strong> -G </strong> les drapeaux sont ce dont vous avez besoin. le <strong> -G </strong> le drapeau représente les groupes, tandis que le <strong> -une </strong> signifie ajouter, ajouter ou ajouter. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> Vous pouvez également ajouter un utilisateur à plusieurs groupes. Tout ce que vous avez à faire est d&#39;entrer les noms de groupe séparés par une virgule. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Ajouter un nouvel utilisateur à un groupe </h3> <p> Vous pouvez utiliser le <strong> useradd </strong> commande quand vous voulez <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> ajouter un nouvel utilisateur à votre système Linux </a> . Useradd vous offre un moyen d&#39;attribuer un groupe à l&#39;utilisateur au moment de sa création. le <strong> -G </strong> flag vous permet de spécifier un groupe à l&#39;utilisateur. </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> L&#39;ajout d&#39;un utilisateur à plusieurs groupes est également facile. Passez simplement les noms de groupe séparés par des virgules dans la commande par défaut. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Supprimer des utilisateurs d&#39;un groupe </h2> <p> Vous pouvez également supprimer des utilisateurs d&#39;un groupe en utilisant <strong> mod utilisateur </strong> . Gardez à l&#39;esprit que dans un système Linux, plusieurs groupes peuvent être attribués à un utilisateur. L&#39;un de ces groupes est déclaré comme groupe principal, tandis que d&#39;autres sont appelés groupes secondaires. </p> <p> Si vous essayez de supprimer un utilisateur d&#39;un groupe, assurez-vous qu&#39;il possède au moins un groupe principal après la suppression. Par exemple, l&#39;utilisateur « random » fait partie des groupes admin, writers et editors ; où admin est le groupe principal et les autres sont des groupes secondaires. </p> <p> Vous ne pouvez supprimer l&#39;utilisateur que du groupe Writers et Editors. Et pour ce faire, vous devez transmettre le nom du groupe dont vous souhaitez que l&#39;utilisateur reste membre. Cela signifie que pour supprimer l&#39;utilisateur « aléatoire » des éditeurs de groupe, la commande suivante est utilisée : </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> Remarquez que tout ce que vous aviez à faire était de retirer le <strong> ajouter un indicateur (-a) </strong> à partir de la commande que vous utilisez pour ajouter un utilisateur à un groupe. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Supprimer des groupes sous Linux </h2> <p> Lorsque vous ne souhaitez plus conserver un groupe d&#39;utilisateurs sur votre système, vous pouvez supprimer le groupe à l&#39;aide de la <strong> groupdel </strong> commander. La syntaxe de la commande est : </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> Pour supprimer le groupe d&#39;utilisateurs &#39;writers&#39; : </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Si vous essayez de supprimer un groupe qui n&#39;existe pas, vous recevrez une erreur indiquant : </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Gestion des groupes d&#39;utilisateurs sous Linux </h2> <p> La gestion des utilisateurs peut être difficile si vous ne connaissez pas les commandes Linux que vous devez utiliser. Cela devient vraiment facile une fois que vous connaissez les entrées et les sorties des commandes liées à la modération et à la gestion. </p> <p> Les administrateurs de serveur doivent essayer d&#39;utiliser des distributions Linux bien adaptées à leurs besoins. De cette façon, ils obtiendront d&#39;emblée tous les outils et utilitaires nécessaires à la gestion des serveurs. </p>"}