{"title":"Comment améliorer vos compétences en édition Lightroom : 10 manières simples","content":"<p> Adobe Lightroom est l&#39;une des plateformes de retouche photo les plus connues du marché. Cette solution est populaire non seulement en raison de ses nombreuses fonctionnalités utiles, mais également en raison de sa convivialité. </p> <p> Lorsque les photographes cherchent à prendre leur métier un peu plus au sérieux, la première chose qu&#39;ils feront est d&#39;acheter un logiciel de montage. Mais même si vous n&#39;êtes qu&#39;un simple photographe occasionnel, Lightroom offre de nombreuses façons d&#39;impressionner vos amis. </p> <p> Dans ce guide, vous découvrirez plusieurs façons simples d&#39;améliorer vos photos dans Lightroom. Ces conseils fonctionnent à la fois pour Lightroom Classic et Lightroom Creative Cloud. </p> <h2 id=\"use-masking\"> 1. Utilisez le masquage </h2> <p> Si vous affinez votre photo par défaut, vous ajouterez des détails à l&#39;ensemble de l&#39;image, même aux zones que vous ne souhaitez pas. Cela peut vous laisser beaucoup de grain dans des endroits indésirables, comme dans le ciel et l&#39;eau. </p> <p> Vous courez également le risque de faire ressembler votre photo plus à un dessin qu&#39;à quelque chose que vous avez pris avec votre appareil photo. Heureusement, il existe une solution simple. </p> <p> Dans l&#39;application Lightroom, faites défiler jusqu&#39;à <strong> Détail </strong> . Quand vous y êtes, allez à <strong> Affûtage </strong> &gt; <strong> Masquage </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Faites défiler le curseur jusqu&#39;à ce que les parties de l&#39;image que vous souhaitez affiner soient sélectionnées. Pour voir ce que vous masquez, appuyez sur la touche <strong> Alt </strong> touche de votre clavier en même temps. </p> <p> Une fois que vous avez masqué la zone souhaitée, faites défiler le curseur de netteté autant ou aussi peu que nécessaire. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Utilisez des profils d&#39;appareil photo au lieu de ceux par défaut d&#39;Adobe </h2> <p> Si vous téléchargez une image au format RAW, Adobe ajoutera par défaut l&#39;un de ses profils de programme. Et bien que ceux-ci puissent améliorer l&#39;apparence de votre image dans certains cas, il est souvent préférable d&#39;en choisir une spécifique à l&#39;appareil photo. </p> <p> Lorsque vous utilisez un profil d&#39;appareil photo, l&#39;image deviendra plus facile à modifier en fonction de ce que vous avez pris avec votre appareil. </p> <p> Pour modifier le profil de votre photo, rendez-vous sur <strong> Profils </strong> &gt; <strong> Correspondance de caméra </strong> . Vous pouvez alors choisir parmi <strong> Standard </strong> , <strong> Neutre </strong> , <strong> Paysage </strong> , et d&#39;autres regards. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Rappelles toi: </strong> vous ne pouvez pas modifier le profil de l&#39;image avec autant de profondeur si vous ne prenez que des JPEG. Alors, avant de sortir pour prendre des photos, réglez votre appareil photo sur l&#39;un ou l&#39;autre <strong> CRU </strong> ou alors <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Brossez certaines parties de votre image </h2> <p> Avez-vous déjà augmenté la clarté, la saturation ou les détails de l&#39;ensemble de votre image, en vous attendant à un chef-d&#39;œuvre, mais obtenez plutôt une image qui semble avoir été prise au micro-ondes ? Si c&#39;est le cas, il peut être avantageux de ne modifier que certaines parties de votre image à la place. </p> <p> Dans Lightroom, vous pouvez accéder à une fonctionnalité appelée <strong> Brosser </strong> . Vous pouvez l&#39;utiliser pour « brosser » des parties de votre image tout en laissant le reste seul. </p> <p> Pour utiliser cet outil, rendez-vous sur le <strong> Brosser </strong> icône sur le côté droit de votre écran. Vous pouvez agrandir ou réduire votre pinceau, en fonction de la quantité d&#39;image que vous souhaitez modifier. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Avant de commencer le brossage, modifiez les caractéristiques de l&#39;image que vous souhaitez modifier. Par exemple, vous pouvez augmenter le curseur de clarté si vous cherchez à rendre une partie de l&#39;image plus claire. </p> <p> Après avoir modifié ces fonctionnalités, passez le pinceau sur les zones que vous souhaitez modifier. presse <strong> O </strong> sur votre clavier pour voir où vous avez balayé. </p> <p> Si vous avez trop avancé dans un domaine particulier, maintenez le <strong> Moins </strong> ( <strong> - </strong> ) et passez le pinceau sur ces parties pour effacer vos modifications. Connaissance <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> raccourcis clavier pour Adobe Lightroom </a> est pratique pour ces situations, alors n&#39;oubliez pas de les rafraîchir ! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Défringez vos photos </h2> <p> Parfois, votre appareil photo prendra des photos où les bords ont des couleurs non naturelles. Vous les remarquerez particulièrement lorsque vous prenez des photos en plein soleil. Ils se déclinent principalement dans des tons de vert et de violet. </p> <p> Pour délimiter vos photos, faites défiler jusqu&#39;à <strong> Défranger </strong> . Vous pouvez choisir de vous débarrasser des franges violettes ou vertes. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> Utiliser <strong> Montant </strong> pour décider combien de fringes vous souhaitez ajouter. Faites glisser la barre de couleur jusqu&#39;à ce que vous soyez satisfait du résultat. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Utilisez la géométrie pour redresser vos photos </h2> <p> Quels que soient vos efforts, il est difficile de tenir un appareil photo droit à moins d&#39;avoir un trépied. Mais grâce à la magie des logiciels d&#39;édition, le redressement de vos photos est facile. </p> <p> Dans Lightroom, vous pouvez redresser automatiquement vos photos en accédant à la <strong> Recadrer </strong> section. Cependant, il existe un moyen plus précis d&#39;obtenir le même résultat. </p> <p> Dans l&#39;onglet de droite, choisissez l&#39;option du haut. Ensuite, faites défiler jusqu&#39;à <strong> Géométrie </strong> . Lorsque vous êtes ici, allez à <strong> Droit </strong> &gt; <strong> Niveau </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> Vous pouvez également tracer des lignes droites pour rendre la photo aussi droite que possible. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Ajustez la taille de votre zone de netteté </h2> <p> Vous connaissez maintenant le masquage, mais saviez-vous que vous pouvez également accentuer des zones spécifiques de votre photo ? </p> <p> Pour sélectionner la zone de la photo masquée que vous souhaitez accentuer, accédez à <strong> Affûtage </strong> , maintenez le <strong> Alt </strong> clé et dirigez-vous vers <strong> Rayon </strong> . Le réglage de ce curseur vous permet d&#39;agrandir ou de réduire votre zone de netteté. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> Après cela, montez au <strong> Affûtage </strong> bar. De même, maintenez le <strong> Alt </strong> et déplacez le curseur vers la droite. Cela vous permettra d&#39;affiner facilement une zone spécifique de votre photo, plutôt que l&#39;image entière. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Utilisez les courbes de points de couleur </h2> <p> Si la couleur de votre image ne semble pas correcte même après avoir ajusté la balance des blancs, vous voudrez peut-être vérifier les courbes de points de couleur dans Lightroom. Vous pouvez les utiliser pour ajuster certaines couleurs de votre image. </p> <p> Vous trouverez trois panneaux de courbes de couleurs différentes dans l&#39;application : rouge, bleu et vert. </p> <p> Pour accéder à ces courbes de couleurs, faites défiler jusqu&#39;à <strong> Courbe de points </strong> . Ensuite, cliquez sur la couleur que vous souhaitez modifier. Vous pouvez ensuite jouer avec les couleurs de la même manière que vous le feriez sur la norme <strong> Courbe de points </strong> languette. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Tapez un nombre pour chaque curseur et ajustez en conséquence </h2> <p> Souvent, les nouveaux photographes seront enthousiasmés par le nombre d&#39;options d&#39;édition à leur disposition. Lorsqu&#39;ils ouvrent Lightroom, ils font glisser chaque barre beaucoup trop loin dans les deux sens. Mais au lieu d&#39;améliorer leur image, ils se retrouvent avec un gâchis surédité. </p> <p> Lors de l&#39;édition de vos photos, la clé est de faire de petits changements. Il y a de fortes chances que vous soyez déjà un bon photographe et que la photo que vous avez prise ait juste besoin d&#39;un petit réglage post-production. </p> <p> </p> <p> Au lieu de déplacer librement chaque curseur, essayez de changer le nombre sur les zones que vous souhaitez modifier en <strong> +10 </strong> ou alors <strong> -dix </strong> . Si vous pensez que plus de travail est nécessaire, répétez le processus. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Lorsque vous vous sentez proche, déplacez lentement chaque curseur vers la gauche ou la droite jusqu&#39;à ce que vous soyez satisfait. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Recadrez vos photos </h2> <p> Le recadrage peut sembler évident, mais de nombreux photographes sous-utilisent encore cette fonctionnalité. Il est également important de recadrer vos images en fonction de l&#39;endroit où vous allez les utiliser. Sinon, ils seront déformés. </p> <p> Pour recadrer vos photos, accédez à la <strong> Recadrer </strong> icône. C&#39;est le deuxième plus élevé à partir du haut. Aller à <strong> Ratio d&#39;aspect </strong> pour changer la taille et faites glisser les coins pour vous débarrasser de tous les objets indésirables. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> Une fois le recadrage terminé, appuyez sur le bouton <strong> Entrer </strong> sur votre ordinateur et les modifications entreront en vigueur. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Utiliser l&#39;histogramme </h2> <p> L&#39;histogramme de Lightroom est facile à ignorer mais essentiel à connaître. Ce petit graphique vous montrera où les couleurs et l&#39;éclairage sont inégaux dans votre image, vous permettant de créer un montage plus propre. </p> <p> En règle générale, une photo bien retouchée aura peu de pointes sur l&#39;histogramme. Parfois, cela est inévitable. Mais en général, vous devriez chercher à rendre le graphique aussi uniforme que possible. </p> <p> Selon la version de Lightroom que vous utilisez, vous pouvez manipuler l&#39;histogramme plus ou moins directement. Dans Lightroom Classic, vous pouvez cliquer sur l&#39;histogramme et même les choses en glissant sur certaines sections. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> Dans Creative Cloud, l&#39;histogramme est également visible dans le coin supérieur droit, mais vous devez modifier vous-même les curseurs pour que l&#39;histogramme se déplace. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> Sur les deux versions de la plateforme, l&#39;histogramme est disponible en haut de votre écran au dessus des fonctions d&#39;édition. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> Un bon montage n&#39;est pas seulement pour les pros </h2> <p> Lightroom est un excellent logiciel d&#39;édition pour tous ceux qui cherchent à faire passer leur photographie au niveau supérieur. Et même si vous n&#39;avez jamais utilisé la plate-forme auparavant, vous n&#39;avez pas à vous inquiéter, car elle est facile à apprendre. </p> <p> Lorsque vous modifiez vos photos dans Lightroom, n&#39;oubliez pas que moins c&#39;est souvent plus. En plus de prendre en compte ces conseils, il est judicieux de prendre du recul après l&#39;édition et de revenir plus tard pour voir s&#39;ils sont aussi bien édités que vous le pensiez. </p>"}