{"title":"Comment personnaliser l&#39;invite zsh dans le terminal macOS","content":"<p> Depuis la mise à jour vers la version 10.15 Catalina, macOS inclut Z shell (zsh) par défaut au lieu de Bash dans l&#39;application Terminal. Cela dit, vous obtenez toujours la même fenêtre noire avec du texte blanc à l&#39;intérieur du terminal. Les choses ne doivent pas rester ainsi. </p> <p> Vous pouvez embellir l&#39;invite zsh pour la rendre minimale et tirer le meilleur parti de l&#39;espace. Nous allons vous montrer comment personnaliser l&#39;invite zsh dans l&#39;application Terminal pour vous démarquer sur l&#39;arrière-plan de votre choix. </p> <h2 id=\"basics-of-the-zsh-prompt\"> Principes de base de l&#39;invite zsh </h2> <p> Lorsque vous lancez l&#39;application Terminal, elle affiche des informations utiles, telles que votre dernière connexion et l&#39;invite de commande. Voici à quoi ressemble généralement l&#39;invite par défaut. </p> <pre><code class=\"hljs ruby\">Last login: Wed Feb 3 22:00:40 on console<br>samir@MacBook-Air ~ %</code></pre> <p> L&#39;invite zsh affiche une chaîne de texte composée de votre nom d&#39;utilisateur et du modèle de votre ordinateur, comme MacBook Air, MacBook Pro, Mac Mini, etc. Le tilde (~) indique l&#39;emplacement de l&#39;invite dans le répertoire personnel. </p> <p> <img alt=\"Default View of zsh prompt\" src=\"images/default-view-of-zsh-prompt-685.jpg\" loading=\"lazy\"> </p> <p> </p> <p> </p> <h2 id=\"create-a-z-shell-profile-to-store-all-settings\"> Créer un profil Z Shell pour stocker tous les paramètres </h2> <p> En règle générale, vous devez modifier les fichiers système pour modifier l&#39;apparence par défaut. En effet, les mises à jour de macOS réinitialisent tous les fichiers système par défaut et vous perdrez toutes les modifications que vous apportez. </p> <p> Vous pouvez donc créer un fichier de paramètres spécifique, appelé fichier de points, pour que votre profil zsh stocke toutes les modifications et tous les paramètres souhaités dans l&#39;invite zsh. </p> <p> Eh bien, vous ne trouverez pas ce fichier de points par défaut sur macOS, vous devrez donc en créer un. La création d&#39;un nouveau profil .zshrc est recommandée pour stocker tous les paramètres tels que l&#39;apparence et le comportement de l&#39;invite zsh. </p> <p> Voici comment créer le profil zsh (dotfile) : </p> <p> 1. Ouvrir <strong> Terminal </strong> application. </p> <p> 2. Tapez la commande suivante et appuyez sur la touche Retour. </p> <pre><code class=\"hljs\">touch ~/.zshrc</code></pre> <p> Cela créera un profil .zshrc dans le répertoire personnel de votre compte utilisateur. Vous pouvez le voir sous /User// path dans le Finder si vous avez activé l&#39;affichage des fichiers système cachés. </p> <p> Après cela, le profil zsh sera disponible pour les shells de connexion et interactifs chaque fois que vous lancerez Terminal. Cependant, il ne sera pas actif dans les sessions SSH. </p> <p> Toutes les modifications que vous souhaitez apporter à l&#39;invite zsh peuvent être incluses dans ce profil. </p> <p> </p> <h2 id=\"customize-the-zsh-prompt-in-terminal\"> Personnaliser l&#39;invite zsh dans le terminal </h2> <p> En règle générale, l&#39;invite zsh par défaut contient des informations telles que le nom d&#39;utilisateur, le nom de la machine et l&#39;emplacement à partir du répertoire de base de l&#39;utilisateur. Ces détails sont stockés dans le fichier système du shell zsh à l&#39;emplacement /etc/zshrc. </p> <pre><code class=\"hljs perl\">PS1=\"%n@%m %1~ %#\"</code></pre> <p> Dans cette chaîne de variables : </p> <ul> <li> %n est le nom d&#39;utilisateur de votre compte. </li> <li> %m est le nom du modèle du MacBook. </li> <li> Le symbole %1~ signifie le chemin du répertoire de travail actuel où le ~ supprime l&#39;emplacement du répertoire $HOME. </li> <li> %# signifie que l&#39;invite affichera # si le shell s&#39;exécute avec les privilèges root (administrateur), ou proposera % si ce n&#39;est pas le cas. </li> </ul> <p> Pour apporter des modifications à l&#39;invite zsh par défaut, vous devrez ajouter des valeurs pertinentes pour que l&#39;invite apparaisse différemment de la valeur par défaut. </p> <p> Voici comment procéder. Ouvert <strong> Terminal </strong> , tapez la commande suivante et appuyez sur Entrée. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Il sera vide si vous y accédez pour la première fois. Vous pouvez ajouter une nouvelle ligne avec le texte PROMPT=&#39;...&#39; et inclure les valeurs pertinentes dans les ellipses. </p> <p> Pour une simple modification de l&#39;invite zsh, vous pouvez saisir ces valeurs dans le profil .zshrc. </p> <pre><code class=\"hljs ruby\">PROMPT='%n~$'</code></pre> <p> Frappé <strong> Ctrl + O </strong> pour confirmer les modifications apportées au fichier, puis appuyez sur <strong> Ctrl + X </strong> pour quitter l&#39;éditeur nano. </p> <p> <img alt=\"Use only the username in the zsh prompt\" src=\"images/use-only-the-username-in-the-zsh-prompt-531.jpg\" loading=\"lazy\"> </p> <p> Ouvrir un nouveau <strong> Terminal </strong> fenêtre pour confirmer et afficher les modifications que vous venez d&#39;effectuer. Votre nouvelle invite zsh affichera le nom d&#39;utilisateur de votre mac, le répertoire personnel et le symbole $ à la fin. </p> <p> </p> <h2 id=\"add-date-and-time-in-the-zsh-prompt\"> Ajouter la date et l&#39;heure dans l&#39;invite zsh </h2> <p> En plus de votre nom d&#39;utilisateur, vous pouvez ajouter la date ou l&#39;heure actuelle afin que vous n&#39;ayez pas à détourner le regard de la fenêtre du terminal active pour vérifier ces informations. </p> <p> Lancez le Terminal et ouvrez le profil .zshrc. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Pour inclure la date dans l&#39;invite, vous pouvez utiliser %D pour que la date apparaisse au format aa-mm-jj ou %W pour qu&#39;elle apparaisse au format mm/jj/aa. Ensuite, la nouvelle invite apparaîtra comme </p> <pre><code class=\"hljs ruby\">PROMPT='%n:%W:~$'</code></pre> <p> <img alt=\"How to add date to the zsh prompt\" src=\"images/how-to-add-date-to-the-zsh-prompt-245.jpg\" loading=\"lazy\"> </p> <p> Si vous souhaitez inclure l&#39;heure système dans l&#39;invite zsh, ajoutez %T pour l&#39;heure actuelle au format 24 heures, %t pour que l&#39;heure apparaisse au format am/pm ou 12 heures, ou utilisez %* pour afficher le l&#39;heure au format 24 heures avec les secondes. </p> <pre><code class=\"hljs ruby\">PROMPT='%n:%T:~$'</code></pre> <p> <img alt=\"How to show Time on the zsh prompt\" src=\"images/how-to-show-time-on-the-zsh-prompt-258.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-color-to-text-in-the-zsh-prompt\"> Ajouter de la couleur au texte dans l&#39;invite zsh </h2> <p> Vous ennuyez-vous avec le texte blanc de l&#39;invite zsh ? En dehors de <a href=\"https://www.makeuseof.com/tag/customize-mac-terminal/\" target=\"_blank\" rel=\"nofollow noopener\"> modifier l&#39;application Terminal </a> avec des couleurs, vous pouvez ajouter de la couleur au texte afin d&#39;obtenir une belle pause visuelle. </p> <p> Lancer <strong> Terminal </strong> et ouvrez le profil .zshrc. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Le zsh prend en charge la couleur et les nuances de gris du texte d&#39;invite de sorte qu&#39;il complète l&#39;arrière-plan. Vous pouvez choisir une couleur de premier plan (texte) entre le noir, le blanc, le jaune, le vert, le rouge, le bleu, le cyan et le magenta. </p> <p> Voici comment les utiliser. </p> <pre><code class=\"hljs ruby\">PROMPT='%F{cyan}%n%f:~$'</code></pre> <p> <img alt=\"How to add color the zsh prompt\" src=\"images/how-to-add-color-the-zsh-prompt-993.jpg\" loading=\"lazy\"> </p> <p> Si vous souhaitez choisir une teinte spécifique, vous pouvez choisir entre 0 à 256 couleurs 8 bits prises en charge par le terminal. Voici comment utiliser les valeurs numériques des couleurs. </p> <pre><code class=\"hljs ruby\">PROMPT='%F{51}%n%f:~$'</code></pre> <p> Vous devez placer les variables de couleur de premier plan par défaut %F et %f entre le texte que vous souhaitez colorer. </p> <p> </p> <h2 id=\"adding-visual-effects-in-the-zsh-prompt\"> Ajout d&#39;effets visuels dans l&#39;invite zsh </h2> <p> Si la coloration du texte de l&#39;invite ne suffit pas, vous pouvez mettre en surbrillance votre invite zsh pour qu&#39;elle ressorte du mur de texte et que vous puissiez facilement la repérer. Pour commencer, vous pouvez mettre en gras l&#39;invite zsh. </p> <pre><code class=\"hljs ruby\">PROMPT='%B%F{51}%n%f%b:~$'</code></pre> <p> Ajouter %B au début et mettre %b à la fin entre le texte pertinent le rendra en gras. </p> <p> <img alt=\"How to bold text in the zsh prompt text\" src=\"images/how-to-bold-the-zsh-prompt-text-261.jpg\" loading=\"lazy\"> </p> <p> De même, vous pouvez mettre %S au début et %s à la fin pour surligner le texte. La surbrillance portera la même couleur que vous avez choisie pour apparaître entre les variables %S et %s. </p> <pre><code class=\"hljs ruby\">PROMPT='%S%F{51}%n%f%s:~$'</code></pre> <p> <img alt=\"How to Highlight the zsh prompt\" src=\"images/how-to-highlight-the-zsh-prompt-422.jpg\" loading=\"lazy\"> </p> <p> Vous pouvez également souligner le texte de l&#39;invite zsh. Pour ajouter un soulignement à une invite, vous pouvez inclure la variable %U au début et %u à la fin du texte pertinent. </p> <pre><code class=\"hljs ruby\">PROMPT='%U%F{51}%n%f%u:~$'</code></pre> <p> <img alt=\"How to Underline the zsh prompt\" src=\"images/how-to-underline-the-zsh-prompt-962.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-last-login-details-from-the-zsh-prompt\"> Supprimer les derniers détails de connexion de l&#39;invite zsh </h2> <p> Masquer ou désactiver la ligne supérieure révélant la dernière heure de connexion dans l&#39;application Terminal peut donner à votre invite zsh un aspect plus net. Vous pouvez utiliser la commande suivante pour masquer ces informations. </p> <pre><code class=\"hljs\">touch ~/.hushlogin</code></pre> <p> La prochaine fois que vous ouvrirez le terminal, vous ne verrez rien au-dessus de l&#39;invite zsh. </p> <p> </p> <h2 id=\"spice-up-the-zsh-prompt-in-terminal\"> Ajoutez du piquant à l&#39;invite zsh dans le terminal </h2> <p> Même si vous utilisez occasionnellement l&#39;application Terminal sur macOS, vous pouvez modifier la façon dont l&#39;invite zsh y apparaît. Vous pouvez mettre en gras, souligner, raccourcir et même inclure la date et l&#39;heure. </p> <p> Maintenant que vous avez commencé à personnaliser l&#39;invite zsh, expérimentez un peu et faites-en la vôtre. </p>"}