{"title":"Comment faire votre propre jeu de société dans Tabletop Simulator","content":"<p> Avez-vous déjà pensé à créer un jeu pour jouer avec vos amis sur Tabletop Simulator (TTS) ? Ou peut-être êtes-vous un développeur de jeux de table qui cherche à prototyper des jeux et à les tester en ligne. </p> <p> Il n&#39;y a jamais eu de meilleur moment pour profiter de l&#39;environnement de jeu polyvalent de TTS. Aujourd&#39;hui, nous allons vous apprendre à faire exactement cela. </p> <h2 id=\"what-is-tabletop-simulator\"> Qu&#39;est-ce que le simulateur de table ? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Pour ceux qui ne le savent pas, Tabletop Simulator (TTS) fournit un environnement 3D pour jouer à des jeux de table, en local ou en ligne. C&#39;est devenu un excellent moyen de <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> jouer à des jeux de société en ligne avec des amis </a> . </p> <p> Les jeux jouables sur TTS incluent tout, du poker aux dames, en passant par Dungeons &amp; Dragons, le mini-golf et même les derniers jeux de société. Tout jeu auquel vous souhaitez jouer est généralement disponible sous forme de DLC ou dans l&#39;atelier communautaire. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> Pourquoi utiliser le simulateur de table ? </h2> <p> Si vous avez déjà essayé de créer un jeu de table physique, vous savez à quel point cela peut prendre du temps, non seulement pour créer des éléments de jeu, mais aussi pour les modifier ou les remplacer lorsque vous décidez de peaufiner ou de réviser le jeu. </p> <p> Dans TTS, tout, de la couleur au poids d&#39;un objet, est modifiable en un clic de souris, ce qui rend le processus de révision fluide et indolore. </p> <p> De plus, il est facile de diffuser en direct votre gameplay et de le montrer sur les réseaux sociaux et les plateformes de streaming. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> Ce dont vous aurez besoin pour commencer </h2> <p> Avant de commencer, vous aurez besoin des éléments suivants : </p> <ul> <li> Un compte utilisateur Steam </li> <li> Simulateur de table installé sur votre PC </li> <li> Images JPG de vos conceptions de tableaux et de cartes </li> </ul> <p> <strong> Télécharger: </strong> Simulateur de table activé <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> Vapeur </a> (19,99 $) </p> <p> Il est préférable de concevoir des éléments de jeu en illustrant un logiciel ou en numérisant des images de cartes physiques que vous avez déjà créées. Assurez-vous simplement qu&#39;ils ont des extensions JPG et qu&#39;ils sont enregistrés individuellement. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Création de planches et de tapis de jeu </h2> <p> Lorsque vous concevez vos cartes et autres objets 2D, assurez-vous que la résolution est suffisamment élevée pour que vous puissiez la dimensionner correctement sans perdre en qualité. TTS le dimensionnera automatiquement lorsque vous l&#39;importerez, et vous pourrez le redimensionner exactement comme vous le souhaitez. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Création de cartes </h2> <p> Les cartes dans TTS ont trois aspects : la face de la carte, le dos de la carte et la carte cachée (à quoi ressemblera la carte pour les autres dans la main d&#39;un joueur). Vous aurez besoin d&#39;avoir des conceptions pour chacun d&#39;entre eux, bien que vous ayez la possibilité de simplement faire de la carte cachée le dos de la carte à la place. </p> <h3 id=\"create-and-arrange-card-faces\"> Créer et organiser des faces de cartes </h3> <p> Au lieu d&#39;importer chaque carte une par une, il est préférable d&#39;importer toutes ou la plupart de vos cartes en un seul jeu. </p> <p> Pour créer un jeu, copiez et collez chaque motif sur une feuille de cartes 7x10. L&#39;utilisation d&#39;un modèle comme celui ci-dessous vous aidera à démarrer. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> Le modèle délimite les emplacements pour chaque carte de votre deck, vous permettant d&#39;importer jusqu&#39;à 69 cartes à la fois. Si vous n&#39;en avez pas besoin, vous pouvez laisser des emplacements inutilisés et si vous en avez plus, vous pouvez combiner des decks ou dupliquer des cartes après l&#39;importation. </p> <p> Cependant, vous n&#39;êtes pas obligé d&#39;utiliser ce modèle. Une feuille de carte peut, en fait, être de n&#39;importe quelle taille, et TTS la découpera automatiquement en une grille 7x10. </p> <p> Pour votre commodité, le modèle ci-dessus et un modèle de carte carrée sont disponibles dans votre répertoire de fichiers local TTS. </p> <p> Si vous n&#39;êtes pas sûr de l&#39;emplacement de vos fichiers locaux, vous pouvez les trouver via votre bibliothèque Steam en ouvrant le <strong> Propriétés </strong> menu pour TTS. Sélectionnez le <strong> Fichiers locaux </strong> onglet et cliquez sur <strong> Parcourir </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Dos de cartes </h3> <p> Si vous ne voulez qu&#39;un seul dessin pour le dos de l&#39;ensemble du deck, alors tout ce dont vous avez besoin est une seule image JPG du dessin ; aucune feuille de carte ne sera nécessaire. </p> <p> Si votre deck doit avoir plusieurs dos uniques, vous devrez créer une feuille de cartes supplémentaire avec des motifs de dos correspondant aux motifs de visage de votre première feuille de cartes. Pour la conception du visage dans la première fente, placez son dos désigné dans la première fente de votre feuille arrière. Pour la face deux, placez son dos dans la fente deux, et ainsi de suite. </p> <h3 id=\"hidden-cards\"> Cartes cachées </h3> <p> Dans l&#39;emplacement 70 de la feuille de cartes, étiqueté « Carte cachée aux autres joueurs » sur le modèle, placez le motif que vous souhaitez voir visible par les adversaires lorsque les cartes de ce jeu sont dans la main d&#39;un joueur. Celui-ci est traditionnellement noir ou blanc uni, ou présente la conception arrière du pont. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Importation d&#39;éléments </h2> <p> Maintenant que vous avez créé vos planches et vos decks, vous êtes prêt à commencer l&#39;importation. </p> <p> Avant d&#39;héberger réellement un serveur avec votre jeu, il est utile de démarrer une partie en solo et d&#39;importer les éléments à l&#39;avance. Vous pouvez ensuite enregistrer la configuration et être prêt à commencer immédiatement lorsque les joueurs arrivent. </p> <p> Lancez TTS et cliquez sur <strong> Créer </strong> , puis sélectionnez <strong> Solo </strong> pour créer l&#39;environnement. Supprimez tous les éléments générés par TTS et sélectionnez la table sur laquelle vous souhaitez que votre jeu soit joué. </p> <p> Une fois l&#39;environnement prêt, cliquez sur le bouton <strong> Objets </strong> dans le menu supérieur, puis sélectionnez le <strong> Personnalisé </strong> Catégorie. </p> <h3 id=\"boards-and-player-mats\"> Planches et tapis de jeu </h3> <p> Sélectionner <strong> Conseil </strong> du <strong> Personnalisé </strong> menu, et cliquez n&#39;importe où sur la table où vous souhaitez que le tableau apparaisse. Cliquez avec le bouton droit n&#39;importe où pour ouvrir la boîte de dialogue d&#39;importation de carte. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Accédez à votre image du tableau et TTS vous demandera si vous souhaitez le télécharger sur votre compte Steam Cloud ou conserver un fichier local. Téléchargez les fichiers sur le cloud si vous prévoyez de jouer à votre jeu en ligne ou sur un autre appareil. </p> <p> Vous pouvez éventuellement télécharger vos images sur un autre hôte, comme Dropbox, Photobucket ou Imgur, et coller l&#39;URL ici. Les hôtes externes sont cependant moins fiables et ne sont pas recommandés. </p> <p> Lorsque vous le téléchargez sur votre Steam Cloud, TTS vous demandera de lui donner un nom de fichier. Une fois le téléchargement terminé, cliquez sur <strong> Importer </strong> . </p> <p> Avec la planche importée, vous pouvez maintenant la réduire ou l&#39;agrandir avec le <strong> - </strong> et <strong> + </strong> touches de votre clavier. Pour le verrouiller en place afin qu&#39;il ne soit pas accidentellement déplacé pendant le jeu, faites un clic droit sur le plateau, et sous <strong> Bascule </strong> , Cliquez sur <strong> Fermer à clé </strong> . </p> <h3 id=\"card-decks\"> Jeux de cartes </h3> <p> Dans le <strong> Objet personnalisé </strong> menu, cliquez sur <strong> Plate-forme </strong> . Cliquez n&#39;importe où sur la table où vous souhaitez que le jeu apparaisse, puis cliquez avec le bouton droit pour lancer l&#39;importation. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Ajustez les paramètres comme suit : </p> <ul> <li> <strong> Taper: </strong> Changez cela si vous avez une forme spécifique en tête autre qu&#39;une carte rectangulaire à coin rond ordinaire. </li> <li> <strong> Visage: </strong> Clique le <strong> Parcourir les fichiers locaux </strong> bouton et trouvez votre feuille de carte de visage. Encore une fois, nous recommandons l&#39;option Steam Cloud sur les fichiers locaux ou les hôtes externes. </li> <li> <strong> Dos uniques : </strong> Cochez cette option si votre deck aura plusieurs motifs de dos, puis téléchargez votre feuille de dos de carte dans le <strong> Dos </strong> boîte. Si vous utilisez un seul motif pour l&#39;ensemble du deck, téléchargez simplement votre arrière-plan. </li> <li> <strong> Largeur et hauteur: </strong> Ajustez ceci si vous avez utilisé un rapport différent de celui de la carte rectangulaire standard, 10x7. </li> <li> <strong> Nombre: </strong> Assurez-vous que cela correspond au nombre de cartes que vous importez. </li> <li> <strong> De côté: </strong> Cela change l&#39;orientation de la <strong> Zoom alternatif </strong> fonction dans TTS. Laissez-la décochée à moins que vous ne vouliez que la carte apparaisse sur le côté. </li> <li> <strong> Le dos est masqué : </strong> Cochez cette case si vous voulez que la vue cachée de vos cartes soit simplement le dos des cartes. </li> </ul> <p> Lorsque vos paramètres sont corrects, cliquez sur <strong> Importer </strong> . Votre deck apparaîtra sur la table et vous pourrez commencer à mélanger et à distribuer. </p> <p> Si vous voulez que vos cartes aient des noms pour faciliter le tri, faites un clic droit sur une seule carte et cliquez sur <strong> Nom </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Importation d&#39;autres éléments de jeu </h2> <p> L&#39;importation d&#39;autres objets 2D est similaire au processus d&#39;importation de tableaux. N&#39;oubliez pas que TTS a de nombreux éléments de jeu communs, comme des dés et des figurines, prêts à être utilisés dans le <strong> Objets </strong> menu. </p> <p> Si vous souhaitez utiliser des éléments 3D personnalisés, suivez <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> Guide de TTS pour l&#39;importation de modèles 3D </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Sauvegarder une partie complète </h2> <p> Après avoir organisé les composants dans un état de configuration initiale, cliquez sur le bouton <strong> Jeux </strong> bouton dans le menu du haut. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Sélectionner <strong> Sauvegarder charger </strong> et cliquez sur le <strong> Sauvegarder la partie </strong> bouton. Donnez-lui un nom et cliquez <strong> Sauvegarder </strong> . Désormais, chaque fois que vous hébergez des jeux, vous pouvez le recharger dans la configuration parfaite en accédant au <strong> Sauvegarder charger </strong> menu. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Tirer le meilleur parti des jeux de table personnalisés </h2> <p> Concevoir et jouer à des jeux personnalisés est simple dans Tabletop Simulator une fois que vous savez comment le faire. Invitez vos amis ou recherchez des testeurs prêts et disposés dans <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> la communauté TTS </a> . Maintenant, vous pouvez montrer votre jeu personnalisé aux autres ! </p>"}