{"title":"Comment effectuer un démarrage en mode minimal dans Windows 10","content":"<p> Vous avez probablement une multitude d&#39;applications tierces installées sur votre ordinateur Windows. Ne vous inquiétez pas, la plupart des gens le font. </p> <p> De l&#39;exécution de tâches de base telles que la navigation sur le Web à la distribution de lignes de code complexes, les utilisateurs préfèrent utiliser des applications alternatives à celles intégrées à Windows. Bien que ces applications nous facilitent la vie, elles interfèrent parfois avec les fonctions du système. Ceux-ci peuvent aller d&#39;incidents mineurs à des erreurs critiques et des BSOD. </p> <p> C&#39;est là que le démarrage en mode minimal entre en scène. </p> <h2 id=\"what-is-a-windows-clean-boot-anyway\"> Qu&#39;est-ce qu&#39;un démarrage minimal de Windows, de toute façon ? </h2> <p> Un démarrage minimal de Windows 10 permet aux utilisateurs d&#39;exclure les applications tierces comme étant la cause d&#39;une erreur. Cela se fait simplement en démarrant l&#39;appareil avec toutes les applications tierces désactivées. Et même si le nom sonne comme une fonctionnalité Windows intégrée, ce n&#39;est pas le cas. Vous devez nettoyer manuellement le démarrage de votre ordinateur. </p> <p> Les avantages d&#39;un démarrage en mode minimal ne se limitent pas au diagnostic des erreurs. Il est connu pour aider quand <a href=\"https://www.makeuseof.com/tag/fix-windows-update-error-0x80070057/\" target=\"_blank\" rel=\"nofollow noopener\"> Les mises à jour Windows ne s&#39;installent pas correctement </a> . C&#39;est également particulièrement utile lorsque votre système d&#39;exploitation semble lent et que vous souhaitez vérifier la cause du problème. </p> <p> </p> <p> </p> <h2 id=\"how-to-clean-boot-and-fix-errors\"> Comment nettoyer le démarrage et corriger les erreurs </h2> <p> Le démarrage en mode minimal est un processus relativement simple une fois que les utilisateurs l&#39;ont essayé plusieurs fois. </p> <p> Avant de lister les étapes, les utilisateurs doivent savoir que certaines actions nécessitent des privilèges d&#39;administrateur. Votre ordinateur peut également ne pas fonctionner comme vous en avez l&#39;habitude, mais il n&#39;est pas nécessaire de le transpirer. Cela se produit parce que parfois les utilisateurs ne sont même pas conscients que certaines tâches subalternes sont prises en charge par des logiciels tiers. </p> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-128.png\" loading=\"lazy\"> </p> <p> Voici les étapes à suivre pour nettoyer le démarrage de Windows 10 : </p> <ol> <li> Dans la barre de recherche du menu Démarrer, saisissez <strong> sysconfig </strong> et cliquez sur <strong> Configuration du système </strong> . </li> <li> Dans le <strong> Configuration du système </strong> fenêtre, allez à la <strong> Prestations de service </strong> languette. </li> <li> Vérifier la <strong> Cacher tous les services Microsoft </strong> boîte. </li> <li> Vérifiez tous les services dans la liste et cliquez sur <strong> Désactiver tous les </strong> situé en bas à droite, puis sauvegardez et quittez. </li> <li> Maintenant, ouvrez le <strong> Gestionnaire des tâches </strong> . Vous pouvez le faire en cliquant avec le bouton droit sur la barre des tâches et en sélectionnant <strong> Gestionnaire des tâches </strong> ou en utilisant <strong> Ctrl + Alt + Suppr </strong> . </li> <li> Dans le <strong> Gestionnaire des tâches </strong> fenêtre, accédez à la <strong> Commencez </strong> languette. </li> <li> Sélectionnez tous les services un par un et cliquez sur <strong> Désactiver </strong> . </li> <li> Sortir <strong> Gestionnaire des tâches </strong> et <strong> Redémarrer </strong> ton ordinateur. </li> </ol> <p> <img alt=\"Startup tab in the task manager\" src=\"images/startup-tab-task-manager-383.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"fixing-errors-with-clean-boot\"> Corriger les erreurs avec Clean Boot </h2> <p> Après avoir suivi les étapes énumérées ci-dessus, votre <a href=\"https://www.makeuseof.com/tag/clean-computer-original-state-reinstalling-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Le PC démarrera dans un état propre. </a> La première chose que les utilisateurs doivent faire est d&#39;attendre et de vérifier si la même erreur se reproduit. Parfois, la source de l&#39;erreur peut être des fichiers système Windows, auquel cas l&#39;erreur apparaîtra, mais cela peut prendre plus de temps que lors d&#39;un démarrage normal. </p> <p> Si l&#39;erreur n&#39;apparaît pas, il est temps d&#39;identifier les suspects. C&#39;est une tâche un peu fastidieuse mais, malheureusement, aussi la meilleure façon de s&#39;y prendre. Pour affiner la liste, procédez comme suit : </p> <ol> <li> Dans un état de démarrage minimal, ouvrez <strong> Configuration du système </strong> . </li> <li> Sous le <strong> Prestations de service </strong> onglet, sélectionnez la moitié supérieure de la liste et cliquez sur <strong> Activer </strong> . Assurez-vous que le <strong> Cacher tous les services Microsoft </strong> la case est cochée. </li> <li> Ouvert <strong> Gestionnaire des tâches </strong> et allez au <strong> Commencez </strong> languette. </li> <li> De même, activez la moitié supérieure des services et redémarrez votre ordinateur. </li> </ol> <p> Après le redémarrage, si l&#39;erreur n&#39;apparaît pas, vous pouvez exclure les logiciels et services sélectionnés de la liste des coupables. Vous devrez répéter ces étapes jusqu&#39;à ce que vous trouviez le programme ou le service responsable et le désinstalliez. </p> <p> </p> <h2 id=\"clean-boot-windows-10-to-isolate-errors\"> Clean Boot Windows 10 pour isoler les erreurs </h2> <p> Il est maintenant temps de redémarrer Windows 10 par défaut. Ouvrir juste <strong> Configuration du système </strong> et <strong> Gestionnaire des tâches </strong> et activer tous les services et programmes. Il est recommandé aux utilisateurs d&#39;effectuer un démarrage en mode minimal avant de recourir à des correctifs plus avancés lorsque Windows se bloque ou affiche un BSOD. </p>"}