{"title":"Comment installer un contrôleur de porte de garage intelligent","content":"<p> Vous souhaitez contrôler votre porte de garage avec votre smartphone ou votre tablette ? Un contrôleur intelligent est une excellente option si vous avez déjà installé un ouvre-porte de garage dans votre maison. </p> <p> Nous allons vous montrer comment installer un contrôleur de porte de garage intelligent. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Différences entre un ouvreur et un contrôleur </h2> <p> Il existe deux différences principales entre un ouvre-porte de garage intelligent et un contrôleur. Le premier est la taille. </p> <p> La plupart des ouvre-portes sont grands et se montent au plafond de votre garage. Ils utilisent une piste mécanique pour ouvrir et fermer la porte. Un contrôleur de porte de garage, en revanche, est une petite unité électronique qui vous permet de contrôler l&#39;ouvre-porte à l&#39;aide d&#39;une application sur un appareil intelligent. </p> <p> La deuxième distinction entre ces deux produits est le prix. Les ouvre-portes de garage peuvent coûter environ 300 $. L&#39;installation de ces ouvre-portes nécessite généralement l&#39;aide d&#39;un installateur professionnel. </p> <p> Un contrôleur, cependant, n&#39;a généralement pas besoin d&#39;une installation professionnelle. Au lieu de cela, le contrôleur fonctionne comme un ajout à votre ouvre-porte existant. </p> <p> Cela signifie que pour une fraction du prix d&#39;un nouvel ouvre-porte, vous pouvez obtenir la même fonctionnalité simplement en utilisant un contrôleur. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> Quels sont les avantages d&#39;une porte de garage intelligente ? </h2> <p> Il y a trois avantages principaux à avoir une porte de garage intelligente. </p> <ul> <li> <strong> Sécurité </strong> —Une porte de garage intelligente vous permet d&#39;ouvrir et de fermer la porte de presque n&#39;importe où. </li> <li> <strong> Sécurité </strong> —La plupart des ouvre-portes de garage et des contrôleurs intelligents vous avertissent lorsque votre garage a été ouvert pendant une durée spécifique. </li> <li> <strong> Commodité </strong> — Si vous avez déjà dû rentrer chez vous pour fermer votre porte de garage, alors avoir une application de porte de garage intelligente vous fait gagner du temps. Au lieu de rentrer chez vous, sortez simplement votre téléphone. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> Comment installer un contrôleur de porte de garage intelligent </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Si vous avez décidé qu&#39;un contrôleur de porte de garage intelligent vous convient, ce guide vous montrera comment en installer un. Dans cette démonstration, un <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meross MSG100 </a> est utilisé, mais ce processus est similaire si vous utilisez une autre marque. Consultez la documentation de votre contrôleur pour plus de détails. </p> <h3 id=\"what-you-ll-need\"> Ce dont vous aurez besoin </h3> <ul> <li> Un contrôleur de garage intelligent </li> <li> Pistolet agrafeur ou supports de fil </li> <li> Porte de garage avec ouvre-porte automatique installé </li> <li> Tournevis cruciformes et à fente </li> <li> Échelle </li> </ul> <h3 id=\"plan-the-installation\"> 1. Planifiez l&#39;installation </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Avant d&#39;installer votre contrôleur, vous devrez rechercher quelques endroits dans votre garage. Le premier est une source d&#39;alimentation pour le contrôleur. Le second est le chemin de câble entre le contrôleur et le capteur monté sur la porte inclus dans votre kit. Et le troisième est l&#39;emplacement du capteur magnétique. </p> <p> Ce capteur magnétique permet au contrôleur de savoir quand la porte est ouverte ou fermée. </p> <p> La plupart des contrôleurs utilisent une longue longueur de fil pour se connecter au capteur de porte. Vous devrez soit acheminer ce fil à travers le plafond ou le long d&#39;un mur pour garder le fil à l&#39;écart. </p> <p> Une fois que vous avez planifié votre installation, testez l&#39;ajustement du fil du capteur du contrôleur à l&#39;emplacement du capteur. Ce test d&#39;ajustement garantit que le fil de votre capteur atteint votre contrôleur. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Coupez l&#39;alimentation de votre ouvre-porte de garage </h3> <p> La plupart des portes de garage sont branchées quelque part dans le plafond. Pour ces ouvre-portes, vous devrez vous assurer qu&#39;ils sont débranchés avant de continuer. </p> <p> Si votre ouvre-porte n&#39;a pas de prise et est plutôt attaché au câblage sortant du plafond, vous devrez alors trouver votre disjoncteur et couper l&#39;alimentation de l&#39;ouvre-porte là-bas. </p> <p> <strong> Noter: </strong> Le courant domestique de 120 volts peut causer des blessures graves. Si vous n&#39;êtes pas à l&#39;aise de travailler avec l&#39;électricité, arrêtez-vous maintenant et consultez un installateur professionnel de portes de garage et/ou un électricien. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Connectez les fils inclus au contrôleur </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> Sur l&#39;unité Meross, il y a un ensemble de fils bleu et marron qui doivent être installés dans le contrôleur pour se connecter à l&#39;ouvre-porte de garage. Ouvrez le couvercle en plastique du contrôleur et vous devriez voir deux bornes à vis. </p> <p> À l&#39;aide d&#39;un petit tournevis plat, desserrez les vis de chaque borne. Insérez vos fils et serrez les vis. Peu importe quel fil va où. </p> <p> Tirez doucement sur les fils pour vous assurer qu&#39;ils sont bien fixés. Replacez ensuite le couvercle du contrôleur. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Montez le contrôleur de porte de garage </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Puisque vous avez planifié vos emplacements, il est maintenant temps de monter votre contrôleur. Assurez-vous que le contrôleur est dans un endroit où il peut accéder à l&#39;alimentation dont il a besoin sans exercer de contrainte sur le câblage. </p> <p> Ensuite, retirez le support collant du contrôleur et appuyez dessus pour le mettre en place. Si vous avez un contrôleur avec un support à vis, utilisez le tournevis pour fixer le contrôleur en position. </p> <h3 id=\"mount-the-sensor\"> 5. Montez le capteur </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> Ensuite, vous devrez monter le capteur pour la porte. Il est recommandé de placer ce capteur là où il n&#39;obstrue pas le passage de la porte. </p> <p> De plus, vous pourriez être tenté de monter le capteur près du sol. Ce n&#39;est pas recommandé, car des éclaboussures répétées d&#39;eau directement sur le capteur peuvent l&#39;endommager. Une fois que vous avez positionné le capteur, utilisez le ruban adhésif double face ou les vis fournis pour le fixer. </p> <p> Sur la photo ci-dessus, le capteur noir a été monté à côté de la porte de garage avec la partie aimantée montée sur la porte elle-même. Ce capteur utilise du ruban adhésif double face pour le montage. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Connectez les fils du capteur </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Il est maintenant temps de connecter les fils au capteur et au contrôleur. En utilisant le plan que vous avez fait à la première étape, acheminez vos fils et utilisez l&#39;agrafeuse pour fixer les fils au mur ou au plafond. </p> <p> Assurez-vous de ne pas pincer ou plier les fils car cela pourrait les endommager. Lorsqu&#39;ils sont acheminés, connectez le connecteur bout à bout femelle rouge du contrôleur au connecteur bout à bout mâle rouge à l&#39;extrémité du fil du capteur. </p> <p> Ensuite, vous devrez ouvrir le couvercle de votre ouvre-porte de garage. Il devrait y avoir quatre fils présents, deux de contrôle d&#39;alimentation et communs à l&#39;unité, et deux de contrôle du bouton sur le mur. </p> <p> </p> <p> Habituellement, ces fils proviennent du plafond et devraient avoir des cosses à cosses serties les fixant à l&#39;unité d&#39;ouvre-porte de garage. Si vous ne pouvez pas déterminer quels fils sont lesquels, arrêtez-vous et consultez le manuel du propriétaire de votre ouvre-porte de garage ou consultez un électricien certifié. </p> <p> Si vous avez trouvé les fils, connectez les fils marron et bleu du contrôleur aux bornes de l&#39;ouvre-porte qui sont connectées au bouton mural. Sur la photo ci-dessus, les fils du contrôleur ont été insérés dans les deux bornes les plus à gauche. </p> <p> Lorsque vous avez terminé, il devrait y avoir deux fils attachés à chaque borne de bouton mural. Refixez le couvercle de votre ouvre-porte de garage, branchez le contrôleur et l&#39;ouvre-porte, et l&#39;installation devrait être terminée. </p> <p> À l&#39;étape suivante, vous connecterez le contrôleur à un réseau sans fil. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Connectez le contrôleur au Wi-Fi </h3> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (3 images) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Développer <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Développer <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> Pour configurer la connectivité Wi-Fi, nous avons utilisé l&#39;application Meross. Il est disponible pour <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> et <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . Ce processus consiste presque toujours à ouvrir l&#39;application, à identifier votre produit, à connecter l&#39;application à votre réseau Wi-Fi, à ouvrir l&#39;écran Paramètres et à autoriser le contrôleur à accéder à votre réseau. </p> <p> Ici, ouvrez l&#39;application, puis appuyez sur <strong> Ouvre-porte de garage intelligent </strong> et alors <strong> Démarrer </strong> . Sélectionnez le fabricant et le modèle de l&#39;ouvre-porte de garage que vous utilisez avec le contrôleur. Assurez-vous de suivre les instructions spécifiques à votre application. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Définir l&#39;intervalle de temps d&#39;ouverture/fermeture </h3> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (3 images) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Développer <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Développer <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> Une chose qu&#39;il est important de régler avant de tester votre nouveau contrôleur est la synchronisation de l&#39;ouvre-porte de garage. Dans l&#39;application Meross, vous pouvez sélectionner entre 10 secondes et 40 secondes à des intervalles de cinq secondes, ou vous pouvez ajouter un paramètre personnalisé pour les portes qui prennent un nombre pair de secondes pour se fermer. </p> <p> Il est facile de régler le moment de votre porte, mais vous devez le faire correctement. Un intervalle trop court laissera la porte partiellement ouverte, et un réglage trop long peut causer une contrainte excessive sur le moteur de l&#39;ouvre-porte de garage. </p> <p> Pour régler l&#39;intervalle, vous aurez besoin d&#39;une montre avec une trotteuse ou une fonction chronomètre. Vous pouvez également utiliser la minuterie intégrée de votre téléphone. Préparez votre minuterie et placez-vous près du bouton de votre ouvre-porte de garage. Appuyez ensuite sur le bouton en même temps que vous appuyez sur start sur votre chronomètre, ou notez l&#39;heure sur la trotteuse. </p> <p> Attendez que votre porte de garage s&#39;arrête de bouger et enregistrez l&#39;heure. Ceci est votre intervalle. Transférez ces informations dans l&#39;application et le réglage de l&#39;intervalle est terminé. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Testez le contrôleur de porte de garage </h3> <p> À l&#39;aide de votre application, ouvrez et fermez la porte plusieurs fois pour vous assurer que tout fonctionne. Vous devriez maintenant pouvoir utiliser le bouton mural ou l&#39;application pour ouvrir votre porte de garage. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Profitez de votre contrôleur de porte de garage intelligent </h2> <p> Apporter votre technologie de maison intelligente à une porte de garage ne doit pas coûter une fortune. </p> <p> L&#39;installation d&#39;un nouveau contrôleur de porte de garage intelligent vous offre, à vous et à votre famille, plus de flexibilité, de sécurité et de commodité pour votre maison. Il offre également la tranquillité d&#39;esprit de savoir que votre porte de garage peut être contrôlée de presque n&#39;importe où. </p>"}