{"title":"Comment les meilleurs services de messagerie instantanée utilisent le chiffrement de bout en bout","content":"<p> Les données personnelles sont plus importantes que jamais. Les gouvernements, les entreprises et les cybercriminels ont soif de données personnelles pour servir leurs intérêts. Différentes plateformes en ligne ont facilité la divulgation de données personnelles à notre insu. </p> <p> Pour cette raison, il est important de bien comprendre comment les plateformes que vous utilisez en ligne protègent votre vie privée. L&#39;un des facteurs clés à prendre en compte lors de l&#39;examen des mesures de protection des applications de messagerie est le chiffrement de bout en bout. </p> <p> Reconnaissant la nécessité de donner la priorité à la confidentialité des données, de plus en plus d&#39;applications de messagerie ont pris des mesures importantes pour mettre en œuvre le chiffrement de bout en bout. </p> <h2 id=\"what-is-end-to-end-encryption\"> Qu&#39;est-ce que le chiffrement de bout en bout ? </h2> <p> </p> <p> Le chiffrement de bout en bout est <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> une méthode de cryptage des communications </a> afin que les tiers ne puissent pas accéder aux informations partagées entre les personnes qui s&#39;échangent des messages. </p> <p> Avec le cryptage de bout en bout, un code secret, plutôt qu&#39;un texte brut, est utilisé pour dissimuler le contenu des messages. Cela signifie que seuls ceux qui communiquent sur une plate-forme cryptée de bout en bout peuvent lire les messages envoyés entre eux. </p> <p> Voyons comment trois services de messagerie sécurisés populaires, Signal, WhatsApp et Telegram, utilisent le cryptage de bout en bout. </p> <p> </p> <h2 id=\"signal\"> Signal </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signal est considéré comme l&#39;une des applications de messagerie les plus sécurisées. Toutes les communications sur la plate-forme sont cryptées de bout en bout par défaut. </p> <p> Signal ne sauvegarde pas les messages sur le cloud, ce qui réduit les risques que de mauvais acteurs utilisent des méthodes alternatives pour acquérir des informations. Il crypte également les métadonnées des messages afin que l&#39;emplacement et l&#39;heure des activités de messagerie ne soient pas suivis. </p> <p> Avec un moteur de chiffrement open source, le public bénéficie de niveaux plus élevés de transparence sur la technologie derrière ses activités de messagerie. Les utilisateurs peuvent regarder de plus près les détails techniques pour mieux comprendre les méthodes utilisées pour protéger leur vie privée. </p> <p> Les plates-formes open source peuvent rendre les logiciels beaucoup plus faciles et sécurisés à utiliser à long terme. Non seulement les gens peuvent mieux comprendre le fonctionnement du logiciel, mais ils peuvent également essayer de configurer leur propre version de l&#39;application, qui pourrait être plus adaptée à leurs besoins de sécurité uniques. </p> <p> Signal utilise une combinaison d&#39;OTR, appelée Messagerie Off-the-Record multi-parties, qui permet de chiffrer de bout en bout les messages dans les discussions de groupe. Les risques de violations de données peuvent augmenter à mesure que le nombre de participants à un réseau augmente. Avec le chat de groupe crypté de bout en bout, ces risques sont considérablement réduits. </p> <p> </p> <h2 id=\"whatsapp\"> WhatsApp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp a été l&#39;une des premières applications de messagerie populaires à permettre le cryptage de bout en bout. Il utilise un cryptage de bout en bout pour les messages et les appels. </p> <p> WhatsApp utilise le protocole de cryptage de bout en bout développé par Open Whisper Systems, l&#39;équipe derrière Signal Messenger. C&#39;est un atout majeur pour l&#39;application, compte tenu de la sécurité du protocole de cryptage de Signal. </p> <p> </p> <p> L&#39;utilisation par WhatsApp de son propre déploiement propriétaire signifie qu&#39;il peut ne pas être examiné aussi fréquemment par un large éventail de chercheurs en sécurité que le logiciel entièrement open source de Signal. </p> <p> Malgré le cryptage des messages, d&#39;autres moyens pourraient être utilisés pour en savoir plus sur les messages envoyés sur WhatsApp, car les messages peuvent être sauvegardés sur le cloud et les métadonnées de l&#39;application ne sont pas cryptées. Cela permet de connaître plus facilement l&#39;heure et l&#39;emplacement des messages. De plus, des rapports ont fait surface sur des discussions de groupe WhatsApp indexées sur la recherche Google remettant en question la sécurité de ses discussions de groupe. </p> <p> </p> <h2 id=\"telegram\"> Télégramme </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegram est apprécié pour son utilisation du cryptage et ses messages autodestructeurs. Malheureusement, il existe plusieurs problèmes de cryptage de bout en bout avec Telegram qui peuvent ne pas sembler si évidents pour de nombreux utilisateurs. </p> <p> Sur Telegram, le cryptage de bout en bout n&#39;est pas activé par défaut. Il n&#39;est proposé que lorsque les utilisateurs passent à des discussions secrètes. Pour les utilisateurs qui ne sont pas enclins à la technique, cela présente des risques de sécurité dont ils ne sont peut-être même pas conscients. </p> <p> Telegram peut accéder aux messages stockés sur ses serveurs qui sont sauvegardés sur son cloud. Certains pensent que cela présente des vecteurs d&#39;attaque supplémentaires qui pourraient conduire à des violations de données personnelles dans les cas où les cybercriminels tentent de voler les données de messagerie de l&#39;application. </p> <p> Cela étant dit, toutes les discussions secrètes dans Telegram sont spécifiques à l&#39;appareil, ce qui signifie que les messages que vous envoyez via des discussions secrètes ne sont accessibles qu&#39;à partir de l&#39;appareil à partir duquel ils ont été envoyés. </p> <p> Alors que les discussions secrètes de Telegram sont cryptées de bout en bout, les discussions de groupe ne le sont pas. Cela signifie que les utilisateurs peuvent utiliser plusieurs appareils pour la même discussion de groupe. Les journaux de discussion peuvent être téléchargés sur plusieurs appareils par les utilisateurs. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Chats secrets activés <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #Télégramme </a> signifie que vos messages sont protégés par un cryptage de bout en bout et sont supprimés après un certain temps. <br><br> Voici comment activer cette fonctionnalité. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> - Kaspersky (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 31 janvier 2021 </a></blockquote>  <p> Telegram crée des aperçus de liens sur ses serveurs distants à partir de discussions normales et secrètes. Lorsqu&#39;un utilisateur tape un lien pour la première fois dans une conversation secrète, l&#39;application l&#39;avertit que les liens seront envoyés à des serveurs distants. Ceci est considéré comme une faiblesse de sécurité car l&#39;envoi de liens partagés dans un chat privé vers un serveur distant va à l&#39;encontre de l&#39;objectif du cryptage de bout en bout. </p> <p> Le protocole de cryptage de Telegram, MTProto, est conçu pour accéder à une API de serveur à partir d&#39;applications sur mobile. Il est propriétaire et partiellement open source. Cela remet en question le contrôle et la compréhension du public sur les méthodes de cryptage utilisées pour protéger leurs messages. </p> <p> Heureusement, l&#39;application de messagerie n&#39;a pas fait l&#39;objet de réclamations sérieuses concernant des violations de données, mais il est préoccupant de savoir qu&#39;il est possible pour ses opérateurs d&#39;accéder à vos messages. </p> <p> Malgré les inquiétudes, beaucoup peuvent être rassurés par les divers obstacles juridiques à franchir pour accéder aux messages. Telegram a clairement indiqué dans le passé à quel point il est difficile pour les gens d&#39;accéder aux messages sur sa plate-forme. Les clés devraient être accessibles à partir de différentes juridictions, ce qui frustrerait de nombreuses personnes. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> Choisir l&#39;application de messagerie la plus sécurisée </h2> <p> Bien que Signal ne soit peut-être pas aussi populaire que WhatsApp, son protocole a largement contribué au succès de WhatsApp avec le cryptage de bout en bout. Bien que ses méthodes de cryptage de bout en bout soient similaires à WhatsApp, il est considéré comme meilleur que WhatsApp pour le cryptage de bout en bout. Il se distingue en prenant des mesures supplémentaires pour protéger les utilisateurs. </p> <p> La décision de Telegram de ne pas donner la priorité au cryptage de bout en bout a été attribuée à sa préférence pour la commodité. Là où il manque de cryptage, il compense, avec ses méthodes indirectes de protection des utilisateurs avec le cryptage cloud et le stockage des clés dans différentes juridictions juridiques. </p>"}