{"title":"Comment réparer l&#39;utilisation élevée du processeur par l&#39;exécutable du service Antimalware sur Windows 10","content":"<p> Si votre ordinateur semble lent ou ne répond pas, il est préférable de vérifier si un processus consomme de la mémoire et du processeur. Il est probable que le processus soit l&#39;exécutable du service Antimalware. Ce problème courant survient lorsque Windows Defender n&#39;a pas été configuré correctement ou qu&#39;un logiciel malveillant sur votre système interfère avec son fonctionnement. </p> <p> Voici comment corriger le bogue d&#39;utilisation élevée du processeur d&#39;Antimalware Service Executable sur Windows 10. </p> <h2 id=\"optimize-windows-defender-scheduling-options\"> 1. Optimiser les options de planification de Windows Defender </h2> <p> L&#39;exécutable du service Antimalware entraîne une utilisation élevée du processeur lorsqu&#39;il est programmé pour exécuter une analyse complète de votre système à intervalles réguliers. Il est préférable de reprogrammer ces analyses à un moment où vous êtes moins susceptible de tenter des tâches gourmandes en CPU, ou peut-être même d&#39;utiliser votre ordinateur du tout. </p> <p> Voici comment modifier la planification de Windows Defender : </p> <ol> <li> Dans la barre de recherche du menu Démarrer, tapez &quot;planificateur de tâches&quot; et cliquez sur <strong> Planificateur de tâches </strong> . </li> <li> Dans le volet de navigation de gauche, accédez à <strong> Bibliothèque du Planificateur de tâches &gt; Microsoft &gt; Windows &gt; Windows Defender </strong> . Vous pouvez le faire en développant chacune des bibliothèques susmentionnées. </li> <li> Dans le <strong> Windows Defender </strong> bibliothèque, double-cliquez sur <strong> Scan programmé de Windows Defender </strong> dans le volet du milieu. </li> <li> Sous le <strong> Conditions </strong> onglet, décochez toutes les options et cliquez sur OK. Cela supprime toutes les analyses planifiées. </li> </ol> <p> <img alt=\"Windows Defender Scheduled scan entry in Task Scheduler\" src=\"images/windows-defender-scheduled-scans-807.jpg\" loading=\"lazy\"> </p> <h3 id=\"create-new-scheduled-scans\"> Créer de nouveaux scans programmés </h3> <p> Les utilisateurs doivent créer de nouvelles analyses planifiées afin que leur ordinateur reste protégé. Il est préférable de le personnaliser selon vos besoins. Vous pouvez les planifier à des moments où vous savez que vous ne ferez pas de tâches lourdes pour le processeur. Mais la fréquence doit être au moins une fois par semaine. </p> <p> Pour créer une nouvelle planification Windows Defender, procédez comme suit : </p> <ol> <li> Ouvert <strong> Planificateur de tâches </strong> et encore une fois naviguez vers <strong> Bibliothèque du Planificateur de tâches &gt; Microsoft &gt; Windows &gt; Windows Defender </strong> </li> <li> Double-cliquez <strong> Windows Defender programmé </strong><strong> Analyse </strong> . </li> <li> Sous le <strong> Déclencheurs </strong> onglet, cliquez sur <strong> Nouveau </strong> . </li> <li> Ici, vous pouvez choisir la fréquence d&#39;exécution de l&#39;analyse. </li> <li> Appliquez les paramètres et quittez. </li> </ol> <p> <img alt=\"Adding a new trigger toWindows Defender Scheduled scan using Task Scheduler\" src=\"images/new-trigger-defender-513.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-windows-defender-to-its-own-exclusion-list\"> 2. Ajouter Windows Defender à sa propre liste d&#39;exclusion </h2> <p> Lors d&#39;une analyse complète du système, Windows Defender parcourt chaque fichier de votre système. Cela s&#39;inclut lui-même, ce qui peut entraîner certains problèmes, le plus souvent des performances système lentes. Les utilisateurs peuvent empêcher cela en ajoutant l&#39;exécutable du service Antimalware à la liste d&#39;exclusion de Windows Defender. </p> <p> Cela peut être fait en suivant ces étapes : </p> <ol> <li> presse <strong> CTRL + Maj + ÉCHAP </strong> pour lancer le <strong> Gestionnaire des tâches </strong> . </li> <li> Sous le <strong> Processus </strong> onglet rechercher <strong> Exécutable du service anti-programme malveillant. </strong> Faites un clic droit dessus et sélectionnez <strong> Lieu de fichier ouvert </strong> . </li> <li> Dans la barre d&#39;adresse située en haut dans l&#39;explorateur Windows, copiez le chemin du fichier (CTRL + C). </li> <li> Dans la barre de recherche du menu Démarrer, saisissez &quot;Sécurité Windows&quot; et ouvrez l&#39;application. Il a une icône de bouclier bleu. </li> <li> Cliquer sur <strong> Protection contre les virus et les menaces </strong> puis cliquez sur <b> Gérer les paramètres </b> . </li> <li> Faites défiler jusqu&#39;à ce que vous trouviez <strong> Exclusions </strong> puis cliquez sur <strong> Ajouter ou supprimer des exclusions </strong> . </li> <li> Cliquer sur <strong> Ajouter une exclusion </strong> puis cliquez sur Fichier. </li> <li> Dans la barre d&#39;adresse de la fenêtre Explorateur de fichiers, collez le chemin que vous aviez copié précédemment (CTRL + V). </li> <li> Chercher <strong> MsMpEng.exe </strong> et cliquez sur Ouvrir. </li> <li> Le fichier sera désormais exclu de toutes les futures analyses de Windows Defender. </li> </ol> <p> <img alt=\"Adding an entry to windows defender exclusion list\" src=\"images/windows-defender-exclusion-add-843.jpg\" loading=\"lazy\"> </p> <p> </p> <p> </p> <h2 id=\"repair-corrupt-windows-defender-files-using-sfc\"> 3. Réparez les fichiers Windows Defender corrompus à l&#39;aide de SFC </h2> <p> SFC est un utilitaire Windows intégré qui analyse et répare automatiquement tous les fichiers système endommagés. C&#39;est ce qui aidera à réparer les fichiers Windows Defender corrompus. </p> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-224.jpg\" loading=\"lazy\"> </p> <p> Pour l&#39;utiliser, procédez comme suit : </p> <ol> <li> Dans la barre de recherche du menu Démarrer, tapez <strong> cmd </strong> et ouvrir <strong> Invite de commandes </strong> . </li> <li> Dans la console, tapez <strong> sfc/scannow </strong> et appuyez sur Entrée. </li> <li> Windows prendra un certain temps pour analyser et réparer les fichiers système corrompus, y compris ceux de Windows Defender. </li> </ol> <p> </p> <h2 id=\"disable-windows-defender\"> 4. Désactiver Windows Defender </h2> <p> Lorsque tout le reste échoue, il est temps de désactiver complètement Windows Defender. Avant de le faire, assurez-vous de <a href=\"https://www.makeuseof.com/tag/best-antivirus-for-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> télécharger et installer un logiciel antivirus tiers </a> pour protéger votre ordinateur. </p> <p> Pour désactiver Windows Defender, procédez comme suit : </p> <ol> <li> Dans la barre de recherche du menu Démarrer, tapez Sécurité Windows et ouvrez-le. </li> <li> Sur le tableau de bord, cliquez sur <strong> Protection contre les virus et les menaces </strong> puis cliquez sur <strong> Gérer les paramètres </strong> . </li> <li> Changer <strong> Protection en temps réel </strong> à Off. </li> <li> Quittez et redémarrez votre ordinateur. </li> </ol> <p> <img alt=\"Disable Windows Defender Protection Temporarily\" src=\"images/disable-windows-defender-protection-temporarily-744.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-clean-boot-to-check-whether-a-third-party-app-may-be-responsible\"> 5. Utilisez un démarrage en mode minimal pour vérifier si une application tierce peut être      responsable </h2> <p> Parfois, des applications tierces peuvent interférer avec les processus système. Il est également possible que le logiciel tiers soit mal interprété comme un logiciel malveillant. Pour exclure les applications tierces comme cause du problème, les utilisateurs doivent effectuer un démarrage en mode minimal. </p> <p> Voici les étapes à suivre : </p> <ol> <li> presse <strong> Touche Windows + R </strong> pour ouvrir la commande Exécuter. Taper <strong> msconfig </strong> et appuyez sur Entrée. </li> <li> Dans le <strong> Configuration du système </strong> fenêtre, allez à <strong> </strong><strong> Prestations de service </strong> . </li> <li> Vérifier la <strong> Cacher tous les services Microsoft </strong> option. Ensuite, vérifiez tous les services de la liste. </li> <li> Cliquer sur <strong> Désactiver tous les </strong> . </li> <li> Sauvegarder et quitter. </li> <li> Ouvert <strong> Gestionnaire des tâches </strong> en appuyant <strong> CTRL + Maj + ÉCHAP </strong> . </li> <li> Sous le <strong> Commencez </strong> onglet, cliquez sur chaque service un par un et cliquez sur <strong> Désactiver </strong> . </li> <li> Quittez et redémarrez votre ordinateur. </li> </ol> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-853.png\" loading=\"lazy\"> </p> <p> L&#39;ordinateur va maintenant démarrer avec toutes les applications tierces désactivées. Les utilisateurs doivent vérifier s&#39;ils ont toujours le problème et s&#39;ils ne le sont pas, il est préférable de désinstaller toutes les applications récemment installées car elles sont les coupables. </p> <p> </p> <h2 id=\"check-for-malware-using-third-party-antivirus\"> 6. Recherchez les logiciels malveillants à l&#39;aide d&#39;un antivirus tiers </h2> <p> Il existe des virus qui affectent directement Windows Defender et ils peuvent soit perturber son fonctionnement, soit le désactiver complètement. Dans de tels cas, la seule solution consiste à analyser l&#39;ordinateur à l&#39;aide d&#39;un logiciel antivirus tiers. </p> <p> Mais d&#39;abord, afin de vous assurer que Windows Defender a bien été infecté, vérifiez et voyez si la protection en temps réel est désactivée automatiquement. N&#39;oubliez pas que vous devez toujours vous assurer que <a href=\"https://www.makeuseof.com/easy-ways-boost-security-microsoft-defender-and-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows Defender fonctionne à son plein potentiel. </a> </p> <p> Dans certains cas, les utilisateurs ont signalé qu&#39;ils ne pouvaient pas supprimer les fichiers infectés (détectés par Windows Defender lui-même) à l&#39;aide de Windows Defender. </p> <p> <img alt=\"Windows Defender dashboard displaying current threats\" src=\"images/current-threats-windows-defender-707.jpg\" loading=\"lazy\"> </p> <p> Pour vérifier ce problème, suivez simplement ces étapes : </p> <ol> <li> Dans la barre de recherche du menu Démarrer, tapez <strong> Sécurité Windows </strong> et lancez l&#39;application. </li> <li> Sur le tableau de bord, cliquez sur <strong> Protection contre les virus et les menaces </strong> . </li> <li> En dessous de <strong> Menaces actuelles, </strong> cliquer sur <strong> protection </strong><strong> l&#39;histoire </strong> . </li> <li> En dessous de <strong> Menaces en quarantaine </strong> , cliquer sur <strong> Voir l&#39;historique complet </strong> . </li> <li> Cliquez maintenant sur n&#39;importe quelle menace de la liste et sélectionnez <strong> Supprimer </strong> . </li> <li> Si Windows Defender supprime le fichier, tout fonctionne bien, mais s&#39;il est incapable de supprimer le fichier ou s&#39;il y a une animation d&#39;attente infinie, Windows Defender a été infecté. </li> </ol> <p> </p> <p> </p> <h2 id=\"fixing-the-antimalware-service-executable-high-cpu-usage-bug\"> Correction du bogue d&#39;utilisation élevée du processeur de l&#39;exécutable du service Antimalware </h2> <p> L&#39;utilisation des conseils ci-dessus améliorera les performances et la réactivité de votre ordinateur. Assurez-vous simplement que votre ordinateur ne reste jamais sans protection contre les logiciels malveillants. Il est recommandé de télécharger un autre logiciel antivirus avant de désactiver Windows Defender. </p>"}