{"title":"Comment créer ou modifier un motif dans Adobe Illustrator","content":"<p> Créez un motif dans Adobe Illustrator et vous pouvez l&#39;appliquer rapidement à des formes, des traits et même du texte. Vous pouvez faire quelque chose de simple, comme un motif de points, ou faire quelque chose de plus complexe. Vous pouvez même utiliser une partie d&#39;un graphique vectoriel existant et le transformer également en motif. </p> <p> Les motifs sont parfaits pour les arrière-plans, les textures et plus encore. Voici comment utiliser les outils de motifs d&#39;Illustrator et comment créer et modifier vos propres motifs. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Utilisation des motifs par défaut dans Adobe Illustrator </h2> <p> Illustrator est livré avec plusieurs modèles intégrés. En plus d&#39;être utiles en soi, ils sont également un bon moyen de voir comment fonctionnent les modèles. Ces modèles vous donneront également une idée de la façon d&#39;utiliser vos propres modèles une fois que vous les aurez créés. </p> <p> </p> <p> Vous pouvez trouver des motifs dans votre fenêtre Swatches. S&#39;il n&#39;est pas déjà ouvert, rendez-vous sur <strong> Fenêtre &gt; Nuancier </strong> du menu du haut. En plus des couleurs unies, il se peut qu&#39;il y ait déjà des motifs dans votre fenêtre Nuancier, mais ce ne sont pas les seuls motifs d&#39;Illustrator. </p> <p> Clique le <strong> Bibliothèque d&#39;échantillons </strong> en bas à gauche de votre fenêtre Swatch. Survolez <strong> Schéma </strong> , puis choisissez l&#39;une des bibliothèques de nuances de motifs. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Vous pouvez maintenant appliquer ces échantillons comme vous le feriez avec des couleurs unies. Ici, vous pouvez voir les modèles de la <strong> Nature_Feuillage </strong> bibliothèque appliquée sous forme de remplissages et de traits, ainsi qu&#39;au texte. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> Comment faire un motif répétitif de base dans Illustrator </h2> <p> Vous pouvez transformer n&#39;importe quel vecteur en motif, que ce soit quelque chose que vous avez déjà conçu ou quelque chose que vous créez avec cette intention spécifique en tête. Vous pouvez le faire avec un graphique vectoriel entier, un seul calque ou n&#39;importe quoi entre les deux. </p> <p> Tout ce que vous avez à faire est de sélectionner ce que vous souhaitez transformer en motif, puis de le faire glisser dans la fenêtre Nuancier. Par exemple, vous pouvez faire glisser cet œil de chat dans vos échantillons. Cela créerait un échantillon de motif, que vous pourriez ensuite utiliser pour remplir un rectangle ou toute autre forme. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> Alternativement, vous pouvez faire la même chose avec le vecteur entier. Dans les deux cas, Illustrator créera un motif à partir de tout ce que vous faites glisser dans la fenêtre Nuancier. Vous pouvez simplement appliquer l&#39;échantillon comme vous le feriez avec n&#39;importe quel échantillon de couleur normal. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Si vous double-cliquez sur votre échantillon de motif dans la fenêtre Échantillons, cela ouvrira le <strong> Options de motif </strong> la fenêtre. Vous pouvez également l&#39;ouvrir directement depuis <strong> Fenêtres &gt; Options de motif </strong> dans le menu du haut. </p> <p> Ici, vous pouvez éditer davantage votre motif, y compris la façon dont il se répète et la taille des écarts entre chaque itération de votre image. Vous modifiez également votre conception de modèle directement ici. La version de l&#39;image qui n&#39;est pas grisée peut être modifiée normalement. Vous pouvez modifier les couleurs, déplacer les calques, etc. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> Il y a plusieurs choses que vous pouvez faire avec la fenêtre Pattern Options. Vous pouvez, par exemple, répéter votre image dans une disposition en briques décalées et réduire l&#39;écart entre chaque partie du motif. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> Rapprochez suffisamment les parties de votre motif et vous pouvez les faire se chevaucher. Ce faisant, vous pouvez créer une sorte de motif en mosaïque comme celui illustré ci-dessous. Essayez tous les différents paramètres de chevauchement dans les options de motif pour trouver quelque chose qui vous convient. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> Comment créer un motif sans couture dans Adobe Illustrator </h2> <p> Si vous souhaitez créer un motif géométrique homogène, vous devez vous assurer qu&#39;il y a une symétrie dans votre conception. Par exemple, une ligne qui commence à 10px sur le côté gauche de votre motif doit se terminer à 10px sur le côté droit. Lorsqu&#39;il se répète, ces points devront se rejoindre. </p> <p> Pour ce faire, créez un nouveau document aux dimensions carrées. Activez la superposition de grille en appuyant sur <strong> Ctrl + &quot; </strong> ( <strong> Cmd + &quot; </strong> sur Mac). Les guides intelligents sont également utiles : activez-les avec <strong> Ctrl + U </strong> ( <strong> Cmd + U </strong> sur Mac). Si vos règles ne sont pas visibles, appuyez sur <strong> Ctrl + R </strong> ( <strong> Cmd + R </strong> sur Mac) pour les activer. </p> <p> Vous pouvez également trouver ces paramètres sous <strong> Vue </strong> dans le menu du haut, mais nous vous recommandons d&#39;utiliser <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Les touches de raccourci d&#39;Illustrator </a> où vous pouvez gagner du temps. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Disposez votre dessin dans le carré. Toutes les pièces qui dépassent les bords devront être alignées de l&#39;autre côté. le <strong> Aligner </strong> outil ( <strong> Fenêtre &gt; Aligner </strong> ) peut vous aider à bien aligner les choses les unes sur les autres. Cliquez et faites glisser depuis les règles pour créer vos propres guides là où vous en avez besoin. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> Il est également important d&#39;avoir une couleur de fond, même si elle est blanche. Assurez-vous que cela s&#39;adapte parfaitement aux bords du plan de travail car vous en avez besoin pour couper le matériau superflu. </p> <p> Sélectionnez tout avec <strong> Ctrl + A </strong> ( <strong> Cmd + A </strong> sur Mac), puis appuyez sur <strong> Maj + M </strong> pour activer le <strong> Générateur de formes </strong> outil. Cela peut également être trouvé dans la boîte à outils. Maintenez enfoncé <strong> Alt </strong> ( <strong> Option </strong> sur Mac). Cela met le <strong> Générateur de formes </strong> l&#39;outil en mode soustraction. </p> <p> Lorsque vous survolez des parties de votre conception avec cet outil, vous devriez les voir changer légèrement de couleur. Cliquez sur les zones que vous ne voulez pas et Illustrator supprimera ces parties, ne laissant que les bits qui se chevauchent avec le carré d&#39;arrière-plan. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> Une fois cela fait, sélectionnez tout et faites-le glisser dans vos échantillons pour le transformer en motif. Pour utiliser votre modèle dans un nouveau document, vous pouvez l&#39;enregistrer dans une bibliothèque de nuances ou utiliser votre bibliothèque Adobe Cloud. </p> <p> Alternativement, vous pouvez également le copier à partir de cette fenêtre Swatch et le coller dans une autre fenêtre Swatch sur un autre document. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Vous pouvez maintenant appliquer ce modèle comme vous le feriez avec n&#39;importe quel autre. Si vous l&#39;avez bien fait, tout devrait s&#39;aligner sans lacunes. Faites des ajustements dans votre document de modèle si vous en avez besoin. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> Quand devez-vous utiliser des motifs dans Adobe Illustrator ? </h2> <p> L&#39;utilisation la plus évidente des motifs est de créer des carreaux reproductibles pour les arrière-plans, mais vous pouvez également les utiliser pour remplir des formes afin de leur donner de la texture. Le texte rempli de motifs est une autre bonne utilisation et peut faire ressortir votre typographie. </p> <p> Si vous le souhaitez, vous pouvez même créer vos propres motifs manuellement, en copiant et collant la même image encore et encore. Il peut y avoir des occasions où vous voudrez le faire, mais la plupart du temps, la capacité d&#39;Illustrator à automatiser la création de motifs sera la solution. </p> <p> Ce n&#39;est qu&#39;une des nombreuses façons dont Illustrator peut vous faciliter la vie, en vous donnant plus de temps pour travailler sur vos créations. </p>"}