{"title":"Comment créer et vendre des préréglages Lightroom : le guide ultime","content":"<p> De nos jours, l&#39;édition de photos est tout aussi importante que la photo que vous capturez. Et l&#39;une des plateformes les plus populaires pour effectuer la post-production est Adobe Lightroom. </p> <p> De nombreux photographes économisent des heures lors du traitement des photos en créant des préréglages. Mais au-delà de vous permettre d&#39;éditer des photos plus rapidement, vous pouvez également partager vos préréglages avec d&#39;autres et potentiellement être payé pour le faire ! </p> <p> Dans cet article, vous apprendrez à créer des préréglages avec Lightroom et à les vendre en ligne. Vous découvrirez également les meilleurs conseils pour promouvoir votre art. </p> <h2 id=\"what-is-a-lightroom-preset\"> Qu&#39;est-ce qu&#39;un préréglage Lightroom ? </h2> <p> Un préréglage Lightroom est un masque qui modifie l&#39;apparence de votre photo sans que vous ayez à modifier tous les différents boutons de l&#39;application. L&#39;ajout à une photo ne prend que quelques secondes et est idéal lorsque vous recherchez un aspect et une sensation spécifiques. </p> <p> Adobe propose une variété de préréglages prêts à l&#39;emploi dans les applications Lightroom Classic et Creative Cloud. Certains d&#39;entre eux fonctionnent très bien pour les photos, mais vous constaterez que beaucoup ne sont pas bien adaptés à votre style unique. </p> <p> Pour résoudre ce problème, Adobe permet également aux utilisateurs de créer leurs propres préréglages. Vous pouvez ensuite l&#39;ajouter à toutes vos futures images pour créer une ambiance similaire ou un thème cohérent. </p> <p> </p> <h2 id=\"how-to-create-a-lightroom-preset\"> Comment créer un préréglage Lightroom </h2> <p> La création d&#39;un préréglage Lightroom est simple. Vous trouverez ci-dessous une procédure pas à pas expliquant comment procéder : </p> <ol> <li> Ouvrez l&#39;application Lightroom Classic ou Creative Cloud, selon vos préférences. </li> <li> Importez vos images dans Lightroom et apportez les modifications que vous jugez nécessaires. </li> <li> Allez au <strong> Préconfigurations </strong> onglet en bas de votre écran. </li> <li> Cliquez sur les trois points en haut à droite. Ensuite, appuyez sur <strong> Créer un préréglage </strong> . </li> <li> Donnez un nom à votre préréglage et appuyez sur <strong> Sauvegarder </strong> . </li> </ol> <p> <img alt=\"save a preset in adobe lightroom\" src=\"images/save-preset-screenshot-132.png\" loading=\"lazy\"> </p> <p> Lors de l&#39;édition de vos photos, il est essentiel de vous assurer que votre post-production n&#39;est pas bâclée. </p> <p> </p> <h2 id=\"how-to-export-a-preset-in-lightroom\"> Comment exporter un préréglage dans Lightroom </h2> <p> Après avoir enregistré votre préréglage dans Lightroom, il est temps de l&#39;exporter vers votre ordinateur ou votre lecteur de disque. Pour le faire, suivez ces étapes: </p> <ol> <li> Cliquez avec le bouton droit sur le préréglage enregistré et sélectionnez <strong> Exportation </strong> . <p> <img alt=\"Export Screenshot MUO\" src=\"images/muo-export-screenshot-114.png\" loading=\"lazy\"> </p> </li> <li> Choisissez où vous souhaitez exporter le préréglage. </li> <li> Validez votre choix en cliquant sur <strong> Exportation </strong> de nouveau. <p> <img alt=\"export lightroom preset to desktop\" src=\"images/export-preset-lightroom-746.png\" loading=\"lazy\"> </p> </li> </ol> <p> </p> <h2 id=\"where-can-you-sell-your-lightroom-presets\"> Où pouvez-vous vendre vos préréglages Lightroom ? </h2> <p> Avant de vendre vos préréglages, c&#39;est une bonne idée de rechercher vos options et de choisir celle qui vous convient le mieux. Voici une liste de quelques endroits populaires pour vendre des préréglages Lightroom, ainsi que les avantages et les inconvénients de leur utilisation. </p> <h3 id=\"your-own-website\"> Votre propre site Web </h3> <p> Si vous prévoyez de <a href=\"https://www.makeuseof.com/tag/best-website-builders-create-clean-online-portfolio/\" target=\"_blank\" rel=\"nofollow noopener\"> créer un site web </a> , ou en possédez déjà un, vous pouvez y vendre vos préréglages Lightroom et conserver la majeure partie de l&#39;argent. </p> <p> Pour vendre vos préréglages sur votre site Web, vous devrez créer une liste et déterminer comment vous allez livrer le produit. Le moyen le plus simple de le faire est d&#39;envoyer un fichier ou un lien téléchargeable chaque fois qu&#39;un achat est effectué. </p> <p> <strong> Les avantages d&#39;avoir votre propre site Web : </strong> </p> <ul> <li> Les gens viennent spécifiquement vers vous, ce qui signifie que vous n&#39;avez pas à rivaliser avec les autres sur un marché. </li> <li> Vous n&#39;avez pas besoin de payer de frais de marché, ce qui peut avoir un impact notable sur vos bénéfices au fil du temps. </li> <li> Vous aurez l&#39;air plus professionnel. </li> <li> Les utilisateurs vous feront probablement davantage confiance sur votre propre site Web, plutôt que sur une vitrine sur un marché en ligne. </li> </ul> <p> <strong> Les inconvénients d&#39;avoir votre propre site Web : </strong> </p> <ul> <li> Si vous n&#39;avez pas déjà une large audience en ligne, vous aurez peut-être du mal à attirer des clients payants. </li> <li> La mise en place de votre boutique prendra du temps et de l&#39;argent. </li> <li> Vous devrez acquérir une foule d&#39;autres compétences, telles que le référencement et le marketing numérique. </li> </ul> <p> <strong> Vous devriez envisager de vendre des préréglages sur votre site Web si vous : </strong> </p> <ul> <li> Ayez une présence en ligne de taille décente. </li> <li> Sont prêts à apprendre le référencement et la création de sites Web. </li> </ul> <p> Même si vous n&#39;avez pas encore une grande présence en ligne, c&#39;est quand même une bonne idée de télécharger vos préréglages sur votre boutique en ligne. Ensuite, à mesure que vous attirez plus d&#39;abonnés, ils peuvent acheter vos produits sans que vous ayez à faire tout le travail de configuration plus tard. </p> <h3 id=\"online-creative-marketplaces\"> Marchés créatifs en ligne </h3> <p> Si vous ne souhaitez pas vendre vos préréglages sur votre site Web, vous pouvez plutôt choisir parmi divers marchés en ligne. </p> <p> Certaines des places de marché en ligne les plus populaires pour les créations sont : </p> <ul> <li> <a href=\"https://creativemarket.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Marché créatif </a> </li> <li> <a href=\"https://www.etsy.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Etsy </a> </li> <li> <a href=\"https://exchange.adobe.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Échange d&#39;Adobe </a> </li> <li> <a href=\"https://sellfy.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Sellfy </a> </li> </ul> <p> <strong> Les avantages des marchés en ligne : </strong> </p> <ul> <li> Vous n&#39;avez pas à vous soucier du référencement, de la création d&#39;un public ou des coûts d&#39;installation énormes. </li> <li> Au fil du temps, vos revenus augmenteront si vous êtes un vendeur prospère. </li> </ul> <p> <strong> Les inconvénients des marchés en ligne : </strong> </p> <ul> <li> Ces sites Web prennent une part importante de vos revenus. Vous devez donc vendre plus que si vous utilisiez votre propre site Web. </li> <li> Vous n&#39;êtes pas la seule personne sur ce site Web. Si votre style n&#39;est pas assez unique, vous ne vous démarquerez pas et personne n&#39;achètera vos produits. </li> </ul> <p> <strong> Les marchés en ligne sont bons pour : </strong> </p> <ul> <li> Utilisateurs sans expérience de vente en ligne, mais qui souhaitent comprendre le fonctionnement du commerce électronique. </li> <li> Des photographes qui n&#39;ont pas beaucoup de temps pour créer leur propre boutique en ligne. </li> <li> Utilisateurs sans grand public en ligne. </li> </ul> <p> </p> <h2 id=\"how-to-promote-your-presets\"> Comment promouvoir vos préréglages </h2> <p> Une fois que vous avez créé et téléchargé vos préréglages, il est temps de faire connaître votre travail au monde entier. Vous pouvez promouvoir vos préréglages de différentes manières. Voici quelques options que vous pouvez essayer. </p> <h3 id=\"1-youtube\"> 1. <a href=\"https://www.youtube.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Youtube </a></h3> <p> Bien que la création d&#39;une chaîne YouTube prenne du temps, la plate-forme est excellente pour diffuser votre message en tant que créatif. Le public est déjà là, ce qui signifie que tout ce que vous avez à faire est de trouver comment l&#39;attirer. </p> <p> </p> <p> Pour promouvoir vos préréglages sur YouTube, vous devez d&#39;abord créer du contenu de valeur. Documentez vos expériences photographiques et offrez des conseils pratiques à ceux qui cherchent à prendre de meilleures photos. Vous pouvez également expliquer comment vous avez créé votre préréglage et fournir des didacticiels et des conseils sur la façon dont les utilisateurs peuvent créer le leur. </p> <h3 id=\"2-instagram\"> 2. <a href=\"https://www.instagram.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Instagram </a></h3> <p> <img alt=\"adobe lightroom presets instagram\" src=\"images/lightroom-instagram-598.jpg\" loading=\"lazy\"> </p> <p> Comme vous pouvez vous y attendre d&#39;une plate-forme visuelle, Instagram est un autre bon endroit pour promouvoir vos préréglages Lightroom. L&#39;application s&#39;est également davantage tournée vers le commerce en ligne ces dernières années, ce qui a amené davantage de créateurs à y vendre leurs produits. </p> <p> Comme avec YouTube, vous devrez créer du contenu utile avant de pouvoir vendre vos préréglages. Lorsque vous téléchargez des photos, parlez de la façon dont vous les avez modifiées et offrez peut-être même des conseils de photographie. Vous pouvez également discuter de ce que vous avez appris et encourager les autres à se joindre à la conversation. </p> <p> </p> <p> Outre les publications standard, réfléchissez à la manière dont vous pouvez également utiliser les histoires et les bobines Instagram à votre avantage. </p> <h3 id=\"telling-your-friends-and-family\"> 3. Parler à vos amis et à votre famille </h3> <p> <img alt=\"promote lightroom presets\" src=\"images/promote-presets-to-friends-343.jpg\" loading=\"lazy\"> </p> <p> Avez-vous des amis et de la famille qui se demandent toujours à quel point vos photos sont si belles ? Eh bien, ils sauront dès qu&#39;ils auront acheté vos préréglages. </p> <p> Lorsque vous vendez des préréglages et d&#39;autres articles en ligne, votre cercle immédiat est un excellent point de départ. Même s&#39;ils ne sont pas trop intéressés par la photographie, ils voudront quand même vous soutenir. Ou, ils pourraient connaître quelqu&#39;un qui prend des photos et vous référera à eux. </p> <p> </p> <h2 id=\"share-your-art-with-the-world\"> Partagez votre art avec le monde </h2> <p> Les préréglages Lightroom sont un excellent moyen de rationaliser votre flux de travail photographique, mais vous pouvez également utiliser vos modifications pour aider les autres. Il existe de nombreux endroits pour vendre des préréglages Lightroom en ligne, chacun avec des avantages et des inconvénients uniques. </p> <p> Pour réussir à vendre vos préréglages en ligne, assurez-vous que votre style est suffisamment unique pour que les autres y prêtent attention. Et avant de commencer à pousser vos préréglages, n&#39;oubliez pas de fournir beaucoup de contenu gratuit. Ensuite, les gens seront plus disposés à acheter vos produits. </p>"}