{"title":"Comment faire une capture d&#39;écran sur une tablette Surface Pro","content":"<p> Prendre une capture d&#39;écran est une compétence simple mais essentielle sur n&#39;importe quel appareil. Sur la tablette Surface Pro, vous pouvez prendre des captures d&#39;écran à l&#39;aide de raccourcis clavier, de l&#39;outil de capture ou même de la barre de jeu Xbox. Nous allons vous montrer comment utiliser toutes ces méthodes pour prendre une capture d&#39;écran ou même un enregistrement d&#39;écran sur votre appareil Surface. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Prendre une capture d&#39;écran à l&#39;aide de combinaisons de boutons </h2> <p> Sur la gamme d&#39;appareils Surface Pro, prendre une capture d&#39;écran à l&#39;aide de combinaisons de boutons est simple et rapide. Pour faire une capture d&#39;écran, maintenez votre <strong> Pouvoir </strong> et <strong> Monter le son </strong> clé en même temps. L&#39;écran doit clignoter et la capture d&#39;écran doit être enregistrée dans le dossier des captures d&#39;écran sous Images sur votre appareil. </p> <p> Cette méthode fonctionne pour la dernière gamme d&#39;appareils Surface Pro (c&#39;est-à-dire Surface Pro 7+, Pro X), la Surface Go, la Surface Go 2 et la gamme d&#39;appareils Surface Book. </p> <p> Si votre Surface est un modèle plus ancien (Surface 3 ou plus ancien), la combinaison de boutons est un peu différente. Vous devez appuyer sur le <strong> Bouton Windows </strong> (pas la touche Windows de votre clavier) et le <strong> Baisser le volume </strong> bouton en même temps. L&#39;appareil enregistrera votre capture d&#39;écran dans votre dossier Captures d&#39;écran sous Photos. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> De même, pour prendre une capture d&#39;écran sur votre Surface Duo, maintenez la touche <strong> Pouvoir </strong> bouton et le <strong> Baisser le volume </strong> clé. La capture d&#39;écran doit être enregistrée dans la galerie de votre appareil sous Captures d&#39;écran. Alternativement, vous pouvez simplement maintenir le <strong> Pouvoir </strong> touche et cliquez sur le <strong> Capture d&#39;écran </strong> bouton sur l&#39;écran. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> Comment faire une capture d&#39;écran de Surface Pro à l&#39;aide de raccourcis clavier </h2> <p> Les raccourcis clavier sont un autre moyen de capturer ce qui est sur votre écran. </p> <p> Ces raccourcis clavier fonctionnent sur tous les appareils Windows, alors consultez <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> autres méthodes de capture d&#39;écran sur Windows 10 </a> . Les raccourcis clavier fonctionnent mieux sur la gamme d&#39;appareils Surface Laptop et Surface Book, mais bien sûr, si vous avez la pièce jointe clavier pour votre appareil Surface Pro ou Go, ces raccourcis fonctionnent également. </p> <h3 id=\"print-screen-methods\"> Méthodes d&#39;impression d&#39;écran </h3> <p> Pour prendre une capture d&#39;écran à l&#39;aide de la méthode d&#39;impression d&#39;écran, appuyez simplement sur le bouton <strong> PrtScn </strong> bouton de votre clavier. Cela prendra une capture d&#39;écran de l&#39;ensemble de votre bureau. Notez que cela n&#39;enregistrera pas la capture d&#39;écran sur votre Surface mais l&#39;ajoutera à votre presse-papiers. Vous devez utiliser un programme tel que Microsoft Paint pour coller la capture d&#39;écran. </p> <p> Pressage <strong> Alt + Impr.Scn </strong> prendra une capture d&#39;écran de votre fenêtre actuelle uniquement et ajoutera de la même manière la capture d&#39;écran à votre presse-papiers. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Capturer et esquisser </h3> <p> C&#39;est de loin la méthode la plus simple pour prendre une capture d&#39;écran sur votre appareil Surface. </p> <p> Pour ouvrir Snip and Sketch, appuyez sur le bouton <strong> Touche Windows + Maj + S, </strong> et une superposition devrait apparaître sur votre écran. Pour prendre une capture d&#39;écran complète, appuyez sur le bouton Plein écran en haut de la superposition. Pour prendre une capture d&#39;écran de votre fenêtre actuelle uniquement, appuyez sur le bouton Capture de fenêtre à côté du bouton Plein écran. </p> <p> Vous pouvez également prendre une capture d&#39;écran d&#39;une zone spécifique de votre écran. Par défaut, Snip and Sketch a le Snip rectangulaire. Faites simplement glisser sur la partie que vous souhaitez capturer à l&#39;aide de votre écran tactile ou de votre trackpad. </p> <p> Snip and Sketch vous enverra une notification dans votre panneau de notification pour vous dire que votre capture d&#39;écran est copiée dans votre presse-papiers. Si vous cliquez dessus, vous pouvez dessiner et esquisser sur une capture d&#39;écran si vous le souhaitez. </p> <p> Pour l&#39;enregistrer dans vos fichiers, utilisez <strong> Ctrl + S </strong> ou le bouton Enregistrer dans le coin supérieur droit pour enregistrer votre capture d&#39;écran dans un dossier spécifique. </p> <h3 id=\"xbox-game-bar\"> Barre de jeu Xbox </h3> <p> Pour prendre une capture d&#39;écran à l&#39;aide de la Xbox Game Bar, appuyez sur le bouton <strong> Touche Windows + G </strong> pour l&#39;ouvrir. </p> <p> De là, vous pouvez cliquer sur l&#39;onglet Captures et cliquer sur le bouton Appareil photo. Cette méthode vous permettra également de faire une capture vidéo de votre écran avec audio. Vos captures enregistrées apparaîtront sous le dossier Vidéos et le sous-dossier Captures. Sur une Xbox, vous pouvez de même <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> capturer des captures d&#39;écran et des enregistrements </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Prendre une capture d&#39;écran de Surface Pro à l&#39;aide du stylet Surface </h2> <p> Pour prendre une capture d&#39;écran à l&#39;aide du stylet Surface, double-cliquez simplement sur la gomme et votre appareil devrait afficher Snip et Sketch de toute votre fenêtre. À partir de là, vous pouvez esquisser et exporter votre capture d&#39;écran. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> Vous pouvez également y accéder en recherchant Windows Ink Workspace sur votre station d&#39;accueil. À partir de là, sélectionnez Capture en plein écran. Vous pouvez modifier l&#39;action des raccourcis des boutons de votre stylet Surface en recherchant les paramètres de l&#39;espace de travail Windows Ink et en faisant défiler jusqu&#39;à l&#39;espace de travail Windows Ink. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Faire une capture d&#39;écran sur Surface, en toute simplicité </h2> <p> Vous connaissez maintenant toutes les différentes méthodes de capture d&#39;écran ou d&#39;enregistrement d&#39;écran sur votre appareil Surface. Les combinaisons de boutons sont le meilleur moyen tactile de prendre une capture d&#39;écran si vous utilisez la Surface Pro ou la Surface Go, mais les raccourcis clavier sont également faciles. </p>"}