{"title":"Comment empêcher Windows 10 de bloquer vos fichiers téléchargés","content":"<p> Lorsque vous essayez d&#39;ouvrir un fichier, Windows 10 peut vous empêcher de l&#39;ouvrir directement. Il vous montrera un avertissement de sécurité indiquant que le fichier provient d&#39;une source inconnue et peut être non sécurisé. Cela se produit lorsqu&#39;une fonctionnalité de Windows 10 appelée Attachment Manager bloque les fichiers qu&#39;elle considère dangereux pour votre PC. </p> <p> Bien que vous puissiez débloquer manuellement chaque fichier, cela peut être un processus fatigant, surtout si vous devez le faire pour presque tous les fichiers que vous téléchargez. Dans cet article, nous allons vous montrer comment empêcher Windows 10 de bloquer vos fichiers téléchargés. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> Qu&#39;est-ce que le gestionnaire de pièces jointes dans Windows 10 ? </h2> <p> Dans Windows 10, il existe une fonctionnalité de sécurité appelée Gestionnaire de pièces jointes qui vous empêche d&#39;ouvrir des fichiers dangereux. Il peut s&#39;agir de fichiers que vous avez téléchargés ou <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> fichiers que Windows identifie comme pièces jointes non sécurisées </a> . Si le gestionnaire de pièces jointes considère un fichier comme dangereux, il empêche Windows 10 de l&#39;ouvrir et affiche un message d&#39;avertissement. Le gestionnaire de pièces jointes classe les fichiers que vous téléchargez en fonction du type de fichier et de l&#39;extension de nom de fichier. </p> <p> Le Gestionnaire de pièces jointes Windows utilise l&#39;interface de programmation d&#39;application (API) IAttachmentExecute pour rechercher le type de fichier, l&#39;association de fichier et pour déterminer l&#39;action la plus appropriée à entreprendre. Lorsque vous téléchargez des fichiers et que vous les enregistrez sur votre disque, Windows ajoute des métadonnées spécifiques à ces fichiers. Ces métadonnées sont considérées comme des pièces jointes. Lorsque Windows ajoute des métadonnées aux fichiers téléchargés en tant que pièce jointe, il s&#39;agit d&#39;informations de zone. </p> <p> Maintenant le <strong> Informations sur les zones </strong> c&#39;est là que se trouve le fond du problème. Lorsque l&#39;explorateur de fichiers ouvre un fichier, il lit les informations de zone jointes stockées au même emplacement et vérifie si le fichier provient d&#39;une source inconnue ou non. Si Windows constate que le fichier n&#39;est pas reconnu ou provient de sources inconnues, il vous empêche de l&#39;ouvrir. </p> <p> Un avertissement Windows SmartScreen apparaîtra indiquant : </p> <blockquote> <p> Windows SmartScreen a empêché le démarrage d&#39;une application non reconnue. L&#39;exécution de cette application peut mettre votre PC en danger. </p> </blockquote> <p> Si vous souhaitez ouvrir manuellement un fichier bloqué, faites un clic droit sur le fichier téléchargé puis sélectionnez <strong> Propriétés </strong> . Dans l&#39;onglet Général, cliquez sur <strong> Débloquer </strong> , Cliquez sur <strong> Appliquer </strong> puis cliquez sur <strong> d&#39;accord </strong> . </p> <p> Mais imaginez que vous deviez le faire à chaque fois que vous téléchargez un fichier, cela peut être ennuyeux et prendre beaucoup de temps. Si vous téléchargez souvent des fichiers sur Internet ou recevez des fichiers sous forme de pièces jointes à des e-mails, vous souhaiterez peut-être empêcher complètement votre PC de bloquer vos fichiers. </p> <p> Pour empêcher Windows 10 de vous empêcher d&#39;ouvrir vos fichiers, vous devez l&#39;empêcher d&#39;ajouter des informations de zone aux fichiers que vous téléchargez. Vous pouvez le faire en configurant manuellement le gestionnaire de pièces jointes à l&#39;aide de l&#39;éditeur de stratégie de groupe local ou de l&#39;éditeur de registre. </p> <p> Nous vous expliquerons comment procéder. Vous devez être connecté en tant qu&#39;administrateur ou vous devriez <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> demander les droits d&#39;administrateur </a> pour pouvoir empêcher les fichiers téléchargés d&#39;être bloqués. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Configurer le gestionnaire de pièces jointes à l&#39;aide de l&#39;éditeur de registre </h2> <p> appuie sur le <strong> Touche Windows + R </strong> pour ouvrir l&#39;éditeur de registre. De là, tapez &quot;Regedit&quot; et cliquez sur <strong> Entrer </strong> . Une invite de contrôle de compte d&#39;utilisateur apparaîtra. Lorsque cette invite apparaît, cliquez sur le <strong> Oui </strong> bouton pour continuer. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Accédez à la clé Pièces jointes dans l&#39;Éditeur du Registre : <strong> HKEY_CURRENT_USER &gt; Logiciel &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; Stratégies &gt; Pièces jointes </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> Si la clé Pièces jointes est absente dans la clé Politiques, vous devrez la créer. Pour ce faire, faites un clic droit sur le <strong> Stratégies </strong> clé, cliquez <strong> Nouveau </strong> , Cliquez sur <strong> Clé </strong> . Cela créera une nouvelle clé, que vous devrez ensuite nommer &quot;Pièces jointes&quot;. Si vous constatez que la clé Pièces jointes est déjà présente, vous pouvez passer à l&#39;étape suivante. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> Faites un clic droit sur le <strong> Pièces jointes </strong> clé, cliquez <strong> Nouveau </strong> puis sélectionnez <strong> Valeur DWORD (32 bits) </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Vous serez invité à nommer cette valeur DWORD nouvellement créée. Nommez-le &quot;SaveZoneInformation&quot; et cliquez sur <strong> Entrer </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> Enfin, pour désactiver le gestionnaire de pièces jointes dans Windows 10, double-cliquez sur le nouveau <strong> Enregistrer les informations sur la zone </strong> valeur et remplacez ses données de valeur par 1. Cliquez sur <strong> d&#39;accord </strong> pour finir. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Lorsque vous avez terminé ces étapes, fermez l&#39;Éditeur du Registre et redémarrez votre ordinateur pour appliquer les modifications. À partir de là, tout fichier que vous téléchargez ne joindra plus les informations de zone au flux de données alternatif du fichier. Cela vous permettra d&#39;ouvrir vos fichiers sans aucune difficulté. </p> <p> Si vous souhaitez revenir en arrière et activer le gestionnaire de pièces jointes, vous pouvez le faire en accédant à la clé Pièces jointes dans l&#39;éditeur de registre : <strong> HKEY_CURRENT_USER &gt; Logiciel &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; Stratégies &gt; Pièces jointes </strong> . De là, sur le côté droit, double-cliquez sur le <strong> Enregistrer les informations sur la zone </strong> valeur et remplacez ses données de valeur par 3. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Configurer le gestionnaire de pièces jointes à l&#39;aide de l&#39;éditeur de stratégie de groupe local </h2> <p> L&#39;éditeur de stratégie de groupe local est uniquement disponible dans les éditions Windows 10 Entreprise, Éducation et Pro. Par conséquent, cette méthode n&#39;est pas applicable si vous possédez l&#39;édition Windows 10 Home. Si votre PC fonctionne sur l&#39;édition Windows 10 Home, vous devrez configurer le gestionnaire de pièces jointes via l&#39;éditeur de registre. </p> <p> Si vous utilisez une édition de Windows 10 dotée de l&#39;éditeur de stratégie de groupe local, vous pouvez configurer le gestionnaire de pièces jointes en suivant les étapes indiquées ici. </p> <p> Pour commencer, appuyez sur <strong> Touche Windows + R </strong> , tapez &quot;gpedit.msc&quot;, et cliquez sur <strong> Entrer </strong> pour ouvrir l&#39;éditeur de stratégie de groupe local. </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Accédez au gestionnaire de pièces jointes : <strong> Configuration utilisateur &gt; Modèles d&#39;administration &gt; Composants Windows &gt; Attachment Manager </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> Dans le volet droit du gestionnaire de pièces jointes, double-cliquez sur le <strong> Ne pas conserver les informations de zone dans les pièces jointes </strong> stratégie pour modifier les paramètres d&#39;informations de zone. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> Une fenêtre s&#39;ouvrira dans laquelle vous pourrez choisir si le gestionnaire de pièces jointes doit ou non conserver les informations de zone. </p> <p> Cliquez sur <strong> Activée </strong> pour permettre au gestionnaire de pièces jointes de ne pas conserver les informations de zone. Cela garantira que Windows ne bloque pas vos fichiers chaque fois que vous les ouvrez. Clique le <strong> Appliquer </strong> pour enregistrer les modifications, puis cliquez sur <strong> d&#39;accord </strong> . </p> <p> Lorsque vous avez terminé, fermez l&#39;éditeur de stratégie de groupe local et redémarrez votre PC pour enregistrer les modifications. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows ne bloquera plus vos fichiers </h2> <p> Si vous avez déjà dû débloquer manuellement la plupart des fichiers que vous avez téléchargés, vous auriez réalisé à quel point ce processus pouvait être fatiguant. Une fois que vous aurez appliqué ces conseils, vous aurez la liberté d&#39;ouvrir facilement tous vos fichiers. </p> <p> Si vous téléchargez des fichiers et doutez de leur crédibilité, vous pouvez toujours les ouvrir dans des environnements isolés sécurisés pour vous assurer que votre PC et vos données sont en sécurité. </p>"}