{"title":"Comment protéger vos données personnelles des employeurs","content":"<p> La technologie de surveillance est omniprésente à l&#39;intérieur et à l&#39;extérieur du bureau. De nombreux employeurs utilisent des produits de gestion mobile pour les appareils fournis par l&#39;entreprise, tels que les téléphones, les ordinateurs portables et les tablettes. Ceux-ci contiennent des programmes conçus pour protéger les entreprises contre le vol, l&#39;espionnage commercial ou les intentions malveillantes. </p> <p> Cependant, bien que tout cela soit excellent pour protéger votre entreprise, ce n&#39;est pas exactement la meilleure chose pour vous. Il ne s&#39;agit plus de <strong> si </strong> votre entreprise vous suit ; la prochaine question que vous devez vous poser est la suivante : quelle quantité de données les entreprises peuvent-elles réellement trouver                                                                         Étonnamment, beaucoup. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> Que peuvent voir les employeurs sur les appareils Wi-Fi et distants de l&#39;entreprise ? </h2> <p> La plupart des gens ne réalisent pas dans quelle mesure les entreprises ont accès à leurs données ou à quel point elles en signent lorsqu&#39;elles utilisent les appareils de l&#39;entreprise. Voici quelques exemples. </p> <h3 id=\"location\"> Emplacement </h3> <p> De nombreux employés pensent que l&#39;utilisation d&#39;un réseau privé virtuel (VPN) suffit à faire croire à leurs employeurs qu&#39;ils sont là où ils sont censés être. </p> <p> Bien qu&#39;il existe des moyens de masquer votre position réelle sur un appareil personnel, ce n&#39;est pas tout à fait infaillible, en particulier lorsque vous êtes connecté à une application ou à un site Web avec une adresse e-mail ou un numéro de mobile émis par l&#39;entreprise. </p> <p> </p> <p> Il peut être presque impossible de masquer votre emplacement réel lorsque vous utilisez des appareils fournis par l&#39;entreprise. Par exemple, les entreprises de télécommunications peuvent détecter lorsque vous vous êtes connecté à l&#39;un de leurs partenaires d&#39;itinérance. </p> <p> De plus, les VPN d&#39;entreprise sont différents des VPN commerciaux avec des passerelles surveillées par des équipes informatiques internes. </p> <h3 id=\"notes-documents-and-emails\"> Notes, documents et e-mails </h3> <p> Si vous pensez que personne ne sait que vous utilisez le Wi-Fi de l&#39;entreprise pour trouver votre prochain emploi, vous vous trompez. Même si vous n&#39;utilisez pas d&#39;adresse e-mail d&#39;entreprise, de nombreuses entreprises ont des programmes préinstallés sur les ordinateurs portables de l&#39;entreprise qui incluent des journaux d&#39;activité en temps réel, des mises à jour de l&#39;historique de navigation et des captures d&#39;écran programmées des documents et des e-mails ouverts. </p> <p> Dans le but de se protéger contre d&#39;éventuelles violations de données, de nombreuses entreprises les utilisent également comme mécanismes de reporting ou de suivi de la productivité. </p> <p> </p> <h3 id=\"online-messaging-history\"> Historique de la messagerie en ligne </h3> <p> Malgré l&#39;essor des plates-formes cryptées, la réalité est que vos messages ne sont pas entièrement privés sur les appareils de l&#39;entreprise. Lorsqu&#39;elles utilisent des plateformes de messagerie, les entreprises peuvent ne pas être en mesure de voir les détails exacts de vos échanges, mais seront probablement toujours en mesure de reconnaître les métadonnées telles que la taille et le type de fichier. </p> <p> Ainsi, si vous décidez d&#39;envoyer des fichiers PDF de grande taille via une application comme WhatsApp, le système de détection d&#39;intrusion de votre entreprise vous signalera probablement un comportement suspect. Conformément aux directives de l&#39;entreprise, ils peuvent vous demander de prouver que vos actions n&#39;étaient pas malveillantes et peuvent avoir besoin de demander l&#39;approbation de la direction pour l&#39;autorisation. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> Comment éviter de partager des données personnelles avec votre employeur </h2> <p> Il n&#39;y a aucun moyen absolu de garder vos informations personnelles, vos conversations et vos activités complètement hors de portée à tout moment. Cependant, il existe plusieurs façons d&#39;atténuer les risques. </p> <p> Nous n&#39;approuvons pas le fait de cacher des données à vos employeurs ; en fait, ils ont le droit de collecter des informations sur leurs employés, même en étant <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> capable de vous suivre légalement </a> . Mais vous devez savoir quand il est approprié de garder les choses pour vous, et cela dépend des entreprises individuelles. </p> <h3 id=\"read-company-policies\"> Lire les politiques de l&#39;entreprise </h3> <p> Avant de pouvoir discuter de la transparence des données, vous devez également comprendre le type d&#39;informations que vous donnez sciemment à votre employeur en travaillant pour lui. Ce n&#39;est que lorsque vous savez ce qui est attendu que vous pouvez établir les limites professionnelles appropriées. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Essayez de comprendre les politiques et procédures de collecte de données de l&#39;entreprise avant qu&#39;elles ne soient collectées. À partir de là, vous pouvez efficacement élaborer un plan pour refuser de fournir plus d&#39;informations que nécessaire. </p> <h3 id=\"use-personal-gadgets\"> Utiliser des gadgets personnels </h3> <p> Bien qu&#39;il soit toujours tentant d&#39;utiliser les appareils de l&#39;entreprise pour économiser de l&#39;argent, la réalité est que rien n&#39;est jamais vraiment gratuit. Investissez dans des ordinateurs portables, des téléphones portables et des tablettes à usage personnel. </p> <p> Disposer d&#39;appareils personnels séparés est également un excellent moyen d&#39;établir des limites, en particulier lorsque vous travaillez à distance. </p> <p> L&#39;utilisation de votre propre appareil vous permet d&#39;établir et de gérer les différentes pratiques de sécurité nécessaires pour protéger vos données des regards indiscrets. Cela peut sembler une dépense inutile, mais cela contribue grandement à préserver votre tranquillité d&#39;esprit. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Utiliser les profils d&#39;invité sur les appareils personnels </h3> <p> Se connecter à un réseau qui n&#39;est pas le vôtre est toujours un risque pour la sécurité, même s&#39;il s&#39;agit de locaux de travail. La connexion au réseau Wi-Fi d&#39;une entreprise permet à votre employeur d&#39;accéder à tout, des métadonnées de vos messages aux journaux de l&#39;historique de navigation. </p> <p> Si vous devez absolument utiliser votre ordinateur portable personnel sur les réseaux d&#39;entreprise, vous pouvez choisir d&#39;utiliser un profil d&#39;invité pour réduire la quantité de données auxquelles ils peuvent accéder à distance. Vous pouvez également vous connecter avec le forfait de données de votre téléphone mobile personnel ou un appareil Wi-Fi portable. </p> <h3 id=\"keep-your-passwords-safe\"> Gardez vos mots de passe en sécurité </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Créer des mots de passe forts </a> ne suffit pas. Vous devez vous assurer que vos mots de passe ne sont pas enregistrés sur les appareils de l&#39;entreprise. L&#39;enregistrement de mots de passe personnels pour des comptes bancaires en ligne, des e-mails personnels ou des sites Web gouvernementaux sur des gadgets que vous ne possédez pas met vos données en danger immédiat si la base de données de votre entreprise est compromise. </p> <p> Utilisez uniquement votre téléphone portable ou votre ordinateur portable personnel pour accéder à des comptes importants, en particulier ceux où de l&#39;argent est impliqué. Dans la mesure du possible, activez l&#39;authentification à deux facteurs. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> Séparez votre travail et votre vie personnelle </h2> <p> Les employeurs ont le droit d&#39;accéder à distance à votre appareil fourni par l&#39;entreprise s&#39;ils soupçonnent que vous participez à une forme quelconque d&#39;activité illégale, mettez en danger les informations de l&#39;entreprise ou si les forces de l&#39;ordre demandent une enquête. </p> <p> Ceci est cependant différent des appareils personnels. </p> <p> Votre sécurité est aussi forte que les personnes avec lesquelles vous êtes en contact, y compris votre employeur. Séparer vos appareils personnels et professionnels n&#39;est qu&#39;une étape vers la décentralisation de vos données. En mettant en œuvre des mesures de sécurité strictes, vous pouvez limiter le nombre de points d&#39;accès des pirates informatiques aux documents, aux e-mails et aux réseaux. </p> <p> La décentralisation des données personnelles est nécessaire car elle vous protège, en tant qu&#39;individu, et votre entreprise contre le vol, la fraude et d&#39;autres formes de cybercriminalité. </p>"}