{"title":"Comment utiliser l&#39;application d&#39;entraînement Apple Watch","content":"<p> Mieux comprendre vos progrès de forme physique est juste un robinet avec l&#39;Apple Watch. </p> <p> Nous examinons tout ce que l&#39;application Apple Watch Workout a à offrir, y compris son fonctionnement, les types d&#39;entraînement qu&#39;elle peut suivre et comment afficher toutes les informations qu&#39;elle collecte. </p> <h2 id=\"getting-started-with-the-workout-app\"> Premiers pas avec l&#39;application d&#39;entraînement </h2> <p> Vous pouvez ouvrir l&#39;application Workout sur une Apple Watch de plusieurs manières. Tout d&#39;abord, cliquez une fois sur le <strong> Couronne numérique </strong> pour afficher la liste des applications sur votre montre. Sélectionnez ensuite <strong> Entraînement </strong> . </p> <p> Un moyen encore plus rapide consiste simplement à utiliser Siri, soit en appuyant longuement sur le <strong> Couronne numérique </strong> ou porter la montre à votre bouche. Ensuite, dites simplement &quot;Ouvrez l&#39;application Workout&quot;. </p> <p> Après avoir ouvert l&#39;application, vous verrez une grande variété de types d&#39;entraînement, du tir à l&#39;arc au yoga et tout le reste. </p> <p> L&#39;écran de sélection d&#39;entraînement principal est mis en évidence par les options les plus populaires. Faites défiler la liste jusqu&#39;en bas et sélectionnez <strong> Ajouter un entraînement </strong> pour voir une liste d&#39;autres types d&#39;entraînement. Si, pour une raison quelconque, vous ne voyez pas votre type d&#39;entraînement, vous pouvez également sélectionner <strong> Autre </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> Vous pouvez sélectionner le <strong> trois points </strong> ( <strong> ... </strong> ) sur chaque type d&#39;entraînement pour définir un objectif particulier de distance, de calories brûlées ou de temps. Si l&#39;un de ces objectifs ne vous intéresse pas, appuyez simplement sur le nom de l&#39;entraînement pour commencer immédiatement. </p> <p> Il y aura un compte à rebours de trois secondes à l&#39;écran avant que le suivi ne commence. </p> <p> Toutes les fonctionnalités de l&#39;application Workout sont disponibles sans iPhone à proximité ou en utilisant simplement une Apple Watch connectée à un signal Wi-Fi ou cellulaire. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Comprendre l&#39;application d&#39;entraînement </h2> <p> Il y a trois écrans principaux dans l&#39;application. Vous pouvez basculer entre eux en balayant vers la gauche ou la droite. </p> <p> L&#39;écran principal affichera tous vos progrès dans le type d&#39;entraînement que vous avez sélectionné. Vous verrez la durée de l&#39;entraînement, les calories actives, les calories totales et la fréquence cardiaque actuelle. Selon votre type d&#39;entraînement, vous pouvez également voir la distance parcourue. </p> <p> Si vous possédez une Apple Watch Series 5 ou une version ultérieure et que l&#39;affichage permanent est activé, vous pouvez toujours voir vos statistiques d&#39;entraînement. Toute personne possédant un modèle plus ancien devra lever ou appuyer sur l&#39;écran pour voir ces informations. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Lorsque vous courez ou marchez, l&#39;Apple Watch fournira un léger tapotement à chaque mile ou kilomètre et affichera une mise à jour avec des informations de rythme. Un récapitulatif du cyclisme et un tapotement auront lieu tous les cinq miles ou kilomètres. </p> <p> Si vous effectuez un entraînement Apple Fitness+, vous pouvez voir les données sur l&#39;application Workout et sur l&#39;écran de l&#39;iPhone, de l&#39;iPad ou de l&#39;Apple Watch. </p> <p> </p> <p> Glisser vers la droite depuis l&#39;écran principal vous montrera quatre options différentes— <strong> Fermer à clé </strong> , <strong> Nouveau </strong> , <strong> Finir </strong> , et <strong> Pause </strong> . </p> <p> Sélection <strong> Fermer à clé </strong> verrouillera l&#39;écran pour éviter tout tapotement accidentel. Vous pouvez tourner la couronne numérique pour déverrouiller l&#39;écran. À noter que cette option s&#39;activera automatiquement pendant tout type d&#39;entraînement de natation pour éviter les robinets accidentels de gouttes d&#39;eau. </p> <p> Comme vous pouvez probablement le deviner, <strong> Nouveau </strong> termine l&#39;entraînement en cours et vous permet de choisir un nouveau type d&#39;exercice pour recommencer. Sélection <strong> Finir </strong> terminera l&#39;entraînement en cours. </p> <p> Si jamais vous êtes interrompu, vous pouvez sélectionner le <strong> Pause </strong> bouton. Appuyez à nouveau dessus pour démarrer le suivi de l&#39;entraînement. Vous pouvez également le faire en appuyant simultanément sur la couronne numérique et le bouton latéral. </p> <p> Un balayage vers la gauche depuis l&#39;écran principal d&#39;entraînement affiche les commandes de lecture multimédia. C&#39;est un moyen facile d&#39;accéder à votre musique ou à tout ce que vous écoutez pendant votre entraînement. Vous pouvez sauter des pistes, lire, mettre en pause et augmenter ou baisser le volume. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Rappels d&#39;entraînement automatiques </h2> <p> Il n&#39;y a pas besoin de s&#39;inquiéter si vous oubliez de commencer une séance d&#39;entraînement. Tant que vous avez watchOS 5 ou une version ultérieure, une Apple Watch peut automatiquement reconnaître lorsque vous vous entraînez. Il vous touchera le poignet et vous demandera si vous souhaitez enregistrer un entraînement, vous permettant de changer le type d&#39;entraînement, de désactiver ces notifications pour la journée ou simplement de rejeter cette notification. </p> <p> Bien que l&#39;affichage de la notification puisse prendre quelques minutes, tout le crédit d&#39;entraînement est toujours enregistré. </p> <p> Vous pouvez recevoir des rappels d&#39;entraînement pour les types d&#39;entraînement suivants : marche intérieure, marche extérieure, course intérieure, course extérieure, elliptique, rameur, nage en piscine et nage en eau libre. </p> <p> Pour activer ou désactiver la fonction, rendez-vous sur <strong> Paramètres &gt; Entraînement &gt; Démarrer le rappel d&#39;entraînement </strong> sur votre Apple Watch. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> L&#39;Apple Watch peut également détecter la fin d&#39;un entraînement. Après un appui, vous verrez une notification à l&#39;écran avec des options pour mettre fin ou suspendre l&#39;entraînement. Vous pouvez également ignorer complètement la notification et continuer l&#39;entraînement. </p> <p> Basculez la fonctionnalité en vous dirigeant vers votre Apple Watch et en allant sur <strong> Paramètres &gt; Entraînement &gt; Rappel de fin d&#39;entraînement </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Personnalisez les données affichées dans l&#39;application d&#39;entraînement </h2> <p> Dans la vue Entraînement de l&#39;Apple Watch, vous pouvez personnaliser les informations affichées à l&#39;écran pour de nombreux types d&#39;entraînement différents. </p> <p> Pour commencer, ouvrez l&#39;application Watch compagnon sur votre iPhone. Dans le <strong> Ma montre </strong> onglet sélectionner <strong> Entraînement </strong> . Alors choisi <strong> Vue d&#39;entraînement </strong> . En haut de la page, vous pouvez choisir d&#39;afficher une ou plusieurs mesures à l&#39;écran pendant un entraînement. Si vous sélectionnez <strong> Métrique unique </strong> , faites simplement défiler la Digital Crown pour voir plus de données sur votre Apple Watch. </p> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (3 images) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Développer <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Développer <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> En dessous, vous pouvez également voir un certain nombre de types d&#39;entraînement différents où vous pouvez modifier les informations affichées à l&#39;écran. Sélectionnez un type d&#39;entraînement, puis choisissez <strong> Éditer </strong> en haut à droite de l&#39;écran pour personnaliser ce qui est affiché à l&#39;écran et dans quel ordre. </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Affichage des données d&#39;entraînement dans l&#39;application Fitness </h2> <p> Une fois que vous avez terminé votre entraînement, toutes les données sont à quelques clics sur votre iPhone. </p> <p> Pour le voir, ouvrez le <strong> Aptitude </strong> application. </p> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (2 images) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Développer <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> Sous le <strong> Résumé </strong> onglet, sélectionnez <strong> Entraînements </strong> . Vous verrez des informations sur tous vos entraînements. Les données sont également disponibles dans le <strong> Santé </strong> application. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Casser une sueur avec l&#39;application d&#39;entraînement Apple Watch </h2> <p> Comme vous pouvez le voir, l&#39;application Apple Watch Workout est un excellent moyen de suivre toutes vos différentes mesures de condition physique tout en faisant tout, de la natation à la danse et bien plus encore. </p> <p> Et lorsque vous êtes prêt à passer la nuit et à vous coucher, votre Apple Watch peut toujours être d&#39;une grande aide avec la fonction de suivi du sommeil intégrée. </p>"}