{"title":"Comment voir vos statistiques de temps de jeu sur la PS5","content":"<p> Si vous aimez voir combien de temps vous avez passé à jouer à des jeux, la PS5 a une fonctionnalité cachée mais utile pour vous. Il garde une trace du temps que vous avez passé à jouer à des jeux sur le système. </p> <p> Voici comment vérifier combien de temps vous avez passé à jouer à des jeux PlayStation 5. Ce qui peut vous inciter à <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> éteignez votre PS5 </a> plus souvent. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> Comment vérifier vos statistiques de temps de jeu sur PlayStation 5 </h2> <p> Sur l&#39;écran d&#39;accueil de votre PS5, sélectionnez l&#39;icône de votre profil en haut à droite. Vous pouvez appuyer sur <strong> Triangle </strong> pour déplacer rapidement la sélection vers cette zone de l&#39;écran. Après avoir ouvert ce menu, choisissez <strong> Profil </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Maintenant, passez au <strong> Jeux </strong> languette. Ici, vous verrez tous les jeux auxquels vous avez joué sur votre compte PlayStation. Chacun indique la dernière fois que vous avez joué au jeu, ainsi que le nombre total d&#39;heures de jeu. Cependant, ce n&#39;est pas précis à la minute près. Vous verrez le temps de jeu arrondi à l&#39;heure. </p> <p> Vous verrez également la durée de lecture de vos titres PS4 ici, même si vous ne les avez pas joués sur PS5. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> Pour autant que nous le sachions, ce temps de jeu comprend tout le temps pendant lequel le jeu était en cours, pas seulement lorsque vous jouiez activement. Cela signifie que si vous avez laissé le jeu sur le menu de pause pendant que vous avez pris un appel téléphonique ou que vous avez mangé quelque chose, ce temps sera inclus dans le total. Donc, ce n&#39;est peut-être pas très précis, mais cela vous donnera au moins une idée de combien de temps vous avez joué à chaque titre. </p> <p> </p> <p> Si vous êtes curieux, vous pouvez également voir les statistiques de temps de jeu de vos amis. Sélectionnez le <strong> Amis </strong> sur le même écran et choisissez l&#39;ami sur lequel vous souhaitez en savoir plus. Cela vous montrera combien de temps ils ont passé dans leurs jeux dans un menu identique. </p> <p> Si vous ne voulez pas que vos informations de temps de jeu soient visibles par les autres joueurs, faites défiler vers la droite et choisissez <strong> Paramètres de confidentialité </strong> . Dans ce menu, sous le <strong> Votre activité </strong> section, modifiez l&#39;option pour <strong> Qui peut voir votre historique de jeu </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Certains jeux suivent également leur propre temps de jeu </h2> <p> Si vous êtes intéressé par de telles données, assurez-vous d&#39;ouvrir vos jeux préférés et de voir s&#39;ils gardent une trace du temps que vous avez passé à jouer. Un bon nombre de titres incluent le temps de lecture total sur votre fichier de sauvegarde, dans le menu de pause, ou similaire. </p> <p> Bien que cela ne soit pas cohérent d&#39;un jeu à l&#39;autre et qu&#39;il puisse inclure ou non le temps passé en pause, cela peut vous donner un meilleur aperçu d&#39;un jeu sur lequel vous souhaitez en savoir plus. Certains jeux en ligne, comme Overwatch, suivent même le temps passé avec chaque héros dans tous les modes. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Voyez combien vous jouez vraiment </h2> <p> La PS5 permet de voir facilement combien de temps vous avez passé à jouer à des jeux. C&#39;est une fonctionnalité petite mais très appréciée, car la PS4 n&#39;a pas rendu ces données facilement accessibles. </p> <p> Pendant ce temps, il existe également d&#39;autres moyens de gérer votre jeu en dehors de la console elle-même. </p> <p> <small> Crédit d&#39;image: LightField Studios/ <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}