{"title":"Comment réinitialiser vos recommandations Apple Music","content":"<p> Apple Music possédait auparavant un moyen facilement accessible de re-curer vos recommandations musicales en resélectionnant vos artistes et genres musicaux préférés. Malheureusement, lors d&#39;une mise à jour de l&#39;application, Apple a supprimé cette méthode d&#39;actualisation de votre curation musicale. </p> <p> N&#39;ayez crainte, voici un guide sur les méthodes alternatives pour arrêter ou réinitialiser vos suggestions automatiques Apple Music. </p> <h2 id=\"apple-music-recommendations-explained\"> Recommandations Apple Music expliquées </h2> <p> Lorsque vous lancez votre compte Apple Music pour la première fois, il vous demande de sélectionner vos favoris parmi une large liste de genres musicaux et d&#39;artistes. Cette curation est la façon dont Apple Music suggérera des listes de lecture, des albums, des artistes et des chansons à l&#39;avenir. </p> <p> Par exemple, si vous deviez sélectionner Classic Rock, New Rock et Foo Fighters parmi vos choix musicaux préférés, Apple Music suggérerait probablement des stations d&#39;écoute très similaires et ferait la promotion de la musique rock récemment sortie. </p> <p> Les modifications apportées à l&#39;application signifient que vous ne pouvez désormais gérer vos préférences musicales que lors de la création initiale du compte, vous ne pouvez pas les réinitialiser ultérieurement, bien qu&#39;Apple Music continuera à modifier ses suggestions en fonction de vos habitudes d&#39;écoute. </p> <p> Ceci n&#39;est qu&#39;un des nombreux utiles <a href=\"https://www.makeuseof.com/tag/apple-music-features-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Fonctionnalités Apple Music à utiliser </a> . </p> <p> Ne vous inquiétez pas, il existe encore plusieurs façons de réinitialiser votre curation Apple Music en désactivant vos préférences Apple ID ou en supprimant et en recréant votre compte Apple Music. </p> <p> Les deux options ont des avantages et des inconvénients, alors voyons quelle est la meilleure option pour vous. </p> <p> </p> <h2 id=\"turn-off-personalized-recommendations\"> Désactiver les recommandations personnalisées </h2> <p> La désactivation des recommandations personnalisées pour votre identifiant Apple est un bon moyen de ne plus voir de nouvelles suggestions. </p> <p> La désactivation de cette option ne supprimera pas vos données de curation existantes, ce qui signifie que l&#39;application continuera à créer des suggestions en fonction de votre utilisation. Vous ne les verrez plus. La désactivation des recommandations personnalisées affectera également vos recommandations dans d&#39;autres applications de service Apple, telles que Apple Books. </p> <p> Voici comment désactiver les recommandations personnalisées sur un iPhone : </p> <ol> <li> Ouvrez le <strong> Pomme Musique </strong> application. </li> <li> Allez au <b> Écoute maintenant </b> languette. </li> <li> Ouvrez votre profil Apple Music en sélectionnant l&#39;icône circulaire avec la silhouette d&#39;une personne dans le coin supérieur droit de l&#39;écran. Si vous avez déjà téléchargé une image en tant que photo de profil personnel, elle apparaîtra à la place de la silhouette. </li> <li> Sélectionner <b> Afficher l&#39;identifiant Apple </b> qui peut être localisé en faisant défiler vers le bas de la <b> Compte </b> page. </li> <li> Éteindre <b> Recommandations personnalisées </b> . </li> <li> Sélectionner <b> Fait </b> dans le coin supérieur droit, et vous avez terminé. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (3 images) </strong> <img alt=\"Apple Music Lisen Now featuring Halle x Chloe\" src=\"images/apple-music-listen-now-page-713.jpg\" loading=\"lazy\"> Développer <img alt=\"Apple Music Account Options Screenshot\" src=\"images/apple-music-account-page-914.jpg\" loading=\"lazy\"> Développer <img alt=\"Apple ID Options Screenshot\" src=\"images/apple-id-account-page-817.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> Après cela, les nouvelles recherches, téléchargements ou lectures de musique dans Apple Music n&#39;affecteront plus vos suggestions automatiques. Cela ne supprimera pas automatiquement vos recherches précédentes, ce qui signifie que cela peut prendre un peu de temps pour remarquer les effets de cette méthode. </p> <p> </p> <h2 id=\"delete-your-apple-music-profile\"> Supprimer votre profil Apple Music </h2> <p> Si vous avez besoin d&#39;une refonte complète d&#39;Apple Music avec de nouvelles suggestions de musique, la meilleure option consiste à supprimer et à recréer votre profil Apple Music. </p> <p> Il est important de noter que la suppression de votre profil supprimera complètement votre bibliothèque musicale actuelle. La création d&#39;un nouveau profil vous permettra de sélectionner de toutes nouvelles préférences de musique et de genre, mais cela supprimera également complètement tout historique Apple Music précédent. </p> <p> </p> <p> Si vous êtes intéressé par un tout nouveau profil Apple Music avec des favoris nouvellement sélectionnés, suivez ces étapes pour en créer un : </p> <ol> <li> Du <strong> Écoute maintenant </strong> onglet, accédez à votre Apple Music <strong> Compte </strong> , et sélectionnez <b> Voir le profil </b> . </li> <li> Sélectionner <b> Éditer </b> au centre de l&#39;écran sous votre nom. </li> <li> Faites défiler l&#39;écran jusqu&#39;en bas et sélectionnez <b> Supprimer le profil </b> . Attention, il s&#39;agit d&#39;une suppression définitive qui nécessitera une réinitialisation du compte. </li> <li> Configurez vous-même un nouveau profil Apple Music qui est désormais libre de vos anciennes sélections. Si vous avez désactivé les recommandations personnalisées comme décrit dans la section ci-dessus, vous ne bénéficierez plus de suggestions de musique personnalisées. Sortie <strong> Recommandations personnalisées </strong> activé, Apple Music proposera de la musique en fonction de vos nouvelles habitudes d&#39;écoute. </li> <li> Naviguez librement et profitez d&#39;un large éventail d&#39;options audio nouvellement sélectionnées. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (2 images) </strong> <img alt=\"Apple Music Profile feat Halle x Chloe\" src=\"images/apple-music-profile-page-771.jpg\" loading=\"lazy\"> Développer <img alt=\"Apple Music Profile Options Screenshot\" src=\"images/apple-music-edit-profile-page-450.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> </p> <h2 id=\"spotify-s-recommendations-might-be-better\"> Les recommandations de Spotify pourraient être meilleures </h2> <p> Si vous n&#39;êtes toujours pas satisfait des recommandations d&#39;Apple Music même après avoir créé un nouveau profil, il est peut-être temps de changer de plateforme de streaming musical. Apple Music et Spotify ont de nombreuses fonctionnalités très similaires, mais beaucoup de gens pensent que Spotify est de loin supérieur pour suggérer de la nouvelle musique. </p> <p> Bien sûr, de nombreux autres facteurs doivent également être pris en compte lors du choix entre Apple Music et Spotify. </p>"}