{"title":"Comment voir qui vous suit sur Facebook","content":"<p> Si vous vous souciez d&#39;avoir plus d&#39;abonnés sur Facebook autant que vous aimez développer vos amis Facebook, vous voudrez peut-être voir qui vous suit sur Facebook. Vous pouvez facilement le faire sur ordinateur et sur mobile. </p> <p> Voici comment savoir combien de followers vous avez sur Facebook. </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-desktop\"> Comment voir qui vous suit sur Facebook (Bureau) </h2> <p> Sur le bureau, vous pouvez voir qui vous suit sur Facebook, mais pas le nombre de followers. Cependant, l&#39;application mobile Facebook vous permet de voir qui vous suit et le nombre de vos abonnés. </p> <p> <img alt=\"Facebook profile interface with friends\" src=\"images/click-more-and-select-followers-786.jpg\" loading=\"lazy\"> </p> <p> Tout d&#39;abord, connectez-vous à votre <a href=\"https://web.facebook.com\" target=\"_blank\" rel=\"nofollow noopener\"> compte Facebook </a> via votre navigateur et utilisez les instructions suivantes pour voir vos abonnés Facebook : </p> <ol> <li> Une fois connecté, cliquez sur le <strong> icône de petite image </strong> à côté de votre nom dans la barre latérale. </li> <li> Dans le menu Profil, cliquez sur <strong> Amis </strong> . </li> <li> Dans le menu Amis, cliquez sur le <strong> Suite </strong> déroulant à droite. </li> <li> Dans la liste déroulante, sélectionnez <strong> Suiveurs </strong> pour voir tous vos abonnés Facebook. </li> </ol> <p> </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-mobile\"> Comment voir qui vous suit sur Facebook (mobile) </h2> <p> Comme nous l&#39;avons indiqué précédemment, l&#39;application mobile Facebook vous permet d&#39;accéder à la liste et au nombre de personnes qui vous suivent sur Facebook. </p> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (3 images) </strong> <img alt=\"Facebook profile about info menu\" src=\"images/tap-see-your-about-info-732.png\" loading=\"lazy\"> Développer <img alt=\"Mobile Facebook interface displaying Facebook followers\" src=\"images/tap-see-all-to-load-a-list-of-your-followers-895.png\" loading=\"lazy\"> Développer <img alt=\"Mobile Facebook page displaying a list of followers and their numbers\" src=\"images/look-to-the-upper-right-corner-to-see-the-number-of-followers-677.png\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> Connectez-vous à votre compte Facebook via l&#39;application mobile. Suivez ensuite ces instructions : </p> <ol> <li> Sur la page d&#39;accueil de l&#39;application mobile, appuyez sur l&#39;icône d&#39;image ronde à côté du <strong> Qu&#39;est-ce qui préoccupe votre esprit? </strong> barre de recherche pour charger votre profil. </li> <li> Dans le menu du profil, appuyez sur <strong> Voir vos informations à propos </strong> . </li> <li> Faites défiler vers le bas de la page. Puis sous <strong> Suiveurs </strong> , robinet <strong> Voir tout </strong> pour charger une liste de tous vos abonnés Facebook. </li> <li> Regardez dans le coin supérieur droit de la page (en face <strong> Suiveurs </strong> ) pour voir le nombre de personnes qui vous suivent sur Facebook. </li> </ol> <p> Vous n&#39;aurez pas la possibilité de vérifier vos abonnés Facebook si vous n&#39;en avez pas. Par conséquent, suivre les étapes ci-dessus ne vous permettra pas de vérifier vos abonnés, car il n&#39;y en a pas. </p> <p> Vous pouvez également ne pas obtenir cette option si votre compte Facebook est nouveau, car vous n&#39;avez probablement pas encore d&#39;abonnés. Ou vous devrez peut-être <a href=\"https://www.makeuseof.com/tag/quickly-switch-facebook-profiles/\" target=\"_blank\" rel=\"nofollow noopener\"> passer à un autre compte Facebook </a> . Alternativement, votre compte peut ne pas être configuré pour permettre aux gens de vous suivre sur Facebook. Nous expliquerons comment changer cela ci-dessous. </p> <p> </p> <p> </p> <h2 id=\"how-to-give-the-public-access-to-follow-you-on-facebook\"> Comment donner au public un accès pour vous suivre sur Facebook </h2> <p> Parfois, si vous avez interdit au public de vous suivre, cela limite les chances d&#39;obtenir plus de followers sur Facebook. </p> <p> C&#39;est parce que les personnes qui ne sont pas sur votre liste d&#39;amis ne peuvent pas vous suivre sur Facebook si vous ne les y autorisez pas. Cependant, vous pouvez définir votre préférence de suivi sur « Public » afin que tout le monde puisse vous suivre, plutôt que simplement vos amis. </p> <p> <strong> Pour le faire sur le bureau : </strong> </p> <p> <img alt=\"Facebook privacy settings page\" src=\"images/click-on-public-post-and-change-who-can-follow-you-to-public-880.jpg\" loading=\"lazy\"> </p> <ol> <li> Accédez à votre profil. </li> <li> Clique le <strong> icône de liste déroulante ronde </strong> dans le coin supérieur droit de la barre de menu. </li> <li> Dans la liste, sélectionnez <strong> Paramètres et confidentialité </strong> . </li> <li> Cliquez sur <strong> Paramètres </strong> . </li> <li> Dans la barre latérale du menu Paramètres, cliquez sur <strong> Messages publics </strong> . </li> <li> Regardez à droite du <strong> Qui peut me suivre </strong> option et cliquez sur le <strong> Amis </strong> menu déroulant. </li> <li> Sélectionner <strong> Publique </strong> pour donner accès au suivi à n&#39;importe qui, y compris à ceux qui ne sont pas vos amis sur Facebook. </li> </ol> <p> <strong> Pour le faire sur l&#39;application mobile Facebook : </strong> </p> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (3 images) </strong> <img alt=\"Facebook menu list\" src=\"images/tap-the-three-menu-bars-and-go-to-settings-170.png\" loading=\"lazy\"> Développer <img alt=\"Facebook settings list\" src=\"images/scroll-down-and-select-public-posts-754.png\" loading=\"lazy\"> Développer <img alt=\"Facebook followers settings page\" src=\"images/tick-the-public-option-under-who-can-follow-728.png\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <ol> <li> Ouvrez l&#39;application mobile Facebook et appuyez sur le <strong> trois barres de menu horizontales </strong> à droite de la page d&#39;accueil. </li> <li> Faites défiler vers le bas et sélectionnez <strong> Paramètres </strong> . </li> <li> Robinet <strong> Messages publics </strong> . </li> <li> En dessous de <strong> Qui peut me suivre </strong> , cocher <strong> Publique </strong> . </li> </ol> <p> </p> <h2 id=\"keep-control-over-your-facebook-followers\"> Gardez le contrôle sur vos abonnés Facebook </h2> <p> Si vous utilisez Facebook pour promouvoir votre marque ou votre entreprise, il est nécessaire de garder une trace de vos abonnés. C&#39;est un bon moyen de modérer ce que les gens peuvent voir à votre sujet. </p> <p> Si vous voulez plus de contrôle sur vos amis et abonnés Facebook, vous devriez envisager de les cacher de votre flux. </p>"}