{"title":"Comment utiliser le temps pour marcher avec Apple Fitness+","content":"<p> Apple Fitness+ propose une grande variété d&#39;entraînements vidéo différents qui exploitent la puissance de l&#39;Apple Watch pour offrir un excellent moyen de se mettre en forme. Mais la fonction Time to Walk du service est un peu différente. </p> <p> Au lieu de vous tenir devant un écran, cette fonctionnalité vous encourage à vous promener et à écouter des histoires tout en regardant des photos significatives de stars influentes et uniques. Nous vous en dirons plus sur la fonctionnalité et ce dont vous avez besoin pour commencer ci-dessous. </p> <h2 id=\"what-is-time-to-walk\"> Qu&#39;est-ce que le temps de marcher ? </h2> <p> <img alt=\"Draymond Green Time to walk\" src=\"images/draymond-green-time-to-walk-1-269.jpg\" loading=\"lazy\"> </p> <p> Pensez simplement à Time to Walk comme une expérience unique de type podcast avec des célébrités et d&#39;autres noms influents. Certains des épisodes incluent la légende de la musique country Dolly Parton, la star de la NBA Draymond Green, le musicien Sean Mendes et le lauréat du prix Emmy Uzo Aduba. </p> <p> Dans les épisodes de 25 à 40 minutes, l&#39;invité parlera de ses moments personnels qui façonnent sa vie. Sur l&#39;écran de votre Apple Watch, vous pouvez également voir des photos qui aident à raconter l&#39;histoire. À la fin de l&#39;histoire, vous entendrez une liste de lecture d&#39;histoire de chansons significatives sélectionnées par l&#39;invité. </p> <p> </p> <p> </p> <h2 id=\"getting-started-with-time-to-walk\"> Commencer avec le temps de marcher </h2> <p> Vous devez avoir un abonnement à Apple Fitness+ pour accéder à Time to Walk. Vous avez également besoin d&#39;une Apple Watch Series 3 ou ultérieure et d&#39;un casque Bluetooth, comme les AirPod d&#39;Apple. </p> <p> La bonne nouvelle est que vous n&#39;avez rien à faire pour télécharger un épisode Time to Walk. Tant que votre Apple Watch est en charge et connectée au Wi-Fi, les cinq derniers épisodes seront automatiquement téléchargés sur votre montre. </p> <p> Veuillez noter que la quantité de stockage gratuit sur votre montre peut affecter le nombre d&#39;épisodes disponibles. Une fois que vous avez écouté un épisode, votre montre le supprime automatiquement. Ensuite, un nouvel épisode prendra sa place. </p> <p> Vous pouvez également télécharger un épisode spécifique de Time to Walk à l&#39;aide d&#39;un iPhone. Dirigez-vous vers le <strong> Aptitude </strong> l&#39;application et sélectionnez le <strong> Remise en forme+ </strong> languette. Dans le <strong> Il est temps de marcher </strong> rubrique, choisissez <strong> Afficher tout </strong> . Vous pouvez voir tous les épisodes disponibles ici. </p> <p> Appuyez sur un épisode pour voir plus d&#39;informations sur ce à quoi vous attendre et les chansons de la liste de lecture. Sur cette page, utilisez le <strong> Ajouter </strong> pour télécharger l&#39;épisode sur votre montre. Si l&#39;épisode est déjà téléchargé sur votre montre, il indiquera <strong> Téléchargé </strong> et affichez une coche. </p> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (3 images) </strong> <img alt=\"Apple Activity App\" src=\"images/apple-activity-app-625.jpg\" loading=\"lazy\"> Développer <img alt=\"Apple Fitness+ Time to Walk\" src=\"images/apple-fitness-time-to-walk-841.jpg\" loading=\"lazy\"> Développer <img alt=\"Time to Walk Episode\" src=\"images/time-to-walk-episode-915.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> Si vous possédez une Apple Watch compatible cellulaire, vous n&#39;avez pas à vous soucier d&#39;avoir à télécharger un épisode, car vous pouvez toujours diffuser des épisodes sans avoir besoin d&#39;un iPhone à proximité. </p> <p> </p> <p> Lorsque vous êtes prêt pour une promenade, ouvrez l&#39;Apple Watch <strong> Entraînement </strong> application. Appuyez sur le <strong> Le temps de marcher </strong> épisode pour commencer. Si un mouvement est détecté à l&#39;aide du GPS de l&#39;Apple Watch, l&#39;entraînement est enregistré comme une marche en extérieur. Sinon, l&#39;entraînement comptera comme une marche intérieure. </p> <p> <img alt=\"Apple Watch Time to Walk \" src=\"images/apple-watch-time-to-walk-217.jpg\" loading=\"lazy\"> </p> <p> Pendant que vous marchez, balayez vers la gauche pour verrouiller l&#39;écran de votre montre, mettre en pause l&#39;entraînement ou mettre fin à l&#39;entraînement. Un glissement vers la droite affichera les commandes multimédias et vous permettra de mettre en pause l&#39;audio, de sauter en avant ou en arrière dans l&#39;épisode ou de vous déplacer entre les chansons de la liste de lecture. </p> <p> Si vous souhaitez supprimer manuellement un épisode Time to Walk, ouvrez l&#39;application Workout sur votre Apple Watch et appuyez sur le bouton <strong> je </strong> icône près du nom de la célébrité. Faites défiler vers le bas, puis choisissez <strong> Supprimer </strong> . </p> <p> </p> <h2 id=\"making-exercise-even-better-with-time-to-walk\"> Rendre l&#39;exercice encore meilleur avec le temps de marcher </h2> <p> La marche est l&#39;un des moyens les plus faciles et les plus populaires pour quiconque d&#39;obtenir une dose d&#39;exercice nécessaire. Time to Walk offre un moyen unique de vous motiver lors d&#39;une promenade. </p> <p> Et pour vous assurer d&#39;avoir suffisamment de jus pour une longue marche, suivez nos conseils pour aider à préserver l&#39;autonomie de la batterie de votre Apple Watch. </p>"}