{"title":"Comment transférer un texte sur Android","content":"<p> Si vous souhaitez transférer un texte à quelqu&#39;un à partir de votre appareil Android, vous n&#39;avez pas besoin de le taper ou de copier-coller. Au lieu de cela, vous pouvez utiliser la fonction de transfert. </p> <p> Le processus est légèrement différent selon l&#39;application de messagerie que vous utilisez. Cela dit, les étapes sont simples et à peu près les mêmes. </p> <p> Nous allons vous montrer comment transférer un SMS sur l&#39;application Android Messages et l&#39;équivalent Samsung. </p> <h2 id=\"how-to-forward-a-text-on-android-stock\"> Comment transférer un texte sur Android (Stock) </h2> <ol> <li> Dans l&#39;application Android Messages d&#39;origine, ouvrez la conversation textuelle contenant le message que vous souhaitez transférer. </li> <li> <strong> Appuyez et maintenez </strong> sur le message. </li> <li> Appuyez sur le <strong> trois points verticaux </strong> en haut à droite. </li> <li> Dans la liste, choisissez à qui vous souhaitez transférer le message. Sinon, pour l&#39;envoyer à quelqu&#39;un qui ne figure pas sur cette liste, appuyez sur <strong> Nouveau message </strong> . </li> <li> Le message transféré apparaîtra dans le champ de message. Vous pouvez ajouter ou modifier ce message si nécessaire. Lorsque vous êtes prêt, appuyez sur le <strong> Bouton d&#39;envoi </strong> (flèche droite) pour transférer le message. </li> </ol> <p> </p> <h2 id=\"how-to-forward-a-text-on-samsung-phones\"> Comment transférer un texte sur les téléphones Samsung </h2> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (3 images) </strong> <img alt=\"forward message android\" src=\"images/forward-message-android-497.jpg\" loading=\"lazy\"> Développer <img alt=\"forward message android searching names\" src=\"images/forward-message-android-searching-names-240.jpg\" loading=\"lazy\"> Développer <img alt=\"forward message android multiple names selected\" src=\"images/forward-message-android-multiple-names-selected-924.jpg\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <ol> <li> Ouvrez la conversation textuelle qui contient le message que vous souhaitez transférer. </li> <li> <strong> Appuyez et maintenez </strong> sur le message. </li> <li> Robinet <strong> Avant </strong> . </li> <li> Trouvez le destinataire, soit via le <strong> Conversations </strong> ou alors <strong> Contacts </strong> languette. Appuyez sur leur nom. Vous pouvez sélectionner plusieurs destinataires si vous le souhaitez. </li> <li> Robinet <strong> Fait </strong> . </li> <li> Le message transféré apparaîtra dans le champ de message. Vous pouvez ajouter ou modifier ce message si nécessaire. Lorsque vous êtes prêt, appuyez sur le <strong> Bouton d&#39;envoi </strong> (flèche droite) pour transférer le message. </li> </ol> <p> </p> <p> </p> <h2 id=\"why-can-t-i-forward-a-text-on-android\"> Pourquoi ne puis-je pas transférer un texte sur Android ? </h2> <p> Si vous ne voyez pas d&#39;option de transfert, c&#39;est probablement parce que vous avez sélectionné toute la conversation ou plusieurs textes. Contrairement à certains des <a href=\"https://www.makeuseof.com/tag/messaging-apps-phone-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> meilleures applications de messagerie </a> comme WhatsApp, la plupart des applications SMS ne vous permettent pas de transférer plusieurs textes à la fois. Si vous rencontrez ce problème, assurez-vous de sélectionner un texte. </p> <p> </p> <h2 id=\"forward-your-calls-on-android\"> Transférez vos appels sur Android </h2> <p> Saviez-vous que les messages texte ne sont pas la seule chose que vous pouvez transférer sur Android ? Vous pouvez également configurer un renvoi d&#39;appel afin de pouvoir diriger vos appels vers un autre numéro. </p>"}