{"title":"DeviantArt ajoute une barre latérale et des groupes à son application mobile","content":"<p> Chaque artiste visuel a son propre processus de création, mais il est courant, surtout à l&#39;ère numérique d&#39;aujourd&#39;hui, que la dernière étape de ce processus soit le partage de votre œuvre finie en ligne. </p> <p> Fini le temps où vous deviez trouver des musées qui prendraient vos peintures ou photographies pour que les gens les voient. Au lieu de cela, choisissez une plate-forme qui vous plaît le plus et publiez-la ! </p> <p> Fondée en 2000, DeviantArt est l&#39;une des plus anciennes communautés artistiques sur Internet. DeviantArt a lancé son application mobile en 2017, et sa dernière mise à jour est petite mais importante. </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt pour mobile améliore sa navigation </h2> <p> DeviantArt a amélioré l&#39;interface utilisateur de son application mobile, en ajoutant une barre latérale très similaire à celle du site Web DeviantArt. La barre latérale vous donne un accès rapide à la page d&#39;accueil, aux déviants (artistes) que vous suivez et aux groupes. </p> <p> <strong class=\"gallery__section-title\"> Galerie d&#39;images (2 images) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> Développer <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> Développer </p> <p> Fermer </p> <p> L&#39;accès au dernier élément de cette liste est particulièrement remarquable car avant cette mise à jour, les groupes DeviantArt n&#39;étaient disponibles que sur le site Web. Les groupes DeviantArt fonctionnent de la même manière que <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> Groupes Facebook </a> —collections d&#39;utilisateurs qui se sont regroupés sur la plate-forme avec des intérêts ou des objectifs communs. </p> <p> Dans la barre latérale, vous pouvez appuyer sur <strong> Mes groupes </strong> pour voir tous les groupes dont vous faites partie, ou <strong> Groupes recommandés </strong> pour afficher les groupes qui, selon DeviantArt, vous conviendraient. Vous pouvez également épingler vos groupes préférés en haut de votre barre latérale pour un accès plus facile. </p> <p> Si vous dirigez votre propre groupe, il peut apparaître dans la section recommandée pour d&#39;autres déviants qui pourraient être intéressés à rejoindre. Si un groupe ne vous intéresse pas, vous pouvez appuyer sur les trois points à droite de son nom pour supprimer la recommandation. </p> <p> Lorsque vous visitez un groupe dans l&#39;application, vous verrez à la fois ses écarts (soumissions) et ses publications. Les administrateurs de groupe peuvent publier des mises à jour de leur groupe à partir du flux de publications. </p> <p> <strong> Télécharger: </strong> DeviantArt pour <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> (Libérer) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> Où partagez-vous vos créations en ligne ? </h2> <p> Si vous êtes un artiste, un designer ou un photographe qui est sur Internet depuis longtemps, il est probable que vous ayez déjà été sur DeviantArt. La communauté ne semble pas aussi vivante qu&#39;au début des années 2000, mais le volume des œuvres soumises a explosé ces dernières années. </p> <p> Avec une base d&#39;utilisateurs aussi active, il devrait devenir de la plus haute importance pour DeviantArt d&#39;améliorer son application mobile. Au moment de la rédaction, l&#39;application est notée 2.6/5.0 sur l&#39;App Store et 3.2/5.0 sur Google Play. </p>"}