{"title":"Découvrez la version du navigateur de Microsoft&amp;#039;s xCloud","content":"<p> Si vous attendiez avec impatience des nouvelles sur le port du navigateur xCloud, alors aujourd&#39;hui est votre jour de chance car vous pouvez jeter un œil à ce à quoi il ressemble réellement. </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> Les testeurs révèlent des captures d&#39;écran du navigateur xCloud </h2> <p> xCloud est actuellement disponible sur une gamme d&#39;appareils, mais nous attendons toujours que Microsoft publie officiellement la version du navigateur. </p> <p> Les détails ont été assez rares... jusqu&#39;à maintenant. Selon un rapport de <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> Le bord </a> , &quot;des sources familières avec les plans Xbox de Microsoft&quot; affirment que &quot;les employés testent maintenant une version Web de xCloud avant une préversion publique&quot;. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Voici un premier aperçu de xCloud de Microsoft pour le web <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> – Le bord (@verge) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> 15 février 2021 </a></blockquote>  <p> N&#39;oubliez pas qu&#39;il ne s&#39;agit que d&#39;images de testeurs, ce qui signifie que, bien que cela soit peu probable, Microsoft pourrait changer complètement l&#39;apparence de la version du navigateur xCloud. </p> <p> D&#39;après les captures d&#39;écran, il semble que xCloud soit configuré comme la version Android, disponible sur les smartphones et les tablettes. </p> <p> Vous pouvez voir les jeux récemment ajoutés en haut de la capture d&#39;écran, suivis d&#39;une section &quot;À venir&quot;. En dessous, vous avez différentes options pour sélectionner un genre de jeu de votre choix, avec la bibliothèque complète de jeux xCloud disponible en bas de la page. </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> Comment accédez-vous à xCloud dans votre navigateur ? </h2> <p> Actuellement, vous ne pouvez pas. La version publique du port Web de xCloud n&#39;est pas encore disponible. Ce qui signifie que vous devez attendre un peu plus longtemps si vous souhaitez accéder à xCloud via votre navigateur. Apparemment, Microsoft a l&#39;intention de révéler le service publiquement au deuxième trimestre de 2021. </p> <p> Jusque-là, vous devrez trouver d&#39;autres méthodes pour accéder à xCloud. Actuellement, vous ne pouvez accéder au service de cloud gaming que sur les appareils Android (vous avez besoin de la version du navigateur pour jouer sur iOS, grâce à <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> une querelle entre Apple et Microsoft </a> ). </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> Pouvez-vous accéder aux jeux xCloud d&#39;une autre manière ? </h2> <p> Eh bien, oui et non. Vous ne pouvez accéder à aucun titre sur xCloud, pour ainsi dire. Non, sauf si vous utilisez un appareil Android et l&#39;application officielle Game Pass pour le faire. </p> <p> Cependant, les jeux disponibles sur le service de cloud gaming de Microsoft sont tous disponibles sur Game Pass. En fait, vous avez accès à xCloud dans le cadre d&#39;un abonnement Game Pass Ultimate. Vous pouvez donc toujours accéder à ces jeux via votre Xbox ou un PC Windows. </p> <p> Alors, en un mot, oui. Vous pouvez accéder à ces jeux d&#39;une autre manière. Ne pas utiliser xCloud, sauf si vous avez accès à la version Android. </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud : bientôt disponible sur un appareil iOS près de chez vous </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> Vous ne devriez pas attendre longtemps avant de pouvoir vous procurer la plate-forme de jeux en nuage de Microsoft. Une fois que xCloud aura été testé, Microsoft apportera les modifications nécessaires avant de nous laisser tous jeter un coup d&#39;œil et, espérons-le, peu de temps après, d&#39;y jouer également. </p>"}