{"title":"Disney+ c&#39;est près de 100 millions d&#39;abonnés","content":"<p> Ne sous-estimez jamais Disney. Alors que Disney+ n&#39;a été lancé aux États-Unis qu&#39;en novembre 2019, le service de streaming compte désormais près de 100 millions d&#39;abonnés. C&#39;est une croissance que même l&#39;entreprise n&#39;attendait pas. </p> <h2 id=\"how-many-customers-does-disney-have\"> Combien de clients Disney+ a-t-il ? </h2> <p> Comme annoncé dans le <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Rapport sur les résultats du premier trimestre 2021 de Disney </a> , Disney+ compte 94,9 millions d&#39;abonnés dans le monde au 2 janvier 2021. </p> <p> Cela signifie que le chiffre ne prend pas en compte les abonnés gagnés grâce à la sortie réussie de WandaVision. Il ne serait pas injuste de supposer que Disney+ compte désormais plus de 100 millions d&#39;abonnés. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Les derniers chiffres ont été publiés en décembre 2020, lorsque Disney a annoncé qu&#39;il avait ensaché 86 millions d&#39;abonnés pour son service de streaming titulaire. Le bond depuis lors peut probablement être attribué à un contenu exclusif fort comme la saison deux de The Mandalorian et le long métrage de Pixar Soul. </p> <p> Le revenu mensuel moyen par abonné est passé de 5,56 $ il y a un an à 4,04 $ aujourd&#39;hui, ce qui s&#39;explique principalement par le coût moins élevé du service en Inde et en Indonésie. </p> <p> Hulu et ESPN+, des services de streaming également détenus par Disney, ont également connu une forte croissance. Le premier a augmenté de 30 % en glissement annuel pour atteindre 39,4 millions d&#39;abonnés, tandis que le second a augmenté de 83 % en glissement annuel pour un total de 12,1 millions d&#39;abonnés. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney a récemment lancé un bundle combinant tous ses services de streaming </a> , il est donc clair que la société continue de soutenir les trois. </p> <p> Star devrait également être lancé prochainement dans de nombreuses régions, ce qui augmentera considérablement le nombre de films et d&#39;émissions de télévision proposés par Disney +. </p>"}