{"title":"De quel chargeur avez-vous besoin pour le Samsung Galaxy S21 ?","content":"<p> Dans ce qui a pu être un choc pour les utilisateurs fidèles de Samsung, le fabricant phare a décidé de ne pas inclure de chargeur dans la boîte pour les Galaxy S21, Galaxy S21+ et Galaxy S21 Ultra. </p> <p> Cela fait suite au grand mouvement d&#39;Apple de retirer le chargeur de la série iPhone 12, obligeant les consommateurs à utiliser un chargeur pré-acheté ou à en acheter un nouveau. </p> <p> Alors maintenant, vous vous demandez probablement ce que vous êtes censé rechercher dans un chargeur. Nous avons répertorié ce que vous devez savoir lors de l&#39;achat d&#39;un nouveau chargeur pour votre Samsung Galaxy S21. </p> <h2 id=\"galaxy-s21-charger-how-many-watts-do-you-need\"> Chargeur Galaxy S21 : de combien de watts avez-vous besoin ? </h2> <p> Si vous êtes <a href=\"https://www.makeuseof.com/samsung-galaxy-s21-worth-upgrading/\" target=\"_blank\" rel=\"nofollow noopener\"> passer à la série Samsung Galaxy S21 </a> , vous trouverez plusieurs mises à niveau intéressantes et un gros déclassement : l&#39;exclusion d&#39;un chargeur comme l&#39;un des cadeaux. Au lieu de cela, Samsung vous fournit uniquement un câble USB-C pour le transfert de données ou la connexion à une brique de chargeur existante. </p> <p> La chose la plus importante lors de l&#39;achat de votre chargeur, ou de la réutilisation d&#39;un ancien, est de vous assurer qu&#39;il est entièrement compatible. </p> <ul> <li> La gamme Samsung Galaxy S21 est compatible avec les chargeurs USB-C prenant en charge USB Power Delivery 3.0, <strong> jusqu&#39;à 25 watts </strong> , ou Charge rapide 2.0. </li> <li> Des chargeurs qui fournissent de l&#39;énergie <strong> inférieur à 25 watts fonctionnera toujours </strong> , mais chargera le téléphone beaucoup plus lentement. </li> </ul> <p> Cela s&#39;applique également si vous choisissez de le charger via votre ordinateur portable ou un autre appareil. Vérifiez donc la capacité du chargeur à activer les fonctions de charge ultra-rapide ou rapide sur votre appareil. </p> <p> Pour une charge de 25 W, une charge de 30 minutes vous donnera environ 50 % d&#39;autonomie. </p> <p> </p> <h2 id=\"what-types-of-charger-work-with-the-s21\"> Quels types de chargeur fonctionnent avec le S21 ? </h2> <p> <img alt=\"samsung wireless charging\" src=\"images/wireless-charger-221.jpg\" loading=\"lazy\"> Crédit d&#39;image : <a href=\"https://www.samsungmobilepress.com/mediaresources/wiresless_charger_trio/images?imgType=lifeStyle\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Samsung </a> </p> <p> Après avoir vérifié la capacité d&#39;alimentation qui convient à votre appareil Galaxy, vous pouvez désormais choisir parmi différents types de chargeurs adaptés à votre style de vie et à votre confort : </p> <ul> <li> <strong> Chargeurs muraux : </strong> Les chargeurs muraux sont livrés avec une brique qui agit comme une fiche à insérer dans votre prise murale avec un port USB à une extrémité. Ces chargeurs sont les plus courants parmi les types de chargeurs et peuvent généralement vous donner la capacité de charge maximale de votre téléphone. Le Samsung Galaxy S21 prend en charge les chargeurs muraux jusqu&#39;à 25 W pour une charge rapide. </li> <li> <strong> Banques d&#39;alimentation : </strong> Les banques d&#39;alimentation sont une source d&#39;alimentation portable pour charger tous les articles alimentés par batterie tels que les téléphones portables. Ils fourniront généralement bien en dessous des 25 W nécessaires pour une charge rapide, mais sont bons comme alimentation de secours. Il est préférable de regarder les banques d&#39;alimentation approuvées par Samsung pour votre Galaxy S21. </li> <li> <strong> Chargeurs sans fil : </strong> Les chargeurs sans fil ou les chargeurs inductifs sont de plus en plus populaires en tant que plates-formes qui chargent votre téléphone lorsque vous le posez dessus ou le posez à l&#39;endroit indiqué par le chargeur. <a href=\"https://www.makeuseof.com/wireless-charging-how-it-works-and-everything-else-you-must-know/\" target=\"_blank\" rel=\"nofollow noopener\"> Chargement sans fil </a> aide à ne pas user la prise de votre smartphone et empêche la surchauffe car il s&#39;éteint automatiquement lorsque votre appareil est complètement chargé. Il délivre environ 15W de puissance. </li> </ul> <p> </p> <h2 id=\"how-to-find-the-right-charger\"> Comment trouver le bon chargeur </h2> <p> Un bon chargeur n&#39;a pas à parler de lui-même. Il existe des forums sur Internet qui fournissent des critiques fiables sur le produit après un certain temps de test. </p> <p> <img alt=\"samsung wall charger\" src=\"images/samsung-charger-479.jpg\" loading=\"lazy\"> </p> <p> Certains des facteurs déterminants d&#39;un bon chargeur sont sa durabilité et sa longévité, une bonne régulation de la tension de sortie, une isolation acoustique et une certification intégrée, comme indiqué par les symboles CE, MFI et RoHS sur la brique ou le boîtier du chargeur. </p> <p> Même si vous décidez de ne pas opter pour un chargeur officiel Samsung, cela vaut toujours la peine de choisir une marque connue plutôt que l&#39;un des modèles bon marché que vous trouverez sur des sites comme Ebay. Ou, bien sûr, vous pouvez utiliser un chargeur d&#39;un ancien téléphone. </p> <p> </p> <h2 id=\"use-an-old-charger-with-the-s21\"> Utiliser un ancien chargeur avec le S21 </h2> <p> Bien qu&#39;il soit décevant qu&#39;il n&#39;y ait pas de chargeur dans la boîte du S21, Samsung estime que la plupart des utilisateurs en auront déjà un (ou plusieurs) de toute façon, et ils ont probablement raison. Le S20 avait un chargeur de 25 W, et la plupart des autres téléphones des dernières années ont eu des chargeurs de 15 à 25 W, et parfois même plus. Vous n&#39;aurez peut-être pas du tout besoin d&#39;acheter un nouveau chargeur. </p> <p> Et si vous passez à un appareil Samsung pour la première fois, vous aurez peut-être besoin d&#39;aide pour vous habituer à One UI. Assurez-vous de consulter nos conseils et astuces sur l&#39;utilisation de ce logiciel pour vous mettre à jour. </p>"}