{"title":"Entrez dans la troisième dimension : travailler avec des flux de travail 3D dans Adobe After Effects","content":"<p> Si vous cherchez à améliorer votre flux de travail Adobe After Effects, vous devrez éventuellement commencer à gérer l&#39;axe Z, ce qui vous permettra de manipuler la profondeur 3D d&#39;un objet. </p> <p> Cela ouvre une gamme de nouveaux visuels et styles avec lesquels vous pouvez travailler, mais crée également ses propres ensembles de limitations et de considérations. </p> <p> Dans cet article, nous verrons comment activer et utiliser les calques 3D, ainsi que comment ajouter et animer des caméras 3D pour créer des mouvements dynamiques. Un scénario dans lequel nous animons et déplaçons du texte dans un espace 3D sera également examiné. </p> <p> Allons-y ! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> Comment activer et animer les calques 3D </h2> <p> Dans votre composition, vous pouvez basculer vos calques dans votre timeline pour les activer en 3D. </p> <p> Il s&#39;agit d&#39;un processus très simple. Trouvez simplement le <strong> cube </strong> pour vos calques dans votre chronologie, et cliquez sur la case en dessous pour activer la 3D pour ce calque. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> Une fois cela fait, vous ne verrez probablement aucun changement immédiat. Cependant, si vous accédez à vos paramètres de position, d&#39;échelle et de rotation dans votre calque, vous verrez qu&#39;un troisième ensemble de nombres ajustables est apparu. </p> <p> Ces nouveaux nombres dictent désormais votre rotation, votre position et votre échelle sur l&#39;axe Z dans l&#39;espace 3D. Tout comme vos autres paramètres, ils peuvent être des images clés pour permettre l&#39;animation et la manipulation. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> À titre d&#39;exemple, créons une composition et un calque de texte avec quelques mots. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Une fois cela fait, activez le calque 3D. Notez que si vous prévoyez d&#39;utiliser le <strong> Aligner </strong> outil pour vous assurer que votre calque est parfaitement centré, vous devrez le faire avant d&#39;activer la 3D. C&#39;est parce que le <strong> Aligner </strong> l&#39;outil ne fonctionne que sur les calques 2D. </p> <p> Maintenant que notre calque de texte est un calque 3D, nous pouvons le déplacer dans l&#39;espace 3D le long de l&#39;axe Z. Alors, faisons déplacer le texte &quot;vers l&#39;écran&quot;. </p> <p> Tout d&#39;abord, nous allons définir notre paramètre Z-Axis. Par défaut, il est mis à zéro. Mettons-le à <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Maintenant, nous allons parcourir deux secondes dans notre chronologie et définir la valeur de notre axe Z sur <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> Avec ce changement, nous devrions maintenant voir le texte se déplacer « vers » l&#39;écran. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> Que sont les caméras 3D ? </h2> <p> Nous avons animé avec succès un objet dans l&#39;espace 3D d&#39;After Effects. Mais que se passe-t-il si vous avez plusieurs objets et que vous souhaitez donner l&#39;impression que le spectateur s&#39;approche ou s&#39;éloigne d&#39;eux ? </p> <p> Vous pourriez simplement animer chaque élément individuel pour qu&#39;il se déplace vers vous, mais cela prendrait beaucoup de temps et ne serait pas particulièrement efficace. C&#39;est là que vous utiliseriez une caméra 3D. </p> <p> </p> <p> Si vous utilisez un logiciel 3D tel que Cinema 4D ou Blender, il est probable que vous ayez déjà utilisé des caméras 3D. Si vous avez déjà joué à un jeu informatique, vous avez également fait l&#39;expérience d&#39;une caméra 3D qui déplace votre vue dans un monde 3D. </p> <p> Tout cela peut sembler complexe au premier abord, mais les caméras 3D fonctionnent exactement comme une vraie caméra. Ils vous donnent un champ de vision qui peut être manipulé et déplacé dans un espace 3D. </p> <p> Travaillons sur un exemple. </p> <h3 id=\"setting-up-a-3d-camera\"> Configuration d&#39;une caméra 3D </h3> <p> Pour commencer, créez plusieurs calques de texte 3D et positionnez-les séquentiellement sur l&#39;axe Z. </p> <p> Dans cet exemple, un écart de <strong> 3 000 pixels </strong> entre chaque couche a été utilisé. La première couche se situe à zéro, la suivante à 3 000, la suivante à 6 000, et ainsi de suite. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Maintenant, il est temps de créer une caméra 3D en cliquant sur <strong> Couche </strong> &gt; <strong> Nouveau </strong> &gt; <strong> Caméra </strong> , sur laquelle vous verrez une fenêtre pour ajuster les paramètres de votre nouveau calque de caméra. Ceux-ci se présentent sous deux types : <strong> Un nœud </strong> et <strong> Deux nœuds </strong> . </p> <p> le <strong> Un nœud </strong> La caméra est conçue pour faire fonctionner et émuler une caméra du monde réel aussi fidèlement que possible, et le point de focalisation est désigné manuellement par le mouvement de la caméra. </p> <p> UNE <strong> Deux nœuds </strong> La caméra est conçue pour suivre un seul point d&#39;intérêt, ce qui la rend idéale pour orbiter ou suivre un objet en mouvement. </p> <p> Dans ce scénario, le <strong> Un nœud </strong> la caméra sera utilisée. Vous remarquerez un certain nombre de paramètres supplémentaires dans la fenêtre, tels que <strong> Zoom </strong> , <strong> Angle de vue </strong> , <strong> Activer la profondeur de champ </strong> , et <strong> Distance focale </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Ceux-ci sont destinés à refléter les paramètres de l&#39;appareil photo du monde réel. Si vous connaissez leur fonctionnement, n&#39;hésitez pas à jouer avec. Sinon, vous pouvez choisir une série de préréglages dans le coin supérieur droit. </p> <p> Nous allons sélectionner le <strong> 35 mm </strong> prédéfini pour l&#39;instant. Maintenant que notre couche de caméra est configurée et dans la scène, vous ne verrez pas beaucoup de différence au début. </p> <h3 id=\"using-3d-camera-navigation\"> Utilisation de la navigation par caméra 3D </h3> <p> Il existe deux méthodes pour ajuster et animer la vue de la caméra. Le plus précis consiste à saisir différents <strong> Positionner </strong> valeurs dans le <strong> Transformer </strong> paramètres de la couche caméra. Vous pouvez ensuite créer des images clés comme vous le feriez pour animer n&#39;importe quel autre calque. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> Lorsque vous déplacez la caméra, vous remarquerez que tous les autres objets 3D de votre scène se déplaceront par rapport à celle-ci. Notez que la caméra <strong> n&#39;affecte pas les calques 2D </strong> . </p> <p> Alors, configurons notre caméra pour qu&#39;elle se déplace sur l&#39;axe Z de zéro à 9 000 sur un intervalle de quatre secondes, et créons une image clé de notre mouvement. </p> <p> Voilà! Si vous l&#39;avez configuré correctement, les mots doivent pousser &quot;vers&quot; vous, &quot;à travers&quot; le champ de vision et &quot;derrière&quot; le spectateur. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> Autres façons de déplacer la caméra 3D </h3> <p> Si vous préférez être un peu plus expérimental et moins axé sur les chiffres avec votre appareil photo, il existe d&#39;autres moyens de vous déplacer, de naviguer et de régler. le <strong> Orbite </strong> , <strong> Poêle </strong> , et <strong> Chariot </strong> les outils en haut de la barre d&#39;outils vous permettent de le faire. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> En les utilisant, vous pouvez cliquer et faire glisser pour vous déplacer d&#39;un côté à l&#39;autre ( <strong> Poêle) </strong> , tournez autour de ( <strong> Orbite </strong> ), et effectuez un zoom avant et arrière ( <strong> Chariot </strong> ). Ces commandes sont moins précises que la saisie de nombres, mais elles sont idéales pour planifier vos mouvements et animations de caméra approximatifs. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> La pratique mène à la perfection </h2> <p> Vous devriez maintenant pouvoir créer et animer des calques 3D le long de l&#39;axe Z, et également travailler avec des caméras 3D pour naviguer avec plusieurs objets 3D. </p> <p> Si vous aimez travailler dans un espace 3D, vous voudrez peut-être explorer les possibilités plus avancées qu&#39;un logiciel 3D plus dédié, tel que Blender, peut offrir. </p>"}