{"title":"Encore une autre marque non officielle de façade PS5 est sur la scène","content":"<p> dbrand, qui fabrique des skins, des écrans et des étuis pour une variété d&#39;appareils, s&#39;est joint à l&#39;appâtage de Sony et a publié sa propre façade PS5 non officielle. </p> <h2 id=\"dbrand-releases-darkplates\"> dbrand lance les Darkplates </h2> <p> Si vous cherchez à personnaliser votre PS5, dbrand est la dernière entreprise à proposer des façades tierces non officielles pour la console de nouvelle génération. Ils les appellent Darkplates, parce que ce sont des façades noires. </p> <p> Vous pouvez vérifier les plaques sur le <a href=\"https://dbrand.com/shop/special-edition/ps5\" target=\"_blank\" rel=\"nofollow noopener\"> magasin dbrand </a> , où vous pouvez acheter les façades noires mates pour 49,00 $ (au moment de la rédaction). </p> <p> Vous pouvez également choisir ce que dbrand appelle une &quot;peau moyenne&quot;, qui est un autocollant en vinyle qui recouvre le panneau central noir très brillant de la PS5. Cela coûte 11,95 $ de plus et est disponible dans une gamme de couleurs et de designs. </p> <p> <img alt=\"dbrand shell texture detail\" src=\"images/dbrand-shell-texture-detail-544.png\" loading=\"lazy\"> </p> <p> Vous remarquerez également qu&#39;il se vante de sa texture de plaque frontale. Ceci est similaire à <a href=\"https://www.makeuseof.com/sony-how-ps5-controller-textured-playstation-symbols/\" target=\"_blank\" rel=\"nofollow noopener\"> les petits symboles PlayStation que vous trouverez sur le DualSense </a> , d&#39;autres accessoires PS5 officiels et les façades propriétaires qui sont attachées à la console lorsque vous l&#39;achetez. Similaires, mais sont-ils aussi impressionnants ? </p> <p> </p> <h2 id=\"will-dbrand-last\"> Est-ce que dbrand durera ? </h2> <p> Vous avez sans doute vu notre <a href=\"https://www.makeuseof.com/cmp-shells-ps5-faceplate-colors/\" target=\"_blank\" rel=\"nofollow noopener\"> couverture frontale concernant les shells CMP </a> , ce qui a fait un retour auto-triomphe après l&#39;interdiction de Sony. Certains pourraient dire que son retour était arrogant, car il a déclaré ses nouvelles façades légalement intouchables. On verra. </p> <p> </p> <p> Cela vous fait vous demander pourquoi dbrand s&#39;est même embêté. Sony catégoriquement <strong> n&#39;a pas </strong> prenez gentiment à CMP Shells, d&#39;abord parce que son ancien nom de marque était trop similaire à PlayStation (PlateStation). </p> <p> Ensuite, Sony a contesté car il a décidé que les façades faisaient partie de la conception de la console, et donc les copier était une violation de la propriété intellectuelle. Cue le claquement du marteau d&#39;interdiction. CMP Shells a mis fin à la production, annulant toutes les commandes avant de réapparaître sous sa nouvelle forme. </p> <p> dbrand en est déjà à sa quatrième vague de préventes de clients potentiellement non satisfaites, vous devez donc être rapide si vous souhaitez saisir l&#39;une des faces avant personnalisées. La question de savoir si les plaques atteindront réellement la production est une autre affaire. Sony pourrait bien faire tomber le marteau à nouveau. </p> <p> </p> <h2 id=\"should-you-buy-a-dbrand-faceplate\"> Devriez-vous acheter une façade dbrand ? </h2> <p> Comme pour la saga CMP Shells, nous conseillons à tous ceux qui souhaitent personnaliser leurs façades PS5 de faire preuve de prudence. Ce sont des produits tiers, et vous n&#39;avez donc aucun moyen de confirmer leur qualité autre que ce que la marque vous dit. </p> <p> De plus, étant donné l&#39;insistance de Sony sur le fait que PlateStation (maintenant CMP Shells) doit cesser la production, il ne sera pas surprenant qu&#39;elle ne compose pas un numéro abrégé de ses avocats pour également s&#39;occuper du cas de dbrand. </p> <p> Bref, soyez prudent si vous souhaitez personnaliser vos plastrons. CMP Shells a remboursé tous ses clients la première fois. Mais cela ne veut pas dire qu&#39;une autre marque le fera. </p> <p> </p> <h2 id=\"do-you-really-need-to-customize-your-ps5\"> Avez-vous vraiment besoin de personnaliser votre PS5 ? </h2> <p> <img alt=\"ps5\" src=\"images/ps5-183.jpg\" loading=\"lazy\"> </p> <p> Si vous n&#39;êtes pas satisfait de l&#39;apparence de votre PS5, vous pouvez toujours la modifier d&#39;une autre manière (nettement moins chère). Vous pouvez toujours ajouter une peau de vinyle à la console si vous voulez qu&#39;elle soit différente. </p> <p> La PS5 n&#39;a été lancée qu&#39;en novembre 2020. Essayez peut-être de jouer à quelques jeux dessus avant de ressentir l&#39;envie irrésistible de changer l&#39;apparence cosmétique de votre console. </p>"}