{"title":"Google ajoute un mode sombre à l&#39;invite 2FA sur Android","content":"<p> <a href=\"https://www.makeuseof.com/dark-mode-android/\" target=\"_blank\" rel=\"nofollow noopener\"> Amateurs de mode sombre </a> sont en train de se régaler aujourd&#39;hui, car Android obtient un thème sombre pour son invite d&#39;authentification à deux facteurs. Cela signifie que la connexion avec 2FA ne gâchera plus le mode sombre de votre téléphone avec un écran à thème lumineux hideux chaque fois que vous devez vous connecter quelque part. </p> <h2 id=\"dark-mode-two-factor-authentication\"> Authentification à deux facteurs en mode sombre </h2> <p> L&#39;équipe à <a href=\"https://9to5google.com/2021/02/11/google-prompt-dark-theme/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> a découvert l&#39;invite 2FA en mode sombre sur Android déployée pour certains utilisateurs. Il prend la même invite &quot;Est-ce que vous essayez de vous connecter&quot; et la trempe dans un thème gris foncé qui sera agréable pour vos yeux et moins choquant par rapport au reste de votre téléphone. </p> <p> En dehors de l&#39;ajout du mode sombre, l&#39;invite 2FA a également reçu un petit ajustement. Les boutons ont été légèrement séparés pour qu&#39;il soit plus facile de choisir le bon lorsque vous essayez de vous connecter à l&#39;un de vos comptes. </p> <p> Un petit ajustement vient au texte, car Google a correctement mis le texte en majuscule, lui donnant un aspect plus professionnel qu&#39;auparavant. </p> <p> </p> <h2 id=\"when-can-you-get-dark-mode-on-2fa\"> Quand pouvez-vous obtenir le mode sombre sur 2FA ? </h2> <p> Google a commencé à déployer le thème du mode sombre sur son invite 2FA la semaine dernière, vous devriez donc l&#39;avoir disponible sur votre appareil maintenant. Activez simplement le thème du mode sombre et vous devriez être prêt à partir. Si vous ne le voyez pas encore, vous devrez attendre un peu plus longtemps, car Google travaille à l&#39;amener sur tous les appareils. </p>"}