{"title":"Google publie une IA expérimentale qui simule la synesthésie","content":"<p> Vassily Kandinsky a abandonné sa carrière d&#39;avocat pour étudier la peinture à l&#39;Académie des Beaux-Arts de Munich. Il est considéré comme l&#39;un des fondateurs de l&#39;abstraction pure en peinture, et cela pourrait être dû à la façon intrigante dont il percevait les couleurs et les formes. </p> <p> Cet outil d&#39;IA vous permet d&#39;emprunter les oreilles de Kandinsky. Vous pouvez maintenant entendre ce qu&#39;il a fait en peignant (ou du moins, l&#39;interprétation de Google de ce qu&#39;il a décrit). </p> <h2 id=\"what-if-you-could-hear-color\"> Et si vous pouviez entendre la couleur ? </h2> <p> En collaboration avec le Centre Pompidou à Paris, Google Arts &amp; Culture a lancé un projet expérimental appelé <a href=\"https://artsandculture.google.com/experiment/sgF5ivv105ukhA\" target=\"_blank\" rel=\"nofollow noopener\"> Jouez un Kandinsky </a> . </p> <p> Comme son nom l&#39;indique, l&#39;outil interactif vous permet de découvrir les peintures abstraites de Vassily Kandinsky sous forme musicale. Kandinsky était un peintre russe qui souffrait d&#39;une maladie neurologique appelée synesthésie. </p> <p> <img alt=\"A screenshot of the second part of Play a Kandinsky\" src=\"images/play-kandinsky-screenshot-2-986.png\" loading=\"lazy\"> </p> <p> La partition, composée par Antoine Bertin et NSDOS, a été inspirée par la musique de l&#39;époque de Kandinsky et générée sur Transformer de Google <a href=\"https://www.makeuseof.com/tag/what-are-neural-networks/\" target=\"_blank\" rel=\"nofollow noopener\"> réseau neuronal </a> . </p> <p> En cliquant <strong> Lancer le test </strong> , la musique est diffusée et l&#39;IA vous demande de cliquer plusieurs fois sur un cercle au milieu de l&#39;écran. Chaque fois que vous le faites, les couleurs du cercle et de l&#39;arrière-plan changeront, ainsi que la musique. </p> <p> La synesthésie est une condition qui affecte votre perception : stimuler un sens déclenche une expérience automatique et involontaire dans un autre. Par exemple, un synesthète (une personne souffrant de synesthésie) peut penser au nombre &quot; 4&quot; et voir du rouge, ou goûter des pommes lorsqu&#39;il entend le mot &quot;ami&quot;. </p> <p> Pour Kandinsky, avoir une synesthésie signifiait qu&#39;il voyait des couleurs lorsqu&#39;il entendait de la musique et qu&#39;il entendait de la musique lorsqu&#39;il peignait. &quot;Le son des couleurs est si précis qu&#39;il serait difficile de trouver quelqu&#39;un qui exprimerait un jaune vif avec des notes basses ou un lac sombre avec des aigus&quot;, a-t-il dit un jour. </p> <p> <img alt=\"Yellow-Red-Blue (1925), by Wassily Kandinsky\" src=\"images/yellow-red-blue-kandinsky-947.png\" loading=\"lazy\"> </p> <p> En 1925, il a créé un chef-d&#39;œuvre qu&#39;il a appelé Jaune-Rouge-Bleu (photo ci-dessus). C&#39;est une peinture à l&#39;huile qui le distingue des mouvements artistiques influents de son temps, à savoir le constructivisme et le suprématisme. </p> <p> La troisième partie de Play a Kandinsky permet d&#39;entendre le tableau dans une symphonie classique de sept mouvements. Ses utilisations généreuses du bleu et du jaune contrastant fortement l&#39;un avec l&#39;autre suivent le <a href=\"https://www.makeuseof.com/how-to-use-color-theory-elevate-your-creative-projects/\" target=\"_blank\" rel=\"nofollow noopener\"> théorie des couleurs </a> du poète allemand Johann Wolfgang von Goethe. </p> <p> Google attribue des couleurs et des formes à Kandinsky de la même manière que vous attribueriez les touches et les cordes d&#39;un instrument à un musicien. « Un artiste extraordinairement doué, il a arrangé des sons de couleurs en symphonies de couleurs », le <a href=\"https://artsandculture.google.com/story/the-sound-of-colours/0ALymHuhPl1jLg\" target=\"_blank\" rel=\"nofollow noopener\"> histoire </a> lit. </p> <p> </p> <h2 id=\"there-s-more-to-art-than-meets-the-eye\"> Il y a plus à l&#39;art qu&#39;à l&#39;œil nu </h2> <p> Nous ne saurons jamais exactement ce que Kandinsky a entendu pendant qu&#39;il travaillait, mais ce sont des projets comme celui-ci qui suscitent vraiment créativité et introspection. </p> <p> Il existe peut-être une sorte de lien entre l&#39;art et la musique que la plupart d&#39;entre nous ne sont pas en mesure de comprendre complètement. L&#39;expérience de Google explore bien cette possibilité. </p> <p> <small> Crédit d&#39;image: Vassily Kandinsky/ <a href=\"https://commons.wikimedia.org/wiki/File:Kandinsky_-_Gelb-Rot-Blau,_1925.jpg\" rel=\"nofollow noopener\" target=\"_blank\"> Wikimedia Commons </a></small> </p>"}