{"title":"Google ajoute la prise en charge de Face ID à Chrome pour iOS","content":"<p> Google teste une nouvelle fonctionnalité de sécurité dans Chrome 89 pour iOS qui utilise l&#39;authentification biométrique de l&#39;iPhone pour protéger vos onglets de navigation privée. Actuellement limité aux utilisateurs de la version bêta de Chrome, cela vous permettra de verrouiller vos onglets de navigation privée avec Face ID ou Touch ID. </p> <h2 id=\"even-more-private-private-browsing\"> Encore plus de navigation privée </h2> <p> Tous les onglets de navigation privée protégés par Face ou Touch ID sont flous dans le sélecteur d&#39;onglets. Les onglets verrouillés redeviennent visibles une fois confirmés avec l&#39;authentification biométrique de l&#39;‌iPhone‌. </p> <p> Cette fonctionnalité utile améliore non seulement votre confidentialité, mais renforce également votre sécurité lorsque vous effectuez plusieurs tâches à la fois sur plusieurs applications sur votre iPhone ou iPad. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> note que tous les utilisateurs bêta ne peuvent pas accéder à la nouvelle option de verrouillage en raison d&#39;un composant côté serveur. </p> <p> </p> <h2 id=\"how-s-this-useful\"> En quoi est-ce utile ? </h2> <p> C&#39;est également utile lorsqu&#39;un ami peut demander à emprunter votre iPhone pour rechercher rapidement quelque chose en ligne. Avec la protection Face ID pour le mode de navigation privée de Chrome, ils ne pourront pas voir vos sites Web ouverts en mode navigation privée lorsqu&#39;ils changent d&#39;onglet. </p> <p> </p> <p> &quot;Incognito&quot; est un nom marketing pour le mode de navigation privée de Chrome. En mode navigation privée, vous pouvez naviguer sur le Web sans que Chrome n&#39;enregistre aucune information sur la session. Lorsque vous fermez une fenêtre de navigation privée, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> toutes les informations sur cette session disparaissent </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> Comment activer Face ou Touch ID dans Chrome </h2> <p> Cette nouvelle fonctionnalité à venir doit être activée manuellement dans la section Confidentialité des paramètres de l&#39;application Chrome. Un verrou de confidentialité similaire est présent dans d&#39;autres applications Google. </p> <p> Dans l&#39;application native Search, par exemple, l&#39;authentification biométrique de l&#39;iPhone confirme votre identité lors du retour à une session Incognito après 15 minutes. Une authentification facultative Face ou Touch ID est également disponible dans Google Drive pour protéger vos fichiers lorsque vous quittez l&#39;application. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> Quand la fonctionnalité sortira-t-elle officiellement ? </h2> <p> On ne sait pas encore quand la nouvelle option de verrouillage pourrait être lancée pour tout le monde, mais Chrome 89 devrait être disponible pour le public le mois prochain. Google pourrait également décider de ne pas publier la fonctionnalité du tout malgré sa liste dans les notes de version officielles. </p>"}