{"title":"HBO Max sera lancé en Amérique latine en juin","content":"<p> HBO Max, le service de streaming de WarnerMedia, sera lancé en Amérique latine et dans les Caraïbes en juin 2021. C&#39;est la première fois que le service sera disponible en dehors des États-Unis. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> Où HBO Max est-il lancé en Amérique latine ? </h2> <p> Pour le moment, HBO Max n&#39;est disponible qu&#39;aux États-Unis. Arrivé fin juin 2021, il sera disponible dans de nombreux pays d&#39;Amérique latine et des Caraïbes. La nouvelle a été annoncée dans un <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> Communiqué de presse WarnerMedia </a> . </p> <p> Plus précisément, ces pays sont : Anguilla, Antigua, Argentine, Aruba, les îles Vierges britanniques, Bahamas, Barbade, Belize, Bolivie, Brésil, îles Caïmans, Chili, Colombie, Costa Rica, Curaçao, Dominique, République dominicaine, Équateur, El Salvador , Grenade, Guatemala, Guyane, Haïti, Honduras, Jamaïque, Mexique, Montserrat, Nicaragua, Panama, Paraguay, Pérou, Saint-Kitts-et-Nevis, Sainte-Lucie, Saint-Vincent, Suriname, Trinité-et-Tobago, Turks et Caicos, Uruguay , et le Vénézuela. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> Que proposera HBO Max en Amérique latine ? </h2> <p> </p> <p> Les abonnés HBO GO existants qui paient directement ou via des « partenaires éligibles » auront un accès instantané à HBO Max. HBO GO sera ensuite progressivement supprimé dans toutes les régions. </p> <p> Les détails des prix n&#39;ont pas été annoncés, mais sont promis dans les prochains mois, ainsi que des informations sur le nouveau contenu et les offres promotionnelles. </p> <p> Comme aux États-Unis, HBO Max proposera une variété de forfaits d&#39;abonnement et d&#39;appareils de prise en charge tels que les smartphones, les tablettes et d&#39;autres plates-formes intelligentes. </p> <p> </p> <p> Dans une bande-annonce annonçant la nouvelle, on peut voir des extraits de séries comme Game of Thrones and Friends, ainsi que des films comme The Matrix et Casablanca. Cependant, un petit message apparaît à la fin pour avertir que &quot;tous les titres [seront] disponibles au lancement&quot;. </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> Quand HBO Max sera-t-il disponible dans le monde ? </h2> <p> L&#39;année dernière, Warner Bros. a annoncé de manière controversée qu&#39;il prévoyait de publier l&#39;intégralité de sa liste de salles de cinéma 2021 sur HBO Max. Cela a causé le réalisateur <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Christopher Nolan qualifiera HBO Max de « pire service de streaming » </a> . </p> <p> Néanmoins, alors que certains dans l&#39;industrie cinématographique pourraient se plaindre, c&#39;est un excellent choix pour les consommateurs. </p> <p> En tant que tels, ceux d&#39;Amérique latine et des Caraïbes seront probablement enthousiasmés par le lancement de HBO Max, dans l&#39;espoir que l&#39;accord s&#39;applique également à eux. </p> <p> Quant au reste du monde ? Aucune date ferme n&#39;a été fixée, mais WarnerMedia a révélé que les pays nordiques, l&#39;Espagne, l&#39;Europe centrale et le Portugal devraient passer à HBO Max plus tard cette année. </p> <p> Johannes Larcher, directeur de HBO Max International, a déclaré : </p> <blockquote> <p> Nous sommes ravis du lancement de HBO Max en Amérique latine et dans les Caraïbes, qui est la première étape pour proposer le service Direct-to-Consumer de WarnerMedia aux consommateurs en dehors des États-Unis et du monde entier. </p> </blockquote>"}