{"title":"JPG vs JPEG : quelle est la différence entre ces formats de fichiers image ?","content":"<p> Tous les formats de fichiers image ne sont pas égaux. En fait, beaucoup d&#39;entre eux ont été créés pour résoudre un problème qu&#39;un format déjà existant ne pouvait pas résoudre. Le JPEG, par exemple, est né du fait que la taille des fichiers image occupait beaucoup trop d&#39;espace de stockage. </p> <p> Croyez-le ou non, les extensions de fichiers JIF, JPEG et JPG font plus ou moins référence à la même chose. Pour comprendre pourquoi le format de fichier a tant de noms, nous devons démêler un peu d&#39;histoire alambiquée. </p> <h2 id=\"what-is-a-jpeg\"> Qu&#39;est-ce qu&#39;un JPEG ? </h2> <p> L&#39;acronyme JPEG signifie Joint Photographic Experts Group. Le type de fichier a été nommé d&#39;après le sous-comité qui a aidé à créer la norme JPEG Interchange Format (JIF). Il a été publié pour la première fois en 1992 par l&#39;Organisation internationale de normalisation (ISO). </p> <p> Les JPEG sont des images raster fixes de 24 bits, avec huit bits dans chaque canal du modèle de couleur RVB. Cela ne laisse aucune place pour un canal alpha, ce qui signifie que même si les JPEG peuvent prendre en charge plus de 16 millions de couleurs, ils ne peuvent pas prendre en charge la transparence. </p> <p> Lorsqu&#39;une image est enregistrée au format JPEG, certaines de ses données sont supprimées dans un processus appelé perte <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> compression de fichiers </a> . À son tour, l&#39;image occupe 50 à 75 % d&#39;espace de stockage en moins (par rapport aux formats plus anciens comme le BMP) avec peu ou pas de perte perceptible de qualité d&#39;image. </p> <p> La compression JPEG est basée sur une technique de compression d&#39;image avec perte appelée transformation en cosinus discrète (DCT), qui a été proposée pour la première fois par l&#39;ingénieur électricien Nasir Ahmed en 1972. </p> <h3 id=\"what-is-a-jif\"> Qu&#39;est-ce qu&#39;un JIF ? </h3> <p> Vous pouvez penser qu&#39;un fichier JIF est comme un JPEG dans sa forme &quot;la plus pure&quot;. Cependant, le format n&#39;est plus beaucoup utilisé car il présentait des limitations frustrantes. Par exemple, les définitions de couleur et d&#39;aspect des pixels d&#39;un JIF ont causé des problèmes de compatibilité entre les encodeurs et les décodeurs (viewers). </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> Heureusement, ces problèmes ont ensuite été résolus par d&#39;autres normes &quot;supplémentaires&quot; basées sur le JIF. Le premier d&#39;entre eux était le JPEG File Interchange Format (JFIF), et plus tard, le <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Format de fichier image échangeable </a> (Exif) et profils de couleurs ICC. </p> <p> JPEG/JFIF est actuellement le format le plus populaire pour stocker et transmettre des images photographiques sur Internet, tandis que JPEG/Exif est celui des appareils photo numériques et autres appareils de capture d&#39;images. La plupart des gens ne font pas la différence entre ces variations et se réfèrent simplement aux deux comme simplement JPEG. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> Qu&#39;est-ce qu&#39;un JPG2 ou JPF ? </h3> <p> En 2000, le groupe JPEG a publié un autre format de fichier image appelé JPEG 2000 (ses extensions de fichier sont JPG2 et JPF). Il était censé succéder au JPEG, mais était loin d&#39;être aussi populaire. Même lorsque sa méthode d&#39;encodage avancée conduisait souvent à des images de meilleure qualité. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Crédit d&#39;image: Dake/ <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Le format de fichier JPEG 2000 s&#39;est effondré pour une petite poignée de raisons. D&#39;une part, il était basé sur un code entièrement nouveau et n&#39;était donc pas rétrocompatible avec le JPEG. En plus de cela, la gestion des fichiers JPEG 2000 nécessitait plus de mémoire à traiter, ce qui était un peu une rupture à l&#39;époque. Après tout, l&#39;ordinateur moyen à l&#39;époque n&#39;avait que 64 Mo de mémoire. </p> <p> Le JPEG 2000 a connu une résurgence maintenant que le matériel informatique, en général, s&#39;est considérablement amélioré au cours des 20 dernières années, mais le format de fichier est encore très sous-utilisé. Le seul navigateur Internet qui prend en charge les fichiers JPEG 2000 au moment de la rédaction est Safari. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG contre JPG </h3> <p> Les premières versions de Windows (en particulier les systèmes de fichiers MS-DOS 8.3 et FAT-16) avaient une limite maximale de 3 lettres en ce qui concerne la longueur des extensions de fichiers. JPEG a dû être raccourci en JPG pour ne pas dépasser la limite. Les ordinateurs Mac et Linux n&#39;ont jamais eu une telle chose, et les utilisateurs continueraient donc à enregistrer des images au format JPEG. </p> <p> </p> <p> Les programmes d&#39;édition d&#39;images populaires fonctionnant sur différents systèmes d&#39;exploitation, tels que Photoshop et <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> Gimp </a> - finirait par définir leur extension de fichier JPEG par défaut sur JPG dans le but de minimiser la confusion. </p> <p> Et c&#39;est ainsi que nous nous sommes retrouvés avec deux extensions de fichier pour le même format : JPEG et JPG. Lorsque vous choisissez sous quoi enregistrer votre image, il n&#39;y a aucune différence entre eux. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG contre PNG : qu&#39;est-ce qui est le mieux ? </h2> <p> </p> <p> Le JPEG et le PNG ont été publiés au cours de la même décennie, chaque format de fichier résolvant un problème d&#39;image numérique différent auquel le monde de la technologie était confronté à l&#39;époque. On pourrait dire qu&#39;il est tout à fait naturel qu&#39;ils soient constamment comparés... et ils le sont encore aujourd&#39;hui. Entre JPEG et PNG, quel format de fichier image règne en maître ? </p> <p> Honnêtement, la réponse dépend du type d&#39;image que vous enregistrez. </p> <p> Les JPEG sont mieux adaptés aux photographies car ils utilisent une compression avec perte pour conserver des tailles de fichiers raisonnables. Les photographies sont des images tellement grandes et détaillées que les artefacts de compression (distorsions subtiles de l&#39;image causées par la compression) ne sont pas très visibles sur elles. </p> <p> D&#39;un autre côté, les images avec des points nets, des bords nets et avec de grandes zones d&#39;une seule couleur (par exemple, des logos vectoriels, du pixel art, etc.) ne semblent pas tout à fait correctes lorsqu&#39;elles sont enregistrées au format JPEG. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Crédit d&#39;image: Axel Grimard/ <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> C&#39;est là que le fichier Portable Network Graphics (PNG) pourrait entrer en jeu. Développé par le PNG Development Group quatre ans après la sortie du JPEG, le PNG prend en charge la compression et la transparence des données sans perte. Les fichiers PNG sont donc souvent utilisés si la qualité de l&#39;image doit être conservée et que la taille du fichier n&#39;est pas un problème. </p> <p> Une bonne règle de base consiste à conserver JPEG pour les photographies et à enregistrer PNG pour les images avec transparence et les images non photographiques. Pour plus d&#39;informations sur les nombreux types de fichiers (pas seulement les images), consultez notre guide pour <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> savoir quand utiliser quel format de fichier. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG et JPG sont le même format de fichier </h2> <p> Malgré la confusion que le JPEG a causée avec ses nombreuses mises à jour et variations, l&#39;éventuelle inondation d&#39;images numériques sur Internet au milieu des années 90 a sans aucun doute été principalement causée par sa sortie. </p> <p> La prochaine fois que vous serez prêt à exporter une photo à partir d&#39;un éditeur d&#39;images et que vous vous retrouverez avec la longue liste de formats disponibles, n&#39;oubliez pas : JPEG et JPG ne font qu&#39;un. </p>"}