{"title":"L&#39;iPhone 13 pourrait se vanter d&#39;afficher &quot;Always On&quot;","content":"<p> Apple a présenté son écran &quot;toujours allumé&quot; pour l&#39;Apple Watch Series 5 en 2019. Quelques années plus tard, il pourrait arriver sur l&#39;iPhone, selon le journaliste Max Weinbach, qui a partagé l&#39;information avec la chaîne YouTube. <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> ToutApplePro </a> . </p> <p> Le rapport affirme que l&#39;iPhone 13 --- si c&#39;est bien ainsi qu&#39;Apple décide de le nommer --- aura en permanence certaines sections de l&#39;écran allumées pour montrer certains détails. </p> <h2 id=\"how-always-on-display-will-work\"> Comment l&#39;affichage &quot;Always on&quot; fonctionnera-t-il </h2> <p> Ces détails peuvent inclure à la fois les icônes d&#39;horloge et de batterie. Ils resteraient visibles même lorsque l&#39;iPhone est verrouillé, ce qui signifie qu&#39;il n&#39;est pas activement utilisé par l&#39;utilisateur. Les notifications, telles que les avis de nouveau message, ne seraient allumées que temporairement. </p> <p> Ce serait la première fois que l&#39;iPhone est doté de la technologie d&#39;affichage « always on ». Cependant, ce ne serait en aucun cas la première fois qu&#39;une technologie similaire fait son chemin vers un smartphone. Nokia a introduit une fonction d&#39;écran &quot; toujours allumée &quot; dès 2009. Plus récemment, elle est devenue une fonction largement disponible sur divers téléphones Android --- y compris les modèles fabriqués par Huawei, Motorola, Samsung, Google et autres. </p> <p> Le grand avantage évident de &quot;toujours allumé&quot; est qu&#39;il n&#39;exige pas que l&#39;utilisateur réveille ou déverrouille son téléphone pour accéder aux informations, même s&#39;il s&#39;agit de quelque chose d&#39;aussi mineur que de vérifier l&#39;heure. </p> <p> L&#39;inconvénient est qu&#39;il consomme une autonomie supplémentaire, ce qui peut déjà être quelque chose de premium sur les smartphones. Cependant, les écrans AMOLED peuvent réduire cet impact sur la batterie en activant uniquement les pixels de l&#39;écran nécessaires pour afficher les informations. </p> <p> En d&#39;autres termes, cet affichage &quot;toujours allumé&quot; est toujours allumé au sens technique --- bien que la majorité de l&#39;écran soit éteinte et que seules quelques parties restent allumées tout le temps. Cela signifie que l&#39;effet sur la durée de vie de la batterie n&#39;est pas aussi important qu&#39;il pourrait l&#39;être autrement. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> À quoi s&#39;attendre de l&#39;iPhone 13 </h2> <p> L&#39;iPhone de nouvelle génération arrivera probablement en septembre 2021. Selon Weinbach, il présentera la même conception de châssis globale que la série iPhone 12, bien qu&#39;il y aura quelques mises à niveau sous le capot. </p> <p> Ceux-ci comprendront des aimants MagSafe plus puissants, un système de caméra amélioré pour prendre des images de la lune et des étoiles, un objectif de caméra ultra-large sur toute la gamme d&#39;iPhone, une vidéo en mode portrait (plutôt que des images fixes), un dos mat raffiné et un A- amélioré. puce de série. Un précédent rapport a affirmé qu&#39;Apple pourrait <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> introduire Touch ID à l&#39;écran </a> comme alternative à Face ID. </p> <p> Étant donné qu&#39;il reste encore plus de six mois, de nombreux nouveaux détails pourraient émerger avant qu&#39;Apple ne présente son prochain iPhone au troisième trimestre. Néanmoins, il semble que le moulin à rumeurs commence déjà à entrer en action. Surveillez cet endroit! </p>"}