{"title":"Le Surface Duo obtient une date de sortie au Royaume-Uni et une baisse de prix","content":"<p> Le Surface Duo de Microsoft n&#39;a pas eu un accueil aussi fantastique, mais il semble que la société souhaite faire de meilleures premières impressions en dehors des États-Unis. Non seulement la société réduit le prix du Surface Duo, mais elle a également une date de sortie confirmée pour le marché britannique. </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> Derniers préparatifs de Microsoft à l&#39;étranger pour le Surface Duo </h2> <p> Cette nouvelle nous vient de <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . Si vous vous en souvenez, à l&#39;époque du lancement du Surface Duo, <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> il n&#39;a pas reçu de bonnes critiques </a> . Un point de friction central était à quel point le système d&#39;exploitation du Duo était buggé, mais un autre était son prix alléchant à 1399,99 $. </p> <p> Microsoft a travaillé d&#39;arrache-pied pour résoudre les principaux problèmes détectés par les examinateurs, mais son prix élevé est toujours resté là où il était. Cependant, Microsoft prévoit de donner au Surface Duo une baisse de prix significative à 999,99 $. </p> <p> Cette baisse est probablement en préparation de sa sortie à l&#39;étranger, alors que les critiques du monde entier se préparent à décomposer le Surface Duo pouce par pouce. Avec ce prix réduit, ainsi que les correctifs récents du système d&#39;exploitation du Surface Duo, la merveille à double écran peut encore faire une impression positive à l&#39;étranger. </p> <p> Microsoft a également confirmé quand les fans britanniques peuvent essayer le Surface Duo par eux-mêmes. Si vous êtes au Royaume-Uni, gardez un œil sur les détaillants d&#39;électronique le 18 février 2021. </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> Gratter la surface des plans de Microsoft à l&#39;étranger </h2> <p> Alors que le Surface Duo a eu du mal à faire bonne impression aux États-Unis, il peut encore y avoir de l&#39;espoir à l&#39;étranger. Avec toutes les corrections apportées au système d&#39;exploitation du Surface Duo combinées à cette baisse de prix, l&#39;herbe pourrait finir par être plus verte de l&#39;autre côté. </p> <p> Si vous voulez savoir quel type de correctifs Microsoft a poussé pour le Surface Duo, la société a récemment publié des mises à jour de stabilité pour corriger les bugs avant les débuts internationaux du Duo. </p> <p> <small> Crédit d&#39;image : Jack Skeens / <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}