{"title":"La dernière mise à jour de WatchOS se défend contre le bug Apple Watch-Bricking","content":"<p> La dernière mise à jour de watchOS d&#39;Apple, la version logicielle 7.3.1, comprend un correctif très important --- la résolution d&#39;un bogue qui empêche certains appareils Apple Watch Series 5 et Apple Watch SE de se charger lorsqu&#39;ils passent en mode Réserve de marche. </p> <p> La société a également lancé un nouveau programme de réparation gratuit pour les appareils concernés qui sont piégés dans ce mode basse consommation et incapables d&#39;en sortir. Ce bug &quot;brique&quot; essentiellement leur Apple Watch, la rendant plus fonctionnelle. </p> <h2 id=\"the-power-reserve-mode-bug\"> Le bogue du mode de réserve de marche </h2> <p> Le mode de réserve d&#39;énergie est lancé lorsqu&#39;une Apple Watch est faible sur la batterie. Cela empêche votre Apple Watch de communiquer avec votre iPhone. Cela empêche également les utilisateurs d&#39;accéder à d&#39;autres fonctionnalités de l&#39;Apple Watch. Pour sortir du mode Réserve de marche, les utilisateurs doivent recharger leur Apple Watch. </p> <p> Sur un <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> page d&#39;assistance sur le programme de bogue et de réparation </a> , daté du 15 février, Apple commence par noter : </p> <blockquote> <p> Un très petit nombre de clients possédant des modèles Apple Watch Series 5 ou Apple Watch SE exécutant watchOS 7.2 ou 7.3 ont rencontré un problème avec leur montre qui ne se chargeait pas après avoir entré la réserve de marche. </p> </blockquote> <p> Pour savoir si vous avez un modèle Apple Watch concerné, Apple vous recommande de placer votre montre sur un chargeur et d&#39;attendre au moins 30 minutes. Si ce n&#39;est pas le cas, contactez l&#39;assistance Apple et ils organiseront une réparation gratuite par la poste. </p> <p> Les montres seront examinées pour vérifier leur éligibilité et, pour autant qu&#39;elles le soient, la réparation sera effectuée gratuitement, et la montre réparée restituée à son propriétaire. </p> <p> On ne sait pas exactement combien de montres Apple sont sérieusement affectées par le bogue. Cependant, il semble que le problème n&#39;affecte qu&#39;un sous-ensemble de modèles Apple Watch Series 5 ou Apple Watch SE, et aucun autre modèle. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> Comment mettre à niveau vers WatchOS 7.3.1 </h2> <p> Pour ceux qui n&#39;ont pas rencontré le bogue, cela vaut toujours la peine de passer à la dernière version de watchOS juste pour vous protéger contre cela. </p> <p> L&#39;importance de la correction de bogues est indiquée par le fait qu&#39;Apple a immédiatement diffusé watchOS 7.3.1 à tous les utilisateurs. Cela contraste avec la façon dont il publie normalement les mises à jour logicielles en les mettant initialement à la disposition des développeurs pour les tests bêta. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple a publié watchOS 7.3 </a> fin janvier. </p> <p> Les utilisateurs peuvent télécharger watchOS 7.3.1 à l&#39;aide de l&#39;application Apple Watch sur iPhone. Pour ce faire, ils doivent se rendre à <strong> Général &gt; Mise à jour du logiciel </strong> . Votre Apple Watch doit avoir au moins 50 % de batterie pour pouvoir être mise à jour. Il doit également être à proximité de votre iPhone. </p>"}