{"title":"LastPass vous limitera à un seul type d&#39;appareil à moins que vous ne payiez","content":"<p> LastPass, le gestionnaire de mots de passe populaire, subit un grand changement. Bientôt, ceux qui utilisent le service gratuitement ne pourront le faire que sur des ordinateurs ou des mobiles, mais pas les deux, à moins qu&#39;ils ne paient. </p> <p> Cela signifie que LastPass n&#39;est plus un choix attrayant en tant que gestionnaire de mots de passe gratuit. Dans un monde où nous passons constamment entre les ordinateurs et les mobiles, avoir un gestionnaire de mots de passe qui ne fonctionne que pour un seul type d&#39;appareil est inutile. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> Qu&#39;est-ce qui change dans LastPass Free ? </h2> <p> Comme annoncé sur le <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog LastPass </a> , des changements sont en cours pour la version gratuite du gestionnaire de mots de passe. </p> <p> Actuellement, LastPass Free vous permet d&#39;utiliser le service sur tous vos appareils. Que vous utilisiez LastPass sur votre ordinateur, tablette ou mobile, cela n&#39;a pas d&#39;importance. Tout cela est gratuit. Cela devrait changer le 16 mars 2021. </p> <p> À partir de là, LastPass Free n&#39;inclura qu&#39;un nombre illimité d&#39;appareils d&#39;un seul type : ordinateurs ou mobiles. </p> <p> Pour LastPass, les ordinateurs sont classés comme n&#39;importe quel ordinateur de bureau ou ordinateur portable, tandis que les mobiles sont les téléphones portables, les tablettes et les montres intelligentes. </p> <p> Lorsque vous vous connecterez pour la première fois à LastPass le 16 mars, vous devrez définir votre type d&#39;appareil actif. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> Par exemple, si vous choisissez des ordinateurs comme type d&#39;appareil, vous pourrez utiliser LastPass sur vos appareils de bureau et portables. Cependant, si vous souhaitez utiliser LastPass sur n&#39;importe quel appareil mobile, vous devrez passer à LastPass Premium. </p> <p> D&#39;une certaine manière, cela revient au LastPass d&#39;antan. La possibilité d&#39;utiliser LastPass gratuitement sur ordinateur et mobile n&#39;est devenue disponible qu&#39;en 2015. Avant cela, vous deviez payer pour l&#39;assistance mobile. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> La prise en charge de LastPass change également </h2> <p> LastPass change également la façon dont il fournit une assistance. À partir du 17 mai 2021, l&#39;assistance par e-mail ne sera disponible que pour les clients Premium et Family. </p> <p> Les utilisateurs gratuits seront bloqués avec les articles d&#39;aide disponibles sur le site Web d&#39;assistance de LastPass, ou ils peuvent demander de l&#39;aide au sein de la communauté LastPass. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> Tout le monde devrait utiliser un gestionnaire de mots de passe </a> . Il y a de fortes chances que vous deviez l&#39;utiliser sur ordinateur et mobile. LastPass le sait et compte sur la mise à niveau des utilisateurs vers le service payant, qui est actuellement à 25 % de réduction pour 27 $/an. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> Est-il temps de changer le gestionnaire de mots de passe ? </h2> <p> Si vous utilisez LastPass Free, il est probable que cela vous ait incité à envisager de changer. Si tel est le cas, il existe de nombreux autres excellents gestionnaires de mots de passe que vous pouvez utiliser gratuitement sur tous vos appareils. </p> <p> Là encore, peut-être pensez-vous qu&#39;il est juste que vous payiez une petite somme à LastPass pour soutenir le service qu&#39;il fournit. </p>"}