{"title":"La manette PS4 ne fonctionne pas ? Comment résoudre les problèmes les plus courants","content":"<p> La plupart du temps, votre manette PlayStation 4 fonctionne probablement bien. Mais lorsque votre DualShock 4 cesse de se connecter ou se déconnecte de manière aléatoire, c&#39;est frustrant. </p> <p> Examinons les correctifs lorsque votre contrôleur PS4 ne fonctionne pas, afin que vous puissiez recommencer à jouer. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> La manette PS4 ne se couple pas ou ne se connecte pas </h2> <p> Normalement, lorsque vous appuyez sur le <strong> Bouton PS </strong> sur votre contrôleur, il devrait s&#39;allumer et se connecter à votre système. Cependant, lorsqu&#39;il ne se connecte pas, vous verrez plutôt la barre lumineuse de votre contrôleur clignoter un peu, puis s&#39;éteindre. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Cela se produit généralement si vous avez utilisé votre DualShock 4 avec un autre appareil. Par exemple, si vous <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> associez votre manette PS4 à votre PC </a> ou la console d&#39;un ami, il se souviendra de cet appareil à l&#39;avenir. </p> <p> Dans ces cas, vous devrez reconnecter votre DualShock 4 avec votre propre PS4. Pour ce faire, connectez votre manette à votre PS4 à l&#39;aide d&#39;un câble micro-USB. Assurez-vous d&#39;utiliser un câble de haute qualité dont vous savez qu&#39;il fonctionne correctement. </p> <p> </p> <p> appuie sur le <strong> Bouton PS </strong> sur votre manette pendant un moment, et le voyant doit clignoter brièvement avant de devenir bleu. Cela signifie que votre manette s&#39;est jumelée et connectée avec succès. </p> <p> Si vous avez jumelé votre DualShock 4 avec un autre appareil à proximité, comme votre téléphone ou une PlayStation 5, cela allumera probablement et connectera le contrôleur à cet appareil. Vous devez donc éteindre et débrancher tout appareil auquel votre DualShock 4 est connecté en premier. </p> <p> Après avoir re-appairé votre manette, vous pouvez déconnecter le câble USB et utiliser votre manette sans fil comme d&#39;habitude. Votre PS4 s&#39;en souviendra jusqu&#39;à ce que vous jumeliez la manette avec un autre appareil à l&#39;avenir. </p> <p> Gardez à l&#39;esprit que le nombre maximum de contrôleurs DualShock 4 que vous pouvez connecter à la PS4 à la fois est de quatre. Si vous avez déjà quatre contrôleurs connectés, vous devrez en déconnecter un pour faire de la place pour plus. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> La manette PS4 continue de se déconnecter </h2> <p> Si votre DualShock 4 se déconnecte de manière aléatoire pendant la lecture, vous pouvez essayer quelques solutions. </p> <p> Tout d&#39;abord, assurez-vous que la batterie de votre contrôleur est chargée. Cela semble simple, mais si la batterie de votre manette est presque morte, elle peut se déconnecter. Pour vérifier l&#39;autonomie de la batterie de votre manette, maintenez le <strong> Bouton PS </strong> pour afficher le menu rapide sur le côté gauche de l&#39;écran. Vous verrez une icône de contrôleur avec l&#39;affichage de la batterie en bas. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Branchez votre manette sur votre PS4 et visitez à nouveau le menu rapide pour vous assurer de voir l&#39;animation de chargement de la batterie. Une fois que votre manette s&#39;est chargée pendant un certain temps, essayez de l&#39;utiliser normalement. </p> <p> Si la batterie n&#39;était pas votre problème, assurez-vous que vous n&#39;essayez pas d&#39;utiliser votre manette trop loin de votre système. La portée Bluetooth typique est d&#39;environ 30 pieds; selon votre configuration, vous pourrez peut-être utiliser votre contrôleur plus loin que cela, ou être limité à l&#39;utiliser plus près. </p> <p> En parlant de cela, vous devriez essayer de minimiser les interférences entre votre contrôleur et votre console. Retirez tous les objets métalliques entre les deux, comme des étagères ou des ordinateurs portables, qui pourraient inhiber le signal. Vous devez également sortir votre PS4 de tout espace clos dans lequel elle se trouve pour une meilleure transmission et réception du signal. </p> <p> Enfin, rappelez-vous que la PS4 a un paramètre qui désactive les contrôleurs après qu&#39;ils soient inactifs pendant un certain temps. Si vous ne voulez pas que votre manette PS4 s&#39;éteigne lorsque vous regardez des applications multimédias comme YouTube, accédez à <strong> Paramètres &gt; Paramètres d&#39;économie d&#39;énergie &gt; Définir le délai d&#39;extinction des contrôleurs </strong> et choisissez <strong> Jamais </strong> . Notez que cela utilisera la batterie même lorsque vous êtes inactif. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> Conseils généraux pour réparer une manette PlayStation 4 </h2> <p> Nous avons examiné des correctifs spécifiques pour quelques problèmes courants de DualShock 4 ci-dessus. Ensuite, examinons des solutions plus générales aux problèmes avec les contrôleurs PS4. Parcourez-les si vous avez besoin de plus d&#39;aide. </p> <h3 id=\"restart-your-console\"> 1. Redémarrez votre console </h3> <p> Bien que la plupart des problèmes de contrôleur proviennent du contrôleur lui-même, il est possible que votre PS4 soit la cause du problème. Pour exclure cela, vous devez redémarrer votre console avant de poursuivre le dépannage. </p> <p> Si votre contrôleur fonctionne suffisamment pour accéder aux menus, maintenez le <strong> Bouton PS </strong> pour ouvrir le menu rapide, puis allez à <strong> Alimentation &gt; Redémarrer PS4 </strong> pour redémarrer votre système. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> Dans le cas où votre contrôleur ne coopère pas, appuyez et maintenez le <strong> Pouvoir </strong> sur votre console PS4 jusqu&#39;à ce que vous entendiez deux bips. Cela l&#39;éteindra complètement (pas de voyants à l&#39;avant) - une fois éteint, appuyez sur le bouton <strong> Pouvoir </strong> bouton à nouveau pour le rallumer. </p> <p> Essayez à nouveau d&#39;utiliser votre contrôleur après un redémarrage et voyez si cela vous aide. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. Oubliez et réassociez votre manette PS4 </h3> <p> Si vous avez un deuxième contrôleur PS4 (ou un contrôleur PS Move), vous pouvez l&#39;utiliser pour accéder à un menu qui vous permet de supprimer le contrôleur ayant un problème. Se diriger vers <strong> Paramètres &gt; Appareils &gt; Appareils Bluetooth </strong> et sélectionnez le <strong> DualShock 4 </strong> l&#39;entrée, c&#39;est celle qui n&#39;a pas de feu vert à côté. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> Dans le menu qui s&#39;affiche, appuyez sur la <strong> Options </strong> sur votre manette et choisissez <strong> Oublier l&#39;appareil </strong> . Cela entraînera la suppression de votre PS4 de la mémoire, vous devrez donc à nouveau la coupler. </p> <p> C&#39;est le bon moment pour essayer une méthode d&#39;appairage légèrement différente : le réappairer au démarrage. Pour ce faire, éteignez votre PS4 (comme expliqué précédemment). Une fois qu&#39;il est éteint, connectez le contrôleur problématique à votre console avec un câble USB. Frappez le <strong> Bouton PS </strong> pour, espérons-le, allumer et associer votre contrôleur en un seul processus. </p> <p> Si cela ne fonctionne pas, rallumez votre PS4 et essayez de l&#39;appairer normalement, comme ci-dessus. </p> <h3 id=\"hard-reset-your-controller\"> 3. Réinitialisation matérielle de votre contrôleur </h3> <p> Si le retrait et le ré-appairage du contrôleur n&#39;ont pas fonctionné, vous pouvez ensuite essayer la procédure de réinitialisation complète du DualShock 4. Vous aurez besoin d&#39;un petit objet pointu, comme un trombone plié ou un outil d&#39;éjection de carte SIM, pour ce faire . </p> <p> Éteignez votre PS4, puis retournez votre manette. Vous verrez un petit trou à côté de la vis à côté du bouton L2 (sur le côté droit du contrôleur lorsqu&#39;il est retourné). Utilisez votre outil pointu pour appuyer et maintenir le bouton à l&#39;intérieur de ce trou pendant environ cinq secondes. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> Une fois que vous avez fait cela, connectez à nouveau votre contrôleur à votre PS4 via un câble USB et voyez s&#39;il s&#39;apparie avec succès. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Essayez le contrôleur ailleurs </h3> <p> À ce stade, si vous ne l&#39;avez pas déjà fait, vous devriez essayer d&#39;utiliser le contrôleur qui rencontre des problèmes avec un autre appareil. Si vous rencontrez des problèmes similaires sur la PS4 d&#39;un ami ou votre PC, votre contrôleur est probablement défectueux. </p> <p> C&#39;est aussi une bonne idée d&#39;essayer une autre manette PS4 avec votre console, si possible. Si vous empruntez le DualShock 4 d&#39;un ami dont vous savez qu&#39;il fonctionne correctement et constatez qu&#39;il a des problèmes avec votre système, quelque chose ne va probablement pas avec la connectivité sans fil de votre PS4. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Utilisez le contrôleur en mode filaire </h3> <p> Avant d&#39;abandonner la manette, vous devriez essayer de jouer avec elle connectée en permanence via un câble USB. Cependant, gardez à l&#39;esprit que cela ne fonctionne que pour le modèle révisé de contrôleurs PS4. Vous saurez que vous avez ce modèle s&#39;il y a une barre lumineuse à l&#39;intérieur du pavé tactile à l&#39;avant de votre contrôleur. Sinon, vous ne pouvez pas forcer la communication filaire. </p> <p> Si vous n&#39;en avez pas déjà un, achetez un long câble pour pouvoir continuer à jouer depuis le canapé. le <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Pack de trois Ailun </a> de câbles micro-USB de 10 pieds est une bonne option rentable. </p> <p> Pour forcer votre PS4 à connecter des manettes via USB, rendez-vous sur <strong> Paramètres &gt; Périphériques &gt; Contrôleurs &gt; Méthode de communication </strong> et choisissez <strong> Utiliser un câble USB </strong> . Cela empêchera le DualShock 4 d&#39;utiliser Bluetooth, même lorsqu&#39;il est connecté via USB. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> Options de réparation matérielle DualShock 4 </h2> <p> Comme la plupart du matériel, les contrôleurs DualShock 4 ont une garantie d&#39;un an. Si vous avez acheté votre manette PS4 au cours de la dernière année et que vous ne pouvez pas la réparer avec tous les conseils ci-dessus, vous devriez visiter <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> La page Réparer et remplacer de PlayStation </a> faire une demande de réparation sur votre manette. </p> <p> Sinon, vous pouvez tenter vous-même des correctifs matériels en ouvrant votre contrôleur. Mais selon le problème spécifique, cela peut être difficile ou impossible. Nous vous recommandons de parler à un technicien de réparation local si vous ne vous sentez pas à l&#39;aise de le faire vous-même. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> Problèmes de contrôleur PS4, corrigés </h2> <p> Vous savez maintenant comment résoudre les problèmes de manette PS4 les plus courants. Des problèmes plus spécifiques, tels qu&#39;un bouton qui cesse de fonctionner, relèvent malheureusement des solutions de réparation matérielle mentionnées ci-dessus. </p> <p> J&#39;espère que votre problème a été facile à résoudre. Mais sinon, et vous devez vous procurer une nouvelle manette PS4, vous disposez de nombreuses options intéressantes. </p> <p> <small> Crédit d&#39;image: Joeri Mostmans/ <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}