{"title":"Les AirTags tant attendus pourraient enfin faire leurs débuts en mars","content":"<p> Les AirTags d&#39;Apple, un tracker de localisation miniature pour les clés et autres petits objets, ont été répandus comme étant juste au coin de la rue depuis 2019. Cependant, six semaines après 2021, ils n&#39;ont toujours pas été annoncés par Apple --- et encore moins pour commencer à expédier. aux clients. </p> <p> Cela pourrait bien changer le mois prochain, selon Jon Prosser, le pronostiqueur d&#39;Apple. Dans un tweet envoyé le vendredi 12 février, Prosser a affirmé que &quot;les AirTags sont toujours activés pour mars. Je n&#39;ai entendu parler d&#39;aucun autre retard cette fois.&quot; </p> <h2 id=\"what-to-expect-from-airtags\"> À quoi s&#39;attendre des AirTags </h2> <p> Prosser fait référence à un précédent retard qu&#39;il a signalé à la fin de l&#39;année dernière, avant l&#39;événement médiatique d&#39;Apple le 13 octobre. À l&#39;époque, Prosser a noté sur <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800\" target=\"_blank\" rel=\"nofollow noopener\"> Twitter </a> qu&#39;il avait entendu de ses sources (apparemment bien situées) que &quot;Apple a repoussé l&#39;annonce et le lancement des AirTags à mars 2021&quot;. Jusqu&#39;à six mois plus tard, il semble qu&#39;aucun autre retard ne retardera la sortie des AirTags. On pourrait espérer, du moins. </p> <p> Les AirTags utiliseraient la technologie ultra large bande d&#39;Apple pour permettre aux iPhones de déterminer leur emplacement précis avec un degré élevé de précision. Ils utiliseront censément à la fois des signaux audio et un marqueur virtuel augmenté pour montrer exactement où se trouve l&#39;objet, attaché aux AirTags. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Les AirTags sont toujours activés pour mars. <br><br> Je n&#39;ai pas entendu parler d&#39;autres retards cette fois. 🤞 </p> – Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1360265330296250377?ref_src=twsrc%5Etfw\"> 12 février 2021 </a></blockquote>  <p> Trouver les AirTags individuels sera <a href=\"https://www.makeuseof.com/apple-find-my-items-hidden-tab/\" target=\"_blank\" rel=\"nofollow noopener\"> fait via l&#39;application iOS &quot;Find My&quot; </a> , qui permet également aux utilisateurs de suivre leurs iPhones, iPads, Macs et autres appareils Apple. Les AirTags seront le rival d&#39;Apple pour les produits de suivi Bluetooth populaires de sociétés telles que Tile. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Donc, à propos des AirTags. <br><br> Celui-ci me fait mal au coeur... <br><br> On me dit qu&#39;Apple a repoussé l&#39;annonce et le lancement des AirTags à mars 2021. 😳 <a href=\"https://t.co/xtUvCAFmoE\"> https://t.co/xtUvCAFmoE </a> <a href=\"https://t.co/DIUlcp01Xy\"> pic.twitter.com/DIUlcp01Xy </a></p> – Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800?ref_src=twsrc%5Etfw\"> 9 octobre 2020 </a></blockquote>  <p> Apple n&#39;a pas encore annoncé d&#39;événement spécial en mars, au cours duquel les AirTags pourraient être annoncés. Cependant, s&#39;il en héberge un, ce sera dans la lignée des dernières années. Pendant six des 10 dernières années, Apple a organisé un événement en mars au cours duquel il a présenté de nouveaux produits. </p> <p> L&#39;année dernière, un événement a fait l&#39;objet de nombreuses rumeurs, mais n&#39;a pas eu lieu, probablement en raison du début de la pandémie de COVID-19 aux États-Unis et ailleurs. Maintenant qu&#39;Apple est passé aux événements virtuels, cela ne l&#39;empêchera pas d&#39;organiser un autre événement le mois prochain. Alternativement, Apple pourrait annoncer les AirTags via un communiqué de presse. </p> <p> </p> <h2 id=\"expect-a-new-ipad-pro-as-well\"> Attendez-vous également à un nouvel iPad Pro </h2> <p> Ce n&#39;est peut-être pas non plus le seul nouveau produit Apple le mois prochain. Prosser a également répondu à une question sur le prochain iPad Pro d&#39;Apple, en disant qu&#39;il était &quot;également [prévu pour] mars, pour autant que je sache&quot;. </p> <p> Bien que Prosser se soit déjà trompé, il a un bilan globalement impressionnant en ce qui concerne les annonces précises d&#39;Apple. Les AirTags et l&#39;iPad Pro de nouvelle génération en feront-ils partie ? Il n&#39;y a pas longtemps à attendre jusqu&#39;à ce que nous le sachions. </p> <p> <small> Crédit d&#39;image: iphonedigital/ <a href=\"https://www.flickr.com/photos/137872055@N03/22522566994/\" target=\"_blank\" rel=\"nofollow noopener\"> Flickr </a></small> </p>"}