{"title":"Le cofondateur de Netflix critique la stratégie vidéo d&#39;Apple TV+","content":"<p> L&#39;ancien chef de Netflix, Marc Randolph, a critiqué la stratégie vidéo d&#39;Apple, affirmant qu&#39;Apple TV+ est à la traîne par rapport à la concurrence en raison des offres gratuites de l&#39;entreprise et du manque de contenu convaincant. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple n&#39;est pas en streaming &quot;Avec les deux pieds&quot; </h2> <p> Si vous demandez à l&#39;ancien PDG et co-fondateur de Netflix Marc Randolph, Apple TV a été en proie à un problème de téléchargement gratuit qui a contribué à la croissance anémique du service par rapport à Netflix, Disney + et d&#39;autres services de streaming à succès. </p> <p> Parler à <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Yahoo finance </a> , il a déclaré qu&#39;Apple TV+ gaspille de l&#39;énergie sur des promotions et des offres gratuites alors qu&#39;elle devrait se concentrer sur l&#39;ajout de contenu de qualité pour augmenter la valeur. </p> <blockquote> <p> Si Apple passait un quart de temps sur le contenu comme sur les cadeaux, ils pourraient vraiment jouer. Ils n&#39;ont aucune excuse [et] ils ne sont toujours pas dedans avec les deux pieds. Ils doivent vraiment faire preuve d&#39;esprit d&#39;entreprise et marcher jusqu&#39;au bord de la falaise et sauter. </p> </blockquote> <p> Sauter du bord de la falaise peut être plus facile à dire qu&#39;à faire, car Apple TV+ n&#39;a pas le pouvoir de marché de Disney et la reconnaissance de la marque Netflix. En ce moment, il s&#39;agit de <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney+ contre Netflix </a> et quel service de streaming offre le meilleur rapport qualité-prix aux clients potentiels. </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV+ a le taux de désabonnement le plus élevé </h2> <p> Randolph prend position contre les cadeaux et les promotions sur le marché du streaming, suggérant qu&#39;Apple TV+‌ a le &quot;taux de désabonnement le plus élevé&quot; parmi les principaux services. </p> <blockquote> <p> Vous ne pouvez pas continuer à remplacer les gens. Vous devez leur donner une raison de rester. </p> </blockquote> <p> MoffettNathanson-HarrisX a constaté que 29 % de ceux qui se sont inscrits via un programme gratuit ne prévoient pas de se réinscrire une fois leur essai gratuit expiré, comme l&#39;a rapporté <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> Variété </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> Offres Apple TV+ gratuites </h2> <p> Apple offre 12 mois de service Apple TV+ gratuit à tous ceux qui achètent un nouvel appareil éligible auprès de l&#39;entreprise, comme un nouvel iPhone. En attendant, <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple a prolongé les abonnements gratuits d&#39;un an </a> deux fois pour ceux qui se sont inscrits en 2019. </p> <p> </p> <p> C&#39;est un signal clair qu&#39;Apple lui-même ne pense pas que le service offre suffisamment de contenu pour justifier le prix demandé de 5 $/mois. Regardez les choses autrement : si Apple TV+ avait dépassé les projections internes, Apple se serait déjà vanté du nombre d&#39;abonnés. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney+ et Netflix offrent une concurrence sérieuse </h2> <p> Il y a seulement 15 mois, Apple TV+ a fait ses débuts en novembre 2019. Disney+ a suivi peu après. Apple ne révèle pas le nombre d&#39;abonnés payants d&#39;Apple TV+, mais Disney vient de dépasser les 94 millions d&#39;abonnés, dépassant même de loin ses propres attentes. </p> <p> À titre de comparaison, Netflix comptait 204 millions de clients payants fin 2020. Disney espère pouvoir égaler Netflix en termes d&#39;abonnés en seulement 12 mois. </p> <p> </p> <p> Randolph dit que Disney+ s&#39;est « frayé un chemin jusqu&#39;à une position très forte » grâce au contenu. &quot;C&#39;est vraiment une guerre pour savoir qui est prêt à créer le contenu&quot;, a-t-il ajouté. </p> <blockquote> <p> Nous voyons les nouvelles règles du jeu se développer. Il ne s&#39;agit pas seulement d&#39;annoncer, il ne s&#39;agit pas seulement d&#39;avoir une promotion --- ce que vous devez démontrer, c&#39;est que vous avez le contenu, le contenu, le contenu. </p> </blockquote> <p> En effet, le jeu est sur le contenu. Par exemple, comme indiqué dans <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> ses projets pour 2021 </a> , Netflix lancera un nouveau film original chaque semaine tout au long de l&#39;année. En revanche, Apple TV + propose une poignée de films comme le drame Greyhound de la Seconde Guerre mondiale avec Tom Hanks (basé sur des événements réels), le drame original Palmer avec Justin Timberlake et On The Rocks de Sofia Coppola, pour n&#39;en citer que quelques-uns. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> L&#39;approche à combustion lente d&#39;Apple </h2> <p> Ce que Randolph ne reconnaît pas, c&#39;est que Netflix et Disney+ ont eu des quantités massives de contenu dès le premier jour alors qu&#39;Apple TV+ construit sa bibliothèque de contenu à partir de zéro. </p> <p> Apple a évidemment opté pour une approche à combustion lente, comme en témoigne la rareté des émissions par rapport à Disney+ et Netflix. Peu importe comment vous le regardez, sa stratégie avec Apple TV+ semble exiger d&#39;attirer les gens avec des offres gratuites dans l&#39;espoir que le service amasse suffisamment de contenu de qualité pour convertir les clients gratuits en abonnés payants. </p>"}