{"title":"Le navigateur Edge de Microsoft était l&#39;hôte d&#39;émulateurs de jeux Nintendo secrets","content":"<p> Microsoft a supprimé une série d&#39;émulateurs de jeux illégaux cachés dans son magasin d&#39;extensions de navigateur Microsoft Edge. Le magasin d&#39;extensions Microsoft Edge hébergeait des dizaines d&#39;émulateurs, ce qui permettait aux utilisateurs de jouer à plusieurs jeux emblématiques, dont aucun n&#39;était publié légalement sur le magasin. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft supprime les émulateurs d&#39;extension Edge illégaux </h2> <p> Certains des jeux les plus emblématiques de tous les temps étaient cachés dans la boutique d&#39;extensions Microsoft Edge, notamment Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2 et même Minecraft. Chaque jeu était lancé dans le navigateur dans une fenêtre d&#39;émulateur et permettait aux utilisateurs de jouer à chaque titre dans son intégralité. </p> <p> Cependant, aucun des titres classiques ne répertorie les développeurs de jeux officiels, tels que Nintendo, Sega, Atari et oui, même Microsoft. Les noms des développeurs répertoriés comprenaient Gamelands, Kday et StayReal, qui sont tous entièrement fictifs et n&#39;ont aucun lien avec les développeurs d&#39;origine. </p> <p> Curieusement, le compte Twitter officiel de Microsoft Edge Development, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , posté sur les émulateurs, semblant promouvoir les jeux disponibles sur le magasin d&#39;extensions de navigateur. Nous n&#39;avons pas saisi le tweet original faisant la promotion des émulateurs, mais une copie est disponible via <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Réinitialiser </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> Les émulateurs sont-ils illégaux ? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Les émulateurs vous permettent d&#39;exécuter différents logiciels </a> sur ton ordinateur. Vous pouvez également utiliser un émulateur pour jouer à d&#39;anciens jeux. </p> <p> Bien que les émulateurs eux-mêmes ne soient pas illégaux, le téléchargement de contenu protégé par le droit d&#39;auteur pour jouer sur un émulateur l&#39;est. Le tweet du compte officiel Microsoft Edge Development était un geste étrange car les émulateurs ont téléchargé une nouvelle copie de la ROM du jeu pour que l&#39;utilisateur puisse y jouer. </p> <p> Le sujet de l&#39;abandonware est également quelque peu une zone grise. Les jeux Abandonware ne sont plus édités et ne sont plus disponibles à la vente en ligne ou en magasin. Cependant, dans de nombreux cas, le droit d&#39;auteur sur ces jeux n&#39;a pas expiré, mais le détenteur du droit d&#39;auteur n&#39;applique pas activement ses droits. </p> <p> </p> <p> Dans de nombreux cas, l&#39;abandonware est illégal. Pourtant, il n&#39;y a pas de procès concernant un abandonware, ou du moins aucun concernant un ancien développeur de jeux poursuivant quelqu&#39;un pour avoir téléchargé un titre abandonné. </p> <p> Dans cet exemple précis, l&#39;émulation de ces anciens jeux dans un navigateur Web est illégale. De plus, Nintendo est connu pour supprimer tous les sites ou services qui tentent de reproduire ou de redistribuer sa propriété intellectuelle. </p> <p> Actuellement, les jeux ont été supprimés du magasin d&#39;extensions Microsoft Edge. De plus, on ne sait pas encore comment les jeux émulés se sont retrouvés sur le magasin d&#39;extensions ou qui les y a mis. Inutile de dire qu&#39;il est peu probable qu&#39;ils reviennent. </p>"}