{"title":"Le gouvernement américain veut connaître l&#39;exactitude des étiquettes de confidentialité des applications","content":"<p> Avec ses étiquettes de confidentialité des applications iOS 14 dans l&#39;App Store, Apple offre aux utilisateurs une nouvelle façon de s&#39;autonomiser en ayant plus de connaissances sur les applications qu&#39;ils utilisent --- et sur la façon dont ces applications pourraient les suivre. </p> <p> Mais il semble qu&#39;il se soit également potentiellement ouvert une boîte de vers, car Apple est maintenant poussé à se porter garant de l&#39;exactitude de ces étiquettes, que les développeurs ont commencé à soumettre à Apple en décembre. </p> <h2 id=\"concerns-over-accuracy\"> Préoccupations concernant la précision </h2> <p> Comme noté par <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumeurs </a> , Apple a reçu un <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> lettre </a> du Comité de la Chambre des États-Unis sur l&#39;énergie et le commerce, lui demandant de clarifier les informations sur l&#39;exactitude fournie par le développeur de ses étiquettes de confidentialité des applications. </p> <p> Ces étiquettes sont une fonctionnalité très attendue dans certains quartiers et redoutée dans d&#39;autres d&#39;iOS 14 qui obligera les développeurs à être plus ouverts sur la façon dont leurs applications interagissent avec les données des utilisateurs. Cela signifie que les utilisateurs seront en mesure de prendre une décision plus éclairée en ce qui concerne les avantages par rapport aux inconvénients de l&#39;utilisation de certaines applications. </p> <p> </p> <p> Dans sa lettre, le House Committee on Energy and Commerce des États-Unis interroge Apple sur des rapports suggérant que certaines étiquettes de confidentialité des applications peuvent fournir aux utilisateurs des informations « trompeuses et fausses ». C&#39;est basé sur un rapport, publié le mois dernier, affirmant que de nombreuses applications ayant un bon état de santé peuvent ne pas être aussi innocentes qu&#39;elles le suggèrent. </p> <p> Un problème potentiel avec la fonctionnalité iOS 14 est qu&#39;elle repose sur l&#39;honnêteté du développeur pour dire comment les données sont collectées, ainsi que pour confirmer que ces informations sont exactes. Apple lui-même note que les informations &quot;n&#39;ont pas été vérifiées par Apple&quot;. </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Demander une réponse à Apple </h2> <p> Bien qu&#39;il semble probable que la plupart des développeurs joueront loyalement et respecteront le système d&#39;honneur, ce n&#39;est pas quelque chose qui va de soi. Apple vérifiera systématiquement les informations qui lui sont envoyées. Cependant, le nombre énorme d&#39;applications dans l&#39;App Store rend impossible pour Apple de vérifier personnellement chaque annonce. </p> <p> La lettre du House Committee on Energy and Commerce des États-Unis poursuit que : </p> <blockquote> <p> &quot;Nous exhortons Apple à améliorer la validité de ses labels de confidentialité des applications afin de garantir que les consommateurs reçoivent des informations significatives sur les pratiques de données de leurs applications et que les consommateurs ne soient pas lésés par ces pratiques potentiellement trompeuses.&quot; </p> </blockquote> <p> Le comité a demandé à Apple de fournir plus de détails sur son processus d&#39;audit, si les étiquettes de confidentialité des applications seront corrigées si elles sont fausses, des détails sur ce qui se passe lorsque les développeurs fournissent des informations inexactes, etc. </p> <p> Ils demandent à Apple de répondre avec les informations demandées d&#39;ici le 23 février. </p> <p> <small> Crédit d&#39;image: Jason Dent/ <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Unsplash CC </a></small> </p>"}