{"title":"L&#39;appareil photo Sony FX3 révélé via Twitter Leak","content":"<p> Cela ne fait que deux semaines que Sony a annoncé la sortie du Sony A1, un appareil photo 8,6K capable de capturer des images 50MP jusqu&#39;à 30fps. Mais est-ce que l&#39;entreprise remue un petit quelque chose de plus ? </p> <p> Tout ce que nous avons pour le moment n&#39;est que spéculation, mais Sony pourrait ajouter un nouvel appareil photo élégant et compact à sa série FX. </p> <h2 id=\"a-preview-of-the-sony-fx3\"> Un aperçu du Sony FX3 </h2> <p> Mercredi, Nokishita a tweeté une image du Sony FX3, une caméra qui pourrait chercher à défier l&#39;EOS C70 de Canon et le Pocket Cinema 6K de Blackmagic Design. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> FX3の画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> #噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> — (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> 10 février 2021 </a></blockquote>  <p> Nokishita est un blog technologique japonais qui est tristement célèbre pour les fuites précoces et précises d&#39;équipements photo et vidéo à venir. Bien qu&#39;il ne s&#39;agisse pas d&#39;une source officielle pour les entreprises de produits optiques, certaines personnes vont jusqu&#39;à dire que les informations partagées par Nokishita pourraient aussi bien être confirmées. </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> TechRadar </a> une fois appelé Nokishita &quot;le Père Noël des rumeurs de caméra&quot;. En réponse au tweet ci-dessus, l&#39;utilisateur de Twitter @miemelaar a demandé &quot;[est-ce] réel ou un concept ?&quot; et @rauuru_san a répondu &quot;si Nokishita le publie, c&#39;est la vraie affaire.&quot; </p> <p> Mais même si nous devions supposer que la fuite était vraie, combien d&#39;informations cela nous laisse-t-il vraiment ? </p> <p> Nous pourrions supposer que le FX3 fait partie de la gamme FX en raison de son nom, mais l&#39;appareil photo porte un symbole qui laisse perplexe de nombreux spéculateurs. Si cette marque Alpha blanche (α) sur la face avant de l&#39;appareil photo vous semble familière, ce serait parce que vous pouvez trouver la même sur les appareils photo sans miroir de Sony. </p> <p> Le FX3 est-il donc un appareil photo cinématographique, un appareil photo sans miroir ou une sorte d&#39;hybride de style reflex numérique ? Nous devrons attendre que plus de détails sortent. D&#39;ici là, envisagez de lire notre article sur le <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> principales différences entre les appareils photo sans miroir, les reflex numériques et les caméscopes </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> Qu&#39;apportera le Sony FX3 à la table ? </h2> <p> Depuis la chute du tweet de Nokishita, les spécifications du produit présumé de l&#39;appareil photo volent sur le Web. Rien encore de sources qui soient tout aussi réputées, cependant. </p> <p> Heureusement, nous devrions en savoir plus sur le Sony FX3 dans les semaines à venir. Le plus grand événement photographique du Japon, CP+ 2021, aura lieu du 25 au 28 février. </p>"}