{"title":"L&#39;IA de détection de discours haineux de Facebook porte ses fruits","content":"<p> Facebook améliore son efficacité pour reconnaître et supprimer les contenus haineux. La plate-forme <a href=\"https://transparency.facebook.com/community-standards-enforcement\" target=\"_blank\" rel=\"nofollow noopener\"> Rapport d&#39;application des normes communautaires </a> montre une réduction significative de la prévalence des discours de haine au cours du dernier trimestre 2020. </p> <h2 id=\"hate-speech-on-facebook-has-dipped\"> Le discours de haine sur Facebook a baissé </h2> <p> Dans le rapport sur l&#39;application des normes communautaires de Facebook d&#39;octobre à décembre 2020, la plateforme a révélé des améliorations majeures dans la façon dont Facebook gère les discours de haine. Guy Rosen, vice-président de l&#39;intégrité de Facebook a publié un article sur <a href=\"https://about.fb.com/news/2021/02/community-standards-enforcement-report-q4-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> le blog À propos de Facebook </a> pour souligner son succès. </p> <p> Pour 10 000 vues de contenu de Facebook, seulement sept à huit étaient des vues de contenu haineux. Facebook a également pris des mesures contre 6,3 millions de messages d&#39;intimidation et de harcèlement, contre 2,5 millions de messages au troisième trimestre. </p> <p> La plate-forme a également pu capturer 6,4 millions de contenus haineux organisés, ce qui représente une amélioration considérable par rapport aux quatre millions de contenus supprimés par Facebook au cours du trimestre précédent. </p> <p> Le rapport sur l&#39;application des normes communautaires a montré des améliorations similaires sur Instagram. Cinq millions de messages concernant le harcèlement et l&#39;intimidation ont été supprimés sur Instagram, ainsi que 6,6 millions de contenus contenant des propos haineux et 308 000 contenus de haine organisée. Tous ces chiffres dépassent les statistiques enregistrées au troisième trimestre. </p> <p> Le taux proactif de Facebook, également appelé quantité de contenu que Facebook supprime avant qu&#39;un utilisateur ne le signale, s&#39;est également amélioré. Pour l&#39;intimidation et le harcèlement, le taux proactif de la plateforme est passé de 26% à 49% sur Facebook et de 55% à 80% sur Instagram. </p> <p> <img alt=\"Facebook graph for bullying\" src=\"images/facebook-content-takedowns-q4-715.png\" loading=\"lazy\"> Crédit d&#39;image: Facebook </p> <p> <a href=\"https://www.makeuseof.com/facebooks-ai-tackles-hateful-content/\" target=\"_blank\" rel=\"nofollow noopener\"> L&#39;IA de détection de haine de Facebook </a> a joué un rôle majeur dans le renforcement de sa réponse au discours de haine. Rosen note que la plate-forme a apporté des améliorations à son IA &quot;où les nuances et le contexte sont essentiels, comme les discours de haine ou l&#39;intimidation et le harcèlement&quot;, ce qui a finalement contribué à réduire la quantité de contenu haineux sur Facebook. </p> <p> Mike Schroepfer, directeur de la technologie de Facebook, a publié un article séparé sur <a href=\"https://about.fb.com/news/2021/02/update-on-our-progress-on-ai-and-hate-speech-detection/\" target=\"_blank\" rel=\"nofollow noopener\"> le blog À propos de Facebook </a> pour célébrer les réalisations de l&#39;IA en constante amélioration de Facebook. Malgré ses récentes réalisations, Schroepfer espère que l&#39;IA de Facebook pourra s&#39;améliorer &quot;pour afficher le contenu dans son contexte à travers les langues, les cultures et les zones géographiques&quot;. </p> <p> </p> <h2 id=\"facebook-s-ai-is-getting-smarter\"> L&#39;IA de Facebook devient plus intelligente </h2> <p> Facebook a commencé à s&#39;appuyer davantage sur son système d&#39;IA pour évaluer les contenus haineux en raison de la pandémie de COVID-19 en cours. Rosen a noté que l&#39;équipe de Facebook sera probablement encore affectée par la pandémie &quot;jusqu&#39;à ce qu&#39;un vaccin soit largement disponible&quot;. </p> <p> Même si les modérateurs de Facebook retourneront un jour au travail normalement, il ne semble pas que l&#39;IA de la plate-forme aille nulle part. Facebook a seulement rendu son IA plus intelligente et plus efficace, et il ne semble pas que Facebook envisage d&#39;arrêter de progresser de si tôt. </p>"}