{"title":"Microsoft lance sa nouvelle application Office pour iPad","content":"<p> Microsoft a publié son application Office unifiée pour la tablette Apple. Avec lui, Word, Excel et PowerPoint sont désormais disponibles en un seul téléchargement sur iPhone et iPad dans le <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> Magasin d&#39;applications </a> . Microsoft fournit toujours ces applications iPad sous forme de téléchargements autonomes. </p> <h2 id=\"better-late-than-never\"> Mieux vaut tard que jamais </h2> <p> &quot;Nous combinons les applications Word, Excel et PowerPoint que vous connaissez en une seule application optimisée pour iPadOS&quot;, a écrit Microsoft dans les notes de version accompagnant le téléchargement. C&#39;est une excellente nouvelle si vous utilisez Office et que vous souhaitez travailler en déplacement. Pour ceux qui cherchent à <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> transformer leur iPad en remplacement d&#39;ordinateur portable </a> , il s&#39;agit d&#39;une version cruciale. </p> <p> Les applications sont disponibles gratuitement, mais l&#39;édition et d&#39;autres fonctionnalités avancées nécessitent un abonnement Office 365. Pour ceux qui se demandent, Microsoft propose diverses options d&#39;abonnement dans l&#39;application à partir de 6,99 $ par mois. </p> <p> Si vous n&#39;avez besoin que d&#39;un traitement de texte sur votre iPad, il serait peut-être préférable d&#39;envisager des alternatives dans <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> Tour d&#39;horizon des meilleures applications de traitement de texte pour iPad par MUO </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> Une expérience de bureau mobile unifiée </h2> <p> Pour être clair, il s&#39;agit d&#39;une mise à jour de l&#39;Office existant pour iOS, pas d&#39;une toute nouvelle version. le <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> L&#39;application Office tout-en-un a fait ses débuts sur l&#39;iPhone </a> et Android en février 2020. On ne sait pas ce qui a pris à Microsoft une année complète pour ajouter des versions optimisées pour iPad de Word, Excel et PowerPoint au mélange, mais mieux vaut tard que jamais. </p> <p> </p> <p> Avant aujourd&#39;hui, les applications de productivité incluses dans la suite offraient une expérience médiocre sur l&#39;iPad, car elles fonctionnaient auparavant en mode fenêtré. Mais avec la dernière mise à jour désormais disponible, les clients Apple peuvent désormais profiter de l&#39;expérience Office native sur leur iPhone, iPad ou iPod touch, quelle que soit la taille de l&#39;écran. </p> <p> </p> <h2 id=\"ipad-specific-features\"> Fonctionnalités spécifiques à l&#39;iPad </h2> <p> Microsoft ajoute régulièrement de nouvelles fonctionnalités optimisées pour les tablettes à ses offres Office mobiles. Par exemple, les versions mobiles de Word, Excel et PowerPoint ont récemment pris en charge les gestes de la souris et du trackpad. Les applications prennent également en charge la fonction multitâches côte à côte Split View d&#39;iOS. </p> <p> Alors que les éditions mobile et de bureau d&#39;Office n&#39;ont pas toutes les mêmes fonctionnalités, le nouvel Office pour iOS apporte quelques nouvelles fonctionnalités. Ceux-ci vous permettent de faire des choses telles que signer des documents avec votre Apple Pencil ou votre doigt, créer rapidement des PDF à partir de vos documents, convertir des images en texte et en tableaux, etc. </p> <p> </p> <p> En outre, vous pouvez désormais insérer facilement une date, une forme, une image et des notes dans des fichiers PDF. Quant aux utilisateurs expérimentés, ils peuvent désormais accéder aux actions basées sur des images d&#39;Office (comme Créer un PPT, Créer un PDF, etc.) via le menu Partager polyvalent d&#39;iOS. &quot;De plus, s&#39;il y a des captures d&#39;écran récentes lorsque vous ouvrez l&#39;application Office, elles sont présentées comme une suggestion de conversion au format PDF ou PPT&quot;, note la société. </p> <p> Microsoft apportera également quelques modifications à sa suite Office pour Mac et Windows. Selon le fabricant de Windows, les prochaines mises à jour d&#39;Office pour ordinateur de bureau en 2021 comporteront des licences perpétuelles, en plus d&#39;autres améliorations. </p>"}