{"title":"Microsoft lance Azure dans l&#39;espace avec le Spaceborne Computer-2 de HPE","content":"<p> Microsoft va au-delà du bord de la planète pour fournir des services extraterrestres. La société travaillera avec Hewlett Packard Enterprises pour se connecter à un PC sur la Station spatiale internationale (ISS) via sa plate-forme Azure. </p> <p> Le Spaceborne Computer-2 se connectera à Azure via les stations au sol de la NASA et de HPE, fournissant une grande puissance de traitement de données à la station spatiale. </p> <h2 id=\"azure-heads-into-space\"> Azure se dirige vers l&#39;espace </h2> <p> Comme rapporté sur <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> le blog Microsoft Azure </a> , le Spaceborne Computer-2 (SBC-2) fournira aux astronautes de l&#39;ISS des technologies plus proches de leurs homologues terrestres. </p> <p> L&#39;espoir est que cela réduise considérablement le temps nécessaire pour transférer des données entre l&#39;ISS et la Terre, ainsi que la quantité de bande passante requise pour le traitement et l&#39;analyse. </p> <blockquote> <p> Les astronautes et les explorateurs de l&#39;espace méritent d&#39;avoir accès aux meilleures technologies de cloud computing et à un traitement avancé à la pointe de la technologie. Parfois, l&#39;analyse doit être effectuée immédiatement à la périphérie où chaque instant qui passe compte, et d&#39;autres fois, l&#39;analyse est tellement complexe qu&#39;elle ne peut être effectuée qu&#39;avec la puissance du cloud hyperscale. </p> </blockquote> <p> Le Spaceborne Computer-2 utilise le système Edgeline Converged Edge de Hewlett Packard Enterprises, qui est « spécialement conçu pour les environnements de périphérie difficiles » et apportera de nombreuses fonctionnalités Azure à l&#39;ISS. </p> <p> Lorsque la connexion sera opérationnelle, le SBC-2 permettra des recherches dans des domaines tels que la modélisation météorologique pour les futures missions sur Mars, l&#39;analyse des plantes et hydroponiques pour soutenir la croissance des aliments et des cultures dans l&#39;espace, et l&#39;imagerie médicale sur l&#39;ISS elle-même ). </p> <p> Le Dr Mark Fernandez, architecte de solutions de Converged Edge Systems chez HPE et chercheur principal pour Spaceborne Computer-2, a déclaré : </p> <blockquote> <p> En réunissant le Spaceborne Computer-2 de HPE, qui est basé sur le système HPE Edgeline Converged Edge pour des capacités avancées d&#39;informatique de pointe et d&#39;IA, avec Microsoft Azure pour se connecter au cloud, nous permettons aux explorateurs de l&#39;espace de transmettre de manière transparente de grands ensembles de Earth et bénéficiez d&#39;une expérience edge-to-cloud </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> La prochaine phase de l&#39;initiative Azure Space de Microsoft </h2> <p> L&#39;annonce de Microsoft est un autre pas en avant pour son <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Espace Microsoft Azure </a> initiative, qu&#39;elle a lancée en octobre 2020. </p> <p> L&#39;initiative Azure Space est l&#39;effort de Microsoft pour faire &quot;le prochain pas de géant dans le cloud computing&quot;, en amenant sa plate-forme de cloud computing Azure dans l&#39;espace. </p> <p> </p> <p> Azure Space a déjà travaillé avec le projet SpaceX Starlink pour fournir le haut débit par satellite à son centre de données modulaire Azure (MDC) et poursuit ses travaux sur le projet Azure Orbital, qui étendra la connectivité entre ses centres de données cloud à l&#39;aide de la technologie satellite. </p>"}