{"title":"Mark Zuckerberg de Facebook a pris personnellement la poussée de confidentialité d&#39;Apple","content":"<p> Le PDG de Facebook, Mark Zuckerberg, aurait déclaré aux employés de Facebook que « nous devons infliger de la douleur » à Apple pour avoir si mal traité le géant des médias sociaux, le <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> le journal Wall Street </a> rapports. </p> <p> Zuckerberg aurait fait ce commentaire en 2018 après que les directeurs généraux d&#39;Apple et de Facebook se soient heurtés au scandale Cambridge Analytica, dans lequel les données personnelles de millions d&#39;utilisateurs de Facebook ont ​​été consultées sans leur consentement pour la publicité politique. </p> <h2 id=\"apple-vs-facebook\"> Apple contre Facebook </h2> <p> À l&#39;époque, le PDG d&#39;Apple, Tim Cook, avait été interrogé dans une interview sur la façon dont il réagirait s&#39;il se trouvait dans la situation de Zuckerberg, face à la crise. &quot;Je ne serais pas dans cette situation&quot;, a déclaré Cook. </p> <p> Le Wall Street Journal affirme que, alors que Zuckerberg a commenté que les mots de Cook étaient &quot;extrêmement désinvoltes&quot; et &quot;pas du tout alignés sur la vérité&quot;, dans les coulisses, il était considérablement plus sévère dans son évaluation. </p> <p> Depuis lors, la relation entre les deux entreprises technologiques ne s&#39;est pas améliorée. Apple a doublé sa position axée sur la confidentialité, Cook proclamant que la confidentialité est l&#39;un des <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> les préoccupations les plus urgentes du monde </a> . iOS 14 contient plusieurs fonctionnalités liées à la confidentialité, avec lesquelles Facebook a contesté, affirmant qu&#39;elles peuvent potentiellement nuire aux petites entreprises. </p> <p> Lors du dernier appel trimestriel aux investisseurs de Facebook, Zuckerberg a qualifié Apple de &quot; <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> l&#39;un des plus gros concurrents de [Facebook] </a> &quot; à la suite de ces nouvelles mesures de protection de la vie privée. &quot; Apple peut dire qu&#39;ils font cela pour aider les gens, mais les mouvements correspondent clairement à leurs intérêts concurrentiels &quot;, a déclaré Zuckerberg. </p> <p> </p> <p> Facebook est censé préparer une affaire antitrust contre Apple qui transformerait le sniping entre les deux titans de la Silicon Valley en une véritable bataille juridique. Le rapport du Wall Street Journal note que « les règlements réglementaires potentiels et les décisions juridiques sont susceptibles d&#39;affecter des centaines de millions de téléphones de consommateurs dans les années à venir. » </p> <p> </p> <h2 id=\"different-approaches\"> Différentes approches </h2> <p> Le porte-parole de Facebook, Dani Lever, a déclaré au Wall Street Journal : « Apple prétend qu&#39;il s&#39;agit de confidentialité, mais qu&#39;il s&#39;agit de profit, et nous nous joignons à d&#39;autres pour souligner leur comportement auto-préférentiel et anticoncurrentiel. » Elle a déclaré que Facebook « tient délibérément tête à Apple » au nom des petites entreprises et des développeurs qui sont lésés par la fonctionnalité de confidentialité des applications d&#39;Apple. </p> <p> Alors que Lever a nié que la bataille entre les deux sociétés soit personnelle, elle va absolument au-delà de quelques points de discorde entre deux grandes sociétés technologiques. Le modèle commercial financé par la publicité sur lequel Facebook opère est extrêmement différent du modèle financé par le matériel qui alimente Apple. Ni l&#39;une ni l&#39;autre des deux entreprises --- ni leurs dirigeants --- n&#39;est susceptible de revenir sur leurs convictions fondamentales sur la manière de construire l&#39;avenir de la technologie. </p> <p> Le fait que le PDG d&#39;Apple, Tim Cook, parle de confidentialité en termes moraux montre à quel point c&#39;est vraiment personnel, à un certain niveau. </p> <p> <small> Crédit d&#39;image : Wikipédia/ <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Anthony Quintano CC </a></small> </p>"}