{"title":"Microsoft a essayé d&#39;acheter Pinterest, mais l&#39;accord n&#39;est pas conclu... pour l&#39;instant","content":"<p> Microsoft a récemment approché Pinterest au sujet d&#39;un éventuel accord de rachat qui aurait constitué l&#39;une des plus importantes acquisitions jamais réalisées par Redmond. Actuellement, les pourparlers ne sont pas actifs, mais l&#39;ampleur de la fusion proposée marque davantage les plans de croissance de Microsoft. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft veut acheter Pinterest </h2> <p> Tel que rapporté par le <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Temps Financier </a> , Microsoft a tenté d&#39;acheter Pinterest, le plus grand tableau d&#39;affichage amateur au monde. </p> <p> Pinterest est actuellement évalué à environ 51 milliards de dollars, et sa valeur marchande a augmenté de plus de 600% tout au long de la pandémie de COVID-19 alors que les gens se connectent en ligne pendant les blocages. L&#39;annonce d&#39;un éventuel rachat a fait grimper l&#39;action de Pinterest de 7 % avant l&#39;ouverture des marchés le jeudi 11 février. </p> <p> Cette décision aurait fait entrer Pinterest dans l&#39;écurie sans cesse croissante d&#39;acquisitions technologiques majeures de Microsoft. En 2016, Microsoft a acquis LinkedIn dans le cadre d&#39;un accord de 26 milliards de dollars, suivi par l&#39;achat de Github pour 7,5 milliards de dollars en 2018. </p> <p> C&#39;est sans mentionner que Microsoft possède Minecraft, acheté pour 2,5 milliards de dollars en 2014, et l&#39;acquisition en cours de la principale société holding de jeux, ZeniMax, pour 7,5 milliards de dollars. ZeniMax est la société mère de studios de jeux tels que Bethesda Softworks, id Software, Alpha Dog Games et Tango Gameworks. </p> <p> De plus, il y avait un <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> tentative infructueuse d&#39;achat de TikTok </a> Actifs nord-américains, australiens et néo-zélandais à la mi-2020. L&#39;accord a finalement échoué, mais était évalué entre 20 et 30 milliards de dollars et est intervenu après que l&#39;ancien président <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Trump a menacé d&#39;interdire </a> le réseau social de partage de vidéos des États-Unis entièrement. </p> <p> Si l&#39;accord Pinterest avait abouti, voire s&#39;il se finalisait à une date ultérieure, il deviendrait la plus grosse acquisition de Microsoft à ce jour. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> Pourquoi Microsoft rachète-t-il autant d&#39;entreprises technologiques ? </h2> <p> Microsoft ne manque pas d&#39;argent et veut étendre son empire. Ses propres actions ont augmenté de quelque 80% depuis le début de la pandémie de COVID-19 et ont récemment révélé ses bénéfices record. </p> <p> </p> <p> L&#39;acquisition d&#39;une autre plateforme, comme Pinterest, est un ticket d&#39;accès aux données pour les autres services de Microsoft. Le volume de données généré par des plateformes comme LinkedIn est l&#39;outil parfait pour former ses technologies d&#39;IA. De plus, la prise en charge et la gestion d&#39;un énorme service en ligne comme Pinterest sert également de publicité pour sa plate-forme Azure. </p> <p> Comme le rapport du Financial Times y fait également allusion, parler d&#39;une fusion aussi énorme entre deux sociétés technologiques mettrait également l&#39;administration du président Biden à l&#39;épreuve. La nouvelle administration est-elle heureuse de permettre aux géants de la technologie tels que Microsoft, Google et Facebook de racheter la concurrence ? Seul le temps nous le dira. </p>"}