{"title":"Nintendo confirme la prochaine vitrine Nintendo Direct","content":"<p> Nintendo a publié des détails sur la date de sa prochaine présentation Nintendo Direct, et vous n&#39;aurez pas à attendre longtemps les nouvelles du créateur de Mario. </p> <h2 id=\"nintendo-direct-reveals-forthcoming-presentation-date\"> Nintendo Direct révèle la date de présentation à venir </h2> <p> Vous voulez savoir ce que Nintendo a prévu pour l&#39;année à venir ? Dans ce cas, vous devrez vous connecter à la prochaine vitrine Nintendo Direct et l&#39;entendre. </p> <p> Le prochain Nintendo Direct aura lieu le 17 février, comme le confirme un tweet de Nintendo of America. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Rendez-vous le 17/02 à 14h. TP pour un <a href=\"https://twitter.com/hashtag/NintendoDirect?src=hash&ref_src=twsrc%5Etfw\"> #NintendoDirect </a> livestream avec environ 50 minutes d&#39;informations axées sur les jeux disponibles comme Super <a href=\"https://twitter.com/hashtag/SmashBrosUltimate?src=hash&ref_src=twsrc%5Etfw\"> #SmashBrosUltimate </a> et des jeux à venir <a href=\"https://twitter.com/hashtag/NintendoSwitch?src=hash&ref_src=twsrc%5Etfw\"> #NintendoSwitch </a> au premier semestre 2021. <a href=\"https://t.co/fbG3hEtD0Q\"> https://t.co/fbG3hEtD0Q </a> <a href=\"https://t.co/w8J6lbdIkQ\"> pic.twitter.com/w8J6lbdIkQ </a></p> – Nintendo of America (@NintendoAmerica) <a href=\"https://twitter.com/NintendoAmerica/status/1361676737730519042?ref_src=twsrc%5Etfw\"> 16 février 2021 </a></blockquote>  <p> Si vous voulez les dernières nouvelles de Nintendo, connectez-vous <a href=\"https://www.nintendo.com/nintendo-direct/02-17-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> Page Nintendo Direct sur nintendo.com </a> , à partir de 17h00 ET (14h00 PT, 22h00 GMT). </p> <p> </p> <h2 id=\"what-will-nintendo-reveal-at-nintendo-direct\"> Que va révéler Nintendo au Nintendo Direct ? </h2> <p> Il est généralement impossible de dire ce que Nintendo a dans ses manches pour une annonce. Il y aura probablement pas mal de nouvelles sur le jeu, en particulier avec la franchise Zelda qui approche de son 35e anniversaire. </p> <p> Étant donné que <a href=\"https://www.makeuseof.com/nintendo-switch-bestselling-console-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> le Switch et le Switch Lite sont des consoles extrêmement populaires aux États-Unis </a> , les nouvelles sont susceptibles de se concentrer sur ces consoles actuelles et les titres disponibles pour elles. </p> <p> Si vous espérez une annonce concernant la prochaine console Switch, vous ne devez pas retenir votre souffle. Nintendo est resté résolument méfiant quant à l&#39;avenir de la console Switch et s&#39;il en a une nouvelle à l&#39;horizon. </p> <p> </p> <h2 id=\"keep-up-to-date-with-nintendo-news\"> Restez à jour avec les nouvelles de Nintendo </h2> <p> <img alt=\"Nintendo Switch Family Membership Header\" src=\"images/nintendo-switch-family-header-378.jpg\" loading=\"lazy\"> </p> <p> Nintendo Direct est le moyen pour Nintendo de donner à ses fidèles fans les dernières nouvelles sur la marque. Donc, que vous ayez une Switch, une Switch Lite ou même toute une collection de consoles Nintendo, assurez-vous de vous connecter. </p>"}