{"title":"Parler revient en ligne après un arrêt d&#39;un mois","content":"<p> Après avoir été exclu par Big Tech, Parler a finalement refait surface sur le Web. La plate-forme « liberté d&#39;expression » est désormais accessible aux utilisateurs existants et commencera bientôt à accepter de nouvelles inscriptions d&#39;utilisateurs dans les semaines à venir. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler réémerge après la grande panne technologique </h2> <p> Parler a fait un retour après une longue panne d&#39;électricité. Le réseau social alternatif a gagné du terrain parmi les conservateurs politiques et a été <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> démarré par Amazon Web Services (AWS), Google et Apple </a> suite aux émeutes du Capitole. Parler a été accusé de ne pas en faire assez pour modérer le contenu violent, ce qui a entraîné son retrait des magasins d&#39;applications et du Web. </p> <p> Au lieu d&#39;AWS, Parler utilise désormais un hôte appelé SkySilk. Le site a également enregistré son nom de domaine auprès d&#39;Epik, un bureau d&#39;enregistrement qui s&#39;adresse à d&#39;autres types de réseaux de « liberté d&#39;expression » comme Gab. </p> <p> Un nouvel hôte et un registraire de domaine ne sont pas les seuls changements apportés par Parler : Parler est même réapparu avec un nouveau PDG par intérim. Cela vient après <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> l&#39;équipe de Parler aurait licencié le co-fondateur John Matze </a> . </p> <p> Mark Meckler remplacera temporairement Matze en tant que PDG et a précédemment cofondé le groupe de droite Tea Party Patriots. Dans une déclaration obtenue par <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> La colline </a> , Meckler a annoncé le retour tant attendu de Parler : </p> <blockquote> <p> Lorsque Parler a été mis hors ligne en janvier par ceux qui souhaitent faire taire des dizaines de millions d&#39;Américains, notre équipe s&#39;est réunie, déterminée à tenir notre promesse à notre communauté très engagée que nous reviendrons plus forts que jamais. Nous sommes ravis d&#39;accueillir à nouveau tout le monde. </p> </blockquote> <p> Meckler a poursuivi en notant que Parler restera dédié à &quot;la liberté d&#39;expression, la vie privée et le dialogue civil&quot;. Il a également rassuré les utilisateurs que &quot;Parler est dirigé par une équipe expérimentée et est là pour rester&quot;. </p> <p> Bien que les anciens comptes sur la plate-forme soient sauvegardés, les anciens messages (ou &quot;pourparlers&quot;) n&#39;ont pas été restaurés. Si vous avez déjà un compte sur Parler, vous pouvez continuer à utiliser le site. Sinon, vous devrez attendre environ une semaine avant de pouvoir vous inscrire. </p> <p> Mais même si vous avez déjà un compte Parler, vous pourriez rencontrer des difficultés techniques lors de l&#39;utilisation de la plate-forme. Il semble que le service n&#39;ait pas encore été entièrement restauré. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> L&#39;application Parler reste toujours dans les limbes </h2> <p> Parler est toujours banni du Google Play Store et de l&#39;App Store d&#39;Apple, ce qui pourrait gravement nuire à sa base d&#39;utilisateurs. Dans l&#39;état actuel des choses, la plate-forme pourrait rester indisponible sur les appareils mobiles pendant une durée inconnue. </p> <p> Il ne pourra probablement pas revenir sur le Play Store ou l&#39;App Store à moins qu&#39;il ne modifie ses règles de modération, ce que Parler refusera probablement de faire. </p>"}