{"title":"Pouvez-vous obtenir Netflix sur votre Nintendo Switch ?","content":"<p> Il semble que vous puissiez obtenir Netflix sur toutes les plateformes. Que ce soit votre téléviseur, votre décodeur ou votre téléphone, le service de streaming le plus populaire au monde est disponible partout où vous le souhaitez. Ou est-ce? </p> <p> Si vous possédez la Nintendo Switch, vous vous demandez peut-être si vous pouvez regarder Netflix dessus. Découvrons-le... </p> <h2 id=\"can-you-watch-netflix-on-the-nintendo-switch\"> Pouvez-vous regarder Netflix sur la Nintendo Switch ? </h2> <p> <a href=\"https://www.makeuseof.com/nintendo-switch-streaming-services/\" target=\"_blank\" rel=\"nofollow noopener\"> La Nintendo Switch prend en charge quelques services de streaming </a> mais Netflix n&#39;en fait pas partie. Du moins officiellement. </p> <p> Cela signifie que vous ne pouvez pas accéder à l&#39;eShop et télécharger une application Netflix. En fait, au moment de la rédaction, les services de streaming proposés par la Nintendo Switch via l&#39;eShop sont limités à Hulu, YouTube et Funimation. </p> <p> Vous ne pouvez pas non plus utiliser le navigateur Web de la console pour regarder Netflix. Cela ne fonctionnera pas. </p> <p> Cependant, vous pouvez installer Android sur votre Nintendo Switch et Netflix est disponible sur Android. Il s&#39;agit d&#39;un processus compliqué qui n&#39;est pas pris en charge par Nintendo. Cela annulera votre garantie et ne doit être entrepris que par des utilisateurs qui comprennent le processus et les conséquences. </p> <p> Pour la plupart des gens, il est préférable de garder espoir que Netflix soutiendra officiellement la Nintendo Switch à l&#39;avenir. </p> <p> Dans une interview de 2017 avec <a href=\"https://www.washingtonpost.com/news/the-switch/wp/2017/03/08/nintendos-u-s-ceo-responds-to-our-biggest-gripes-with-the-switch/\" target=\"_blank\" rel=\"nofollow noopener\"> Le Washington Post </a> , Reggie Fils-Aime, alors président de Nintendo of America, a déclaré que Nintendo parlait à Netflix - bien sûr, beaucoup de temps s&#39;est écoulé depuis et rien n&#39;a abouti. </p> <p> </p> <h2 id=\"can-you-watch-netflix-on-other-nintendo-consoles\"> Pouvez-vous regarder Netflix sur d&#39;autres consoles Nintendo ? </h2> <p> La Nintendo Wii et la Nintendo Wii U avaient toutes deux des applications Netflix dédiées dans le passé. </p> <p> Cependant, à partir du 31 décembre 2020, l&#39;application Netflix n&#39;était plus disponible pour les nouveaux utilisateurs à télécharger depuis l&#39;eShop. </p> <p> Le 30 juin 2021, l&#39;application Netflix fermera complètement pour les utilisateurs existants. À ce stade, aucune console Nintendo ne prendra en charge Netflix. </p> <p> Pour l&#39;instant, vous n&#39;aurez qu&#39;à profiter des options de vidéo en streaming limitées prises en charge par le Switch et regarder Netflix sur un autre appareil. </p>"}