{"title":"Quelle est la différence entre LAN et WAN dans la mise en réseau ?","content":"<p> Si vous avez mis votre nez dans les réseaux informatiques, il y a de fortes chances que vous ayez rencontré les termes « LAN » et « WAN ». Cependant, que signifie chacun et quelles sont les différences lorsque vous comparez un réseau local à un réseau étendu ? </p> <p> Explorons ces deux technologies et où chacune brille. </p> <h2 id=\"what-does-lan-stand-for\"> Que signifie « LAN » ? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> Crédit d&#39;image : Drogue Naroda/ <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Un réseau local est un « réseau local ». Ce terme décrit un réseau où tous les appareils connectés sont proches les uns des autres. Ils sont tous dans une &quot;zone locale&quot;, d&#39;où le nom. </p> <p> Lorsqu&#39;un ordinateur se connecte à un réseau local, il obtient une adresse de protocole Internet (IP) locale. Cela fonctionne de la même manière que l&#39;adresse IP que vous obtenez lorsque vous vous connectez. Cependant, une adresse IP locale ne fonctionne que pour les autres ordinateurs sur le même réseau local que vous. Vous ne pouvez pas utiliser une adresse IP locale pour vous connecter à votre PC via Internet, par exemple. </p> <p> La frontière physique de votre réseau local domestique ne quittera probablement pas votre maison. Bien sûr, si vous emmenez votre téléphone ou votre ordinateur portable dans votre jardin pour prendre l&#39;air, il est toujours sur le réseau local. Cependant, la plupart du temps, tous vos appareils connectés au réseau sont en toute sécurité dans les quatre murs de votre maison. </p> <p> Les entreprises et les instituts fabriquent également des réseaux locaux. Par exemple, une université peut connecter tous les PC de sa bibliothèque à un réseau afin qu&#39;ils puissent tous se parler. Les entreprises aiment également utiliser les réseaux locaux car cela permet aux travailleurs de s&#39;envoyer des fichiers et de la correspondance sans avoir besoin d&#39;aller en ligne. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> Que signifie &quot;WAN&quot; ? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Crédit d&#39;image: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> D&#39;autre part, nous avons le réseau étendu, ou WAN. Si vous lisez cet article, vous êtes déjà connecté à un réseau étendu, nous aimons l&#39;appeler Internet. </p> <p> Le &quot;large&quot; dans le réseau étendu est très variable. Si vous vous connectez à un serveur externe dans la même ville que vous, c&#39;est un WAN. Il est également considéré comme un WAN si vous vous connectez à un serveur dans un pays de l&#39;autre côté de la planète. </p> <p> En tant que tel, un WAN est généralement utilisé pour décrire tout réseau auquel vous vous connectez et qui existe après votre routeur. Peu importe que le serveur se trouve à un kilomètre ou à un autre d&#39;un continent ; c&#39;est toujours &quot;large&quot;. </p> <p> Internet n&#39;est pas le seul WAN. Les entreprises font bon usage des WAN pour connecter des bureaux situés dans différents pays. Par exemple, si une entreprise a un bureau à New York, Tokyo et Sydney, elle peut louer son propre système WAN pour lui permettre de se parler. </p> <p> Mais attendez une minute ; Pourquoi les entreprises créent-elles leur propre WAN alors qu&#39;elles peuvent simplement tout connecter à Internet ? Le problème avec cette solution est que l&#39;entreprise devra payer des frais de FAI, et si quelque chose ne va pas, ils doivent lutter avec ledit FAI pour le faire réparer. </p> <p> Non seulement cela, mais Internet est conçu pour se connecter à de nombreux PC dans le monde. Si une entreprise souhaite uniquement que ses PC se connectent à d&#39;autres PC de bureau, elle peut utiliser son propre WAN pour se protéger des menaces en ligne. C&#39;est ce qu&#39;on appelle un &quot;intranet&quot;. </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> Quand utiliser un LAN ou un WAN </h2> <p> Lorsque vous souhaitez vous connecter à un autre appareil que vous possédez, vous pouvez choisir de le faire via LAN ou WAN. Mais quels sont les avantages et les inconvénients de chacun, et lesquels devriez-vous utiliser ? </p> <p> Disons que vous avez un nouveau disque dur sans fil qui se connecte à votre routeur et que vous avez le choix d&#39;autoriser les connexions depuis Internet (un WAN) ou de le garder local uniquement (LAN). Celui que vous choisissez dépend de ce que vous voulez du disque dur. </p> <p> Donner des capacités WAN au disque dur est fantastique pour plus de commodité. Cela le met sur Internet, ce qui signifie que vous pouvez vous y connecter de n&#39;importe où dans le monde. En tant que tel, vous ne serez plus jamais bloqué sans vos fichiers ; ils seront juste à une connexion Internet. </p> <p> Cependant, les connexions WAN permettent également à d&#39;autres personnes d&#39;accéder à vos appareils. Si la sécurité de votre disque dur n&#39;est pas à la hauteur, les pirates peuvent utiliser le même chemin que vous pour voir toutes vos données et copier ou supprimer des éléments importants. </p> <p> En revanche, mettre le disque dur en mode LAN uniquement le protège de certaines des voies qu&#39;un pirate informatique peut emprunter. Ce n&#39;est pas imperméable. Par exemple, quelqu&#39;un peut utiliser votre PC pour accéder au disque dur. Cependant, c&#39;est beaucoup plus sûr que de diffuser le disque dur sur le WAN chaque jour et nuit. </p> <p> Si vous voulez vraiment, vraiment renforcer la sécurité, vous pouvez isoler le disque dur. L&#39;espacement signifie que lui et tous les PC sur le même réseau ne sont pas connectés à un WAN, comme Internet, par exemple. </p> <p> Un <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> l&#39;ordinateur isolé n&#39;est pas totalement protégé contre les menaces en ligne </a> , mais cela réduit considérablement les chances d&#39;une attaque. Les pirates informatiques doivent manipuler les êtres humains pour qu&#39;ils fassent ce qu&#39;ils veulent pour attaquer un appareil à vide, en utilisant des tactiques d&#39;ingénierie sociale pour parvenir à leurs fins. </p> <p> En tant que tel, lorsque vous choisissez entre mettre un appareil sur Internet ou le garder verrouillé sur votre réseau local domestique, vous devez déterminer si vous vous y connecterez réellement via Internet. Si vous ne le pensez pas, il est préférable de désactiver ses capacités WAN et de tenir les pirates à distance. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> La connexion à Internet transforme-t-elle un réseau local en réseau étendu ? </h2> <p> Disons que vous avez configuré un réseau local où tous vos appareils sont connectés à un routeur. Vous vous ennuyez, alors vous montez sur votre ordinateur et vous dirigez vers Netflix. Maintenant, votre PC est connecté à un WAN : Internet. </p> <p> Cependant, étant donné que votre PC est connecté à un réseau étendu, cela signifie-t-il qu&#39;il ne fait plus partie d&#39;un réseau local ? Heureusement, un périphérique peut faire partie à la fois d&#39;un LAN et d&#39;un WAN. </p> <p> Rappelez-vous comment nous avons dit que les périphériques LAN ont leur propre adresse IP locale ? Cela ne veut pas dire qu&#39;il ne peut pas non plus obtenir d&#39;adresse IP Internet. En fait, si vous lisez cet article sur un appareil connecté à un routeur, il aura les deux ! </p> <p> Si vous voulez vérifier par vous-même, nous avons couvert <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> comment vérifier votre adresse IP sur Windows </a> . Si vous êtes sur mobile, vous pouvez toujours <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> retrouvez vos adresses IP sur Android ou iPhone </a> . </p> <p> Une fois que vous avez les statistiques, vous devriez voir deux adresses IP. Le premier commencera par &quot;192.168&quot; - celui-ci est votre adresse IP locale. Vous utilisez celui-ci si vous souhaitez vous connecter à votre appareil actuel à partir d&#39;un autre sur le même réseau. </p> <p> Le second aura l&#39;air de deux manières, selon que vous utilisez IPv4 ou IPv6. Si vous utilisez la v4, elle devrait ressembler à votre adresse IP locale, mais elle ne commencera pas par &quot;192.168&quot;. S&#39;il s&#39;agit d&#39;IPv6, il devrait s&#39;agir d&#39;un fouillis de lettres et de chiffres, divisé en huit blocs par deux points. </p> <p> Dans tous les cas, cette adresse est votre adresse IP Internet. C&#39;est utilisé lorsque vous vous connectez à un autre serveur sur Internet pour qu&#39;il puisse vous parler ; par exemple, pour vous envoyer cette émission de télévision que vous regardez sur Netflix. </p> <p> D&#39;une certaine manière, vous pouvez imaginer Internet comme un immense réseau de réseaux locaux. Lorsque vous regardez Netflix, votre PC (sur votre réseau local personnel) reçoit des données des serveurs Netflix (qui se trouvent sur son propre réseau local). Chaque LAN est comme une maison dans une ville, tandis que la connectivité Internet est comme les routes et les rues qui les relient toutes. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> Supprimer la confusion entre LAN et WAN </h2> <p> Les LAN et les WAN fonctionnent souvent en tandem, mais ils fonctionnent de différentes manières. Vous connaissez maintenant la différence entre les deux et quand les utiliser. </p> <p> Saviez-vous que vous pouvez configurer un jeu en réseau local pour que les personnes sur le même réseau puissent jouer les unes avec les autres ? C&#39;est un excellent moyen de passer du temps avec des amis sans les problèmes de latence que les jeux sur Internet ont parfois. </p> <p> <small> Crédit d&#39;image : metamorworks/ <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}