{"title":"Qu&#39;est-ce que le MTA-STS et comment protège-t-il vos e-mails ?","content":"<p> Les e-mails sont le principal responsable de la plupart des cyberattaques. Il s&#39;agit d&#39;un point d&#39;accès facile pour les logiciels malveillants, les logiciels publicitaires, le spam et le phishing, et offre des opportunités infinies aux acteurs malveillants pour obtenir vos informations personnelles. </p> <p> Pour atténuer ces menaces, des mesures de sécurité strictes doivent être mises en place pour les comptes de messagerie individuels et professionnels. </p> <h2 id=\"email-security-and-encryption\"> Sécurité et cryptage des e-mails </h2> <p> Malgré la popularité d&#39;autres modes de communication, la messagerie électronique reste la plus grande forme de données en transit pour tout individu ou organisation. Sécuriser le contenu de vos e-mails est une nécessité vitale. </p> <p> La sécurité du courrier électronique implique l&#39;inspection et le cryptage de tout le trafic de courrier électronique entrant et sortant. Le cryptage joue un rôle essentiel dans la préservation de la confidentialité du contenu des e-mails en garantissant des connexions SMTP (Simple Mail Transfer Protocol) sécurisées. </p> <p> Jusqu&#39;à récemment, le cryptage n&#39;était qu&#39;une exigence facultative pour SMTP. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> Comment fonctionne le cryptage des e-mails ? </h2> <p> Le chiffrement des e-mails consiste à ajouter un chiffre ou un morceau de code au contenu de votre message, le rendant indéchiffrable. En convertissant les données des e-mails en code, le contenu est protégé contre toute exposition non autorisée. Autrement dit, votre e-mail est brouillé. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> Pour plus de sécurité, le processus de cryptage utilise des clés publiques et privées où les clés cryptées sont échangées pour verrouiller et déverrouiller les e-mails codés. L&#39;expéditeur crypte le courrier électronique à l&#39;aide de la cryptographie à clé publique et, par la suite, le destinataire utilise une clé privée pour déchiffrer le message reçu. </p> <p> Le chiffrement est appliqué à l&#39;ensemble du parcours d&#39;un e-mail, du début à la fin. En tant que bonne pratique, tous les e-mails entrants et sortants doivent être chiffrés, pas seulement ceux contenant des informations sensibles. Cela empêche les acteurs de la menace d&#39;obtenir un point d&#39;entrée dans votre système. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> Contexte et problèmes avec SMTP </h2> <p> Lorsque le protocole SMTP a vu le jour en 1982, le cryptage des e-mails n&#39;était pas une pratique courante et par défaut, les e-mails étaient envoyés et reçus en texte brut. Pour introduire la sécurité au niveau du transport, la commande STARTTLS a été ajoutée à la fin des années 1990, qui offrait l&#39;option de cryptage via le <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> Protocole TLS (Transport Layer Security) </a> . </p> <p> Aussi prometteuse que puisse paraître la mise à niveau de TLS, elle a laissé intactes deux failles de sécurité : </p> <ol> <li> L&#39;option de chiffrement était simplement la suivante : <strong> optionnel </strong> . Les e-mails non sécurisés étaient toujours monnaie courante, provoquant une augmentation des cyberattaques. </li> <li> Même avec le STARTTLS en place, il n&#39;y avait aucun moyen d&#39;authentifier l&#39;identité du serveur de l&#39;expéditeur puisque les serveurs SMTP ne valident pas les certificats. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> L&#39;arrivée de MTA-STS </h2> <p> En 2019, Google s&#39;est enfin montré à la hauteur et a annoncé l&#39;adoption de la nouvelle norme MTA-STS (Mail Transfer Agent/Strict Transport Security) ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> Cela donne aux fournisseurs de services de messagerie la possibilité d&#39;imposer TLS pour sécuriser les connexions SMTP et offre également la possibilité de refuser la livraison des e-mails aux hôtes MX qui n&#39;offrent pas TLS avec un certificat de serveur fiable. </p> <p> MTA-STS s&#39;occupe enfin de tous les problèmes précédents avec SMTP en appliquant le cryptage entre les serveurs SMTP en communication. Mais comment ça marche concrètement ? Découvrons-le! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> Comment fonctionne MTA-STS ? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS se met au travail en demandant à un serveur SMTP de communiquer uniquement avec un autre serveur SMTP à deux conditions : </p> <ol> <li> Le serveur SMTP <strong> doit </strong> être crypté. </li> <li> Le nom de domaine sur le certificat du serveur correspond au domaine dans la règle, et les certificats sont à jour. </li> </ol> <p> En utilisant une combinaison de DNS et HTTPS pour publier une politique, MTA-STS informe l&#39;expéditeur de la marche à suivre si un canal de communication crypté ne peut pas être initié. </p> <p> Il est facile de mettre en œuvre MTA-STS du côté du destinataire, mais pour l&#39;expéditeur, un logiciel de serveur de messagerie prenant en charge tel que <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> Devrait être utilisé. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> Quel type d&#39;attaques le MTA-STS atténue-t-il ? </h2> <p> Les menaces suivantes sont affrontées de front si MTA-STS est appliqué à vos communications par e-mail : </p> <p> <strong> Attaques de l&#39;homme au milieu (MITM) : </strong> Cette attaque est effectuée lorsqu&#39;un attaquant s&#39;interpose au milieu d&#39;une communication entre deux parties pour voler ou modifier des données. Dans le cas d&#39;un e-mail, cela signifie généralement deux serveurs SMTP en communication. En utilisant MTA-STS, ces attaques peuvent être facilement évitées. </p> <p> <strong> Attaques de déclassement : </strong> Un acteur malveillant force un canal réseau à passer à un mode de transmission de données non sécurisé. Par exemple, cette attaque peut rediriger un visiteur de site Web d&#39;une version HTTPS d&#39;un site vers une version HTTP. MTA-STS aide à combattre ces attaques en empêchant tout accès non autorisé. </p> <p> <strong> Attaques d&#39;usurpation DNS : </strong> Ces attaques rusées modifient les enregistrements DNS de la destination prévue d&#39;un utilisateur et le font croire qu&#39;il visite un site ou un domaine légitime. La mise en œuvre de MTA-STS aide grandement à atténuer ces attaques. </p> <p> </p> <p> Maintenant que nous connaissons le MTA-STS, il est temps d&#39;aborder une nouvelle norme de reporting pour SMTP connue sous le nom de reporting TLS. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> Qu&#39;est-ce que la création de rapports SMTP TLS (TLS-RPT) ? </h2> <p> Tout comme MTA-STS, TLS-RPT est une norme de rapport qui détecte les problèmes de connectivité et les écarts entre les applications d&#39;envoi. Une fois activé, il envoie des rapports quotidiens concernant les problèmes de connexion rencontrés par les serveurs externes lors de l&#39;envoi d&#39;e-mails. </p> <p> Considérez-le comme un outil de dépannage où les rapports peuvent être utilisés pour évaluer et trier les problèmes potentiels et les problèmes de configuration. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> Quel type de problèmes TLS-RPT résout-il ? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Rapport de diagnostic : </strong> Les rapports TLS proposent des rapports de diagnostic au format de fichier JSON contenant des détails complets sur les e-mails entrants confrontés à des problèmes de livraison. Il détecte également les e-mails qui ont rebondi ou n&#39;ont pas été livrés en raison d&#39;une attaque de rétrogradation, par exemple. </p> <p> <strong> Visibilité améliorée : </strong> En activant TLS-RPT, vous pouvez améliorer la visibilité sur tous vos canaux de messagerie. Cela vous permet de garder un œil sur toutes les données qui se dirigent vers vous, qui incluent également les messages ayant échoué. </p> <p> <strong> Rapports quotidiens : </strong> Les rapports de diagnostic sont envoyés au moins une fois par jour pour couvrir et observer en profondeur les politiques MTA-STS. Les rapports incluent également des statistiques de trafic ainsi que des informations détaillées sur les erreurs et les échecs de livraison. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Lorsque tout le reste échoue, le cryptage prévaut </h2> <p> En raison de la nature en constante évolution des cybermenaces, des mesures de sécurité strictes et la cryptographie sont indispensables pour une livraison sûre et sécurisée des e-mails. </p> <p> Grâce aux différents fournisseurs de messagerie offrant de fortes capacités de cryptage et aux normes MTA-STS, les transferts de messagerie entièrement sécurisés ne sont plus une réalité farfelue. </p>"}