{"title":"Rapport : Android 12 proposera un mode à une main","content":"<p> Nous avons officiellement atteint la phase du cycle de vie d&#39;Android 11 où les rumeurs d&#39;Android 12 commencent à sortir en force. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> Développeurs XDA </a> a signalé que Google travaille sur un mode à une main pour Android 12 qui facilitera grandement la navigation dans le téléphone avec une seule main. Que vous ayez de grandes ou de petites mains, cela pourrait ouvrir une toute nouvelle façon d&#39;interagir avec votre appareil Android. </p> <p> Bien entendu, de nombreux fabricants d&#39;appareils et <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> les développeurs de logiciels ont introduit des solutions pour améliorer la convivialité d&#39;une seule main </a> . Pourtant, il sera bien plus agréable à utiliser lorsqu&#39;il sera intégré directement dans le système d&#39;exploitation. </p> <h2 id=\"android-12-s-one-handed-mode\"> Le mode à une main d&#39;Android 12 </h2> <p> Selon le rapport, Google prévoit d&#39;ajouter la fonctionnalité à une main à AOSP, qui est la version open source d&#39;Android que tous les créateurs de logiciels peuvent utiliser sur leurs appareils. Cela signifie également que les OEM qui n&#39;ont pas encore développé leur propre mode à une main auront un moyen simple d&#39;implémenter la fonctionnalité dans leurs appareils. </p> <p> Ce que le rapport n&#39;indiquait pas, c&#39;était si Google exigerait des fabricants de téléphones qu&#39;ils utilisent la fonction à une main d&#39;Android 12 ou si ce serait facultatif. </p> <p> Comme il est encore incroyablement tôt, nous ne savons pas exactement comment fonctionnera le mode à une main d&#39;Android 12. Si la capacité passée de Google à ajouter des fonctionnalités au système d&#39;exploitation est une indication, nous nous attendons à ce que l&#39;entreprise fasse du bon travail avec la mise en œuvre. Google peut choisir de réduire l&#39;intégralité de l&#39;écran dans un coin de l&#39;appareil pour un accès facile. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> Le rapport indique également que le mode à une main Android 12 aura un moyen de le déclencher à l&#39;aide du mode traditionnel à trois boutons ainsi que du nouveau mode de navigation gestuelle. </p> <p> Comme mentionné, de nombreux fabricants de smartphones ont déjà implémenté cette fonctionnalité dans leur propre version modifiée d&#39;Android. Par exemple, Huawei a en fait essayé de soumettre sa version de la fonctionnalité à l&#39;AOSP, mais Google l&#39;a rejetée. Peut-être que Google l&#39;a refusé parce que l&#39;entreprise savait qu&#39;elle avait l&#39;intention d&#39;apporter sa propre version de la fonctionnalité elle-même. </p> <p> Parce que cette fuite est si précoce, aucune photo ne démontre encore la fonctionnalité, nous devrons donc attendre qu&#39;Android 12 se rapproche de sa sortie. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Quand Android 12 sortira-t-il ? </h2> <p> Malheureusement, nous ne savons pas exactement quand Android 12 sera déployé au public (bien que ce ne soit pas avant un moment). Nous ne savons pas non plus exactement quand cette fonctionnalité sortira pour les développeurs ou dans les versions bêta ou stables d&#39;Android. </p> <p> Comme c&#39;est toujours le cas avec les nouvelles fonctionnalités Android, nous devrons attendre et voir si cela concerne le système d&#39;exploitation. </p>"}