{"title":"RPG informatiques vs. RPG classiques : que signifie CRPG en 2021 ?","content":"<p> L&#39;histoire des jeux de rôle informatiques est aussi longue que l&#39;histoire des jeux vidéo eux-mêmes, évoluant et se développant ensemble au fil des ans. Et tout comme les GPRC évoluaient, améliorant les graphismes, ajoutant ou supprimant des mécanismes de jeu, la signification et la terminologie utilisées pour les décrire évoluaient également. </p> <p> L&#39;acronyme CRPG, qui signifiait traditionnellement Computer Role Playing Game, a élargi son sens au fil du temps pour inclure des RPG pour différentes plateformes. Maintenant, il a adopté un nouveau sens. Bien que sa nouvelle signification ne soit pas totalement différente de celle d&#39;origine, elle décrit désormais un sous-genre RPG spécifique. </p> <h2 id=\"the-history-of-crpgs\"> L&#39;histoire des GPRC </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> L&#39;histoire des CRPG a commencé dans les années 1970 avec la sortie de la première adaptation de jeu vidéo du RPG de table Dungeons &amp; Dragons, Dungeon. Le jeu était à l&#39;origine disponible sur l&#39;Atari (vous pouvez y jouer via <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, un service de streaming de jeux sur Plex </a> ). </p> <p> Bien que le gameplay de Dungeon soit principalement basé sur du texte, il décrivait en détail les mouvements de votre groupe à plusieurs personnages dans un cadre fantastique tout en mettant en œuvre la plupart des principes de base de Dungeons &amp; Dragons. </p> <p> À l&#39;époque, nous les appelions RPG informatiques pour les distinguer de leurs homologues de table, qui étaient beaucoup plus populaires à l&#39;époque, et nous les connaissions simplement comme des RPG. </p> <p> Dans les années 1990, les CRPG étaient en pleine floraison, maintenant capables d&#39;afficher un monde fantastique dans son intégralité, au moins dans une perspective de haut en bas, ou une vue isométrique. Ce fut le cas pour Ultima VII, l&#39;un des CRPG les plus interactifs auxquels cet écrivain ait joué. </p> <p> Presque tout ce que vous pouvez voir, vous pouvez le déplacer ou interagir avec : vous pouvez fabriquer des armes, jouer des instruments et même transporter votre membre décédé d&#39;un donjon jusqu&#39;à la salle du trône du roi pour les faire ressusciter ! </p> <p> Baldur&#39;s Gate était l&#39;un de ceux qui ont le plus imité l&#39;expérience RPG sur table. Il a adapté l&#39;ensemble de règles de Dungeons &amp; Dragons 2nd Edition (AKA Advanced Dungeons &amp; Dragons) en un ensemble isométrique <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> GPRC en pause en temps réel </a> . Ces types de GPRC mettaient l&#39;accent sur les tactiques de combat, la progression du personnage, la prise de décision et encourageaient l&#39;exploration. </p> <p> </p> <p> Aujourd&#39;hui, dans un monde où les consoles dominent le marché, les jeux vidéo de rôle sont devenus plus populaires que les RPG de table. Dans la mesure où dans l&#39;usage moderne, l&#39;acronyme RPG fait plutôt référence à sa version jeu vidéo. Vous appelleriez Dungeon&#39;s &amp; Dragons un RPG de table, plutôt qu&#39;un simple RPG. </p> <p> Avec l&#39;évolution des graphismes, les mécanismes de jeu des CRPG se sont adaptés aux normes graphiques modernes. Les séries de GPRC comme The Elder Scrolls, Gothic ou The Witcher ont révolutionné le genre, introduisant de nouvelles mécaniques de jeu tout en abandonnant d&#39;autres. </p> <p> Ces RPG sont plus axés sur l&#39;action et au rythme rapide, se plaçant quelque peu, mais pas complètement, dans le sous-genre hack and slash (ce sont quand même des RPG solides !) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Une nouvelle vague de GPRC </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> Pourtant, à contre-courant de la tendance actuelle de l&#39;industrie du jeu vidéo à rechercher le réalisme graphique, une nouvelle vague de CRPG est apparue. Les RPG à l&#39;ancienne ou classiques influencent fortement ces jeux et mettent l&#39;accent sur les mécanismes de jeu et l&#39;immersion, plutôt que sur les visuels. </p> <p> Ce sont généralement des jeux isométriques, avec des batailles tactiques en temps réel ou au tour par tour. Ces GPRC font également de leur mieux pour être aussi immersifs que possible, vous offrant des blocs assez gros de prose bien conçue et une solide histoire. </p> <p> La plupart d&#39;entre eux s&#39;appuient sur le texte plutôt que sur la voix pour la plupart des dialogues, un peu comme les GPRC de la vieille école. Certains de ces GPRC incluent Pillars of Eternity, Divinity: Original Sin ou Pathfinder: Kingmaker. </p> <p> Ces jeux mettent également l&#39;accent sur les tactiques de combat, la progression des personnages, la prise de décision et encouragent l&#39;exploration, tout comme les GPRC à l&#39;ancienne. Pour ces raisons, nous les considérons comme plus étroitement liés aux RPG classiques qu&#39;à la plupart des RPG modernes. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> Ce que signifie GPRC en 2021 </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> Depuis les années 2000, RPG était devenu le terme standard pour désigner tout jeu vidéo de rôle. Mais vers 2015, ils ont sorti Divinity: Original Sin et Pillars of Eternity. </p> <p> Ces RPG s&#39;écartaient de l&#39;approche axée sur l&#39;action des RPG modernes, tout en étant très similaires aux titres plus anciens en termes d&#39;esthétique et de mécanique de jeu. C&#39;est à cette époque qu&#39;est apparu le besoin d&#39;un nouveau terme pour distinguer ces RPG des RPG modernes. </p> <p> Bien que les gens aient lancé les termes «old school» et «Classic RPG» en ligne pendant des années pour décrire ces jeux, ce dernier est celui qui est resté. Tout comme les jeux vidéo de rôle modernes ont revendiqué l&#39;acronyme RPG pour eux-mêmes, les gens appellent maintenant les RPG de la vieille école &quot;CRPG&quot;. </p>"}