{"title":"Roku veut votre avis sur sa télécommande rechargeable","content":"<p> Roku recrute des personnes pour rejoindre son programme d&#39;accès anticipé, afin de tester une nouvelle télécommande (appelée Roku Voice Remote Pro) dotée d&#39;une batterie rechargeable. </p> <p> C&#39;est une offre à durée limitée jusqu&#39;à épuisement des stocks, même si vous devez toujours payer pour la télécommande. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> Qu&#39;est-ce que la télécommande vocale Roku Pro ? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> Enfin une télécommande avec une batterie rechargeable </a> de <a href=\"https://www.reddit.com/r/Roku/\"> Roku </a> </blockquote>  <p> Comme repéré pour la première fois par l&#39;utilisateur Kingtut206 sur <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , Roku recrute des personnes pour son programme d&#39;accès anticipé afin de tester une nouvelle télécommande appelée Roku Voice Remote Pro. </p> <p> La nouvelle télécommande dispose d&#39;une batterie rechargeable, d&#39;une télécommande perdue (par exemple, vous pouvez dire &quot;Hey Roku, trouve ma télécommande&quot;), d&#39;une voix mains libres et de boutons de raccourci personnels à côté des boutons de marque standard. </p> <p> Tel que rapporté par <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> Le bord </a> , la télécommande se charge via micro-USB, plutôt que via l&#39;USB-C de loin supérieur. Peut-être que les commentaires recueillis dans le cadre du programme d&#39;accès anticipé le reconnaîtront. </p> <p> La participation au programme se fait uniquement sur invitation, bien qu&#39;on ne sache pas ce qui vous rend qualifié. </p> <p> La télécommande coûte 29,99 $ et devrait être expédiée le 19 février 2021. </p> <p> Seulement 2 000 unités seront vendues et Roku recueillera des commentaires sur votre expérience avec la télécommande. Passé ce délai, nous pouvons supposer que la télécommande sera affinée avant d&#39;être potentiellement mise en vente générale. </p>"}