{"title":"Spotify teste les paroles en direct aux États-Unis","content":"<p> Vous aimez chanter vos morceaux Spotify préférés, mais devez toujours rechercher les paroles pour vous assurer que votre karaoké est précis ? Tu es chanceux. Spotify teste maintenant sa fonction de paroles en direct pour certaines personnes aux États-Unis. </p> <h2 id=\"spotify-rolls-out-real-time-lyrics\"> Spotify déploie des paroles en temps réel </h2> <p> Si vous êtes aux États-Unis, vous verrez peut-être une nouvelle fonctionnalité Spotify qui vous permet d&#39;afficher les paroles en temps réel par rapport à la musique que vous écoutez. Les paroles sont fournies par la société de données musicales Musixmatch. </p> <p> &quot;Puissance&quot; est le mot clé ici, car il s&#39;agit encore d&#39;une phase de test. Cela signifie que seul un groupe d&#39;utilisateurs verra la fonctionnalité pendant que Spotify mesure son impact. On ne sait pas combien d&#39;utilisateurs composent le groupe de test. </p> <p> Les paroles sont une fonctionnalité demandée depuis longtemps pour Spotify, il serait donc surprenant que la fonctionnalité ne soit finalement pas déployée pour tout le monde, mais rien n&#39;est sûr. </p> <p> Dans un e-mail à <a href=\"https://www.engadget.com/spotify-live-lyrics-united-states-test-ios-android-140045159.html\" target=\"_blank\" rel=\"nofollow noopener\"> Engagé </a> , un porte-parole de Spotify a déclaré : </p> <blockquote> <p> Nous pouvons confirmer que nous testons actuellement notre fonction de paroles auprès d&#39;un certain nombre d&#39;utilisateurs aux États-Unis. Chez Spotify, nous effectuons régulièrement un certain nombre de tests dans le but d&#39;améliorer notre expérience utilisateur. Certains de ces tests finissent par ouvrir la voie à notre expérience utilisateur plus large et d&#39;autres ne servent qu&#39;à un apprentissage important. Nous n&#39;avons pas d&#39;autres nouvelles à partager pour le moment. </p> </blockquote> <p> </p> <h2 id=\"are-lyrics-new-for-spotify\"> Les paroles sont-elles nouvelles pour Spotify ? </h2> <p> À proprement parler, les paroles en temps réel ne sont pas une nouveauté. C&#39;est parce qu&#39;il est disponible dans des pays comme le Brésil, le Mexique, l&#39;Inde et Singapour depuis juin 2020. </p> <p> En fait, bien avant cela, Spotify avait une fonction de paroles en direct dans le monde entier. Cela est également le résultat d&#39;un partenariat avec Musixmatch, bien que la fonctionnalité ait été supprimée sans ménagement lorsque l&#39;accord entre les deux sociétés a pris fin. </p> <p> Spotify l&#39;a ensuite remplacé par une intégration avec Genius, dans une fonctionnalité intitulée &quot;Behind the Lyrics&quot;, qui affiche des informations et des faits amusants sur certaines chansons. C&#39;est également quelque chose qui est disponible sur Apple Music, qui lui-même prend également en charge les paroles en direct. </p> <p> Engadget rapporte que &quot;Behind the Lyrics&quot; sera supprimé de Spotify si la fonction de paroles en direct se déploie plus largement. Il ne manquera probablement pas à beaucoup. </p> <p> Pour les personnes dans les régions qui n&#39;ont pas encore de paroles en direct, il y a la possibilité de <a href=\"https://www.makeuseof.com/tag/lyrics-currently-playing-songs-spotify/\" target=\"_blank\" rel=\"nofollow noopener\"> utiliser d&#39;autres applications pour afficher les paroles dans Spotify </a> . </p> <p> Bien sûr, vous pouvez également utiliser l&#39;un des nombreux sites Web de paroles sur Internet, bien que ceux-ci ne s&#39;affichent pas à temps pour votre musique Spotify. </p>"}