{"title":"Twitter pour étiqueter les comptes personnels des représentants du gouvernement","content":"<p> Twitter va bientôt commencer à apposer des étiquettes sur les comptes personnels des fonctionnaires. Les étiquettes sont censées aider les utilisateurs à identifier facilement toute personne associée au gouvernement. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Davantage de fonctionnaires obtiendront un label sur Twitter </h2> <p> D&#39;après un article sur <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> le blog Twitter </a> , la plateforme commencera à étiqueter les comptes personnels des « chefs d&#39;État » le 17 février 2021. Elle apposera également des étiquettes sur les comptes associés aux médias affiliés à l&#39;État. </p> <p> Twitter étend également la portée de ses étiquettes pour couvrir les responsables gouvernementaux dans davantage de pays. Ces emplacements comprennent le Canada, Cuba, l&#39;Équateur, l&#39;Égypte, l&#39;Allemagne, le Honduras, l&#39;Indonésie, l&#39;Iran, l&#39;Italie, le Japon, l&#39;Arabie saoudite, la Serbie, l&#39;Espagne, la Thaïlande, la Turquie et les Émirats arabes unis. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Crédit d&#39;image: Twitter </p> <p> La plateforme espère que ces labels aideront les utilisateurs à &quot;avoir une expérience plus informée sur Twitter&quot;, et prévoit également de peaufiner le texte du label pour &quot;ajouter plus de spécificité&quot; en &quot;différenciant les individus et les institutions&quot;. </p> <p> La première vague d&#39;étiquettes de Twitter pour les comptes affiliés au gouvernement a été lancée en août 2020. Initialement, ces étiquettes ne s&#39;appliquaient qu&#39;aux responsables associés aux cinq pays du Conseil de sécurité des Nations Unies et n&#39;incluaient pas les comptes personnels de ces responsables. </p> <p> Cela dit, ces étiquettes ne sont pas un <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> coup flagrant à la désinformation </a> , mais ils aideront toujours les utilisateurs à obtenir plus de contexte sur ce qu&#39;ils lisent et de qui cela vient. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter ne fera que continuer à étendre ses étiquettes </h2> <p> À la fin de son article de blog, Twitter a indiqué qu&#39;il espérait étendre ses étiquettes à &quot;d&#39;autres pays au fil du temps&quot;. L&#39;étiquette apparaît comme un drapeau gris pâle sur le profil Twitter d&#39;une personne, et il est probable que vous la rencontrerez plus souvent dans les semaines à venir. </p>"}