{"title":"Une énorme mise à jour de Microsoft Edge se prépare","content":"<p> Microsoft travaille très dur pour faire de son navigateur Internet, Edge, le meilleur possible. Maintenant, la société lui apporte trois fonctionnalités importantes, et les choses s&#39;annoncent prometteuses pour l&#39;avenir d&#39;Edge. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Ce que Microsoft a prévu pour Edge </h2> <p> La grande mise à jour du pare-chocs a été attrapée par <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows le plus récent </a> . Les trois fonctionnalités sont prévues pour une grande mise à jour, il vaut donc la peine de garder un œil sur Edge dans un avenir proche. </p> <p> Tout d&#39;abord, Microsoft Edge prend en charge les widgets Web. Ces widgets sont un moyen pratique d&#39;avoir un aperçu rapide des informations vitales tout au long de la journée. Le géant du logiciel veut expérimenter des widgets de toutes formes et tailles, mais il a décidé de commencer avec un widget d&#39;actualités pour lancer les choses. </p> <p> Ensuite, Microsoft Edge obtient une fonction de recherche par onglet. Si cela vous semble familier, c&#39;est probablement parce que vous avez lu le <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> spéculation initiale d&#39;Edge obtenant un outil de recherche d&#39;onglets </a> . Heureusement, cette spéculation est devenue une réalité et Microsoft prévoit d&#39;intégrer la fonctionnalité Chrome dans Edge. </p> <p> Enfin, vous pourrez gérer toutes vos extensions Edge à partir d&#39;un seul menu. Il apparaîtra comme une pièce de puzzle dans la barre des tâches de votre navigateur, et lorsque vous cliquez dessus, il vous montrera chaque extension que vous avez installée ainsi qu&#39;un moyen rapide d&#39;activer et de désactiver chacune d&#39;elles. </p> <p> On ne sait pas exactement quand cette mise à jour sera publiée, mais Windows Latest l&#39;a épinglée pour &quot;la prochaine grande mise à jour&quot;. En tant que tel, il ne faudra pas longtemps avant que Microsoft Edge devienne un choix attrayant pour les personnes à la recherche de quelque chose de nouveau. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge : la prochaine grande chose ? </h2> <p> Pendant très longtemps, les navigateurs de Microsoft ont été considérés comme des gestionnaires de téléchargement avancés pour installer Chrome ou Firefox. Depuis que Microsoft a adopté une base de code Chromium pour son navigateur, cependant, il est devenu la risée du monde des navigateurs. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> Compteur de statistiques </a> répertorie Microsoft Edge comme le deuxième navigateur Windows le plus utilisé aux États-Unis au moment de la rédaction. Nous savions déjà que Firefox était laissé dans la poussière par Edge, mais depuis lors, l&#39;écart n&#39;a fait que se creuser. </p> <p> Désormais, Edge représente 5,25 % de la part de marché aux États-Unis, contre 3,35 % que possède Firefox. Les deux sont loin des 45,83 % de Chrome, mais c&#39;est un début. </p> <p> En tant que tel, si vous avez déjà tourné le nez sur le navigateur de Microsoft, c&#39;est le bon moment pour lui donner une seconde chance. Qui sait, vous serez peut-être conquis par le meilleur navigateur de Microsoft ! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Pousser le navigateur vers le bord </h2> <p> Si vous n&#39;avez pas été un fan des navigateurs de Microsoft dans le passé, c&#39;est le bon moment pour entrer et voir de quoi il s&#39;agit. Une grosse mise à jour est en cours, et cela ne fera que s&#39;améliorer à partir d&#39;ici. </p> <p> Microsoft sait que c&#39;est sur une formule gagnante. En fait, la société a récemment signalé que 600 millions de personnes dans le monde utilisaient désormais Edge pour naviguer sur le Web. </p> <p> <small> Crédit d&#39;image : DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}