{"title":"Une nouvelle étude indique que les utilisateurs d&#39;Android sont de meilleurs partenaires que les utilisateurs d&#39;iPhone","content":"<p> Une bataille sans fin fait rage entre les utilisateurs d&#39;iPhone et de smartphones Android. Même ceux qui ne participent pas à la bataille n&#39;ont choisi leur camp qu&#39;en choisissant leur smartphone. </p> <p> Il y a une nouvelle ride dans la bataille, comme <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> ComparezMyMobile </a> a réalisé une étude récente pour savoir si les utilisateurs d&#39;iPhone ou d&#39;Android font de meilleurs partenaires de relations. En fin de compte, les utilisateurs d&#39;iPhone ont tendance à avoir des habitudes téléphoniques plus ennuyeuses que les utilisateurs d&#39;Android, ce qui conduit à la conclusion que les utilisateurs d&#39;Android sont de meilleurs partenaires. </p> <p> Bien sûr, les données ne se limitent pas à cette simple conclusion, alors approfondissons un peu et examinons. </p> <h2 id=\"iphone-and-android-relationship-study\"> Étude des relations iPhone et Android </h2> <p> La conclusion générale de l&#39;étude est que les utilisateurs d&#39;Android sont de meilleurs partenaires que les utilisateurs d&#39;iPhone, mais les résultats vont beaucoup plus loin que cette conclusion superficielle. Au total, l&#39;étude a interrogé plus de 2 000 utilisateurs, elle offre donc un échantillon de taille raisonnablement grande. </p> <p> En examinant les habitudes de smartphone les plus ennuyeuses, l&#39;étude a révélé que les utilisateurs d&#39;iPhone étaient 12% plus susceptibles de commettre une infraction que leurs homologues possédant Android. En fait, les utilisateurs d&#39;iPhone ont commis plus d&#39;atrocités liées à l&#39;utilisation du téléphone que les utilisateurs d&#39;Android dans chaque catégorie de l&#39;enquête. </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> Certains exemples d&#39;infractions ennuyeuses incluent le fait de laisser son partenaire en lecture, d&#39;utiliser son téléphone pendant un film et même d&#39;utiliser son téléphone en conduisant (ce qui est non seulement ennuyeux mais aussi incroyablement dangereux). Les utilisateurs d&#39;iPhone sont encore plus susceptibles de laisser tomber et de casser leurs téléphones que les utilisateurs d&#39;Android, ce qui est une statistique vraiment surprenante. </p> <p> Certaines autres habitudes ennuyeuses incluent <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> ramper sur les profils de médias sociaux d&#39;autres personnes </a> , en utilisant des filtres excessifs sur les photos, en envoyant plusieurs messages d&#39;une seule ligne (je sais que je le fais trop souvent) et en utilisant leur téléphone pendant une conversation. </p> <p> Fait intéressant, l&#39;étude a également révélé que les hommes étaient plus susceptibles d&#39;adopter la plupart des habitudes ennuyeuses (et dans certains cas carrément dangereuses) que les femmes. </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> Mais les utilisateurs Apple obtiennent plus de dates </h2> <p> Selon une autre étude publiée par CompareMyMobile, les utilisateurs d&#39;iPhone sont plus susceptibles d&#39;obtenir des dates dans les applications de rencontres en ligne. L&#39;étude, qui a examiné plus de 50 000 balayages, a révélé que les utilisateurs d&#39;iPhone sont 76% plus susceptibles d&#39;avoir un rendez-vous que quelqu&#39;un avec un combiné Android lorsqu&#39;ils parlent via une application de rencontres. </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> Si l&#39;on en croit la première étude, la relation pourrait ne pas fonctionner en raison du fait que l&#39;utilisateur d&#39;iPhone se glisse sur d&#39;autres profils de médias sociaux et envoie des SMS en conduisant. Pourtant, ils sont plus susceptibles de trouver leur prochain partenaire lorsque la relation précédente ne fonctionne pas. </p> <p> En fin de compte, la datation n&#39;est jamais facile. Alors faites de votre mieux pour éviter que votre téléphone ne devienne l&#39;appareil qui tue une bonne chose ! </p>"}