{"title":"VW affirme qu&#39;Apple n&#39;aura pas une conduite facile dans l&#39;industrie automobile","content":"<p> Herbert Diess, PDG du groupe Volkswagen, a minimisé tout impact potentiel d&#39;une Apple Car sur l&#39;industrie automobile, affirmant que VW n&#39;a &quot;pas peur&quot; du projet Titan. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW &quot;Pas peur&quot; d&#39;une voiture Apple </h2> <p> Bien que Diess reconnaisse qu&#39;une automobile de marque Apple puisse en effet avoir un sens, il ne pense pas qu&#39;Apple puisse dominer le paysage de la construction automobile &quot;du jour au lendemain&quot; en raison d&#39;une concurrence intense. Couper de l&#39;acier et vendre des voitures à des consommateurs difficiles est une entreprise difficile, a-t-il laissé entendre, ajoutant qu&#39;il ne s&#39;agit pas d&#39;un domaine dans lequel une entreprise peut simplement &quot;prendre le contrôle d&#39;un seul coup&quot;. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> relaie ce que Diess a dit à la Frankfurter Allgemeine Sonntagszeitung dans une interview : </p> <blockquote> <p> L&#39;industrie automobile n&#39;est pas un secteur technologique typique que vous pourriez prendre en charge d&#39;un seul coup. Apple n&#39;y arrivera pas du jour au lendemain. Pourtant, nous n&#39;avons pas peur. </p> </blockquote> <p> Néanmoins, un véhicule de marque Apple aurait du sens compte tenu des compétences d&#39;Apple en matière de batteries, de logiciels, de design industriel et de ses ressources apparemment infinies, a ajouté le dirigeant. Apple ne propose aucun produit lié à l&#39;automobile en dehors de la <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Logiciel de tableau de bord CarPlay </a> qui permet à un autoradio ou à une unité principale d&#39;agir comme un écran et un contrôleur pour un iPhone. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> Le secret le moins bien gardé de l&#39;industrie </h2> <p> Les plans du projet Titan (le nom de code interne d&#39;une voiture Apple) ne sont toujours pas publics malgré une vague de rumeurs récentes disant <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple cherchait à s&#39;associer à Hyundai/Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple aurait parlé à d&#39;autres constructeurs automobiles </a> et les fabricants sous contrat --- y compris Magna, Nissan et Foxconn --- sur la construction de son véhicule à conduite autonome. Des sources affirment qu&#39;une Apple Car peut ne pas avoir de volant, car elle peut initialement <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> se concentrer sur la livraison de nourriture et les opérations de robotaxi </a> avant d&#39;être vendu aux consommateurs. </p> <p> </p> <p> Le plus gros point à retenir du commentaire d&#39;Herbert serait que l&#39;industrie automobile a prêté une attention particulière au projet Titan. De toute évidence, l&#39;idée même qu&#39;Apple entre dans ce secteur rend certains des cadres supérieurs nerveux. Cela dit, l&#39;histoire est pleine de gens qui auraient dû savoir mieux que ridiculiser Apple pour entrer dans une nouvelle catégorie de produits. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Comment le PDG de Palm s&#39;est moqué de l&#39;iPhone </h2> <p> Le meilleur exemple en est l&#39;ancien PDG de Palm, Ed Colligan. Quelques semaines seulement avant l&#39;introduction originale de l&#39;iPhone en 2007, Colligan s&#39;est moqué de l&#39;idée qu&#39;une entreprise connue pour concevoir de jolis ordinateurs pourrait gagner des clients dans le secteur concurrentiel des smartphones, en déclarant : </p> <blockquote> <p> Nous avons appris et lutté pendant quelques années ici pour trouver comment fabriquer un téléphone décent. Les gars de PC ne vont pas seulement comprendre cela. Ils ne vont pas simplement entrer. </p> </blockquote> <p> Semblable à la façon dont Colligan a décrit Apple comme des « gars de PC », le patron de Volkswagen essaie de minimiser l&#39;idée qu&#39;une entreprise technologique pourrait gagner des clients dans le secteur de la construction automobile. L&#39;histoire montrera si le commentaire d&#39;Herbert vieillira mieux que celui de Colligan. </p>"}