{"title":"Vous pourriez obtenir le nouveau Microsoft Teams Pro gratuitement","content":"<p> Il y a quelque temps, nous avons couvert un service d&#39;abonnement prévu pour Microsoft Teams appelé &quot;Teams Pro&quot;, qui débloquera des fonctionnalités supplémentaires pour le logiciel. Cependant, Microsoft a ensuite déclaré officiellement que certaines personnes obtiendraient Teams Pro sans frais supplémentaires par rapport à leurs plans actuels. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Déclaration de Microsoft sur les abonnements gratuits à Teams Pro </h2> <p> Au cas où vous auriez besoin d&#39;un rappel, nous avons déjà abordé ce sujet dans notre article sur <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro ajoutant des webinaires au service </a> . </p> <p> Maintenant, un article de <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> sur le même sujet a depuis reçu une déclaration de Microsoft. La déclaration est une bonne nouvelle pour les personnes qui craignent de payer un supplément pour les webinaires : </p> <blockquote> <p> Le 9 février, nous avons publié un article MC concernant un nouveau plan de service Teams Pro. Pour clarifier, il n&#39;y a aucun changement aux licences de produits existantes avec l&#39;ajout de ce nouveau plan de service. Au lieu de cela, le plan de service sera ajouté automatiquement aux licences Microsoft 365 et Office 365 E5/E3/A5/A3, et Microsoft 365 Business Standard/Business Premium, et permettra aux utilisateurs disposant d&#39;une licence pour ces SKU de recevoir automatiquement les fonctionnalités déployées Les équipes dans un futur proche. </p> </blockquote> <p> Microsoft poursuit en déclarant que les administrateurs n&#39;ont rien à faire pour activer ces nouvelles fonctionnalités. De plus, toute personne disposant d&#39;une licence compatible, comme indiqué ci-dessus, bénéficiera de ces nouvelles fonctionnalités sans frais supplémentaires. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Obtenir plus pour la même chose avec Microsoft Teams </h2> <p> Microsoft déploie un nouveau plan d&#39;abonnement Teams Pro qui déverrouille des webinaires et plus encore, mais tout le monde n&#39;aura pas à payer un supplément pour cela. Si vous êtes abonné à l&#39;une des licences ci-dessus, vous pouvez vous attendre à obtenir toutes les fonctionnalités de Teams Pro pour rien de plus. </p> <p> Cela ne veut pas dire que les personnes sans Teams Pro seront laissées dans l&#39;ombre. Par exemple, tout le monde aura bientôt accès à une fonctionnalité de récapitulation pratique dans Microsoft Teams. </p> <p> <small> Crédit d&#39;image : Studio postmoderne/ <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}