{"title":"Volkswagen utilisera Microsoft Azure dans les voitures autonomes","content":"<p> Microsoft souhaite se lancer sur le marché des voitures autonomes, mais il n&#39;a aucune expertise dans la conception et la construction d&#39;une voiture. Cependant, il peut fournir le cerveau derrière une voiture intelligente, et Volkswagen est intéressé à utiliser les services de Microsoft pour ses propres véhicules. </p> <h2 id=\"microsoft-and-volkswagen-s-partnership-for-automatic-cars\"> Partenariat entre Microsoft et Volkswagen pour les voitures automatiques </h2> <p> La nouvelle de ce partenariat a éclaté le <a href=\"https://www.reuters.com/article/us-microsoft-volkswagen/volkswagen-taps-microsofts-cloud-to-develop-self-driving-software-idUSKBN2AB0SZ\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> . Volkswagen fait appel à Microsoft pour l&#39;aider à percer dans le monde des voitures autonomes. </p> <p> Volkswagen possède en fait quelques constructeurs automobiles différents, comme Audi, Porshe et Lamborghini. Le problème était que les ingénieurs de chaque entreprise suivaient leur propre chemin vers la conception d&#39;une voiture autonome au lieu de partager des informations entre eux. </p> <p> Pour résoudre ce problème, Volkswagen a réuni tous ses ingénieurs de voitures autonomes dans un grand groupe, appelé Car.Software. L&#39;idée était que le groupe puisse s&#39;unir et créer une plate-forme de voiture intelligente unique que Volkswagen pourrait utiliser pour toutes ses voitures. </p> <p> Cependant, il s&#39;est avéré que différents ingénieurs de Car.Software utilisaient toujours différentes plates-formes pour développer leur code. En tant que tel, Volkswagen s&#39;est tourné vers Microsoft pour aider à donner à chacun une plate-forme de base pour travailler. </p> <p> Cela ne signifie pas que les voitures de Volkswagen fonctionnent sous Windows 10. Microsoft dispose d&#39;une autre plate-forme appelée Azure, conçue pour connecter les appareils Internet des objets (IoT). </p> <p> Si cela vous semble familier, c&#39;est parce que c&#39;est le même service qui <a href=\"https://www.makeuseof.com/microsoft-powered-self-driving-car/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft a proposé à Cruise pour ses voitures autonomes </a> . Maintenant, il est clair que l&#39;accord Cruise n&#39;était pas un accord unique ; Microsoft souhaite sérieusement faire fonctionner les voitures sur Azure. </p> <p> Compte tenu des performances d&#39;Azure pour Microsoft, il n&#39;est pas surprenant que le géant du logiciel veuille frapper pendant que le fer est chaud. La combinaison des services Azure et Xbox de Microsoft a <a href=\"https://www.makeuseof.com/microsoft-reveals-record-profits/\" target=\"_blank\" rel=\"nofollow noopener\"> a fait gagner à l&#39;entreprise un bénéfice net pendant la pandémie </a> . </p> <p> En tant que tel, il y a une énorme incitation à mettre Azure sur les voitures autonomes pour lui donner une présence encore plus grande dans le monde des appareils intelligents. Quant à savoir si Azure deviendra ou non un acteur majeur dans le monde des voitures intelligentes, cela reste à voir. </p> <p> </p> <h2 id=\"starting-the-engine-for-microsoft-azure\"> Démarrage du moteur pour Microsoft Azure </h2> <p> Microsoft Azure est déjà un énorme générateur d&#39;argent pour le géant de la technologie, ce qui signifie que l&#39;entreprise est parfaitement placée pour se lancer dans de nouveaux territoires. Les voitures autonomes de Cruise et de Volkswagen utiliseront Microsoft Azure comme base, qui peut potentiellement devenir un acteur important dans l&#39;avenir de l&#39;automobile. </p> <p> Dans un étrange coup du sort, la vieille rivalité entre Microsoft et Apple se répand dans le monde des voitures intelligentes. Au lieu de ne fournir aux constructeurs automobiles que la partie &quot;intelligente&quot;, Apple entend produire des &quot;Apple Cars&quot; complètes d&#39;ici 2024. </p> <p> <small> Crédit d&#39;image : Andrey Suslov / <a href=\"https://www.shutterstock.com/image-vector/autonomous-smart-car-scans-road-operates-635238704\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}