{"title":"Vous allez bientôt jouer à des jeux avec les personnages MetaHuman d&#39;Epic","content":"<p> Si vous pensez que les jeux semblent réalistes maintenant, attendez de comprendre ce que Epic Games a en préparation avec son Unreal Engine. Préparez-vous à être époustouflé. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games dévoile de nouveaux MetaHumans </h2> <p> Vous vous demandez probablement de quelle terre nous parlons. MetaHuman Creator est la dernière fonctionnalité qu&#39;Epic Games a ajoutée à Unreal Engine ; un environnement de développement logiciel que les développeurs de jeux peuvent utiliser pour créer leurs titres. </p> <p> Selon un <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Article de blog Unreal Engine </a> annonçant le nouvel outil de développement passionnant : </p> <blockquote> <p> MetaHuman Creator est une application en streaming conçue pour faire passer la création humaine numérique en temps réel de quelques semaines ou mois à moins d&#39;une heure, sans compromettre la qualité. </p> </blockquote> <p> C&#39;est donc essentiellement un moyen pour le développeur de jeux de créer des fac-similés humains incroyablement réalistes. Vite. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> Que signifie MetaHuman Creator pour les développeurs ? </h2> <p> </p> <p> Les implications que cela a pour le développement de logiciels changent la donne (jeu de mots). Imaginez à quelle vitesse les développeurs rempliront leurs mondes de jeu avec des PNJ, en utilisant MetaHuman Creator. Non seulement cela, mais les humains numériques sont également incroyables. </p> <p> Cela signifie aussi évidemment que les développeurs peuvent terminer les titres plus rapidement, vous n&#39;avez donc pas à attendre d&#39;innombrables retards. MetaHuman Creator permet aux développeurs de construire rapidement leur population de PNJ, laissant du temps pour d&#39;autres questions plus urgentes. </p> <p> Mais pourquoi avoir besoin de cet outil ? Epic Games explique : </p> <blockquote> <p> Créer un humain numérique de haute qualité est difficile et prend du temps. Mettre à l&#39;échelle cet effort pour créer de nombreux humains numériques diversifiés de la qualité requise par les plates-formes de nouvelle génération et la production virtuelle haut de gamme est en effet une tâche formidable. </p> </blockquote> <p> Donc, comme nous l&#39;avons dit; l&#39;outil fait gagner du temps et améliore le flux de travail, permettant aux développeurs de donner aux consoles de nouvelle génération les jeux qu&#39;elles méritent. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> Comment MetaHuman Creator affectera-t-il les jeux ? </h2> <p> Eh bien, grâce à MetaHuman Creator, les jeux pourraient être publiés beaucoup plus rapidement, pour commencer. Avec des outils puissants comme celui-ci à leur disposition, les développeurs pourraient affiner les mécanismes de jeu ou passer plus de temps à corriger les bugs avant de sortir un jeu cassé... </p> <p> Quoi qu&#39;il en soit, l&#39;amertume mise à part, l&#39;outil de développement d&#39;Epic semble être quelque chose qui améliorera également l&#39;apparence des jeux. Il suffit de regarder les rendus pour voir à quel point les humains numériques sont à couper le souffle. Quand nous les voyons dans les jeux, cependant, c&#39;est quand la vraie magie se produira. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> Quand verrons-nous MetaHumans dans les jeux ? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> C&#39;est difficile à dire. Actuellement, Epic a fixé le logiciel Creator pour des tests d&#39;accès anticipé dans les &quot;prochains mois&quot;. Vous ne verrez donc pas de MetaHumans de si tôt. </p> <p> Si vous avez envie de créer votre propre humain numérique, vous devez attendre si vous souhaitez utiliser MetaHuman Creator d&#39;Unreal Engine. Vous pouvez toujours essayer d&#39;en assembler un dans un autre programme, mais cela ne prendra certainement pas moins d&#39;une heure ! </p>"}