{"title":"10 Hal yang Tidak Anda Ketahui Dapat Dilakukan oleh Google Documents","content":"<p> Google Doc mungkin tampak dasar di permukaan tetapi alat produktivitas cloud memiliki banyak fitur yang diabaikan yang dapat membantu Anda melakukan lebih banyak hal di tempat kerja. </p> <p> Dalam artikel ini, kita akan melihat beberapa fitur Google Dokumen yang mungkin belum Anda ketahui, dan bagaimana Anda dapat menggunakannya untuk menghemat waktu dalam membuat konten. </p> <p> Harap perhatikan bahwa fitur ini sebagian besar dapat diakses pada versi desktop alat Google Documents. Yang juga dapat digunakan pada versi seluler akan ditunjukkan. </p> <h2 id=\"voice-typing\"> 1. Pengetikan Suara </h2> <p> Untuk menggunakan fitur pengetikan suara, buka dokumen dan klik <strong> Alat </strong> dari bilah menu di bagian atas halaman. Pilih <strong> Pengetikan Suara </strong> dari drop-down. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> Sebuah mikrofon akan muncul di layar Anda, dengan menu bahasa di mana Anda dapat memilih bahasa bicara pilihan Anda. Saat Anda siap mengucapkan teks, klik mikrofon atau tekan <strong> Cmd + Shift + S </strong> (jika Anda menggunakan Mac) atau <strong> Ctrl + Shift + S </strong> (jika Anda menggunakan PC Windows) untuk mulai merekam. </p> <p> Untuk menambahkan tanda baca di antara teks, ucapkan nama tanda baca yang ingin Anda tambahkan, seperti &#39;titik&#39;, &#39;koma&#39;, atau &#39;tanda tanya&#39;. Anda dapat memberikan instruksi pemformatan seperti &#39;baris baru&#39; atau &#39;paragraf baru&#39;, atau &#39;berhenti mendengarkan&#39; jika Anda ingin beristirahat dari dikte, dan &#39;melanjutkan&#39; saat Anda siap untuk melanjutkan. </p> <p> Cari perintah pengeditan lanjutan dari ini <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> daftar perintah </a> di Halaman Dukungan Google. </p> <p> Anda juga dapat menggunakan fitur ini untuk menyalin audio apa pun. Cukup putar audio (dari ponsel Anda atau perangkat lain) ke suara-ke-teks, dan itu akan mengetikkannya untuk Anda. Anda mungkin harus melakukan beberapa pengeditan, tetapi Anda akan menghemat banyak waktu. </p> <p> </p> <p> Fitur pengetikan suara hanya tersedia di desktop tetapi hanya berfungsi di browser Chrome. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Pengeditan Offline </h2> <p> Banyak orang menyukai Google Docs karena fitur save-to-cloudnya yang instan, tetapi bisa merepotkan jika Anda tidak memiliki akses ke internet untuk sementara waktu. Kabar baiknya adalah Anda masih dapat mengakses dan mengedit file Anda secara offline. </p> <p> Fitur ini hanya tersedia di Google Chrome, dan Anda perlu menginstal dan mengaktifkan <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Ekstensi Chrome Offline Google Documents </a> . Juga, pastikan Anda tidak menjelajah dalam mode pribadi. </p> <p> Fitur ini perlu diterapkan saat Anda online, tetapi setelah selesai, Anda dapat menulis dan mengedit teks secara offline, dan kemudian akan disimpan ke cloud saat Anda mendapatkan akses ke internet. Begini caranya. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> Untuk memungkinkan <strong> buka dan simpan file Google Documents secara offline </strong> , ikuti <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> petunjuk ini </a> . Fitur ini tersedia di PC, iOS, dan Android. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Lacak/Pulihkan Riwayat Versi Dokumen </h2> <p> Jika Anda mengerjakan dokumen sendiri atau bersama orang lain, Anda dapat melacak perubahan pada dokumen menggunakan fitur Riwayat Versi. </p> <p> Anda juga dapat memulihkan dokumen ke versi sebelumnya untuk sementara atau permanen; fitur yang dapat menjadi penyelamat jika Anda secara tidak sengaja menghapus bagian dari dokumen Anda dan tidak dapat menggunakan use <strong> Membuka </strong> tombol untuk memulihkannya. </p> <p> Untuk menggunakan fitur riwayat versi, klik <strong> Mengajukan </strong> dari bilah menu, dan pilih <strong> Riwayat Versi </strong> dari drop-down. Anda akan melihat bahwa Anda juga dapat memberi nama versi, sehingga Anda dapat menggunakannya untuk melacak perubahan berkelanjutan dalam dokumen, terutama jika pengguna lain mengedit dokumen yang sama. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Fitur ini hanya tersedia di desktop. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Mode Saran dan Tinjau </h2> <p> Meskipun sangat bagus untuk berkolaborasi dengan orang lain dan mengedit dokumen bersama, mungkin sulit (dan berantakan) untuk melacak perubahan yang telah dibuat setiap orang. </p> <p> Fitur Menyarankan memungkinkan Anda untuk hanya menyarankan pengeditan jika Anda tidak ingin mengubah dokumen sama sekali. Saran Anda akan muncul ke editor sebagai komentar di bilah sisi, dan editor dapat membuat perubahan instan dengan menerima saran tersebut. Anda juga dapat melanjutkan utas percakapan dengan <strong> Balasan </strong> , sehingga Anda dapat memberi dan menerima umpan balik langsung di halaman dokumen tanpa harus bolak-balik mengirim email. </p> <p> Untuk menyarankan pengeditan, klik ikon pensil untuk mode Pengeditan di pojok kanan atas dokumen yang terbuka, lalu pilih <strong> Menyarankan </strong> . </p> <p> Untuk melihat dokumen tanpa saran, klik <strong> Melihat </strong> . Anda akan dapat membaca tanpa coretan dan pop-up komentar. </p> <p> Untuk menghemat waktu, Anda dapat menerima atau menolak semua saran sekaligus. Klik <strong> Alat </strong> , lalu pilih <strong> Tinjau hasil edit yang disarankan </strong> . Klik <strong> Terima semua </strong> atau <strong> Tolak semua </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Fitur ini hanya tersedia di desktop. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Tambahkan Font </h2> <p> Jika Anda ingin <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> menyesuaikan gaya teks Anda </a> agar sesuai dengan pesan Anda, Anda juga dapat melakukannya dengan Google Documents. Terlepas dari 24 font default yang sudah diprogram ke dalam alat Google Documents, Anda dapat menambahkan beberapa font keren pilihan Anda untuk meningkatkan teks Anda secara visual. </p> <p> Untuk menambahkan font, cukup klik pada <strong> font </strong> pada bilah menu dan pilih <strong> Lebih Banyak Font </strong> . Pilih font sebanyak yang Anda inginkan dari koleksi yang disediakan. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Fitur ini hanya tersedia di desktop. </p> <p> </p> <h2 id=\"compare-documents\"> 6. Bandingkan Dokumen </h2> <p> Ini adalah fitur lain yang dapat Anda gunakan untuk melacak perubahan yang dibuat pada dokumen oleh Anda sendiri atau kolaborator. Ini sangat berguna untuk dokumen besar, dan seperti namanya, Anda dapat membandingkan dua dokumen untuk melihat perbedaan di antara keduanya. </p> <p> Untuk menggunakan fitur ini, buka dokumen dasar yang ingin Anda jadikan perbandingan, lalu klik tombol <strong> Alat </strong> dan pilih <strong> Bandingkan Dokumen </strong> . </p> <p> Di kotak dialog yang muncul, pilih dokumen yang ingin Anda bandingkan dari Drive Anda, dan klik <strong> Membandingkan </strong> . Dalam <strong> Menghubungkan perbedaan ke </strong> bidang, masukkan nama kolaborator yang akan menjadi penulis dari suntingan yang disarankan dalam dokumen akhir. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> Perbedaan akan menunjukkan cara yang sama seperti yang mereka lakukan di <strong> Menyarankan </strong> mode yang kami bahas di atas, dan Anda juga dapat menerima atau menolak pengeditan. </p> <p> Fitur ini hanya tersedia di desktop. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Temukan dan Ganti </h2> <p> Jika Anda perlu mengganti beberapa contoh kesalahan dalam teks Anda, Google Documents mempermudah melakukannya dengan fitur Temukan dan Ganti. </p> <p> Untuk pengguna yang akrab dengan fitur Temukan dan Ganti di Microsoft Word, ini berfungsi sama. </p> <p> Untuk menemukan kata atau frasa tertentu di dokumen Anda, gunakan pintasan <strong> Ctrl + F </strong> pada PC Windows atau <strong> Perintah + F </strong> di Mac. Masukkan kata di bidang &quot;Temukan di dokumen&quot;. </p> <p> Untuk mengganti teks yang ditemukan, klik pada tiga titik di sisi kanan dan pilih <strong> Temukan dan ganti </strong> . </p> <p> Kemudian, masukkan teks di <strong> Temukan </strong> bidang, dan teks pengganti di <strong> Ubah dengan </strong> bidang. Gulir melalui contoh teks dengan kursor atas dan bawah, dan klik <strong> Menggantikan </strong> untuk menukarnya satu per satu. Atau klik <strong> Menggantikan semua </strong> untuk mengganti semua teks yang dipilih sekaligus. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Gunakan Kamus </h2> <p> Untuk membantu Anda berkonsentrasi dan menghindari keharusan beralih di antara tab saat Anda mencari arti kata, Google Documents memiliki kamus dalam aplikasi. </p> <p> Saat Anda mengetik dan perlu mencari kata, sorot kata tersebut, lalu klik kanan dan pilih <strong> Menetapkan </strong> dari menu. Alat Kamus akan mencari definisi kata di internet, dan itu akan muncul di sisi kanan layar Anda. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Tambahkan Aksen Bahasa </h2> <p> Ucapkan selamat tinggal untuk menghafal pintasan keyboard beraksen, atau salin/tempel huruf beraksen dari dokumen lain. </p> <p> Untuk menggunakan huruf beraksen, Anda harus mengunduh <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> add-on &quot;Aksen Mudah&quot; </a> . Ini memungkinkan Anda menyisipkan aksen untuk 20 bahasa berbeda langsung dari bilah sisi di dokumen Anda. </p> <p> Unduh pengaya Google Dokumen dengan membuka opening <strong> Alat </strong> menu, lalu klik <strong> Pengaya </strong> dan <strong> Dapatkan add-on </strong> . Di kotak Google Marketplace yang muncul, cari <strong> Aksen Mudah </strong> dan klik tombol instal biru untuk menambahkannya ke koleksi add-on Google Documents Anda. </p> <p> Setelah menginstal, klik pada <strong> Pengaya </strong> menu untuk memilih add-on Aksen Mudah dan mulai menambahkan aksen yang benar pada semua kata asing Anda. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Add-on ini hanya tersedia di desktop, tetapi keyboard seluler biasanya mendukung aksen bahasa sehingga Anda dapat menulis teks dengan tanda aksen di ponsel Anda tanpa add-on. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Buat Pintasan Khusus </h2> <p> Kebanyakan orang akrab dengan <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Pintasan Microsoft Word </a> , tetapi Anda juga dapat membuat pintasan sendiri di Google Documents. Untuk membuat pintasan khusus, klik click <strong> Alat &gt; Preferensi &gt; Substitusi. </strong> Anda akan menemukan bahwa sudah ada beberapa pintasan pecahan dan simbol, (seperti mengubah 3/4 menjadi ), tetapi jangan ragu untuk menambahkan beberapa dari Anda sendiri. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Fitur ini hanya tersedia di desktop. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Lakukan Lebih Banyak Dengan Google Dokumen </h2> <p> Sekarang setelah Anda mempelajari alat Google Documents ini, Anda dapat menggunakannya saat membuat dokumen berikutnya. Mudah-mudahan, mereka membuat segalanya lebih mudah bagi Anda! </p>"}