{"title":"5 Hal Yang Dapat Membuat Anda Diblokir Secara Permanen Dari Facebook","content":"<p> Facebook tidak setenar Twitter karena menghapus akun. Namun, ada beberapa pelanggaran yang dapat diblokir yang ditanggapi oleh Facebook dengan lebih dari sekadar label peringatan. </p> <p> Di sini, kami menjelajahi syarat dan ketentuan Facebook dan di mana perusahaan menarik garis, melihat contoh historis pengguna yang Facebook &quot;de-platformed&quot; untuk perilaku mereka. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> Sikap Facebook tentang Larangan Permanen </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> Tidak seperti situs media sosial lainnya, Facebook tidak mencantumkan banyak pelanggaran yang mengakibatkan pemblokiran permanen. Sebaliknya, itu mengutip pelanggaran berulang daripada tingkat keparahan pelanggaran sebagai faktor utama. Akibatnya, secara teori, setiap pelanggaran Facebook yang cukup sering berulang dapat mengakibatkan pemblokiran profil. </p> <p> Namun, beberapa aktivitas menghasilkan larangan total dan Facebook secara mengejutkan lemah dengan beberapa aktivitas ilegal yang diakui. Misalnya, menjual &quot;barang yang diatur&quot; seperti senjata api dan mariyuana tidak diperbolehkan di Marketplace Facebook, tetapi Facebook tidak mencantumkannya sebagai pelanggaran yang dapat dilarang. </p> <p> Facebook lebih suka menandai atau menghapus konten berdasarkan pos demi pos daripada menghapus profil. Namun, ada pengecualian. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Menyalahgunakan Alat dan Data </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> Ketentuan Layanan Facebook menjabarkan tiga pelanggaran terlarang. Yang pertama adalah kumpulan tindakan, yang akan dibahas lebih lanjut dalam artikel ini. Yang kedua dan ketiga lebih spesifik dan berkaitan dengan penyalahgunaan alat dan data Facebook. </p> <p> Istilah layanan umum ini melarang mengakses dan menggunakan bagian situs yang seharusnya disediakan untuk pengembang. Ini juga melarang penggunaan alat situs publik dengan cara yang sengaja berbahaya, seperti menggunakan Facebook untuk menyebarkan virus dan malware. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Ancaman terhadap Keamanan Publik </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Satu-satunya kasus di mana Facebook mengatakan bahwa mereka menonaktifkan akun adalah &quot;risiko nyata kerusakan fisik atau ancaman langsung terhadap keselamatan publik&quot;. Facebook juga menghapus profil yang &quot;mengumumkan misi kekerasan atau terlibat dalam kekerasan&quot;. </p> <p> Ini adalah alasan untuk melarang tanpa batas waktu presiden Donald Trump setelah kerusuhan di US Capitol pada Januari 2021. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Bergaul dengan Kelompok Kekerasan </h2> <p> Facebook mengambil sikap terhadap konten berbahaya dan mengancam ke tingkat asosiatif pada Oktober 2020 ketika menghapus profil yang terkait dengan konspirasi QAnon bahkan jika profil individu tidak memiliki konten kekerasan. Kelompok konspirasi ini telah menyebabkan episode kekerasan sejak 2016. </p> <p> </p> <p> Facebook juga melarang grup musik Trapt untuk posting yang merujuk pada grup kebencian Proud Boys. Organisasi politik ekstremis telah terlibat dalam kekerasan tingkat jalanan di AS dan Kanada sejak 2016. </p> <p> Perusahaan juga berhak menonaktifkan akun jika akun tersebut menimbulkan risiko hukum bagi Facebook. Selain itu, Facebook lebih bersikeras daripada platform media sosial lainnya tentang bekerja dengan penegak hukum dan organisasi penjangkauan ketika menghadapi konten semacam ini. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Mengganggu Keamanan Akun Lain </h2> <p> Salah satu pelanggaran langka lainnya yang masuk daftar Facebook adalah &quot;mengganggu keamanan akun lain dan layanan kami&quot;. Mengkompromikan keamanan layanan Facebook terdengar sangat mirip dengan malware dan penyalahgunaan yang disebutkan dalam persyaratan layanan. Namun, gagasan untuk mengkompromikan keamanan akun lain mengarah ke doxxing. </p> <p> </p> <p> Doxxing adalah rilis informasi sensitif dunia nyata pengguna media sosial, yang berpotensi termasuk alamat rumah atau kantor mereka, nomor telepon pribadi, atau lokasi fisik real-time. Praktek ini sering dilakukan dengan maksud untuk menyakiti orang tersebut. </p> <p> </p> <h2 id=\"misinformation\"> 5. Informasi yang salah </h2> <p> </p> <p> Pedoman resmi Facebook mengatakan bahwa Facebook tidak menghapus informasi yang salah, melainkan memilih untuk melabelinya sehingga dapat berkontribusi pada dialog tanpa menyesatkan orang lain. Namun, sejumlah pemegang akun yang ditangguhkan mengatakan bahwa penghapusan mereka disebabkan oleh apa yang disebut Facebook sebagai &quot;Berita Palsu&quot;. </p> <p> Ada beberapa alasan mengapa hal ini terjadi. Dalam beberapa kasus, Facebook menentukan bahwa berita palsu juga berbahaya bagi kesehatan pribadi atau masyarakat. </p> <p> Ini <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> Penjelasan Facebook untuk menghapus teori konspirasi David Icke </a> untuk mengklaim, antara lain, bahwa internet 5G menyebabkan Covid-19. Facebook juga mengatakan bahwa Icke telah &quot;berulang kali melanggar&quot; kebijakan. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Kebijakan Facebook dan Akun Anda </h2> <p> Sebagian besar, Facebook tidak mempermasalahkan Anda selama Anda tidak menyalahgunakan platform untuk merugikan orang lain. Namun, ada masalah tertentu saat perusahaan menarik garis batas. </p> <p> Jika Anda tidak melanggar persyaratan layanan ini, Anda harus tetap aman dari larangan Facebook permanen. </p>"}