{"title":"8 Cara Media Sosial Dapat Membantu Anda Mempelajari Bahasa Baru","content":"<p> Apakah Anda masih mengalami mimpi buruk tentang buku teks bahasa Spanyol dan kelas bahasa Prancis yang diajarkan dengan buruk yang Anda terima di sekolah? Jangan takut. Berkat internet, belajar bahasa baru akhir-akhir ini bisa menyenangkan dan mudah diakses. </p> <p> Media sosial, khususnya, telah membantu menghubungkan jutaan pelajar bahasa di seluruh dunia. Apakah Anda sedang mempelajari sesuatu yang populer seperti bahasa Jerman atau lebih tidak jelas seperti bahasa Faroe, Anda akan menemukan berbagai sumber daya untuk membantu Anda dalam perjalanan Anda. </p> <p> Berikut adalah beberapa cara Anda dapat menggunakan media sosial untuk mempelajari bahasa asing Anda berikutnya. </p> <h2 id=\"join-facebook-groups\"> 1. Bergabunglah dengan Grup Facebook </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> Di Facebook, Anda akan menemukan grup untuk hampir semua bahasa. Anda akan menemukan komunitas ekspatriat yang baru pindah yang ingin meningkatkan keterampilan, serta kelompok untuk pelajar di seluruh dunia. Untuk mendapatkan hasil maksimal dari pengalaman Anda, Anda harus bergabung dengan keduanya. </p> <p> Untuk menemukan grup Facebook yang tepat, Anda dapat melakukan pencarian online sederhana. Atau, Anda dapat menemukan apa yang Anda cari dari dalam Facebook. Untuk melakukannya, buka Grup dan cari bahasa Anda. Anda kemudian akan mendapatkan daftar komunitas yang sesuai dengan kebutuhan ini. </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> Jika Anda belajar di sekolah bahasa setempat, Anda juga dapat membuat grup sendiri untuk terhubung dengan teman sekelas Anda. Untuk melakukan ini, <strong> Buka Grup &gt; Buat Grup Baru </strong> . Anda kemudian dapat mengedit pengaturan dan mulai mengundang anggota. </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2. Manfaatkan Reddit </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit adalah forum online populer yang merupakan tambang emas bagi pelajar bahasa. Anda akan menemukan subreddit untuk bahasa tertentu dan pembelajaran bahasa umum. </p> <p> Saat Anda bergabung dengan subreddit, Anda akan menemukan banyak tip dan petunjuk berguna dari pelajar lain yang telah mengikuti jalan Anda. Anda juga akan menemukan banyak meme yang pasti akan Anda hubungkan. </p> <p> Untuk menemukan subreddit, buka bilah pencarian di bagian atas dan ketik bahasa Anda. Setelah hasilnya dimuat, ada baiknya bergabung dengan kelompok pembelajaran khusus dan kelompok budaya untuk mempelajari lebih lanjut tentang adat istiadat setempat. </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. Terhubung Dengan Penutur Asli </h2> <p> Cara terbaik untuk belajar bahasa dengan cepat adalah dengan berbicara dengan orang yang sudah berbicara bahasa itu. Dan media sosial bisa menjadi tempat yang tepat untuk menemukan pembicara ini. Anda mungkin perlu menjangkau beberapa orang, tetapi pada akhirnya, Anda akan menemukan seseorang yang bersedia menyisihkan waktu untuk membantu Anda. </p> <p> Saat terhubung dengan penutur asli di media sosial, fokuslah untuk membangun persahabatan terlebih dahulu. Jika Anda berada di kota yang sama dengan mereka, tawarkan untuk bertemu dengan mereka dan membayar kopi. Bagi mereka yang lebih jauh, tawarkan untuk membantu mereka mempelajari salah satu bahasa yang sudah Anda kuasai. </p> <p> Langkah-langkah untuk ini serupa di setiap platform media sosial. Di Instagram atau Twitter, ikuti mereka dan kirim pesan (jika pengaturan privasi mereka memungkinkan). Anda dapat mengambil pendekatan serupa di Facebook, meskipun beberapa orang mungkin kurang bersedia menerima permintaan pertemanan dari orang yang tidak mereka kenal. </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. Buat Konten Media Sosial Anda Sendiri </h2> <p> Anda tidak hanya perlu mengkonsumsi media sosial untuk membantu diri Anda belajar bahasa. Coba buat postingan Anda sendiri juga. Melakukan hal itu tidak hanya akan membantu Anda berlatih berbicara dan menulis; Anda mungkin juga menemukan pengguna baru untuk berlatih. </p> <p> Anda memiliki banyak pilihan dalam hal membuat konten. Di Twitter, Anda dapat bergabung dalam percakapan atau menulis beberapa tweet dalam bahasa target Anda. Dengan Instagram, Anda dapat menulis teks, membuat grafik, dan merekam diri Anda sedang berbicara. </p> <p> Saat Anda membuat konten media sosial Anda sendiri, Anda juga akan mendapatkan umpan balik dari penutur asli. Selain itu, Anda juga dapat mengembangkan portofolio dan mempelajari beberapa keterampilan baru yang berguna. </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. Atur Aplikasi Anda ke Bahasa yang Anda Pelajari </h2> <p> Mengubah pengaturan telepon Anda adalah cara mudah untuk membuat diri Anda berpikir dalam bahasa target Anda dan nyaman membacanya. Anda juga akan menambahkan lusinan kata baru ke kosakata Anda. </p> <p> </p> <p> Semua jaringan media sosial besar memiliki pengaturan dalam aplikasi di mana Anda dapat mengubah bahasa Anda. Di Instagram, misalnya, buka <strong> Akun &gt; Bahasa </strong> . Anda kemudian akan melihat dropdown dari semua bahasa yang dapat Anda gunakan. </p> <p> <strong class=\"gallery__section-title\"> Galeri Gambar (2 Gambar) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> Memperluas <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> Memperluas </p> <p> Menutup </p> <p> Anda juga dapat mengubah semua bahasa aplikasi sekaligus menggunakan setelan ponsel. Pergi ke <strong> Pengaturan </strong> &gt; <strong> Umum &gt; Bahasa &amp; Wilayah </strong> . Dari sana, Anda akan melihat daftar setiap bahasa yang tersedia. Perhatikan bahwa untuk bahasa yang lebih kecil, Anda mungkin tidak dapat mengoptimalkan akun Anda. </p> <p> <strong class=\"gallery__section-title\"> Galeri Gambar (2 Gambar) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> Memperluas <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> Memperluas </p> <p> Menutup </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. Maksimalkan Hashtag </h2> <p> Menggunakan dan menelusuri dengan tagar adalah cara yang ampuh untuk menemukan lebih banyak pengguna dalam bahasa yang Anda pelajari. Dengan menggunakan variasi, Anda dapat terhubung dan mengonsumsi konten penutur asli dan pelajar lainnya. </p> <p> Untuk menemukan jenis konten yang Anda cari, pikirkan tentang apa yang akan digunakan pelajar lain. Anda juga dapat menemukan konten penutur asli dengan mencari topik yang ada di negara mana pun. Seringkali, Anda dapat menemukannya di posting dan artikel yang sedang tren. </p> <p> Untuk mencari hashtag, gunakan fungsi pencarian di aplikasi media sosial mana pun yang Anda gunakan. Anda juga dapat mengeklik pos yang menggunakannya dan menemukan semua hasil yang ditampilkan. </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. Ikuti Akun dalam Bahasa Target Anda </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> Setiap akun menarik yang Anda ikuti dalam bahasa Inggris juga kemungkinan memiliki padanan dalam bahasa target Anda. Ini mungkin publikasi besar-besaran, atau mereka bisa menjadi pembicara sehari-hari yang lebih nyaman membuat karya dalam bahasa rumah mereka. </p> <p> </p> <p> Anda juga harus melihat apakah majalah, tim olahraga, dan artis musik favorit Anda memiliki akun dalam bahasa target Anda. Banyak klub olahraga terbesar di dunia, misalnya, memiliki akun dalam bahasa Inggris, Spanyol, dan banyak lagi. </p> <p> Saat mengikuti akun dalam bahasa yang ingin Anda pelajari, aturan praktis yang baik adalah hanya mengikuti akun tersebut jika menurut Anda konten berbahasa Inggris mereka sama menariknya. Jika tidak, Anda akan mengabaikan dan berhenti mengikuti mereka lagi nanti. </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. Ikuti Aplikasi Pembelajaran Bahasa di Media Sosial </h2> <p> <strong class=\"gallery__section-title\"> Galeri Gambar (2 Gambar) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> Memperluas <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> Memperluas </p> <p> Menutup </p> <p> Aplikasi pembelajaran bahasa juga sering memiliki profil media sosial yang aktif. Ini bagus untuk mengambil tip umum dan berkaitan dengan perjuangan umum yang dihadapi semua orang – baik mereka belajar bahasa Norwegia atau Jepang. </p> <p> Beberapa akun yang layak diikuti adalah Babbel, Busuu, dan Duolingo. </p> <p> Anda tidak hanya perlu menggunakan aplikasi ini untuk konsumsi. Jangan ragu untuk menambahkan pemikiran Anda di komentar. Anda bahkan mungkin mendapatkan beberapa teman baru, bahkan jika mereka belajar bahasa yang sama sekali berbeda dari Anda. </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> Jadikan Belajar Bahasa Menjadi Menyenangkan Dengan Media Sosial </h2> <p> Jadi, begitulah. Sekarang Anda memiliki lebih banyak ide untuk menggunakan media sosial untuk membantu membuat perjalanan belajar bahasa Anda menyenangkan. Meskipun pekerjaan buku teks masih penting, itu seharusnya bukan satu-satunya pilihan Anda. </p> <p> Bahkan jika Anda tidak dapat mengoptimalkan aplikasi ke bahasa target Anda, Anda masih akan menemukan banyak penutur asli dan sesama pelajar untuk terhubung. </p> <p> Kunci untuk belajar bahasa dengan media sosial adalah terlibat dan mengkonsumsi. Ketika Anda melakukannya, Anda akan menemukan pengalaman Anda lebih memuaskan dan mengambil kata-kata yang tidak pernah diajarkan buku teks kepada Anda. </p>"}