{"title":"Apa itu MTA-STS dan Bagaimana Melindungi Email Anda?","content":"<p> Email adalah pelaku terbesar di balik sebagian besar serangan siber. Ini adalah titik akses yang mudah untuk malware, adware, spam, dan phishing, serta memberikan peluang tak terbatas bagi pelaku ancaman untuk mendapatkan informasi pribadi Anda. </p> <p> Untuk mengurangi ancaman ini, langkah-langkah keamanan yang ketat harus dilakukan untuk akun email individu dan bisnis. </p> <h2 id=\"email-security-and-encryption\"> Keamanan dan Enkripsi Email </h2> <p> Terlepas dari popularitas mode komunikasi lain, pesan email masih merupakan bentuk data transit terbesar untuk individu atau organisasi mana pun. Mengamankan konten email Anda adalah kebutuhan vital. </p> <p> Keamanan email memerlukan pemeriksaan dan enkripsi semua lalu lintas email masuk dan keluar. Enkripsi memainkan peran penting dalam menjaga privasi konten email tetap utuh dengan memastikan koneksi SMTP (Simple Mail Transfer Protocol) yang aman. </p> <p> Sampai saat ini, enkripsi hanyalah persyaratan opsional untuk SMTP. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> Bagaimana Cara Kerja Enkripsi Email? </h2> <p> Enkripsi email adalah proses menambahkan cipher atau potongan kode ke konten pesan Anda sehingga tidak dapat diuraikan. Dengan mengubah data email menjadi kode, konten dilindungi dari paparan yang tidak sah. Sederhananya, email Anda diacak. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> Sebagai keamanan tambahan, proses enkripsi menggunakan kunci publik dan pribadi di mana kunci terenkripsi dipertukarkan untuk mengunci dan membuka kunci email berkode. Pengirim mengenkripsi email menggunakan kriptografi kunci publik dan selanjutnya, penerima menggunakan kunci pribadi untuk menguraikan pesan yang diterima. </p> <p> Enkripsi diterapkan ke seluruh perjalanan email, dari awal hingga akhir. Sebagai praktik terbaik, semua email masuk dan keluar harus dienkripsi—bukan hanya yang membawa informasi sensitif. Ini mencegah pelaku ancaman mendapatkan titik masuk ke sistem Anda. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> Latar Belakang dan Masalah dengan SMTP </h2> <p> Ketika protokol SMTP muncul pada tahun 1982, enkripsi email bukanlah praktik umum dan secara default, email dikirim dan diterima dalam teks biasa. Untuk memperkenalkan keamanan di tingkat transportasi, perintah STARTTLS ditambahkan pada akhir 1990-an, yang menawarkan opsi enkripsi melalui <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> Protokol TLS (Transport Layer Security) </a> . </p> <p> Meskipun upgrade TLS terdengar menjanjikan, ini menyisakan dua celah keamanan: </p> <ol> <li> Opsi enkripsinya adalah: <strong> pilihan </strong> . Email yang tidak aman masih merajalela, menyebabkan lonjakan serangan dunia maya. </li> <li> Bahkan dengan STARTTLS di tempat, tidak ada cara untuk mengotentikasi identitas server pengirim karena server SMTP tidak memvalidasi sertifikat. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> Kedatangan MTA-STS </h2> <p> Pada tahun 2019, Google akhirnya melangkah maju dan mengumumkan adopsi standar MTA-STS (Mail Transfer Agent/Strict Transport Security) baru ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> Ini memberi penyedia layanan email kemampuan untuk menerapkan TLS untuk mengamankan koneksi SMTP dan juga menawarkan opsi untuk menolak pengiriman email ke host MX yang tidak menawarkan TLS dengan sertifikat server yang andal. </p> <p> MTA-STS akhirnya menangani semua masalah sebelumnya dengan SMTP dengan menerapkan enkripsi antara server SMTP yang berkomunikasi. Tapi bagaimana cara kerjanya? Mari kita cari tahu! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> Bagaimana MTA-STS Bekerja? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS bekerja dengan menginstruksikan server SMTP untuk hanya berkomunikasi dengan server SMTP lain dengan dua kondisi: </p> <ol> <li> Server SMTP <strong> harus </strong> dienkripsi. </li> <li> Nama domain pada sertifikat server cocok dengan domain dalam kebijakan, dan sertifikat adalah yang terbaru. </li> </ol> <p> Dengan menggunakan kombinasi DNS dan HTTPS untuk menerbitkan kebijakan, MTA-STS menginformasikan pihak pengirim bagaimana cara melanjutkan jika saluran komunikasi terenkripsi tidak dapat dimulai. </p> <p> Sangat mudah untuk menerapkan MTA-STS di pihak penerima, tetapi untuk pengirim, perangkat lunak server email pendukung seperti <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> seharusnya digunakan. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> Jenis Serangan Apa yang Dimitigasi MTA-STS? </h2> <p> Ancaman berikut ini dihadapi secara langsung jika MTA-STS diterapkan pada komunikasi email Anda: </p> <p> <strong> Serangan Man-In-The-Middle (MITM): </strong> Serangan ini dilakukan saat penyerang menengahi dirinya di tengah komunikasi antara dua pihak untuk mencuri atau mengubah data. Dalam kasus email, itu biasanya berarti dua server SMTP yang berkomunikasi. Dengan menggunakan MTA-STS, serangan ini dapat dicegah dengan mudah. </p> <p> <strong> Serangan Downgrade: </strong> Aktor ancaman memaksa saluran jaringan untuk berubah ke mode transmisi data yang tidak aman. Sebagai contoh, serangan ini mungkin mengarahkan pengunjung situs web dari versi HTTPS situs ke versi HTTP. MTA-STS membantu memerangi serangan ini dengan mencegah akses yang tidak sah. </p> <p> <strong> Serangan Spoofing DNS: </strong> Serangan licik ini mengubah catatan DNS dari tujuan yang dituju pengguna dan membodohi mereka agar percaya bahwa mereka mengunjungi situs atau domain yang sah. Menerapkan MTA-STS sangat membantu dalam mengurangi serangan ini. </p> <p> </p> <p> Sekarang kita sudah familiar dengan MTA-STS, sekarang saatnya untuk menyentuh dasar dengan standar pelaporan baru untuk SMTP yang dikenal sebagai pelaporan TLS. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> Apa itu Pelaporan TLS SMTP (TLS-RPT)? </h2> <p> Sama seperti MTA-STS, TLS-RPT adalah standar pelaporan yang mendeteksi masalah konektivitas dan perbedaan antara pengiriman aplikasi. Setelah diaktifkan, aplikasi ini akan mengirimkan laporan harian terkait masalah koneksi apa pun yang dialami oleh server eksternal saat mengirimi Anda email. </p> <p> Anggap saja sebagai alat pemecahan masalah di mana laporan dapat digunakan untuk mengukur dan melakukan triase masalah potensial dan masalah konfigurasi. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> Jenis Masalah Apa yang Diselesaikan TLS-RPT? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Pelaporan Diagnostik: </strong> Pelaporan TLS menawarkan laporan diagnostik dalam format file JSON yang berisi detail lengkap terkait email masuk yang menghadapi masalah pengiriman. Ini juga mendeteksi email yang terpental atau tidak terkirim karena serangan downgrade, misalnya. </p> <p> <strong> Peningkatan Visibilitas: </strong> Dengan mengaktifkan TLS-RPT, Anda dapat meningkatkan visibilitas di semua saluran email Anda. Ini memungkinkan Anda untuk mengawasi semua data yang menuju ke arah Anda, yang juga termasuk pesan yang gagal. </p> <p> <strong> Laporan Harian: </strong> Laporan diagnostik dikirim setidaknya sekali sehari untuk meliput dan mengamati kebijakan MTA-STS secara mendalam. Laporan juga mencakup statistik lalu lintas serta informasi terperinci tentang kesalahan dan pengiriman yang gagal. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Ketika Yang Lain Gagal, Enkripsi Menang Pre </h2> <p> Karena sifat ancaman dunia maya yang terus berkembang, langkah-langkah keamanan yang ketat dan kriptografi harus dimiliki untuk pengiriman email yang aman dan terjamin. </p> <p> Berkat berbagai penyedia email yang menawarkan kemampuan enkripsi yang kuat dan standar MTA-STS, transfer email yang sepenuhnya aman bukanlah kenyataan yang dibuat-buat lagi. </p>"}