{"title":"AirTags yang Ditunggu-tunggu Akhirnya Bisa Debut di Bulan Maret","content":"<p> AirTags Apple, pelacak lokasi mini untuk kunci dan benda kecil lainnya, telah dikabarkan akan segera hadir sejak 2019. Namun, enam minggu memasuki tahun 2021, mereka masih belum diumumkan oleh Apple --- apalagi untuk mulai dikirim kepada pelanggan. </p> <p> Itu bisa berubah bulan depan, menurut keterangan rahasia Apple Jon Prosser. Dalam tweet yang dikirim pada hari Jumat, 12 Februari, Prosser mengklaim bahwa, &quot;AirTag masih aktif untuk bulan Maret. Belum ada penundaan lebih lanjut kali ini.&quot; </p> <h2 id=\"what-to-expect-from-airtags\"> Apa yang Diharapkan Dari AirTags </h2> <p> Prosser mengacu pada penundaan sebelumnya yang dia laporkan akhir tahun lalu, sebelum acara media Apple 13 Oktober. Pada saat itu, Prosser mencatat pada <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800\" target=\"_blank\" rel=\"nofollow noopener\"> Indonesia </a> bahwa dia telah mendengar dari sumbernya (tampaknya tepat) bahwa, &quot;Apple telah menunda pengumuman dan peluncuran AirTags hingga Maret 2021.&quot; Hingga setengah tahun kemudian, tampaknya tidak ada penundaan lebih lanjut yang akan menghentikan rilis AirTags. Seseorang akan berharap, setidaknya. </p> <p> AirTags dilaporkan akan menggunakan teknologi ultra wideband Apple untuk memungkinkan iPhone menentukan lokasi tepat mereka dengan tingkat akurasi yang tinggi. Mereka seharusnya akan menggunakan isyarat audio dan penanda virtual yang diperbesar untuk menunjukkan dengan tepat di mana objek, yang dilampirkan ke AirTags, berada. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> AirTags masih aktif untuk bulan Maret. <br><br> Belum pernah mendengar penundaan lebih lanjut kali ini. 🤞 </p> — Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1360265330296250377?ref_src=twsrc%5Etfw\"> 12 Februari 2021 </a></blockquote>  <p> Menemukan AirTags individu akan menjadi <a href=\"https://www.makeuseof.com/apple-find-my-items-hidden-tab/\" target=\"_blank\" rel=\"nofollow noopener\"> dilakukan melalui aplikasi &quot;Temukan Saya&quot; iOS </a> , yang juga memungkinkan pengguna melacak iPhone, iPad, Mac, dan perangkat Apple lainnya. AirTags akan menjadi saingan Apple untuk produk pelacakan Bluetooth populer dari perusahaan seperti Tile. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Jadi, tentang AirTags. <br><br> Yang ini menyakiti hatiku... <br><br> Saya diberi tahu bahwa Apple telah menunda pengumuman dan peluncuran AirTags hingga Maret 2021. <a href=\"https://t.co/xtUvCAFmoE\"> https://t.co/xtUvCAFmoE </a> <a href=\"https://t.co/DIUlcp01Xy\"> pic.twitter.com/DIUlcp01Xy </a></p> — Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800?ref_src=twsrc%5Etfw\"> 9 Oktober 2020 </a></blockquote>  <p> Apple belum mengumumkan acara khusus bulan Maret, di mana AirTags dapat diumumkan. Namun, jika itu menjadi tuan rumah yang akan sesuai dengan beberapa tahun terakhir. Selama enam dari 10 tahun terakhir, Apple telah menyelenggarakan acara pada bulan Maret di mana ia memamerkan produk baru. </p> <p> Tahun lalu, sebuah acara yang sangat dikabarkan, tapi tidak terjadi, kemungkinan besar karena awal COVID-19 pandemi di AS dan di tempat lain. Sekarang Apple beralih ke acara virtual, ini tidak akan menghentikannya untuk mengadakan acara lain bulan depan. Atau, Apple bisa mengumumkan AirTags melalui siaran pers. </p> <p> </p> <h2 id=\"expect-a-new-ipad-pro-as-well\"> Harapkan iPad Pro Baru Juga </h2> <p> Ini mungkin bukan satu-satunya produk Apple baru bulan depan. Prosser juga menanggapi pertanyaan tentang iPad Pro Apple berikutnya, dengan mengatakan itu &quot;juga [ditetapkan untuk] Maret, sejauh yang saya tahu.&quot; </p> <p> Sementara Prosser telah salah sebelumnya, ia memiliki catatan yang mengesankan secara keseluruhan dalam hal pengumuman Apple yang akurat. Akankah AirTags dan iPad Pro generasi berikutnya ada di antara mereka? Tidak ada waktu lama untuk menunggu sampai kita mengetahuinya. </p> <p> <small> Kredit Gambar: iphonedigital/ <a href=\"https://www.flickr.com/photos/137872055@N03/22522566994/\" target=\"_blank\" rel=\"nofollow noopener\"> Flickr </a></small> </p>"}