{"title":"Anda Mungkin Mendapatkan Microsoft Teams Pro Baru Secara Gratis","content":"<p> Beberapa saat yang lalu, kami membahas layanan berlangganan yang direncanakan untuk Microsoft Teams yang disebut &quot;Teams Pro,&quot; yang akan membuka fitur tambahan untuk perangkat lunak. Namun, Microsoft kemudian mengatakan bahwa beberapa orang akan mendapatkan Teams Pro tanpa biaya tambahan untuk paket mereka saat ini. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Pernyataan Microsoft tentang Langganan Tim Pro Gratis </h2> <p> Jika Anda membutuhkan pengingat, kami sebelumnya telah membahas topik ini di artikel kami tentang <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro menambahkan webinar ke layanan </a> . </p> <p> Sekarang, sebuah artikel oleh <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> pada topik yang sama sejak menerima pernyataan dari Microsoft. Pernyataan itu adalah kabar baik bagi orang-orang yang khawatir membayar ekstra untuk webinar: </p> <blockquote> <p> Pada 9 Februari, kami memublikasikan postingan MC terkait paket layanan Teams Pro yang baru. Untuk memperjelas, tidak ada perubahan pada lisensi produk yang ada dengan penambahan paket layanan baru ini. Sebaliknya, paket layanan akan ditambahkan secara otomatis ke Microsoft 365 dan Office 365 E5/E3/A5/A3, dan lisensi Microsoft 365 Business Standard/Business Premium, dan akan memungkinkan pengguna yang dilisensikan untuk SKU ini untuk secara otomatis menerima kemampuan yang diluncurkan ke Tim dalam waktu dekat. </p> </blockquote> <p> Microsoft selanjutnya menyatakan bahwa admin tidak perlu melakukan apa pun untuk mengaktifkan fitur-fitur baru ini. Juga, siapa pun dengan lisensi yang kompatibel seperti yang tercantum di atas akan mendapatkan fitur baru yang mengkilap ini tanpa biaya tambahan. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Mendapatkan Lebih Banyak untuk Sama Dengan Microsoft Teams </h2> <p> Microsoft meluncurkan paket langganan Teams Pro baru yang membuka webinar dan banyak lagi, tetapi tidak semua orang harus membayar ekstra untuk itu. Jika Anda#berlangganan ke salah satu lisensi di atas, Anda dapat berharap untuk mendapatkan semua fitur Teams Pro tanpa biaya tambahan. </p> <p> Itu tidak berarti bahwa orang-orang tanpa Teams Pro akan ditinggalkan di tempat teduh. Misalnya, semua orang akan segera memiliki akses ke fitur rekap praktis di Microsoft Teams. </p> <p> <small> Kredit Gambar: Studio Postmodern / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}