{"title":"Apa Perbedaan Antara LAN dan WAN dalam Jaringan?","content":"<p> Jika Anda telah mempelajari jaringan komputer, kemungkinan besar Anda akan menemukan istilah &quot;LAN&quot; dan &quot;WAN&quot;. Namun, apa artinya masing-masing, dan apa perbedaannya ketika Anda membandingkan LAN vs. WAN? </p> <p> Mari kita jelajahi kedua teknologi ini dan di mana masing-masing teknologi bersinar. </p> <h2 id=\"what-does-lan-stand-for\"> Apa Kepanjangan dari &quot;LAN&quot;? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> Kredit Gambar: Naroda Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> LAN adalah &quot;Jaringan Area Lokal.&quot; Istilah ini menggambarkan jaringan di mana semua perangkat yang terhubung berdekatan satu sama lain. Mereka semua berada di &quot;area lokal&quot;, karena itulah namanya. </p> <p> Ketika komputer terhubung ke LAN, ia mendapatkan alamat protokol internet (IP) lokal. Ini bekerja mirip dengan alamat IP yang Anda dapatkan saat Anda online. Namun, alamat IP lokal hanya berfungsi untuk komputer lain di LAN yang sama dengan Anda. Anda tidak dapat menggunakan IP lokal untuk terhubung ke PC Anda melalui internet, misalnya. </p> <p> Batas fisik LAN rumah Anda kemungkinan tidak akan meninggalkan rumah Anda. Tentu saja, jika Anda membawa ponsel atau laptop ke taman untuk mencari udara segar, itu masih di LAN. Namun, sebagian besar waktu, semua perangkat Anda yang terhubung ke jaringan aman di dalam empat dinding rumah Anda. </p> <p> Perusahaan dan lembaga juga membuat LAN. Misalnya, sebuah universitas dapat menghubungkan semua PC di perpustakaannya ke jaringan sehingga mereka semua dapat berbicara satu sama lain. Bisnis juga suka menggunakan LAN karena memungkinkan pekerja untuk mengirim file dan korespondensi satu sama lain tanpa perlu online. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> Apa Kepanjangan dari &quot;WAN&quot;? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Kredit Gambar: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Di sisi lain, kami memiliki Wide Area Network, atau WAN. Jika Anda membaca artikel ini, Anda sudah terhubung ke WAN—kami menyebutnya internet. </p> <p> &quot;Lebar&quot; di Wide Area Network sangat bervariasi. Jika Anda terhubung ke server eksternal di kota yang sama dengan Anda, itu adalah WAN. Ini juga dianggap sebagai WAN jika Anda terhubung ke server di negara di sisi lain planet ini. </p> <p> Oleh karena itu, WAN biasanya digunakan untuk mendeskripsikan jaringan apa pun yang Anda sambungkan yang ada setelah router Anda. Tidak masalah jika server berjarak satu mil atau benua; masih &quot;lebar&quot;. </p> <p> Internet bukan satu-satunya WAN di luar sana. Bisnis memanfaatkan WAN dengan baik untuk menghubungkan kantor yang berada di negara yang berbeda. Misalnya, jika sebuah bisnis memiliki kantor di New York, Tokyo, dan Sydney, ia dapat menyewa sistem WAN-nya sendiri untuk memungkinkan mereka berbicara satu sama lain. </p> <p> Tapi tunggu sebentar; mengapa perusahaan membuat WAN sendiri ketika mereka dapat dengan mudah menghubungkan semuanya ke internet? Masalah dengan solusi ini adalah perusahaan harus membayar biaya ISP, dan jika terjadi kesalahan, mereka harus bergulat dengan ISP tersebut untuk memperbaikinya. </p> <p> Tidak hanya itu, tetapi internet dirancang untuk menghubungkan ke banyak PC di seluruh dunia. Jika perusahaan hanya ingin PC-nya terhubung ke PC kantor lain, mereka dapat menggunakan WAN mereka sendiri untuk melindungi diri dari ancaman online. Ini disebut &quot;intranet&quot;. </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> Kapan Menggunakan LAN vs. WAN </h2> <p> Saat Anda ingin terhubung ke perangkat lain yang Anda miliki, Anda dapat memilih untuk melakukannya melalui LAN atau WAN. Tapi apa kelebihan dan kekurangan masing-masing, dan mana yang harus Anda gunakan? </p> <p> Katakanlah Anda memiliki hard drive nirkabel baru yang terhubung ke router Anda, dan Anda memiliki pilihan untuk mengizinkan koneksi dari internet (WAN) atau hanya lokal (LAN). Yang mana yang Anda pilih tergantung pada apa yang Anda inginkan dari hard drive. </p> <p> Memberikan kemampuan WAN ke hard drive sangat bagus untuk kenyamanan. Ini menempatkannya di internet, yang berarti Anda dapat terhubung dari mana saja di dunia. Dengan demikian, Anda tidak akan pernah terjebak tanpa file Anda lagi; mereka hanya akan memiliki koneksi internet. </p> <p> Namun, koneksi WAN juga memungkinkan orang lain untuk mendapatkan akses ke perangkat Anda. Jika keamanan hard drive Anda tidak sempurna, peretas dapat menggunakan rute yang sama seperti yang Anda lakukan untuk melihat semua data Anda dan menyalin atau menghapus hal-hal penting. </p> <p> Menempatkan hard drive dalam mode LAN saja, di sisi lain, melindunginya dari beberapa jalan yang dapat diambil oleh peretas. Ini tidak tahan. Misalnya, seseorang mungkin menggunakan PC Anda untuk mendapatkan akses ke hard drive. Namun, ini jauh lebih aman daripada menyiarkan hard drive di WAN setiap hari dan malam. </p> <p> Jika Anda benar-benar ingin memperketat keamanan, Anda dapat membuat celah udara pada hard drive. Air-gapping berarti bahwa ia dan setiap PC di jaringan yang sama di dalamnya tidak terhubung ke WAN—seperti internet, misalnya. </p> <p> Sebuah <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> komputer dengan celah udara tidak sepenuhnya aman dari ancaman online </a> , tetapi secara drastis mengurangi kemungkinan serangan. Peretas perlu memanipulasi manusia untuk melakukan perintah mereka untuk menyerang perangkat yang memiliki celah udara, menggunakan taktik rekayasa sosial untuk mendapatkan apa yang mereka inginkan. </p> <p> Dengan demikian, ketika memilih antara meletakkan perangkat di internet atau menguncinya di LAN rumah Anda, Anda perlu mempertimbangkan apakah Anda benar-benar akan menyambungkannya melalui internet. Jika Anda tidak berpikir akan melakukannya, sebaiknya matikan kemampuan WAN-nya dan jauhi peretas. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> Apakah Menghubungkan ke Internet Mengubah LAN Menjadi WAN? </h2> <p> Katakanlah Anda memiliki LAN yang diatur di mana semua perangkat Anda terhubung ke router. Anda bosan, jadi Anda masuk ke komputer dan pergi ke Netflix. Sekarang, PC Anda terhubung ke WAN: internet. </p> <p> Namun, karena PC Anda terhubung ke WAN, apakah itu berarti bukan lagi bagian dari LAN? Untungnya, sebuah perangkat dapat menjadi bagian dari LAN dan WAN secara bersamaan. </p> <p> Ingat bagaimana kami mengatakan bahwa perangkat LAN memiliki alamat IP lokal mereka sendiri? Ini tidak berarti tidak bisa mendapatkan alamat IP internet juga. Bahkan, jika Anda membaca artikel ini di perangkat yang terhubung ke router, keduanya akan memiliki keduanya! </p> <p> Jika Anda ingin memeriksanya sendiri, kami telah membahasnya <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> cara memeriksa alamat IP Anda di Windows </a> . Jika Anda menggunakan ponsel, Anda masih bisa <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> temukan alamat IP Anda di Android atau iPhone </a> . </p> <p> Setelah Anda memiliki statistik, Anda akan melihat dua alamat IP. Yang pertama akan dimulai dengan &quot;192.168&quot;—itu adalah alamat IP lokal Anda. Anda menggunakan yang ini jika Anda ingin terhubung ke perangkat Anda saat ini dari perangkat lain di jaringan yang sama. </p> <p> Yang kedua akan terlihat salah satu dari dua cara, tergantung pada apakah Anda menggunakan IPv4 atau IPv6. Jika Anda menggunakan v4, itu akan terlihat seperti alamat IP lokal Anda, tetapi tidak akan dimulai dengan &quot;192.168.&quot; Jika itu IPv6, seharusnya huruf dan angka berantakan, dibagi menjadi delapan blok dengan titik dua. </p> <p> Bagaimanapun, alamat itu adalah alamat IP internet Anda. Itu digunakan ketika Anda terhubung ke server lain di internet sehingga dapat berbicara dengan Anda; misalnya, untuk mengirimi Anda acara TV yang sedang Anda tonton di Netflix. </p> <p> Di satu sisi, Anda dapat membayangkan internet sebagai jaringan LAN yang sangat besar. Saat Anda menonton Netflix, PC Anda (di LAN pribadi Anda) mendapatkan data dari server Netflix (yang ada di LAN-nya sendiri). Setiap LAN seperti rumah di kota, sedangkan konektivitas internet seperti jalan dan jalan yang menghubungkan semuanya. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> Menghapus Kebingungan LAN vs. WAN </h2> <p> LAN dan WAN sering bekerja bersama-sama, tetapi mereka bekerja dengan cara yang berbeda. Sekarang Anda tahu perbedaan antara keduanya, dan kapan harus menggunakan masing-masing. </p> <p> Tahukah Anda bahwa Anda dapat mengatur game LAN sehingga orang-orang di jaringan yang sama dapat bermain satu sama lain? Ini adalah cara yang bagus untuk menghabiskan waktu bersama teman-teman tanpa masalah latensi yang terkadang dimiliki game internet. </p> <p> <small> Kredit Gambar: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}