{"title":"Apa Itu Waktu Unix dan Kapan Era Unix?","content":"<p> Mengapa Unix memiliki konsep waktu sendiri? Apa zamannya dan apa masalah Y2038? </p> <p> Waktu Unix adalah sarana untuk mewakili tanggal dan waktu tertentu, yang digunakan oleh Linux, macOS, dan banyak sistem interoperable lainnya. Ini sangat tersebar luas, sehingga Anda mungkin menggunakannya tanpa menyadarinya. Namun, setelah Anda memahami waktu Unix, Anda akan melihatnya dalam banyak konteks. Beberapa alat dapat membantu Anda bekerja dengan waktu Unix. </p> <h2 id=\"what-is-the-purpose-of-unix-time\"> Apa Tujuan Waktu Unix? </h2> <p> Waktu Unix adalah hitungan detik total sejak waktu dan tanggal tetap. Ini adalah format tanggal/waktu (atau stempel waktu) yang terlihat berbeda dari tanggal dan waktu yang biasa kita baca. Ini murni untuk alasan efisiensi. Dibutuhkan lebih sedikit ruang untuk menyimpan satu angka yang mewakili detik daripada menyimpan nilai terpisah untuk tahun, bulan, jam, dll. </p> <p> Tentu saja, dalam istilah modern, perbedaan ruang tidak terlalu jauh. Tetapi pertimbangkan bahwa Unix berasal dari akhir 1960-an ketika penyimpanan yang tersedia jauh lebih kecil. Stempel waktu juga banyak digunakan, sehingga penyimpanannya bertambah. Misalnya, setiap file memiliki tiga stempel waktu yang terkait dengannya. </p> <p> Formatnya hampir tidak mungkin untuk diterjemahkan di kepala Anda kecuali Anda seorang jenius matematika. Tetapi masih memiliki beberapa keunggulan dibandingkan alternatif yang lebih mudah dibaca seperti <strong> Rab, 21 Okt 2015 07:28:00 GMT </strong> . Anda dapat memesan dua cap waktu Unix dengan sangat mudah, sekilas. Biasanya juga lebih cepat untuk mengetahui perbedaan antara dua cap waktu. Hal ini terutama berlaku untuk tanggal yang berdekatan, seperti pada hari yang berdekatan. </p> <p> <img alt=\"A screenshot from the Epoch Converter site showing Unix Time\" src=\"images/epoch-converter-110.png\" loading=\"lazy\"> </p> <h3 id=\"about-the-epoch\"> Tentang Zaman </h3> <p> Jadi, waktu Unix adalah hitungan total detik sejak titik waktu tertentu. Tapi apa titik waktu itu? Nya <strong> 00:00:00 UTC </strong> di <strong> 1 Januari 1970 </strong> . Hal ini sering disebut sebagai Unix Epoch. Pemrogram memilih tanggal ini untuk zaman karena kenyamanan karena itu adalah tanggal putaran terdekat ketika mereka menemukan waktu Unix. </p> <p> Anda mungkin telah melihat tanggal ini ketika ada yang tidak beres. Ini jelas bug, tetapi yang terlihat sangat aneh ketika menghasilkan tanggal dari sebelum banyak dari kita lahir! Ini benar-benar dapat dimengerti, meskipun, ketika Anda tahu tentang waktu Unix. Jika ada sistem yang mencoba menampilkan stempel waktu yang tidak memiliki nilai apa pun, itu akan sering diterjemahkan ke 0 dan menghasilkan tanggal Epoch yang tepat. </p> <p> </p> <h2 id=\"the-unix-time-data-format\"> Format Data Waktu Unix </h2> <p> Tegasnya, tidak ada satu pun. Tipe data asli adalah bilangan bulat 32-bit, dan ini sering tetap terjadi, bahkan dalam sistem yang jauh lebih kuat. </p> <p> Tipe data ini memungkinkan nilai untuk menyimpan total 2^32 detik, yang berarti lebih dari 136 tahun. Nilai ini biasanya ditandai, artinya bisa negatif atau positif. Jadi, biasanya mewakili 68 tahun di kedua sisi zaman yaitu 1902-2038. </p> <p> Ini masih periode terbatas, tentu saja. Tetapi penggunaan utama format stempel waktu adalah untuk konsep seperti modifikasi file. Kebutuhannya sangat banyak untuk mewakili waktu yang dekat dengan masa sekarang, daripada sejarah kuno atau jauh ke masa depan. Bahkan untuk aplikasi seperti kalender, jarang ada kebutuhan untuk merepresentasikan tanggal lebih dari beberapa dekade ke depan. </p> <p> Namun bukan berarti rentang waktu yang terbatas ini tanpa masalah… </p> <h3 id=\"the-year-2038-problem\"> Masalah Tahun 203838 </h3> <p> Bug Y2K ( <a href=\"https://www.makeuseof.com/tag/worst-programming-mistakes-in-history/\" target=\"_blank\" rel=\"nofollow noopener\"> salah satu kesalahan pemrograman terburuk dalam sejarah </a> ) mempengaruhi sistem komputer yang menyimpan tahun sebagai nilai dua digit. Ketika tahun 2000 datang, sistem seperti itu memperlakukannya seolah-olah itu tahun 1900. Pada kenyataannya, ini tidak separah yang ditakuti, terutama karena banyak orang menghabiskan banyak waktu dan usaha di muka, mempersiapkannya. </p> <p> Jika Anda memperhatikan di bagian sebelumnya, Anda mungkin telah melihat masalah serupa yang dapat memengaruhi waktu Unix. Nah, waktu Unix memang memiliki masalah datanya sendiri: masalah Y2k38. (Ini sering disebut sebagai masalah, bukan bug; mungkin kami menjadi lebih optimis sejak tahun 2000!) Ketika waktu Unix benar-benar habis pada tahun 2038, sistem akan memperlakukan tanggal baru sebagai 1902 atau 1970. Atau mungkin mereka&#39; akan gagal sama sekali. </p> <p> Setidaknya masalah ini tidak akan menimpa kita pada tengah malam di Malam Tahun Baru. Detik terakhir waktu Unix 32-bit akan jatuh pada 19 Maret. Pada akhirnya, kami kemungkinan akan memutakhirkan sebagian besar sistem pada tahun 2038 atau mereka akan menjadi usang pada saat itu. </p> <p> </p> <h2 id=\"some-useful-timestamp-resources\"> Beberapa Sumber Daya Cap Waktu yang Berguna </h2> <p> Itu <a href=\"https://www.epochconverter.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Konverter Zaman </a> site mungkin merupakan konverter stempel waktu paling komprehensif yang tersedia. Ini dimulai dengan menampilkan waktu Unix saat ini — secara real-time — dan menambahkan hampir semua fitur yang bisa dibayangkan di atas itu. Penggunaan utamanya adalah untuk mengonversi antara cap waktu dan tanggal yang dapat dibaca manusia, di kedua arah. </p> <p> Dan&#39;s Tools adalah kumpulan besar aplikasi web yang berguna, salah satunya adalah a <a href=\"https://www.unixtimestamp.com/index.php\" target=\"_blank\" rel=\"nofollow noopener\"> konverter stempel waktu </a> . Ini lebih mendasar, tetapi memiliki presentasi yang sangat bersih dan mudah digunakan. </p> <p> <a href=\"https://time.is/Unix_time_now\" target=\"_blank\" rel=\"nofollow noopener\"> Waktu adalah </a> menghadirkan tampilan lain yang lebih minimalis. Ini menunjukkan waktu dalam sejumlah format, termasuk waktu Unix. Ini mencakup waktu saat ini di judul halamannya yang berguna. </p> <p> <img alt=\"A screenshot of the Time.is websites showing Unix Time\" src=\"images/time-is-177.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"using-unix-time-with-command-line-tools\"> Menggunakan Waktu Unix Dengan Alat Baris Perintah </h2> <p> Di Linux dan macOS, <strong> tanggal </strong> program adalah utilitas inti untuk menangani tanggal/waktu, termasuk cap waktu Unix. Dipanggil tanpa argumen apa pun, ia mengembalikan tanggal/waktu saat ini dalam format yang dapat dibaca manusia: </p> <pre><code class=\"hljs ruby\">$ date<br>Wed Feb 10 12:28:30 GMT 2021</code></pre> <p> Jika Anda memerlukan tanggal/waktu saat ini dalam waktu Unix, gunakan <strong> +%s </strong> argumen: </p> <pre><code class=\"hljs ruby\">$ date +%s<br>1612960114</code></pre> <p> Anda dapat mengonversi dari tanggal yang dapat dibaca manusia menjadi stempel waktu menggunakan <strong> -d </strong> tandai jika versi Anda <strong> tanggal </strong> mendukungnya. Sebagian besar versi Linux seharusnya, secara default: </p> <pre><code class=\"hljs ruby\">$ date -d \"Jan 2 1970\" +%s<br>82800</code></pre> <p> Di macOS, <strong> tanggal </strong> adalah program yang berbeda, yang memerlukan serangkaian flag yang berbeda: </p> <pre><code class=\"hljs perl\">$ date -j -f \"%b %d %Y %T\" \"Jan 02 1970 00:00:00\" \"+%s\"<br>82800</code></pre> <p> Pergi ke arah lain, Anda dapat mengonversi dari stempel waktu Unix menggunakan <strong> -r </strong> bendera: </p> <pre><code class=\"hljs ruby\">$ date -r 1600000000<br>Sun 13 Sep 2020 13:26:40 BST</code></pre> <p> Beberapa program lain menggunakan <strong> %s </strong> format untuk menangani waktu Unix. Misalnya, jika Anda ingin menampilkan tanggal modifikasi file dalam waktu Unix, dengan <a href=\"https://www.makeuseof.com/ls-command-linux/\" target=\"_blank\" rel=\"nofollow noopener\"> versi Linux dari <strong> ls </strong></a> , Anda dapat menggunakan yang berikut ini: </p> <pre><code class=\"hljs perl\">$ ls -l --time-style=+%s index.tmp.html<br>-rw-r--r-- 1 ubuntu ubuntu 17862 1521649818 index.tmp.html</code></pre> <p> </p> <h2 id=\"how-to-use-unix-time-in-programming-languages\"> Cara Menggunakan Waktu Unix dalam Bahasa Pemrograman </h2> <p> PHP memiliki <strong> waktu() </strong> fungsi yang mengembalikan stempel waktu Unix saat ini. Nya <strong> tanggal() </strong> fungsi mengambil stempel waktu sebagai argumen kedua: </p> <pre><code class=\"hljs ruby\">$ php -r 'echo date(\"Y-m-d\", time());'<br>2021-02-11</code></pre> <p> JavaScript mendekati hal-hal dengan cara yang menarik. Ini memiliki <strong> Tanggal.sekarang() </strong> metode untuk mendapatkan jumlah milidetik sejak zaman Unix. Tentu saja, Anda dapat membaginya dengan 1.000 dan membulatkan hasilnya untuk memberikan waktu Unix yang setara dalam hitungan detik: </p> <pre><code class=\"hljs perl\">> Math.floor(Date.now() / 1000)<br>1613083012</code></pre> <p> </p> <h2 id=\"understanding-unix-time\"> Memahami Waktu Unix </h2> <p> Waktu Unix adalah konsep sederhana yang muncul di banyak tempat. Setelah Anda memahaminya, Anda mungkin merasa cukup berguna, ketika menghitung perbedaan waktu, misalnya. Anda juga dapat mengenali kapan itu mungkin menjadi penyebab bug tertentu. </p> <p> Konsep seperti epoch dan stempel waktu adalah bagian penting dari memulai Linux. Untuk mengetahui lebih lanjut tentang hal-hal penting seperti <strong> ls </strong> , lihat panduan kami untuk perintah dasar Linux. </p>"}