{"title":"Anda akan Segera Bermain Game Dengan Karakter MetaHuman Epic","content":"<p> Jika menurut Anda game terlihat realistis sekarang, maka tunggulah sampai Anda mengetahui apa yang telah dilakukan Epic Games dengan Unreal Engine-nya. Bersiaplah untuk membuat pikiran Anda meledak. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games Meluncurkan MetaHumans Baru </h2> <p> Anda mungkin bertanya-tanya tentang bumi apa yang sedang kita bicarakan. MetaHuman Creator adalah fitur terbaru yang telah ditambahkan Epic Games ke Unreal Engine; lingkungan pengembangan perangkat lunak, yang dapat digunakan pengembang game untuk membuat judul mereka. </p> <p> Menurut an <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Posting blog Unreal Engine Engine </a> mengumumkan alat pengembangan baru yang menarik: </p> <blockquote> <p> MetaHuman Creator adalah aplikasi streaming cloud yang dirancang untuk mengambil kreasi manusia digital real-time dari minggu atau bulan hingga kurang dari satu jam, tanpa mengurangi kualitas. </p> </blockquote> <p> Jadi, pada dasarnya ini adalah cara bagi pengembang game untuk membuat faksimili manusia yang sangat realistis. Cepat. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> Apa Arti MetaHuman Creator bagi Pengembang? </h2> <p> </p> <p> Implikasinya terhadap pengembangan perangkat lunak adalah perubahan permainan (pun intended). Bayangkan seberapa cepat pengembang akan mengisi dunia game mereka dengan NPC, menggunakan MetaHuman Creator. Tidak hanya itu, manusia digital juga terlihat luar biasa. </p> <p> Ini juga berarti bahwa pengembang dapat menyelesaikan judul lebih cepat, jadi Anda tidak perlu menunggu melalui penundaan yang tak terhitung jumlahnya. MetaHuman Creator memungkinkan para pengembang untuk membangun populasi NPC mereka dengan cepat, menyisakan waktu untuk hal-hal lain yang lebih mendesak. </p> <p> Tapi mengapa perlu alat ini? Epic Games menjelaskan: </p> <blockquote> <p> Menciptakan satu manusia digital berkualitas tinggi itu sulit dan memakan waktu. Menskalakan upaya untuk menciptakan banyak manusia digital yang beragam dengan kualitas yang dibutuhkan oleh platform generasi berikutnya dan produksi virtual kelas atas memang merupakan tugas yang berat. </p> </blockquote> <p> Jadi, seperti yang kami katakan; alat ini menghemat waktu dan meningkatkan alur kerja, memungkinkan pengembang memberi konsol generasi baru game yang layak mereka dapatkan. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> Bagaimana MetaHuman Creator Akan Mempengaruhi Game? </h2> <p> Nah, berkat MetaHuman Creator, game mungkin akan dirilis lebih cepat, sebagai permulaan. Dengan alat canggih seperti ini, pengembang dapat mengasah mekanika game atau menghabiskan lebih banyak waktu untuk memperbaiki bug sebelum merilis game yang rusak... </p> <p> Bagaimanapun, selain kepahitan, alat pengembangan Epic sepertinya juga akan membuat game terlihat lebih baik. Anda hanya perlu melihat rendernya untuk melihat betapa menakjubkannya manusia digital sebenarnya. Namun, ketika kita melihat mereka dalam permainan, adalah saat keajaiban yang sebenarnya akan terjadi. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> Kapan Kita Akan Melihat MetaHumans di Game? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> Itu sulit untuk dikatakan. Saat ini, Epic telah mematok perangkat lunak Creator untuk pengujian akses awal dalam &quot;beberapa bulan ke depan&quot;. Jadi Anda tidak akan melihat MetaHumans dalam waktu dekat. </p> <p> Jika Anda ingin mencoba membuat manusia digital Anda sendiri, Anda harus menunggu jika Anda ingin menggunakan MetaHuman Creator dari Unreal Engine. Anda selalu dapat mencoba menyatukannya di program lain, tetapi itu pasti tidak akan memakan waktu kurang dari satu jam! </p>"}