{"title":"Apa itu Driver Headphone dan Bagaimana Pengaruhnya terhadap Suara?","content":"<p> Headphone adalah teknologi yang luar biasa. </p> <p> Mereka dibuat untuk orang biasa yang mendengarkan musik di tempat tidur atau dalam perjalanan dan profesional yang membutuhkan audio yang terdengar bersih untuk mengedit musik dan video. Ada berbagai jenis headphone untuk alasan ini. Baik Anda berolahraga atau mencampur audio selama berjam-jam, ada sepasang headphone untuk Anda. </p> <p> Di dalam headphone ini ada <strong> pengemudi </strong> yang bervariasi secara drastis dalam ukuran dan dibuat berbeda berdasarkan untuk siapa headphone itu. Driver ini, tentu saja, memengaruhi suara yang berdentang di telinga Anda. </p> <h2 id=\"what-is-a-headphone-driver\"> Apa itu Pengemudi Headphone? </h2> <p> <img alt=\"Open Back Headphone Driver\" src=\"images/open-back-headphone-driver-548.jpg\" loading=\"lazy\"> </p> <p> Driver headphone pada dasarnya adalah speaker kecil yang mengubah sinyal listrik menjadi suara yang dapat kita dengar. Driver ini dapat sangat bervariasi dalam ukuran tergantung pada jenis headphone dan untuk apa mereka digunakan. </p> <p> Misalnya, earbud memiliki driver yang sangat kecil yang hanya berukuran 8mm, dengan driver yang lebih besar berdiameter sekitar 15mm. Ukuran headphone over-ear sedikit lebih drastis, dari 20mm hingga 70mm. </p> <p> Driver headphone terdiri dari tiga komponen: <strong> magnet </strong> , <b> kumparan suara </b> , dan <strong> diafragma </strong> . </p> <ul> <li> Itu <strong> magnet </strong> menciptakan medan magnet dan biasanya terbuat dari kobalt atau ferit. </li> <li> <strong> Kumparan suara </strong> memungkinkan arus listrik melewatinya, menggerakkan diafragma untuk kemudian menghasilkan suara yang bisa kita dengar. Kumparan ini, biasanya terdiri dari berbagai jenis tembaga, membantu mengubah sinyal listrik menjadi suara. </li> <li> Itu <strong> diafragma </strong> bergetar, menghasilkan gelombang suara dari arus listrik yang melewati kumparan suara. </li> </ul> <p> </p> <h2 id=\"types-of-headphone-drivers\"> Jenis Driver Headphone </h2> <p> Tidak semua driver bekerja persis sama, dengan beberapa menghasilkan audio yang lebih baik daripada yang lain tergantung pada bahan yang digunakan serta proses dan teknik teknik. </p> <h3 id=\"dynamic-drivers\"> Driver Dinamis </h3> <p> <img alt=\"Bose Headphones which use a type of Dynamic Driver\" src=\"images/dynamic-driver-415.jpg\" loading=\"lazy\"> </p> <p> Jenis driver headphone yang paling umum adalah <strong> pengemudi dinamis </strong> . Driver ini bekerja seperti yang dijelaskan di atas. Saat diafragma bergetar, ia memindahkan udara di sekitarnya, menciptakan suara yang Anda dengarkan. Semakin banyak perpindahan udara, semakin tinggi volume yang dihasilkan. Perpindahan udara ini juga membantu menciptakan respons bass yang realistis. </p> <p> Driver dinamis sangat bagus dalam menghasilkan frekuensi rendah, yang pada volume yang lebih keras dapat mengakibatkan distorsi harmonik yang tidak terdengar bagus di telinga kita. Driver ini tidak semuanya buruk, karena murah untuk diproduksi, menghasilkan headphone yang lebih murah bagi konsumen, serta lebih mudah untuk dinyalakan. Tidak semua driver dinamis dibuat sama, karena kualitas suaranya dapat berbeda tergantung pada rumah dan bahan yang digunakan. </p> <h3 id=\"balanced-armature-drivers\"> Driver Armature Seimbang </h3> <p> <img alt=\"Apple wired earbuds, which use a balanced armature driver\" src=\"images/apple-wired-earbuds-which-use-a-balanced-armature-driver-119.jpg\" loading=\"lazy\"> </p> <p> <strong> Driver angker seimbang </strong> kecil dan ditemukan terutama di earbud. Driver ini terdiri dari lengan di dalam kumparan dengan dua magnet di kedua sisinya. Ini memungkinkan lengan berputar ke arah magnet mana pun, menjadi seimbang, dan menggerakkan diafragma untuk menghasilkan suara. Karena cara kerja driver, itu tidak memindahkan udara seperti driver dinamis, yang mengakibatkan kurangnya bass. </p> <p> Driver angker yang seimbang juga tidak memiliki ventilasi udara tambahan yang membantu isolasi suara yang lebih baik. Seperti halnya setiap driver, kualitas suara dapat bervariasi berdasarkan bagaimana earbud dirancang di dalam dan luar. Beberapa produsen bahkan dapat menambahkan driver dinamis untuk menciptakan suara yang lebih kaya dengan respons bass yang lebih baik. </p> <p> </p> <h3 id=\"planar-magnetic-drivers\"> Driver Magnetik Planar </h3> <p> <img alt=\"Open Back Headphones using Planar Magnetic Drivers\" src=\"images/open-back-headphones-using-planar-magnetic-drivers-408.jpg\" loading=\"lazy\"> </p> <p> <strong> Driver magnetik planar </strong> biasanya ditemukan di headphone open-back dan biasanya dijual dengan harga lebih tinggi daripada driver dinamis. Alih-alih menggunakan kumparan suara, driver magnetik planar mencoba menggetarkan diafragma secara merata dari magnet di kedua sisi untuk menghasilkan suara. Karena driver ini menggunakan magnet yang lebih besar atau lebih banyak untuk menggetarkan diafragma secara merata, headphone ini cenderung sedikit lebih berat. </p> <p> Headphone open-back juga memiliki lebih banyak kebocoran suara daripada sepasang headphone closed-back normal yang menggunakan driver dinamis, karena driver sepenuhnya terbuka tanpa ada yang menutupinya. Ini membuat mereka bukan pilihan terbaik untuk mendengarkan musik di depan umum; Namun, mereka fantastis untuk digunakan di rumah karena alasan ini. </p> <p> Lebih banyak kebocoran suara terjadi karena lebih banyak perpindahan udara, memberi Anda suara yang lebih penuh dengan respons bass yang sangat baik, menjadikannya sempurna untuk penggunaan di rumah. </p> <h3 id=\"electrostatic-drivers\"> Driver Elektrostatik </h3> <p> <img alt=\"Open Back Headphones That Require an Amplifier\" src=\"images/open-back-headphones-that-require-an-amplifier-271.jpg\" loading=\"lazy\"> </p> <p> <strong> elektrostatik </strong><strong> pengemudi </strong> lebih jarang karena harga tinggi dan penggunaan khusus dan ditemukan terutama di headphone open-back. </p> <p> Driver ini menggunakan listrik statis untuk membantu menghasilkan suara. Diafragma ditarik maju mundur di antara dua pelat konduktif yang bermuatan berlawanan, memungkinkan perubahan sinyal listrik secara terus-menerus, menghasilkan suara yang bebas dari distorsi. Mirip dengan driver magnetik planar, desain ini juga memungkinkan perpindahan udara yang lebih banyak, membuat pendengar mendapatkan bass yang terdengar lebih baik. </p> <p> Karena cara kerja driver elektrostatik, mereka memerlukan sinyal tegangan tinggi, mengharuskan Anda untuk menggunakannya dengan amplifier. Sinyal ini tidak dapat dicapai di sebagian besar jack headphone kelas konsumen, serta bahkan beberapa amplifier profesional. Untuk menggunakan headphone dengan driver elektrostatik, Anda memerlukan amplifier elektrostatik, yang sangat mahal. </p> <p> </p> <p> Meskipun driver elektrostatik memberi Anda tingkat suara yang sangat baik dengan sedikit distorsi, Anda lebih baik menggunakan sepasang headphone open-back lain yang menggunakan driver magnetik planar. Ini akan memberi Anda pengalaman mendengarkan yang serupa dengan driver elektrostatik tetapi akan lebih murah dan lebih mudah untuk digunakan. </p> <p> </p> <h2 id=\"which-headphone-driver-should-you-get\"> Driver Headphone Mana yang Harus Anda Dapatkan? </h2> <p> <img alt=\"Razer Gaming Headphones\" src=\"images/razer-gaming-headphones-992.jpg\" loading=\"lazy\"> </p> <p> Headphone dibuat untuk banyak jenis orang yang berbeda. Jika Anda seorang musisi yang hanya menggunakan headphone di rumah saat mencampur audio, mungkin Anda harus menggunakan sepasang headphone open-back dengan driver magnetik planar. </p> <p> Jika Anda seorang pelari, mendapatkan sepasang headphone open-back besar mungkin bukan pilihan terbaik untuk Anda. Di situlah earbud dengan driver angker seimbang yang kecil tapi terdengar bagus akan berguna. Ada sepasang headphone yang terdengar cemerlang di luar sana yang dibuat khusus untuk Anda. Sekarang saatnya untuk menemukan mereka. </p>"}