{"title":"Apple Memperbaiki Bug Penginstal MacOS Big Sur yang Dapat Mengakibatkan Kehilangan Data","content":"<p> Apple telah memperbaiki bug kritis di penginstal macOS Big Sur yang biasanya memunculkan pesan kesalahan saat mencoba memutakhirkan Mac tanpa tersedia ruang penyimpanan yang diperlukan. </p> <p> Pembaruan macOS Big Sur 11.2.1 yang direvisi, sekarang tersedia di <a href=\"https://apps.apple.com/app/macos-big-sur/id1526878132?mt=12\" target=\"_blank\" rel=\"nofollow noopener\"> Toko Aplikasi Mac </a> , memeriksa dengan benar apakah Anda memiliki cukup ruang kosong sebelum penginstalan dimulai, kata Mr. Macintosh pada <a href=\"https://twitter.com/ClassicII_MrMac/status/1361428354306633728\" target=\"_blank\" rel=\"nofollow noopener\"> Indonesia </a> . </p> <p> macOS Big Sur memerlukan 35 gigabyte ruang penyimpanan gratis di disk mulai komputer Anda, tidak termasuk penginstal 13 gigabyte itu sendiri. </p> <p> Ini tidak mungkin terjadi lebih cepat karena salah satu konsekuensi dari penginstal yang rusak adalah potensi kehilangan data. Untuk orang-orang yang belum mengembangkan kebiasaan secara teratur <a href=\"https://www.makeuseof.com/how-to-back-up-mac/\" target=\"_blank\" rel=\"nofollow noopener\"> mencadangkan Mac mereka dengan Time Machine </a> , bug yang cukup mendasar ini berpotensi memiliki konsekuensi yang mengerikan. </p> <h2 id=\"how-to-install-the-new-update\"> Cara Memasang Pembaruan Baru New </h2> <p> Pembaruan baru tersedia melalui <strong> Preferensi Sistem &gt; Pembaruan Perangkat Lunak </strong> di Mac Anda. Jika ada pembaruan yang tersedia, menekan tombol &quot;Perbarui Sekarang&quot; akan menginstalnya. Anda mungkin diminta untuk memasukkan kata sandi administrator Anda. </p> <p> Anda tidak akan melihat pembaruan jika versi macOS Big Sur 11.2.1 yang direvisi sudah diinstal di komputer Anda. Installer yang direvisi membawa nomor build &quot;20D75&quot;. Untuk melihat nomor build perangkat lunak macOS Big Sur yang diinstal di Mac Anda, klik menu Apple dan pilih opsi berlabel &quot;About This Mac&quot;. </p> <p> </p> <p> Dengan jendela About This Mac terbuka, klik tab &quot;Overview&quot;. Anda akan melihat nama perangkat lunak sistem operasi macOS di komputer Anda, diikuti dengan nomor versinya. Untuk mengungkapkan nomor build juga, cukup klik nomor versi. </p> <p> Anda dapat melihat versi macOS mana yang terbaru dalam dokumen dukungan di <a href=\"https://support.apple.com/HT201260\" target=\"_blank\" rel=\"nofollow noopener\"> Situs web Apple </a> . </p> <p> </p> <h2 id=\"big-sur-s-broken-free-space-check\"> Pemeriksaan Ruang Bebas Rusak Big Sur </h2> <p> Masalah ini baru-baru ini terungkap berkat Mr. Macintosh, yang awalnya melaporkan masalah tersebut. Publikasi tersebut menemukan bahwa pembaruan Big Sur akan diunduh tanpa hambatan, tetapi menolak untuk memulai karena &quot;Terjadi kesalahan saat menyiapkan pembaruan perangkat lunak&quot;. </p> <p> Masalah ini dikaitkan dengan kesalahan dalam pemeriksaan ruang kosong Big Sur. Mr Macintosh mengatakan orang-orang telah mengeluh tentang ini sejak versi publik pertama dari macOS Big Sur keluar pada November 2020. Setelah publikasi tersebut memberi tahu Apple tentang masalah ini, perusahaan telah bergerak cepat untuk menghilangkan bug jahat tersebut. </p> <p> </p> <p> &quot;Upgrade akan dimulai meskipun Anda hanya memiliki 1% ruang kosong yang tersisa dan akan gagal,&quot; <a href=\"https://mrmacintosh.com/big-sur-upgrade-not-enough-hd-space-serious-issue-possible-data-loss/\" target=\"_blank\" rel=\"nofollow noopener\"> posting </a> menjelaskan. Dan dengan drive pengaktifan hampir 100 persen penuh, penginstal akan terjebak dalam boot loop tanpa akhir yang mencoba menyelesaikan prosedur penginstalan. </p> <p> &quot;Ini membuat Anda tidak dapat mengakses data Anda,&quot; Mr. Macintosh memperingatkan. </p> <p> Satu-satunya cara untuk memperbaikinya diperlukan menghapus dan menginstal ulang perangkat lunak macOS. Namun dengan pembaruan yang direvisi sekarang tersedia di Mac App Store, pemilik Mac dapat menjalani kehidupan sehari-hari mereka tanpa khawatir apakah memperbarui ke Big Sur dapat menghapus disk mulai mereka. </p>"}