{"title":"Browser Edge Microsoft Menjadi Tuan Rumah Emulator Game Nintendo Rahasia","content":"<p> Microsoft telah menghapus serangkaian emulator game ilegal yang bersembunyi di toko ekstensi browser Microsoft Edge. Toko ekstensi Microsoft Edge menjadi tuan rumah bagi puluhan emulator, yang memungkinkan pengguna memainkan beberapa game ikonik, tidak ada yang diposting ke toko secara legal. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft Menghapus Emulator Ekstensi Tepi Ilegal </h2> <p> Bersembunyi di toko ekstensi Microsoft Edge adalah beberapa game paling ikonik sepanjang masa, termasuk Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2, dan bahkan Minecraft. Setiap game diluncurkan dalam browser di jendela emulator dan memungkinkan pengguna untuk memainkan setiap judul secara penuh. </p> <p> Namun, tidak ada judul klasik yang mencantumkan pengembang game resmi, seperti Nintendo, Sega, Atari, dan ya—bahkan Microsoft. Nama pengembang yang terdaftar termasuk Gamelands, Kday, dan StayReal, semuanya sepenuhnya fiktif dan tidak memiliki tautan ke pengembang aslinya. </p> <p> Anehnya, akun Twitter resmi Microsoft Edge Development, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , diposting tentang emulator, muncul untuk mempromosikan game yang tersedia di toko ekstensi browser. Kami tidak menangkap tweet asli yang mempromosikan emulator, tetapi salinannya tersedia melalui <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Reseter </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> Apakah Emulator Ilegal? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Emulator memungkinkan Anda menjalankan perangkat lunak yang berbeda </a> di komputer Anda. Anda juga dapat menggunakan emulator untuk memainkan game lama. </p> <p> Meskipun emulator itu sendiri tidak ilegal, mengunduh konten hak cipta untuk dimainkan di emulator adalah tindakan ilegal. Tweet dari akun resmi Microsoft Edge Development adalah langkah aneh karena emulator mengunduh salinan baru ROM game untuk dimainkan pengguna. </p> <p> Topik pengabaian juga merupakan area abu-abu. Game Abandonware tidak lagi dipublikasikan dan tidak lagi tersedia untuk dijual online atau di toko. Namun, dalam banyak kasus, hak cipta pada game ini belum kedaluwarsa, tetapi pemegang hak cipta tidak secara aktif menegakkan haknya. </p> <p> </p> <p> Dalam banyak kasus, pengabaian perangkat lunak adalah ilegal. Namun, tidak ada kasus pengadilan yang berkaitan dengan pengabaian, atau setidaknya tidak ada yang berkaitan dengan pengembang game lama yang menuntut seseorang karena mengunduh judul pengabaian. </p> <p> Dalam contoh yang tepat ini, emulasi game-game lama ini di dalam browser web adalah ilegal. Selain itu, Nintendo terkenal karena menghapus situs atau layanan apa pun yang mencoba mereplikasi atau mendistribusikan ulang kekayaan intelektualnya. </p> <p> Saat ini, game telah dihapus dari toko ekstensi Microsoft Edge. Selain itu, belum diketahui bagaimana game yang diemulasi itu berakhir di toko ekstensi atau siapa yang menempatkannya di sana. Tak perlu dikatakan, mereka tidak mungkin kembali. </p>"}