{"title":"Bagaimana Menjaga Data Pribadi Anda Aman Dari Pengusaha","content":"<p> Teknologi pengawasan merajalela di dalam dan di luar kantor. Banyak perusahaan menggunakan produk pengelolaan seluler untuk perangkat yang dikeluarkan perusahaan seperti ponsel, laptop, dan tablet. Ini berisi program yang dirancang untuk melindungi bisnis dari pencurian, spionase perusahaan, atau niat jahat. </p> <p> Namun, meskipun semua ini bagus untuk melindungi perusahaan Anda, itu bukan yang terbaik untuk Anda. Ini bukan lagi pertanyaan tentang <strong> jika </strong> perusahaan Anda melacak Anda; berikutnya yang perlu Anda tanyakan adalah, berapa banyak data yang benar-benar dapat ditemukan oleh perusahaan? Anehnya, banyak. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> Apa yang Dapat Dilihat Pengusaha di Wi-Fi Perusahaan dan Perangkat Jarak Jauh? </h2> <p> Kebanyakan orang tidak menyadari sejauh mana perusahaan memiliki akses ke data mereka atau seberapa banyak yang mereka masuki saat menggunakan perangkat perusahaan. Berikut adalah beberapa contoh. </p> <h3 id=\"location\"> Lokasi </h3> <p> Banyak karyawan berpikir bahwa menggunakan Virtual Private Network (VPN) cukup untuk membuat atasan mereka percaya bahwa mereka berada di tempat yang seharusnya. </p> <p> Meskipun ada cara untuk menyembunyikan lokasi Anda yang sebenarnya di perangkat pribadi, itu tidak sepenuhnya mudah, terutama saat masuk ke aplikasi atau situs web apa pun dengan alamat email atau nomor ponsel yang dikeluarkan perusahaan. </p> <p> </p> <p> Hampir tidak mungkin menyembunyikan lokasi Anda yang sebenarnya saat menggunakan perangkat yang dikeluarkan perusahaan. Misalnya, perusahaan telekomunikasi dapat mendeteksi saat Anda telah terhubung ke salah satu partner roaming mereka. </p> <p> Selain itu, VPN perusahaan berbeda dari VPN komersial dengan gateway yang dipantau oleh tim TI internal. </p> <h3 id=\"notes-documents-and-emails\"> Catatan, Dokumen, dan Email </h3> <p> Jika Anda berpikir tidak ada yang tahu bahwa Anda telah menggunakan Wi-Fi perusahaan untuk menemukan pekerjaan Anda berikutnya, Anda salah. Meskipun Anda tidak menggunakan alamat email perusahaan, banyak bisnis yang memiliki program yang telah diinstal sebelumnya di laptop perusahaan yang menyertakan log aktivitas waktu nyata, pembaruan riwayat penjelajahan, dan tangkapan layar dokumen dan email yang dibuka dengan waktu. </p> <p> Dengan alasan untuk melindungi dari kemungkinan pelanggaran data, banyak perusahaan juga menggunakan ini sebagai mekanisme pelaporan atau pelacak produktivitas. </p> <p> </p> <h3 id=\"online-messaging-history\"> Riwayat Pesan Online </h3> <p> Terlepas dari munculnya platform terenkripsi, kenyataannya pesan Anda tidak sepenuhnya pribadi di perangkat perusahaan. Saat menggunakan platform perpesanan, perusahaan mungkin tidak dapat melihat detail pasti dari pertukaran Anda, tetapi kemungkinan masih dapat mengenali metadata ukuran dan jenis file tersebut. </p> <p> Dengan ini, jika Anda memutuskan untuk mengirim PDF berukuran besar melalui aplikasi seperti WhatsApp, sistem deteksi penyusupan perusahaan Anda kemungkinan akan menandai Anda untuk perilaku yang mencurigakan. Sejalan dengan pedoman perusahaan, mereka mungkin meminta Anda untuk membuktikan bahwa tindakan Anda tidak berbahaya dan mungkin perlu meminta persetujuan dari pimpinan untuk izin. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> Cara Menghindari Berbagi Data Pribadi Dengan Majikan Anda </h2> <p> Tidak ada cara mutlak untuk menjaga informasi pribadi, percakapan, dan aktivitas Anda sepenuhnya di luar jangkauan setiap saat. Namun, ada beberapa cara yang dapat Anda lakukan untuk mengurangi risiko tersebut. </p> <p> Kami tidak mendukung penyembunyian data dari perusahaan Anda; pada kenyataannya, mereka memiliki hak untuk mengumpulkan informasi tentang karyawan mereka—bahkan menjadi <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> dapat melacak Anda secara legal </a> . Tetapi Anda perlu tahu kapan waktu yang tepat untuk menyimpan sesuatu untuk diri sendiri, dan itu tergantung pada masing-masing perusahaan. </p> <h3 id=\"read-company-policies\"> Baca Kebijakan Perusahaan </h3> <p> Sebelum Anda dapat berdebat tentang transparansi data, Anda juga harus memahami jenis informasi yang Anda berikan secara sadar kepada atasan Anda dengan bekerja untuk mereka. Hanya ketika Anda tahu apa yang diharapkan, Anda dapat menetapkan batasan profesional yang sesuai. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Bertujuan untuk memahami kebijakan dan prosedur pengumpulan data perusahaan sebelum dikumpulkan. Dari sana, Anda dapat secara efektif membuat rencana untuk tidak memberikan lebih banyak informasi daripada yang diperlukan. </p> <h3 id=\"use-personal-gadgets\"> Gunakan Gadget Pribadi </h3> <p> Meskipun selalu tergoda untuk menggunakan perangkat perusahaan untuk menghemat uang, kenyataannya, tidak ada yang benar-benar gratis. Investasikan pada laptop, ponsel, dan tablet untuk penggunaan pribadi. </p> <p> Memiliki perangkat pribadi yang terpisah juga merupakan cara yang bagus untuk menetapkan batasan, terutama saat bekerja dari jarak jauh. </p> <p> Menggunakan perangkat Anda sendiri memberi Anda kemampuan untuk membuat dan mengelola berbagai praktik keamanan yang diperlukan untuk menjaga data Anda aman dari pengintaian. Ini mungkin tampak seperti pengeluaran yang tidak perlu, tetapi itu sangat membantu untuk menjaga ketenangan pikiran Anda. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Gunakan Profil Tamu di Perangkat Pribadi </h3> <p> Menghubungkan ke jaringan apa pun yang bukan milik Anda selalu merupakan risiko keamanan, bahkan jika itu di tempat kerja. Masuk ke Wi-Fi perusahaan memberi perusahaan Anda izin untuk mengakses semuanya, mulai dari metadata pesan Anda hingga log riwayat penelusuran. </p> <p> Jika Anda benar-benar perlu menggunakan laptop pribadi Anda di jaringan perusahaan, Anda dapat memilih untuk menggunakan profil tamu untuk mengurangi jumlah data yang dapat mereka akses dari jarak jauh. Atau, Anda dapat terhubung dengan paket data ponsel pribadi Anda atau perangkat Wi-Fi portabel. </p> <h3 id=\"keep-your-passwords-safe\"> Jaga Kata Sandi Anda Aman </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Membuat kata sandi yang kuat </a> tidak cukup. Anda perlu memastikan bahwa kata sandi Anda tidak disimpan di perangkat perusahaan. Menyimpan sandi pribadi untuk akun perbankan online, email pribadi, atau situs web pemerintah di gadget yang tidak Anda miliki dapat membahayakan data Anda jika database perusahaan Anda disusupi. </p> <p> Gunakan hanya ponsel atau laptop pribadi Anda untuk mengakses akun penting, terutama yang melibatkan uang. Jika memungkinkan, aktifkan autentikasi dua faktor. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> Pisahkan Pekerjaan dan Kehidupan Pribadi Anda </h2> <p> Majikan memiliki hak untuk mengakses perangkat yang dikeluarkan perusahaan Anda dari jarak jauh jika mereka mencurigai Anda berpartisipasi dalam segala bentuk aktivitas ilegal, membahayakan informasi perusahaan, atau diminta oleh penegak hukum untuk penyelidikan. </p> <p> Namun, ini berbeda dengan perangkat pribadi. </p> <p> Keamanan Anda hanya sekuat orang-orang yang berhubungan dengan Anda—termasuk majikan Anda. Memisahkan perangkat pribadi dan perangkat kerja Anda hanyalah satu langkah menuju desentralisasi data Anda. Dengan mempraktikkan tindakan keamanan yang kuat, Anda dapat membatasi jumlah titik akses yang dimiliki peretas ke dokumen, email, dan jaringan. </p> <p> Desentralisasi data pribadi diperlukan karena melindungi Anda, sebagai individu, dan perusahaan Anda dari pencurian, penipuan, dan bentuk kejahatan dunia maya lainnya. </p>"}