{"title":"BitPay Membawa Bitcoin ke Apple Pay","content":"<p> Pengguna BitPay di AS sekarang dapat menambahkan kartu bitcoin prabayar mereka ke aplikasi Wallet Apple dan <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> gunakan untuk membayar berbagai hal dengan Apple Pay </a> . Pelanggan non-Apple akan segera dapat menambahkan kartu BitPay bermerek MasterCard mereka ke Google Pay dan Samsung Pay. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> Cara Menambahkan Kartu BitPay Anda ke Apple Wallet </h2> <p> Untuk menambahkan kartu BitPay ke perangkat Apple, buka aplikasi Wallet di iPhone Anda dan ketuk &quot;+&quot; di pojok kanan atas, lalu ikuti petunjuk di layar untuk menyelesaikan penambahan kartu. </p> <p> Dengan BitPay di aplikasi Wallet, Anda dapat menambahkan kartu ke Apple Pay dengan membuka <strong> Pengaturan &gt; Dompet &amp; Apple Pay </strong> , lalu ketuk opsi berlabel &quot;Tambah Kartu&quot;. Untuk menjadi pengguna BitPay dan memesan kartu prabayar Anda, unduh aplikasi BitPay Wallet dari <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> Toko aplikasi </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Cara Baru Berbelanja Dengan Apple Pay </h2> <p> Sebuah postingan di <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog BitPay </a> mengatakan menambahkan kartu BitPay ke Apple Pay adalah cara yang nyaman untuk membelanjakan mata uang kripto di lebih banyak tempat daripada sebelumnya. &quot;Kami memiliki ribuan pelanggan aplikasi BitPay Wallet yang menggunakan Kartu BitPay yang selalu mencari tempat dan cara baru untuk membelanjakan kripto mereka,&quot; kata CEO BitPay Stephen Pair dalam <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> jumpa pers </a> . </p> <p> </p> <p> Dengan Apple Pay, pemegang kartu BitPay dapat melakukan pembelian nirsentuh yang aman di toko fisik, app yang mendukung Apple Pay, dan di web. Perusahaan mencatat bahwa pelanggan yang menunggu pengiriman kartu plastik dapat menambahkan mitra virtualnya ke Apple Wallet melalui aplikasi resmi BitPay Wallet. Melakukannya akan memungkinkan Anda untuk mulai membelanjakan segera. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> Apa Itu Kartu BitPay? </h2> <p> Kartu prabayar yang menggunakan jaringan Mastercard, kartu BitPay memudahkan pembayaran nirsentuh dan pembayaran PIN, serta menarik uang tunai dari ATM mana pun yang kompatibel. Dengan aplikasi ini, pelanggan dapat melakukan hal-hal seperti melihat saldo mereka, meminta PIN baru, mengisi ulang secara instan, serta mengonversi cryptocurrency menjadi mata uang fiat (yang kemudian dimuat ke dalam kartu, siap digunakan di mana saja debit Mastercard diterima secara global). </p> <blockquote> <p> Untuk pengguna power blockchain, aplikasi BitPay Wallet mendukung serangkaian opsi untuk membeli dan menyimpan crypto dan melakukan pembayaran online. Pengguna dapat langsung membeli kartu hadiah dari ratusan pengecer top di toko dan online. </p> </blockquote> <p> Kartu tersebut memiliki chip EMV dan dapat dikunci jika terjadi keadaan darurat dengan aplikasi. </p> <p> Menurut perusahaan, dukungan untuk Google Pay dan Samsung Pay direncanakan untuk &quot;akhir kuartal ini.&quot; Adapun aplikasi BitPay, saat ini mendukung Bitcoin, Bitcoin Cash, dan Ether, serta stablecoin yang dipatok empat dolar, USDC, GUSD, PAX, dan cryptocurrency BUSD. </p>"}