{"title":"Cara Mengakses Statistik Gameplay PS4 dan PS5 Anda untuk tahun 2020","content":"<p> Sony telah meluncurkan PlayStation Wrap-Up, yang memungkinkan Anda merenungkan perjalanan PlayStation Anda selama setahun terakhir. </p> <p> Kami akan memberi tahu Anda cara mengakses pengalaman ini dan membuat Anda mengetahui beberapa persyaratan. </p> <h2 id=\"what-is-playstation-wrap-up\"> Apa Itu PlayStation Wrap-Up? </h2> <p> Seperti yang kami laporkan, <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation Wrap-Up adalah ringkasan tahun terakhir Anda bermain game </a> . </p> <p> Ini adalah halaman yang dipersonalisasi yang merinci kebiasaan bermain PS4 dan PS5 Anda, termasuk berapa banyak game yang telah Anda mainkan, berapa lama waktu yang Anda habiskan untuk memainkannya, dan berapa banyak trofi yang Anda peroleh selama ini. </p> <p> Anda juga bisa mendapatkan tema dinamis gratis yang menampilkan bentuk PlayStation. Yang membingungkan, ini hanya tersedia untuk PS4 dan bukan PS5 yang baru dirilis. </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> Cara Mengakses Pembungkus PlayStation </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> Untuk melihat laporan Anda, buka <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> Situs web PlayStation Wrap-Up </a> . Anda harus masuk ke akun Sony Anda, jika belum. Setelah Anda berada di halaman, Anda dapat menggulir ke bawah untuk melihat statistik Anda dan menebus tema PS4. </p> <p> Pengalaman Wrap-Up hanya akan tersedia hingga 2 Maret 2021. Karena itu, jangan tunda lagi jika Anda ingin ikut serta. </p> <p> Ada syarat yang harus Anda penuhi untuk menggunakan PlayStation Wrap-Up: </p> <ul> <li> Memiliki akun PSN terdaftar di wilayah Anda. </li> <li> Berusia 18 tahun ke atas. </li> <li> Telah bermain game minimal 10 jam di konsol PS4 antara 1 Januari 2020 hingga 31 Desember 2020. </li> </ul> <p> Selain itu, pengguna di Eropa, Timur Tengah, Afrika, Australia, India, dan Rusia harus mengaktifkan koleksi collection <strong> Data tambahan </strong> . Anda dapat mengaktifkan ini di PS4 melalui <strong> Pengaturan </strong> &gt; <strong> Data Perangkat/Kesehatan &amp; Keselamatan </strong> &gt; <strong> Data Perangkat </strong> . </p> <p> Akhirnya, Anda bisa mendapatkan email yang berisi PlayStation Wrap-Up Anda. Namun, Anda harus memilih untuk menerima email pemasaran, yang dapat Anda lakukan melalui <strong> Pengaturan Notifikasi </strong> di akun PSN Anda. </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> Akankah Ada Penutupan 2021? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> Ini adalah tahun kedua berturut-turut Sony menjalankan pengalaman Wrap-Up. Karena hanya menganalisis data tahun 2020, ia memiliki lebih banyak fokus PS4. </p> <p> Semoga Sony akan melakukannya lagi tahun depan, ketika PS5 sudah keluar lebih lama dan lebih banyak game dirilis. </p>"}