{"title":"Cara Membuat atau Mengedit Pola di Adobe Illustrator","content":"<p> Buat pola di Adobe Illustrator, dan Anda dapat dengan cepat menerapkannya ke bentuk, goresan, dan bahkan teks. Anda dapat membuat sesuatu yang sederhana, seperti pola titik-titik, atau melakukan sesuatu yang lebih kompleks. Anda bahkan dapat menggunakan bagian dari grafik vektor yang ada, dan mengubahnya menjadi pola juga. </p> <p> Pola sangat bagus untuk latar belakang, tekstur, dan banyak lagi. Berikut cara menggunakan alat pola Illustrator, dan cara membuat dan mengedit pola Anda sendiri. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Menggunakan Pola Default di Adobe Illustrator </h2> <p> Illustrator hadir dengan beberapa pola yang dibangun langsung ke dalamnya. Selain berguna dalam hak mereka sendiri, mereka juga merupakan cara yang baik untuk melihat bagaimana pola bekerja. Pola-pola ini juga akan memberi Anda gambaran tentang cara menggunakan pola Anda sendiri setelah Anda membuatnya. </p> <p> </p> <p> Anda dapat menemukan pola di jendela Swatch Anda. Jika belum terbuka, buka <strong> Jendela &gt; Swatch </strong> dari menu atas. Selain warna solid, mungkin sudah ada beberapa pola di jendela Swatch Anda—tetapi ini bukan satu-satunya pola yang dimiliki Illustrator. </p> <p> Klik <strong> Perpustakaan Swatch </strong> ikon di kiri bawah jendela Swatch Anda. Arahkan kursor ke atas <strong> Pola </strong> , lalu pilih salah satu pustaka contoh pola. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Anda sekarang dapat menerapkan contoh ini seperti yang Anda lakukan dengan warna solid. Di sini, Anda dapat melihat pola dari <strong> Alam_Dedaunan </strong> perpustakaan diterapkan sebagai mengisi dan stroke, serta teks. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> Cara Membuat Pola Pengulangan Dasar di Illustrator </h2> <p> Anda dapat mengubah vektor apa pun menjadi pola, apakah itu sesuatu yang telah Anda rancang atau sesuatu yang Anda buat dengan tujuan khusus ini. Anda dapat melakukannya dengan seluruh grafik vektor, satu lapisan, atau apa pun di antaranya. </p> <p> Yang harus Anda lakukan adalah memilih apa yang ingin Anda ubah menjadi pola, lalu seret ke jendela Swatch. Misalnya, Anda dapat menyeret mata kucing ini ke Swatch Anda. Itu akan membuat carikan pola, yang kemudian bisa Anda gunakan untuk mengisi persegi panjang atau bentuk lainnya. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> Atau, Anda dapat melakukan hal yang sama dengan seluruh vektor. Dalam kedua kasus, Illustrator akan membuat pola dari apa pun yang Anda seret ke jendela Swatch. Anda cukup menerapkan swatch seperti yang Anda lakukan dengan swatch warna normal. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Jika Anda mengklik dua kali carikan pola Anda di jendela Swatch, itu akan membuka open <strong> Pilihan Pola </strong> jendela. Anda juga dapat membuka ini langsung dari <strong> Windows &gt; Opsi Pola </strong> di menu atas. </p> <p> Di sini, Anda dapat mengedit lebih lanjut pola Anda, termasuk bagaimana pola itu berulang dan seberapa besar jarak antara setiap iterasi gambar Anda. Anda juga mengedit desain pola Anda langsung di sini. Versi gambar yang tidak redup dapat diedit seperti biasa. Anda dapat mengubah warna, memindahkan lapisan, dan sebagainya. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> Ada berbagai hal yang dapat Anda lakukan dengan jendela Pattern Options. Anda dapat, misalnya, mengulangi gambar Anda dalam tata letak batu bata yang terhuyung-huyung, dan mengurangi celah di antara setiap bagian pola. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> Satukan bagian-bagian pola Anda cukup dekat, dan Anda bisa membuatnya tumpang tindih. Dengan demikian, Anda dapat membuat semacam pola ubin seperti yang ditunjukkan di bawah ini. Cobalah semua pengaturan tumpang tindih yang berbeda di Opsi Pola untuk menemukan sesuatu yang cocok untuk Anda. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> Cara Membuat Pola Mulus di Adobe Illustrator </h2> <p> Jika Anda ingin membuat pola geometris yang mulus, Anda perlu memastikan ada simetri di seluruh desain Anda. Misalnya, garis yang dimulai 10px di sisi kiri pola Anda harus berakhir 10px di sisi kanan. Ketika berulang, poin-poin itu perlu digabungkan. </p> <p> Untuk melakukan ini, buat dokumen baru dengan dimensi persegi. Aktifkan hamparan kisi dengan menekan <strong> Ctrl + &quot; </strong> ( <strong> cmd + &quot; </strong> di Mac). Smart Guides juga berguna—aktifkan dengan <strong> Ctrl + U </strong> ( <strong> Cmd + U </strong> di Mac). Jika penggaris Anda tidak terlihat, tekan <strong> Ctrl + R </strong> ( <strong> Cmd + R </strong> di Mac) untuk mengaktifkannya. </p> <p> Anda juga dapat menemukan pengaturan ini di bawah <strong> Melihat </strong> di menu atas, tetapi kami sarankan menggunakan <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Tombol pintas Illustrator </a> di mana Anda bisa menghemat waktu. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Letakkan desain Anda di alun-alun. Setiap bagian yang melewati tepi harus berbaris di sisi lain. Itu <strong> Meluruskan </strong> alat ( <strong> Jendela &gt; Sejajarkan </strong> ) dapat membantu Anda menyelaraskan satu sama lain dengan benar. Klik dan seret dari penggaris untuk membuat panduan Anda sendiri di mana Anda membutuhkannya. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> Sangat penting untuk memiliki warna latar belakang juga, meskipun itu putih. Pastikan ini pas dengan tepi artboard karena Anda membutuhkannya untuk memangkas bahan yang berlebihan. </p> <p> Pilih semuanya dengan <strong> Ctrl + A </strong> ( <strong> Cmd + A </strong> di Mac), lalu tekan <strong> Shift + M </strong> untuk mengaktifkan <strong> Pembuat Bentuk Shape </strong> alat. Ini juga dapat ditemukan di kotak peralatan. Menekan <strong> Alt </strong> ( <strong> Pilihan </strong> di Mac). Ini menempatkan <strong> Pembuat Bentuk Shape </strong> alat ke mode pengurangan. </p> <p> Saat Anda mengarahkan kursor ke bagian desain Anda dengan alat ini, Anda akan melihatnya sedikit berubah warna. Klik pada area yang tidak Anda inginkan, dan Illustrator akan menghapus bagian-bagian itu, hanya menyisakan bit yang tumpang tindih dengan kotak latar belakang. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> Setelah selesai, pilih semuanya dan seret ke dalam contoh Anda untuk mengubahnya menjadi pola. Untuk menggunakan pola Anda dalam dokumen baru, Anda dapat menyimpannya ke perpustakaan swatch atau menggunakan Perpustakaan Adobe Cloud Anda. </p> <p> Atau, Anda juga dapat menyalinnya dari jendela Swatch ini, dan menempelkannya ke jendela Swatch lain pada dokumen yang berbeda. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Anda sekarang dapat menerapkan pola ini seperti yang Anda lakukan dengan yang lain. Jika Anda melakukannya dengan benar, semuanya akan sejajar tanpa celah. Buat penyesuaian dalam dokumen pola Anda jika perlu. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> Kapan Anda Harus Menggunakan Pola di Adobe Illustrator? </h2> <p> Penggunaan pola yang paling jelas adalah membuat ubin berulang untuk latar belakang, tetapi Anda dapat menggunakannya untuk mengisi bentuk untuk memberi tekstur juga. Teks yang diisi pola adalah kegunaan lain yang baik dan dapat membuat tipografi Anda benar-benar menonjol. </p> <p> Jika mau, Anda bahkan dapat membuat pola sendiri secara manual, menyalin dan menempelkan gambar yang sama berulang kali. Mungkin ada saat-saat ketika Anda ingin melakukan itu, tetapi sebagian besar waktu, kemampuan Illustrator untuk mengotomatiskan pembuatan pola akan menjadi cara yang tepat. </p> <p> Ini hanyalah salah satu dari banyak cara Illustrator dapat membuat hidup Anda lebih mudah, memberi Anda lebih banyak waktu untuk mengerjakan desain Anda. </p>"}