{"title":"Cara Menghentikan Windows 10 Dari Memblokir File yang Anda Unduh","content":"<p> Saat Anda mencoba membuka file, Windows 10 mungkin mencegah Anda membukanya secara langsung. Ini akan menunjukkan kepada Anda peringatan keamanan bahwa file tersebut berasal dari sumber yang tidak dikenal dan mungkin tidak aman. Ini terjadi ketika fitur Windows 10 yang disebut Attachment Manager memblokir file yang dianggap tidak aman untuk PC Anda. </p> <p> Meskipun Anda dapat membuka blokir setiap file secara manual, ini bisa menjadi proses yang melelahkan—terutama jika Anda harus melakukannya untuk hampir setiap file yang Anda unduh. Pada artikel ini, kami akan menunjukkan kepada Anda bagaimana Anda dapat menghentikan Windows 10 memblokir file yang Anda unduh. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> Apa itu Pengelola Lampiran di Windows 10? </h2> <p> Di Windows 10, ada fitur keamanan yang disebut Attachment Manager yang memblokir Anda dari membuka file yang tidak aman. Ini bisa berupa file yang telah Anda unduh atau <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> file yang diidentifikasi Windows sebagai lampiran email yang tidak aman </a> . Jika Manajer Lampiran menganggap file tidak aman, itu akan mencegah Windows 10 membukanya dan menampilkan pesan peringatan. Manajer Lampiran mengklasifikasikan file yang Anda unduh berdasarkan jenis file dan ekstensi nama file. </p> <p> Windows Attachment Manager menggunakan antarmuka pemrograman aplikasi (API) IAttachmentExecute untuk menemukan jenis file, asosiasi file, dan untuk menentukan tindakan yang paling tepat untuk dilakukan. Saat Anda mengunduh file dan menyimpannya di disk Anda, Windows menambahkan metadata khusus ke file-file ini. Metadata ini dianggap sebagai lampiran. Saat Windows menambahkan metadata ke file unduhan sebagai lampiran, ini dikenal sebagai Informasi Zona. </p> <p> Sekarang, <strong> Informasi Zona </strong> adalah di mana akar masalahnya terletak. Ketika File Explorer membuka file, ia membaca informasi Zona terlampir yang disimpan di lokasi yang sama dan memeriksa untuk melihat apakah file tersebut berasal dari sumber yang tidak dikenal atau tidak. Jika Windows menemukan bahwa file tersebut tidak dikenali atau berasal dari sumber yang tidak dikenal, itu akan mencegah Anda untuk membukanya. </p> <p> Peringatan Windows SmartScreen akan muncul yang menyatakan: </p> <blockquote> <p> Windows SmartScreen mencegah aplikasi yang tidak dikenal untuk memulai. Menjalankan aplikasi ini dapat membahayakan PC Anda. </p> </blockquote> <p> Jika Anda ingin membuka file yang diblokir secara manual, klik kanan pada file yang diunduh, lalu pilih <strong> Properti </strong> . Di tab Umum, klik <strong> Buka blokir </strong> , klik <strong> Menerapkan </strong> lalu klik <strong> baik </strong> . </p> <p> Namun, bayangkan Anda harus melakukan ini setiap kali mengunduh file—yang dapat mengganggu dan menghabiskan waktu. Jika Anda sering mengunduh file dari internet atau menerima file sebagai lampiran email, Anda mungkin ingin menghentikan PC Anda memblokir file Anda sepenuhnya. </p> <p> Untuk menghentikan Windows 10 memblokir Anda dari membuka file Anda, Anda harus mencegahnya menambahkan Informasi Zona ke file yang Anda unduh. Anda dapat melakukan ini dengan mengonfigurasi Manajer Lampiran secara manual menggunakan Editor Kebijakan Grup Lokal atau Editor Registri. </p> <p> Kami akan memberikan langkah-langkah tentang bagaimana Anda dapat melakukan ini. Anda harus masuk sebagai administrator atau Anda harus <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> meminta hak administrator </a> untuk dapat menghentikan file yang diunduh agar tidak diblokir. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Konfigurasikan Manajer Lampiran Menggunakan Editor Registri </h2> <p> tekan <strong> Tombol Windows + R </strong> untuk membuka Peninjau Suntingan Registri. Dari sana, ketik &quot;Regedit&quot; dan klik <strong> Memasukkan </strong> . Prompt Kontrol Akun Pengguna akan muncul. Ketika prompt ini muncul, klik tombol <strong> Iya </strong> tombol untuk melanjutkan. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Arahkan ke kunci Lampiran di Editor Registri: <strong> HKEY_CURRENT_USER &gt; Perangkat Lunak &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; Kebijakan &gt; Lampiran </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> Jika kunci Lampiran tidak ada dalam kunci Kebijakan, Anda harus membuatnya. Untuk melakukan ini, klik kanan pada <strong> Kebijakan </strong> kunci, klik <strong> Baru </strong> , klik <strong> Kunci </strong> . Ini akan membuat kunci baru, yang kemudian harus Anda beri nama &quot;Lampiran&quot;. Jika Anda menemukan bahwa kunci Lampiran sudah ada, Anda dapat melompat ke langkah berikutnya. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> Klik kanan pada <strong> lampiran </strong> kunci, klik <strong> Baru </strong> lalu pilih <strong> Nilai DWORD (32-bit) </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Anda akan diminta untuk memberi nama nilai DWORD yang baru dibuat ini. Beri nama &quot;SaveZoneInformation&quot; dan klik <strong> Memasukkan </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> Terakhir, untuk menonaktifkan Manajer Lampiran di Windows 10, klik dua kali pada file yang baru dibuat <strong> SimpanZoneInformasi </strong> nilai dan ubah data nilainya menjadi 1. Klik <strong> baik </strong> menyelesaikan. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Saat Anda menyelesaikan langkah-langkah ini, tutup Peninjau Suntingan Registri dan mulai ulang komputer Anda untuk menerapkan perubahan. Mulai sekarang, file apa pun yang Anda unduh tidak akan lagi melampirkan Informasi Zona ke aliran data alternatif file. Ini akan memungkinkan Anda untuk membuka file Anda tanpa kesulitan. </p> <p> Jika Anda ingin kembali dan mengaktifkan Manajer Lampiran, Anda dapat melakukannya dengan menavigasi ke kunci Lampiran di Editor Registri: <strong> HKEY_CURRENT_USER &gt; Perangkat Lunak &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; Kebijakan &gt; Lampiran </strong> . Dari sini, di sisi kanan, klik dua kali pada <strong> SimpanZoneInformasi </strong> nilai dan ubah data nilainya menjadi 3. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Konfigurasikan Manajer Lampiran Menggunakan Editor Kebijakan Grup Lokal </h2> <p> Editor Kebijakan Grup Lokal hanya tersedia di edisi Windows 10 Enterprise, Education, dan Pro. Akibatnya, metode ini tidak berlaku jika Anda memiliki edisi Windows 10 Home. Jika PC Anda berjalan pada edisi Windows 10 Home, Anda harus mengonfigurasi Attachment Manager melalui Registry Editor. </p> <p> Jika Anda menggunakan edisi Windows 10 yang memiliki Editor Kebijakan Grup Lokal, Anda dapat mengonfigurasi Manajer Lampiran menggunakan langkah-langkah yang ditunjukkan di sini. </p> <p> Untuk memulai, tekan <strong> Tombol Windows + R </strong> , ketik &quot;gpedit.msc&quot;, dan klik <strong> Memasukkan </strong> untuk membuka Editor Kebijakan Grup Lokal. </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Navigasikan ke Manajer Lampiran: <strong> Konfigurasi Pengguna &gt; Template Administratif &gt; Komponen Windows &gt; Manajer Lampiran </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> Di panel kanan Manajer Lampiran, klik dua kali pada on <strong> Jangan simpan informasi zona dalam lampiran file </strong> kebijakan untuk mengedit pengaturan Informasi Zona. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> Sebuah jendela akan muncul di mana Anda dapat memilih apakah Manajer Lampiran harus atau tidak boleh menyimpan Informasi Zona. </p> <p> Klik <strong> Diaktifkan </strong> untuk mengizinkan Manajer Lampiran agar tidak menyimpan Informasi Zona. Ini akan memastikan bahwa Windows tidak memblokir file Anda setiap kali Anda membukanya. Klik <strong> Menerapkan </strong> tombol untuk menyimpan perubahan dan kemudian klik <strong> baik </strong> . </p> <p> Ketika Anda selesai, tutup Editor Kebijakan Grup Lokal dan reboot PC Anda untuk menyimpan perubahan. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows Tidak Akan Memblokir File Anda Lagi </h2> <p> Jika sebelumnya Anda harus secara manual membuka blokir sebagian besar file yang Anda unduh, Anda akan menyadari betapa melelahkannya proses itu. Setelah Anda menerapkan tips ini, Anda akan memiliki kebebasan untuk membuka semua file Anda dengan mudah. </p> <p> Jika Anda mengunduh file dan entah bagaimana meragukan kredibilitasnya, Anda selalu dapat membukanya di lingkungan terisolasi yang aman untuk memastikan bahwa PC dan data Anda aman. </p>"}