{"title":"Cara Mengubah PS5 Anda Dari Vertikal ke Horizontal (atau Sebaliknya)","content":"<p> PlayStation 5 berfungsi baik dalam pengaturan vertikal atau horizontal. Jika Anda berubah pikiran pada orientasi pilihan Anda, cukup mudah untuk memindahkan PS5 Anda dari vertikal ke horizontal (atau sebaliknya). </p> <p> Mari kita lihat cara memindahkan PS5 dengan aman dari orientasi vertikal ke horizontal di sisinya, dan kembali lagi. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> Pertama: Matikan dan Cabut PS5 Anda </h2> <p> Sebelum Anda melakukan pekerjaan apa pun secara fisik memindahkan PlayStation 5 Anda, penting untuk mematikannya dan mencabut semuanya. Ini akan mencegah kerusakan pada sistem yang dapat terjadi jika Anda memindahkannya saat dihidupkan. </p> <p> Anda harus mematikan PS5 Anda sepenuhnya. Untuk melakukannya, tekan tombol <strong> Tombol PS </strong> pada pengontrol Anda untuk membuka menu cepat di bagian bawah layar. Pilih <strong> Kekuasaan </strong> di sebelah kanan dan pilih <strong> Matikan PS5 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Tunggu hingga lampu konsol Anda mati, lalu cabut kabel daya, kabel HDMI, dan apa pun yang telah Anda sambungkan ke sistem. Sekarang Anda siap untuk mengubah orientasi PS5 Anda. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Lepaskan Sekrup Penyangga </h2> <p> Saat Anda mengatur PS5 secara vertikal, Anda harus mengeluarkan sekrup yang disertakan dari kompartemen di alas dan menggunakannya untuk mengamankan alas ke konsol saat dudukan vertikal. Akibatnya, melepas sekrup ini adalah langkah pertama Anda dalam mengubah orientasi konsol Anda. </p> <p> Balikkan perlahan PS5 Anda di sisinya sehingga Anda dapat mengakses dudukan di bagian bawah. Gunakan obeng pipih, koin, atau sejenisnya untuk melepaskan sekrup perak tunggal yang menahan alas ke sistem. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Setelah sekrup longgar, alasnya akan terlepas. Ada kompartemen kecil di bagian bawah tempat Anda dapat menyimpan sekrup. Pasang ke tempatnya di sana, lalu geser ke dalam lubang kecil agar tetap aman. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> Juga di kompartemen ini, Anda akan menemukan sumbat hitam kecil (selama Anda meletakkannya di sana selama pengaturan awal). Lepaskan sumbat ini dan gunakan untuk memasang lubang di bagian bawah PS5 tempat Anda baru saja melepas sekrup. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Putar Basis </h2> <p> Sekarang, Anda ingin memutar alasnya sehingga pas dengan konsol dalam orientasi horizontalnya. Ini juga menutup kompartemen kecil tempat Anda meletakkan sekrup, untuk mengamankannya lebih jauh. </p> <p> Anda harus memutar alasnya saat melihatnya dari atas (berlawanan dengan tempat Anda baru saja menyimpan sekrup). Jika Anda memperlakukan bagian dudukan yang terangkat sebagai &quot;utara&quot;, Anda harus memutar bagian luar dudukan ke &quot;barat laut&quot;, seperti yang ditunjukkan di bawah ini. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Ini adalah orientasi yang benar untuk menggunakan dudukan secara horizontal. Ini akan klik dan berhenti dengan lembut ketika Anda memilikinya di tempat yang tepat. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Pasang Dudukan dalam Posisi Horizontal </h2> <p> Sekarang, Anda dapat memasang dudukan ke PS5 Anda saat duduk secara horizontal. Pastikan sistem duduk dengan benar --- logo PS harus menghadap ke atas. </p> <p> Di bagian belakang sistem Anda, di bawah dan dekat dengan dua port USB, Anda akan melihat beberapa simbol pengontrol PlayStation tercetak di konsol. Selipkan lengan luar alas (yang baru saja Anda putar) ke sistem di sekitar tempat pola ini berakhir di setiap sisi. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Dorong klip untuk mengencangkannya, tetapi perhatikan bahwa dalam posisi ini, dudukan tidak sepenuhnya terkunci pada tempatnya (seperti halnya dengan sekrup saat ditempatkan secara vertikal). Berhati-hatilah saat Anda meletakkan sistem, dan perhatikan bahwa dudukan dapat tergelincir jika Anda menariknya. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Sekarang Anda siap untuk menggunakan PS5 Anda dalam orientasi horizontal. Pasang kembali semua kabel dan nyalakan untuk kembali bermain. Jika Anda memiliki PS5 standar, Anda akan memasukkan cakram menghadap ke atas dalam orientasi ini. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> Cara Mengubah Kembali PS5 Anda Dari Horizontal ke Vertikal </h2> <p> Ingin kembali ke orientasi vertikal untuk PS5 Anda, atau mungkin Anda awalnya mengatur PS5 Anda dalam bentuk horizontal dan ingin pergi vertikal sekarang? Either way, mudah untuk berjalan melalui proses di atas dalam urutan terbalik. Pastikan Anda mematikan dan mencabut PS5 Anda terlebih dahulu, jika saat ini dihidupkan atau dalam mode Istirahat. </p> <p> </p> <p> Untuk beralih ke orientasi vertikal, pertama-tama angkat PS5 Anda dan tarik perlahan stand keluar dari sistem untuk melepaskannya. Selanjutnya, Anda harus memutar lengan luar alas. Saat melihatnya dari atas, lengan harus &quot;utara&quot;, sejajar dengan bagian yang terangkat. Pastikan Anda merasakan klik lembut, sehingga Anda tahu itu di tempat yang tepat. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> Posisikan PS5 Anda sehingga Anda dapat mengakses bagian bawah, lalu lepaskan sumbat hitam dari lubang di tengah—itu terletak kira-kira di tengah ventilasi. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Tempatkan sumbat hitam ini di dalam lubang kecil di kompartemen di bagian bawah alas. Stopper harus tepat pada tempatnya. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> Selanjutnya, lepaskan sekrup dari kompartemen yang sama di pangkalan. Sekarang, Anda harus memasang dudukan pada posisinya yang benar. Untuk melakukannya, tegakkan PS5 Anda sehingga bagian belakang konsol menghadap ke atas, seperti yang ditunjukkan di bawah ini. </p> <p> Ambil dudukan dan letakkan sehingga lubang untuk sekrup sejajar dengan lubang sekrup yang baru saja Anda lepaskan sumbatnya. Posisikan klip di lengan alas di bagian belakang sistem Anda di bawah konektor daya. Stand harus berbaris dengan mudah. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Sekarang, gunakan obeng atau sejenisnya untuk mengencangkan sekrup. Setelah selesai dan dudukan terasa terpasang dengan kuat, Anda siap menggunakan PS5 secara vertikal. Pasang kembali semua kabel untuk menyelesaikan pekerjaan. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> Haruskah Anda Berdiri PS5 Anda Secara Vertikal atau Horizontal? </h2> <p> Sony mendukung penggunaan PS5 Anda baik secara vertikal maupun horizontal, jadi tidak ada cara yang benar atau salah untuk melakukannya, selama sistem Anda mendapat aliran udara yang cukup. Orientasi mana yang harus Anda gunakan tergantung pada kebutuhan Anda. </p> <p> </p> <p> Jika Anda memiliki banyak ruang dan tidak keberatan PS5 memakan banyak ruang horizontal, tampilan horizontalnya ramping. Bagi mereka yang menggunakan model standar PS5, ini juga membuat proses memasukkan cakram menjadi sedikit lebih mudah, karena labelnya harus selalu menghadap ke atas. Ini sedikit lebih sulit untuk diingat dengan orientasi vertikal, di mana label disk harus menghadap ke kiri. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> Namun, Anda mungkin tidak memiliki ruang di dalam sistem hiburan Anda untuk mengakomodasi pengaturan horizontal. Dalam kasus ini, menjadi vertikal adalah taruhan terbaik Anda. PS5 adalah konsol besar, tetapi ketika ditempatkan secara vertikal, ia duduk dengan baik di sebelah dudukan TV Anda atau sejenisnya. Ini adalah pengaturan yang saya gunakan, seperti yang ditunjukkan pada gambar di bawah ini. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> Apa pun orientasi yang Anda pilih untuk PS5 Anda, pastikan Anda menggunakan dudukannya. Itu membuat sistem tidak bergerak, yang meningkatkan aliran udara. Dudukan juga mengamankan PS5, membuatnya lebih sulit untuk terjatuh dan berpotensi merusaknya. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> Siapkan PS5 Anda dan Mainkan </h2> <p> Sekarang Anda tahu cara mengubah PS5 Anda dari vertikal ke horizontal dan kembali lagi hanya dalam beberapa menit. Setelah sistem Anda diatur, nyalakan dan nikmati beberapa judul terbaik PS5. </p> <p> Jangan lupa bahwa hampir semua perpustakaan PS4 juga berfungsi di PS5, memberi Anda lebih banyak untuk dinikmati. </p> <p> <small> Kredit Gambar: Alex Van Aken/ <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}