{"title":"Cara Melihat Statistik Waktu Bermain Anda di PS5","content":"<p> Jika Anda senang melihat berapa banyak waktu yang Anda habiskan untuk bermain game, PS5 memiliki fitur tersembunyi tetapi berguna untuk Anda. Ini melacak berapa banyak waktu yang Anda habiskan untuk bermain game di sistem. </p> <p> Berikut cara memeriksa berapa banyak waktu yang Anda habiskan untuk bermain game PlayStation 5. Yang mungkin mendorong Anda untuk <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> matikan PS5 Anda </a> lebih sering. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> Cara Memeriksa Statistik Waktu Bermain Anda di PlayStation 5 </h2> <p> Di layar beranda PS5 Anda, pilih ikon profil Anda di kanan atas. Anda dapat menekan <strong> Segi tiga </strong> untuk memindahkan pilihan ke area layar tersebut dengan cepat. Setelah Anda membuka menu itu, pilih <strong> Profil </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Sekarang, beralih ke <strong> permainan </strong> tab. Di sini Anda akan melihat semua game yang telah Anda mainkan di akun PlayStation Anda. Masing-masing menunjukkan terakhir kali Anda memainkan game, serta total jam bermain Anda. Ini tidak akurat untuk menit, namun. Anda akan melihat waktu bermain dibulatkan ke jam. </p> <p> Anda juga akan melihat waktu bermain untuk judul PS4 Anda di sini, meskipun Anda belum memainkannya di PS5. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> Sejauh yang kami tahu, waktu bermain ini mencakup semua waktu permainan berjalan—tidak hanya saat Anda aktif bermain. Ini berarti bahwa jika Anda meninggalkan permainan di menu jeda saat Anda menerima panggilan telepon atau makan sesuatu, waktu itu akan dimasukkan ke dalam total. Jadi itu mungkin tidak terlalu akurat, tetapi setidaknya akan memberi Anda gambaran tentang berapa lama Anda memainkan setiap judul. </p> <p> </p> <p> Jika Anda penasaran, Anda juga dapat melihat statistik waktu bermain untuk teman-teman Anda. Pilih <strong> Teman </strong> tab dari layar yang sama dan pilih teman yang ingin Anda pelajari lebih lanjut. Ini akan menunjukkan kepada Anda berapa lama mereka menghabiskan waktu dalam permainan mereka dalam menu yang sama. </p> <p> Jika Anda tidak ingin informasi waktu bermain Anda terlihat oleh pemain lain, gulir ke kanan dan pilih <strong> Pengaturan Privasi </strong> . Di menu itu, di bawah <strong> Aktivitas Anda </strong> bagian, ubah opsi untuk <strong> Siapa yang dapat melihat riwayat permainan Anda </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Beberapa Game Juga Melacak Waktu Bermainnya Sendiri </h2> <p> Jika Anda tertarik dengan data seperti ini, pastikan untuk membuka game favorit Anda dan lihat apakah mereka melacak berapa banyak waktu yang Anda habiskan untuk bermain. Sejumlah judul yang bagus termasuk total waktu pemutaran pada file simpanan Anda, di dalam menu jeda, atau yang serupa. </p> <p> Meskipun ini tidak konsisten di seluruh game, dan mungkin atau mungkin tidak termasuk waktu yang dihabiskan saat dijeda, ini dapat memberi Anda lebih banyak wawasan tentang game yang ingin Anda ketahui lebih lanjut. Beberapa game online, seperti Overwatch, bahkan melacak waktu yang Anda habiskan dengan setiap pahlawan di berbagai mode. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Lihat Seberapa Banyak Anda Benar-benar Game </h2> <p> PS5 memudahkan untuk melihat berapa banyak waktu yang Anda habiskan untuk bermain game. Ini adalah fitur kecil tapi sangat dihargai, karena PS4 tidak membuat data ini mudah diakses. </p> <p> Sementara itu, ada lebih banyak cara untuk mengelola permainan Anda bermain di luar konsol itu sendiri juga. </p> <p> <small> Kredit Gambar: LightField Studios/ <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}