{"title":"Cara Menggunakan Waktu untuk Berjalan Dengan Apple Fitness+","content":"<p> Apple Fitness+ menawarkan berbagai macam latihan video berbeda yang memanfaatkan kekuatan Apple Watch untuk memberikan cara terbaik untuk menjadi bugar. Tetapi fitur Time to Walk layanan ini sedikit berbeda. </p> <p> Alih-alih berdiri di depan layar, fitur ini mendorong Anda untuk berjalan-jalan dan mendengarkan cerita sambil melihat foto-foto bermakna dari bintang berpengaruh dan unik. Kami akan menyoroti lebih lanjut tentang fitur dan apa yang Anda butuhkan untuk memulai di bawah ini. </p> <h2 id=\"what-is-time-to-walk\"> Apa Waktunya untuk Berjalan? </h2> <p> <img alt=\"Draymond Green Time to walk\" src=\"images/draymond-green-time-to-walk-1-269.jpg\" loading=\"lazy\"> </p> <p> Anggap saja Time to Walk sebagai pengalaman unik seperti podcast dengan selebriti dan nama berpengaruh lainnya. Beberapa episode termasuk legenda musik country Dolly Parton, bintang NBA Draymond Green, musisi Sean Mendes, dan pemenang penghargaan Emmy Uzo Aduba. </p> <p> Dalam episode 25 hingga 40 menit, tamu akan berbicara tentang momen pribadi mereka yang membentuk kehidupan. Di layar Apple Watch, Anda juga dapat melihat foto yang membantu menceritakan kisahnya. Di akhir cerita, Anda akan mendengar daftar putar cerita dari lagu-lagu bermakna yang dipilih oleh tamu. </p> <p> </p> <p> </p> <h2 id=\"getting-started-with-time-to-walk\"> Memulai Dengan Waktu untuk Berjalan </h2> <p> Anda harus berlangganan Apple Fitness+ untuk mengakses Time to Walk. Anda juga memerlukan Apple Watch Series 3 atau lebih baru dan headphone Bluetooth, seperti AirPods Apple. </p> <p> Kabar baiknya adalah Anda tidak perlu melakukan apa pun untuk mengunduh Episode Time to Walk. Selama Apple Watch Anda mengisi daya dan terhubung ke Wi-Fi, lima episode terbaru akan diunduh secara otomatis ke jam tangan Anda. </p> <p> Sebagai catatan, jumlah penyimpanan gratis di jam tangan Anda mungkin memengaruhi jumlah episode yang tersedia. Setelah Anda mendengarkan sebuah episode, jam tangan Anda akan menghapusnya secara otomatis. Kemudian, sebuah episode baru akan menggantikannya. </p> <p> Anda juga dapat mengunduh episode Time to Walk tertentu menggunakan iPhone. Pergi ke <strong> kebugaran </strong> aplikasi dan pilih <strong> Kebugaran+ </strong> tab. Dalam <strong> Saatnya Berjalan </strong> bagian, pilih <strong> Tunjukkan semua </strong> . Anda dapat melihat semua episode yang tersedia di sini. </p> <p> Ketuk sebuah episode untuk melihat informasi lebih lanjut tentang apa yang diharapkan dan lagu-lagu dari daftar putar. Di halaman itu, gunakan <strong> Menambahkan </strong> tombol untuk mengunduh episode ke jam tangan Anda. Jika episode sudah diunduh ke jam tangan Anda, ia akan mengatakan <strong> Diunduh </strong> dan menunjukkan tanda centang. </p> <p> <strong class=\"gallery__section-title\"> Galeri Gambar (3 Gambar) </strong> <img alt=\"Apple Activity App\" src=\"images/apple-activity-app-625.jpg\" loading=\"lazy\"> Memperluas <img alt=\"Apple Fitness+ Time to Walk\" src=\"images/apple-fitness-time-to-walk-841.jpg\" loading=\"lazy\"> Memperluas <img alt=\"Time to Walk Episode\" src=\"images/time-to-walk-episode-915.jpg\" loading=\"lazy\"> Memperluas </p> <p> Menutup </p> <p> Jika Anda memiliki Apple Watch yang mendukung seluler, tidak perlu khawatir harus mengunduh episode karena Anda masih dapat melakukan streaming episode tanpa memerlukan iPhone di dekat Anda. </p> <p> </p> <p> Saat Anda siap untuk berjalan-jalan, buka Apple Watch <strong> Bekerja </strong> aplikasi. Ketuk <strong> Saatnya Berjalan </strong> episode untuk memulai. Jika gerakan terdeteksi menggunakan GPS Apple Watch, latihan direkam sebagai jalan-jalan di luar ruangan. Jika tidak, latihan akan dihitung sebagai jalan kaki di dalam ruangan. </p> <p> <img alt=\"Apple Watch Time to Walk \" src=\"images/apple-watch-time-to-walk-217.jpg\" loading=\"lazy\"> </p> <p> Saat berjalan, geser ke kiri untuk mengunci layar jam tangan, menjeda olahraga, atau mengakhiri olahraga. Gesek ke kanan akan memunculkan kontrol media dan memungkinkan Anda untuk menjeda audio, melompat maju atau mundur dalam episode atau berpindah di antara lagu-lagu daftar putar. </p> <p> Jika Anda ingin menghapus episode Time to Walk secara manual, buka app Olahraga di Apple Watch dan ketuk tap <strong> saya </strong> ikon di dekat nama selebriti. Gulir ke bawah ke bawah lalu pilih <strong> Menghapus </strong> . </p> <p> </p> <h2 id=\"making-exercise-even-better-with-time-to-walk\"> Membuat Latihan Lebih Baik Dengan Waktu untuk Berjalan </h2> <p> Berjalan adalah salah satu cara termudah dan paling populer bagi siapa saja untuk mendapatkan dosis olahraga yang dibutuhkan. Time to Walk menawarkan cara unik untuk memotivasi Anda saat berjalan-jalan. </p> <p> Dan untuk memastikan Anda memiliki banyak jus untuk perjalanan jauh, ikuti tips kami untuk membantu menghemat masa pakai baterai di Apple Watch Anda. </p>"}