{"title":"Cara Memasang Pengontrol Pintu Garasi Cerdas","content":"<p> Apakah Anda ingin mengontrol pintu garasi Anda dengan smartphone atau tablet? Pengontrol cerdas adalah pilihan yang bagus jika Anda sudah memasang pembuka pintu garasi di rumah Anda. </p> <p> Kami akan menunjukkan cara memasang pengontrol pintu garasi pintar. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Perbedaan Antara Pembuka dan Pengontrol </h2> <p> Ada dua perbedaan utama antara pembuka pintu garasi pintar dan pengontrol. Yang pertama adalah ukuran. </p> <p> Kebanyakan pembuka berukuran besar dan dipasang di langit-langit garasi Anda. Mereka menggunakan jalur mekanis untuk membuka dan menutup pintu. Pengontrol pintu garasi, di sisi lain, adalah unit elektronik kecil yang memungkinkan Anda mengontrol pembuka menggunakan aplikasi di perangkat pintar. </p> <p> Perbedaan kedua antara kedua produk ini adalah harganya. Pembuka pintu garasi dapat berharga sekitar $300. Pemasangan pembuka ini biasanya membutuhkan bantuan installer profesional. </p> <p> Namun, pengontrol biasanya tidak memerlukan instalasi profesional. Sebagai gantinya, pengontrol berfungsi sebagai tambahan untuk pembuka yang ada. </p> <p> Ini berarti bahwa untuk sebagian kecil dari harga pembuka baru, Anda dapat mencapai fungsi yang sama hanya dengan menggunakan pengontrol. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> Apa Manfaat Pintu Garasi Cerdas? </h2> <p> Ada tiga manfaat utama memiliki pintu garasi pintar. </p> <ul> <li> <strong> Keamanan </strong> —Pintu garasi pintar memungkinkan Anda membuka dan menutup pintu hampir dari mana saja. </li> <li> <strong> Keamanan </strong> —Kebanyakan pembuka dan pengontrol pintu garasi pintar memberi tahu Anda saat garasi Anda terbuka untuk jangka waktu tertentu. </li> <li> <strong> Kenyamanan </strong> —Jika Anda pernah harus kembali ke rumah untuk menutup pintu garasi Anda, maka memiliki aplikasi pintu garasi pintar menghemat waktu. Alih-alih mengemudi pulang, tarik saja ponsel Anda. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> Cara Memasang Pengontrol Pintu Garasi Cerdas </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Jika Anda telah memutuskan bahwa pengontrol pintu garasi pintar tepat untuk Anda, maka panduan ini akan menunjukkan cara memasangnya. Dalam demonstrasi ini, <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meross MSG100 </a> digunakan, tetapi proses ini serupa jika menggunakan merek lain. Lihat dokumentasi pengontrol Anda untuk detailnya. </p> <h3 id=\"what-you-ll-need\"> Apa yang Anda Butuhkan </h3> <ul> <li> Pengontrol garasi pintar smart </li> <li> Pistol staples atau dudukan kawat </li> <li> Pintu garasi dengan pembuka otomatis terpasang </li> <li> Philips dan obeng berlubang </li> <li> Tangga </li> </ul> <h3 id=\"plan-the-installation\"> 1. Rencanakan Instalasi </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Sebelum memasang pengontrol, Anda harus memeriksa beberapa tempat di garasi Anda. Yang pertama adalah sumber daya untuk pengontrol. Yang kedua adalah jalur kabel dari pengontrol ke sensor yang dipasang di pintu yang disertakan dalam kit Anda. Dan yang ketiga adalah letak sensor magnet. </p> <p> Sensor magnetik ini memungkinkan pengontrol untuk mengetahui kapan pintu dibuka atau ditutup. </p> <p> Sebagian besar pengontrol menggunakan kabel panjang untuk terhubung ke sensor pintu. Anda harus merutekan kabel ini melintasi langit-langit atau ke bawah dinding agar kabel tidak menghalangi. </p> <p> Setelah Anda merencanakan pemasangan Anda, ujilah kabel sensor dari pengontrol ke lokasi sensor. Uji kecocokan ini memastikan kabel sensor Anda mencapai pengontrol Anda. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Matikan Daya ke Pembuka Pintu Garasi Anda </h3> <p> Sebagian besar pintu garasi dicolokkan ke listrik di suatu tempat di langit-langit. Untuk pembuka tersebut, Anda akan ingin memastikan mereka dicabut sebelum Anda melanjutkan. </p> <p> Jika pembuka Anda tidak memiliki steker dan malah terpasang ke kabel yang keluar dari langit-langit, maka Anda harus menemukan kotak pemutus dan mematikan daya ke pembuka di sana. </p> <p> <strong> catatan: </strong> Arus rumah 120 volt dapat menyebabkan cedera serius. Jika Anda tidak nyaman bekerja dengan listrik, berhentilah sekarang, dan konsultasikan dengan pemasang pintu garasi dan/atau ahli listrik profesional. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Hubungkan Kabel yang Disertakan ke Pengontrol </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> Pada unit Meross terdapat satu set kabel berwarna biru dan coklat yang harus dipasang ke controller untuk menyambung ke pembuka pintu garasi. Buka penutup plastik pada pengontrol, dan Anda akan melihat dua terminal sekrup. </p> <p> Dengan menggunakan obeng berlubang kecil, kendurkan sekrup pada setiap terminal. Masukkan kabel Anda dan kencangkan sekrupnya. Tidak masalah kabel mana yang mengarah ke mana. </p> <p> Tarik kabel dengan lembut untuk memastikannya aman. Kemudian ganti penutup pengontrol. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Pasang Pengontrol Pintu Garasi </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Karena Anda telah merencanakan lokasi Anda, sekaranglah waktunya untuk memasang pengontrol Anda. Pastikan pengontrol berada di tempat yang dapat mengakses daya yang dibutuhkannya tanpa membebani kabel apa pun. </p> <p> Selanjutnya, lepaskan penahan lengket pada pengontrol, dan tekan pada tempatnya. Jika Anda memiliki pengontrol dengan dudukan sekrup, gunakan obeng untuk mengencangkan pengontrol ke posisinya. </p> <h3 id=\"mount-the-sensor\"> 5. Pasang Sensor </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> Selanjutnya, Anda harus memasang sensor untuk pintu. Disarankan agar sensor ini ditempatkan di tempat yang tidak menghalangi jalur pintu. </p> <p> Selain itu, Anda mungkin tergoda untuk memasang sensor di dekat tanah. Ini tidak disarankan, karena air yang berulang kali memercik langsung ke sensor dapat merusaknya. Setelah Anda memposisikan sensor, gunakan selotip atau sekrup dua sisi yang tersedia untuk mengencangkannya. </p> <p> Pada foto di atas, sensor hitam telah dipasang di samping pintu garasi dengan bagian magnet dipasang ke pintu itu sendiri. Sensor ini menggunakan double tape untuk pemasangannya. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Hubungkan Kabel Sensor </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Sekarang saatnya menghubungkan kabel ke sensor dan pengontrol. Menggunakan rencana yang Anda buat pada langkah pertama, rutekan kabel Anda dan gunakan stapler untuk mengamankan kabel ke dinding atau langit-langit. </p> <p> Pastikan untuk tidak menjepit atau membuat kabel tertekuk karena dapat merusaknya. Saat dirutekan, sambungkan konektor pantat betina merah pada pengontrol ke konektor pantat pria merah di ujung kabel sensor. </p> <p> Selanjutnya, Anda harus membuka penutup pembuka pintu garasi Anda. Seharusnya ada empat kabel, dua daya kontrol dan umum ke unit, dan dua tombol kontrol di dinding. </p> <p> </p> <p> Biasanya, kabel ini berasal dari langit-langit dan harus memiliki terminal sekop berkerut yang mengamankannya ke unit pembuka pintu garasi. Jika Anda tidak dapat menentukan kabel yang mana, hentikan dan lihat manual pemilik untuk pembuka pintu garasi Anda, atau konsultasikan dengan ahli listrik bersertifikat. </p> <p> Jika Anda sudah menemukan kabelnya, hubungkan kabel coklat dan biru dari pengontrol ke terminal pada pembuka yang terhubung ke tombol dinding. Pada foto di atas, kabel pengontrol telah dimasukkan ke dua terminal paling kiri. </p> <p> Ketika Anda selesai, harus ada dua kabel yang terpasang pada setiap terminal tombol dinding. Pasang kembali penutup untuk pembuka pintu garasi Anda, pasang pengontrol dan pembuka, dan pemasangan harus selesai. </p> <p> Pada langkah berikutnya, Anda akan menghubungkan pengontrol ke jaringan nirkabel. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Hubungkan Pengontrol ke Wi-Fi </h3> <p> <strong class=\"gallery__section-title\"> Galeri Gambar (3 Gambar) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Memperluas <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Memperluas <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Memperluas </p> <p> Menutup </p> <p> Untuk mengatur konektivitas Wi-Fi, kami menggunakan aplikasi Meross. Ini tersedia untuk <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> dan <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . Proses ini hampir selalu terdiri dari membuka aplikasi, mengidentifikasi produk Anda, menghubungkan aplikasi ke Wi-Fi Anda, membuka layar Pengaturan, dan mengizinkan pengontrol mengakses jaringan Anda. </p> <p> Di sini, buka aplikasi, lalu ketuk <strong> Pembuka Pintu Garasi Cerdas </strong> lalu <strong> Mulailah </strong> . Pilih pabrikan dan model pembuka pintu garasi yang Anda gunakan dengan pengontrol. Pastikan Anda mengikuti petunjuk khusus untuk aplikasi Anda. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Atur Interval Waktu Buka/Tutup </h3> <p> <strong class=\"gallery__section-title\"> Galeri Gambar (3 Gambar) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Memperluas <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Memperluas <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Memperluas </p> <p> Menutup </p> <p> Satu hal yang penting untuk diatur sebelum Anda menguji pengontrol baru Anda adalah waktu pembukaan pintu garasi. Di aplikasi Meross, Anda dapat memilih antara 10 detik dan 40 detik dalam interval lima detik, atau Anda dapat menambahkan pengaturan khusus untuk pintu yang membutuhkan waktu genap untuk menutupnya. </p> <p> Mengatur waktu untuk pintu Anda mudah, tetapi Anda harus melakukannya dengan benar. Interval yang terlalu pendek akan membuat pintu terbuka sebagian, dan pengaturan yang terlalu lama dapat menyebabkan tekanan yang tidak semestinya pada motor pembuka pintu garasi. </p> <p> Untuk mengatur interval, Anda memerlukan jam tangan dengan jarum detik atau fungsi stopwatch. Anda juga dapat menggunakan timer bawaan ponsel Anda. Siapkan timer Anda dan berdiri di dekat tombol pembuka pintu garasi Anda. Kemudian tekan tombol pada saat yang sama saat Anda menekan start pada stopwatch Anda, atau catat waktu di jarum detik. </p> <p> Tunggu sampai pintu garasi Anda berhenti bergerak dan catat waktunya. Ini adalah interval Anda. Transfer informasi itu ke dalam aplikasi, dan pengaturan interval selesai. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Uji Pengontrol Pintu Garasi </h3> <p> Menggunakan aplikasi Anda, buka dan tutup pintu beberapa kali hanya untuk memastikan semuanya berfungsi. Anda sekarang harus dapat menggunakan tombol dinding atau aplikasi untuk membuka pintu garasi Anda. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Nikmati Pengontrol Pintu Garasi Cerdas Anda </h2> <p> Membawa teknologi rumah pintar Anda ke pintu garasi tidak harus menghabiskan banyak uang. </p> <p> Memasang pengontrol pintu garasi pintar baru memberi Anda dan keluarga Anda lebih banyak fleksibilitas, keselamatan, keamanan, dan kenyamanan untuk rumah Anda. Ini juga memberikan ketenangan pikiran yang datang dengan mengetahui pintu garasi Anda dapat dikontrol dari hampir di mana saja. </p>"}