{"title":"Cara Mengambil Tangkapan Layar di Tablet Surface Pro","content":"<p> Mengambil tangkapan layar adalah keterampilan sederhana namun penting di perangkat apa pun. Di Surface Pro Tablet, Anda dapat mengambil tangkapan layar menggunakan pintasan keyboard, alat snipping, atau bahkan Xbox Game Bar. Kami akan menunjukkan cara memanfaatkan semua metode ini untuk mengambil tangkapan layar atau bahkan merekam layar di perangkat Surface Anda. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Mengambil Tangkapan Layar Menggunakan Kombinasi Tombol </h2> <p> Di jajaran perangkat Surface Pro, mengambil tangkapan layar menggunakan kombinasi tombol cepat dan mudah. Untuk mengambil tangkapan layar, tahan tombol <strong> Kekuasaan </strong> dan <strong> Volume Naik </strong> kunci secara bersamaan. Layar harus berkedip, dan tangkapan layar harus disimpan di folder tangkapan layar di bawah Gambar di perangkat Anda. </p> <p> Metode ini berfungsi untuk jajaran perangkat Surface Pro terbaru (yaitu, Surface Pro 7+, Pro X), Surface Go, Surface Go 2, dan jajaran perangkat Surface Book. </p> <p> Jika Surface Anda adalah model lama (Surface 3 atau lebih lama), kombinasi tombolnya sedikit berbeda. Anda harus menekan tombol <strong> Tombol Windows </strong> (bukan Tombol Windows di keyboard Anda) dan <strong> Volume Turun </strong> tombol secara bersamaan. Perangkat akan menyimpan tangkapan layar Anda ke Folder Tangkapan Layar di bawah Foto. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> Demikian pula, untuk mengambil tangkapan layar di Surface Duo Anda, tahan tombol <strong> Kekuasaan </strong> tombol dan <strong> Volume Turun </strong> kunci. Tangkapan layar harus disimpan ke galeri perangkat Anda di bawah Tangkapan Layar. Atau, Anda cukup menahan tombol <strong> Kekuasaan </strong> tombol dan klik <strong> Tangkapan layar </strong> tombol di layar. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> Cara Mengambil Tangkapan Layar Surface Pro Menggunakan Pintasan Keyboard </h2> <p> Pintasan keyboard adalah cara lain untuk menangkap apa yang ada di layar Anda. </p> <p> Pintasan keyboard ini berfungsi di semua perangkat Windows, jadi periksa <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> metode tangkapan layar lainnya di Windows 10 </a> . Pintasan keyboard berfungsi paling baik di perangkat Surface Laptop dan Surface Book, tetapi tentu saja, jika Anda memiliki lampiran keyboard untuk perangkat Surface Pro atau Go, pintasan ini juga berfungsi. </p> <h3 id=\"print-screen-methods\"> Metode Layar Cetak </h3> <p> Untuk mengambil screenshot menggunakan metode Print Screen, cukup tekan tombol <strong> PrtScn </strong> tombol pada keyboard Anda. Ini akan mengambil tangkapan layar dari seluruh desktop Anda. Perhatikan bahwa ini tidak akan menyimpan tangkapan layar ke Surface Anda tetapi akan menambahkannya ke clipboard Anda. Anda harus menggunakan program seperti Microsoft Paint untuk menempelkan tangkapan layar. </p> <p> Mendesak <strong> Alt + PrtScn </strong> akan mengambil tangkapan layar dari jendela Anda saat ini saja dan juga akan menambahkan tangkapan layar ke papan klip Anda. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Gunting dan Sketsa </h3> <p> Sejauh ini, ini adalah metode termudah untuk mengambil tangkapan layar di perangkat Surface Anda. </p> <p> Untuk membuka Snip and Sketch, tekan tombol <strong> Tombol Windows + Shift + S, </strong> dan hamparan akan muncul di layar Anda. Untuk mengambil tangkapan layar penuh, tekan tombol Layar Penuh di bagian atas hamparan. Untuk mengambil tangkapan layar hanya dari jendela Anda saat ini, tekan tombol Window Snip di sebelah tombol Layar Penuh. </p> <p> Anda juga dapat mengambil tangkapan layar dari area tertentu di layar Anda. Secara default, Snip dan Sketch memiliki Rectangular Snip. Cukup seret ke bagian yang ingin Anda screenshot menggunakan layar sentuh atau trackpad Anda. </p> <p> Snip and Sketch akan memberi Anda notifikasi di panel notifikasi untuk mengatakan bahwa tangkapan layar Anda disalin ke clipboard Anda. Jika Anda mengkliknya, Anda dapat menggambar dan membuat sketsa di atas tangkapan layar jika diinginkan. </p> <p> Untuk menyimpannya ke file Anda, gunakan <strong> Ctrl + S </strong> atau tombol Simpan di sudut kanan atas untuk menyimpan tangkapan layar Anda ke folder tertentu. </p> <h3 id=\"xbox-game-bar\"> Bilah Permainan Xbox </h3> <p> Untuk mengambil tangkapan layar menggunakan Xbox Game Bar, tekan tombol <strong> Tombol Windows + G </strong> untuk membukanya. </p> <p> Dari sana, Anda dapat mengklik tab Tangkap dan klik Tombol Kamera. Metode ini juga akan memungkinkan Anda untuk mengambil video capture layar Anda dengan audio. Tangkapan Anda yang disimpan akan muncul di bawah folder Video dan subfolder Tangkap. Di Xbox, Anda juga bisa <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> tangkap tangkapan layar dan rekaman </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Mengambil Screenshot Surface Pro Menggunakan Surface Pen </h2> <p> Untuk mengambil tangkapan layar menggunakan Surface Pen, cukup Klik dua kali penghapus, dan perangkat Anda akan memunculkan Snip dan Sketsa seluruh jendela Anda. Dari sini, Anda dapat membuat sketsa dan mengekspor tangkapan layar Anda. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> Anda juga dapat mengakses ini dengan mencari Windows Ink Workspace di dok Anda. Dari sini, pilih Full-Screen Snip. Anda dapat mengubah apa yang dilakukan pintasan tombol Surface Pen Anda dengan mencari Pengaturan Ruang Kerja Windows Ink dan menggulir ke bawah ke Ruang Kerja Tinta Windows. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Mengambil Screenshot di Surface, Dibuat Sederhana </h2> <p> Sekarang Anda tahu semua berbagai metode untuk mengambil tangkapan layar atau merekam layar di perangkat Surface Anda. Kombinasi tombol adalah cara taktil terbaik untuk mengambil tangkapan layar jika Anda menggunakan Surface Pro atau Surface Go, tetapi pintasan keyboard juga mudah. </p>"}