{"title":"Cara Menggunakan Aplikasi Latihan Apple Watch","content":"<p> Lebih memahami kemajuan kebugaran Anda hanya dengan satu ketukan dengan Apple Watch. </p> <p> Kami melihat semua yang ditawarkan aplikasi Apple Watch Workout, termasuk cara kerja aplikasi, jenis latihan apa yang dapat dilacak, dan cara melihat semua informasi yang dikumpulkannya. </p> <h2 id=\"getting-started-with-the-workout-app\"> Memulai Dengan Aplikasi Latihan </h2> <p> Anda dapat membuka app Olahraga di Apple Watch dengan beberapa cara. Pertama, cukup klik sekali pada <strong> Mahkota Digital </strong> untuk memunculkan daftar aplikasi di jam tangan Anda. Kemudian pilih <strong> Bekerja </strong> . </p> <p> Cara yang lebih cepat adalah dengan menggunakan Siri, baik dengan menekan lama tombol <strong> Mahkota Digital </strong> atau angkat arloji ke mulut Anda. Lalu cukup ucapkan &quot;Buka aplikasi Olahraga&quot;. </p> <p> Setelah membuka aplikasi, Anda akan melihat berbagai jenis latihan—mulai dari memanah hingga yoga dan semua yang ada di antaranya. </p> <p> Layar pemilihan latihan utama disorot oleh opsi paling populer. Gulir ke bagian bawah daftar dan pilih <strong> Tambahkan Latihan </strong> untuk melihat daftar jenis latihan lainnya. Jika karena alasan tertentu Anda tidak melihat jenis latihan Anda, Anda juga dapat memilih <strong> Lain </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> Anda dapat memilih <strong> tiga titik </strong> ( <strong> ... </strong> ) pada setiap jenis latihan untuk menetapkan sasaran jarak, kalori yang terbakar, atau waktu tertentu. Jika salah satu dari tujuan tersebut tidak menarik bagi Anda, cukup ketuk nama latihan untuk segera memulai. </p> <p> Akan ada hitungan mundur tiga detik di layar sebelum pelacakan dimulai. </p> <p> Semua fitur aplikasi Olahraga tersedia tanpa iPhone di dekat Anda atau hanya menggunakan Apple Watch yang terhubung ke Wi-Fi atau sinyal seluler. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Pahami Aplikasi Latihan </h2> <p> Ada tiga layar utama dalam aplikasi. Anda dapat beralih di antara mereka dengan menggesek ke kiri atau kanan. </p> <p> Layar utama akan menampilkan semua kemajuan Anda dalam jenis latihan yang Anda pilih. Anda akan melihat waktu latihan, kalori aktif, total kalori, dan detak jantung saat ini. Tergantung pada jenis latihan Anda, Anda mungkin juga melihat jarak yang ditempuh. </p> <p> Jika Anda memiliki Apple Watch Series 5 atau lebih baru, dan mengaktifkan layar selalu aktif, Anda selalu dapat melihat statistik latihan Anda. Siapa pun dengan model lama perlu mengangkat atau mengetuk layar untuk melihat informasi ini. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Saat Anda berlari atau berjalan, Apple Watch akan memberikan ketukan lembut setiap mil atau kilometer dan menampilkan pembaruan dengan informasi kecepatan. Rekap dan ketukan bersepeda akan terjadi setiap lima mil atau kilometer. </p> <p> Jika Anda melakukan olahraga Apple Fitness+, Anda dapat melihat data di app Olahraga dan layar iPhone, iPad, atau Apple Watch. </p> <p> </p> <p> Menggesek ke kanan dari layar utama akan menampilkan empat opsi berbeda— <strong> Mengunci </strong> , <strong> Baru </strong> , <strong> Akhir </strong> , dan <strong> Berhenti sebentar </strong> . </p> <p> Memilih <strong> Mengunci </strong> akan mengunci layar untuk menghindari ketukan yang tidak disengaja. Anda dapat memutar Digital Crown untuk membuka kunci layar. Sekadar catatan, opsi ini akan otomatis aktif selama semua jenis latihan renang untuk mencegah keran yang tidak disengaja dari tetesan air. </p> <p> Seperti yang mungkin bisa Anda tebak, <strong> Baru </strong> mengakhiri latihan saat ini dan memungkinkan Anda memilih jenis latihan baru untuk memulai lagi. Memilih <strong> Akhir </strong> akan menyelesaikan latihan saat ini. </p> <p> Jika Anda pernah terganggu, Anda dapat memilih <strong> Berhenti sebentar </strong> tombol. Menekannya lagi akan memulai pelacakan latihan. Anda juga dapat melakukan ini dengan menekan Digital Crown dan Side Button secara bersamaan. </p> <p> Menggesek ke kiri dari layar latihan utama menunjukkan kontrol pemutaran media. Itu cara mudah untuk mengakses musik Anda atau apa pun yang Anda dengarkan saat berolahraga. Anda dapat melewati trek, memutar, menjeda, dan menaikkan atau menurunkan volume. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Pengingat Latihan Otomatis </h2> <p> Tidak perlu khawatir jika Anda lupa memulai olahraga. Selama Anda memiliki watchOS 5 atau lebih baru, Apple Watch dapat mengenali secara otomatis saat Anda berolahraga. Ini akan mengetuk pergelangan tangan Anda dan menanyakan apakah Anda ingin merekam latihan, memungkinkan Anda untuk mengubah jenis latihan, membisukan pemberitahuan ini untuk hari itu, atau mengabaikan pemberitahuan ini. </p> <p> Meskipun mungkin perlu beberapa menit agar pemberitahuan muncul, semua kredit latihan masih disimpan. </p> <p> Anda dapat menerima pengingat olahraga untuk jenis olahraga berikut: jalan kaki di dalam ruangan, jalan kaki di luar ruangan, lari di dalam ruangan, lari di luar ruangan, elips, pendayung, berenang di kolam renang, dan berenang di perairan terbuka. </p> <p> Untuk mengaktifkan atau menonaktifkan fitur, buka <strong> Pengaturan &gt; Latihan &gt; Mulai Pengingat Latihan </strong> di Apple Watch Anda. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> Apple Watch juga dapat mendeteksi saat latihan selesai. Setelah ketukan, Anda akan melihat pemberitahuan di layar dengan opsi untuk mengakhiri atau menjeda latihan. Anda juga dapat sepenuhnya mengabaikan pemberitahuan dan melanjutkan latihan. </p> <p> Alihkan fitur dengan menuju ke Apple Watch Anda dan pergi ke <strong> Pengaturan &gt; Latihan &gt; Akhiri Pengingat Latihan </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Sesuaikan Data yang Ditampilkan di Aplikasi Latihan </h2> <p> Di tampilan Apple Watch Workout, Anda dapat menyesuaikan informasi yang ditampilkan di layar untuk berbagai jenis latihan. </p> <p> Untuk memulai, buka aplikasi Tonton pendamping di iPhone Anda. Dalam <strong> Jam tanganku </strong> pilih tab <strong> Bekerja </strong> . Lalu pilih <strong> Tampilan Latihan </strong> . Di bagian atas halaman, Anda dapat memilih apakah akan menampilkan satu atau beberapa metrik di layar selama berolahraga. Jika Anda memilih <strong> Metrik Tunggal </strong> , cukup gulir Digital Crown untuk melihat lebih banyak data di Apple Watch Anda. </p> <p> <strong class=\"gallery__section-title\"> Galeri Gambar (3 Gambar) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Memperluas <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Memperluas <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Memperluas </p> <p> Menutup </p> <p> Di bawah itu, Anda juga dapat melihat sejumlah jenis latihan yang berbeda di mana Anda dapat mengedit informasi yang ditampilkan di layar. Pilih jenis latihan lalu pilih <strong> Sunting </strong> di kanan atas layar untuk menyesuaikan apa yang ditampilkan di layar dan dalam urutan apa. </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Melihat Data Latihan di Aplikasi Kebugaran </h2> <p> Setelah selesai berolahraga, semua data hanya berjarak beberapa ketukan di iPhone Anda. </p> <p> Untuk melihatnya, buka <strong> kebugaran </strong> aplikasi. </p> <p> <strong class=\"gallery__section-title\"> Galeri Gambar (2 Gambar) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Memperluas <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Memperluas </p> <p> Menutup </p> <p> Di bawah <strong> Ringkasan </strong> tab, pilih <strong> Latihan </strong> . Anda akan melihat informasi tentang semua latihan Anda. Data juga tersedia di <strong> Kesehatan </strong> aplikasi. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Berkeringat Dengan Aplikasi Latihan Apple Watch </h2> <p> Seperti yang Anda lihat, aplikasi Apple Watch Workout adalah cara yang bagus untuk membantu melacak semua metrik kebugaran Anda yang berbeda saat melakukan segalanya mulai dari berenang hingga menari dan banyak lagi. </p> <p> Dan saat Anda siap untuk tidur malam dan pergi tidur, Apple Watch Anda masih bisa sangat membantu dengan fitur pelacakan tidur bawaan. </p>"}