{"title":"Canon Meluncurkan Aplikasi Pemusnahan Foto yang Menemukan Bidikan Terbaik Anda","content":"<p> Di balik hampir setiap foto sempurna gambar adalah gulungan kamera yang penuh dengan foto-foto lain yang terlihat hampir persis seperti itu. Bukan hal yang aneh bagi fotografer untuk hampir selalu menekan tombol rana, khawatir bahwa mereka mungkin melewatkan momen sesaat. </p> <p> Menelusuri lusinan atau bahkan ratusan foto untuk memilih favorit dan mengosongkan ruang penyimpanan bisa menjadi proses yang panjang dan menjengkelkan. Untungnya, Canon telah merilis aplikasi baru yang secara otomatis melakukannya untuk Anda. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> Ambil Gulungan Foto dengan Mudah ke Beberapa Yang Terbaik </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon USA </a> telah meluncurkan aplikasi pemusnahan foto di <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> Toko aplikasi </a> yang memungkinkan Anda menemukan foto terbaik dengan cepat dan mudah. Aplikasi itu sendiri gratis, tetapi untuk menggunakannya, Anda harus berlangganan seharga $14,99/tahun atau $2,99/bulan. Kedua opsi berlangganan memiliki uji coba tiga hari. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> Wakil presiden eksekutif Canon USA Tatsuro &quot;Tony&quot; Kano, menjelaskan: </p> <blockquote> <p> Di dunia yang terus berubah dan luar biasa saat ini, di mana ribuan foto diambil dan disimpan di smartphone seseorang, konsumen membutuhkan alat foto yang ahli, andal, dan intuitif untuk membantu mereka memutuskan foto terbaik berdasarkan pengetahuan dan teknologi tepercaya selama bertahun-tahun. </p> </blockquote> <p> Aplikasi Canon, hanya bernama Photo Culling, beroperasi pada AI yang disebut Photography Intelligence Learning atau disingkat PHIL. PHIL menyarankan foto mana yang harus Anda simpan dan mana yang harus Anda hapus berdasarkan yang mana dari dua opsi pemusnahan foto yang Anda pilih. </p> <p> Opsi pertama, <strong> Pemusnahan Utuh </strong> , sangat bagus untuk <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> fotografi potret yang lebih baik </a> . Jika opsi ini dipilih, PHIL akan menentukan foto terbaik Anda dengan menilainya berdasarkan empat faktor: ketajaman, kebisingan, emosi, dan apakah mata subjek Anda tertutup (jika ada). </p> <p> Sementara itu, <strong> Pemusnahan serupa </strong> opsi memilih bidikan terbaik Anda dengan membandingkan skor di antara foto-foto serupa. Misalnya, misalkan Anda mengambil banyak foto awan, lalu beberapa foto bunga. Aplikasi akan memisahkan foto awan dan foto bunga ke dalam grup terpisah. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Opsi pemusnahan mana pun yang Anda pilih, jika skor foto melebihi skor target yang Anda tetapkan, maka foto tersebut dianggap sebagai penjaga. PHIL kemudian akan menyarankan untuk menghapus sisa foto yang skornya tidak cukup tinggi. Jika Anda tidak setuju dengan PHIL, jangan khawatir. Anda masih memiliki kendali penuh atas semua bidikan Anda. </p> <p> </p> <p> Fitur lain dari aplikasi ini termasuk jumlah foto dan info tampilan ruang penyimpanan, album foto, setelan parameter untuk skor foto, dan opsi untuk menggunakan mode gelap. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> Maukah Anda Mengunduh Aplikasi Pemusnahan Foto Canon? </h2> <p> Tampaknya aplikasi pemusnahan foto Canon memiliki semua yang Anda perlukan untuk membuat proses memilih foto terbaik Anda tidak terlalu membosankan. Namun, pada akhirnya, terserah Anda untuk memutuskan apakah Anda membenci pemusnahan foto cukup untuk membenarkan membayar untuk sesuatu yang dapat Anda lakukan sendiri (walaupun mungkin sangat lambat dan bosan keluar dari pikiran Anda). </p> <p> Pada saat penulisan, aplikasi ini tidak tersedia untuk Android, tetapi mungkin Canon memilikinya di masa depan. </p>"}