{"title":"Cara Memperbaiki BSOD VIDEO_TDR_FAILURE di Windows 10","content":"<p> Kesalahan VIDEO_TDR_FAILURE menandakan bahwa kartu grafis Anda rusak atau driver tampilan mungkin kedaluwarsa/tidak berfungsi. Tetapi mungkin ada alasan lain, seperti komponen yang terlalu panas atau file sistem yang rusak. TDR adalah singkatan dari <strong> Batas Waktu, Deteksi, dan Pemulihan </strong> , metode yang digunakan oleh Windows untuk mengidentifikasi dan memperbaiki komponen perangkat lunak yang tidak berfungsi. </p> <p> Jika Anda mengalami kesalahan ini, jangan takut karena metode berikut akan memperbaiki kesalahan VIDEO_TDR_FAILURE lebih cepat dari yang Anda harapkan. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Perbarui dan Instal Ulang Driver Tampilan </h2> <p> Seperti disebutkan di atas, kesalahan biasanya disebabkan oleh driver tampilan yang tidak berfungsi atau ketinggalan zaman. Dengan demikian, Anda harus memperbarui driver kartu grafis Anda. Jika itu tidak memperbaikinya, instal ulang. Tergantung pada kartu grafis Anda, Anda mungkin menemukan nama file yang berbeda terkait dengan kesalahan. </p> <ol> <li> Untuk pengguna Nvidia, ini adalah <strong> nvlddmkm.sys </strong> . Jika Anda adalah pengguna Nvidia, berikut adalah <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 cara mudah untuk memperbaiki kesalahan. </a> </li> <li> Untuk pengguna AMD, kesalahan muncul sebagai <strong> atikmpag.sys </strong> . </li> <li> Untuk pengguna Intel HD, kesalahannya adalah <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> Cara Memperbarui Driver Tampilan </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> tekan <strong> Tombol Windows + R </strong> untuk membuka perintah Jalankan. Ketik <strong> devmgmt.msc </strong> dan tekan Enter. </li> <li> Dalam <strong> Pengaturan perangkat </strong> jendela, navigasikan ke <strong> Display adapter </strong> dan memperluasnya. </li> <li> Klik kanan adaptor layar Anda, lalu pilih <strong> Perbarui driver </strong> . </li> <li> Pilih <strong> Cari secara otomatis untuk perangkat lunak driver yang diperbarui </strong> . </li> <li> Windows akan secara otomatis mencari web dan mengunduh driver yang diperlukan. Pastikan Anda memiliki koneksi internet aktif saat melakukannya. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> Cara Menginstal Ulang Driver Tampilan </h3> <p> Jika kegagalan video tdr BSOD berlanjut setelah memperbarui driver tampilan, yang terbaik adalah menginstal ulang driver ini. Disarankan untuk melakukannya saat Windows di-boot ke mode aman. Tetapi sebelum melakukan itu, Anda harus menuju ke situs web produsen kartu grafis Anda dan mengunduh versi terbaru dari driver grafis. </p> <p> Manufaktur yang paling umum adalah <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> , dan <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intel </a> . </p> <p> Untuk mem-boot ke mode aman, ikuti langkah-langkah ini: </p> <ol> <li> tekan <strong> Tombol Windows + R, </strong> dan di kotak dialog Jalankan, ketik <strong> msconfig, </strong> dan tekan Enter. </li> <li> Dalam <strong> Sistem konfigurasi </strong> jendela, klik pada <strong> Boot </strong> tab. </li> <li> Sekarang centang <strong> Mode aman </strong> kotak centang yang terletak di bagian bawah. </li> <li> Terapkan pengaturan dan Restart komputer Anda. </li> </ol> <p> Setelah boot ke safe mode, saatnya untuk menginstal ulang driver tampilan. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> Di bilah pencarian menu Mulai, ketik <strong> Pengaturan perangkat </strong> dan membukanya. </li> <li> Mencari <strong> Display adapter </strong> dan memperluas menu. </li> <li> Klik kanan pada GPU Anda dan klik <strong> Copot pemasangan perangkat </strong> . </li> <li> Di wizard uninstall, pastikan untuk memeriksa <strong> Hapus perangkat lunak driver untuk perangkat ini </strong> kotak. </li> <li> Tunggu hingga Windows menghapus instalan perangkat dan mulai ulang komputer Anda. </li> <li> Sekarang, instal ulang driver grafis yang Anda unduh sebelumnya. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Gunakan SFC untuk Memindai dan Memperbaiki File Sistem </h2> <p> SFC adalah utilitas Windows bawaan yang dapat digunakan untuk memindai dan memperbaiki file sistem yang rusak. Dalam kasus BSOD, kemungkinan besar beberapa file sistem rusak sehingga menjalankan utilitas ini sangat penting. Itu hanya salah satu dari <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> beberapa utilitas yang berguna tersedia </a> di pembuangan pengguna Windows. </p> <p> Untuk menjalankan SFC, cukup ikuti langkah-langkah ini: </p> <ol> <li> Di bilah pencarian menu Mulai, ketik <strong> cmd </strong> . </li> <li> Klik kanan pada <strong> Prompt Perintah </strong> dan pilih <strong> Jalankan sebagai administrator </strong> . </li> <li> Di konsol, ketik <strong> sfc /scannow </strong> dan tekan Enter. </li> <li> Setelah proses pemindaian dan perbaikan selesai, reboot komputer Anda. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Jalankan Perbaikan Startup </h2> <p> Untuk pengguna yang mendapatkan kesalahan segera setelah mereka mem-boot Windows 10 atau segera setelah masuk, perbaikan Startup adalah anugerah. Fitur Windows ini memeriksa anomali saat startup dan segera memperbaikinya. </p> <p> Karena bagian ini ditujukan untuk pengguna yang komputernya tidak dapat digunakan karena kesalahan, yaitu, mereka tidak dapat membuka <strong> Pengaturan </strong> , mereka harus melakukan boot ulang keras untuk memasuki Lingkungan Pemulihan Windows (winRE). </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Ikuti langkah-langkah ini untuk boot ke Lingkungan Pemulihan Windows: </p> <ol> <li> Tekan dan tahan tombol Daya hingga PC Anda mati. </li> <li> Tekan tombol Daya lagi untuk mem-boot PC Anda. </li> <li> Ulangi langkah pertama dan kedua hingga PC masuk ke mode Recovery. Ini akan menjadi layar biru. </li> <li> Pada layar Pemulihan, klik <strong> Lihat opsi perbaikan lanjutan </strong> . </li> <li> Di layar berikutnya, klik <strong> Memecahkan masalah </strong> </li> <li> Klik <strong> Opsi Lanjutan </strong> </li> <li> Klik <strong> Perbaikan Startup </strong> dan masukkan kredensial Anda saat diminta. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Ubah Pengaturan Manajemen Daya Anda </h2> <p> Pengaturan manajemen daya Windows biasanya dioptimalkan dengan baik, tetapi terkadang pengaturan tersebut dapat mengganggu cara komputer Anda menangani grafik. Hal ini terutama benar ketika komputer memiliki GPU yang tersembunyi. Pengaturan optimal untuk menghindari VIDEO_TDR_FAILURE BSOD diberikan di bawah ini: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> Di bilah pencarian menu Mulai, ketik <strong> Panel kendali </strong> dan membukanya. </li> <li> Di bilah pencarian Panel Kontrol, masukkan &quot;opsi daya&quot; dan tekan Enter. </li> <li> Klik <strong> Opsi Daya, </strong> dan di sebelah paket daya yang Anda gunakan, klik <strong> Ubah pengaturan rencana. </strong> </li> <li> Klik <strong> Ubah pengaturan daya lanjutan. </strong> </li> <li> Mencari <strong> PCI E </strong><strong> xpress </strong> dan memperluasnya. </li> <li> Putar <strong> Manajemen Daya Negara Tautan </strong> pengaturan ke <strong> Mati </strong> . </li> <li> Simpan perubahan dan reboot komputer Anda. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Bersihkan Komputer Anda </h2> <p> Terlalu panas bukanlah hal yang baik, dan biasanya, alasan di baliknya adalah penumpukan debu. Sebaiknya pengguna membersihkan komponen PC mereka dari debu setiap bulan. Tetapi berhati-hatilah. Itu harus dilakukan dengan lembut. </p> <p> Pastikan untuk membersihkan bagian atas kartu grafis, kipas CPU, unit catu daya, dan kipas kabinet. Secara keseluruhan, pastikan untuk menghindari <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> kesalahan perawatan yang dapat merusak komponen mahal. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Periksa Komponen Perangkat Keras </h2> <p> Jika kesalahan masih muncul setelah mencoba semua yang tercantum di atas, mungkin ada kesalahan pada perangkat keras itu sendiri. Pengguna yang memiliki kartu grafis khusus harus melepasnya dan mem-boot komputer. Jika kesalahan teratasi, maka itu adalah kesalahan perangkat keras di GPU itu sendiri. Anda dapat mencoba menghubungi pabrikan dan mencoba mengganti unit Anda. </p> <p> </p> <p> Saat menggunakan grafik onboard, coba nonaktifkan dan boot. Untuk menonaktifkannya, ikuti langkah-langkah berikut: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> tekan <strong> Tombol Windows + R, </strong> Tipe <strong> devmgmt.msc </strong> di kotak teks Jalankan, dan tekan Enter. </li> <li> Di <strong> Pengaturan perangkat </strong> , mencari <strong> Display adapter </strong> dan memperluas menu. </li> <li> Klik kanan pada GPU onboard Anda dan klik <strong> Nonaktifkan perangkat </strong> . </li> <li> Nyalakan ulang komputer dan periksa apakah kesalahan telah teratasi. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> Kesalahan &quot;Kegagalan TDR Video&quot; Berhasil Diselesaikan </h2> <p> Bagi sebagian besar pengguna, pembaruan sederhana atau instal ulang driver tampilan mereka akan memperbaiki masalah. Namun jika masalah semakin parah, Anda mungkin harus menyetel ulang PC atau mengganti beberapa perangkat keras. </p>"}