{"title":"Cara Meningkatkan Perhatian Anda Dengan Praktik Keamanan yang Baik","content":"<p> Keamanan siber tidak bisa dianggap enteng. Kemudian lagi, ancaman terus-menerus dari peretas yang mendapatkan detail pribadi Anda adalah pemikiran yang menakutkan dan dapat menyebabkan stres yang cukup besar. Tetapi Anda tidak perlu khawatir jika Anda mengamankan perangkat Anda dengan benar. </p> <p> Untuk melindungi diri Anda dan pengguna lain dari ancaman online, Anda perlu bekerja pada tiga kualitas utama: pengetahuan, kewaspadaan, dan pandangan ke depan. Ini, di samping praktik keamanan yang andal, dapat meningkatkan keselamatan dan perhatian Anda secara keseluruhan. </p> <h2 id=\"learn-about-online-threats-and-how-to-handle-them\"> Pelajari Tentang Ancaman Online dan Cara Menanganinya </h2> <p> Jika Anda tidak tahu seperti apa ancaman online, Anda tidak dapat bertahan melawannya, setidaknya tidak secara efektif atau konsisten. Kenali semuanya <a href=\"https://www.makeuseof.com/tag/viruses-spyware-malware-etc-explained-understanding-online-threats/\" target=\"_blank\" rel=\"nofollow noopener\"> jenis malware yang umum dihadapi pengguna saat ini </a> , dari virus hingga pesan phishing. Pada saat yang sama, jelajahi langkah-langkah keamanan yang baik yang dapat Anda ambil. </p> <p> Pengetahuan keamanan siber menunjukkan dengan tepat tanda-tanda mencurigakan apa yang harus diwaspadai dan bagaimana berperilaku di sekitarnya. Dengan kata lain, pikiran Anda menjadi lebih jernih dan lebih fokus. </p> <p> </p> <p> Mempelajari semua yang ada tentang malware dan bagaimana peretas mengekspos Anda kepada mereka berarti Anda dapat mengenali dan menghindarinya. Sayangnya, banyak orang tidak sepenuhnya mengakui bahaya online sampai mereka menjadi mangsanya sendiri. Tetapi bahkan ini adalah wawasan yang berharga dan dorongan untuk kesadaran Anda tentang situasi tersebut. </p> <p> Studi seperti “Menilai Kehadiran Perhatian Penuh dalam Grup Cyber ​​dan Non-Keamanan Siber” oleh Christopher Wilder di <a href=\"https://nsuworks.nova.edu/cgi/viewcontent.cgi?article=2100&context=gscis_etd\" target=\"_blank\" rel=\"nofollow noopener\"> NSUWorks </a> mengkonfirmasi pentingnya pengetahuan dan pengalaman untuk tetap aman saat online. </p> <p> Pada dasarnya, ambil minat aktif dalam menangani peretas. </p> <p> </p> <h2 id=\"manage-your-security-with-reliable-anti-malware-services\"> Kelola Keamanan Anda Dengan Layanan Anti-Malware yang Andal </h2> <p> Kembangkan pemahaman yang kuat tentang keamanan siber dan Anda telah membuat langkah pertama yang baik dalam mencegah serangan terhadap diri sendiri, serta keluarga, teman, dan kolega. Namun, Anda masih membutuhkan pertahanan yang sebenarnya untuk menangkap ancaman yang menyelinap melewati Anda. </p> <p> Sekali lagi, penelitian adalah kuncinya. Berinvestasi dalam <a href=\"https://www.makeuseof.com/tag/best-security-antivirus-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> alat antivirus komputer terbaik </a> Anda dapat menemukan mungkin ada harganya, tetapi itu berharga. </p> <p> Kepercayaan diri dan keamanan Anda meningkat, sekaligus memungkinkan Anda untuk fokus pada praktik keamanan yang tidak dicakup oleh layanan anti-malware. </p> <p> </p> <h2 id=\"create-secure-passwords-to-strengthen-your-security\"> Buat Kata Sandi Aman untuk Memperkuat Keamanan Anda </h2> <p> <img alt=\"Purple Lock and Key Password\" src=\"images/purple-lock-and-key-password-821.png\" loading=\"lazy\"> </p> <p> Kata sandi Anda adalah penghalang utama antara peretas dan informasi di akun Anda. Setiap platform baru yang Anda ikuti menjadi satu lagi titik serangan potensial, jadi Anda perlu melindungi semuanya, idealnya dengan kunci enkripsi yang unik dan rumit (yaitu kata sandi, kode sandi, atau frasa sandi). </p> <p> Menerapkan ukuran ini sebanyak mungkin tidak hanya membuat Anda tetap aman—ini memberi Anda kendali atas keamanan Anda sendiri. </p> <p> Dan, jika tidak ada yang lain, melacak kata sandi Anda adalah latihan yang baik untuk memori dan keterampilan manajemen Anda. Perhatian Anda secara keseluruhan menjadi aktif sepenuhnya. </p> <p> </p> <p> </p> <h2 id=\"regularly-back-up-data-for-peace-of-mind\"> Cadangkan Data Secara Teratur untuk Ketenangan Pikiran </h2> <p> Yang benar adalah bahwa serangan online dapat terjadi dengan sangat mudah. Yang benar-benar diperlukan, misalnya, adalah kesalahan penilaian dan mengklik sesuatu yang seharusnya tidak Anda miliki. </p> <p> Namun, alih-alih panik dan menghindari internet sama sekali, tetap berpegang pada praktik keamanan terkenal seperti mencadangkan data Anda. </p> <p> Ini adalah salah satu cara paling sederhana untuk mempersiapkan diri jika terjadi kesalahan. Simpan file terpenting Anda atau bahkan semua yang ada di hard drive Anda di perangkat eksternal. Kemudian, jika ransomware menargetkan Anda atau komputer Anda mogok, data Anda akan aman dan sehat. Ini tentang memberi Anda ketenangan pikiran. </p> <p> </p> <h2 id=\"create-mindful-home-and-work-environments\"> Ciptakan Lingkungan Rumah dan Kerja yang Penuh Perhatian </h2> <p> </p> <p> Masalah besar dalam hal serangan siber adalah mereka dapat memengaruhi kontak Anda dan juga Anda. Berhati-hati dengan email, akun media sosial, dan sebagainya membuat banyak orang tetap aman. Dan kami tidak hanya berbicara tentang keluarga dan teman Anda. </p> <p> Seluruh bisnis sering kali berisiko, termasuk karyawan dan pelanggan mereka. Menurut statistik di <a href=\"https://www.varonis.com/blog/cybersecurity-statistics/\" target=\"_blank\" rel=\"nofollow noopener\"> Varonis </a> , peretasan melibatkan 45 persen pelanggaran data pada tahun 2020, sementara 22 persen terjadi melalui phishing, dan 17 persen melalui malware. </p> <p> Ini menunjukkan betapa pentingnya sistem keamanan siber yang menyeluruh dan dengan kesadaran individu memainkan peran penting. Semua orang di lingkaran sosial Anda yang berbeda harus mengikuti praktik keamanan yang baik. Jika tidak, temukan cara halus untuk mendidik dan memotivasi mereka. </p> <p> </p> <p> </p> <h2 id=\"prioritize-tackling-security-weaknesses\"> Prioritaskan Mengatasi Kelemahan Keamanan </h2> <p> Sangat mudah untuk melupakan seberapa banyak keamanan siber yang terlibat. Selain merasa gentar, Anda mungkin meregangkan tubuh saat mencoba menangani semuanya pada saat yang bersamaan. </p> <p> Selain itu, multitasking dapat membuat Anda kurang memperhatikan bagian-bagian individual dari keamanan Anda. </p> <p> Pastikan pikiran Anda benar-benar fokus dan efisien dengan meluangkan waktu untuk memperkuat semua pertahanan Anda. Setelah Anda menyiapkan perangkat lunak anti-malware Anda, misalnya, fokuslah pada pengelolaan pribadi aspek gaya hidup Anda yang lebih kecil namun tidak kalah berisiko. Setiap langkah kecil menambah kesadaran dan keamanan online Anda. </p> <p> Pelajari caranya <a href=\"https://www.makeuseof.com/spot-a-fake-linkedin-profile/\" target=\"_blank\" rel=\"nofollow noopener\"> temukan dan laporkan profil LinkedIn palsu </a> . Persempit akun email Anda yang seharusnya dianggap sebagai spam. Jika Anda mendapatkan SMS mencurigakan dari organisasi yang terkait dengan Anda, hubungi perusahaan secara langsung dan pastikan teks tersebut benar-benar berasal dari mereka. </p> <p> </p> <h2 id=\"manage-stress-levels-boost-your-alertness\"> Kelola Tingkat Stres; Tingkatkan Kewaspadaan Anda </h2> <p> <img alt=\"Stressed in Front of Computer\" src=\"images/stressed-in-front-of-computer-973.jpg\" loading=\"lazy\"> </p> <p> Di atas segalanya, jangan abaikan perhatian emosional Anda. Terlalu banyak stres mempengaruhi kewaspadaan dan produktivitas di semua bagian kehidupan. Ini adalah pola pikir yang berbahaya ketika membuat keputusan penting atau menghadapi penipuan phishing yang cerdik. </p> <p> Mengetahui Anda aman saat aktif online adalah perasaan yang cukup baik, tetapi lihat apa lagi yang dapat Anda lakukan untuk mempertahankan suasana hati yang positif. Sering-seringlah beristirahat, terutama dari pekerjaan yang sulit. Temukan hiburan, aktivitas kebugaran, atau apa pun yang dapat membantu mengisi ulang baterai dan fokus Anda. </p> <p> </p> <h2 id=\"cybersecurity-depends-on-mindfulness\"> Keamanan siber Bergantung pada Perhatian </h2> <p> Perangkat lunak hanya dapat melakukan banyak hal untuk membuat Anda tetap aman saat online. Anda perlu mengambil tindakan sendiri, dan alat terbesar Anda dalam hal ini adalah perhatian penuh. Dengan waktu, pengetahuan, dan pengalaman, Anda dapat mengembangkan dan mengasahnya. </p> <p> Praktik keamanan untuk rumah dan kantor dapat membantu Anda menjadi lebih waspada dan produktif, serta lebih aman untuk berada di sekitar. Mulailah dengan langkah-langkah dasar dan lanjutkan ke cara yang lebih rumit untuk mengubah komputer Anda menjadi benteng, dengan pikiran Anda sebagai kekuatan pendorongnya. </p>"}