{"title":"Co-Founder Netflix Mengkritik Strategi Apple TV+ Video","content":"<p> Mantan CEO Netflix Marc Randolph mengecam strategi video Apple, dengan mengatakan Apple TV+ tertinggal di belakang persaingan karena penawaran gratis perusahaan dan kurangnya konten yang menarik. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple Tidak dalam Streaming &quot;Dengan Kedua Kaki&quot; </h2> <p> Jika Anda bertanya kepada mantan CEO dan salah satu pendiri Netflix Marc Randolph, Apple TV telah diganggu dengan masalah freeloader yang telah berkontribusi pada pertumbuhan layanan yang lesu dibandingkan dengan Netflix, Disney+, dan layanan streaming sukses lainnya. </p> <p> Berbicara kepada <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Yahoo Keuangan </a> , dia mengatakan Apple TV+ membuang-buang energi untuk promosi dan penawaran gratis padahal seharusnya berfokus pada penambahan lebih banyak konten berkualitas untuk meningkatkan nilai. </p> <blockquote> <p> Jika Apple menghabiskan seperempat lebih banyak waktu untuk konten seperti yang mereka lakukan untuk hadiah, mereka benar-benar bisa bermain. Mereka tidak punya alasan [dan] mereka masih tidak melakukannya dengan kedua kaki. Mereka benar-benar harus melakukan hal kewirausahaan dan berjalan ke tepi tebing dan melompat. </p> </blockquote> <p> Melompat dari tepi jurang mungkin lebih mudah diucapkan daripada dilakukan karena Apple TV+ tidak memiliki kekuatan pasar Disney dan pengenalan merek Netflix. Saat ini, ini semua tentang <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney+ vs. Netflix </a> dan layanan streaming mana yang menawarkan nilai terbaik untuk uang kepada calon pelanggan. </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV+ Memiliki Tingkat Churn Tertinggi </h2> <p> Randolph mengambil sikap menentang hadiah dan promosi di pasar streaming, menunjukkan bahwa Apple TV+‌ memiliki &quot;tingkat churn tertinggi&quot; di antara layanan utama. </p> <blockquote> <p> Anda tidak bisa terus-menerus mengganti orang. Anda harus memberi mereka alasan untuk tetap tinggal. </p> </blockquote> <p> MoffettNathanson-HarrisX menemukan bahwa 29 persen dari mereka yang mendaftar melalui gratis tidak berencana untuk berlangganan kembali setelah masa uji coba gratis mereka berakhir, seperti yang dilaporkan oleh <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> Variasi </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> Penawaran Apple TV+ Gratis </h2> <p> Apple telah menawarkan 12 bulan layanan Apple TV+ gratis kepada semua orang yang membeli perangkat baru yang memenuhi syarat dari perusahaan, seperti iPhone baru. Sementara itu, <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple telah memperpanjang langganan gratis selama setahun </a> dua kali bagi mereka yang mendaftar pada tahun 2019. </p> <p> </p> <p> Ini adalah sinyal yang jelas bahwa Apple sendiri tidak percaya bahwa layanan tersebut menyediakan konten yang cukup untuk membenarkan harga yang diminta sebesar $5/bulan. Lihatlah dengan cara lain: Seandainya Apple TV+ melebihi proyeksi internal, Apple pasti sudah membual tentang jumlah pelanggan. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney+ dan Netflix Berikan Persaingan Serius </h2> <p> Baru 15 bulan yang lalu Apple TV+ memulai debutnya pada November 2019. Disney+ segera menyusul. Apple tidak mengungkapkan berapa banyak pelanggan berbayar yang dimiliki Apple TV+, tetapi Disney baru saja melampaui 94 juta pelanggan, jauh melebihi ekspektasinya sendiri. </p> <p> Sebagai perbandingan, Netflix menghitung 204 juta pelanggan yang membayar pada akhir tahun 2020. Disney berharap dapat menandingi Netflix dalam hal pelanggan hanya dalam 12 bulan. </p> <p> </p> <p> Randolph mengatakan Disney+ telah &quot;berjuang ke posisi yang sangat kuat&quot; berkat konten. &quot;Ini benar-benar perang siapa yang siap membuat konten,&quot; tambahnya. </p> <blockquote> <p> Kami melihat aturan baru dari permainan berkembang. Ini bukan hanya mengumumkan, ini bukan hanya promosi --- yang harus Anda tunjukkan adalah bahwa Anda memiliki konten, konten, konten. </p> </blockquote> <p> Memang, game ini tentang konten. Misalnya, seperti yang diuraikan dalam <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> rencananya untuk tahun 2021 </a> , Netflix akan meluncurkan film orisinal baru setiap minggu sepanjang tahun. Sebaliknya, Apple TV+ menampilkan beberapa film seperti drama Perang Dunia II yang dibintangi Tom Hanks, Greyhound (berdasarkan peristiwa nyata), drama asli Palmer yang dibintangi Justin Timberlake, dan On The Rocks karya Sofia Coppola. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> Pendekatan Lambat-Bakar Apple </h2> <p> Apa yang tidak diakui Randolph adalah bahwa Netflix dan Disney+ memiliki konten dalam jumlah besar sejak hari pertama sedangkan Apple TV+ sedang membangun perpustakaan kontennya dari awal. </p> <p> Apple jelas telah memilih pendekatan yang lambat, sebagaimana dibuktikan oleh kelangkaan pertunjukan relatif terhadap Disney+ dan Netflix. Tidak peduli bagaimana Anda melihatnya, strateginya dengan Apple TV+ tampaknya membutuhkan pemikat orang dengan penawaran gratis dengan harapan layanan mengumpulkan konten berkualitas yang cukup untuk mengubah pelanggan gratis menjadi pelanggan yang membayar. </p>"}