{"title":"Cara Membuat Game Papan Sendiri di Tabletop Simulator","content":"<p> Pernah berpikir untuk membuat game untuk dimainkan bersama teman di Tabletop Simulator (TTS)? Atau mungkin Anda adalah pengembang game meja yang ingin membuat game prototipe dan mengujinya secara online. </p> <p> Tidak pernah ada waktu yang lebih baik untuk memanfaatkan lingkungan permainan serbaguna TTS. Hari ini, kami akan mengajari Anda cara melakukannya. </p> <h2 id=\"what-is-tabletop-simulator\"> Apa itu Tabletop Simulator? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Bagi yang belum tahu, Tabletop Simulator (TTS) menyediakan lingkungan 3D untuk bermain game tabletop, baik secara lokal maupun online. Ini menjadi cara yang bagus untuk <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> mainkan permainan papan online dengan teman-teman </a> . </p> <p> Permainan yang dapat dimainkan di TTS mencakup semuanya, mulai dari poker, catur, Dungeons &amp; Dragons, mini-golf, dan bahkan permainan papan terbaru. Game apa pun yang ingin Anda mainkan biasanya tersedia baik sebagai DLC atau di bengkel komunitas. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> Mengapa Menggunakan Simulator Meja? </h2> <p> Jika Anda pernah mencoba membuat game meja fisik, Anda tahu betapa memakan waktu, tidak hanya untuk membangun elemen game, tetapi juga untuk memodifikasi atau menggantinya saat Anda memutuskan untuk mengubah atau merevisi game. </p> <p> Di TTS, segala sesuatu mulai dari warna hingga berat suatu objek dapat diubah dengan mengklik mouse, membuat proses revisi menjadi lancar dan tanpa rasa sakit. </p> <p> Selain itu, mudah untuk melakukan streaming langsung gameplay Anda dan memamerkannya di media sosial dan platform streaming. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> Apa yang Anda Butuhkan untuk Memulai </h2> <p> Sebelum memulai, Anda memerlukan hal berikut: </p> <ul> <li> Akun pengguna Steam </li> <li> Tabletop Simulator diinstal pada PC Anda </li> <li> Gambar JPG dari desain papan dan kartu Anda </li> </ul> <p> <strong> Unduh: </strong> Simulator Meja aktif <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> Uap </a> ($19,99) </p> <p> Merancang elemen permainan paling baik dilakukan dalam perangkat lunak ilustrasi, atau dengan memindai gambar kartu fisik yang telah Anda buat. Pastikan mereka memiliki ekstensi JPG dan disimpan satu per satu. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Membuat Papan dan Mats Pemain </h2> <p> Saat Anda mendesain papan dan objek 2D lainnya, pastikan resolusinya cukup tinggi sehingga Anda dapat mengukurnya dengan benar tanpa kehilangan kualitas. TTS akan mengukurnya secara otomatis saat Anda mengimpornya, dan Anda akan dapat mengubah ukurannya persis seperti yang Anda suka. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Membuat Kartu </h2> <p> Kartu di TTS memiliki tiga aspek: bagian depan kartu, bagian belakang kartu, dan kartu tersembunyi (seperti apa tampilan kartu bagi orang lain di tangan pemain). Anda harus memiliki desain untuk masing-masingnya, meskipun Anda memiliki opsi untuk membuat kartu tersembunyi di bagian belakang kartu saja. </p> <h3 id=\"create-and-arrange-card-faces\"> Buat dan Atur Wajah Kartu </h3> <p> Daripada mengimpor setiap kartu satu per satu, yang terbaik adalah mengimpor semua atau sebagian besar kartu Anda sebagai satu dek. </p> <p> Untuk membuat dek, salin dan tempel setiap desain ke lembar kartu 7x10. Menggunakan template seperti di bawah ini akan membantu Anda memulai. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> Template menggambarkan slot untuk setiap kartu di dek Anda, memungkinkan Anda untuk mengimpor hingga 69 kartu sekaligus. Jika Anda tidak membutuhkan sebanyak itu, Anda dapat membiarkan slot tidak digunakan, dan jika Anda memiliki lebih banyak, Anda dapat menggabungkan deck atau kartu duplikat setelah mengimpor. </p> <p> Namun, Anda tidak harus menggunakan template ini. Sebenarnya, selembar kartu dapat berukuran berapa pun, dan TTS akan secara otomatis mengirisnya menjadi kisi 7x10. </p> <p> Untuk kenyamanan Anda, templat di atas dan templat kartu persegi tersedia di direktori file lokal TTS Anda. </p> <p> Jika Anda tidak yakin di mana file lokal Anda berada, Anda dapat menemukannya melalui perpustakaan Steam Anda dengan membuka <strong> Properti </strong> menu untuk TTS. Pilih <strong> File Lokal </strong> tab dan klik <strong> Jelajahi </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Punggung Kartu </h3> <p> Jika Anda hanya menginginkan satu desain untuk seluruh bagian belakang dek, maka yang Anda butuhkan hanyalah satu gambar JPG dari desain tersebut; tidak ada lembar kartu yang diperlukan. </p> <p> Jika dek Anda akan memiliki beberapa punggung yang unik, Anda harus membuat lembar kartu tambahan dengan desain belakang yang sesuai dengan desain wajah di lembar kartu pertama Anda. Untuk desain wajah di slot satu, tempatkan bagian belakang yang telah ditentukan di slot salah satu lembar belakang Anda. Untuk wajah dua, letakkan punggungnya di slot dua, dan seterusnya. </p> <h3 id=\"hidden-cards\"> Kartu Tersembunyi </h3> <p> Di slot 70 lembar kartu, berlabel &quot;Kartu Tersembunyi untuk Pemain Lain&quot; pada templat, letakkan desain apa pun yang Anda inginkan agar terlihat oleh lawan saat kartu di dek ini ada di tangan pemain. Ini biasanya hitam atau putih solid, atau menampilkan desain belakang dek. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Mengimpor Elemen </h2> <p> Sekarang setelah Anda membuat papan dan dek, Anda siap untuk mulai mengimpor. </p> <p> Sebelum benar-benar menghosting server dengan gim Anda, ada baiknya memulai gim pemain tunggal dan mengimpor elemen sebelumnya. Anda kemudian dapat menyimpan pengaturan dan siap untuk segera memulai ketika pemain tiba. </p> <p> Luncurkan TTS dan klik <strong> Membuat </strong> , lalu pilih <strong> Pemain tunggal </strong> untuk menciptakan lingkungan. Hapus elemen apa pun yang dihasilkan oleh TTS, dan pilih tabel yang Anda inginkan untuk memainkan game Anda. </p> <p> Dengan lingkungan siap, klik click <strong> Objek </strong> di menu atas, lalu pilih select <strong> Adat </strong> kategori. </p> <h3 id=\"boards-and-player-mats\"> Papan dan Mats Pemain </h3> <p> Pilih <strong> Naik </strong> dari <strong> Adat </strong> menu, dan klik di mana pun pada tabel yang Anda inginkan untuk menampilkan papan. Klik kanan di mana saja untuk membuka dialog impor papan. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Jelajahi gambar papan Anda, dan TTS akan menanyakan apakah Anda ingin mengunggahnya ke akun Steam Cloud Anda atau menyimpan file lokal. Unggah file ke cloud jika Anda berencana untuk memainkan game Anda secara online atau di perangkat lain. </p> <p> Anda dapat secara opsional mengunggah gambar Anda di host lain, seperti Dropbox, Photobucket, atau Imgur, dan menempelkan URL di sini. Host eksternal kurang dapat diandalkan, bagaimanapun, dan tidak direkomendasikan. </p> <p> Saat Anda mengunggahnya ke Steam Cloud Anda, TTS akan meminta Anda untuk memberinya nama file. Setelah pengunggahan selesai, klik <strong> Impor </strong> . </p> <p> Dengan papan yang diimpor, Anda sekarang dapat mengecilkan atau memperbesarnya dengan <strong> - </strong> dan <strong> + </strong> tombol pada keyboard Anda. Untuk menguncinya agar tidak dipindahkan secara tidak sengaja selama bermain game, klik kanan pada papan, dan di bawah <strong> Matikan </strong> , klik <strong> Mengunci </strong> . </p> <h3 id=\"card-decks\"> Dek Kartu </h3> <p> Dalam <strong> Objek Kustom </strong> menu, klik <strong> Kartu </strong> . Klik di mana pun pada tabel yang Anda inginkan untuk menampilkan dek, lalu klik kanan untuk memulai impor. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Sesuaikan pengaturan sebagai berikut: </p> <ul> <li> <strong> Tipe: </strong> Ubah ini jika Anda memiliki bentuk tertentu dalam pikiran selain kartu persegi panjang sudut bulat biasa. </li> <li> <strong> Wajah: </strong> Klik <strong> Jelajahi File Lokal </strong> tombol dan temukan lembar kartu wajah Anda. Sekali lagi, kami merekomendasikan opsi Steam Cloud melalui file lokal atau host luar. </li> <li> <strong> Punggung Unik: </strong> Centang opsi ini jika dek Anda akan memiliki beberapa desain belakang, lalu unggah lembar kartu belakang Anda di in <strong> Kembali </strong> kotak. Jika Anda menggunakan satu desain untuk seluruh dek, cukup unggah desain belakang Anda saja. </li> <li> <strong> Lebar dan tinggi: </strong> Sesuaikan ini jika Anda menggunakan rasio yang berbeda dari kartu persegi panjang standar, 10x7. </li> <li> <strong> Jumlah: </strong> Pastikan ini cocok dengan jumlah kartu yang Anda impor. </li> <li> <strong> Ke samping: </strong> Ini mengubah orientasi untuk <strong> Alt Zoom </strong> fungsi di TTS. Biarkan tidak dicentang kecuali Anda ingin kartu muncul menyamping. </li> <li> <strong> Kembali Tersembunyi: </strong> Centang ini jika Anda ingin tampilan tersembunyi dari kartu Anda hanya menjadi bagian belakang kartu. </li> </ul> <p> Ketika pengaturan Anda sudah benar, klik <strong> Impor </strong> . Dek Anda akan muncul di atas meja, dan Anda dapat mulai mengocok dan menangani. </p> <p> Jika Anda ingin kartu Anda memiliki nama untuk membantu menyortir, klik kanan pada satu kartu dan klik <strong> Nama </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Mengimpor Elemen Game Lainnya </h2> <p> Mengimpor objek 2D lainnya mirip dengan proses mengimpor papan. Jangan lupa bahwa TTS memiliki banyak elemen permainan umum, seperti dadu dan patung, yang siap digunakan di <strong> Objek </strong> Tidak bisa. </p> <p> Jika Anda memiliki elemen 3D khusus yang ingin Anda gunakan, ikuti <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> Panduan TTS untuk mengimpor model 3D </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Menyimpan Game Lengkap </h2> <p> Setelah mengatur komponen dalam keadaan pengaturan awal, klik tombol <strong> permainan </strong> tombol di menu atas. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Pilih <strong> Simpan &amp; Muat </strong> dan klik <strong> Simpan permainan </strong> tombol. Beri nama dan klik <strong> Menyimpan </strong> . Sekarang, setiap kali Anda menyelenggarakan game, Anda dapat memuatnya kembali dalam pengaturan yang sempurna dengan mengakses <strong> Simpan &amp; Muat </strong> Tidak bisa. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Memaksimalkan Game Meja Kustom </h2> <p> Merancang dan memainkan game khusus itu mudah di Tabletop Simulator setelah Anda tahu cara melakukannya. Undang teman Anda, atau cari playtester yang siap dan bersedia di <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> komunitas TTS </a> . Sekarang, Anda dapat memamerkan game kustom Anda kepada orang lain! </p>"}