{"title":"Cara Meningkatkan Keterampilan Editing Lightroom Anda: 10 Cara Mudah","content":"<p> Adobe Lightroom adalah salah satu platform pengeditan foto paling terkenal di pasaran. Solusi ini populer tidak hanya karena memiliki begitu banyak fitur yang berguna, tetapi juga karena keramahan penggunanya. </p> <p> Ketika fotografer ingin mengambil kerajinan mereka sedikit lebih serius, hal pertama yang akan mereka lakukan adalah membeli perangkat lunak pengeditan. Tetapi bahkan jika Anda hanya seorang fotografer biasa, Lightroom menawarkan banyak cara untuk membuat teman-teman Anda kagum. </p> <p> Dalam panduan ini, Anda akan menemukan beberapa cara mudah untuk menyempurnakan foto Anda di Lightroom. Kiat-kiat ini berfungsi untuk Lightroom Classic dan Lightroom Creative Cloud. </p> <h2 id=\"use-masking\"> 1. Gunakan Masking </h2> <p> Jika Anda mempertajam foto Anda secara default, Anda akan menambahkan detail ke seluruh gambar—bahkan area yang tidak Anda inginkan. Ini dapat meninggalkan Anda dengan banyak biji-bijian di tempat-tempat yang tidak diinginkan, seperti di langit dan air. </p> <p> Anda juga berisiko membuat foto Anda terlihat lebih seperti gambar daripada sesuatu yang Anda ambil dengan kamera Anda. Untungnya, ada solusi mudah. </p> <p> Di aplikasi Lightroom, gulir ke bawah ke <strong> Detail </strong> . Ketika Anda di sana, pergi ke <strong> Mengasah </strong> &gt; <strong> penyamaran </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Gulir penggeser hingga bagian gambar yang ingin Anda pertajam dipilih. Untuk melihat apa yang Anda sembunyikan, tekan tombol <strong> Alt </strong> tombol pada keyboard Anda secara bersamaan. </p> <p> Setelah Anda menutupi area yang Anda inginkan, gulir penggeser penajaman sebanyak atau sesedikit yang Anda butuhkan. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Gunakan Profil Kamera Alih-alih Yang Default Adobe </h2> <p> Jika Anda mengunggah gambar dalam RAW, Adobe akan menambahkan salah satu profil programnya secara default. Dan sementara ini mungkin membuat gambar Anda terlihat lebih baik dalam beberapa kasus, Anda sering kali lebih baik memilih yang khusus untuk kamera. </p> <p> Saat Anda menggunakan profil kamera, gambar akan menjadi lebih mudah untuk diedit berdasarkan apa yang Anda ambil dengan perangkat Anda. </p> <p> Untuk mengubah profil foto Anda, buka <strong> Profil </strong> &gt; <strong> Pencocokan Kamera </strong> . Anda kemudian dapat memilih dari <strong> Standar </strong> , <strong> Netral </strong> , <strong> Pemandangan </strong> , dan penampilan lainnya. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Ingat: </strong> Anda tidak dapat mengubah profil gambar sedalam itu jika Anda hanya mengambil JPEG. Jadi, sebelum pergi keluar untuk mengambil beberapa bidikan, atur kamera Anda ke salah satunya <strong> MENTAH </strong> atau <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Sikat Bagian Gambar Anda </h2> <p> Pernahkah Anda meningkatkan kejernihan, saturasi, atau detail seluruh gambar Anda, mengharapkan sebuah mahakarya, tetapi malah mendapatkan gambar yang tampak seperti diambil dalam microwave? Jika demikian, Anda mungkin mendapat manfaat dari mengutak-atik hanya bagian dari gambar Anda saja. </p> <p> Di Lightroom, Anda dapat mengakses fitur yang disebut <strong> Sikat </strong> . Anda dapat menggunakan ini untuk &quot;menggosok&quot; bagian-bagian gambar Anda sambil membiarkan sisanya. </p> <p> Untuk menggunakan alat ini, buka <strong> Sikat </strong> ikon di sisi kanan layar Anda. Anda dapat membuat kuas Anda lebih besar atau lebih kecil, tergantung pada seberapa banyak gambar yang ingin Anda edit. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Sebelum Anda mulai menyikat, ubah karakteristik gambar yang ingin Anda sesuaikan. Misalnya, Anda dapat menaikkan penggeser kejelasan jika Anda ingin membuat satu bagian gambar lebih jelas. </p> <p> Setelah mengubah fitur ini, sapukan pada area yang ingin Anda edit. tekan <strong> HAI </strong> pada keyboard Anda untuk melihat di mana Anda telah disikat. </p> <p> Jika Anda telah pergi terlalu banyak di area tertentu, tahan tombol <strong> minus </strong> ( <strong> - </strong> ) tombol dan sapukan pada bagian tersebut untuk menghapus hasil edit Anda. Penuh arti <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> pintasan keyboard untuk Adobe Lightroom </a> sangat berguna untuk situasi ini, jadi jangan lupa untuk memolesnya! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Definisikan Foto Anda </h2> <p> Terkadang, kamera Anda akan mengambil foto yang bagian tepinya memiliki warna yang tidak alami. Anda terutama akan melihat ini saat mengambil gambar di bawah sinar matahari yang terik. Mereka terutama datang dalam nuansa hijau dan ungu. </p> <p> Untuk membatasi foto Anda, gulir ke bawah ke <strong> Defringe </strong> . Anda dapat memilih untuk menyingkirkan pinggiran ungu atau hijau. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> Menggunakan <strong> Jumlah </strong> untuk memutuskan berapa banyak defringe yang ingin Anda tambahkan. Geser bilah warna hingga Anda puas dengan hasilnya. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Gunakan Geometri untuk Meluruskan Foto Anda </h2> <p> Tidak peduli seberapa keras Anda mencoba, memegang kamera dengan lurus itu sulit kecuali Anda memiliki tripod. Namun berkat keajaiban perangkat lunak pengeditan, meluruskan gambar Anda menjadi mudah. </p> <p> Di Lightroom, Anda dapat secara otomatis meluruskan foto Anda dengan membuka <strong> Tanaman </strong> bagian. Namun, ada cara yang lebih akurat untuk mencapai hasil yang sama. </p> <p> Di tab sebelah kanan, pilih opsi teratas. Kemudian, gulir ke bawah ke <strong> Geometri </strong> . Ketika Anda di sini, pergi ke <strong> Jujur </strong> &gt; <strong> Tingkat </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> Anda juga dapat menggambar sepanjang garis lurus untuk membuat foto selurus mungkin. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Sesuaikan Ukuran Area Asah Anda </h2> <p> Sekarang Anda tahu tentang penyembunyian, tetapi tahukah Anda bahwa Anda juga dapat mempertajam area tertentu pada foto Anda? </p> <p> Untuk memilih area di dalam foto bertopeng yang ingin Anda pertajam, buka <strong> Mengasah </strong> , tahan <strong> Alt </strong> kunci, dan pergi ke <strong> Radius </strong> . Menyesuaikan penggeser ini memungkinkan Anda untuk membuat area penajaman Anda lebih besar atau lebih kecil. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> Setelah ini, pergi ke <strong> Mengasah </strong> batang. Demikian pula, tahan <strong> Alt </strong> tombol dan gerakkan penggeser ke kanan. Ini akan memudahkan Anda untuk mempertajam area tertentu pada foto Anda, bukan keseluruhan gambar. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Gunakan Kurva Titik Warna </h2> <p> Jika warna gambar Anda tidak terlihat benar bahkan setelah menyesuaikan white balance, Anda mungkin ingin memeriksa kurva titik warna di Lightroom. Anda dapat menggunakannya untuk menyesuaikan warna tertentu pada gambar Anda. </p> <p> Anda akan menemukan tiga panel kurva warna yang berbeda di aplikasi: merah, biru, dan hijau. </p> <p> Untuk mendapatkan kurva warna ini, gulir ke bawah ke <strong> Kurva Titik </strong> . Kemudian, klik pada warna yang ingin Anda ubah. Anda kemudian dapat bermain-main dengan warna dengan cara yang sama seperti yang Anda lakukan pada standar <strong> Kurva Titik </strong> tab. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Ketik Nomor untuk Setiap Slider dan Sesuaikan Sesuai </h2> <p> Seringkali, fotografer baru akan senang dengan jumlah opsi pengeditan yang tersedia bagi mereka. Saat mereka membuka Lightroom, mereka akan menggeser setiap bilah terlalu jauh ke kedua arah. Tetapi alih-alih meningkatkan citra mereka, mereka berakhir dengan kekacauan yang terlalu banyak diedit. </p> <p> Saat mengedit foto Anda, kuncinya adalah membuat perubahan kecil. Kemungkinannya adalah, Anda sudah menjadi fotografer yang baik, dan gambar yang Anda ambil hanya perlu sedikit penyesuaian pascaproduksi. </p> <p> </p> <p> Alih-alih menggerakkan setiap penggeser dengan bebas, coba ubah nomor di area yang ingin Anda ubah <strong> +10 </strong> atau <strong> -10 </strong> . Jika menurut Anda diperlukan lebih banyak pekerjaan, ulangi prosesnya. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Saat Anda merasa sudah dekat, gerakkan perlahan setiap penggeser ke kiri atau ke kanan hingga Anda puas. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Pangkas Foto Anda </h2> <p> Memangkas mungkin tampak jelas, tetapi banyak fotografer masih kurang memanfaatkan fitur ini. Penting juga untuk memotong gambar Anda tergantung di mana Anda akan menggunakannya. Jika tidak, mereka akan terdistorsi. </p> <p> Untuk memotong foto Anda, buka <strong> Tanaman </strong> ikon. Ini adalah yang tertinggi kedua dari atas. Pergi ke <strong> Rasio Aspek </strong> untuk mengubah ukuran, dan seret sudut untuk menyingkirkan objek yang tidak diinginkan. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> Setelah Anda selesai memotong, tekan tombol <strong> Memasukkan </strong> di komputer Anda, dan perubahan akan berlaku. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Gunakan Histogram </h2> <p> Histogram Lightroom mudah diabaikan tetapi penting untuk diketahui. Grafik kecil ini akan menunjukkan kepada Anda di mana warna dan pencahayaan yang tidak sama dalam gambar Anda, memungkinkan Anda untuk membuat pengeditan yang lebih bersih. </p> <p> Sebagai aturan praktis, foto yang diedit dengan baik akan memiliki sedikit paku pada histogram. Terkadang, ini tidak bisa dihindari. Tetapi secara umum, Anda harus melihat untuk membuat grafik itu sedatar mungkin. </p> <p> Bergantung pada versi Lightroom yang Anda gunakan, Anda dapat memanipulasi histogram kurang lebih secara langsung. Di Lightroom Classic, Anda dapat mengklik histogram dan meratakannya dengan menggeser pada bagian tertentu. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> Di Creative Cloud, histogram juga terlihat di sudut kanan atas—tetapi Anda harus mengubah sendiri penggeser agar histogram dapat bergerak. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> Pada kedua versi platform, histogram tersedia di bagian atas layar Anda di atas fungsi pengeditan. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> Pengeditan Hebat Bukan Hanya untuk Pro </h2> <p> Lightroom adalah perangkat lunak pengeditan yang sangat baik bagi siapa saja yang ingin membawa fotografi mereka ke tingkat berikutnya. Dan bahkan jika Anda belum pernah menggunakan platform sebelumnya, Anda tidak perlu khawatir, karena mudah dipelajari. </p> <p> Saat mengedit foto Anda di Lightroom, ingatlah bahwa lebih sedikit lebih sering. Seiring dengan mempertimbangkan tip-tip ini, ada baiknya untuk mundur setelah mengedit dan kembali lagi nanti untuk melihat apakah mereka telah diedit sebaik yang Anda kira. </p>"}