{"title":"Cara Mengelola Grup Pengguna Dengan Groupadd di Linux","content":"<p> Manajemen pengguna cukup mudah jika Anda menjalankan Linux di komputer pribadi Anda. Namun, bagi mereka yang memiliki server dengan ribuan pengguna, manajemen menjadi masalah serius yang harus diperhatikan. </p> <p> Untungnya, sistem operasi berbasis Linux memberi Anda cara untuk mengontrol dan mengelola pengguna di sistem Anda. Anda dapat membuat grup dan menambahkan pengguna ke dalamnya. Kemudian, alih-alih menetapkan izin ke setiap pengguna di sistem, Anda dapat dengan mudah mengotorisasi grup pengguna dengan memberi mereka hak istimewa yang terkait dengan alur kerja sistem. </p> <h2 id=\"create-user-groups-on-linux\"> Buat Grup Pengguna di Linux </h2> <p> Linux hadir dengan perintah default untuk membuat grup pengguna. Anda dapat menggunakan <strong> grupadd </strong> perintah untuk menambahkan grup baru ke sistem Anda. Sintaks dasar dari perintah tersebut adalah: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> Untuk membuat &#39;penulis&#39; grup pengguna baru: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> Menjalankan perintah yang disebutkan di atas akan menambahkan entri baru ke <strong> /etc/grup </strong> dan <strong> /etc/gshadow </strong> file di sistem Anda. Anda dapat memeriksa entri grup baru di file dengan mengetik <strong> kucing /etc/group </strong> dan <strong> kucing /etc/gshadow </strong> di terminal Anda. </p> <p> Perhatikan bahwa hanya pengguna dengan izin administratif yang dapat membuat grup pengguna. Jangan lupa untuk beralih ke superuser sebelum menjalankan perintah groupadd. </p> <p> Jika Anda mencoba membuat grup dengan nama yang sudah ada, Anda akan melihat kesalahan yang menyatakan: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> Namun, Anda dapat mengabaikan kesalahan dengan menggunakan <strong> -f </strong> atau <strong> --memaksa </strong> bendera dengan perintah. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Buat Grup Pengguna Dengan GID Unik </h3> <p> Saat Anda membuat grup pengguna baru, sistem secara otomatis memberinya ID Grup atau GID. Jika Anda ingin grup Anda memiliki ID grup tertentu, Anda dapat melakukannya dengan menggunakan <strong> -g </strong> atau <strong> --gid </strong> bendera. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Jika Anda mencoba menetapkan ID grup yang sudah diambil, kesalahan berikut akan terjadi. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Meskipun tidak disarankan tetapi Anda dapat menambahkan add <strong> -Hai </strong> atau <strong> --non-unik </strong> bendera untuk secara paksa menetapkan ID grup. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Buat Grup Pengguna Dengan Kata Sandi </h3> <p> Meskipun Anda dapat menambahkan kata sandi ke grup Anda, kata sandi itu tidak berguna secara praktis bagi pengguna. Itu <strong> -p </strong> flag memungkinkan Anda menentukan kata sandi untuk grup pengguna Anda. </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Buat Grup Sistem di Linux </h3> <p> Ada sedikit perbedaan antara grup sistem dan grup reguler. Grup sistem adalah grup khusus yang mencakup pengguna yang bertanggung jawab untuk melakukan operasi sistem seperti pencadangan dan pemeliharaan. </p> <p> Menggunakan <strong> -r </strong> atau <strong> --sistem </strong> tandai untuk membuat grup sistem di Linux: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Dapatkan Daftar Anggota di Grup Pengguna </h3> <p> Untuk mengetahui berapa banyak anggota yang merupakan bagian dari grup tertentu, Anda dapat menggunakan <strong> getent </strong> perintah dari terminal Anda. Perintah berikut akan menampilkan daftar semua anggota yang ada di grup &#39;penulis&#39;: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Tambahkan Pengguna ke Grup </h2> <p> Sekarang Anda telah membuat grup pengguna di sistem Anda, sekarang saatnya untuk menambahkan beberapa pengguna ke dalamnya. Usermod adalah utilitas baris perintah yang kuat karena berisi berbagai opsi yang terkait dengan manajemen dan moderasi pengguna. Ini juga memungkinkan Anda untuk menambahkan pengguna ke grup Anda dengan mudah. Sintaks dasar dari perintah tersebut adalah: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Tambahkan Pengguna yang Ada ke Grup </h3> <p> Jika Anda ingin menambahkan pengguna yang sudah ada ke grup Anda, <strong> -Sebuah </strong> dan <strong> -G </strong> bendera adalah apa yang Anda butuhkan. Itu <strong> -G </strong> bendera berarti kelompok, sedangkan <strong> -Sebuah </strong> singkatan dari menambahkan, menambah, atau menambah. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> Anda juga dapat menambahkan pengguna ke beberapa grup. Yang harus Anda lakukan adalah memasukkan nama grup yang dipisahkan dengan koma. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Tambahkan Pengguna Baru ke Grup </h3> <p> Anda dapat menggunakan <strong> tambahkan pengguna </strong> perintah ketika Anda ingin <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> tambahkan pengguna baru ke sistem Linux Anda </a> . Useradd memberi Anda cara untuk menetapkan grup ke pengguna pada saat pembuatannya. Itu <strong> -G </strong> flag memungkinkan Anda untuk menentukan grup kepada pengguna. </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> Menambahkan pengguna ke beberapa grup juga mudah. Cukup berikan nama grup yang dipisahkan oleh karakter koma dalam perintah default. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Hapus Pengguna Dari Grup </h2> <p> Anda juga dapat menghapus pengguna dari grup menggunakan <strong> mod pengguna </strong> . Perlu diingat bahwa dalam sistem Linux, beberapa grup dapat ditetapkan ke pengguna. Salah satu dari kelompok tersebut dinyatakan sebagai kelompok Primer, sementara yang lain disebut sebagai kelompok sekunder. </p> <p> Jika Anda mencoba menghapus pengguna dari grup, pastikan pengguna tersebut memiliki setidaknya satu grup utama setelah penghapusan. Misalnya, pengguna &#39;acak&#39; adalah bagian dari grup admin, penulis, dan editor; di mana admin adalah grup utama, dan sisanya adalah grup sekunder. </p> <p> Anda hanya dapat menghapus pengguna dari penulis dan editor grup. Dan untuk melakukannya, Anda harus memberikan nama grup yang Anda inginkan agar pengguna tetap menjadi anggota. Ini berarti, untuk menghapus pengguna &#39;acak&#39; dari editor grup, perintah berikut digunakan: </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> Perhatikan bahwa yang harus Anda lakukan hanyalah menelanjangi <strong> tambahkan bendera (-a) </strong> dari perintah yang Anda gunakan untuk menambahkan pengguna ke grup. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Hapus Grup di Linux </h2> <p> Saat Anda tidak ingin menyimpan grup pengguna di sistem Anda lagi, Anda dapat menghapus grup menggunakan <strong> groupdel </strong> perintah. Sintaks perintahnya adalah: </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> Untuk menghapus &#39;penulis&#39; grup pengguna: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Jika Anda mencoba menghapus grup yang tidak ada, Anda akan menerima pesan kesalahan yang menyatakan: </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Mengelola Grup Pengguna di Linux </h2> <p> Manajemen pengguna bisa jadi sulit jika Anda tidak mengetahui perintah Linux yang perlu Anda gunakan. Ini menjadi sangat mudah setelah Anda mengetahui masuk dan keluar dari perintah yang terkait dengan moderasi dan manajemen. </p> <p> Administrator server harus mencoba menggunakan distribusi Linux yang sesuai dengan kebutuhan mereka. Dengan cara ini, mereka akan mendapatkan semua alat dan utilitas yang diperlukan untuk manajemen server langsung dari kelelawar. </p>"}