{"title":"Cara Memperbaiki &quot;SYSTEM THREAD EXCEPTION NOT HANDLED&quot; BSOD Stop Code di Windows 10","content":"<p> &quot;SISTEM THREAD EXCEPTION NOT HANDLED&quot; adalah kesalahan umum Windows 10 yang terjadi terutama karena driver yang kedaluwarsa atau tidak kompatibel. </p> <p> Apa yang membuatnya lebih sulit untuk diperbaiki daripada BSOD lain adalah bahwa banyak driver dapat menyebabkan masalah dan terkadang komputer Anda mungkin tidak mendeteksi semuanya. Itulah mengapa langkah pertama yang harus dilakukan pengguna saat mengatasi kesalahan ini adalah menemukan driver yang tepat yang menyebabkan masalah. </p> <p> Inilah cara Anda memperbaiki pengecualian utas sistem yang tidak ditangani kesalahan pada Windows 10. </p> <h2 id=\"boot-into-safe-mode\"> 1. Boot Ke Safe Mode </h2> <p> Langkah pertama yang harus dilakukan pengguna sebelum mencoba memperbaiki masalah ini adalah mem-boot komputer mereka ke Safe Mode. Bergantung pada preferensi Anda dan apakah Anda dapat mem-boot komputer Anda ke layar masuk, ada beberapa cara untuk melakukannya: </p> <h3 id=\"boot-into-safe-mode-via-settings\"> Boot Ke Safe Mode melalui Pengaturan </h3> <ol> <li> Klik pada <strong> Mulailah </strong> tombol, lalu pilih <strong> Pengaturan </strong> . </li> <li> Navigasi ke <strong> Pembaruan &amp; Keamanan </strong> lalu klik <strong> Pemulihan </strong> . </li> <li> Dibawah <strong> Startup lanjutan, </strong> klik <strong> Restart sekarang. </strong> </li> <li> Saat PC Anda restart, <strong> Pilih opsi </strong> layar akan muncul. </li> <li> Dari sini pergi ke <strong> Pemecahan masalah &gt; Opsi lanjutan &gt; Pengaturan Startup </strong> . Kemudian klik <strong> Mengulang kembali </strong> </li> <li> Saat PC Anda reboot, tekan <strong> F5 </strong> untuk mem-boot komputer Anda <strong> Mode aman dengan jaringan </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> Dari Layar Masuk </h3> <ol> <li> Cukup tahan <strong> Bergeser </strong> dan pilih <strong> Kekuasaan </strong> tombol diikuti oleh <strong> Mengulang kembali </strong> . </li> <li> Ikuti langkah 4, 5, dan 6 dari bagian di atas. </li> </ol> <h3 id=\"from-a-blank-screen\"> Dari Layar Kosong </h3> <ol> <li> Jika Anda tidak dapat mencapai layar masuk, ikuti langkah-langkah ini. </li> <li> Tahan tombol daya pada perangkat Anda selama 10 detik untuk mematikannya. </li> <li> Tekan tombol daya lagi untuk mem-boot-nya. </li> <li> Segera setelah PC Anda mulai, yaitu logo pabrikan muncul, tekan tombol daya lagi selama 10 detik. </li> <li> Tekan tombol daya untuk memulai perangkat Anda. </li> <li> Jika dilakukan dengan benar, komputer Anda akan boot ke <strong> Lingkungan Pemulihan Windows </strong> . </li> <li> Ikuti langkah 4, 5, dan 6 dari bagian pertama. </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. Menemukan Pengemudi Yang Bertanggung Jawab </h2> <p> Karena kesalahan kemungkinan besar disebabkan oleh driver yang tidak berfungsi, Anda dapat menggunakan Windows Log untuk mencari tahu yang mana. </p> <p> Untuk melakukannya cukup ikuti langkah-langkah ini: </p> <ol> <li> tekan <strong> Tombol Windows + R </strong> dan di <strong> Lari </strong> kotak dialog, ketik <strong> acaravwr. </strong> </li> <li> Navigasikan ke <strong> Log Windows </strong> menu dan perluas, lalu pilih <strong> Sistem. </strong> </li> <li> Cari log bernama <strong> system_thread_exception_not_handled </strong> dan klik untuk mengetahui driver mana yang menyebabkan masalah. </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> Biasanya, driver terkait akan menjadi driver tampilan atau driver jaringan karena ini terkenal menyebabkan BSOD ini. Jika file terkait kebetulan <strong> nvlddmkm.sys </strong> , Anda dapat melihat <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> beberapa cara mudah untuk memperbaikinya. </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. Kembalikan atau Perbarui Driver </h2> <p> Tergantung pada driver mana yang bertanggung jawab atas kesalahan utas sistem yang tidak ditangani, Anda mungkin perlu memperbarui atau menginstal ulang driver terkait. </p> <p> Jika driver belum diperbarui untuk waktu yang lama, maka memperbarui driver kemungkinan besar akan memperbaiki masalah. Jika driver telah diperbarui baru-baru ini, maka mungkin yang terbaik adalah mengembalikan driver atau menginstal ulang pembaruan. </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> Cara Memperbarui Driver di Windows 10 </h3> <ol> <li> tekan <strong> Tombol Windows + R </strong> dan ketik <strong> devmgmt.msc </strong> untuk membuka <strong> Pengaturan perangkat </strong> . </li> <li> Navigasikan ke perangkat terkait dan perluas menu. Misalnya, jika kesalahan disebabkan oleh driver tampilan, Anda harus memperluas <strong> Display adapter </strong> pilihan. </li> <li> Klik kanan pada driver dan klik <strong> Perbarui driver </strong> . </li> <li> Di kotak dialog yang terbuka, klik <strong> Cari secara otomatis untuk perangkat lunak driver yang diperbarui </strong> . </li> <li> Windows kemudian akan secara otomatis mencari web untuk driver terbaru dan menginstalnya. </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> Cara Mengembalikan Driver di Windows 10 </h3> <ol> <li> Buka <strong> Pengaturan perangkat </strong> dan arahkan ke driver yang dimaksud. </li> <li> Perluas menu dan klik kanan pada driver. </li> <li> Klik <strong> Properti </strong> . </li> <li> Di bawah <strong> Sopir </strong> tab, klik <strong> Putar Kembali Driver </strong> . </li> <li> Windows akan secara otomatis mengembalikan ke versi driver terakhir yang tersedia. </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. Ganti Nama File yang Rusak </h2> <p> Setelah mengambil nama file yang terkait dengan pengecualian utas sistem tidak ditangani kesalahan, pengguna harus mengganti nama file. Melakukan hal ini akan menyebabkan Windows membuat salinan baru dan menginstalnya kembali. File driver terletak di <strong> C:\\ Windows\\ System32\\ driver </strong> </p> <p> Ikuti langkah-langkah ini untuk mengganti nama file: </p> <ol> <li> Buka <strong> Penjelajah Berkas </strong> dan pergi ke <strong> C:\\Windows\\System32\\drivers </strong> </li> <li> Cari driver yang terpengaruh </li> <li> Klik dan tekan <strong> F2. </strong> </li> <li> Ganti ekstensi nama file dengan <strong> .tua </strong> . </li> <li> Tekan Enter dan restart komputer Anda. </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. Gunakan SFC dan DISM untuk Memperbaiki File Sistem </h2> <p> SFC dan DISM adalah dua alat canggih yang tersedia untuk digunakan oleh setiap pengguna Windows. Dalam kombinasi, mereka dapat menemukan dan memperbaiki hampir semua kesalahan terkait sistem. Mereka juga cukup sederhana untuk dieksekusi. </p> <p> </p> <p> Pastikan untuk membuat titik pemulihan sistem karena perintah ini mengubah file sistem. </p> <h3 id=\"how-to-use-dism\"> Cara Menggunakan DISM </h3> <ol> <li> Lari <strong> Prompt Perintah </strong> sebagai Administrator </li> <li> Di konsol, ketik <strong> DISM /Online /Cleanup-Image /ScanHealth </strong> dan tekan Enter. </li> <li> Tunggu hingga Windows menyelesaikan pemindaian. Kemudian ketik <strong> DISM /Online /Cleanup-image /RestoreHealth </strong> </li> <li> Windows akan memperbaiki semua masalah yang ditemukan selama pemindaian. </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> Cara Menggunakan SFC </h3> <ol> <li> Di bilah pencarian menu Mulai, ketik <strong> cmd </strong> lalu klik kanan pada <strong> Prompt Perintah </strong> dan jalankan sebagai administrator. </li> <li> Di konsol, masukkan <strong> sfc /scannow </strong> </li> <li> Bersabarlah karena Windows akan membutuhkan waktu untuk memindai dan mengganti file sistem yang rusak. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. Gunakan Pemulihan Sistem untuk Memulihkan PC Anda </h2> <p> Jika masalah masih belum terselesaikan, maka Anda harus menggunakan Pemulihan Sistem sebagai upaya terakhir. Pemulihan Sistem adalah fitur yang memulihkan Windows ke kondisi sebelumnya. Titik pemulihan ini dibuat secara berkala dan saat menginstal perangkat lunak baru. Atau, Anda dapat mengatur <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows untuk membuat titik pemulihan setiap hari </a> </p> <h3 id=\"how-to-use-system-restore\"> Cara Menggunakan Pemulihan Sistem </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> Di bilah pencarian menu Mulai, ketik <strong> Panel kendali </strong> dan klik buka. </li> <li> Di bilah pencarian Panel Kontrol, masukkan <strong> Pemulihan </strong> dan buka dari hasilnya. </li> <li> Klik <strong> Buka Pemulihan Sistem </strong> . </li> <li> Klik <strong> Lanjut </strong> dan pilih titik pemulihan dari daftar. </li> <li> Klik <strong> Selesai. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> Pengecualian Ditangani </h2> <p> Kiat yang tercantum di atas memberikan perbaikan mudah untuk gangguan yang disebabkan oleh BSOD seperti system_thread_exception_not_handled. Bagian terbaiknya adalah sebagian besar tip dapat digunakan untuk mendiagnosis banyak kesalahan Blue Screen of Death (BSOD) umum lainnya di Windows juga. </p>"}