{"title":"Cara Melakukan Boot Bersih di Windows 10","content":"<p> Anda mungkin memiliki banyak aplikasi pihak ketiga yang terinstal di komputer Windows Anda. Jangan khawatir, kebanyakan orang begitu. </p> <p> Dari melakukan tugas dasar seperti menjelajah web hingga mengeluarkan baris kode yang rumit, orang lebih suka menggunakan aplikasi alternatif dari yang ada di dalam Windows. Meskipun aplikasi ini membuat hidup kita lebih mudah, terkadang mereka mengganggu fungsi sistem. Ini dapat berkisar dari kecelakaan kecil hingga kesalahan kritis dan BSOD. </p> <p> Di sinilah boot bersih memasuki gambar. </p> <h2 id=\"what-is-a-windows-clean-boot-anyway\"> Apa itu Boot Bersih Windows? </h2> <p> Boot bersih Windows 10 memungkinkan pengguna mengesampingkan aplikasi pihak ketiga sebagai penyebab error. Ini dilakukan hanya dengan mem-boot perangkat dengan semua aplikasi pihak ketiga dinonaktifkan. Dan meskipun namanya terdengar seperti fitur bawaan Windows, sebenarnya tidak. Anda harus membersihkan boot komputer Anda secara manual. </p> <p> Manfaat boot bersih tidak hanya terbatas pada mendiagnosis kesalahan. Telah diketahui membantu ketika <a href=\"https://www.makeuseof.com/tag/fix-windows-update-error-0x80070057/\" target=\"_blank\" rel=\"nofollow noopener\"> Pembaruan Windows tidak terpasang dengan benar </a> . Ini juga sangat berguna saat OS Anda terasa lambat, dan Anda ingin memeriksa apa yang mungkin menyebabkan masalah. </p> <p> </p> <p> </p> <h2 id=\"how-to-clean-boot-and-fix-errors\"> Cara Membersihkan Boot dan Memperbaiki Kesalahan </h2> <p> Boot bersih adalah proses yang relatif sederhana setelah pengguna mencobanya beberapa kali. </p> <p> Sebelum mendaftar langkah-langkahnya, pengguna harus tahu bahwa beberapa tindakan memerlukan hak administrator. Komputer Anda mungkin juga tidak berfungsi seperti biasanya, tetapi Anda tidak perlu khawatir. Ini terjadi karena terkadang pengguna bahkan tidak menyadari bahwa beberapa tugas kasar sedang ditangani oleh perangkat lunak pihak ketiga. </p> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-128.png\" loading=\"lazy\"> </p> <p> Berikut langkah-langkah cara membersihkan boot Windows 10: </p> <ol> <li> Di bilah pencarian menu Mulai, ketik <strong> konfigurasi sys </strong> dan klik <strong> Sistem konfigurasi </strong> . </li> <li> Dalam <strong> Sistem konfigurasi </strong> jendela, pergi ke <strong> Jasa </strong> tab. </li> <li> Periksalah <strong> Sembunyikan semua layanan Microsoft </strong> kotak. </li> <li> Periksa semua layanan dalam daftar dan klik <strong> Menonaktifkan semua </strong> terletak ke arah kanan bawah, lalu simpan dan keluar. </li> <li> Sekarang, buka <strong> Pengelola tugas </strong> . Anda dapat melakukan ini dengan mengklik kanan pada Taskbar dan memilih <strong> Pengelola tugas </strong> atau menggunakan <strong> Ctrl + Alt + Hapus </strong> . </li> <li> Dalam <strong> Pengelola tugas </strong> jendela, navigasikan ke <strong> Memulai </strong> tab. </li> <li> Pilih semua layanan satu per satu dan klik <strong> Nonaktifkan </strong> . </li> <li> keluar <strong> Pengelola tugas </strong> dan <strong> Mengulang kembali </strong> komputer Anda. </li> </ol> <p> <img alt=\"Startup tab in the task manager\" src=\"images/startup-tab-task-manager-383.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"fixing-errors-with-clean-boot\"> Memperbaiki Kesalahan Dengan Boot Bersih </h2> <p> Setelah mengikuti langkah-langkah yang tercantum di atas, Anda <a href=\"https://www.makeuseof.com/tag/clean-computer-original-state-reinstalling-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> PC akan boot ke keadaan bersih. </a> Hal pertama yang harus dilakukan pengguna adalah menunggu dan memeriksa apakah kesalahan yang sama muncul lagi. Terkadang, sumber kesalahan bisa berupa file sistem Windows, dalam hal ini kesalahan akan muncul, tetapi bisa memakan waktu lebih lama daripada saat boot normal. </p> <p> Jika kesalahan tidak muncul, maka saatnya untuk mempersempit tersangka. Ini adalah tugas yang agak membosankan tetapi, sayangnya, juga cara terbaik untuk melakukannya. Untuk mempersempit daftar, lakukan hal berikut: </p> <ol> <li> Saat dalam status boot bersih, buka <strong> Sistem konfigurasi </strong> . </li> <li> Di bawah <strong> Jasa </strong> tab, pilih bagian atas daftar dan klik <strong> Memungkinkan </strong> . Pastikan bahwa <strong> Sembunyikan semua layanan Microsoft </strong> kotak dicentang. </li> <li> Sekarang buka <strong> Pengelola tugas </strong> dan pergi ke <strong> Memulai </strong> tab. </li> <li> Demikian pula, aktifkan bagian atas layanan dan reboot komputer Anda. </li> </ol> <p> Setelah reboot, jika kesalahan tidak muncul, Anda dapat mengesampingkan perangkat lunak dan layanan yang dipilih dari daftar pelakunya. Anda harus mengulangi langkah-langkah ini sampai Anda menemukan program atau layanan yang bertanggung jawab dan menghapusnya. </p> <p> </p> <h2 id=\"clean-boot-windows-10-to-isolate-errors\"> Bersihkan Boot Windows 10 untuk Mengisolasi Kesalahan </h2> <p> Sekarang saatnya untuk me-reboot Windows 10 sebagai standar. Buka saja <strong> Sistem konfigurasi </strong> dan <strong> Pengelola tugas </strong> dan mengaktifkan semua layanan dan program. Disarankan agar pengguna melakukan boot bersih sebelum beralih ke perbaikan lebih lanjut saat Windows mogok atau menampilkan BSOD. </p>"}