{"title":"Disney+ Mendekati 100 Juta Pelanggan","content":"<p> Jangan pernah meremehkan Disney. Meskipun Disney+ baru diluncurkan di AS pada November 2019, layanan streaming tersebut kini memiliki hampir 100 juta pelanggan. Ini pertumbuhan yang bahkan tidak diharapkan perusahaan. </p> <h2 id=\"how-many-customers-does-disney-have\"> Berapa Banyak Pelanggan yang Dimiliki Disney+? </h2> <p> Seperti yang diumumkan di <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Laporan pendapatan Q1 Disney 2021 </a> , Disney+ memiliki 94,9 juta pelanggan secara global, per 2 Januari 2021. </p> <p> Artinya, angka tersebut tidak memperhitungkan pelanggan yang diperoleh melalui keberhasilan rilis WandaVision. Tidaklah adil untuk berasumsi bahwa Disney+ sekarang memiliki lebih dari 100 juta pelanggan. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Angka terakhir dilaporkan pada Desember 2020, ketika Disney mengumumkan telah mengantongi 86 juta pelanggan untuk layanan streaming titulernya. Lompatan sejak saat itu kemungkinan dapat dikaitkan dengan konten eksklusif yang kuat seperti musim kedua The Mandalorian dan film fitur Pixar Soul. </p> <p> Pendapatan bulanan rata-rata per pelanggan turun dari $5,56 tahun lalu menjadi $4,04 hari ini, yang sebagian besar dapat diperhitungkan dengan biaya layanan yang lebih murah di India dan Indonesia. </p> <p> Hulu dan ESPN+, layanan streaming yang juga dimiliki oleh Disney, juga mengalami pertumbuhan yang kuat. Yang pertama tumbuh 30% dari tahun ke tahun menjadi 39,4 juta pelanggan, sedangkan yang kedua tumbuh 83% dari tahun ke tahun dengan total 12,1 juta pelanggan. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney baru-baru ini meluncurkan bundel yang menggabungkan semua layanan streaming </a> , jadi jelas bahwa perusahaan terus mendukung ketiganya. </p> <p> Star juga akan segera diluncurkan di banyak wilayah, yang akan memberikan dorongan besar pada jumlah film dan acara TV yang ditawarkan Disney+. </p>"}