{"title":"Google Menambahkan Dukungan ID Wajah ke Chrome untuk iOS","content":"<p> Google sedang menguji fitur keamanan baru di Chrome 89 untuk iOS yang menggunakan autentikasi biometrik iPhone untuk melindungi tab penjelajahan pribadi Anda. Saat ini terbatas untuk orang-orang di saluran beta Chrome, ini akan memungkinkan Anda mengunci tab Penyamaran dengan ID Wajah atau ID Sentuh. </p> <h2 id=\"even-more-private-private-browsing\"> Bahkan Penjelajahan Pribadi Lebih Pribadi </h2> <p> Semua tab Penyamaran yang dilindungi dengan Face atau Touch ID akan diburamkan di pengalih tab. Tab yang terkunci menjadi terlihat lagi setelah dikonfirmasi dengan otentikasi biometrik iPhone. </p> <p> Fitur bermanfaat ini tidak hanya meningkatkan privasi Anda, tetapi juga memperkuat keamanan Anda saat Anda melakukan banyak tugas di seluruh aplikasi di iPhone atau iPad. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> mencatat bahwa tidak semua pengguna beta dapat mengakses opsi penguncian baru karena komponen sisi server. </p> <p> </p> <h2 id=\"how-s-this-useful\"> Bagaimana Ini Berguna? </h2> <p> Ini juga berguna untuk saat-saat ketika seorang teman mungkin meminta untuk meminjam iPhone Anda untuk mencari sesuatu secara online dengan cepat. Dengan perlindungan ID Wajah untuk mode penjelajahan pribadi Chrome, mereka tidak akan dapat melihat situs web Penyamaran Anda yang terbuka saat beralih tab. </p> <p> </p> <p> &quot;Incognito&quot; adalah nama pemasaran untuk mode penjelajahan pribadi Chrome. Saat penyamaran, Anda dapat menjelajahi web tanpa Chrome menyimpan informasi apa pun tentang sesi tersebut. Saat Anda menutup jendela penyamaran, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> semua informasi pada sesi itu menghilang </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> Cara Mengaktifkan ID Wajah atau Sentuh di Chrome </h2> <p> Fitur baru yang akan datang ini harus diaktifkan secara manual di bagian Privasi pada pengaturan dalam aplikasi Chrome. Kunci privasi serupa hadir di aplikasi Google lainnya. </p> <p> Di aplikasi Penelusuran asli, misalnya, autentikasi biometrik iPhone mengonfirmasi identitas Anda saat kembali ke sesi Penyamaran setelah 15 menit. Autentikasi Face atau Touch ID opsional juga tersedia di Google Drive untuk melindungi file Anda saat Anda keluar dari aplikasi. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> Kapan Fitur Rilis Secara Resmi? </h2> <p> Belum ada kabar kapan opsi penguncian baru mungkin diluncurkan untuk semua orang, tetapi Chrome 89 diperkirakan akan dirilis untuk konsumsi publik bulan depan. Google juga dapat memutuskan untuk tidak merilis fitur tersebut sama sekali meskipun tercantum dalam catatan rilis resmi. </p>"}