{"title":"HBO Max Akan Diluncurkan di Amerika Latin pada Bulan Juni","content":"<p> HBO Max, layanan streaming dari WarnerMedia, diluncurkan di seluruh Amerika Latin dan Karibia pada Juni 2021. Ini adalah pertama kalinya layanan tersebut akan tersedia di luar AS. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> Di mana HBO Max Diluncurkan di Amerika Latin? </h2> <p> Saat ini, HBO Max hanya tersedia di AS. Datang akhir Juni 2021, itu akan tersedia di banyak negara di Amerika Latin dan Karibia. Berita itu diumumkan di <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> Siaran pers WarnerMedia </a> . </p> <p> Secara khusus, negara-negara tersebut adalah: Anguilla, Antigua, Argentina, Aruba, Kepulauan Virgin Inggris, Bahama, Barbados, Belize, Bolivia, Brasil, Kepulauan Cayman, Chili, Kolombia, Kosta Rika, Curacao, Dominika, Republik Dominika, Ekuador, El Salvador , Grenada, Guatemala, Guyana, Haiti, Honduras, Jamaika, Meksiko, Montserrat, Nikaragua, Panama, Paraguay, Peru, St. Kitts dan Nevis, St. Lucia, St. Vincent, Suriname, Trinidad dan Tobago, Turks dan Caicos, Uruguay , dan Venezuela. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> Apa yang Akan Ditawarkan HBO Max di Amerika Latin? </h2> <p> </p> <p> Pelanggan HBO GO yang sudah ada yang membayar langsung atau melalui &quot;mitra yang memenuhi syarat&quot; akan mendapatkan akses instan ke HBO Max. HBO GO kemudian akan dihapus secara bertahap di seluruh wilayah. </p> <p> Detail harga belum diumumkan, meskipun dijanjikan dalam beberapa bulan ke depan, bersama dengan informasi tentang konten baru dan penawaran promosi. </p> <p> Seperti halnya di AS, HBO Max akan menawarkan berbagai paket berlangganan dan perangkat pendukung seperti smartphone, tablet, dan platform pintar lainnya. </p> <p> </p> <p> Dalam trailer yang mengumumkan berita tersebut, klip dari serial seperti Game of Thrones and Friends dapat dilihat, bersama dengan film seperti The Matrix dan Casablanca. Namun, sebuah pesan kecil muncul di bagian akhir untuk memperingatkan bahwa &quot;tidak semua judul [akan] tersedia saat peluncuran&quot;. </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> Kapan HBO Max Akan Tersedia Secara Global? </h2> <p> Tahun lalu, Warner Bros. secara kontroversial mengumumkan bahwa mereka berencana untuk merilis seluruh daftar teater 2021 ke HBO Max. Itu menyebabkan sutradara <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Christopher Nolan menyebut HBO Max &quot;layanan streaming terburuk&quot; </a> . </p> <p> Namun demikian, sementara beberapa industri film mungkin mengeluh, ini adalah langkah pro-pilihan yang bagus bagi konsumen. </p> <p> Dengan demikian, orang-orang di Amerika Latin dan Karibia kemungkinan akan bersemangat untuk peluncuran HBO Max, dengan harapan kesepakatan itu juga berlaku untuk mereka. </p> <p> Adapun seluruh dunia? Tidak ada tanggal pasti yang ditetapkan, tetapi WarnerMedia mengungkapkan bahwa Nordik, Spanyol, Eropa Tengah, dan Portugal dijadwalkan untuk ditingkatkan ke HBO Max akhir tahun ini. </p> <p> Johannes Larcher, kepala HBO Max International, mengatakan: </p> <blockquote> <p> Kami sangat senang atas peluncuran HBO Max di Amerika Latin dan Karibia, yang merupakan langkah pertama dalam menghadirkan layanan Direct-to-Consumer WarnerMedia kepada konsumen di luar AS, dan di seluruh dunia. </p> </blockquote>"}