{"title":"iPhone 13 Dapat Membanggakan Tampilan &quot;Selalu Aktif&quot;","content":"<p> Apple memperkenalkan layar &quot;selalu aktif&quot; untuk Apple Watch Series 5 pada 2019. Beberapa tahun kemudian, itu dapat diatur untuk tiba di iPhone, menurut reporter Max Weinbach, yang berbagi informasi dengan saluran YouTube <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> SemuanyaApplePro </a> . </p> <p> Laporan tersebut mengklaim bahwa iPhone 13---jika Apple memang memutuskan untuk menamainya---akan secara permanen beberapa bagian layar menyala untuk menampilkan detail tertentu. </p> <h2 id=\"how-always-on-display-will-work\"> Bagaimana Tampilan &quot;Selalu Aktif&quot; Akan Bekerja </h2> <p> Detail ini dapat mencakup ikon jam dan baterai. Mereka akan tetap terlihat bahkan ketika iPhone terkunci, artinya iPhone tidak digunakan secara aktif oleh pengguna. Pemberitahuan, seperti pemberitahuan pesan baru, hanya akan menyala sementara. </p> <p> Ini akan menjadi pertama kalinya iPhone hadir dengan teknologi layar &quot;always on&quot;. Namun, ini bukan pertama kalinya teknologi serupa masuk ke smartphone. Nokia memperkenalkan fitur layar &quot;always on&quot; pada awal 2009. Baru-baru ini, fitur ini telah menjadi fitur yang tersedia secara luas di berbagai ponsel Android---termasuk model yang dibuat oleh Huawei, Motorola, Samsung, Google, dan lainnya. </p> <p> Keuntungan besar dan jelas dari &quot;selalu aktif&quot; adalah bahwa pengguna tidak perlu membangunkan atau membuka kunci ponselnya untuk mengakses informasi, meskipun itu adalah sesuatu yang kecil seperti memeriksa waktu. </p> <p> Kelemahannya adalah ia menghabiskan masa pakai baterai ekstra, yang sudah bisa menjadi sesuatu yang premium di smartphone. Namun, layar AMOLED dapat mengurangi dampak baterai ini dengan hanya mengaktifkan piksel pada layar yang diperlukan untuk menampilkan informasi. </p> <p> Dengan kata lain, tampilan &quot;selalu menyala&quot; ini selalu menyala dalam pengertian teknis --- meskipun sebagian besar layar dimatikan, dan hanya beberapa bagian yang tetap menyala sepanjang waktu. Ini berarti efek pada masa pakai baterai tidak sebesar yang seharusnya. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> Apa yang Diharapkan Dari iPhone 13 </h2> <p> IPhone generasi berikutnya kemungkinan akan tiba pada September 2021. Menurut Weinbach, ia akan membanggakan desain sasis keseluruhan yang sama dengan seri iPhone 12, meskipun akan ada beberapa peningkatan di bawah kap. </p> <p> Ini akan mencakup magnet MagSafe yang lebih kuat, sistem kamera yang ditingkatkan untuk mengambil gambar bulan dan bintang, lensa kamera ultra lebar di seluruh jajaran iPhone, video mode potret (bukan hanya gambar diam), bagian belakang matte yang disempurnakan, dan A- chip seri. Laporan sebelumnya mengklaim Apple mungkin <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> perkenalkan Touch ID dalam-tampilan </a> sebagai alternatif untuk ID Wajah. </p> <p> Mengingat bahwa ini masih lebih dari setengah tahun lagi, banyak detail baru dapat muncul sebelum Apple memamerkan iPhone berikutnya di Q3. Meskipun demikian, tampaknya pabrik rumor sudah mulai beraksi. Perhatikan ruang ini! </p>"}