{"title":"JPG vs. JPEG: Apa Perbedaan Antara Format File Gambar Ini?","content":"<p> Tidak semua format file gambar dibuat sama. Faktanya, banyak dari mereka dibuat untuk mengatasi masalah yang tidak dapat diselesaikan oleh format yang sudah ada. JPEG, misalnya, muncul karena ukuran file gambar memakan terlalu banyak ruang penyimpanan. </p> <p> Percaya atau tidak, ekstensi file JIF, JPEG, dan JPG kurang lebih mengacu pada hal yang sama. Untuk memahami mengapa format file memiliki begitu banyak nama, kita perlu mengungkap sedikit sejarah yang berbelit-belit. </p> <h2 id=\"what-is-a-jpeg\"> Apa itu JPEG? </h2> <p> Akronim JPEG adalah singkatan dari Joint Photographic Experts Group—jenis file dinamai menurut sub-komite yang membantu membuat standar JPEG Interchange Format (JIF). Ini pertama kali dikeluarkan pada tahun 1992 oleh Organisasi Internasional untuk Standardisasi (ISO). </p> <p> JPEG adalah gambar raster diam 24-bit, dengan delapan bit di setiap saluran model warna RGB. Ini tidak menyisakan ruang untuk saluran alfa, yang berarti bahwa sementara JPEG dapat mendukung lebih dari 16 juta warna, mereka tidak dapat mendukung transparansi. </p> <p> Ketika sebuah gambar disimpan sebagai JPEG, beberapa datanya akan dibuang dalam proses yang disebut sebagai lossy <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> kompresi file </a> . Pada gilirannya, gambar membutuhkan ruang penyimpanan 50-75 persen lebih sedikit (dibandingkan dengan format lama seperti BMP) dengan sedikit atau tanpa kehilangan kualitas gambar yang nyata. </p> <p> Kompresi JPEG didasarkan pada teknik kompresi gambar lossy yang disebut transformasi kosinus diskrit (DCT), yang pertama kali diusulkan oleh insinyur listrik Nasir Ahmed pada tahun 1972. </p> <h3 id=\"what-is-a-jif\"> Apa itu JIF? </h3> <p> Anda dapat menganggap file JIF sebagai JPEG dalam bentuk &quot;paling murni&quot;. Namun, formatnya tidak banyak digunakan lagi karena menghadirkan beberapa batasan yang membuat frustrasi. Misalnya, definisi aspek warna dan piksel dari JIF menyebabkan masalah kompatibilitas antara encoder dan decoder (pemirsa). </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> Untungnya, masalah ini kemudian diatasi dengan standar &quot;tambahan&quot; lainnya yang dibangun di atas JIF. Yang pertama adalah Format Pertukaran File JPEG (JFIF), dan kemudian, <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Format file gambar yang dapat ditukar </a> (Exif) dan profil warna ICC. </p> <p> JPEG/JFIF adalah format paling populer saat ini untuk menyimpan dan mentransmisikan gambar fotografi di internet, sedangkan JPEG/Exif adalah untuk kamera digital dan perangkat pengambilan gambar lainnya. Kebanyakan orang tidak membedakan perbedaan antara variasi ini dan hanya menyebut keduanya sebagai JPEG saja. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> Apa itu JPG2 atau JPF? </h3> <p> Pada tahun 2000, grup JPEG merilis format file gambar lain yang disebut JPEG 2000 (ekstensi filenya adalah JPG2 dan JPF). Itu dimaksudkan untuk menjadi penerus JPEG, tetapi tidak sepopuler itu. Bahkan ketika metode pengkodean canggihnya sering menghasilkan gambar dengan kualitas yang lebih baik. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Kredit Gambar: Dake/ <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Format file JPEG 2000 gagal karena beberapa alasan. Pertama, ini didasarkan pada kode yang sama sekali baru dan karenanya tidak kompatibel dengan JPEG. Selain itu, menangani file JPEG 2000 membutuhkan lebih banyak memori untuk diproses, yang merupakan pemecah masalah saat itu. Lagi pula, rata-rata komputer pada saat itu hanya memiliki memori 64 MB. </p> <p> JPEG 2000 telah melihat sedikit kebangkitan sekarang karena perangkat keras komputer, secara umum, telah meningkat pesat selama 20 tahun terakhir, tetapi format file masih sangat kurang digunakan. Satu-satunya browser internet yang mendukung file JPEG 2000 pada saat penulisan ini adalah Safari. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG vs. JPG </h3> <p> Versi awal Windows (khususnya sistem file MS-DOS 8.3 dan FAT-16) memiliki batas maksimum 3 huruf dalam hal panjang ekstensi file. JPEG harus disingkat menjadi JPG agar tidak melebihi batas. Komputer Mac dan Linux tidak pernah memiliki hal seperti itu, sehingga pengguna akan terus menyimpan gambar sebagai JPEG. </p> <p> </p> <p> Program pengeditan gambar populer yang bekerja di berbagai sistem operasi—seperti Photoshop dan <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> gimpo </a> —pada akhirnya akan menyetel ekstensi file JPEG default ke JPG dalam upaya meminimalkan kebingungan. </p> <p> Dan begitulah cara kami mendapatkan dua ekstensi file untuk format yang sama: JPEG dan JPG. Saat memilih untuk menyimpan gambar Anda, tidak ada perbedaan di antara keduanya. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG vs. PNG: Mana yang Lebih Baik? </h2> <p> </p> <p> JPEG dan PNG dirilis dalam dekade yang sama, dengan masing-masing format file menyelesaikan masalah gambar digital berbeda yang dihadapi dunia teknologi saat itu. Bisa dibilang wajar saja jika mereka terus-menerus dibandingkan... dan memang begitu, bahkan sampai hari ini. Antara JPEG dan PNG, format file gambar mana yang paling dominan? </p> <p> Sejujurnya, jawabannya tergantung pada jenis gambar yang Anda simpan. </p> <p> JPEG lebih cocok untuk foto karena menggunakan kompresi lossy untuk menjaga ukuran file yang wajar. Foto adalah gambar yang sangat besar dan mendetail sehingga artefak kompresi (distorsi gambar halus yang disebabkan oleh kompresi) tidak terlalu terlihat. </p> <p> Di sisi lain, gambar dengan titik yang tajam, tepi yang tajam, dan dengan area yang luas dengan satu warna (misalnya logo vektor, seni piksel, dll.) tidak terlihat benar saat disimpan sebagai JPEG. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Kredit Gambar: Axel Grimard/ <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Di sinilah file Portable Network Graphics (PNG) mungkin masuk. Dikembangkan oleh PNG Development Group empat tahun setelah rilis JPEG, PNG mendukung kompresi dan transparansi data lossless. PNG sering digunakan jika kualitas gambar harus dipertahankan dan ukuran file tidak menjadi masalah. </p> <p> Aturan praktis yang baik adalah menyimpan JPEG untuk foto, dan menyimpan PNG untuk gambar dengan transparansi dan gambar non-fotografi. Untuk wawasan lebih lanjut tentang berbagai jenis file (tidak hanya gambar), lihat panduan kami untuk <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> mengetahui kapan harus menggunakan format file mana. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG dan JPG Adalah Format File Yang Sama </h2> <p> Terlepas dari kebingungan yang disebabkan oleh JPEG dengan banyak pembaruan dan variasinya, banjir gambar digital di internet pada pertengahan 90-an tidak diragukan lagi terutama disebabkan oleh rilisnya. </p> <p> Lain kali Anda siap untuk mengekspor foto dari editor gambar dan disajikan dengan daftar panjang format yang tersedia, ingatlah: JPEG dan JPG adalah satu dan sama. </p>"}