{"title":"Lihat Versi Peramban xCloud dari Microsoft","content":"<p> Jika Anda sudah tidak sabar menunggu berita di port browser xCloud, maka hari ini adalah hari keberuntungan Anda karena Anda dapat mengintip seperti apa sebenarnya tampilannya. </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> Penguji Mengungkapkan Tangkapan Layar Peramban xCloud </h2> <p> xCloud saat ini tersedia di berbagai perangkat, tetapi kami masih menunggu Microsoft untuk merilis versi browser secara resmi. </p> <p> Detailnya cukup sedikit... sampai sekarang. Menurut laporan oleh <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> The Verge </a> , &quot;sumber yang mengetahui rencana Xbox Microsoft&quot; mengklaim &quot;karyawan sekarang menguji versi web xCloud sebelum pratinjau publik&quot;. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Inilah tampilan pertama xCloud untuk web dari Microsoft <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> — Ujung (@ujung) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> 15 Februari 2021 </a></blockquote>  <p> Jangan lupa, ini hanya gambar dari penguji, yang berarti—meskipun tidak mungkin—Microsoft dapat mengubah tampilan versi browser xCloud sepenuhnya. </p> <p> Dari tangkapan layar, sepertinya xCloud diatur seperti versi Android, yang tersedia di smartphone dan tablet. </p> <p> Anda dapat melihat game yang baru ditambahkan di bagian atas tangkapan layar, diikuti oleh bagian &quot;Segera Hadir&quot;. Di bawahnya, Anda memiliki berbagai opsi untuk memilih genre game yang Anda pilih, dengan perpustakaan game xCloud lengkap tersedia di bagian bawah halaman. </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> Bagaimana Anda Mengakses xCloud di Browser Anda? </h2> <p> Saat ini, Anda tidak bisa. Versi publik port web xCloud belum tersedia. Artinya Anda harus menunggu sedikit lebih lama jika ingin mengakses xCloud melalui browser Anda. Diduga, Microsoft memiliki rencana untuk mengungkapkan layanan tersebut secara publik pada kuartal kedua tahun 2021. </p> <p> Sampai saat itu, Anda harus menemukan metode lain untuk mengakses xCloud. Saat ini, Anda hanya dapat mengakses layanan cloud gaming di perangkat Android (Anda memerlukan versi browser untuk bermain di iOS, berkat <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> pertengkaran antara Apple dan Microsoft </a> ). </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> Bisakah Anda Mengakses Game xCloud dengan Cara Lain? </h2> <p> Yah, ya dan tidak. Anda tidak dapat mengakses judul apa pun di xCloud, jadi untuk berbicara. Tidak, kecuali Anda menggunakan perangkat Android dan aplikasi Game Pass resmi untuk melakukannya. </p> <p> Namun, game yang tersedia di layanan cloud gaming Microsoft semuanya tersedia di Game Pass. Bahkan, Anda mendapatkan akses ke xCloud sebagai bagian dari langganan Game Pass Ultimate. Jadi Anda masih dapat mengakses game-game itu melalui Xbox atau PC Windows Anda. </p> <p> Jadi, dalam satu kata, ya. Anda dapat mengakses game-game itu dengan cara lain. Hanya tidak menggunakan xCloud, kecuali Anda memiliki akses ke versi Android. </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud: Segera Hadir di Perangkat iOS di Dekat Anda </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> Anda tidak perlu menunggu lama sampai Anda bisa mendapatkan platform cloud gaming Microsoft. Setelah xCloud melalui pengujian, Microsoft akan membuat perubahan yang diperlukan sebelum membiarkan kita semua melihatnya dan, semoga tidak lama kemudian, memainkannya juga. </p>"}