{"title":"Laporan: Android 12 Akan Menampilkan Mode Satu Tangan","content":"<p> Kami telah secara resmi mencapai fase siklus hidup Android 11 di mana rumor Android 12 mulai keluar dengan kekuatan penuh. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> Pengembang XDA </a> telah melaporkan bahwa Google sedang mengerjakan mode satu tangan untuk Android 12 yang akan membuatnya lebih mudah untuk bernavigasi di ponsel dengan satu tangan. Apakah Anda memiliki tangan besar atau kecil, ini bisa membuka cara baru untuk berinteraksi dengan perangkat Android Anda. </p> <p> Tentu saja, banyak produsen perangkat dan <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> pengembang perangkat lunak telah memperkenalkan solusi untuk meningkatkan kegunaan satu tangan </a> . Namun, akan jauh lebih menyenangkan untuk menggunakannya jika terintegrasi langsung ke dalam sistem operasi. </p> <h2 id=\"android-12-s-one-handed-mode\"> Mode Satu Tangan Android 12 </h2> <p> Menurut laporan tersebut, Google berencana untuk menambahkan fitur satu tangan ke AOSP, yang merupakan versi sumber terbuka Android yang dapat digunakan oleh pembuat perangkat lunak di perangkat mereka. Itu juga berarti bahwa OEM yang belum mengembangkan mode satu tangan mereka sendiri akan memiliki cara mudah untuk mengimplementasikan fitur tersebut ke dalam perangkat mereka. </p> <p> Apa yang tidak ditunjukkan oleh laporan itu adalah apakah Google akan mengharuskan pembuat ponsel untuk menggunakan fitur satu tangan Android 12 atau jika itu opsional. </p> <p> Karena ini masih sangat awal, kami tidak tahu persis bagaimana mode satu tangan Android 12 akan bekerja. Jika kemampuan Google di masa lalu untuk menambahkan fitur ke dalam sistem operasi merupakan indikasi, kami berharap perusahaan melakukan pekerjaan dengan baik dengan penerapannya. Google dapat memilih untuk mengecilkan seluruh layar hingga ke sudut perangkat untuk memudahkan akses. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> Laporan tersebut juga menunjukkan bahwa mode satu tangan Android 12 akan memiliki cara untuk memicunya menggunakan mode tiga tombol tradisional bersama dengan mode navigasi gestur yang lebih baru. </p> <p> Seperti yang disebutkan, banyak OEM smartphone telah menerapkan fitur tersebut ke versi Android mereka sendiri yang dimodifikasi. Misalnya, Huawei sebenarnya mencoba untuk mengirimkan versi fiturnya ke AOSP, tetapi Google menolaknya. Mungkin Google menolaknya karena perusahaan tahu itu akan membawa versi fiturnya sendiri. </p> <p> Karena kebocoran ini sangat awal, belum ada foto yang menunjukkan fitur tersebut, jadi kita harus menunggu hingga Android 12 mendekati rilisnya. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Kapan Android 12 Akan Dirilis? </h2> <p> Sayangnya, kami tidak tahu persis kapan Android 12 akan diluncurkan ke publik (meskipun tidak akan lama). Kami juga tidak tahu persis kapan fitur ini akan keluar untuk pengembang atau untuk rilis Beta atau Android Stabil. </p> <p> Seperti yang selalu terjadi pada fitur-fitur Android baru, kita harus menunggu dan melihat apakah itu akan datang ke OS sama sekali. </p>"}