{"title":"LastPass Akan Membatasi Anda ke Satu Jenis Perangkat Kecuali Anda Membayar","content":"<p> LastPass, pengelola kata sandi populer, sedang mengalami perubahan besar. Segera, mereka yang menggunakan layanan gratis hanya akan dapat melakukannya di komputer atau ponsel, tetapi tidak keduanya—kecuali mereka membayar. </p> <p> Artinya LastPass bukan lagi pilihan menarik sebagai pengelola kata sandi gratis. Di dunia di mana kita terus-menerus beralih antara komputer dan ponsel, tidak ada gunanya memiliki pengelola kata sandi yang hanya berfungsi untuk satu jenis perangkat. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> Apa yang Berubah di LastPass Free? </h2> <p> Seperti yang diumumkan pada <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog LastPass </a> , perubahan sedang terjadi untuk pengelola kata sandi versi gratis. </p> <p> Saat ini, LastPass Free memungkinkan Anda menggunakan layanan ini di semua perangkat Anda. Apakah Anda menggunakan LastPass di komputer, tablet, atau ponsel Anda, itu tidak masalah. Semua itu gratis. Itu akan berubah pada 16 Maret 2021. </p> <p> Sejak saat itu, LastPass Free hanya akan menyertakan perangkat tak terbatas dari satu jenis: komputer atau ponsel. </p> <p> Untuk LastPass, komputer digolongkan sebagai desktop atau laptop apa pun, sedangkan ponsel adalah ponsel, tablet, dan jam tangan pintar. </p> <p> Saat pertama kali masuk ke LastPass pada 16 Maret, Anda perlu mengatur jenis perangkat aktif Anda. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> Misalnya, jika Anda memilih komputer sebagai jenis perangkat Anda, Anda akan dapat menggunakan LastPass di perangkat desktop dan laptop Anda. Namun, jika Anda ingin menggunakan LastPass di perangkat seluler apa pun, Anda harus meningkatkan ke LastPass Premium. </p> <p> Di satu sisi, ini kembali ke LastPass yang lama. Mampu menggunakan LastPass secara gratis di desktop dan seluler hanya tersedia pada tahun 2015. Sebelum itu, Anda harus membayar untuk dukungan seluler. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> Dukungan LastPass Juga Berubah </h2> <p> LastPass juga mengubah cara menyediakan dukungan. Mulai 17 Mei 2021, dukungan email hanya akan tersedia untuk pelanggan Premium dan Keluarga. </p> <p> Pengguna gratis akan terjebak dengan artikel bantuan yang tersedia di situs web dukungan LastPass, atau mereka dapat meminta bantuan dalam komunitas LastPass. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> Setiap orang harus menggunakan pengelola kata sandi </a> . Kemungkinannya, Anda harus menggunakannya di desktop dan seluler. LastPass mengetahui hal ini dan mengandalkan pengguna yang meningkatkan ke layanan berbayar, yang saat ini diskon 25% untuk $27/tahun. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> Apakah Saatnya Mengubah Pengelola Kata Sandi? </h2> <p> Jika Anda menggunakan LastPass Free, kemungkinan hal ini membuat Anda mempertimbangkan untuk beralih. Jika demikian, ada banyak pengelola kata sandi hebat lainnya di luar sana yang dapat Anda gunakan di semua perangkat Anda secara gratis. </p> <p> Kemudian lagi, mungkin Anda berpikir adil bahwa Anda membayar sejumlah kecil ke LastPass untuk mendukung layanan yang diberikannya. </p>"}