{"title":"Mark Zuckerberg Facebook Mengambil Dorongan Privasi Apple Secara Pribadi","content":"<p> CEO Facebook Mark Zuckerberg dilaporkan mengatakan kepada karyawan Facebook bahwa, &quot;Kita perlu menimbulkan rasa sakit&quot; pada Apple karena memperlakukan raksasa media sosial dengan sangat buruk, <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> Jurnal Wall Street </a> laporan. </p> <p> Zuckerberg diduga membuat komentar pada tahun 2018 setelah Apple dan kepala eksekutif Facebook terlibat dalam skandal Cambridge Analytica, di mana data pribadi jutaan pengguna Facebook diakses tanpa persetujuan mereka untuk iklan politik. </p> <h2 id=\"apple-vs-facebook\"> Apple vs. Facebook </h2> <p> Pada saat itu, CEO Apple Tim Cook ditanyai dalam sebuah wawancara tentang bagaimana dia akan merespons jika dia berada dalam situasi Zuckerberg, menghadapi krisis. &quot;Saya tidak akan berada dalam situasi ini,&quot; kata Cook. </p> <p> The Wall Street Journal mengklaim bahwa, sementara Zuckerberg berkomentar bahwa kata-kata Cook &quot;sangat fasih&quot; dan &quot;sama sekali tidak selaras dengan kebenaran&quot;, di balik layar ia jauh lebih keras dalam penilaiannya. </p> <p> Sejak itu, hubungan antara kedua perusahaan teknologi itu tidak membaik. Apple telah menggandakan sikap berorientasi privasinya, dengan Cook menyatakan privasi sebagai salah satu dari <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> kekhawatiran paling mendesak di dunia </a> . iOS 14 berisi beberapa fitur terkait privasi, yang telah dipermasalahkan oleh Facebook, mengklaim bahwa mereka berpotensi merugikan bisnis kecil. </p> <p> Selama panggilan investor kuartalan terbaru Facebook, Zuckerberg memberi label Apple &quot; <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> salah satu pesaing terbesar [Facebook] </a> &quot;Sebagai hasil dari langkah-langkah perlindungan privasi baru ini. &quot;Apple mungkin mengatakan mereka melakukan ini untuk membantu orang, tetapi langkah tersebut jelas sejalan dengan kepentingan kompetitif mereka,&quot; kata Zuckerberg. </p> <p> </p> <p> Facebook diduga menyiapkan kasus antimonopoli terhadap Apple yang akan mengubah sniping antara dua raksasa Silicon Valley menjadi pertempuran hukum penuh. Laporan Wall Street Journal mencatat bahwa, &quot;Penyelesaian peraturan potensial dan keputusan hukum kemungkinan akan mempengaruhi ratusan juta ponsel konsumen di tahun-tahun mendatang.&quot; </p> <p> </p> <h2 id=\"different-approaches\"> Pendekatan yang berbeda </h2> <p> Juru bicara Facebook, Dani Lever, mengatakan kepada Wall Street Journal bahwa, &quot;Apple mengklaim ini tentang privasi, tetapi ini tentang keuntungan, dan kami bergabung dengan orang lain untuk menunjukkan preferensi diri mereka, perilaku anti persaingan.&quot; Dia mengatakan bahwa Facebook &quot;sengaja membela Apple&quot; atas nama bisnis kecil dan pengembang yang dirugikan oleh fitur Privasi Aplikasi Apple. </p> <p> Sementara Lever membantah bahwa pertempuran antara kedua perusahaan itu bersifat pribadi, itu benar-benar melampaui beberapa poin pertikaian antara dua perusahaan teknologi besar. Model bisnis yang didanai iklan yang dioperasikan Facebook sangat berbeda dengan model yang didanai perangkat keras yang mendukung Apple. Tak satu pun dari kedua perusahaan---atau para pemimpinnya--- kemungkinan besar akan mundur dari keyakinan inti mereka tentang cara membangun masa depan teknologi. </p> <p> Fakta bahwa CEO Apple Tim Cook membahas privasi dalam istilah moral menunjukkan betapa pribadi, pada satu tingkat, ini sebenarnya. </p> <p> <small> Kredit Gambar: Wikipedia/ <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Anthony Quintano CC </a></small> </p>"}