{"title":"Masuk ke Dimensi Ketiga: Bekerja Dengan Alur Kerja 3D di Adobe After Effects","content":"<p> Jika Anda ingin meningkatkan alur kerja Adobe After Effects, pada akhirnya Anda harus mulai berurusan dengan sumbu Z, yang memungkinkan Anda untuk memanipulasi kedalaman 3D objek. </p> <p> Ini membuka berbagai visual dan gaya baru untuk Anda gunakan, tetapi juga menciptakan serangkaian batasan dan pertimbangannya sendiri. </p> <p> Dalam artikel ini, kami akan membahas cara mengaktifkan dan bekerja dengan lapisan 3D, serta cara menambahkan dan menganimasikan kamera 3D untuk membuat gerakan dinamis. Skenario di mana kami menganimasikan dan memindahkan teks dalam ruang 3D juga akan diperiksa. </p> <p> Ayo masuk! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> Cara Mengaktifkan dan Menganimasikan Lapisan 3D </h2> <p> Dalam komposisi Anda, Anda dapat mengaktifkan lapisan Anda di timeline Anda untuk mengaktifkannya sebagai 3D. </p> <p> Ini adalah proses yang sangat mudah. Cukup temukan <strong> kubus </strong> ikon untuk lapisan Anda di garis waktu Anda, dan klik kotak di bawahnya untuk mengaktifkan 3D untuk lapisan itu. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> Setelah ini dilakukan, Anda mungkin tidak akan melihat perubahan langsung. Namun, jika Anda menavigasi ke parameter posisi, skala, dan rotasi di lapisan Anda, Anda akan melihat bahwa rangkaian angka yang dapat disesuaikan ketiga telah muncul. </p> <p> Angka-angka baru ini sekarang menentukan rotasi, posisi, dan skala Anda pada sumbu Z di ruang 3D. Sama seperti parameter Anda yang lain, mereka bisa menjadi keyframe untuk memungkinkan animasi dan manipulasi. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> Sebagai contoh, mari kita buat komposisi dan layer teks dengan beberapa kata. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Setelah selesai, aktifkan layer 3D. Perhatikan bahwa jika Anda berencana untuk menggunakan <strong> Meluruskan </strong> alat untuk memastikan lapisan Anda benar-benar terpusat, Anda harus melakukan ini sebelum mengaktifkan 3D. Ini karena <strong> Meluruskan </strong> alat hanya bekerja pada lapisan 2D. </p> <p> Sekarang layer teks kita adalah layer 3D, kita bisa memindahkannya ke dalam ruang 3D di sepanjang Z-Axis. Jadi, biarkan teks bergerak &quot;menuju layar.&quot; </p> <p> Pertama, kita akan mengatur parameter Z-Axis kita. Secara default, ini disetel ke nol. Mari kita atur ke <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Sekarang, kami akan menavigasi dua detik ke bawah timeline kami, dan mengatur nilai sumbu Z kami ke <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> Dengan perubahan ini, kita sekarang akan melihat teks bergerak &quot;menuju&quot; layar. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> Apa itu Kamera 3D? </h2> <p> Kami telah berhasil menganimasikan objek dalam ruang 3D di After Effects. Tetapi bagaimana jika Anda memiliki banyak objek, dan ingin membuat penonton merasa bergerak ke arah atau menjauhi objek tersebut? </p> <p> Anda dapat dengan mudah menganimasikan setiap elemen individual untuk bergerak ke arah Anda, tetapi itu akan memakan banyak waktu dan tidak terlalu efisien. Di sinilah Anda akan menggunakan kamera 3D. </p> <p> </p> <p> Jika Anda menggunakan software 3D seperti Cinema 4D atau Blender, kemungkinan Anda pernah menggunakan kamera 3D sebelumnya. Jika Anda pernah memainkan game komputer, Anda juga pernah mengalami kamera 3D yang menggerakkan pandangan Anda di dunia 3D. </p> <p> Ini semua mungkin tampak rumit pada awalnya, tetapi kamera 3D berfungsi seperti kamera sungguhan. Mereka memberi Anda bidang pandang yang dapat dimanipulasi dan dipindahkan dalam ruang 3D. </p> <p> Mari kita bekerja pada sebuah contoh. </p> <h3 id=\"setting-up-a-3d-camera\"> Menyiapkan Kamera 3D </h3> <p> Untuk memulai, buat beberapa lapisan teks 3D, dan posisikan secara berurutan di bawah Z-Axis. </p> <p> Dalam contoh ini, celah <strong> 3.000 piksel </strong> antara setiap lapisan telah digunakan. Lapisan pertama duduk di nol, berikutnya di 3.000, berikutnya di 6.000, dan seterusnya. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Sekarang, saatnya membuat kamera 3D dengan mengklik <strong> Lapisan </strong> &gt; <strong> Baru </strong> &gt; <strong> Kamera </strong> , di mana Anda akan melihat jendela untuk menyesuaikan pengaturan untuk lapisan kamera baru Anda. Ini datang dalam dua jenis: <strong> Satu Node </strong> dan <strong> Dua Node </strong> . </p> <p> Itu <strong> Satu-Node </strong> kamera dirancang untuk mengoperasikan dan meniru kamera dunia nyata sedekat mungkin, dan titik fokus ditentukan secara manual oleh pergerakan kamera. </p> <p> SEBUAH <strong> Dua-Node </strong> kamera dirancang untuk mengikuti satu titik tujuan, sehingga ideal untuk mengorbit atau mengikuti objek yang sedang bergerak. </p> <p> Dalam skenario ini, <strong> Satu-Node </strong> kamera yang akan digunakan. Anda akan melihat sejumlah pengaturan tambahan di jendela, seperti <strong> Perbesar </strong> , <strong> Sudut pandang </strong> , <strong> Aktifkan Kedalaman Bidang </strong> , dan <strong> Focal length </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Ini dimaksudkan untuk mencerminkan pengaturan kamera dunia nyata. Jika Anda paham dengan cara kerjanya, jangan ragu untuk bermain-main dengannya. Jika tidak, Anda dapat memilih serangkaian preset di sudut kanan atas. </p> <p> Kita akan memilih <strong> 35mm </strong> prasetel untuk saat ini. Sekarang lapisan kamera kami sudah diatur dan di tempat kejadian, Anda tidak akan melihat banyak perbedaan pada awalnya. </p> <h3 id=\"using-3d-camera-navigation\"> Menggunakan Navigasi Kamera 3D </h3> <p> Ada dua metode yang dapat digunakan untuk menyesuaikan dan menganimasikan tampilan kamera. Yang paling akurat adalah dengan memasukkan berbeda <strong> Posisi </strong> nilai-nilai dalam <strong> Mengubah </strong> pengaturan untuk lapisan kamera. Anda kemudian dapat membuat keyframe seperti yang Anda lakukan saat menganimasikan layer lainnya. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> Saat Anda menggerakkan kamera, Anda akan melihat bahwa semua objek 3D lainnya dalam pemandangan Anda akan bergerak terkait dengannya. Perhatikan bahwa kamera akan <strong> tidak mempengaruhi lapisan 2D </strong> . </p> <p> Jadi, mari atur kamera kita untuk bergerak pada sumbu Z dari nol hingga 9.000 selama interval empat detik, dan membingkai gerakan kita. </p> <p> Di sana Anda memilikinya! Jika Anda telah mengaturnya dengan benar, kata-kata harus mendorong &quot;ke arah&quot; Anda, &quot;melalui&quot; bidang pandang, dan &quot;di belakang&quot; pemirsa. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> Cara Lain Memindahkan Kamera 3DD </h3> <p> Jika Anda lebih suka sedikit lebih eksperimental, dan tidak terlalu mengandalkan kamera, ada cara lain untuk bergerak, menavigasi, dan menyesuaikan. Itu <strong> Orbit </strong> , <strong> Panci </strong> , dan <strong> Boneka </strong> alat di bagian atas bilah alat memungkinkan Anda melakukan ini. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> Dengan menggunakan ini, Anda dapat mengeklik dan menyeret untuk berpindah dari sisi ke sisi ( <strong> Panci) </strong> , berputar ( <strong> Orbit </strong> ), dan memperbesar dan memperkecil ( <strong> Boneka </strong> ). Kontrol ini kurang akurat daripada memasukkan angka, tetapi sangat bagus untuk merencanakan gerakan dan animasi kamera kasar Anda. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> Latihan Menuju Kesempurnaan </h2> <p> Anda sekarang seharusnya dapat membuat dan menganimasikan lapisan 3D di sepanjang sumbu Z, dan juga bekerja dengan kamera 3D untuk bernavigasi dengan beberapa objek 3D. </p> <p> Jika Anda senang bekerja di ruang 3D, Anda mungkin ingin menjelajahi kemungkinan yang lebih canggih yang dapat ditawarkan oleh perangkat lunak 3D yang lebih khusus, seperti Blender. </p>"}