{"title":"Makanan Otak Seukuran Gigitan: 5 Situs untuk Mempelajari Hal Baru dengan Cara Singkat dan Menyenangkan","content":"<p> Film dokumenter berlangsung kurang dari satu menit. Episode podcast hanya 60 detik. Infografis animasi untuk menjelaskan subjek yang kompleks. Di sinilah Anda dapat mempelajari lebih lanjut tentang dunia dalam kapsul cepat dari pengetahuan yang menarik. </p> <p> Di era rentang perhatian yang pendek dan pembaruan 280 karakter, bahkan pembelajaran perlu dilakukan dalam dosis kecil. Itulah mengapa ada pembuat konten yang berspesialisasi dalam membuat karya yang informatif dan menghibur yang hampir tidak memakan waktu dalam kesibukan kita. Dari dokumenter mini tentang orang-orang dan subjek yang menarik hingga panduan media sosial tentang topik yang sedang tren, berikan pikiran Anda makanan otak berukuran gigitan untuk dikunyah. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Dokumen 60 Detik </a> (Web): Profil Orang dan Topik Menarik dalam 60 Detik </h2> <p> </p> <p> Sebentar? 60 Second Docs memiliki cerita keren untuk diceritakan kepada Anda tentang orang yang menarik, dan pada gilirannya, subjek yang keren. Setiap dokumenter hanya berdurasi 60 detik, tetapi mencakup hal-hal terbaik yang perlu Anda ketahui tentang topik tersebut. </p> <p> Bagian paling keren adalah bahwa 60 Second Docs berfokus pada profil orang sungguhan, bukan konsep atau tren. Biasanya, orang itu melakukan sesuatu yang unik, entah itu memulai tren baru, menjelajahi topik baru, atau mendorong batasan dengan cara tertentu. Dengan membuatnya tentang orang tersebut, Anda tidak hanya mendapatkan lebih banyak wawasan tentang aspek manusia dari subjek yang unik, tetapi juga terasa lebih nyata dan emosional. </p> <p> Semua Dokumen 60 Detik tersedia di saluran YouTube atau pegangan media sosial mereka. Sebaiknya ikuti mereka di jejaring sosial mana pun yang sering Anda kunjungi, tonton setiap video baru secara keseluruhan setiap kali mereka memposting pembaruan. </p> <p> Jika Anda menyukai film dokumenter yang lebih panjang, periksalah <strong> Seleksi Resmi </strong> halaman di situs web 60 Second Documents. Di sini, editor memilih film dokumenter berdurasi 10-20 menit yang telah diambil orang lain, tentang subjek yang menurut mereka harus Anda tonton. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Jadi Anda Ingin Bicara Tentang </a> (Instagram): Panduan Mini untuk Topik Politik dan Sosial </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> Siapa yang tahu bahwa di dunia selfie influencer dan tagar yang dipromosikan merek, Instagram akan menyediakan platform untuk mendidik? So You Want To Talk About (Sywtta) menggunakan format postingan multi-gambar Instagram untuk membuat panduan mini tentang topik politik dan sosial. </p> <p> Subyek yang dipilih Sywtta biasanya membahas topik yang sedang tren seperti pembatalan pinjaman pelajar, hak dan sejarah hitam, kesalahan logika, vaksin COVID-19, dan banyak lagi. Setiap slide menggunakan tipografi yang diformat dengan indah untuk mendidik Anda tentang subjek, dan terlebih lagi, setiap slide seperti pelajaran mini itu sendiri. Setiap panduan menjadi kursus kilat yang cepat dan informatif, tanpa terlalu berat dengan data. </p> <p> Pada saat Anda harus mewaspadai <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> berita bias atau palsu </a> , penting juga untuk mencatat filosofi dari apa yang Anda baca. Ketika datang ke politik, Sywtta menyebarkan pandangan kebijakan progresif dan sayap kiri. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> Ilmu 60 Detik </a> (Podcast): Penjelasan Audio Singkat Sains, Kesehatan, dan Teknologi </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Jika Anda lebih suka mendengarkan informasi daripada membaca atau menonton, lihat podcast Ilmu Pengetahuan 60 Detik. Dibuat oleh tim di Scientific American, podcast harian ini menyentuh topik-topik dalam sains, kedokteran, dan teknologi, dan menjelaskan satu topik secara singkat. Meskipun tidak lagi membatasi diri pada batas waktu satu menit, setiap episode masih di bawah lima menit. </p> <p> Setiap podcast memiliki pembawa acara yang berbeda dari tim Scientific American, yang mencakup topik seperti COVID, hewan dan burung, DNA dan obat-obatan, ilmu lingkungan, dll. Mereka menikmati nilai produksi yang tinggi, menggabungkan suara dunia nyata tentang titik diskusi dan sering menambahkan klip suara dari para ahli. </p> <p> Untuk menelusuri arsip episode sebelumnya, kunjungi situs web resmi 60-Second Science. Di sini, Anda dapat memfilter episode berdasarkan topik (kesehatan, pikiran, keberlanjutan, teknologi, sains). Jika Anda tidak menginginkan informasi dalam waktu singkat, cobalah podcast Science Talk yang lengkap. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> gambar animasi </a> (Web): Infografis Animasi Berkualitas Tinggi untuk Menjelaskan Berbagai Hal </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> Bagaimana cara kerja cryptocurrency? Apa saja seluk beluk asuransi mobil? Bagaimana cara melakukan moonwalk? Desainer dan animator Jacob O&#39;Neal memecah topik kompleks menjadi penjelasan sederhana dan menggambar infografis animasi berkualitas tinggi untuk mengilustrasikannya. </p> <p> Animagraffs adalah kumpulan penjelasan singkat melalui panduan visual, menggunakan GIF animasi. Jacob menggunakan berbagai teknik desain, seperti tampilan penampang untuk mengilustrasikan setiap bagian instrumen, atau gambar besar dengan bagian bergerak yang dapat Anda perbesar dan perkecil seperti Google Maps. Setiap gaya sesuai dengan subjek yang Anda pelajari. </p> <p> Subyeknya juga beragam, termasuk cara cheetah berlari, cara kerja mobil listrik, cara pengeras suara mengeluarkan suara, dan sebagainya. Anda juga harus memeriksa bagian &quot;Pekerjaan Klien&quot;, tempat Jacob menampilkan tugas berbayar untuk merek. Jangan khawatir, meskipun iklan, tetap informatif dan menyenangkan. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Cerita Besar yang Hebat </a> (YouTube): Dokumenter Pendek Sejati yang Menarik dan Menarik </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story menyelesaikan operasinya pada akhir tahun 2020, tetapi tidak sebelum meninggalkan film dokumenter pendek yang menyenangkan selama lima tahun. Selami arsip untuk menemukan video kira-kira 5 menit tentang berbagai topik menarik dan orang-orang yang memukau dari seluruh dunia. </p> <p> Dari film yang diputar di teater India selama 24 tahun hingga es krim Turki yang luar biasa yang tidak meleleh, setiap video pendek adalah tampilan subjek yang berkualitas tinggi dan diteliti dengan baik. Berbeda dari kebanyakan video sejenis lainnya, pembuat video Great Big Story sering kali berkeliling dunia untuk menempatkan diri mereka di tengah-tengah cerita. Urutkan berdasarkan yang paling populer, atau gunakan berbagai daftar putar khusus yang direkomendasikan oleh pembuatnya. </p> <p> Di saluran, Anda juga akan menemukan beberapa video yang lebih panjang, sekitar 10 hingga 15 menit. Ini biasanya daftar dan kompilasi, yang mencakup beberapa klip dari video yang lebih pendek. Jika Anda punya waktu untuk mencari tahu lebih banyak tentang dunia di sekitar kita, Anda tidak bisa salah dengan ini. Bahkan setelah menutup jendelanya, Great Big Story adalah salah satu yang paling <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> saluran yang menarik dan mendidik di YouTube </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Gunakan Pembelajaran Tetes untuk Menaklukkan Subjek Besar </h2> <p> Situs web dan podcast ini berfokus pada mengubah setiap subjek baru menjadi paket informasi yang ringkas dan menghibur. Ini adalah cara yang bagus untuk mempelajari hal-hal baru dalam gigitan kecil. Tetapi Anda juga dapat menerapkan filosofi yang sama untuk mempelajari mata pelajaran yang lebih kompleks dan lebih besar. </p> <p> Semakin, pembelajaran tetes atau pembelajaran mikro adalah cara populer untuk mendapatkan pendidikan. Dengan menerima <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> pelajaran seukuran gigitan setiap hari </a> , Anda dapat menangani topik seperti pemrograman, desain, pengembangan aplikasi, manajemen produk, dan banyak lagi. Pencarian web cepat akan membantu Anda menemukan versi pembelajaran tetes dari apa pun yang Anda cari untuk mendidik diri sendiri. </p>"}