{"title":"Microsoft Merilis Aplikasi Office Baru untuk iPad","content":"<p> Microsoft telah merilis aplikasi Office terpadu untuk tablet Apple. Dengannya, Word, Excel, dan PowerPoint kini tersedia sebagai unduhan tunggal di iPhone dan iPad di <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> Toko aplikasi </a> . Microsoft masih menyediakan aplikasi iPad ini sebagai unduhan mandiri. </p> <h2 id=\"better-late-than-never\"> Lebih baik terlambat daripada tidak sama sekali </h2> <p> &quot;Kami menggabungkan aplikasi Word, Excel, dan PowerPoint yang Anda ketahui menjadi satu aplikasi yang dioptimalkan untuk iPadOS,&quot; tulis Microsoft dalam catatan rilis yang menyertai pengunduhan. Ini adalah berita bagus jika Anda menggunakan Office dan ingin bekerja di mana saja. Bagi mereka yang mencari <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> ubah iPad mereka menjadi pengganti laptop </a> , ini adalah rilis penting. </p> <p> Aplikasi tersedia secara gratis, tetapi pengeditan dan fungsionalitas tingkat lanjut lainnya memerlukan langganan Office 365. Bagi mereka yang bertanya-tanya, Microsoft menawarkan berbagai opsi berlangganan dalam aplikasi mulai dari $6,99 per bulan. </p> <p> Jika Anda hanya membutuhkan pengolah kata di iPad Anda, mungkin ide yang lebih baik untuk mempertimbangkan alternatif di <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> Rangkuman MUO tentang aplikasi pengolah kata terbaik untuk iPad </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> Pengalaman Kantor Seluler Terpadu </h2> <p> Untuk lebih jelasnya, ini adalah pembaruan untuk Office untuk iOS yang sudah ada, bukan rilis baru. Itu <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> aplikasi Office all-in-one memulai debutnya di iPhone </a> dan Android pada Februari 2020. Tidak jelas apa yang membuat Microsoft membutuhkan waktu setahun penuh untuk menambahkan versi Word, Excel, dan PowerPoint yang dioptimalkan iPad ke dalam campuran, tetapi lebih baik terlambat daripada tidak sama sekali. </p> <p> </p> <p> Sebelum hari ini, aplikasi produktivitas yang disertakan dalam suite memberikan pengalaman di bawah standar di iPad karena digunakan dalam mode berjendela. Namun dengan pembaruan terbaru yang kini tersedia, pelanggan Apple kini dapat memiliki pengalaman Office asli di iPhone, iPad, atau iPod touch mereka terlepas dari ukuran layarnya. </p> <p> </p> <h2 id=\"ipad-specific-features\"> Fitur Khusus iPad </h2> <p> Microsoft telah menambahkan fitur baru yang dioptimalkan untuk tablet ke penawaran Office selulernya secara teratur. Sebagai contoh, versi seluler Word, Excel, dan PowerPoint baru-baru ini mendapatkan dukungan untuk gerakan mouse dan trackpad. Aplikasi ini juga mendukung fitur multitasking side-by-side Split View iOS. </p> <p> Meskipun Office edisi seluler dan desktop tidak memiliki semua fitur yang sama, Office untuk iOS yang baru menghadirkan beberapa fitur baru. Ini memungkinkan Anda untuk melakukan hal-hal seperti menandatangani dokumen dengan Apple Pencil atau jari, membuat PDF dengan cepat dari dokumen Anda, mengonversi gambar menjadi teks dan tabel, dan sebagainya. </p> <p> </p> <p> Selain itu, Anda sekarang dapat dengan mudah memasukkan tanggal, bentuk, gambar, dan catatan dalam PDF. Sedangkan untuk power user, mereka sekarang dapat mengakses tindakan berbasis gambar Office (seperti Buat PPT, Buat PDF, dan lainnya) melalui menu Berbagi multiguna iOS. &quot;Selain itu, jika ada tangkapan layar terbaru saat Anda membuka aplikasi Office, ini muncul sebagai saran untuk mengonversi ke PDF atau PPT&quot;, catatan perusahaan. </p> <p> Microsoft akan membuat beberapa perubahan pada suite Office untuk Mac dan Windows juga. Menurut pembuat Windows, pembaruan mendatang untuk Office untuk desktop pada tahun 2021 akan menampilkan lisensi abadi, selain dari penyempurnaan lainnya. </p>"}