{"title":"Microsoft Mencoba Membeli Pinterest, Tapi Kesepakatannya Tidak Berhasil... Untuk Saat Ini","content":"<p> Microsoft baru-baru ini mendekati Pinterest mengenai kesepakatan pengambilalihan potensial yang akan menjadi salah satu akuisisi terbesar Redmond yang pernah ada. Saat ini, pembicaraan tidak aktif, tetapi skala merger yang diusulkan semakin menandai rencana pertumbuhan Microsoft. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft Ingin Membeli Pinterest </h2> <p> Seperti dilansir dari <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Waktu keuangan </a> , Microsoft berusaha membeli Pinterest, pinboard penghobi terbesar di dunia. </p> <p> Pinterest saat ini bernilai sekitar $51 miliar, dan nilai pasarnya telah meningkat lebih dari 600 persen selama pandemi COVID-19 saat orang-orang online selama penguncian. Berita kesepakatan pengambilalihan prospektif mendorong saham Pinterest naik 7 persen sebelum pasar dibuka pada Kamis 11 Februari. </p> <p> Langkah ini akan membawa Pinterest ke dalam akuisisi teknologi besar yang stabil oleh Microsoft. Pada 2016, Microsoft mengakuisisi LinkedIn dalam kesepakatan $26 miliar, diikuti dengan pembelian Github sebesar $7,5 miliar pada 2018. </p> <p> Belum lagi Microsoft memiliki Minecraft, membeli $2,5 miliar pada tahun 2014, dan akuisisi berkelanjutan dari perusahaan induk game besar, ZeniMax, sebesar $7,5 miliar. ZeniMax adalah perusahaan induk dari studio game seperti Bethesda Softworks, id Software, Alpha Dog Games, dan Tango Gameworks. </p> <p> Selanjutnya, ada <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> upaya gagal untuk membeli TikTok </a> Aset Amerika Utara, Australia, dan Selandia Baru pada pertengahan 2020. Kesepakatan itu akhirnya gagal tetapi bernilai antara $20-30 miliar dan datang setelah mantan Presiden <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Trump mengancam akan melarang </a> jaringan sosial berbagi video dari AS sepenuhnya. </p> <p> Jika kesepakatan Pinterest telah berjalan, atau memang, jika diselesaikan di kemudian hari, itu akan menjadi akuisisi terbesar Microsoft hingga saat ini. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> Mengapa Microsoft Membeli Begitu Banyak Perusahaan Teknologi? </h2> <p> Microsoft tidak kekurangan uang dan ingin memperluas kerajaannya. Sahamnya sendiri telah meningkat sekitar 80 persen sejak dimulainya pandemi COVID-19 dan baru-baru ini mengungkapkan keuntungannya yang memecahkan rekor. </p> <p> </p> <p> Akuisisi platform lain, seperti Pinterest, adalah tiket ke data untuk layanan Microsoft lainnya. Volume data yang dihasilkan oleh platform seperti LinkedIn adalah alat yang sempurna untuk melatih teknologi AI-nya. Selain itu, mengambil dan mengelola layanan online besar seperti Pinterest juga berfungsi sebagai iklan untuk platform Azure-nya. </p> <p> Seperti yang juga disinggung oleh laporan Financial Times, pembicaraan tentang merger yang begitu besar antara dua perusahaan teknologi akan menguji pemerintahan Presiden Biden juga. Apakah pemerintahan baru dengan senang hati mengizinkan raksasa teknologi seperti Microsoft, Google, dan Facebook untuk membeli persaingan? Hanya waktu yang akan memberitahu. </p>"}