{"title":"Microsoft Meluncurkan Azure Ke Luar Angkasa Dengan HPE&#39;s Spaceborne Computer-2","content":"<p> Microsoft menjangkau di luar batas planet ini untuk menyediakan layanan ekstra-terestrial. Perusahaan akan bekerja dengan Hewlett Packard Enterprises untuk terhubung ke PC di Stasiun Luar Angkasa Internasional (ISS) melalui platform Azure-nya. </p> <p> Spaceborne Computer-2 akan terhubung ke Azure melalui stasiun bumi NASA dan HPE, memberikan banyak kekuatan pemrosesan data yang hebat ke stasiun luar angkasa. </p> <h2 id=\"azure-heads-into-space\"> Azure Menuju Luar Angkasa </h2> <p> Seperti yang dilaporkan pada <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> blog Microsoft Azure </a> , Spaceborne Computer-2 (SBC-2) akan memberi astronot ISS teknologi yang lebih mirip dengan rekan terestrial mereka. </p> <p> Harapannya adalah secara drastis mengurangi jumlah waktu yang diperlukan untuk mentransfer data antara ISS dan Bumi, serta mengurangi jumlah bandwidth yang diperlukan untuk pemrosesan dan analisis. </p> <blockquote> <p> Para astronot dan penjelajah ruang angkasa berhak mendapatkan akses ke teknologi komputasi awan terbaik dan pemrosesan canggih di ujung tombak. Terkadang analisis perlu dilakukan segera di tepi di mana setiap momen yang berlalu penting, dan di lain waktu analisisnya sangat kompleks sehingga hanya dapat dilakukan dengan kekuatan cloud hyperscale. </p> </blockquote> <p> Spaceborne Computer-2 menggunakan sistem Edgeline Converged Edge dari Hewlett Packard Enterprises, yang &quot;direkayasa secara sengaja untuk lingkungan tepi yang keras&quot; dan akan membawa banyak fungsionalitas Azure ke ISS. </p> <p> Ketika koneksi berjalan, SBC-2 akan memungkinkan penelitian di berbagai bidang termasuk pemodelan cuaca untuk misi Mars di masa depan, analisis tanaman dan hidroponik untuk mendukung pertumbuhan makanan dan tanaman di luar angkasa, dan pencitraan medis di ISS itu sendiri (untuk mendukung perawatan kesehatan astronot ). </p> <p> Mark Fernandez, Solutions Architect of Converged Edge Systems di HPE dan Principal Investigator for Spaceborne Computer-2, mengatakan: </p> <blockquote> <p> Dengan menyatukan HPE&#39;s Spaceborne Computer-2, yang didasarkan pada sistem HPE Edgeline Converged Edge untuk komputasi edge canggih dan kemampuan AI, dengan Microsoft Azure untuk terhubung ke cloud, kami memungkinkan penjelajah ruang angkasa untuk mengirimkan set data besar secara mulus ke dan Bumi dan manfaatkan pengalaman edge-to-cloud </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> Fase Berikutnya dari Inisiatif Ruang Angkasa Azure Microsoft </h2> <p> Pengumuman Microsoft adalah langkah maju lainnya untuknya <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Azure Space </a> inisiatif, yang diluncurkan pada Oktober 2020. </p> <p> Inisiatif Azure Space adalah upaya Microsoft untuk mengambil &quot;lompatan raksasa berikutnya dalam komputasi awan,&quot; membawa platform komputasi awan Azure ke luar angkasa. </p> <p> </p> <p> Azure Space sebelumnya telah bekerja dengan proyek SpaceX Starlink untuk mengirimkan broadband satelit ke Azure Modular Datacenter (MDC) dan melanjutkan pekerjaannya pada proyek Azure Orbital, yang akan memperluas konektivitas antara pusat data cloud menggunakan teknologi satelit. </p>"}