{"title":"Nintendo Konfirmasi Showcase Nintendo Direct Berikutnya","content":"<p> Nintendo telah merilis rincian kapan presentasi Nintendo Direct berikutnya akan dilakukan, dan Anda tidak perlu menunggu lama untuk berita dari pencipta Mario. </p> <h2 id=\"nintendo-direct-reveals-forthcoming-presentation-date\"> Nintendo Direct Mengungkapkan Tanggal Presentasi yang Akan Datang </h2> <p> Ingin tahu apa yang direncanakan Nintendo untuk tahun mendatang? Dalam hal ini, Anda harus mendengarkan showcase Nintendo Direct berikutnya dan mendengarnya dari mereka. </p> <p> Nintendo Direct berikutnya akan berlangsung pada 17 Februari, sebagaimana dikonfirmasi dalam tweet dari Nintendo of America. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Tonton 17/2 jam 2 siang. PT untuk <a href=\"https://twitter.com/hashtag/NintendoDirect?src=hash&ref_src=twsrc%5Etfw\"> #NintendoDirect </a> streaming langsung yang menampilkan sekitar 50 menit informasi yang berfokus pada game yang tersedia seperti Super <a href=\"https://twitter.com/hashtag/SmashBrosUltimate?src=hash&ref_src=twsrc%5Etfw\"> #SmashBrosUltimate </a> dan permainan datang ke <a href=\"https://twitter.com/hashtag/NintendoSwitch?src=hash&ref_src=twsrc%5Etfw\"> #NintendoSwitch </a> pada paruh pertama tahun 2021. <a href=\"https://t.co/fbG3hEtD0Q\"> https://t.co/fbG3hEtD0Q </a> <a href=\"https://t.co/w8J6lbdIkQ\"> pic.twitter.com/w8J6lbdIkQ </a></p> — Nintendo Amerika (@NintendoAmerica) <a href=\"https://twitter.com/NintendoAmerica/status/1361676737730519042?ref_src=twsrc%5Etfw\"> 16 Februari 2021 </a></blockquote>  <p> Jika Anda menginginkan berita terbaru dari Nintendo, dengarkan <a href=\"https://www.nintendo.com/nintendo-direct/02-17-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> Halaman Nintendo Direct di nintendo.com </a> , mulai pukul 17:00 ET (14:00 PT, 22:00 GMT). </p> <p> </p> <h2 id=\"what-will-nintendo-reveal-at-nintendo-direct\"> Apa yang Akan Diungkap Nintendo di Nintendo Direct? </h2> <p> Umumnya tidak mungkin untuk mengatakan apa yang Nintendo siapkan untuk sebuah pengumuman. Kemungkinan akan ada sedikit berita game yang adil, terutama dengan franchise Zelda yang mendekati hari jadinya yang ke-35. </p> <p> Mengingat bahwa <a href=\"https://www.makeuseof.com/nintendo-switch-bestselling-console-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> Switch dan Switch Lite adalah konsol yang sangat populer di Amerika Serikat </a> , berita kemungkinan akan berfokus pada konsol saat ini dan judul yang tersedia untuk mereka. </p> <p> Jika Anda mengharapkan pengumuman tentang konsol Switch berikutnya, maka Anda tidak perlu menahan napas. Nintendo tetap sangat berhati-hati tentang masa depan konsol Switch dan apakah ada yang baru di cakrawala. </p> <p> </p> <h2 id=\"keep-up-to-date-with-nintendo-news\"> Tetap Perbarui Dengan Berita Nintendo </h2> <p> <img alt=\"Nintendo Switch Family Membership Header\" src=\"images/nintendo-switch-family-header-378.jpg\" loading=\"lazy\"> </p> <p> Nintendo Direct adalah cara Nintendo untuk memberikan berita terbaru tentang merek tersebut kepada basis penggemar setianya. Jadi, apakah Anda memiliki Switch, Switch Lite, atau bahkan seluruh koleksi konsol Nintendo, pastikan untuk mendengarkannya. </p>"}