{"title":"Pro dan Kontra Android","content":"<p> Android adalah sistem operasi seluler paling populer di seluruh dunia. Itu telah berubah tanpa bisa dikenali sejak diluncurkan pada 2008, dan sekarang memberi daya pada beberapa ponsel terbaik yang pernah dibuat. </p> <p> Tapi apa yang membuatnya begitu populer, dan masalah apa yang masih perlu diperbaiki? Kami melihat kelebihan dan kekurangan Android. </p> <h2 id=\"top-5-advantages-of-an-android-smartphone\"> 5 Kelebihan Smartphone Android </h2> <p> Manfaat menggunakan smartphone Android sebagian besar bersifat subjektif terhadap kebutuhan individu, tetapi secara umum adalah sebagai berikut. </p> <h3 id=\"you-can-sideload-apps-from-outside-the-play-store\"> 1. Anda Dapat Melakukan Sideload Aplikasi Dari Luar Play Store </h3> <p> Jika Anda tidak dapat menemukan aplikasi yang Anda cari di Google Play Store, Anda dapat melewatinya hanya dengan beberapa ketukan pada pengaturan ponsel Anda, tergantung pada perangkat Anda. </p> <p> Memiliki smartphone Android memberi Anda kebebasan untuk menginstal aplikasi non-Play Store. Anda tidak terbatas hanya menginstal aplikasi Android terbaik di Play Store tetapi juga dari pihak ketiga. </p> <p> <img alt=\"APKPure app store\" src=\"images/apkpure-578.png\" loading=\"lazy\"> </p> <p> Toko seperti <a href=\"https://apkpure.com/\" target=\"_blank\" rel=\"nofollow noopener\"> app.com </a> dan <a href=\"https://www.apkmirror.com/\" target=\"_blank\" rel=\"nofollow noopener\"> APKMirror.com </a> adalah toko aplikasi alternatif yang bagus, dan umumnya aman yang dapat Anda gunakan di hampir semua perangkat Android. </p> <p> Sistem iOS menghalangi Anda untuk menginstal sumber yang tidak dikenal, jadi Anda selalu dibatasi pada apa yang Apple lakukan dan tidak ingin Anda gunakan. </p> <h3 id=\"lots-of-hardware-innovations\"> 2. Banyak Inovasi Perangkat Keras </h3> <p> Perangkat dengan sistem Android memiliki banyak konfigurasi perangkat keras untuk ditawarkan kepada konsumen. Anda mendapatkan pilihan prosesor, ukuran baterai, jumlah RAM atau penyimpanan, dan dukungan untuk penyimpanan yang dapat dilepas seperti penggunaan kartu memori. </p> <p> Ada opsi yang mencakup berbagai ukuran, bentuk, dan set fitur. Sebagian besar inovasi perangkat keras juga berasal dari Android, termasuk ponsel bengkok, pemindai sidik jari dalam layar, dan kamera selfie pop-up. </p> <p> </p> <h3 id=\"expandable-memory\"> 3. Memori yang Dapat Diperluas </h3> <p> Mengisi penyimpanan Anda bukanlah masalah bagi banyak ponsel Android dengan dukungannya untuk memori yang dapat diupgrade. Melalui penyimpanan yang dapat dilepas seperti kartu memori, pengguna Android dapat dengan mudah menempatkan penyimpanan memori tambahan untuk mendukung kebutuhan mereka. Kamu bisa <a href=\"https://www.makeuseof.com/tag/move-android-apps-sd-card/\" target=\"_blank\" rel=\"nofollow noopener\"> simpan aplikasi favorit Anda ke kartu memori </a> , serta foto dan video. </p> <p> Namun, tidak semua ponsel mendukung memori ekstra, seperti <a href=\"https://www.makeuseof.com/samsung-galaxy-s21-worth-upgrading/\" target=\"_blank\" rel=\"nofollow noopener\"> Samsung Galaxy S21 </a> . Jika model pilihan Anda tidak, pastikan memiliki penyimpanan yang cukup untuk kebutuhan Anda saat Anda membelinya. </p> <h3 id=\"widgets\"> 4. Widget </h3> <p> <strong class=\"gallery__section-title\"> Galeri Gambar (2 Gambar) </strong> <img alt=\"best weather widget Android 1\" src=\"images/overdrop-weather-288.png\" loading=\"lazy\"> Memperluas <img alt=\"best weather widget Android 2\" src=\"images/overdrop-widgets-125.png\" loading=\"lazy\"> Memperluas </p> <p> Menutup </p> <p> Widget adalah untuk aplikasi atau informasi yang ingin Anda ketahui segera, seperti kalender dan pengingatnya, prakiraan cuaca, berita utama yang relevan, dan banyak lagi. Beberapa untuk mengambil info dengan cepat; yang lain menawarkan kontrol yang mudah, seperti untuk aplikasi media Anda. </p> <p> Meskipun smartphone iOS memiliki widget, Android jauh lebih kompleks dan mampu. Mereka memungkinkan Anda untuk mengakses informasi penting dengan jumlah pengguliran dan ketukan paling sedikit. </p> <h3 id=\"diverse-phone-options\"> 5. Pilihan Telepon Beragam </h3> <p> Seperti yang Anda ketahui, Android adalah sistem operasi yang melayani berbagai merek smartphone di seluruh dunia. Ini berarti bahwa ada berbagai macam perangkat untuk dipilih. </p> <p> Setiap merek menawarkan perangkat keras dan fitur yang berbeda untuk mencerminkan merek dan target pasarnya. Smartphone Android bervariasi dalam ukuran, penyimpanan ponsel, piksel kamera, masa pakai baterai, gaya, dan banyak lagi. Berapa pun anggaran Anda, atau seberapa besar layar yang Anda butuhkan, Anda akan menemukan perangkat Android yang sesuai. </p> <p> </p> <h2 id=\"top-5-disadvantages-of-an-android-smartphone\"> 5 Kekurangan Utama dari Smartphone Android </h2> <p> Mengetahui kerugian menggunakan smartphone Android mungkin membawa Anda ke sisi jalan yang berbeda. Berikut ini adalah karakteristik yang paling tidak disukai dari sistem Android. </p> <h3 id=\"hardware-quality-is-mixed\"> 1. Kualitas Perangkat Keras Dicampur </h3> <p> Anda mungkin berpikir &quot;semakin banyak semakin menyenangkan&quot; dalam hal pilihan; namun, mungkin Anda harus mengeluarkan banyak biaya untuk menemukan smartphone Android yang ringkas dan solid di mana semua fitur dan perangkat keras yang Anda inginkan sudah tersedia. </p> <p> Dengan kemitraan luas Android dengan merek ponsel cerdas yang berbeda, sulit untuk mempertahankan kontrol kualitas. Ada banyak merek yang belum pernah Anda dengar, seringkali dengan alasan yang bagus. </p> <p> <img alt=\"cheap android phones\" src=\"images/cheap-phones-861.png\" loading=\"lazy\"> </p> <p> Beberapa smartphone Android mungkin terlihat seperti tawaran yang murah, tetapi mungkin tidak terlalu bagus. Banyak ponsel yang lebih murah tidak bertahan lebih dari setahun, baik karena keterbatasan perangkat keras atau karena perangkat lunak tidak lagi diperbarui. </p> <h3 id=\"you-need-a-google-account\"> 2. Anda Membutuhkan Akun Google </h3> <p> Jika Anda tidak memiliki akun Google, mengapa menggunakan smartphone Android? Anda tidak dapat memaksimalkan ponsel Anda tanpa akun Google. Itu membutuhkan penggunaan akun Anda, terutama dalam menginstal aplikasi, mengunduh konten, atau aktivitas lain yang Anda lakukan — perlu dicadangkan oleh akun Google Anda. </p> <p> Sistem telepon iOS menggunakan ID Apple untuk mengotentikasi aktivitas di smartphone. Karena sistem operasi Android dibuat oleh Google, layanannya cukup terikat dengannya secara menyeluruh. Dan benar, kebanyakan orang baik-baik saja dengan ini. Tetapi beberapa orang lebih suka <a href=\"https://www.makeuseof.com/tag/using-android-without-google/\" target=\"_blank\" rel=\"nofollow noopener\"> gunakan ponsel tanpa Google </a> . </p> <h3 id=\"updates-are-patchy\"> 3. Pembaruan Tidak Tambal sulam </h3> <p> <img alt=\"\" src=\"images/android-apkupdater-updates-featured-744.jpg\" loading=\"lazy\"> </p> <p> Sementara Apple mendukung iPhone selama bertahun-tahun, sebagian besar perangkat Android hanya akan mendapatkan paling banyak satu atau dua pembaruan sistem operasi baru. Banyak model yang lebih murah tidak akan mendapatkan sama sekali. </p> <p> Meskipun pembaruan OS bagus untuk dimiliki, masalah yang lebih besar adalah ketika ponsel berhenti mendapatkan — atau tidak pernah menerima — pembaruan keamanan. Android secara resmi menerima patch keamanan bulanan untuk memperbaiki setiap kerentanan dalam sistem. Beberapa pembuat ponsel meluncurkan ini setiap satu atau dua bulan, tetapi begitu ponsel Anda tidak lagi mendapatkan pembaruan, itu bisa dengan cepat menjadi risiko keamanan. </p> <h3 id=\"many-ads-in-apps\"> 4. Banyak Iklan di Aplikasi </h3> <p> Hal lain yang mengganggu pengguna adalah <a href=\"https://www.makeuseof.com/tag/block-popup-ads-android/\" target=\"_blank\" rel=\"nofollow noopener\"> iklan popup di Android </a> , terutama pada yang berbiaya rendah. Setiap kali Anda membuka Play Store, ada iklan di mana-mana. Beberapa ponsel yang lebih murah bahkan mungkin menampilkan iklan di notifikasi. </p> <p> Ini adalah pertukaran. Aplikasi iOS sering kali memiliki lebih sedikit iklan, tetapi juga lebih banyak budaya di mana pembayaran untuk aplikasi diterima. Di Android, trennya lebih ke arah mendapatkan aplikasi secara gratis. </p> <h3 id=\"they-have-bloatware\"> 5. Mereka Memiliki Bloatware </h3> <p> Sebagian besar produsen perangkat Android memasang kumpulan aplikasi mereka sendiri di ponsel mereka. Terkadang fungsi duplikat ini sudah ada. Misalnya, beberapa merek Android seperti Samsung memiliki aplikasi email sendiri di mana mereka juga memiliki aplikasi Gmail saat pembelian, atau browser yang berbeda ketika Chrome adalah standar. </p> <p> <img alt=\"chrome on android\" src=\"images/android-chrome-502.jpg\" loading=\"lazy\"> </p> <p> Anda juga tidak dapat mencopot pemasangan aplikasi ini dalam banyak kasus, meskipun Anda dapat <a href=\"https://www.makeuseof.com/tag/remove-unwanted-apps-android-device/\" target=\"_blank\" rel=\"nofollow noopener\"> nonaktifkan aplikasi bawaan </a> yang tidak Anda butuhkan. Ini tidak akan merebut kembali ruang penyimpanan apa pun, tetapi akan membantu membersihkan kekacauan apa pun dari laci aplikasi Anda. </p> <p> </p> <h2 id=\"android-s-pros-and-cons\"> Pro dan Kontra Android </h2> <p> Android adalah sistem operasi seluler paling populer karena alasan yang bagus. Mudah digunakan, memiliki jutaan aplikasi, dan dikemas dengan inovasi. Dan dengan harga mulai dari $100 hingga $1000 atau lebih, ini dapat diakses oleh siapa saja dengan anggaran berapa pun. </p> <p> Itu tidak sempurna, tentu saja, dan memiliki kekurangan yang ingin kami perbaiki di masa depan. Tetapi fleksibilitas platform berarti bahwa meskipun Anda memiliki masalah sementara itu, masalah itu mudah diperbaiki. </p>"}