{"title":"Pembaruan Besar Microsoft Edge Menuju Jalan Anda","content":"<p> Microsoft bekerja sangat keras untuk membuat browser internetnya, Edge, yang terbaik. Sekarang, perusahaan membawa tiga fitur signifikan ke dalamnya, dan segalanya tampak cerah untuk masa depan Edge. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Apa yang Telah Direncanakan Microsoft untuk Edge </h2> <p> Pembaruan bumper besar ditangkap oleh <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows Terbaru </a> . Ketiga fitur tersebut dijadwalkan hadir dalam satu pembaruan besar, jadi sebaiknya perhatikan Edge dalam waktu dekat. </p> <p> Pertama, Microsoft Edge mendapatkan dukungan widget web. Widget ini adalah cara praktis untuk mendapatkan sekilas informasi penting sepanjang hari Anda. Raksasa perangkat lunak ini ingin bereksperimen dengan widget dari segala bentuk dan ukuran, tetapi telah memutuskan untuk memulai dengan widget berita untuk memulai. </p> <p> Selanjutnya, Microsoft Edge mendapatkan fitur pencarian tab. Jika ini terdengar familier bagi Anda, kemungkinan karena Anda telah membaca <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> spekulasi awal Edge mendapatkan alat pencarian tab </a> . Untungnya, spekulasi ini menjadi kenyataan, dan Microsoft berencana untuk membawa fitur Chrome ke Edge. </p> <p> Terakhir, Anda dapat mengelola semua ekstensi Edge dari satu menu. Itu akan muncul sebagai potongan teka-teki di bilah tugas browser Anda, dan ketika Anda mengkliknya, itu akan menunjukkan kepada Anda setiap ekstensi yang telah Anda instal di samping cara cepat untuk mengaktifkan dan menonaktifkan masing-masing ekstensi. </p> <p> Tidak yakin kapan tepatnya pembaruan ini akan dirilis, tetapi Windows Latest telah menyematkannya untuk &quot;pembaruan besar berikutnya.&quot; Dengan demikian, tidak akan terlalu lama sampai Microsoft Edge menjadi pilihan menarik bagi orang yang mencari sesuatu yang baru. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: Hal Besar Berikutnya? </h2> <p> Untuk waktu yang sangat lama, browser Microsoft dianggap sebagai pengelola unduhan tingkat lanjut untuk menginstal Chrome atau Firefox. Sejak Microsoft mengadopsi basis kode Chromium untuk browsernya, bagaimanapun, itu telah menjadi bahan tertawaan di dunia browser. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> Penghitung Statistik </a> mencantumkan Microsoft Edge sebagai browser Windows yang paling banyak digunakan kedua di AS pada saat penulisan. Kami sudah tahu bahwa Firefox ditinggalkan dalam debu oleh Edge, tetapi sejak itu, celahnya semakin lebar. </p> <p> Sekarang, Edge menguasai 5,25 persen pangsa pasar AS, dibandingkan dengan 3,35 persen yang dimiliki Firefox. Keduanya jauh dari 45,83 persen Chrome, tetapi ini adalah permulaan. </p> <p> Oleh karena itu, jika sebelumnya Anda tidak menyukai browser Microsoft, sekarang adalah saat yang tepat untuk memberikannya kesempatan kedua. Siapa tahu, Anda mungkin dimenangkan oleh browser terbaik Microsoft yang pernah ada! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Mendorong Browser ke Tepi </h2> <p> Jika Anda belum pernah menjadi penggemar browser Microsoft di masa lalu, inilah saat yang tepat untuk masuk dan melihat apa yang diributkan. Pembaruan besar sedang dikerjakan, dan itu hanya akan menjadi lebih baik dari sini. </p> <p> Microsoft tahu bahwa itu ada pada formula kemenangan. Faktanya, perusahaan baru-baru ini melaporkan bahwa 600 juta orang di seluruh dunia sekarang menggunakan Edge untuk menjelajahi web. </p> <p> <small> Kredit Gambar: DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}