{"title":"Parler Kembali Online Setelah Shutdown Selama Sebulan","content":"<p> Setelah ditutup oleh Big Tech, Parler akhirnya muncul kembali di web. Platform &quot;kebebasan berbicara&quot; sekarang dapat diakses oleh pengguna yang sudah ada, dan akan segera mulai menerima pendaftaran pengguna baru dalam beberapa minggu mendatang. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler Muncul Kembali Setelah Pemadaman Teknologi Besar </h2> <p> Parler telah membuat comeback setelah pemadaman yang panjang. Jaringan sosial alternatif telah mendapatkan daya tarik di kalangan konservatif politik, dan telah <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> di-boot oleh Amazon Web Services (AWS), Google, dan Apple </a> setelah kerusuhan Capitol. Parler dituduh tidak berbuat cukup untuk memoderasi konten kekerasan, yang mengakibatkan penghapusannya dari app store dan web. </p> <p> Sebagai pengganti AWS, Parler sekarang menggunakan host bernama SkySilk. Situs ini juga mendaftarkan nama domainnya ke Epik, pendaftar yang melayani jenis jaringan &quot;kebebasan berbicara&quot; lainnya seperti Gab. </p> <p> Host baru dan pendaftar domain bukan satu-satunya perubahan yang dibuat Parler—Parler bahkan muncul kembali dengan CEO sementara yang baru. Ini datang setelah <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> tim Parler diduga memecat salah satu pendiri John Matze </a> . </p> <p> Mark Meckler untuk sementara akan menggantikan Matze sebagai CEO, dan sebelumnya ikut mendirikan grup sayap kanan Tea Party Patriots. Dalam sebuah pernyataan yang diperoleh <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> Bukit </a> , Meckler mengumumkan kembalinya Parler yang telah lama ditunggu-tunggu, dengan mengatakan: </p> <blockquote> <p> Ketika Parler dimatikan pada bulan Januari oleh mereka yang ingin membungkam puluhan juta orang Amerika, tim kami berkumpul, bertekad untuk memenuhi janji kami kepada komunitas kami yang sangat terlibat bahwa kami akan kembali lebih kuat dari sebelumnya. Kami senang menyambut semua orang kembali. </p> </blockquote> <p> Meckler melanjutkan, mencatat bahwa Parler akan tetap didedikasikan untuk &quot;kebebasan berbicara, privasi, dan dialog sipil.&quot; Dia juga meyakinkan pengguna bahwa &quot;Parler dijalankan oleh tim yang berpengalaman dan akan tetap ada.&quot; </p> <p> Meskipun akun lama di platform telah dicadangkan, postingan lama (atau &quot;parley&quot;) belum dipulihkan. Jika Anda sudah memiliki akun di Parler, Anda dapat terus menggunakan situs tersebut. Jika tidak, Anda harus menunggu sekitar satu minggu sampai Anda dapat mendaftar. </p> <p> Namun, meskipun Anda sudah memiliki akun Parler, Anda mungkin mengalami beberapa kesulitan teknis saat menggunakan platform. Tampaknya layanan belum sepenuhnya dipulihkan. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> Aplikasi Parler Masih Tetap dalam Limbo </h2> <p> Parler masih dilarang dari Google Play Store dan Apple App Store, yang dapat sangat membahayakan basis penggunanya. Seperti berdiri, platform dapat tetap tidak tersedia di perangkat seluler untuk waktu yang tidak diketahui. </p> <p> Kemungkinan tidak akan dapat kembali ke Play Store atau App Store kecuali jika kebijakan moderasi diubah, yang kemungkinan besar akan ditolak oleh Parler. </p>"}