{"title":"Pembaruan WatchOS Terbaru Bertahan Terhadap Bug Penghancur Apple Watch","content":"<p> Pembaruan watchOS terbaru Apple, versi perangkat lunak 7.3.1, menyertakan perbaikan yang sangat penting---memecahkan bug yang menghentikan beberapa perangkat Apple Watch Series 5 dan Apple Watch SE dari pengisian daya saat memasuki mode Cadangan Daya. </p> <p> Perusahaan juga telah meluncurkan program perbaikan gratis baru untuk perangkat yang terpengaruh yang terjebak dalam mode daya rendah ini, dan tidak dapat keluar darinya. Bug ini pada dasarnya &quot;menghancurkan&quot; Apple Watch mereka, membuatnya tidak lagi berfungsi. </p> <h2 id=\"the-power-reserve-mode-bug\"> Bug Mode Cadangan Daya </h2> <p> Mode Cadangan Daya dimulai saat baterai Apple Watch hampir habis. Ini menghentikan Apple Watch Anda berkomunikasi dengan iPhone Anda. Ini juga menghentikan pengguna mengakses fitur lain di Apple Watch. Untuk keluar dari mode Cadangan Daya, pengguna perlu mengisi daya Apple Watch mereka. </p> <p> Pada suatu <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> halaman dukungan tentang bug dan program perbaikan </a> , tertanggal 15 Februari Apple memulai dengan mencatat: </p> <blockquote> <p> Sejumlah kecil pelanggan dengan model Apple Watch Series 5 atau Apple Watch SE yang menjalankan watchOS 7.2 atau 7.3 mengalami masalah dengan jam tangan mereka yang tidak terisi daya setelah memasuki Cadangan Daya. </p> </blockquote> <p> Untuk mengetahui apakah Anda memiliki model Apple Watch yang terpengaruh, Apple merekomendasikan untuk menempatkan Arloji Anda di pengisi daya dan menunggu setidaknya 30 menit. Jika tidak dikenakan biaya, hubungi Dukungan Apple dan mereka akan mengatur perbaikan pengiriman gratis. </p> <p> Jam tangan akan diperiksa untuk memeriksa apakah mereka memenuhi syarat dan, asalkan memang demikian, perbaikan akan dilakukan secara gratis, dan Jam tangan yang diperbaiki dikembalikan kepada pemiliknya. </p> <p> Tidak jelas berapa banyak Apple Watch yang terkena dampak serius dari bug tersebut. Namun, tampaknya masalahnya hanya memengaruhi sebagian dari model Apple Watch Series 5 atau Apple Watch SE, dan tidak ada model lain. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> Cara Meningkatkan ke WatchOS 7.3.1 </h2> <p> Bagi mereka yang belum mengalami bug, masih layak untuk meningkatkan ke versi watchOS terbaru hanya untuk melindungi diri Anda dari kemungkinan terjadinya. </p> <p> Pentingnya perbaikan bug ditunjukkan oleh fakta bahwa Apple segera meluncurkan watchOS 7.3.1 ke semua pengguna. Ini berbeda dengan cara yang biasanya mengeluarkan pembaruan perangkat lunak dengan membuat mereka tersedia pada awalnya untuk pengembang untuk pengujian beta. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple merilis watchOS 7.3 </a> pada akhir Januari. </p> <p> Pengguna dapat mengunduh watchOS 7.3.1 menggunakan aplikasi Apple Watch di iPhone. Untuk melakukan ini, mereka harus pergi ke <strong> Umum &gt; Pembaruan Perangkat Lunak </strong> . Apple Watch Anda harus memiliki setidaknya 50 persen baterai untuk memperbarui. Itu juga harus berada di dekat iPhone Anda. </p>"}