{"title":"Pengontrol PS4 Tidak Berfungsi? Cara Memperbaiki Masalah Paling Umum","content":"<p> Sebagian besar waktu, pengontrol PlayStation 4 Anda mungkin berfungsi dengan baik. Tetapi ketika DualShock 4 Anda berhenti terhubung atau terputus secara acak, itu membuat frustrasi. </p> <p> Mari kita lihat perbaikan ketika pengontrol PS4 Anda tidak berfungsi, sehingga Anda dapat kembali bermain. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> Pengontrol PS4 Tidak Dapat Menyandingkan atau Menghubungkan </h2> <p> Biasanya, ketika Anda menekan tombol <strong> Tombol PS </strong> pada pengontrol Anda, itu harus menyala dan terhubung ke sistem Anda. Namun, saat tidak tersambung, Anda akan melihat bilah lampu di pengontrol berkedip sebentar, lalu matikan. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Ini biasanya terjadi jika Anda menggunakan DualShock 4 dengan perangkat lain. Misalnya, jika Anda <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> pasangkan pengontrol PS4 Anda dengan PC Anda </a> atau konsol teman, ia akan mengingat perangkat itu di masa mendatang. </p> <p> Anda harus memasangkan kembali DualShock 4 Anda dengan PS4 Anda sendiri dalam kasus ini. Untuk melakukan ini, sambungkan pengontrol Anda ke PS4 Anda menggunakan kabel micro-USB. Pastikan Anda menggunakan kabel berkualitas tinggi yang Anda tahu berfungsi dengan baik. </p> <p> </p> <p> tekan <strong> Tombol PS </strong> pada pengontrol Anda sejenak, dan lampu akan berkedip sebentar sebelum berubah menjadi biru. Ini menandakan bahwa pengontrol Anda telah dipasangkan dan terhubung dengan sukses. </p> <p> Jika Anda memasangkan DualShock 4 dengan perangkat terdekat lainnya, seperti ponsel atau PlayStation 5, melakukan hal ini kemungkinan akan menghidupkan dan menghubungkan pengontrol ke perangkat tersebut. Oleh karena itu, Anda harus mematikan dan mencabut perangkat apa pun yang terhubung dengan DualShock 4 Anda terlebih dahulu. </p> <p> Setelah memasangkan kembali pengontrol, Anda dapat melepaskan kabel USB dan menggunakan pengontrol secara nirkabel seperti biasa. PS4 Anda akan mengingatnya sampai Anda memasangkan pengontrol dengan perangkat lain di masa mendatang. </p> <p> Ingatlah bahwa jumlah maksimum pengontrol DualShock 4 yang dapat Anda sambungkan ke PS4 sekaligus adalah empat. Jika Anda sudah memiliki empat pengontrol yang terhubung, Anda harus memutuskan satu untuk memberi ruang bagi lebih banyak lagi. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> Pengontrol PS4 Terus Terputus </h2> <p> Jika DualShock 4 Anda terputus secara acak saat bermain, ada beberapa solusi yang dapat Anda coba. </p> <p> Pertama, pastikan baterai pengontrol Anda terisi daya. Kedengarannya sederhana, tetapi jika baterai di pengontrol Anda hampir mati, itu mungkin terputus. Untuk memeriksa masa pakai baterai pengontrol Anda, tahan tombol <strong> Tombol PS </strong> untuk membuka Menu Cepat di sisi kiri layar. Anda akan melihat ikon pengontrol dengan tampilan baterai di bagian bawah. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Colokkan pengontrol Anda ke PS4 Anda dan kunjungi Menu Cepat lagi untuk memastikan Anda melihat animasi pengisian daya baterai. Setelah pengontrol Anda mengisi daya selama beberapa waktu, coba gunakan seperti biasa. </p> <p> Jika baterai bukan masalah Anda, pastikan Anda tidak mencoba menggunakan pengontrol terlalu jauh dari sistem Anda. Rentang khas Bluetooth adalah sekitar 30 kaki; tergantung pada pengaturan Anda, Anda mungkin dapat menggunakan pengontrol Anda lebih jauh dari ini, atau dibatasi untuk menggunakannya lebih dekat. </p> <p> Omong-omong, Anda harus mencoba meminimalkan gangguan antara pengontrol dan konsol Anda. Singkirkan benda logam di antara keduanya, seperti rak atau laptop, yang dapat menghambat sinyal. Anda juga harus mengeluarkan PS4 dari ruang tertutup untuk transmisi dan penerimaan sinyal yang lebih baik. </p> <p> Terakhir, ingat bahwa PS4 memiliki pengaturan yang mematikan pengontrol setelah tidak digunakan selama beberapa waktu. Jika Anda tidak ingin pengontrol PS4 mati saat Anda menonton aplikasi media seperti YouTube, buka <strong> Pengaturan &gt; Pengaturan Hemat Daya &gt; Atur Waktu Hingga Pengontrol Mati Turn </strong> dan pilih <strong> Tidak pernah </strong> . Perhatikan bahwa ini akan menghabiskan baterai bahkan saat Anda menganggur. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> Tips Umum untuk Memperbaiki Pengontrol PlayStation 4 </h2> <p> Kami telah melihat perbaikan khusus untuk beberapa masalah umum DualShock 4 di atas. Selanjutnya, mari kita lihat solusi yang lebih umum untuk masalah dengan pengontrol PS4. Berjalan melalui ini jika Anda membutuhkan lebih banyak bantuan. </p> <h3 id=\"restart-your-console\"> 1. Mulai Ulang Konsol Anda </h3> <p> Sementara sebagian besar masalah pengontrol berasal dari pengontrol itu sendiri, ada kemungkinan PS4 Anda yang bermasalah. Untuk mengesampingkan hal ini, Anda harus memulai ulang konsol Anda sebelum memecahkan masalah lebih lanjut. </p> <p> Jika pengontrol Anda cukup berfungsi untuk mengakses menu, tahan tombol <strong> Tombol PS </strong> untuk membuka Menu Cepat, lalu buka <strong> Daya &gt; Mulai ulang PS4 </strong> untuk me-reboot sistem Anda. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> Jika pengontrol Anda tidak bekerja sama, tekan dan tahan tombol <strong> Kekuasaan </strong> tombol pada konsol PS4 Anda sampai Anda mendengar dua bunyi bip. Ini akan mematikannya sepenuhnya (tidak ada lampu di bagian depan)—setelah dimatikan, tekan tombol <strong> Kekuasaan </strong> tombol lagi untuk menyalakannya kembali. </p> <p> Coba gunakan pengontrol Anda lagi setelah reboot dan lihat apakah itu membantu. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. Lupakan dan Pasangkan Kembali Pengontrol PS4 Anda </h3> <p> Jika Anda memiliki pengontrol PS4 kedua (atau pengontrol PS Move), Anda dapat menggunakannya untuk mengakses menu yang memungkinkan Anda menghapus pengontrol yang mengalami masalah. Menuju ke <strong> Pengaturan &gt; Perangkat &gt; Perangkat Bluetooth </strong> dan pilih <strong> DualShock 4 </strong> entri—ini adalah entri yang tidak memiliki lampu hijau di sebelahnya. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> Pada menu yang dihasilkan, tekan tombol <strong> Pilihan </strong> tombol pada pengontrol Anda dan pilih <strong> Lupakan Perangkat </strong> . Ini akan menyebabkan PS4 Anda menghapusnya dari memori sehingga Anda harus memasangkannya kembali. </p> <p> Ini adalah saat yang tepat untuk mencoba metode pemasangan yang sedikit berbeda: memasangkannya kembali saat startup. Untuk melakukan ini, matikan PS4 Anda (seperti yang dijelaskan sebelumnya). Setelah dimatikan, sambungkan pengontrol yang bermasalah ke konsol Anda dengan kabel USB. tekan <strong> Tombol PS </strong> mudah-mudahan menghidupkan dan memasangkan pengontrol Anda dalam satu proses. </p> <p> Jika ini tidak berhasil, hidupkan kembali PS4 Anda dan coba pasangkan dengan cara biasa, seperti di atas. </p> <h3 id=\"hard-reset-your-controller\"> 3. Atur Ulang Pengontrol Anda dengan Keras </h3> <p> Jika melepas dan memasangkan kembali pengontrol tidak berhasil, Anda selanjutnya dapat mencoba prosedur reset penuh untuk DualShock 4. Anda memerlukan benda runcing kecil, seperti klip kertas bengkok atau alat pelepas kartu SIM, untuk melakukan ini . </p> <p> Matikan PS4 Anda, lalu balikkan pengontrol Anda. Anda akan melihat lubang kecil di sebelah sekrup dengan tombol L2 (di sisi kanan pengontrol saat dibalik). Gunakan alat runcing Anda untuk menekan dan menahan tombol di dalam lubang ini selama kira-kira lima detik. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> Setelah Anda selesai melakukannya, sambungkan pengontrol Anda ke PS4 lagi melalui kabel USB dan lihat apakah itu berhasil dipasangkan. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Coba Kontroler Di Tempat Lain </h3> <p> Pada titik ini, jika Anda belum melakukannya, Anda harus mencoba menggunakan pengontrol yang bermasalah dengan perangkat lain. Jika Anda memiliki masalah serupa pada PS4 teman atau PC Anda, maka pengontrol Anda kemungkinan rusak. </p> <p> Ini juga merupakan ide yang baik untuk mencoba pengontrol PS4 lain dengan konsol Anda, jika memungkinkan. Jika Anda meminjam DualShock 4 teman yang Anda tahu berfungsi dengan baik dan menemukan bahwa sistem Anda bermasalah, mungkin ada yang salah dengan konektivitas nirkabel PS4 Anda. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Gunakan Pengontrol dalam Mode Kabel </h3> <p> Sebelum Anda menyerah pada pengontrol, Anda harus mencoba memainkannya secara permanen terhubung melalui kabel USB. Namun, perlu diingat bahwa ini hanya berfungsi untuk model pengontrol PS4 yang direvisi. Anda akan tahu bahwa Anda memiliki model ini jika ada bilah lampu di dalam panel sentuh di bagian depan pengontrol Anda. Jika tidak, Anda tidak dapat memaksa komunikasi kabel. </p> <p> Jika Anda belum memilikinya, belilah kabel yang panjang agar Anda tetap dapat menikmati bermain game dari sofa. Itu <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Ailun tiga pak </a> kabel micro-USB 10 kaki adalah pilihan hemat biaya yang baik. </p> <p> Untuk memaksa PS4 Anda menghubungkan pengontrol melalui USB, buka <strong> Pengaturan &gt; Perangkat &gt; Pengontrol &gt; Metode Komunikasi </strong> dan pilih <strong> Gunakan Kabel USB </strong> . Ini akan mencegah DualShock 4 menggunakan Bluetooth, bahkan saat terhubung melalui USB. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> Opsi Perbaikan Perangkat Keras DualShock 4 </h2> <p> Seperti kebanyakan perangkat keras, pengontrol DualShock 4 memiliki garansi satu tahun. Jika Anda membeli pengontrol PS4 Anda dalam setahun terakhir dan tidak dapat memperbaikinya dengan semua tips di atas, Anda harus mengunjungi <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> Halaman Perbaiki &amp; Ganti PlayStation </a> untuk memasukkan permintaan perbaikan pada pengontrol Anda. </p> <p> Jika tidak, Anda dapat mencoba perbaikan perangkat keras sendiri dengan membuka pengontrol Anda. Tetapi tergantung pada masalah spesifik, ini mungkin sulit atau tidak mungkin. Kami merekomendasikan untuk berbicara dengan teknisi perbaikan lokal jika Anda merasa tidak nyaman melakukannya sendiri. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> Masalah Pengontrol PS4, Ditambal </h2> <p> Sekarang Anda tahu cara memperbaiki masalah pengontrol PS4 yang paling umum. Masalah yang lebih spesifik, seperti tombol yang berhenti bekerja, sayangnya termasuk dalam solusi perbaikan perangkat keras yang disebutkan di atas. </p> <p> Semoga masalah Anda mudah diperbaiki. Tetapi jika tidak, dan Anda perlu mengambil pengontrol PS4 baru, Anda memiliki banyak opsi hebat. </p> <p> <small> Kredit Gambar: Joeri Mostmans / <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}