{"title":"Pemerintah A.S. Ingin Tahu Tentang Akurasi Label Privasi Aplikasi","content":"<p> Dengan label Privasi Aplikasi iOS 14 di App Store, Apple memberi pengguna cara baru untuk diberdayakan dengan memiliki lebih banyak pengetahuan tentang aplikasi yang mereka gunakan --- dan bagaimana aplikasi tersebut dapat melacaknya. </p> <p> Tetapi tampaknya itu juga berpotensi membuka sekaleng worm untuk dirinya sendiri, karena Apple sekarang didorong untuk menjamin keakuratan label ini, yang mulai dikirimkan oleh pengembang ke Apple pada bulan Desember. </p> <h2 id=\"concerns-over-accuracy\"> Kekhawatiran Atas Akurasi </h2> <p> Seperti yang dicatat oleh <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumor </a> , Apple telah menerima <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> surat </a> dari House Committee on Energy and Commerce AS, memintanya untuk mengklarifikasi informasi tentang keakuratan label Privasi Aplikasi yang diberikan developer. </p> <p> Label-label ini adalah fitur iOS 14 yang sangat dinanti-nantikan, ditakuti-di-lain-lain yang akan memaksa pengembang untuk lebih terbuka tentang bagaimana aplikasi mereka berinteraksi dengan data pengguna. Ini berarti bahwa pengguna akan dapat membuat keputusan yang lebih tepat dalam hal manfaat vs. kerugian menggunakan aplikasi tertentu. </p> <p> </p> <p> Dalam suratnya, Komite Energi dan Perdagangan DPR AS bertanya kepada Apple tentang laporan yang menunjukkan bahwa label Privasi Aplikasi tertentu dapat memberikan informasi yang &quot;menyesatkan dan salah&quot; kepada pengguna. Itu berdasarkan sebuah laporan, yang diterbitkan bulan lalu, mengklaim bahwa banyak aplikasi yang diberikan tagihan kesehatan yang bersih mungkin tidak sepolos yang mereka sarankan. </p> <p> Masalah potensial dengan fitur iOS 14 adalah ia bergantung pada kejujuran pengembang untuk mengatakan bagaimana data dikumpulkan, serta untuk mengonfirmasi bahwa informasi ini akurat. Apple sendiri mencatat bahwa informasi tersebut &quot;belum diverifikasi oleh Apple&quot;. </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Meminta Tanggapan Dari Apple </h2> <p> Meskipun tampaknya sebagian besar pengembang akan bermain adil dan mematuhi sistem kehormatan, itu bukan sesuatu yang bisa diterima begitu saja. Apple akan secara rutin mengaudit informasi yang dikirimkannya. Namun, banyaknya aplikasi di App Store membuat Apple tidak mungkin memverifikasi secara pribadi setiap daftar. </p> <p> Surat Komite Energi dan Perdagangan DPR AS melanjutkan bahwa: </p> <blockquote> <p> &quot;Kami mendesak Apple untuk meningkatkan validitas label Privasi Aplikasinya untuk memastikan konsumen diberikan informasi yang berarti tentang praktik data aplikasi mereka dan bahwa konsumen tidak dirugikan oleh praktik yang berpotensi menipu ini.&quot; </p> </blockquote> <p> Panitia telah meminta Apple untuk memberikan detail lebih lanjut tentang proses auditnya, apakah label Privasi Aplikasi akan diperbaiki jika ditemukan tidak benar, detail tentang apa yang terjadi ketika pengembang memberikan informasi yang tidak akurat, dan banyak lagi. </p> <p> Mereka meminta Apple untuk menanggapi dengan informasi yang diminta pada 23 Februari. </p> <p> <small> Kredit Gambar: Jason Dent / <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Hapus percikan CC </a></small> </p>"}