{"title":"Roku Ingin Pikiran Anda tentang Remote Isi Ulangnya","content":"<p> Roku merekrut beberapa orang untuk bergabung dengan Program Akses Awal, untuk menguji remote baru (disebut Roku Voice Remote Pro) yang dilengkapi baterai isi ulang. </p> <p> Ini adalah penawaran waktu terbatas selama persediaan masih ada, meskipun Anda masih harus membayar untuk remote. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> Apa itu Roku Voice Remote Pro? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> Akhirnya remote dengan baterai isi ulang </a> dari <a href=\"https://www.reddit.com/r/Roku/\"> Roku </a> </blockquote>  <p> Seperti yang pertama kali ditemukan oleh pengguna Kingtut206 di <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , Roku merekrut orang ke Program Akses Awal untuk menguji remote baru yang disebut Roku Voice Remote Pro. </p> <p> Remote baru memiliki baterai yang dapat diisi ulang, pencari jarak jauh yang hilang (misalnya, Anda dapat mengatakan &quot;Hai Roku, temukan remote saya&quot;), suara bebas genggam, dan tombol pintasan pribadi di samping tombol bermerek standar. </p> <p> Seperti yang dilaporkan oleh <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> The Verge </a> , pengisian daya jarak jauh melalui micro-USB, bukan USB-C yang jauh lebih unggul. Mungkin umpan balik yang dikumpulkan melalui Program Akses Awal akan mengakui hal ini. </p> <p> Partisipasi dalam program ini hanya dengan undangan, meskipun tidak diketahui apa yang membuat Anda memenuhi syarat. </p> <p> Biaya remote $ 29,99 dan diperkirakan akan dikirim pada 19 Februari 2021. </p> <p> Hanya 2.000 unit yang akan terjual dan Roku akan mengumpulkan umpan balik tentang pengalaman Anda dengan remote. Setelah waktu itu, kita dapat mengasumsikan bahwa remote akan disempurnakan sebelum berpotensi dijual secara umum. </p>"}