{"title":"RPG Komputer vs. RPG Klasik: Apa Arti CRPG pada 2021?","content":"<p> Sejarah RPG Komputer sepanjang sejarah video game itu sendiri, berkembang, dan tumbuh bersama selama bertahun-tahun. Dan sama seperti CRPG berevolusi, meningkatkan grafik, menambahkan, atau menjatuhkan mekanisme permainan, begitu pula arti dan terminologi yang digunakan untuk menggambarkannya. </p> <p> Akronim CRPG, yang secara tradisional merupakan singkatan dari Computer Role Playing Game, memperluas artinya dari waktu ke waktu untuk memasukkan RPG untuk platform yang berbeda. Sekarang, itu telah mengadopsi makna baru. Meskipun arti barunya tidak sepenuhnya berbeda dari aslinya, sekarang menggambarkan sub-genre RPG tertentu. </p> <h2 id=\"the-history-of-crpgs\"> Sejarah CRPG </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> Sejarah CRPG dimulai pada 1970-an dengan dirilisnya video game paling awal yang diadaptasi dari game RPG Dungeons &amp; Dragons, Dungeon. Gim ini awalnya tersedia di Atari (Anda dapat memainkannya melalui <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, layanan streaming game di Plex </a> ). </p> <p> Meskipun gameplay Dungeon sebagian besar berbasis teks, itu sepenuhnya menggambarkan gerakan pesta multi-karakter Anda dalam pengaturan fantasi sambil menerapkan sebagian besar prinsip dasar Dungeons &amp; Dragons. </p> <p> Saat itu, kami memberi mereka label RPG Komputer untuk membedakannya dari rekan-rekan meja mereka, yang jauh lebih populer pada saat itu, dan kami hanya mengenalnya sebagai RPG. </p> <p> Menjelang tahun 1990-an CRPG yang sedang berkembang pesat, kini mampu menampilkan dunia fantasi secara utuh, setidaknya dalam perspektif top-down, atau tampilan isometrik. Seperti yang terjadi pada Ultima VII, salah satu CRPG paling interaktif yang pernah dimainkan oleh penulis ini. </p> <p> Hampir semua yang dapat Anda lihat dapat Anda gerakkan, atau berinteraksi dengan: Anda dapat membuat senjata, memainkan instrumen, dan bahkan membawa anggota party Anda yang sudah meninggal keluar dari penjara bawah tanah sampai ke ruang tahta raja untuk membangkitkan mereka! </p> <p> Gerbang Baldur adalah salah satu yang paling mirip dengan pengalaman RPG meja. Ini mengadaptasi set aturan Dungeons &amp; Dragons 2nd Edition (AKA Advanced Dungeons &amp; Dragons) menjadi isometrik <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> CRPG yang dapat dijeda secara real-time </a> . Jenis CRPG ini menekankan taktik dalam pertempuran, perkembangan karakter, pengambilan keputusan, dan mendorong eksplorasi. </p> <p> </p> <p> Saat ini, di dunia di mana konsol mendominasi pasar, video game role playing menjadi lebih populer daripada RPG papan atas. Sampai-sampai dalam penggunaan modern, akronim RPG lebih mengacu pada versi video game-nya. Anda akan menyebut Dungeon&#39;s &amp; Dragons sebagai RPG papan atas, bukan sekadar RPG. </p> <p> Dengan evolusi grafis, mekanisme gameplay CRPG disesuaikan dengan standar grafis modern. Seri CRPG seperti The Elder Scrolls, Gothic, atau The Witcher merevolusi genre, memperkenalkan beberapa mekanisme gameplay baru sambil menjatuhkan yang lain. </p> <p> RPG ini lebih berorientasi aksi dan serba cepat, menempatkan diri mereka sendiri, meskipun tidak sepenuhnya, dalam subgenre hack and slash (ini masih RPG solid!) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Gelombang Baru CRPG </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> Namun, bertentangan dengan tren industri video game saat ini yang menggunakan realisme grafis, muncul gelombang baru CRPG. RPG jadul, atau Klasik, sangat memengaruhi game-game ini dan mereka lebih menekankan pada mekanika gameplay dan imersi, daripada visual. </p> <p> Mereka umumnya adalah permainan isometrik, dengan pertempuran taktis yang dapat dihentikan secara real-time, atau berbasis giliran. CRPG ini juga melakukan yang terbaik untuk menjadi imersif mungkin, memberi Anda blok prosa yang dibuat dengan baik dan latar belakang yang solid. </p> <p> Sebagian besar dari mereka mengandalkan teks daripada akting suara untuk sebagian besar dialog, seperti CRPG sekolah lama. Beberapa CRPG ini termasuk Pilar Keabadian, Divinity: Original Sin, atau Pathfinder: Kingmaker. </p> <p> Game-game ini juga menekankan taktik pertempuran, perkembangan karakter, pengambilan keputusan, dan mendorong eksplorasi, seperti halnya CRPG jadul. Karena alasan ini, kami menganggapnya lebih terkait erat dengan RPG Klasik daripada kebanyakan RPG modern. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> Apa Artinya CRPG pada tahun 2021 </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> Sejak tahun 2000-an, RPG telah menjadi istilah standar yang mengacu pada video game role playing. Namun sekitar tahun 2015, mereka merilis Divinity: Original Sin dan Pillars of Eternity. </p> <p> RPG ini adalah keberangkatan dari RPG modern yang berorientasi aksi, sementara sangat mirip dengan judul lama dalam estetika dan mekanika gameplay. Sekitar waktu inilah muncul kebutuhan akan istilah baru untuk membedakan RPG ini dari RPG modern. </p> <p> Meskipun orang telah melemparkan istilah &quot;sekolah lama&quot; dan &quot;RPG Klasik&quot; di internet selama bertahun-tahun untuk menggambarkan game-game ini, yang terakhir adalah yang macet. Sama seperti permainan video game modern yang mengklaim akronim RPG untuk diri mereka sendiri, orang-orang menyebut RPG jadul &quot;CRPG&quot; sekarang. </p>"}