{"title":"Surface Duo Mendapat Tanggal Rilis di Inggris dan Penurunan Harga","content":"<p> Surface Duo Microsoft tidak memiliki penerimaan rilis yang fantastis, tetapi tampaknya perusahaan ingin membuat kesan pertama yang lebih baik di luar AS. Perusahaan tidak hanya memangkas harga Surface Duo, tetapi juga memiliki tanggal rilis yang dikonfirmasi untuk pasar Inggris. </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> Persiapan Akhir Microsoft di Luar Negeri untuk Surface Duo </h2> <p> Berita ini datang kepada kami dari <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . Jika Anda ingat, saat Surface Duo diluncurkan, <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> itu tidak menerima ulasan yang bagus </a> . Satu poin utama adalah seberapa buggy sistem operasi Duo, tetapi poin lainnya adalah harga yang menggiurkan di $1399,99. </p> <p> Microsoft telah bekerja keras untuk memperbaiki masalah utama yang ditemukan oleh pengulas, tetapi label harganya yang tinggi masih tetap ada. Namun, Microsoft berencana untuk memberikan Surface Duo penurunan harga yang signifikan menjadi $ 999,99. </p> <p> Penurunan ini kemungkinan dalam persiapan untuk rilis di luar negeri, karena kritikus di seluruh dunia bersiap untuk memecah Surface Duo inci demi inci. Dengan titik harga yang lebih rendah ini, ditambah perbaikan sistem operasi Surface Duo baru-baru ini, keajaiban layar ganda mungkin belum membuat kesan positif di luar negeri. </p> <p> Microsoft juga telah mengkonfirmasi kapan penggemar Inggris dapat mencoba Surface Duo sendiri. Jika Anda berada di Inggris Raya, awasi pengecer elektronik pada 18 Februari 2021. </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> Menggaruk Permukaan Rencana Microsoft di Luar Negeri </h2> <p> Sementara Surface Duo berjuang untuk membuat kesan yang baik di AS, mungkin masih ada harapan untuk itu di luar negeri. Dengan semua perbaikan pada sistem operasi Surface Duo yang dikombinasikan dengan penurunan harga ini, rumput mungkin menjadi lebih hijau di sisi lain. </p> <p> Jika Anda ingin tahu patch seperti apa yang didorong Microsoft untuk Surface Duo, perusahaan baru-baru ini merilis beberapa pembaruan stabilitas untuk mengatasi bug sebelum debut internasional Duo. </p> <p> <small> Kredit Gambar: Jack Skeens / <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}