{"title":"Studi Baru Mengatakan Pengguna Android Menjadi Mitra Lebih Baik Daripada Pengguna iPhone","content":"<p> Ada pertempuran tak berkesudahan yang berkecamuk antara iPhone dan pengguna smartphone Android. Bahkan mereka yang tidak berpartisipasi dalam pertempuran telah memilih pihak hanya dengan memilih smartphone mereka. </p> <p> Ada kerutan baru dalam pertempuran, seperti <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> BandingkanMyMobile </a> telah melakukan penelitian baru-baru ini mengenai apakah pengguna iPhone atau Android menjadi mitra hubungan yang lebih baik. Ternyata, pengguna iPhone cenderung memiliki kebiasaan telepon yang lebih mengganggu daripada pengguna Android, yang mengarah pada kesimpulan bahwa pengguna Android adalah mitra yang lebih baik. </p> <p> Tentu saja, ada lebih banyak data daripada kesimpulan sederhana itu, jadi mari selami lebih dalam dan lihatlah. </p> <h2 id=\"iphone-and-android-relationship-study\"> Studi Hubungan iPhone dan Android </h2> <p> Kesimpulan keseluruhan penelitian ini adalah bahwa pengguna Android menjadi mitra yang lebih baik daripada pengguna iPhone, tetapi hasilnya jauh lebih dalam daripada kesimpulan dangkal itu. Secara total, penelitian ini mensurvei lebih dari 2.000 pengguna, sehingga menawarkan ukuran sampel yang cukup besar. </p> <p> Saat melihat kebiasaan ponsel cerdas yang paling mengganggu, penelitian ini menemukan bahwa pengguna iPhone 12 persen lebih mungkin melakukan pelanggaran daripada rekan mereka yang memiliki Android. Faktanya, pengguna iPhone melakukan lebih banyak kekejaman penggunaan telepon daripada pengguna Android di setiap kategori survei. </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> Beberapa contoh pelanggaran yang mengganggu termasuk membiarkan pasangannya membaca, menggunakan ponsel saat menonton film, dan bahkan menggunakan ponsel saat mengemudi (yang tidak hanya mengganggu tetapi juga sangat berbahaya). Pengguna iPhone bahkan lebih mungkin untuk menjatuhkan dan merusak ponsel mereka daripada pengguna Android, yang merupakan statistik yang benar-benar mengejutkan. </p> <p> Beberapa kebiasaan menjengkelkan lainnya termasuk <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> merayap di profil media sosial orang lain </a> , menggunakan filter berlebihan pada foto, mengirim beberapa pesan satu baris (saya tahu saya melakukan ini terlalu banyak), dan menggunakan telepon mereka saat melakukan percakapan. </p> <p> Menariknya, penelitian ini juga menemukan bahwa pria lebih cenderung melakukan sebagian besar kebiasaan yang mengganggu (dan dalam beberapa kasus benar-benar tidak aman) daripada wanita. </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> Tetapi Pengguna Apple Mendapatkan Lebih Banyak Tanggal </h2> <p> Menurut penelitian lain yang diterbitkan oleh CompareMyMobile, pengguna iPhone lebih cenderung mendapatkan kencan di aplikasi kencan online. Penelitian, yang mengamati lebih dari 50.000 gesekan, menemukan bahwa pengguna iPhone 76 persen lebih mungkin untuk berkencan daripada seseorang dengan handset Android saat berbicara melalui aplikasi kencan. </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> Jika studi pertama dapat dipercaya, hubungan itu mungkin tidak berhasil karena pengguna iPhone merayap di profil media sosial lain dan mengirim SMS saat mengemudi. Namun, mereka lebih cenderung menemukan pasangan berikutnya ketika hubungan sebelumnya tidak berhasil. </p> <p> Pada akhirnya, berkencan tidak pernah mudah. Jadi lakukan yang terbaik untuk mencegah ponsel Anda menjadi perangkat yang membunuh hal baik! </p>"}