{"title":"Smart Health Card vs. Paspor Vaksinasi Digital: Apa Perbedaan Besarnya?","content":"<p> Pandemi COVID-19 telah membuat sistem perawatan kesehatan terguncang. Sekarang, prospek paspor kesehatan digital dan kartu kesehatan pintar semakin meningkat ketika pemerintah dan bisnis sama-sama berusaha untuk kembali normal. </p> <p> Lantas, apa itu smart health card, dan apakah sama dengan health passport? </p> <h2 id=\"what-is-a-smart-health-card\"> Apa Itu Kartu Sehat Cerdas? </h2> <p> Kartu kesehatan pintar adalah plastik tipis dengan chip sirkuit terintegrasi tertanam yang berisi data terenkripsi. </p> <p> Yang membuatnya pintar adalah chip yang bertindak sebagai superkomputer. Chip tersebut dapat diprogram untuk melakukan tindakan yang berbeda dengan berbagai aplikasi, sementara pembaca yang terhubung ke sistem komputer dapat mengakses atau memperbarui data chip. </p> <p> Ini mungkin terlihat seperti kartu kredit, tetapi fungsinya berbeda. Digunakan di banyak negara di Eropa dan di seluruh dunia, kartu kesehatan pintar menyimpan informasi perawatan kesehatan, cakupan asuransi, dan data medis penting lainnya. </p> <p> </p> <h2 id=\"advantages-of-using-a-smart-health-card\"> Keuntungan Menggunakan Smart Health Card </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Perawatan Kesehatan di Prancis: Apa itu &amp;#39;Carte Vitale&quot;? <a href=\"https://t.co/5VVcTjZyxh\"> https://t.co/5VVcTjZyxh </a> <a href=\"https://t.co/6I0TCy70wg\"> pic.twitter.com/6I0TCy70wg </a></p> — FrenchEntree (@FrenchEntree) <a href=\"https://twitter.com/FrenchEntree/status/738646709308379136?ref_src=twsrc%5Etfw\"> 3 Juni 2016 </a></blockquote>  <p> Di antara banyak keuntungan lain menggunakan sistem ini, yang paling penting adalah meningkatkan perawatan kritis atau darurat. Kartu kesehatan pintar memberikan akses langsung ke data kesehatan pasien atau catatan medis dalam keadaan darurat. </p> <p> Misalnya, penanggap darurat dengan pembaca kartu portabel akan memiliki informasi langsung tentang pasien saat berada di ambulans dalam perjalanan ke rumah sakit. Ini bahkan lebih penting ketika pasien tidak sadar, tidak responsif, atau tidak dapat memberi tahu responden informasi perawatan kesehatannya. </p> <p> Bayangkan seorang responden yang dapat meneruskan data pasien kritis ke staf ruang gawat darurat sebelum ambulans tiba. Ini akan membantu staf UGD mempersiapkan apa yang dibutuhkan untuk merawat pasien bahkan sebelum kedatangan. </p> <p> Transfer data pasien yang cepat dan efisien selama perawatan kritis dapat sangat meningkatkan waktu respons, sehingga menyelamatkan nyawa. </p> <h3 id=\"seamless-transfer-of-data\"> Transfer Data yang Mulus </h3> <p> Menggunakan sistem ini juga memberikan transfer informasi pasien yang lebih akurat dan lancar dari staf ruang gawat darurat ke penyedia layanan kesehatan dalam perawatan pasien rawat inap. </p> <p> Dokter tidak perlu bergantung pada ingatan pasien untuk <a href=\"https://www.makeuseof.com/tag/google-store-medical-data-cloud/\" target=\"_blank\" rel=\"nofollow noopener\"> mengambil data medis penting </a> , yang mengurangi kemungkinan kesalahan. Selain itu, sistem kartu kesehatan pintar menawarkan pertukaran informasi pasien yang lancar antar dokter. </p> <p> Ini mengurangi kemungkinan bocornya data pasien kritis (yang dapat digunakan untuk <a href=\"https://www.makeuseof.com/tag/the-10-pieces-of-information-identity-thieves-are-looking-for/\" target=\"_blank\" rel=\"nofollow noopener\"> pencurian identitas </a> ). Ini sering terjadi ketika informasi pasien dibagikan melalui faks, telepon, atau email. </p> <h3 id=\"easier-storage-and-retrieval-of-medical-records\"> Penyimpanan dan Pengambilan Rekam Medis yang Lebih Mudah </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"it\" dir=\"ltr\"> Tessera sanitaria: ayo richiederne un duplicato <a href=\"https://t.co/2GrFWpanC2\"> https://t.co/2GrFWpanC2 </a> <a href=\"https://t.co/JKR6ampnXq\"> pic.twitter.com/JKR6ampnXq </a></p> — CataniaToday (@CataniaToday) <a href=\"https://twitter.com/CataniaToday/status/1359189830937300995?ref_src=twsrc%5Etfw\"> 9 Februari 2021 </a></blockquote>  <p> Sistem ini memberi pasien cara yang nyaman dan tidak merepotkan untuk membawa hasil tes laboratorium atau catatan dokter. </p> <p> Ini seperti memiliki database informasi perawatan kesehatan—tes sebelumnya, perawatan, dan file untuk pertanggungan asuransi—dalam kartu kecil di dompet pasien. Tidak perlu lagi membawa-bawa kertas untuk membuat janji dengan dokter. </p> <h3 id=\"reduces-medical-errors-and-duplicate-testing\"> Mengurangi Kesalahan Medis dan Pengujian Duplikat </h3> <p> Sistem perawatan kesehatan negara bahkan dapat mengambil manfaat dari ini karena kesalahan medis, dan tes duplikat dapat dihindari. Kesalahan medis yang datang dengan entri data yang tidak tepat, hambatan bahasa, atau miskomunikasi dapat diminimalkan melalui sistem ini. </p> <p> Kesalahan manusia terkadang dapat menyebabkan ketidakcocokan pasien dan catatan. Memiliki kartu kesehatan pintar memungkinkan penyedia layanan kesehatan untuk mencocokkan pasien dengan catatan kesehatan yang benar dengan mudah. Ini mengurangi kemungkinan memiliki catatan duplikat atau beberapa tes yang berlebihan, yang dapat menghabiskan banyak uang. Itu bisa menghemat sistem perawatan kesehatan biaya yang tidak perlu. </p> <h3 id=\"more-accurate-verification-of-insurance-coverage\"> Verifikasi Pertanggungan Asuransi yang Lebih Akurat </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Kota istirahat? Perjalanan kerja? Liburan? Untuk ketenangan pikiran, selalu bawa Kartu Asuransi Kesehatan Eropa Anda! <a href=\"https://t.co/31zoREZAEy\"> https://t.co/31zoREZAEy </a> <a href=\"https://twitter.com/hashtag/EHIC?src=hash&ref_src=twsrc%5Etfw\"> #EHIC </a> <a href=\"https://t.co/o05Jx8aIwq\"> pic.twitter.com/o05Jx8aIwq </a></p> — Komisi Eropa (@EU_Commission) <a href=\"https://twitter.com/EU_Commission/status/893485278114992128?ref_src=twsrc%5Etfw\"> 4 Agustus 2017 </a></blockquote>  <p> Pencurian identitas medis telah menjadi masalah serius dalam beberapa tahun terakhir. Kejahatan tersebut melibatkan penipuan penggunaan informasi asuransi kesehatan untuk mengakses layanan kesehatan atau menerima penggantian. Sederhananya, seseorang yang tidak tercakup dalam polis dapat mencuri informasi asuransi kesehatan orang lain untuk mendapatkan keuntungan. </p> <p> Pelanggaran sistem perawatan kesehatan atau asuransi kesehatan sering kali membocorkan informasi identitas pribadi (PII) sensitif yang dapat dijual peretas di web gelap. PII dapat mencakup informasi asuransi kesehatan. </p> <p> Inilah yang digunakan pencuri untuk mengakses layanan kesehatan yang seharusnya tidak mereka akses. Mereka dapat membeli obat resep atau mengajukan klaim asuransi penipuan untuk prosedur yang tidak pernah dilakukan. </p> <p> Sistem kartu kesehatan yang cerdas dapat mencegah semua ini karena sebagian besar menggunakan protokol otentikasi dan keamanan. Beberapa dapat menggunakan otentikasi 2 faktor (2FA) atau otentikasi multi-faktor (MFA), sementara yang lain memiliki fitur biometrik yang memeriksa sidik jari pasien untuk memverifikasi identitas mereka. </p> <p> </p> <h2 id=\"disadvantages-of-using-a-smart-health-card-system\"> Kekurangan Menggunakan Sistem Smart Health Card </h2> <p> Masalah privasi tetap menjadi perhatian terbesar yang menghalangi pengguna untuk mengadaptasi teknologi untuk tujuan medis. Banyak yang menyuarakan keprihatinan karena memberi orang akses mudah ke banyak data sensitif seperti perawatan, catatan penyakit, dan pengobatan. Dan dengan berita tentang sistem perawatan kesehatan dan asuransi yang menjadi korban pelanggaran data, kekhawatiran ini bukannya tidak berdasar. </p> <p> Memiliki semua catatan di satu tempat bisa nyaman, tetapi satu a <a href=\"https://www.makeuseof.com/tag/healthcare-new-attack-vector-scammers-id-thieves/\" target=\"_blank\" rel=\"nofollow noopener\"> pelanggaran data </a> bisa mendaratkan data yang sangat sensitif di tangan yang salah. </p> <h3 id=\"creating-digital-divide\"> Menciptakan Pembagian Digital </h3> <p> Lalu ada masalah menciptakan kesenjangan digital. Banyak yang berpendapat bahwa smart health card hanya dapat digunakan oleh rumah sakit dan komunitas yang memiliki akses ke sistem. Untuk memanfaatkan teknologi ini, mesin rumah sakit harus mendukung perangkat lunak yang sama, antarmuka pembaca kartu pintar, dan harus dapat mendukung perangkat keras yang diperlukan. </p> <p> Berbicara tentang perangkat keras, ada juga pertanyaan tentang biaya tambahan. Perangkat keras untuk sistem, perangkat lunak untuk pembaca, dan jaringan dengan basis data dapat menghabiskan biaya jutaan dan bahkan lebih mahal lagi untuk pemeliharaannya. Bahkan kartu plastik itu sendiri membutuhkan biaya untuk diproduksi. </p> <p> Siapa yang akan menanggung investasi awal? Selanjutnya, berapa lama sebelum investasi awal ini menuai manfaat bagi pemerintah dan warganya? </p> <h3 id=\"bugs-and-power-failures\"> Bug dan Kegagalan Daya </h3> <p> Tentu saja, teknologi semacam ini tidak kebal terhadap bug dan gangguan atau serangan siber yang dapat menyebabkan kebocoran data. Satu perangkat yang tidak ditambal dalam sistem dapat menjadi pintu gerbang bagi malware yang dapat menyebabkan kerusakan pada jaringan dan database. </p> <p> Ada juga kekhawatiran tentang pemadaman listrik. Bagaimana hal ini dapat dipertahankan dalam masyarakat dengan daya yang terbatas atau masalah infrastruktur daya? Bahkan sistem tenaga yang paling canggih pun bisa gagal dalam bencana besar. Bayangkan tidak memiliki akses ke data medis selama bencana. </p> <p> </p> <h2 id=\"smart-healthcare-vs-digital-vaccination-passport\"> Perawatan Kesehatan Cerdas Vs. Paspor Vaksinasi Digital </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Nama-nama besar di bidang teknologi dan perawatan kesehatan termasuk Mayo Clinic, Cigna&#39;s Evernorth dan Microsoft bekerja sama untuk membuat paspor vaksinasi COVID-19 digital. <a href=\"https://t.co/KgTVjq9lUe\"> https://t.co/KgTVjq9lUe </a> <a href=\"https://t.co/ZiJIE8xoTY\"> pic.twitter.com/ZiJIE8xoTY </a></p> — Mast Health (@MastAnalytics) <a href=\"https://twitter.com/MastAnalytics/status/1351683116990164993?ref_src=twsrc%5Etfw\"> 20 Januari 2021 </a></blockquote>  <p> Ada pembicaraan tentang paspor vaksinasi digital untuk perjalanan dan akses ke konser atau pertemuan pasca-Covid. Sementara paspor kesehatan digital mungkin tampak mirip dengan kartu kesehatan pintar yang digunakan di negara-negara seperti Jerman, Prancis, dan Austria, ada perbedaan utama. </p> <p> </p> <p> Pertama, paspor digital vaksin COVID-19 akan datang dalam bentuk sertifikat digital yang diunduh ke ponsel seseorang. Sertifikat digital atau paspor vaksin Covid adalah pass dengan nama pasien dan rincian vaksin Covid mereka (tanggal pemberian, produsen vaksin, lokasi vaksinasi). Ini adalah dokumen digital satu halaman dengan kode batang atau kode QR yang dapat dipindai di titik masuk. </p> <p> Berbeda dengan kartu kesehatan pintar, paspor kesehatan digital tidak dimaksudkan sebagai kartu plastik fisik. </p> <p> Ini hanya akan memiliki informasi yang berkaitan dengan tes COVID-19, catatan vaksinasi, dan fasilitas kesehatan orang tersebut tempat vaksinasi dan tes tersebut dilakukan. Itu tidak akan memiliki seluruh riwayat medis pasien. </p> <p> Paspor kesehatan digital ini akan memberi orang akses ke pertemuan seperti konser dan tempat kerja di mana mereka akan berhubungan dengan banyak orang atau memberi mereka akses ke negara-negara setelah perjalanan menjadi normal. Orang yang tidak memiliki ponsel cerdas dapat mencetak kode mereka, dipindai di titik masuk. </p> <h3 id=\"breach-of-privacy-and-curtailment-of-human-rights\"> Pelanggaran Privasi dan Pembatasan Hak Asasi Manusia </h3> <p> Sementara banyak yang ingin mendapatkan suntikan, mengunduh paspor vaksinasi digital, dan kembali normal, beberapa membunyikan alarm tentang kemungkinan dampak dari pengenalan teknologi ini. Para ahli dan pembela hak asasi manusia memperingatkan pengembang untuk mengatasi potensi privasi data dan masalah hak asasi manusia yang dapat dibawa oleh paspor vaksinasi. </p> <p> Penelitian yang diterbitkan oleh <a href=\"https://socialsciences.exeter.ac.uk/media/universityofexeter/collegeofsocialsciencesandinternationalstudies/lawimages/research/Policy_brief_-_Digital_Health_Passports_COVID-19_-_Beduschi.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Fakultas Hukum Universitas Exeter </a> memperingatkan bagaimana paspor ini dapat membatasi hak asasi manusia yang mendasar, termasuk hak atas privasi, kebebasan bergerak, dan berkumpul secara damai. </p> <p> Menurut laporan tersebut, masalahnya berasal dari penggunaan paspor atas informasi kesehatan pribadi yang sensitif (bagaimana ini akan disimpan, siapa yang akan memiliki akses ke sana?) dan bagaimana hal itu dapat menciptakan kesenjangan baru di antara orang-orang berdasarkan status kesehatan mereka. </p> <p> Paspor juga berpotensi menentukan atau membatasi sejauh mana seseorang menikmati hak dan kebebasan. Penggunaan paspor kesehatan digital, para ahli memperingatkan, dapat memperdalam ketidaksetaraan antara masyarakat yang memiliki akses langsung ke vaksin atau paspor kesehatan dan mereka yang tidak. </p> <p> </p> <h2 id=\"future-of-healthcare\"> Masa Depan Kesehatan </h2> <p> Negara-negara seperti Prancis telah menggunakan kartu kesehatan pintar sejak tahun 90-an, diikuti oleh negara-negara lain di awal tahun 2000-an. </p> <p> Adopsi teknologi ini agak lambat di negara-negara seperti AS, yang menyatakan masalah privasi sebagai perhatian utama. Meskipun ada banyak keuntungan untuk mengadopsi sistem ini, ada juga beberapa kelemahan yang memerlukan pertimbangan yang cermat. </p>"}