{"title":"Spotify Sedang Menguji Lirik Langsung di AS","content":"<p> Apakah Anda suka bernyanyi bersama untuk lagu Spotify favorit Anda, tetapi selalu harus mencari lirik untuk memastikan karaoke Anda akurat? Anda beruntung. Spotify sekarang menguji fitur lirik langsungnya kepada beberapa orang di AS. </p> <h2 id=\"spotify-rolls-out-real-time-lyrics\"> Spotify Meluncurkan Lirik Real-Time </h2> <p> Jika Anda berada di AS, Anda mungkin melihat fitur Spotify baru yang memungkinkan Anda menampilkan lirik secara real-time dengan musik yang sedang Anda putar. Liriknya disediakan oleh perusahaan data musik Musixmatch. </p> <p> &quot;Mungkin&quot; adalah kata kunci di sana, karena ini masih dalam tahap uji coba. Itu berarti hanya sekelompok pengguna yang akan melihat fitur tersebut sementara Spotify mengukur dampaknya. Tidak diketahui berapa banyak pengguna yang membentuk grup uji. </p> <p> Lirik telah menjadi fitur yang sudah lama diminta oleh Spotify, jadi akan mengejutkan jika fitur tersebut pada akhirnya tidak diluncurkan untuk semua orang, tetapi tidak ada yang pasti. </p> <p> Dalam email ke <a href=\"https://www.engadget.com/spotify-live-lyrics-united-states-test-ios-android-140045159.html\" target=\"_blank\" rel=\"nofollow noopener\"> Engadget </a> , juru bicara Spotify mengatakan: </p> <blockquote> <p> Kami dapat mengonfirmasi bahwa kami sedang menguji fitur lirik kami ke sejumlah pengguna tertentu di AS. Di Spotify, kami secara rutin melakukan sejumlah pengujian dalam upaya meningkatkan pengalaman pengguna kami. Beberapa dari tes tersebut akhirnya membuka jalan bagi pengalaman pengguna kami yang lebih luas dan yang lainnya hanya berfungsi sebagai pembelajaran penting. Kami tidak memiliki berita lebih lanjut untuk dibagikan saat ini. </p> </blockquote> <p> </p> <h2 id=\"are-lyrics-new-for-spotify\"> Apakah Lirik Baru untuk Spotify? </h2> <p> Sebenarnya, lirik waktu nyata bukanlah fitur baru. Itu karena sudah tersedia di negara-negara seperti Brasil, Meksiko, India, dan Singapura sejak Juni 2020. </p> <p> Bahkan, jauh sebelum itu, Spotify memiliki fitur lirik langsung di seluruh dunia. Itu juga datang sebagai hasil dari kemitraan dengan Musixmatch, meskipun fitur itu dihapus begitu saja ketika perjanjian antara kedua perusahaan berakhir. </p> <p> Spotify kemudian menggantinya dengan integrasi dengan Genius, dalam fitur yang dijuluki &quot;Behind the Lyrics&quot;, yang menampilkan informasi dan fakta menyenangkan tentang beberapa lagu. Ini juga sesuatu yang tersedia di Apple Music, yang juga mendukung lirik langsung. </p> <p> Engadget melaporkan bahwa &quot;Di Balik Lirik&quot; akan dihapus dari Spotify jika fitur lirik langsung diluncurkan lebih luas. Ini mungkin tidak akan dilewatkan oleh banyak orang. </p> <p> Bagi orang-orang di wilayah yang belum memiliki lirik langsung, ada opsi untuk <a href=\"https://www.makeuseof.com/tag/lyrics-currently-playing-songs-spotify/\" target=\"_blank\" rel=\"nofollow noopener\"> gunakan aplikasi lain untuk melihat lirik di Spotify </a> . </p> <p> Tentu saja, Anda juga dapat menggunakan salah satu dari banyak situs web lirik di internet, meskipun ini tidak akan ditampilkan tepat waktu untuk musik Spotify Anda. </p>"}