{"title":"Twitter akan Melabeli Akun Pribadi Pejabat Pemerintah","content":"<p> Twitter akan segera mulai menempatkan label pada akun pribadi pejabat pemerintah. Label seharusnya membantu pengguna dengan mudah mengidentifikasi siapa pun yang terkait dengan pemerintah. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Lebih Banyak Pejabat Pemerintah Akan Mendapatkan Label di Twitter </h2> <p> Menurut sebuah posting di <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> blog twitter </a> , platform akan mulai memberi label pada akun pribadi &quot;kepala negara&quot; pada 17 Februari 2021. Ini juga akan menempelkan label pada akun yang terkait dengan media yang berafiliasi dengan negara. </p> <p> Twitter juga memperluas jangkauan labelnya untuk mencakup pejabat pemerintah di lebih banyak negara. Lokasi tersebut antara lain Kanada, Kuba, Ekuador, Mesir, Jerman, Honduras, Indonesia, Iran, Italia, Jepang, Arab Saudi, Serbia, Spanyol, Thailand, Turki, dan Uni Emirat Arab. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Kredit Gambar: Twitter </p> <p> Platform berharap bahwa label ini akan membantu pengguna &quot;memiliki pengalaman yang lebih terinformasi di Twitter,&quot; dan juga berencana untuk mengubah teks label untuk &quot;menambah lebih spesifik&quot; dengan &quot;membedakan antara individu dan institusi.&quot; </p> <p> Label pertama Twitter untuk akun yang berafiliasi dengan pemerintah diluncurkan pada Agustus 2020. Awalnya, label ini hanya berlaku untuk pejabat yang terkait dengan lima negara di Dewan Keamanan PBB, dan tidak menyertakan akun pribadi pejabat tersebut. </p> <p> Meskipun demikian, label ini bukanlah <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> jab terang-terangan di informasi yang salah </a> , tetapi mereka akan tetap membantu pengguna mendapatkan lebih banyak konteks tentang apa yang mereka baca, dan dari siapa asalnya. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter Hanya Akan Terus Memperluas Labelnya </h2> <p> Di akhir posting blognya, Twitter mencatat bahwa mereka berharap untuk memperluas labelnya ke &quot;negara tambahan dari waktu ke waktu.&quot; Label tersebut muncul sebagai bendera abu-abu pucat di profil Twitter seseorang, dan kemungkinan Anda akan lebih sering menemukannya dalam beberapa minggu mendatang. </p>"}