{"title":"VW Klaim Apple Tidak Akan Mudah Berkendara di Industri Mobil","content":"<p> Herbert Diess, kepala eksekutif Grup Volkswagen, telah meremehkan dampak potensial dari Apple Car pada industri otomotif, dengan mengatakan VW &quot;tidak takut&quot; dengan Project Titan. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW &quot;Tidak Takut&quot; dengan Mobil Apple </h2> <p> Meskipun Diess mengakui bahwa mobil bermerek Apple memang masuk akal, dia tidak berpikir Apple dapat mendominasi lanskap pembuatan mobil &quot;dalam semalam&quot; karena persaingan yang ketat. Memotong baja dan menjual mobil kepada konsumen yang rewel adalah bisnis yang sulit, ia mengisyaratkan, menambahkan ini bukan bidang yang bisa &quot;diambil alih oleh satu perusahaan dengan satu pukulan&quot;. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> menyampaikan apa yang dikatakan Diess kepada Frankfurter Allgemeine Sonntagszeitung dalam sebuah wawancara: </p> <blockquote> <p> Industri mobil bukanlah sektor teknologi tipikal yang bisa Anda ambil alih dengan satu pukulan. Apple tidak akan mengelolanya dalam semalam. Meski begitu, kami tidak takut. </p> </blockquote> <p> Namun, kendaraan bermerek Apple akan masuk akal mengingat kompetensi Apple dalam baterai, perangkat lunak, desain industri, dan sumber dayanya yang tampaknya tak ada habisnya, tambah eksekutif tersebut. Apple tidak menawarkan produk terkait mobil selain dari aside <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Perangkat lunak dasbor CarPlay </a> yang memungkinkan radio mobil atau unit kepala bertindak sebagai tampilan dan pengontrol untuk iPhone. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> Rahasia Terburuk Industri </h2> <p> Rencana untuk Project Titan (nama kode internal untuk Apple Car) masih belum dipublikasikan meskipun ada banyak rumor baru-baru ini yang mengatakan <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple ingin bermitra dengan Hyundai/Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple dilaporkan telah berbicara dengan perusahaan mobil lain </a> dan produsen kontrak---termasuk Magna, Nissan, dan Foxconn---tentang membangun kendaraan yang digerakkan secara otonom. Sumber mengatakan Apple Car mungkin tidak memiliki setir karena mungkin awalnya <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> fokus pada pengiriman makanan dan operasi robotaxi </a> sebelum dijual ke konsumen. </p> <p> </p> <p> Pengambilan terbesar dari komentar Herbert adalah bahwa industri otomotif telah memperhatikan Proyek Titan dengan cermat. Jelas, pemikiran Apple memasuki sektor ini membuat beberapa eksekutif puncak gugup. Konon, sejarah penuh dengan orang-orang yang seharusnya tahu lebih baik daripada mencemooh Apple karena memasuki kategori produk baru. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Bagaimana CEO Palm Menertawakan iPhone </h2> <p> Contoh terbaiknya adalah mantan CEO Palm Ed Colligan. Hanya beberapa minggu sebelum pengenalan iPhone asli pada tahun 2007, Colligan menertawakan gagasan bahwa perusahaan yang dikenal merancang komputer cantik dapat memenangkan pelanggan di sektor smartphone yang kompetitif, dengan mengatakan: </p> <blockquote> <p> Kami telah belajar dan berjuang selama beberapa tahun di sini untuk mencari tahu cara membuat ponsel yang layak. Orang-orang PC tidak akan hanya mengetahui hal ini. Mereka tidak akan masuk begitu saja. </p> </blockquote> <p> Mirip dengan bagaimana Colligan menggambarkan Apple sebagai &quot;orang-orang PC&quot;, bos Volkswagen mencoba mengecilkan gagasan bahwa perusahaan teknologi dapat memenangkan pelanggan dalam bisnis pembuatan mobil. Sejarah akan menunjukkan apakah komentar Herbert akan menua lebih baik daripada komentar Colligan. </p>"}