{"title":"10 cose che non sapevi che Google Docs potesse fare","content":"<p> Google Doc può sembrare di base in superficie, ma lo strumento di produttività cloud ha molte funzionalità trascurate che possono aiutarti a fare di più sul lavoro. </p> <p> In questo articolo, esamineremo diverse funzionalità di Google Doc che probabilmente non conoscevi e come puoi utilizzarle per risparmiare tempo nella creazione di contenuti. </p> <p> Tieni presente che queste funzioni sono per lo più accessibili nella versione desktop dello strumento Google Documenti. Verranno indicati quelli utilizzabili anche sulla versione mobile. </p> <h2 id=\"voice-typing\"> 1. Digitazione vocale </h2> <p> Per utilizzare la funzione di digitazione vocale, apri un documento e fai clic su <strong> Utensili </strong> dalla barra dei menu nella parte superiore della pagina. Selezionare <strong> Digitazione vocale </strong> dall&#39;elenco a discesa. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> Verrà visualizzato un microfono sullo schermo, con un menu della lingua in cui è possibile selezionare la lingua di lingua preferita. Quando sei pronto per pronunciare il testo, fai clic sul microfono o premi <strong> Cmd + Maiusc + S </strong> (se stai usando un Mac) o <strong> Ctrl + Maiusc + S </strong> (se utilizzi un PC Windows) per avviare la registrazione. </p> <p> Per aggiungere la punteggiatura tra il testo, pronuncia il nome del segno di punteggiatura che desideri aggiungere, ad esempio &quot;punto&quot;, &quot;virgola&quot; o &quot;punto interrogativo&quot;. Puoi dare istruzioni di formattazione come &quot;nuova riga&quot; o &quot;nuovo paragrafo&quot; o &quot;interrompi l&#39;ascolto&quot; se vuoi fare una pausa dalla digitazione vocale e &quot;riprendere&quot; quando sei pronto per continuare. </p> <p> Cerca i comandi di modifica avanzata da questo <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> elenco di comandi </a> sulla pagina di supporto di Google. </p> <p> Puoi anche usare questa funzione per trascrivere qualsiasi audio. Riproduci semplicemente l&#39;audio (dal tuo telefono o da qualsiasi altro dispositivo) alla voce in testo e dovrebbe digitarlo per te. Potrebbe essere necessario apportare alcune modifiche, ma avresti risparmiato molto tempo. </p> <p> </p> <p> La funzione di digitazione vocale è disponibile solo sul desktop ma funziona solo sul browser Chrome. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Modifica offline </h2> <p> Molte persone amano Google Docs per la sua funzione di salvataggio istantaneo su cloud, ma può essere scomodo se non si ha accesso a Internet per un po&#39;. La buona notizia è che puoi ancora accedere e modificare i tuoi file offline. </p> <p> Questa funzione è disponibile solo su Google Chrome e dovresti installare e attivare il <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Estensione Chrome offline di Google Documenti </a> . Inoltre, assicurati di non navigare in modalità privata. </p> <p> Questa funzione deve essere implementata quando sei online, ma una volta terminato, puoi scrivere e modificare il testo offline e quindi verranno salvati nel cloud quando avrai accesso a Internet. Ecco come. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> Per rendere possibile <strong> apri e salva i file di Google Documenti offline </strong> , Seguire <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> queste istruzioni </a> . Questa funzione è disponibile su PC, iOS e Android. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Traccia/ripristina la cronologia delle versioni del documento </h2> <p> Se stai lavorando su un documento da solo o con altri, puoi tenere traccia delle modifiche al documento utilizzando la funzione Cronologia versioni. </p> <p> Puoi anche ripristinare il documento a una versione precedente temporaneamente o permanentemente; una funzionalità che può salvarti la vita se elimini accidentalmente parti del documento e non puoi utilizzare il <strong> Disfare </strong> pulsante per ripristinarli. </p> <p> Per utilizzare la funzione di cronologia delle versioni, fare clic su <strong> File </strong> dalla barra dei menu e selezionare <strong> Cronologia delle versioni </strong> dall&#39;elenco a discesa. Vedrai che puoi anche nominare una versione, quindi puoi usarla per tenere traccia delle continue modifiche nel documento, specialmente se altri utenti stanno apportando modifiche allo stesso documento. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Questa funzione è disponibile solo sul desktop. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Modalità di suggerimento e revisione </h2> <p> Sebbene sia fantastico collaborare con altri e modificare un documento insieme, può essere difficile (e disordinato) tenere traccia delle modifiche apportate da ciascuna persona. </p> <p> La funzione di suggerimento ti consente semplicemente di suggerire modifiche se non vuoi alterare del tutto il documento. I tuoi suggerimenti verranno visualizzati nell&#39;editor come commenti nella barra laterale e l&#39;editor può apportare modifiche istantanee accettando il suggerimento. Puoi anche portare avanti discussioni di conversazione con <strong> rispondere </strong> , così puoi dare e ricevere feedback direttamente sulla pagina del documento senza dover inviare e-mail avanti e indietro. </p> <p> Per suggerire modifiche, fai clic sull&#39;icona a forma di matita per Modalità di modifica nell&#39;angolo in alto a destra del documento aperto, quindi seleziona <strong> suggerendo </strong> . </p> <p> Per visualizzare il documento senza i suggerimenti, fare clic su <strong> Visualizzazione </strong> . Sarai in grado di leggere senza barrature e commenti a comparsa. </p> <p> Per risparmiare tempo, puoi accettare o rifiutare tutti i suggerimenti contemporaneamente. Clic <strong> Utensili </strong> , quindi seleziona <strong> Rivedi le modifiche suggerite </strong> . Clic <strong> Accettare tutti </strong> o <strong> Rifiuta tutto </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Questa funzione è disponibile solo sul desktop. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Aggiungi caratteri </h2> <p> Se mai lo vuoi <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> stilizza il tuo testo </a> per adattarsi al tuo messaggio, puoi farlo anche con Google Docs. Oltre ai 24 caratteri predefiniti già programmati nello strumento Google Documenti, puoi aggiungere diversi fantastici caratteri a tua scelta per ampliare visivamente il tuo testo. </p> <p> Per aggiungere i caratteri, fai semplicemente clic su <strong> caratteri </strong> nella barra dei menu e seleziona <strong> Più caratteri </strong> . Seleziona tutti i caratteri che desideri dalla raccolta fornita. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Questa funzione è disponibile solo sul desktop. </p> <p> </p> <h2 id=\"compare-documents\"> 6. Confronta documenti </h2> <p> Questa è un&#39;altra funzionalità che puoi utilizzare per tenere traccia delle modifiche apportate a un documento da te o da un collaboratore. È particolarmente utile per documenti di grandi dimensioni e, come suggerisce il nome, è possibile confrontare due documenti per visualizzare le differenze tra loro. </p> <p> Per utilizzare questa funzione, apri il documento di base per il quale desideri effettuare un confronto, quindi fai clic su <strong> Utensili </strong> e seleziona <strong> Confronta documenti </strong> . </p> <p> Nella finestra di dialogo che si apre, seleziona il documento con cui vuoi confrontarlo dal tuo Drive e fai clic su <strong> Confrontare </strong> . Nel <strong> Attribuire le differenze a </strong> campo, inserire il nome del collaboratore che sarà l&#39;autore delle modifiche suggerite nel documento finale. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> Le differenze verranno mostrate allo stesso modo in cui lo fanno nel in <strong> suggerendo </strong> modalità di cui abbiamo discusso sopra e puoi anche accettare o rifiutare le modifiche. </p> <p> Questa funzione è disponibile solo sul desktop. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Trova e sostituisci </h2> <p> Se hai bisogno di sostituire più istanze di un errore all&#39;interno del tuo testo, Google Docs lo rende facile con la funzione Trova e sostituisci. </p> <p> Per gli utenti che hanno familiarità con la funzione Trova e sostituisci in Microsoft Word, funziona allo stesso modo. </p> <p> Per trovare una parola o una frase particolare nel documento, usa la scorciatoia <strong> Ctrl + F </strong> su un PC Windows o <strong> Comando + F </strong> su un Mac. Inserisci la parola nel campo &quot;Trova nel documento&quot;. </p> <p> Per sostituire il testo trovato, fai clic sui tre punti a destra e seleziona <strong> Trova e sostituisci </strong> . </p> <p> Quindi, inserisci il testo nel <strong> Trova </strong> campo e il testo sostitutivo nel <strong> Sostituirlo con </strong> campo. Scorri le istanze di testo con il cursore su e giù e fai clic su <strong> Sostituire </strong> per scambiarli singolarmente. Oppure fai clic su <strong> Sostituisci tutto </strong> per sostituire tutto il testo selezionato contemporaneamente. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Usa un dizionario </h2> <p> Per aiutarti a concentrarti ed evitare di dover passare da una scheda all&#39;altra quando stai cercando il significato di una parola, Google Documenti ha un dizionario in-app. </p> <p> Quando stai digitando e devi cercare una parola, evidenzia la parola, quindi fai clic con il pulsante destro del mouse e seleziona <strong> Definire </strong> dal menù. Lo strumento Dizionario cercherà la definizione della parola su Internet e apparirà sul lato destro dello schermo. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Aggiungi accenti linguistici </h2> <p> Dì addio alla memorizzazione delle scorciatoie da tastiera accentate o al copia/incolla di lettere accentate da altri documenti. </p> <p> Per usare le lettere accentate, dovresti scaricare <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> il componente aggiuntivo &quot;Accenti facili&quot; </a> . Ti consente di inserire accenti per 20 lingue diverse direttamente da una barra laterale nel tuo documento. </p> <p> Scarica il componente aggiuntivo di Google Doc aprendo il <strong> Utensili </strong> menu, quindi fare clic su <strong> Componenti aggiuntivi </strong> e <strong> Ottieni componenti aggiuntivi </strong> . Nella casella di Google Marketplace che si apre, cerca <strong> Accenti facili </strong> e fai clic sul pulsante blu di installazione per aggiungerlo alla tua raccolta di componenti aggiuntivi di Google Documenti. </p> <p> Dopo l&#39;installazione, fare clic su <strong> Componenti aggiuntivi </strong> menu per selezionare il componente aggiuntivo Easy Accents e iniziare ad aggiungere gli accenti corretti su tutte le parole straniere. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Questo componente aggiuntivo è disponibile solo su desktop, ma le tastiere mobili in genere supportano gli accenti della lingua, quindi sarai in grado di scrivere testo con segni di accento sul telefono senza il componente aggiuntivo. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Crea scorciatoie personalizzate </h2> <p> La maggior parte delle persone ha familiarità con <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Scorciatoie di Microsoft Word </a> , ma puoi anche creare le tue scorciatoie in Google Documenti. Per creare collegamenti personalizzati, fare clic su <strong> Strumenti &gt; Preferenze &gt; Sostituzione. </strong> Scoprirai che ci sono già alcune frazioni e scorciatoie di simboli, (come cambiare 3/4 in ¾), ma sentiti libero di aggiungerne alcune tue. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Questa funzione è disponibile solo sul desktop. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Fai di più con Google Documenti </h2> <p> Ora che hai appreso questi strumenti di Google Documenti, puoi utilizzarli durante la creazione del tuo prossimo documento. Spero che ti rendano le cose più facili! </p>"}