{"title":"5 cose che possono farti bandire definitivamente da Facebook","content":"<p> Facebook non è così noto come Twitter per la rimozione di account. Tuttavia, ci sono alcuni reati vietabili a cui Facebook risponde con più di una semplice etichetta di avvertimento. </p> <p> Qui, esploriamo i termini e le condizioni di Facebook e dove l&#39;azienda traccia il confine, guardando esempi storici di utenti che Facebook ha &quot;spiattaformato&quot; per il loro comportamento. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> La posizione di Facebook sui ban permanenti </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> A differenza di altri siti di social media, Facebook non elenca molti reati che comportano un divieto permanente. Invece, cita i reati recidivi piuttosto che la gravità dei reati come fattore primario. Di conseguenza, in teoria, qualsiasi violazione di Facebook ripetuta abbastanza spesso potrebbe comportare un blocco del profilo. </p> <p> Tuttavia, poche attività comportano un divieto completo e Facebook è sorprendentemente lassista con alcune attività illegali riconosciute. Ad esempio, la vendita di &quot;beni regolamentati&quot; come pistole e marijuana non è consentita sul Marketplace di Facebook, ma Facebook non lo elenca come reato vietabile. </p> <p> Facebook preferisce contrassegnare o rimuovere i contenuti post per post anziché rimuovere i profili. Tuttavia, ci sono eccezioni. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Uso improprio di strumenti e dati </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> I Termini di servizio di Facebook stabiliscono tre reati proibiti. La prima è una raccolta di azioni, che il resto di questo articolo esamina in modo più dettagliato. Il secondo e il terzo sono più specifici e hanno a che fare con l&#39;uso improprio degli strumenti e dei dati di Facebook. </p> <p> Questo termine di servizio comune vieta l&#39;accesso e l&#39;utilizzo di parti del sito che dovrebbero essere riservate agli sviluppatori. Vieta inoltre l&#39;utilizzo di strumenti del sito pubblico in modo deliberatamente dannoso, come l&#39;utilizzo di Facebook per diffondere virus e malware. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Minacce alla sicurezza pubblica </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Uno degli unici casi in cui Facebook afferma di disabilitare gli account è quello di &quot;rischio reale di danni fisici o minacce dirette alla sicurezza pubblica&quot;. Facebook rimuove anche i profili che &quot;proclamano una missione violenta o sono coinvolti nella violenza&quot;. </p> <p> Questa era la motivazione per vietare a tempo indeterminato l&#39;allora presidente Donald Trump dopo una rivolta al Campidoglio degli Stati Uniti nel gennaio 2021. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Associazione con gruppi violenti </h2> <p> Facebook ha preso posizione sui contenuti dannosi e minacciosi a livello associativo nell&#39;ottobre del 2020 quando ha rimosso i profili associati alla cospirazione QAnon anche se i singoli profili non avevano contenuti violenti. Il gruppo di cospirazione ha portato a episodi di violenza dal 2016. </p> <p> </p> <p> Facebook ha anche bandito il gruppo musicale Trapt per i post che fanno riferimento al gruppo di odio Proud Boys. L&#39;organizzazione politica estremista è coinvolta nella violenza di strada negli Stati Uniti e in Canada dal 2016. </p> <p> L&#39;azienda si riserva inoltre il diritto di disattivare gli account se tali account rappresentano un rischio legale per Facebook. Inoltre, Facebook è più irremovibile di altre piattaforme di social media nel lavorare con le forze dell&#39;ordine e le organizzazioni di sensibilizzazione quando incontra questo tipo di contenuto. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Compromettere la sicurezza di altri conti </h2> <p> Un altro dei rari reati vietabili negli elenchi di Facebook è &quot;compromettere la sicurezza di altri account e dei nostri servizi&quot;. La compromissione della sicurezza dei servizi di Facebook assomiglia molto al malware e all&#39;uso improprio menzionati nei termini di servizio. Tuttavia, l&#39;idea di compromettere la sicurezza di altri account punta verso il doxxing. </p> <p> </p> <p> Doxxing è il rilascio di informazioni sensibili del mondo reale di un utente di social media, inclusi potenzialmente il loro indirizzo di casa o di lavoro, numero di telefono privato o posizione fisica in tempo reale. Questa pratica viene spesso eseguita con l&#39;intento di causare danni a quella persona. </p> <p> </p> <h2 id=\"misinformation\"> 5. Disinformazione </h2> <p> </p> <p> Le linee guida ufficiali di Facebook affermano che Facebook non rimuove la disinformazione, scegliendo invece di etichettarla in modo che possa contribuire ai dialoghi senza fuorviare gli altri. Tuttavia, un certo numero di titolari di account sospesi afferma che la loro rimozione è il risultato di ciò che Facebook chiama &quot;False News&quot;. </p> <p> Ci sono una serie di ragioni per cui questo accade. In alcuni casi, Facebook determina che la notizia falsa è anche dannosa per la salute personale o pubblica. </p> <p> Questo era <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> La spiegazione di Facebook per la rimozione del teorico della cospirazione David Icke </a> per aver affermato, tra le altre cose, che Internet 5G causa Covid-19. Facebook ha anche affermato che Icke ha &quot;violato ripetutamente&quot; le politiche. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Norme di Facebook e il tuo account </h2> <p> Per la maggior parte, Facebook non ha problemi con te finché non usi impropriamente la piattaforma per causare danni ad altri. Tuttavia, ci sono alcuni problemi in cui l&#39;azienda traccia una linea nella sabbia. </p> <p> Se non sei in contrasto con questi termini di servizio, dovresti stare al sicuro da un divieto permanente di Facebook. </p>"}