{"title":"8 modi in cui i social media possono aiutarti a imparare una nuova lingua","content":"<p> Hai ancora gli incubi dei libri di testo spagnoli e delle lezioni di francese poco insegnate che hai ricevuto a scuola? Non aver paura. Grazie a Internet, imparare una nuova lingua in questi giorni può essere divertente e accessibile. </p> <p> I social media, in particolare, hanno contribuito a connettere milioni di studenti di lingue in tutto il mondo. Sia che tu stia imparando qualcosa di popolare come il tedesco o più oscuro come il faroese, troverai una vasta gamma di risorse per aiutarti nel tuo viaggio. </p> <p> Ecco alcuni modi in cui puoi utilizzare i social media per imparare la tua prossima lingua straniera. </p> <h2 id=\"join-facebook-groups\"> 1. Unisciti ai gruppi di Facebook </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> Su Facebook troverai gruppi per quasi tutte le lingue immaginabili. Troverai comunità di espatriati appena trasferiti che stanno cercando di migliorare le competenze, nonché gruppi per studenti di tutto il mondo. Per ottenere il massimo dalla tua esperienza, dovresti unirti a entrambi. </p> <p> Per trovare i gruppi Facebook giusti, puoi fare una semplice ricerca online. In alternativa, puoi trovare quello che stai cercando da Facebook. Per farlo, vai su Gruppi e cerca la tua lingua. Riceverai quindi un elenco di comunità che soddisfano queste esigenze. </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> Se studi in una scuola di lingue locale, puoi anche creare il tuo gruppo per entrare in contatto con i tuoi compagni di classe. Per farlo, <strong> Vai su Gruppi &gt; Crea nuovo gruppo </strong> . Puoi quindi modificare le impostazioni e iniziare a invitare i membri. </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2. Usa Reddit </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit è un popolare forum online che è una miniera d&#39;oro per gli studenti di lingue. Troverai subreddit sia per lingue specifiche che per l&#39;apprendimento generale delle lingue. </p> <p> Quando ti unisci a un subreddit, scoprirai molti consigli e suggerimenti utili da altri studenti che hanno seguito il tuo percorso. Troverai anche molti meme a cui senza dubbio ti riferirai. </p> <p> Per trovare un subreddit, vai alla barra di ricerca in alto e digita la tua lingua. Dopo che i risultati sono stati caricati, vale la pena unirsi a gruppi specifici per l&#39;apprendimento ea quelli culturali per saperne di più sulle usanze locali. </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. Connettiti con madrelingua </h2> <p> Il modo migliore per imparare una lingua velocemente è parlare con persone che già la parlano. E i social media possono essere un ottimo posto per trovare questi oratori. Potrebbe essere necessario contattare alcune persone, ma alla fine troverai qualcuno disposto a dedicare del tempo per aiutarti. </p> <p> Quando ti colleghi con madrelingua sui social media, concentrati prima sulla costruzione di un&#39;amicizia. Se sei nella loro stessa città, offriti di incontrarli e paga un caffè. Per quelli più lontani, offriti di aiutarli a imparare una delle lingue che già parli. </p> <p> I passaggi per questi sono simili su ogni piattaforma di social media. Su Instagram o Twitter, seguili e invia un messaggio (se le loro impostazioni sulla privacy lo consentono). Puoi adottare un approccio simile su Facebook, anche se alcune persone potrebbero essere meno disposte ad accettare richieste di amicizia da parte di persone che non conoscono. </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. Crea i tuoi contenuti sui social media </h2> <p> Non hai solo bisogno di consumare sui social media per aiutarti a imparare una lingua. Prova anche a creare i tuoi post. In questo modo non solo ti aiuterà a esercitarti nel parlare e nello scrivere; potresti anche scoprire nuovi utenti con cui esercitarti. </p> <p> Hai molte opzioni quando si tratta di creare contenuti. Su Twitter, puoi partecipare alle conversazioni o scrivere alcuni dei tuoi tweet nella lingua di destinazione. Con Instagram puoi scrivere didascalie, creare grafici e registrarti mentre parli. </p> <p> Quando crei i tuoi contenuti sui social media, riceverai anche feedback da madrelingua. Oltre a ciò, puoi anche far crescere il tuo portfolio e apprendere alcune nuove abilità utili. </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. Imposta le tue app sulla lingua che stai imparando </h2> <p> Modificare le impostazioni del telefono è un modo semplice per iniziare a pensare nella lingua di destinazione e a leggerla comodamente. Aggiungerai anche dozzine di nuove parole al tuo vocabolario. </p> <p> </p> <p> Tutti i grandi social network hanno impostazioni in-app in cui puoi cambiare la tua lingua. Su Instagram, ad esempio, vai su <strong> Account &gt; Lingua </strong> . Vedrai quindi un menu a discesa di tutte le lingue che puoi utilizzare. </p> <p> <strong class=\"gallery__section-title\"> Galleria di immagini (2 immagini) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> Espandere <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> <p> Puoi anche modificare tutte le lingue delle tue app contemporaneamente utilizzando le impostazioni del telefono. Vai a <strong> impostazioni </strong> &gt; <strong> Generale &gt; Lingua e regione </strong> . Da lì, vedrai un elenco di tutte le lingue disponibili. Tieni presente che per le lingue più piccole potresti non essere in grado di ottimizzare il tuo account. </p> <p> <strong class=\"gallery__section-title\"> Galleria di immagini (2 immagini) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> Espandere <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. Ottieni il massimo dagli hashtag </h2> <p> L&#39;utilizzo e la ricerca con gli hashtag è un modo efficace per trovare più utenti nella lingua che stai imparando. Usando una varietà, puoi connetterti e consumare il contenuto sia di madrelingua che di altri studenti. </p> <p> Per trovare il tipo di contenuto che stai cercando, pensa a cosa utilizzeranno gli altri studenti. Puoi anche trovare contenuti di madrelingua cercando argomenti esistenti in un determinato paese. Spesso, puoi trovarli su post e articoli di tendenza. </p> <p> Per cercare gli hashtag, usa la funzione di ricerca su qualsiasi app di social media che stai utilizzando. Puoi anche fare clic sui post che li utilizzano e trovare i risultati tutti disposti. </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. Segui gli account nella tua lingua di destinazione </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> Ogni account interessante che segui in inglese probabilmente ha anche un equivalente nella tua lingua di destinazione. Potrebbero essere pubblicazioni massicce o potrebbero essere oratori di tutti i giorni che sono più a loro agio nel creare lavoro nella loro lingua madre. </p> <p> </p> <p> Dovresti anche vedere se le tue riviste, squadre sportive e artisti musicali preferiti hanno account nella lingua di destinazione. Molti dei più grandi club sportivi del mondo, ad esempio, hanno account in inglese, spagnolo e altro. </p> <p> Quando si seguono account nella lingua che si desidera imparare, una buona regola pratica è quella di seguirli solo se si trova il loro contenuto in lingua inglese altrettanto interessante. Altrimenti, finirai per ignorarli e smettere di seguirli di nuovo in seguito. </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. Segui le app per l&#39;apprendimento delle lingue sui social media </h2> <p> <strong class=\"gallery__section-title\"> Galleria di immagini (2 immagini) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> Espandere <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> <p> Le app per l&#39;apprendimento delle lingue hanno spesso anche profili sui social media attivi. Questi sono ottimi per raccogliere suggerimenti generali e relativi alle lotte comuni che tutti devono affrontare, sia che stiano imparando il norvegese o il giapponese. </p> <p> Alcuni account che vale la pena seguire sono Babbel, Busuu e Duolingo. </p> <p> Tuttavia, non è necessario utilizzare queste app solo per il consumo. Sentiti libero di aggiungere i tuoi pensieri nei commenti. Potresti anche fare nuove amicizie, anche se stanno imparando una lingua completamente diversa dalla tua. </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> Rendi divertente l&#39;apprendimento di una lingua con i social media </h2> <p> Così il gioco è fatto. Ora hai più di un&#39;idea di utilizzare i social media per rendere divertente il tuo viaggio di apprendimento della lingua. Sebbene il lavoro sui libri di testo sia ancora importante, non dovrebbe essere la tua unica opzione. </p> <p> Anche se non puoi ottimizzare l&#39;app per la tua lingua di destinazione, troverai comunque molti madrelingua e altri studenti con cui entrare in contatto. </p> <p> La chiave per imparare una lingua con i social media è coinvolgere e consumare. Quando lo farai, troverai la tua esperienza più appagante e imparerai parole che i libri di testo non ti hanno mai insegnato. </p>"}