{"title":"Apple risolve un bug del programma di installazione di macOS Big Sur che potrebbe causare la perdita di dati","content":"<p> Apple ha corretto un bug critico nel programma di installazione di macOS Big Sur che generava un messaggio di errore quando si tentava di aggiornare un Mac senza lo spazio di archiviazione richiesto disponibile. </p> <p> Un aggiornamento macOS Big Sur 11.2.1 rivisto, ora disponibile nel <a href=\"https://apps.apple.com/app/macos-big-sur/id1526878132?mt=12\" target=\"_blank\" rel=\"nofollow noopener\"> Mac App Store </a> , verifica correttamente se hai spazio libero sufficiente prima dell&#39;inizio dell&#39;installazione, ha detto il signor Macintosh on <a href=\"https://twitter.com/ClassicII_MrMac/status/1361428354306633728\" target=\"_blank\" rel=\"nofollow noopener\"> Twitter </a> . </p> <p> macOS Big Sur richiede 35 gigabyte di spazio di archiviazione gratuito sul disco di avvio del computer, escluso il programma di installazione da 13 gigabyte stesso. </p> <p> Ciò non sarebbe potuto accadere prima poiché una delle conseguenze del programma di installazione non funzionante è la potenziale perdita di dati. Per le persone che non hanno sviluppato l&#39;abitudine di fare regolarmente <a href=\"https://www.makeuseof.com/how-to-back-up-mac/\" target=\"_blank\" rel=\"nofollow noopener\"> eseguire il backup del proprio Mac con Time Machine </a> , questo bug piuttosto elementare potrebbe avere conseguenze terribili. </p> <h2 id=\"how-to-install-the-new-update\"> Come installare il nuovo aggiornamento </h2> <p> Il nuovo aggiornamento è disponibile tramite <strong> Preferenze di Sistema &gt; Aggiornamento Software </strong> sul tuo Mac. Se sono disponibili aggiornamenti, premendo il pulsante &quot;Aggiorna ora&quot; verranno installati. Potrebbe esserti chiesto di inserire la password di amministratore. </p> <p> Non vedrai l&#39;aggiornamento se la versione rivista di macOS Big Sur 11.2.1 è già installata sul tuo computer. Il programma di installazione rivisto ha il numero di build &quot;20D75&quot;. Per vedere il numero di build del software macOS Big Sur installato sul tuo Mac, fai clic sul menu Apple e scegli l&#39;opzione denominata &quot;Informazioni su questo Mac&quot;. </p> <p> </p> <p> Con la finestra Informazioni su questo Mac aperta, fai clic sulla scheda &quot;Panoramica&quot;. Vedrai il nome del software del sistema operativo macOS sul tuo computer, seguito dal suo numero di versione. Per rivelare anche il numero di build, fai semplicemente clic sul numero di versione. </p> <p> Puoi vedere quale versione di macOS è l&#39;ultima in un documento di supporto su <a href=\"https://support.apple.com/HT201260\" target=\"_blank\" rel=\"nofollow noopener\"> Sito web di Apple Apple </a> . </p> <p> </p> <h2 id=\"big-sur-s-broken-free-space-check\"> Controllo dello spazio libero rotto di Big Sur </h2> <p> Il problema è venuto alla luce di recente grazie a Mr. Macintosh, che originariamente ha segnalato il problema. La pubblicazione ha scoperto che l&#39;aggiornamento di Big Sur si scaricava senza intoppi ma si rifiutava di avviarsi perché &quot;Si è verificato un errore durante la preparazione dell&#39;aggiornamento software&quot;. </p> <p> Il problema è stato attribuito a un errore nel controllo dello spazio libero di Big Sur. Il signor Macintosh afferma che le persone si sono lamentate di questo da quando è uscita la prima versione pubblica di macOS Big Sur nel novembre 2020. Dopo che la pubblicazione ha avvisato Apple del problema, la società si è mossa rapidamente per eliminare il brutto bug. </p> <p> </p> <p> &quot;L&#39;aggiornamento inizierà anche se ti rimane solo l&#39;1% di spazio libero e avrà esito negativo&quot; <a href=\"https://mrmacintosh.com/big-sur-upgrade-not-enough-hd-space-serious-issue-possible-data-loss/\" target=\"_blank\" rel=\"nofollow noopener\"> il post </a> spiega. E con l&#39;unità di avvio piena quasi al 100%, il programma di installazione rimarrebbe bloccato in un ciclo di avvio infinito nel tentativo di completare la procedura di installazione. </p> <p> &quot;Questo ti rende incapace di accedere ai tuoi dati&quot;, ha avvertito il signor Macintosh. </p> <p> L&#39;unico modo per risolverlo richiedeva la cancellazione e la reinstallazione del software macOS. Ma con l&#39;aggiornamento rivisto ora disponibile nel Mac App Store, i proprietari di Mac possono svolgere la loro vita quotidiana senza preoccuparsi se l&#39;aggiornamento a Big Sur potrebbe cancellare il disco di avvio. </p>"}