{"title":"BitPay porta Bitcoin su Apple Pay","content":"<p> Gli utenti BitPay negli Stati Uniti possono ora aggiungere le loro carte bitcoin prepagate all&#39;app Wallet di Apple e <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> usalo per pagare le cose con Apple Pay </a> . I clienti non Apple presto potranno aggiungere le proprie carte BitPay a marchio MasterCard a Google Pay e Samsung Pay. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> Come aggiungere la tua carta BitPay al portafoglio Apple </h2> <p> Per aggiungere la tua carta BitPay a un dispositivo Apple, apri l&#39;app Wallet sul tuo iPhone e tocca &quot;+&quot; nell&#39;angolo in alto a destra, quindi segui le istruzioni sullo schermo per completare l&#39;aggiunta della carta. </p> <p> Con il tuo BitPay nell&#39;app Wallet, puoi aggiungere la carta a Apple Pay andando su <strong> Impostazioni &gt; Portafoglio e Apple Pay </strong> , quindi tocca l&#39;opzione &quot;Aggiungi carta&quot;. Per diventare un utente BitPay e ordinare la tua carta prepagata, scarica l&#39;app BitPay Wallet dal <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> App Store </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Un nuovo modo di spendere con Apple Pay </h2> <p> Un post sul <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog BitPay </a> afferma che aggiungere una carta BitPay ad Apple Pay è un modo conveniente per spendere criptovalute in più posti rispetto a prima. &quot;Abbiamo migliaia di clienti dell&#39;app BitPay Wallet che utilizzano la carta BitPay e sono sempre alla ricerca di nuovi posti e modi per spendere le loro criptovalute&quot;, ha affermato Stephen Pair, CEO di BitPay <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> comunicato stampa </a> . </p> <p> </p> <p> Con Apple Pay, i titolari di carte BitPay possono effettuare acquisti contactless sicuri nei negozi fisici, nelle app che supportano Apple Pay e sul web. La società osserva che i clienti in attesa della consegna di una carta di plastica possono aggiungere la sua controparte virtuale ad Apple Wallet tramite l&#39;app ufficiale BitPay Wallet. In questo modo potrai iniziare a spendere immediatamente. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> Che cos&#39;è la carta BitPay? </h2> <p> Una carta prepagata che utilizza la rete Mastercard, la carta BitPay consente di effettuare facilmente sia pagamenti contactless che pagamenti tramite PIN, nonché prelevare contanti da qualsiasi bancomat compatibile. Con l&#39;app, i clienti possono fare cose come visualizzare il proprio saldo, richiedere un nuovo PIN, ricaricare istantaneamente e convertire la criptovaluta in valuta fiat (che viene quindi caricata sulla carta, pronta per essere spesa ovunque l&#39;addebito Mastercard sia accettato a livello globale). </p> <blockquote> <p> Per gli utenti esperti di blockchain, l&#39;app BitPay Wallet supporta una serie di opzioni per acquistare e archiviare criptovalute ed effettuare pagamenti online. Gli utenti possono acquistare istantaneamente buoni regalo da centinaia dei migliori rivenditori in negozio e online. </p> </blockquote> <p> La carta ha un chip EMV e può essere bloccata in caso di emergenza con l&#39;app. </p> <p> Secondo la società, il supporto per Google Pay e Samsung Pay è previsto per &quot;più tardi questo trimestre&quot;. Per quanto riguarda l&#39;app BitPay, attualmente supporta Bitcoin, Bitcoin Cash ed Ether, oltre a quattro stablecoin ancorate al dollaro, USDC, GUSD, PAX e BUSD. </p>"}