{"title":"Canon lancia un&#39;app di eliminazione delle foto che trova i tuoi scatti migliori","content":"<p> Dietro quasi ogni foto perfetta c&#39;è un rullino fotografico pieno di altre foto che sembrano quasi esattamente uguali. Non è raro che i fotografi tengano quasi sempre premuto il pulsante di scatto, per paura di perdere un momento fugace. </p> <p> Esaminare dozzine o forse anche centinaia di foto per scegliere le tue preferite e liberare spazio di archiviazione può essere un processo lungo e fastidioso. Per fortuna, Canon ha rilasciato una nuova app che lo fa automaticamente per te. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> Scatta facilmente un rotolo di foto fino ai migliori pochi Fe </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon USA </a> ha lanciato un&#39;app per l&#39;abbattimento di foto sul <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> App Store </a> che ti consente di trovare rapidamente e facilmente le tue foto migliori. L&#39;app stessa è gratuita, ma per utilizzarla dovrai sottoscrivere un abbonamento per $ 14,99/anno o $ 2,99/mese. Entrambe le opzioni di abbonamento hanno una prova di tre giorni. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> Il vicepresidente esecutivo di Canon USA Tatsuro &quot;Tony&quot; Kano, spiega: </p> <blockquote> <p> Nel mondo in continua evoluzione e travolgente di oggi, dove migliaia di foto vengono catturate e archiviate nello smartphone di una persona, i consumatori hanno bisogno di uno strumento fotografico esperto, affidabile e intuitivo che li aiuti a decidere le foto migliori sulla base di anni di conoscenza e tecnologia affidabili. </p> </blockquote> <p> L&#39;app di Canon, chiamata semplicemente Photo Culling, opera su un&#39;intelligenza artificiale chiamata Photography Intelligence Learning o PHIL in breve. PHIL suggerisce quali foto dovresti conservare e quali eliminare in base a quale delle due opzioni di selezione delle foto selezioni. </p> <p> La prima opzione, <strong> Abbattimento intero </strong> , è ottimo per <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> una migliore fotografia di ritratto </a> . Quando questa opzione è selezionata, PHIL determinerà le tue foto migliori assegnandole un punteggio in base a quattro fattori: nitidezza, rumore, emozioni e se gli occhi del soggetto sono chiusi (se applicabile). </p> <p> Nel frattempo, il <strong> Abbattimento simile </strong> L&#39;opzione sceglie i tuoi scatti migliori confrontando i punteggi tra foto simili. Ad esempio, supponiamo che tu abbia scattato un gruppo di foto delle nuvole e poi un gruppo di foto di alcuni fiori. L&#39;app separerebbe le foto della nuvola e le foto dei fiori in gruppi separati. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Qualunque sia l&#39;opzione di eliminazione che scegli, se il punteggio di una foto è superiore al punteggio obiettivo che hai impostato, la foto viene considerata un custode. PHIL suggerirà quindi di eliminare le foto rimanenti che non hanno ottenuto un punteggio abbastanza alto. Nel caso in cui tu non sia d&#39;accordo con PHIL, non preoccuparti. Hai ancora il controllo totale su tutti i tuoi scatti. </p> <p> </p> <p> Altre funzionalità dell&#39;app includono il conteggio delle foto e le informazioni sulla visualizzazione dello spazio di archiviazione, gli album fotografici, le impostazioni dei parametri per i punteggi delle foto e l&#39;opzione per utilizzare la modalità oscura. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> Scaricherai l&#39;app Photo Culling di Canon? </h2> <p> Sembrerebbe che l&#39;app per l&#39;eliminazione delle foto di Canon abbia tutto ciò di cui avresti bisogno per rendere meno noioso il processo di scelta delle tue foto migliori. Tuttavia, alla fine della giornata, sta a te decidere se odi abbastanza l&#39;abbattimento di foto da giustificare il pagamento di qualcosa che potresti fare da solo (anche se probabilmente molto lentamente e annoiato a morte). </p> <p> Al momento in cui scrivo, l&#39;app non è disponibile per Android, ma forse Canon l&#39;ha in programma per il futuro. </p>"}