{"title":"Come trasformare la tua PS5 da verticale a orizzontale (o viceversa)","content":"<p> La PlayStation 5 funziona in una configurazione verticale o orizzontale. Se cambi idea sul tuo orientamento preferito, è abbastanza facile spostare la tua PS5 da verticale a orizzontale (o viceversa). </p> <p> Diamo un&#39;occhiata a come spostare in sicurezza la tua PS5 da un orientamento verticale a orizzontalmente su un lato e viceversa. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> Primo: spegni e scollega la tua PS5 </h2> <p> Prima di eseguire qualsiasi operazione spostando fisicamente la tua PlayStation 5, è importante spegnerla e scollegare tutto. Ciò eviterà danni al sistema che potrebbero verificarsi se lo sposti mentre è acceso. </p> <p> Dovresti spegnere completamente la tua PS5. Per fare ciò, premere il tasto <strong> Pulsante PS </strong> sul controller per visualizzare il menu rapido nella parte inferiore dello schermo. Selezionare <strong> Energia </strong> a destra e scegli <strong> Spegni PS5 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Attendi finché le luci della console non si spengono, quindi scollega il cavo di alimentazione, il cavo HDMI e qualsiasi altra cosa tu abbia collegato al sistema. Ora sei pronto per cambiare l&#39;orientamento della tua PS5. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Rimuovere la vite del supporto </h2> <p> Quando hai installato la tua PS5 in verticale, dovevi estrarre una vite inclusa da uno scomparto nella base e usarla per fissare la base alla console quando si trova in verticale. Di conseguenza, rimuovere questa vite è il primo passo per cambiare l&#39;orientamento della console. </p> <p> Capovolgi delicatamente la tua PS5 su un lato in modo da poter accedere al supporto sul fondo. Utilizzare un cacciavite a testa piatta, una moneta o un oggetto simile per rimuovere la singola vite argentata che tiene la base al sistema. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Una volta che la vite è allentata, la base verrà liberata. C&#39;è un piccolo scomparto nella base dove puoi riporre la vite. Inseriscilo in posizione lì, quindi fallo scorrere nel piccolo foro per tenerlo fissato. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> Anche in questo scomparto troverai un piccolo tappo nero (a patto che lo metti lì durante la configurazione iniziale). Rimuovi questo tappo e usalo per tappare il foro sul fondo della PS5 dove hai appena estratto la vite. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Ruota la base </h2> <p> Ora, ti consigliamo di ruotare la base in modo che si adatti alla console nel suo orientamento orizzontale. Questo chiude anche il piccolo vano dove avete posizionato la vite, fissandola ulteriormente. </p> <p> Dovresti ruotare la base guardandola dall&#39;alto (di fronte a dove hai appena riposto la vite). Se tratti la parte rialzata del supporto come &quot;nord&quot;, dovrai ruotare la parte esterna del supporto verso &quot;nordovest&quot;, come mostrato di seguito. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Questo è l&#39;orientamento corretto per l&#39;utilizzo del supporto in orizzontale. Farà clic e si fermerà delicatamente quando lo avrai nel punto giusto. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Fissare il supporto in posizione orizzontale </h2> <p> Ora puoi collegare il supporto alla tua PS5 mentre è seduto orizzontalmente. Assicurati che il sistema sia posizionato correttamente: il logo PS dovrebbe essere rivolto verso l&#39;alto. </p> <p> Sul retro del tuo sistema, sotto e vicino alle due porte USB, vedrai alcuni simboli del controller PlayStation impressi sulla console. Fai scivolare i bracci esterni della base (che hai appena ruotato) sul sistema attorno al punto in cui questo motivo termina su ciascun lato. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Spingi le clip per fissarle, ma tieni presente che in questa posizione il supporto non è completamente bloccato in posizione (come avviene con la vite quando è posizionato verticalmente). Sii gentile quando metti giù il sistema e tieni presente che il supporto potrebbe scivolare se lo tiri. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Ora sei pronto per usare la tua PS5 con orientamento orizzontale. Ricollega tutti i cavi e avvialo per tornare a giocare. Se hai la PS5 standard, inserirai i dischi a faccia in su con questo orientamento. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> Come cambiare la tua PS5 da orizzontale a verticale </h2> <p> Vuoi tornare a un orientamento verticale per la tua PS5, o forse hai inizialmente impostato la tua PS5 in forma orizzontale e vuoi andare in verticale ora? Ad ogni modo, è facile seguire il processo sopra in ordine inverso. Assicurati di spegnere e scollegare prima la tua PS5, se è attualmente accesa o in modalità di riposo. </p> <p> </p> <p> Per passare a un orientamento verticale, solleva prima la tua PS5 ed estrai delicatamente il supporto dal sistema per rimuoverlo. Successivamente, dovresti ruotare il braccio esterno della base. Guardandolo dall&#39;alto, il braccio dovrebbe essere &quot;nord&quot;, in linea con la parte rialzata. Assicurati di sentire il leggero clic, così saprai che è nel posto giusto. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> Posiziona la tua PS5 in modo da poter accedere al fondo, quindi rimuovi il tappo nero dal foro al centro: si trova all&#39;incirca nel mezzo delle prese d&#39;aria. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Posiziona questo tappo nero all&#39;interno del piccolo foro nello scomparto sul lato inferiore della base. Il fermo dovrebbe scattare al suo posto. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> Quindi, rimuovere la vite dallo stesso vano nella base. Ora dovrai fissare il supporto nella posizione corretta. Per fare ciò, alza la tua PS5 in modo che il retro della console sia rivolto verso l&#39;alto, come mostrato di seguito. </p> <p> Prendi il supporto e posizionalo in modo che il foro per la vite sia allineato con il foro per la vite da cui hai appena rimosso il tappo. Posiziona le clip sul braccio della base sul retro del sistema sotto il connettore di alimentazione. Il supporto dovrebbe allinearsi facilmente. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Ora, usa un cacciavite o qualcosa di simile per stringere la vite. Una volta che hai finito e il supporto si sente saldamente fissato, sei pronto per usare la tua PS5 in verticale. Ricollegare tutti i cavi per completare il lavoro. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> Dovresti posizionare la tua PS5 in verticale o in orizzontale? </h2> <p> Sony supporta l&#39;utilizzo della tua PS5 sia in verticale che in orizzontale, quindi non esiste un modo giusto o sbagliato per farlo, purché il tuo sistema abbia un flusso d&#39;aria sufficiente. Quale orientamento dovresti usare dipende dalle tue esigenze. </p> <p> </p> <p> Se hai molto spazio e non ti dispiace che la PS5 occupi molto spazio orizzontale, l&#39;aspetto orizzontale è elegante. Per quelli con il modello standard PS5, rende anche un po&#39; più semplice il processo di inserimento dei dischi, poiché l&#39;etichetta dovrebbe sempre essere rivolta verso l&#39;alto. Questo è un po&#39; più difficile da ricordare con l&#39;orientamento verticale, dove l&#39;etichetta del disco dovrebbe essere rivolta a sinistra. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> Tuttavia, potresti non avere spazio all&#39;interno del tuo sistema di intrattenimento per ospitare la configurazione orizzontale. In questi casi, andare in verticale è la soluzione migliore. La PS5 è un&#39;enorme console in entrambi i casi, ma se posizionata verticalmente, si adatta perfettamente al tuo supporto TV o simili. Questa è la configurazione che uso, come mostrato nell&#39;immagine qui sotto. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> Qualunque sia l&#39;orientamento che scegli per la tua PS5, assicurati di utilizzare il supporto. Mantiene il sistema sollevato da terra, migliorando il flusso d&#39;aria. Il supporto protegge anche la PS5, rendendo più difficile rovesciarla e potenzialmente danneggiarla. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> Configura la tua PS5 e inizia a giocare </h2> <p> Ora sai come cambiare la tua PS5 da verticale a orizzontale e viceversa in pochi minuti. Una volta che il tuo sistema è configurato, accendilo e goditi alcuni dei migliori titoli della PS5. </p> <p> Non dimenticare che quasi tutta la libreria di PS4 funziona anche su PS5, offrendoti molto di più per divertirti. </p> <p> <small> Credito immagine: Alex Van Aken/ <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}