{"title":"Come eseguire un avvio pulito in Windows 10","content":"<p> Probabilmente hai una moltitudine di applicazioni di terze parti installate sul tuo computer Windows. Non preoccuparti, la maggior parte delle persone lo fa. </p> <p> Dall&#39;esecuzione di attività di base come la navigazione sul Web alla distribuzione di complesse righe di codice, le persone preferiscono utilizzare applicazioni alternative da quelle integrate in Windows. Sebbene queste applicazioni ci semplifichino la vita, a volte interferiscono con le funzioni del sistema. Questi possono variare da piccoli incidenti a errori critici e BSOD. </p> <p> È qui che entra in gioco l&#39;avvio pulito. </p> <h2 id=\"what-is-a-windows-clean-boot-anyway\"> Che cos&#39;è un avvio pulito di Windows, comunque? </h2> <p> Un avvio pulito di Windows 10 consente agli utenti di escludere applicazioni di terze parti come causa di un errore. Viene eseguito semplicemente avviando il dispositivo con tutte le applicazioni di terze parti disabilitate. E anche se il nome sembra essere una funzionalità Windows integrata, non lo è. Devi pulire manualmente l&#39;avvio del computer. </p> <p> I vantaggi di un avvio pulito non si limitano solo alla diagnosi degli errori. È noto per aiutare quando <a href=\"https://www.makeuseof.com/tag/fix-windows-update-error-0x80070057/\" target=\"_blank\" rel=\"nofollow noopener\"> Gli aggiornamenti di Windows non si installano correttamente </a> . È anche particolarmente utile quando il tuo sistema operativo è lento e vuoi verificare quale potrebbe essere la causa del problema. </p> <p> </p> <p> </p> <h2 id=\"how-to-clean-boot-and-fix-errors\"> Come pulire l&#39;avvio e correggere gli errori </h2> <p> L&#39;avvio pulito è un processo relativamente semplice una volta che gli utenti lo hanno provato alcune volte. </p> <p> Prima di elencare i passaggi, gli utenti devono sapere che alcune azioni richiedono privilegi di amministratore. Il tuo computer potrebbe anche non funzionare nel modo in cui sei abituato, ma non è necessario sudare. Ciò accade perché a volte gli utenti non sono nemmeno consapevoli che alcune attività umili vengono svolte da software di terze parti. </p> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-128.png\" loading=\"lazy\"> </p> <p> Ecco i passaggi su come pulire l&#39;avvio di Windows 10: </p> <ol> <li> Nella barra di ricerca del menu Start, digita <strong> sysconfig </strong> e clicca su <strong> Configurazione di sistema </strong> . </li> <li> Nel <strong> Configurazione di sistema </strong> finestra, vai alla <strong> Servizi </strong> scheda. </li> <li> Controlla il <strong> Nascondi tutti i servizi Microsoft </strong> scatola. </li> <li> Controlla tutti i servizi nell&#39;elenco e clicca su <strong> Disabilitare tutto </strong> situato in basso a destra, quindi salva ed esci. </li> <li> Ora apri il <strong> Task Manager </strong> . Puoi farlo facendo clic con il pulsante destro del mouse sulla barra delle applicazioni e selezionando <strong> Task Manager </strong> o usando <strong> Ctrl + Alt + Canc </strong> . </li> <li> Nel <strong> Task Manager </strong> finestra, vai a <strong> Avviare </strong> scheda. </li> <li> Seleziona uno per uno tutti i servizi e clicca <strong> disattivare </strong> . </li> <li> Uscita <strong> Task Manager </strong> e <strong> Ricomincia </strong> il tuo computer. </li> </ol> <p> <img alt=\"Startup tab in the task manager\" src=\"images/startup-tab-task-manager-383.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"fixing-errors-with-clean-boot\"> Correzione degli errori con l&#39;avvio pulito </h2> <p> Dopo aver seguito i passaggi sopra elencati, il tuo <a href=\"https://www.makeuseof.com/tag/clean-computer-original-state-reinstalling-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Il PC si avvierà in uno stato pulito. </a> La prima cosa che gli utenti dovrebbero fare è aspettare e controllare se lo stesso errore si ripresenta. A volte, l&#39;origine dell&#39;errore potrebbe essere un file di sistema di Windows, nel qual caso apparirà l&#39;errore, ma potrebbe richiedere più tempo rispetto a un normale avvio. </p> <p> Se l&#39;errore non compare, allora è il momento di restringere i sospetti. Questo è un compito un po&#39; noioso ma, sfortunatamente, anche il modo migliore per farlo. Per restringere l&#39;elenco, procedi come segue: </p> <ol> <li> Mentre sei in uno stato di avvio pulito, apri <strong> Configurazione di sistema </strong> . </li> <li> Sotto il <strong> Servizi </strong> scheda, selezionare la metà superiore dell&#39;elenco e fare clic su <strong> Abilitare </strong> . Assicurati che il <strong> Nascondi tutti i servizi Microsoft </strong> casella è selezionata. </li> <li> Ora aperto <strong> Task Manager </strong> e vai al <strong> Avviare </strong> scheda. </li> <li> Allo stesso modo, abilita la metà superiore dei servizi e riavvia il computer. </li> </ol> <p> Dopo il riavvio, se l&#39;errore non viene visualizzato, è possibile escludere il software ei servizi selezionati dall&#39;elenco dei colpevoli. Dovrai ripetere questi passaggi fino a trovare il programma o il servizio responsabile e disinstallarlo. </p> <p> </p> <h2 id=\"clean-boot-windows-10-to-isolate-errors\"> Avvio pulito di Windows 10 per isolare gli errori </h2> <p> Ora è il momento di riavviare Windows 10 come standard. Basta aprire <strong> Configurazione di sistema </strong> e <strong> Task Manager </strong> e abilitare tutti i servizi e i programmi. Si consiglia agli utenti di eseguire un avvio pulito prima di ricorrere a correzioni più avanzate quando Windows si arresta in modo anomalo o visualizza un BSOD. </p>"}