{"title":"Come risolvere il codice di arresto BSOD &quot;SYSTEM THREAD EXCEPTION NOT HANDLED&quot; in Windows 10","content":"<p> L&#39;&quot;ECCEZIONE THREAD DI SISTEMA NON GESTITA&quot; è un errore comune di Windows 10 che si verifica principalmente a causa di un driver obsoleto o incompatibile. </p> <p> Ciò che lo rende più complicato da risolvere rispetto ad altri BSOD è che più driver possono causare il problema e talvolta il tuo computer potrebbe non rilevarli tutti. Ecco perché il primo passo che gli utenti dovrebbero fare quando affrontano questo errore è trovare il driver esatto che sta causando il problema. </p> <p> Ecco come correggere l&#39;errore di eccezione del thread di sistema non gestito su Windows 10. </p> <h2 id=\"boot-into-safe-mode\"> 1. Avvia in modalità provvisoria </h2> <p> Il primo passo che gli utenti dovrebbero compiere prima di tentare di risolvere questo problema è avviare il computer in modalità provvisoria. A seconda delle tue preferenze e se sei in grado di avviare il computer nella schermata di accesso, ci sono diversi modi per farlo: </p> <h3 id=\"boot-into-safe-mode-via-settings\"> Avvia in modalità provvisoria tramite Impostazioni </h3> <ol> <li> Clicca sul <strong> Inizio </strong> pulsante, quindi selezionare <strong> impostazioni </strong> . </li> <li> Navigare verso <strong> Aggiornamento e sicurezza </strong> quindi fare clic su <strong> Recupero </strong> . </li> <li> Sotto <strong> Avvio avanzato, </strong> clicca su <strong> Riavvia ora. </strong> </li> <li> Quando il PC si riavvia il <strong> Scegliere un&#39;opzione </strong> dovrebbe apparire la schermata. </li> <li> Da qui vai a <strong> Risoluzione dei problemi &gt; Opzioni avanzate &gt; Impostazioni di avvio </strong> . Quindi fare clic su <strong> Ricomincia </strong> </li> <li> Quando il PC si riavvia, premere <strong> F5 </strong> per avviare il computer in <strong> Modalità provvisoria con rete </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> Dalla schermata di accesso </h3> <ol> <li> Tieni semplicemente premuto <strong> Cambio </strong> e seleziona il <strong> Energia </strong> pulsante seguito da <strong> Ricomincia </strong> . </li> <li> Segui i passaggi 4, 5 e 6 della sezione precedente. </li> </ol> <h3 id=\"from-a-blank-screen\"> Da uno schermo vuoto </h3> <ol> <li> Se non riesci a raggiungere la schermata di accesso, segui questi passaggi. </li> <li> Tieni premuto il pulsante di accensione del dispositivo per 10 secondi per spegnerlo. </li> <li> Premi nuovamente il pulsante di accensione per avviarlo. </li> <li> Non appena il PC si avvia, ad esempio, viene visualizzato il logo del produttore, premere nuovamente il pulsante di accensione per 10 secondi. </li> <li> Premi il pulsante di accensione per avviare il dispositivo. </li> <li> Se fatto correttamente, il tuo computer si avvierà nel <strong> Ambiente di ripristino di Windows </strong> . </li> <li> Segui i passaggi 4, 5 e 6 della prima sezione. </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. Trovare quale conducente è responsabile </h2> <p> Poiché è molto probabile che l&#39;errore sia causato da un driver malfunzionante, puoi utilizzare il registro di Windows per scoprire quale. </p> <p> Per farlo è sufficiente seguire questi passaggi: </p> <ol> <li> stampa <strong> Tasto Windows + R </strong> e nel <strong> Correre </strong> finestra di dialogo, digitare <strong> eventovwr. </strong> </li> <li> Vai a <strong> Registri di Windows </strong> menu ed espandilo, quindi seleziona <strong> Sistema. </strong> </li> <li> Cerca un registro chiamato <strong> system_thread_exception_not_handled </strong> e fai clic su di esso per scoprire quale driver sta causando il problema. </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> Di solito, il driver associato sarà un driver di visualizzazione o un driver di rete poiché questi sono noti per causare questo BSOD. Se il file associato sembra essere <strong> nvlddmkm.sys </strong> , puoi dare un&#39;occhiata a <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> alcuni semplici modi per risolverlo. </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. Annulla o aggiorna i driver Driver </h2> <p> A seconda del driver responsabile dell&#39;errore di eccezione del thread di sistema non gestito, potrebbe essere necessario aggiornare o reinstallare i driver associati. </p> <p> Se il driver non è stato aggiornato per molto tempo, l&#39;aggiornamento del driver molto probabilmente risolverà il problema. Se il driver è stato aggiornato di recente, potrebbe essere meglio eseguire il rollback del driver o reinstallare gli aggiornamenti. </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> Come aggiornare i driver su Windows 10 </h3> <ol> <li> stampa <strong> Tasto Windows + R </strong> e digita <strong> devmgmt.msc </strong> per aprire il <strong> Gestore dispositivi </strong> . </li> <li> Passare al dispositivo associato ed espandere il menu. Ad esempio, se l&#39;errore fosse causato da un driver video, dovresti espandere il <strong> Adattatori per display </strong> opzione. </li> <li> Fare clic con il pulsante destro del mouse sul driver e fare clic su <strong> Aggiorna driver </strong> . </li> <li> Nella finestra di dialogo che si apre, fare clic su <strong> Cerca automaticamente il software del driver aggiornato </strong> . </li> <li> Windows cercherà automaticamente sul Web i driver più recenti e li installerà. </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> Come ripristinare i driver su Windows 10 </h3> <ol> <li> Aperto <strong> Gestore dispositivi </strong> e vai al conducente in questione. </li> <li> Espandi il menu e fai clic con il pulsante destro del mouse sul driver. </li> <li> Clicca su <strong> Proprietà </strong> . </li> <li> Sotto il <strong> autista </strong> scheda, fare clic su <strong> Ripristina driver </strong> . </li> <li> Windows eseguirà automaticamente il rollback all&#39;ultima versione disponibile del driver. </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. Rinominare il file difettoso </h2> <p> Dopo aver recuperato il nome del file associato all&#39;errore di eccezione del thread di sistema non gestito, gli utenti devono rinominare il file. In questo modo Windows creerà una nuova copia e la reinstallerà. I file del driver si trovano in <strong> C:\\Windows\\System32\\drivers </strong> </p> <p> Segui questi passaggi per rinominare il file: </p> <ol> <li> Aperto <strong> Esplora file </strong> e vai a <strong> C:\\Windows\\System32\\drivers </strong> </li> <li> Cerca il conducente interessato </li> <li> Fare clic su di esso e premere <strong> F2. </strong> </li> <li> Sostituisci l&#39;estensione del nome del file con <strong> .vecchio </strong> . </li> <li> Premi Invio e riavvia il computer. </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. Usa SFC e DISM per riparare i file di sistema </h2> <p> SFC e DISM sono due potenti strumenti a disposizione di ogni utente Windows. In combinazione, possono trovare e correggere quasi tutti gli errori relativi al sistema. Sono anche abbastanza semplici da eseguire. </p> <p> </p> <p> Assicurati di creare un punto di ripristino del sistema poiché questi comandi alterano i file di sistema. </p> <h3 id=\"how-to-use-dism\"> Come usare DISM </h3> <ol> <li> Correre <strong> Prompt dei comandi </strong> come amministratore </li> <li> Nella console, digita <strong> DISM /Online /Pulizia-Immagine /ScanHealth </strong> e premi Invio. </li> <li> Attendi che Windows termini la scansione. Quindi digita <strong> DISM /Online /Cleanup-image /RestoreHealth </strong> </li> <li> Windows riparerà tutti i problemi rilevati durante la scansione. </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> Come usare SFC </h3> <ol> <li> Nella barra di ricerca del menu Start, digita <strong> cmd </strong> quindi fare clic con il tasto destro su <strong> Prompt dei comandi </strong> ed eseguilo come amministratore. </li> <li> Nella console, inserisci <strong> sfc /scannow </strong> </li> <li> Sii paziente poiché Windows impiegherà tempo per eseguire la scansione e sostituire i file di sistema corrotti. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. Usa Ripristino configurazione di sistema per ripristinare il tuo PC </h2> <p> Se il problema rimane ancora irrisolto, dovrai utilizzare Ripristino configurazione di sistema come ultima risorsa. Ripristino configurazione di sistema è una funzionalità che ripristina Windows a uno stato precedente. Questi punti di ripristino vengono creati periodicamente e durante l&#39;installazione di nuovo software. In alternativa, puoi impostare <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows per creare un punto di ripristino ogni giorno </a> </p> <h3 id=\"how-to-use-system-restore\"> Come utilizzare Ripristino configurazione di sistema </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> Nella barra di ricerca del menu Start, digita <strong> Pannello di controllo </strong> e fai clic su aprilo. </li> <li> Nella barra di ricerca del Pannello di controllo, inserisci <strong> Recupero </strong> e aprilo dai risultati. </li> <li> Clicca su <strong> Apri Ripristino configurazione di sistema </strong> . </li> <li> Clicca su <strong> Il prossimo </strong> e selezionare un punto di ripristino dall&#39;elenco. </li> <li> Clicca su <strong> Finire. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> Eccezione gestita </h2> <p> I suggerimenti sopra elencati forniscono una soluzione semplice per il fastidio causato da BSOD come system_thread_exception_not_handled. La parte migliore è che la maggior parte dei suggerimenti può essere utilizzata per diagnosticare molti altri errori comuni di Blue Screen of Death (BSOD) anche in Windows. </p>"}