{"title":"Come accedere alle statistiche di gioco di PS4 e PS5 per il 2020","content":"<p> Sony ha lanciato il PlayStation Wrap-Up, che ti consente di riflettere sul tuo viaggio su PlayStation nell&#39;ultimo anno. </p> <p> Ti spiegheremo come accedere a questa esperienza e ti renderemo consapevole dei pochi requisiti. </p> <h2 id=\"what-is-playstation-wrap-up\"> Che cos&#39;è PlayStation Wrap-Up? </h2> <p> Come abbiamo riportato, <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation Wrap-Up è il riassunto del tuo ultimo anno di gioco </a> . </p> <p> È una pagina personalizzata che descrive in dettaglio le tue abitudini di gioco su PS4 e PS5, inclusi quanti giochi hai giocato, quanto tempo hai trascorso a giocarci e quanti trofei hai guadagnato lungo il percorso. </p> <p> Puoi anche ottenere un tema dinamico gratuito con forme PlayStation. Confusamente, questo è disponibile solo per PS4 e non per la PS5 appena rilasciata. </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> Come accedere a PlayStation Wrap-Up </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> Per visualizzare il tuo rapporto, vai su <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> Sito Web PlayStation Wrap-Up </a> . Dovrai accedere al tuo account Sony, se non lo sei già. Una volta che sei sulla pagina, puoi scorrere verso il basso per visualizzare le tue statistiche e riscattare il tema PS4. </p> <p> L&#39;esperienza di riepilogo sarà disponibile solo fino al 2 marzo 2021. Pertanto, non tardare a partecipare. </p> <p> Ci sono condizioni che devi soddisfare per utilizzare PlayStation Wrap-Up: </p> <ul> <li> Avere un account PSN registrato nella tua regione. </li> <li> Avere almeno 18 anni. </li> <li> Aver giocato per almeno 10 ore su una console PS4 tra il 1° gennaio 2020 e il 31 dicembre 2020. </li> </ul> <p> Inoltre, gli utenti in Europa, Medio Oriente, Africa, Australia, India e Russia devono aver abilitato la raccolta di <strong> Dati aggiuntivi </strong> . Puoi abilitarlo su PS4 tramite <strong> impostazioni </strong> &gt; <strong> Dati del dispositivo/Salute e sicurezza </strong> &gt; <strong> Dati del dispositivo </strong> . </p> <p> Infine, puoi ricevere un&#39;e-mail contenente il riepilogo di PlayStation. Tuttavia, devi aver scelto di ricevere e-mail di marketing, cosa che puoi fare tramite il <strong> Impostazioni delle notifiche </strong> nel tuo account PSN. </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> Ci sarà un riassunto del 2021? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> Questo è il secondo anno consecutivo che Sony esegue l&#39;esperienza Wrap-Up. Dal momento che analizza solo i dati del 2020, si concentra più su PS4. </p> <p> Speriamo che Sony lo faccia di nuovo l&#39;anno prossimo, quando la PS5 sarà fuori più a lungo e avrà rilasciato più giochi. </p>"}