{"title":"Come creare il tuo gioco da tavolo nel simulatore da tavolo","content":"<p> Hai mai pensato di creare un gioco per giocare con i tuoi amici su Tabletop Simulator (TTS)? O forse sei uno sviluppatore di giochi da tavolo che desidera creare prototipi di giochi e testarli online. </p> <p> Non c&#39;è mai stato un momento migliore per sfruttare l&#39;ambiente di gioco versatile di TTS. Oggi ti insegneremo come fare proprio questo. </p> <h2 id=\"what-is-tabletop-simulator\"> Che cos&#39;è il simulatore da tavolo? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Per chi non lo sapesse, Tabletop Simulator (TTS) fornisce un ambiente 3D per giocare a giochi da tavolo, sia in locale che online. È diventato un ottimo modo per <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> gioca ai giochi da tavolo online con gli amici </a> . </p> <p> I giochi giocabili su TTS includono di tutto, da poker, dama, Dungeons &amp; Dragons, mini-golf e persino gli ultimi giochi da tavolo. Qualsiasi gioco a cui vuoi giocare è in genere disponibile come DLC o nel workshop della community. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> Perché usare il simulatore da tavolo? </h2> <p> Se hai mai provato a creare un gioco da tavolo fisico, sai quanto può richiedere molto tempo, non solo per costruire elementi di gioco, ma anche per modificarli o sostituirli quando decidi di modificare o rivedere il gioco. </p> <p> In TTS, tutto, dal colore al peso di un oggetto, è modificabile con un clic del mouse, rendendo il processo di revisione fluido e indolore. </p> <p> Inoltre, è facile trasmettere in streaming il tuo gameplay e mostrarlo sui social media e sulle piattaforme di streaming. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> Cosa ti serve per iniziare Get </h2> <p> Prima di iniziare, avrai bisogno di quanto segue: </p> <ul> <li> Un account utente Steam </li> <li> Simulatore da tavolo installato sul tuo PC </li> <li> Immagini JPG della tua tavola e dei disegni delle carte </li> </ul> <p> <strong> Scarica: </strong> Simulatore da tavolo attivato <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> Vapore </a> ($19,99) </p> <p> La progettazione di elementi di gioco viene eseguita al meglio illustrando il software o scansionando immagini di carte fisiche che hai già realizzato. Assicurati solo che abbiano estensioni JPG e che vengano salvati individualmente. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Creazione di tabelloni e tappetini per i giocatori </h2> <p> Quando progetti le tue schede e altri oggetti 2D, assicurati che la risoluzione sia sufficientemente alta da poterla dimensionare correttamente senza perdere qualità. TTS lo ridimensionerà automaticamente quando lo importi e sarai in grado di ridimensionarlo esattamente come preferisci. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Creazione di carte </h2> <p> Le carte in TTS hanno tre aspetti: la faccia della carta, il dorso della carta e la carta nascosta (come apparirà la carta agli altri nella mano di un giocatore). Avrai bisogno di avere disegni per ognuno di questi, anche se hai la possibilità di rendere semplicemente la carta nascosta sul retro della carta. </p> <h3 id=\"create-and-arrange-card-faces\"> Crea e disponi le facce delle carte </h3> <p> Invece di importare ogni carta una per una, è meglio importare tutte o la maggior parte delle tue carte come un unico mazzo. </p> <p> Per creare un mazzo, copia e incolla ogni disegno su un foglio di carta 7x10. L&#39;utilizzo di un modello come quello riportato di seguito ti aiuterà a iniziare. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> Il modello delinea gli slot per ogni carta nel tuo mazzo, permettendoti di importare fino a 69 carte alla volta. Se non ne hai bisogno, puoi lasciare gli slot inutilizzati e, se ne hai di più, puoi combinare i mazzi o duplicare le carte dopo l&#39;importazione. </p> <p> Tuttavia, non è necessario utilizzare questo modello. Un foglio di carta, infatti, può essere di qualsiasi dimensione e TTS lo dividerà automaticamente in una griglia 7x10. </p> <p> Per tua comodità, il modello di cui sopra e un modello di scheda quadrata sono disponibili nella directory dei file locali TTS. </p> <p> Se non sei sicuro di dove siano i tuoi file locali, puoi trovarli attraverso la tua libreria di Steam aprendo il <strong> Proprietà </strong> menu per TTS. Seleziona il <strong> File locali </strong> scheda e fare clic su <strong> Navigare </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Dorsi delle carte </h3> <p> Se vuoi un solo disegno per il retro dell&#39;intero mazzo, allora tutto ciò di cui hai bisogno è una singola immagine JPG del disegno; non sarà necessario alcun foglio di carta. </p> <p> Se il tuo mazzo avrà più dorsi unici, dovrai creare un foglio aggiuntivo con i disegni del dorso corrispondenti ai disegni delle facce nel tuo primo foglio. Per il design del viso nello slot uno, posiziona il retro designato nello slot uno del tuo foglio posteriore. Per la faccia due, posiziona la sua parte posteriore nello slot due e così via. </p> <h3 id=\"hidden-cards\"> Carte Nascoste </h3> <p> Nello slot 70 del foglio delle carte, etichettato &quot;Carta nascosta agli altri giocatori&quot; sul modello, posiziona qualsiasi disegno che desideri sia visibile agli avversari quando le carte in questo mazzo sono in mano a un giocatore. Questo è tradizionalmente nero o bianco solido o presenta il design del retro del mazzo. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Importazione di elementi </h2> <p> Ora che hai creato le tue schede e i tuoi mazzi, sei pronto per iniziare l&#39;importazione. </p> <p> Prima di ospitare effettivamente un server con il tuo gioco, è utile avviare una partita per giocatore singolo e importare gli elementi in anticipo. Puoi quindi salvare la configurazione ed essere pronto per iniziare immediatamente quando arrivano i giocatori. </p> <p> Avvia TTS e fai clic su <strong> Creare </strong> , quindi selezionare <strong> Giocatore singolo </strong> per creare l&#39;ambiente. Elimina tutti gli elementi generati da TTS e seleziona il tavolo su cui vuoi giocare. </p> <p> Con l&#39;ambiente pronto, fai clic su <strong> oggetti </strong> nel menu in alto, quindi selezionare il pulsante <strong> personalizzato </strong> categoria. </p> <h3 id=\"boards-and-player-mats\"> Tabelloni e tappetini per giocatori </h3> <p> Selezionare <strong> Tavola </strong> dal <strong> personalizzato </strong> menu e fai clic in un punto qualsiasi della tabella in cui desideri che appaia il tabellone. Fare clic con il pulsante destro del mouse in un punto qualsiasi per aprire la finestra di dialogo di importazione della scheda. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Sfoglia la tua immagine della scheda e TTS ti chiederà se desideri caricarla sul tuo account Steam Cloud o conservare un file locale. Carica i file sul cloud se prevedi di giocare al tuo gioco online o su un dispositivo diverso. </p> <p> Puoi facoltativamente caricare le tue immagini su un altro host, come Dropbox, Photobucket o Imgur, e incollare qui l&#39;URL. Tuttavia, gli host esterni sono meno affidabili e non sono consigliati. </p> <p> Quando lo carichi su Steam Cloud, TTS ti chiederà di dargli un nome file. Una volta terminato il caricamento, fare clic su <strong> Importare </strong> . </p> <p> Con la scheda importata, ora puoi rimpicciolirla o ingrandirla con il with <strong> - </strong> e <strong> + </strong> tasti sulla tastiera. Per bloccarlo in posizione in modo che non venga spostato accidentalmente durante il gioco, fai clic con il pulsante destro del mouse sulla scacchiera e sotto <strong> Attiva/disattiva </strong> , clicca <strong> Serratura </strong> . </p> <h3 id=\"card-decks\"> Mazzi di carte </h3> <p> Nel <strong> Oggetto personalizzato </strong> menu, fare clic su <strong> mazzo </strong> . Fare clic in un punto della tabella in cui si desidera visualizzare il mazzo, quindi fare clic con il pulsante destro del mouse per avviare l&#39;importazione. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Regolare le impostazioni come segue: </p> <ul> <li> <strong> Genere: </strong> Modificalo se hai in mente una forma specifica diversa da una normale carta rettangolare con angoli arrotondati. </li> <li> <strong> Viso: </strong> Clicca il <strong> Sfoglia file locali </strong> pulsante e trova il foglio del tuo biglietto da visita. Ancora una volta, consigliamo l&#39;opzione Steam Cloud su file locali o host esterni. </li> <li> <strong> Dorsi unici: </strong> Seleziona questa opzione se il tuo mazzo avrà più design sul retro, quindi carica il foglio della tua carta posteriore nel <strong> Indietro </strong> scatola. Se stai utilizzando un unico design per l&#39;intero mazzo, carica invece il tuo design per la schiena. </li> <li> <strong> Larghezza e altezza: </strong> Regola questo se hai usato un rapporto diverso rispetto alla carta rettangolare standard, 10x7. </li> <li> <strong> Numero: </strong> Assicurati che corrisponda al numero di carte che stai importando. </li> <li> <strong> lateralmente: </strong> Questo cambia l&#39;orientamento per il <strong> Zoom alternativo </strong> funzione in TTS. Lascialo deselezionato a meno che tu non voglia che la carta appaia lateralmente. </li> <li> <strong> Il retro è nascosto: </strong> Seleziona questo se vuoi che la vista nascosta delle tue carte sia semplicemente il retro delle carte. </li> </ul> <p> Quando le tue impostazioni sono corrette, fai clic su <strong> Importare </strong> . Il tuo mazzo apparirà sul tavolo e potrai iniziare a mescolare e distribuire. </p> <p> Se vuoi che le tue carte abbiano nomi per aiutare con l&#39;ordinamento, fai clic con il pulsante destro del mouse su una singola carta e fai clic su <strong> Nome </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Importazione di altri elementi di gioco </h2> <p> L&#39;importazione di altri oggetti 2D è simile al processo di importazione delle schede. Non dimenticare che TTS ha molti elementi di gioco comuni, come dadi e figurine, pronti per l&#39;uso nel <strong> oggetti </strong> menù. </p> <p> Se disponi di elementi 3D personalizzati che desideri utilizzare, segui <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> Guida di TTS all&#39;importazione di modelli 3D </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Salvare un gioco completo </h2> <p> Dopo aver disposto i componenti in uno stato di configurazione iniziale, fare clic su <strong> Giochi </strong> pulsante nel menu in alto. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Selezionare <strong> Salva e carica </strong> e fai clic su <strong> Salva il gioco </strong> pulsante. Dagli un nome e clicca <strong> Salva </strong> . Ora, ogni volta che ospiti i giochi, puoi ricaricarli nella configurazione perfetta accedendo al <strong> Salva e carica </strong> menù. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Sfruttare al meglio il gioco da tavolo personalizzato </h2> <p> Progettare e giocare a giochi personalizzati è semplice in Tabletop Simulator una volta che sai come farlo. Invita i tuoi amici o cerca playtester pronti e disponibili in <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> la comunità TTS </a> . Ora puoi mostrare agli altri il tuo gioco personalizzato! </p>"}