{"title":"Che cos&#39;è MTA-STS e come protegge le tue email?","content":"<p> L&#39;e-mail è il principale colpevole della maggior parte degli attacchi informatici. È un facile punto di accesso per malware, adware, spam e phishing e offre infinite opportunità agli autori delle minacce di ottenere le tue informazioni personali. </p> <p> Per mitigare queste minacce, dovrebbero essere messe in atto rigorose misure di sicurezza per gli account di posta elettronica sia individuali che aziendali. </p> <h2 id=\"email-security-and-encryption\"> Sicurezza e crittografia e-mail </h2> <p> Nonostante la popolarità di altre modalità di comunicazione, la messaggistica e-mail è ancora la più grande forma di dati in transito per qualsiasi individuo o organizzazione. Proteggere i contenuti della tua email è una necessità vitale. </p> <p> La sicurezza della posta elettronica comporta l&#39;ispezione e la crittografia di tutto il traffico di posta elettronica in entrata e in uscita. La crittografia svolge un ruolo fondamentale nel mantenere intatta la privacy dei contenuti delle e-mail garantendo connessioni SMTP (Simple Mail Transfer Protocol) sicure. </p> <p> Fino a poco tempo, la crittografia era solo un requisito facoltativo per SMTP. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> Come funziona la crittografia e-mail? </h2> <p> La crittografia dell&#39;email è un processo di aggiunta di un codice o di una parte di codice al contenuto del tuo messaggio rendendolo indecifrabile. Convertendo i dati delle e-mail in codice, i contenuti sono protetti dall&#39;esposizione non autorizzata. In poche parole, la tua email è criptata. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> Come ulteriore sicurezza, il processo di crittografia utilizza chiavi pubbliche e private in cui le chiavi crittografate vengono scambiate per bloccare e sbloccare le e-mail codificate. Il mittente crittografa l&#39;e-mail utilizzando la crittografia a chiave pubblica e, successivamente, il destinatario utilizza una chiave privata per decifrare il messaggio ricevuto. </p> <p> La crittografia viene applicata all&#39;intero percorso di un&#39;e-mail, dall&#39;inizio alla fine. Come best practice, tutte le email in entrata e in uscita dovrebbero essere crittografate, non solo quelle che contengono informazioni sensibili. Ciò impedisce agli autori delle minacce di ottenere qualsiasi punto di ingresso nel sistema. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> Antecedenti e problemi con SMTP </h2> <p> Quando è nato il protocollo SMTP nel 1982, la crittografia delle email non era una pratica comune e per impostazione predefinita le email venivano inviate e ricevute in formato testo. Per introdurre la sicurezza a livello di trasporto, alla fine degli anni &#39;90 è stato aggiunto il comando STARTTLS, che ha offerto l&#39;opzione di crittografia tramite il <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> Protocollo TLS (Transport Layer Security) </a> . </p> <p> Per quanto promettente possa sembrare l&#39;aggiornamento di TLS, ha lasciato intatte due scappatoie di sicurezza: </p> <ol> <li> L&#39;opzione di crittografia era proprio così: <strong> opzionale </strong> . Le email non sicure erano ancora dilaganti, causando un picco di attacchi informatici. </li> <li> Anche con STARTTLS attivo, non c&#39;era modo di autenticare l&#39;identità del server del mittente poiché i server SMTP non convalidano i certificati. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> L&#39;arrivo di MTA-STS </h2> <p> Nel 2019, Google ha finalmente preso la parola e ha annunciato l&#39;adozione del nuovo standard MTA-STS (Mail Transfer Agent/Strict Transport Security) ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> Ciò offre ai provider di servizi di posta la possibilità di imporre TLS per proteggere le connessioni SMTP e offre anche la possibilità di negare il recapito della posta agli host MX che non offrono TLS con un certificato server affidabile. </p> <p> MTA-STS si occupa infine di tutti i problemi precedenti con SMTP applicando la crittografia tra i server SMTP comunicanti. Ma come funziona effettivamente? Scopriamolo! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> Come funziona MTA-STS? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS entra in funzione ordinando a un server SMTP di comunicare con un altro server SMTP solo a due condizioni: </p> <ol> <li> Il server SMTP <strong> dovere </strong> essere crittografato. </li> <li> Il nome di dominio sul certificato del server corrisponde al dominio nel criterio e i certificati sono aggiornati. </li> </ol> <p> Utilizzando una combinazione di DNS e HTTPS per pubblicare una politica, MTA-STS informa il mittente su come procedere se non è possibile avviare un canale di comunicazione crittografato. </p> <p> È facile implementare MTA-STS da parte del destinatario, ma per il mittente un software server di posta di supporto come <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> dovrebbe essere usato. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> Che tipo di attacchi mitiga MTA-STS? </h2> <p> Le seguenti minacce vengono affrontate frontalmente se MTA-STS viene applicato alle comunicazioni e-mail: </p> <p> <strong> Attacchi Man-In-The-Middle (MITM): </strong> Questo attacco viene eseguito quando un utente malintenzionato intercede nel bel mezzo della comunicazione tra due parti per rubare o alterare i dati. Nel caso di un&#39;e-mail, ciò significherebbe in genere due server SMTP comunicanti. Utilizzando MTA-STS, questi attacchi possono essere facilmente prevenuti. </p> <p> <strong> Attacchi di downgrade: </strong> Un attore di minacce costringe un canale di rete a passare a una modalità di trasmissione dati non sicura. Ad esempio, questo attacco potrebbe reindirizzare un visitatore di un sito Web da una versione HTTPS di un sito a una versione HTTP. MTA-STS aiuta a combattere questi attacchi impedendo accessi non autorizzati. </p> <p> <strong> Attacchi di spoofing DNS: </strong> Questi astuti attacchi modificano i record DNS della destinazione prevista di un utente e lo inducono a credere che stia visitando un sito o un dominio legittimo. L&#39;implementazione di MTA-STS aiuta notevolmente a mitigare questi attacchi. </p> <p> </p> <p> Ora che abbiamo familiarità con MTA-STS, è il momento di toccare con mano un nuovo standard di reporting per SMTP noto come reporting TLS. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> Che cos&#39;è il Report TLS SMTP (TLS-RPT)? </h2> <p> Proprio come MTA-STS, TLS-RPT è uno standard di reporting che rileva problemi di connettività e discrepanze tra le applicazioni di invio. Una volta abilitato, invia rapporti giornalieri su eventuali problemi di connessione riscontrati da server esterni durante l&#39;invio di email. </p> <p> Consideralo come uno strumento di risoluzione dei problemi in cui i rapporti possono essere utilizzati per valutare e valutare potenziali problemi e problemi di configurazione. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> Che tipo di problemi risolve TLS-RPT? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Report diagnostici: </strong> I rapporti TLS offrono rapporti diagnostici in formato file JSON contenenti dettagli completi su eventuali e-mail in entrata che presentano problemi di consegna. Rileva anche le e-mail che sono rimbalzate o non sono state consegnate a causa di un attacco di downgrade, ad esempio. </p> <p> <strong> Visibilità migliorata: </strong> Abilitando TLS-RPT, puoi migliorare la visibilità su tutti i tuoi canali di posta elettronica. Ciò ti consente di tenere d&#39;occhio tutti i dati che ti stanno arrivando, inclusi anche i messaggi non riusciti. </p> <p> <strong> Rapporti giornalieri: </strong> I referti diagnostici vengono inviati almeno una volta al giorno per coprire e osservare in modo approfondito le polizze MTA-STS. I report includono anche statistiche sul traffico e informazioni dettagliate su errori e consegne non riuscite. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Quando tutto il resto fallisce, prevale la crittografia </h2> <p> A causa della natura in continua evoluzione delle minacce informatiche, rigorose misure di sicurezza e crittografia sono indispensabili per la consegna sicura e protetta della posta elettronica. </p> <p> Grazie ai vari provider di posta elettronica che offrono potenti funzionalità di crittografia e agli standard MTA-STS, i trasferimenti di posta completamente sicuri non sono più una realtà inverosimile. </p>"}