{"title":"Come usare il tempo per camminare con Apple Fitness+","content":"<p> Apple Fitness+ offre un&#39;ampia varietà di allenamenti video diversi che sfruttano la potenza di Apple Watch per fornire un ottimo modo per mettersi in forma. Ma la funzione Time to Walk del servizio è leggermente diversa. </p> <p> Invece di stare davanti a uno schermo, questa funzione ti incoraggia a fare una passeggiata e ascoltare storie mentre guardi foto significative di star influenti e uniche. Di seguito evidenzieremo ulteriori informazioni sulla funzione e su ciò di cui hai bisogno per iniziare. </p> <h2 id=\"what-is-time-to-walk\"> Qual è il momento di camminare? </h2> <p> <img alt=\"Draymond Green Time to walk\" src=\"images/draymond-green-time-to-walk-1-269.jpg\" loading=\"lazy\"> </p> <p> Pensa a Time to Walk come a un&#39;esperienza unica simile a un podcast con celebrità e altri nomi influenti. Alcuni degli episodi includono la leggenda della musica country Dolly Parton, la star della NBA Draymond Green, il musicista Sean Mendes e il vincitore del premio Emmy Uzo Aduba. </p> <p> Negli episodi da 25 a 40 minuti, l&#39;ospite parlerà dei suoi momenti personali e che plasmano la vita. Sullo schermo del tuo Apple Watch puoi anche vedere foto che aiutano a raccontare la storia. Alla fine della storia, ascolterai una playlist di brani significativi selezionati dall&#39;ospite. </p> <p> </p> <p> </p> <h2 id=\"getting-started-with-time-to-walk\"> Iniziare con il tempo per camminare </h2> <p> Devi avere un abbonamento a Apple Fitness+ per accedere a Time to Walk. Hai anche bisogno di un Apple Watch Series 3 o successivo e di cuffie Bluetooth, come gli AirPods di Apple. </p> <p> La grande notizia è che non devi fare nulla per scaricare un episodio di Time to Walk. Finché l&#39;Apple Watch è in carica e connesso al Wi-Fi, gli ultimi cinque episodi verranno scaricati automaticamente sull&#39;orologio. </p> <p> Solo per notare, la quantità di spazio di archiviazione gratuito sull&#39;orologio potrebbe influire sul numero di episodi disponibili. Dopo aver ascoltato un episodio, l&#39;orologio lo elimina automaticamente. Quindi, un nuovo episodio prenderà il suo posto. </p> <p> Puoi anche scaricare un episodio specifico di Time to Walk utilizzando un iPhone. Vai al <strong> Fitness </strong> app e seleziona <strong> Fitness+ </strong> scheda. Nel <strong> È ora di camminare </strong> sezione, scegli <strong> Mostra tutto </strong> . Puoi vedere tutti gli episodi disponibili qui. </p> <p> Tocca un episodio per visualizzare ulteriori informazioni su cosa aspettarti e sui brani della playlist. In quella pagina, usa il <strong> Inserisci </strong> per scaricare l&#39;episodio sull&#39;orologio. Se l&#39;episodio è già stato scaricato sul tuo orologio, dirà <strong> Scaricato </strong> e mostra un segno di spunta. </p> <p> <strong class=\"gallery__section-title\"> Galleria di immagini (3 immagini) </strong> <img alt=\"Apple Activity App\" src=\"images/apple-activity-app-625.jpg\" loading=\"lazy\"> Espandere <img alt=\"Apple Fitness+ Time to Walk\" src=\"images/apple-fitness-time-to-walk-841.jpg\" loading=\"lazy\"> Espandere <img alt=\"Time to Walk Episode\" src=\"images/time-to-walk-episode-915.jpg\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> <p> Se disponi di un Apple Watch abilitato per il cellulare, non devi preoccuparti di dover scaricare un episodio poiché puoi comunque riprodurre gli episodi senza bisogno di un iPhone nelle vicinanze. </p> <p> </p> <p> Quando sei pronto per una passeggiata, apri l&#39;Apple Watch <strong> Allenarsi </strong> app. Clicca il <strong> È ora di camminare </strong> episodio per iniziare. Se viene rilevato un movimento utilizzando il GPS dell&#39;Apple Watch, l&#39;allenamento viene registrato come una passeggiata all&#39;aperto. In caso contrario, l&#39;allenamento conterà come una passeggiata indoor. </p> <p> <img alt=\"Apple Watch Time to Walk \" src=\"images/apple-watch-time-to-walk-217.jpg\" loading=\"lazy\"> </p> <p> Durante la passeggiata, scorri verso sinistra per bloccare lo schermo dell&#39;orologio, mettere in pausa l&#39;allenamento o terminarlo. Uno scorrimento verso destra farà apparire i controlli multimediali e ti consentirà di mettere in pausa l&#39;audio, saltare avanti o indietro nell&#39;episodio o spostarti tra i brani della playlist. </p> <p> Se desideri eliminare manualmente un episodio di Time to Walk, apri l&#39;app Allenamento sul tuo Apple Watch e tocca <strong> io </strong> accanto al nome della celebrità. Scorri verso il basso e poi scegli <strong> Rimuovere </strong> . </p> <p> </p> <h2 id=\"making-exercise-even-better-with-time-to-walk\"> Fare esercizio ancora meglio con il tempo per camminare </h2> <p> Camminare è uno dei modi più semplici e popolari per chiunque di ottenere una dose di esercizio necessaria. Time to Walk offre un modo unico per motivarti durante una passeggiata. </p> <p> E per assicurarti di avere abbastanza energia per una lunga passeggiata, segui i nostri suggerimenti per preservare la durata della batteria del tuo Apple Watch. </p>"}