{"title":"Come proteggere i tuoi dati personali dai datori di lavoro","content":"<p> La tecnologia di sorveglianza è dilagante dentro e fuori l&#39;ufficio. Molti datori di lavoro utilizzano prodotti di gestione mobile per dispositivi forniti dall&#39;azienda come telefoni, laptop e tablet. Questi contengono programmi progettati per proteggere le aziende da furti, spionaggio aziendale o intenti dannosi. </p> <p> Tuttavia, sebbene tutto questo sia ottimo per proteggere la tua azienda, non sono esattamente la cosa migliore per te. Non è più una questione di <strong> Se </strong> la tua azienda ti sta seguendo; il prossimo che devi chiedere è, quanti dati possono effettivamente trovare le aziende? Sorprendentemente, molto. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> Cosa possono vedere i datori di lavoro sul Wi-Fi aziendale e sui dispositivi remoti? </h2> <p> La maggior parte delle persone non si rende conto della misura in cui le aziende hanno accesso ai propri dati o quanto di essi firmano quando utilizzano i dispositivi aziendali. Ecco alcuni esempi. </p> <h3 id=\"location\"> Posizione </h3> <p> Molti dipendenti pensano che l&#39;utilizzo di una rete privata virtuale (VPN) sia sufficiente per far credere ai propri datori di lavoro di essere dove dovrebbero essere. </p> <p> Sebbene ci siano modi per nascondere la tua posizione reale su un dispositivo personale, non è del tutto infallibile, specialmente quando accedi a qualsiasi applicazione o sito Web con un indirizzo e-mail o un numero di cellulare rilasciato dall&#39;azienda. </p> <p> </p> <p> Può essere quasi impossibile nascondere la propria posizione reale quando si utilizzano dispositivi forniti dall&#39;azienda. Ad esempio, le società di telecomunicazioni possono rilevare quando ti sei collegato a uno dei loro partner in roaming. </p> <p> Inoltre, le VPN aziendali sono diverse dalle VPN commerciali con gateway monitorati da team IT interni. </p> <h3 id=\"notes-documents-and-emails\"> Note, documenti ed e-mail </h3> <p> Se pensi che nessuno sappia che hai utilizzato il Wi-Fi aziendale per trovare il tuo prossimo lavoro, ti sbagli. Anche se non utilizzi un indirizzo email aziendale, molte aziende hanno programmi preinstallati nei laptop aziendali che includono registri delle attività in tempo reale, aggiornamenti della cronologia di navigazione e screenshot programmati di documenti ed email aperti. </p> <p> Sulla base della protezione da possibili violazioni dei dati, molte aziende li utilizzano anche come meccanismi di segnalazione o tracker di produttività. </p> <p> </p> <h3 id=\"online-messaging-history\"> Cronologia dei messaggi online </h3> <p> Nonostante l&#39;aumento delle piattaforme crittografate, la realtà è che i tuoi messaggi non sono del tutto privati ​​sui dispositivi aziendali. Quando si utilizzano piattaforme di messaggistica, le aziende potrebbero non essere in grado di vedere i dettagli esatti dei tuoi scambi, ma probabilmente saranno comunque in grado di riconoscere i metadati come la dimensione e il tipo di file. </p> <p> Con questo, se decidi di inviare PDF di grandi dimensioni tramite un&#39;app come WhatsApp, il sistema di rilevamento delle intrusioni della tua azienda probabilmente ti segnalerà per comportamenti sospetti. In linea con le linee guida aziendali, potrebbero chiederti di dimostrare che le tue azioni non sono state dannose e potrebbero dover richiedere l&#39;approvazione della leadership per l&#39;autorizzazione. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> Come evitare di condividere i dati personali con il datore di lavoro </h2> <p> Non esiste un modo assoluto per mantenere le tue informazioni personali, conversazioni e attività completamente fuori portata in ogni momento. Tuttavia, esistono diversi modi per ridurre i rischi. </p> <p> Non approviamo nascondere i dati dai tuoi datori di lavoro; infatti, hanno il diritto di raccogliere informazioni sui propri dipendenti, pur essendo <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> in grado di rintracciarti legalmente </a> . Ma devi sapere quando è opportuno tenere le cose per te, e questo dipende dalle singole aziende. </p> <h3 id=\"read-company-policies\"> Leggi le politiche aziendali </h3> <p> Prima di poter discutere sulla trasparenza dei dati, devi anche comprendere il tipo di informazioni che stai dando consapevolmente al tuo datore di lavoro lavorando per loro. Solo quando sai cosa ci si aspetta puoi stabilire i confini professionali appropriati. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Cerca di comprendere le politiche e le procedure di raccolta dei dati aziendali prima che vengano raccolti. Da lì, puoi effettivamente fare un piano per rinunciare a fornire più informazioni del necessario. </p> <h3 id=\"use-personal-gadgets\"> Utilizza i gadget personali </h3> <p> Sebbene sia sempre allettante utilizzare i dispositivi aziendali per risparmiare denaro, la realtà è che nulla è mai veramente gratuito. Investi in laptop, telefoni cellulari e tablet per uso personale. </p> <p> Avere dispositivi personali separati è anche un ottimo modo per stabilire dei limiti, soprattutto quando si lavora da remoto. </p> <p> L&#39;utilizzo del tuo dispositivo ti dà la possibilità di stabilire e gestire le varie pratiche di sicurezza necessarie per proteggere i tuoi dati da occhi indiscreti. Può sembrare una spesa inutile, ma fa molto per preservare la tua tranquillità. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Usa i profili degli ospiti sui dispositivi personali </h3> <p> La connessione a qualsiasi rete che non sia la tua è sempre un rischio per la sicurezza, anche se si trova nei locali di lavoro. L&#39;accesso a una rete Wi-Fi aziendale consente al tuo datore di lavoro di accedere a tutto, dai metadati dei messaggi ai registri della cronologia di navigazione. </p> <p> Se hai assolutamente bisogno di utilizzare il tuo laptop personale sulle reti aziendali, puoi scegliere di utilizzare un profilo ospite per ridurre la quantità di dati a cui possono accedere da remoto. In alternativa, puoi connetterti con il piano dati del tuo cellulare personale o con un dispositivo Wi-Fi portatile. </p> <h3 id=\"keep-your-passwords-safe\"> Mantieni le tue password al sicuro </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Creare password complesse strong </a> non è abbastanza. Devi assicurarti che le tue password non vengano salvate sui dispositivi aziendali. Il salvataggio di password personali per conti bancari online, email personali o siti web del governo su gadget che non possiedi mette i tuoi dati a rischio immediato se il database della tua azienda viene compromesso. </p> <p> Usa solo il tuo cellulare o laptop personale per accedere a conti importanti, specialmente quelli in cui sono coinvolti soldi. Quando possibile, abilita l&#39;autenticazione a due fattori. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> Separa il tuo lavoro e la tua vita personale </h2> <p> I datori di lavoro hanno il diritto di accedere in remoto al dispositivo fornito dall&#39;azienda se sospettano che tu stia partecipando a qualsiasi forma di attività illegale, mettendo a rischio le informazioni aziendali o richiesto dalle forze dell&#39;ordine per indagini. </p> <p> Tuttavia, questo è diverso dai dispositivi personali. </p> <p> La tua sicurezza è forte quanto le persone con cui sei in contatto, compreso il tuo datore di lavoro. Tenere separati i tuoi dispositivi personali e di lavoro è solo un passo verso la decentralizzazione dei tuoi dati. Mettendo in pratica misure di sicurezza efficaci, puoi limitare il numero di punti di accesso di cui dispongono gli hacker a documenti, email e reti. </p> <p> La decentralizzazione dei dati personali è necessaria perché protegge te, come individuo, e la tua azienda da furti, frodi e altre forme di criminalità informatica. </p>"}