{"title":"Come vedere le tue statistiche di riproduzione su PS5","content":"<p> Se ti piace vedere quanto tempo hai passato a giocare, la PS5 ha una funzione nascosta ma utile per te. Tiene traccia di quanto tempo hai trascorso giocando sul sistema. </p> <p> Ecco come verificare quanto tempo hai trascorso giocando ai giochi per PlayStation 5. Che potrebbe incoraggiarti a <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> spegni la tua PS5 </a> più spesso. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> Come controllare le tue statistiche di gioco su PlayStation 5 </h2> <p> Nella schermata principale della tua PS5, seleziona l&#39;icona del tuo profilo in alto a destra. Puoi premere <strong> Triangolo </strong> per spostare rapidamente la selezione in quell&#39;area dello schermo. Dopo aver aperto quel menu, scegli <strong> Profilo </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Ora, passa a <strong> Giochi </strong> scheda. Qui vedrai tutti i giochi che hai giocato sul tuo account PlayStation. Ognuno mostra l&#39;ultima volta che hai giocato al gioco, così come le tue ore di gioco totali. Tuttavia, non è preciso al minuto. Vedrai il tempo di gioco arrotondato all&#39;ora. </p> <p> Qui vedrai anche il tempo di riproduzione dei tuoi titoli PS4, anche se non li hai giocati su PS5. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> Per quanto ne sappiamo, questo tempo di gioco include tutto il tempo in cui il gioco era in esecuzione, non solo quando stavi giocando attivamente. Ciò significa che se hai lasciato il gioco nel menu di pausa mentre rispondevi a una telefonata o mangiavi qualcosa, quel tempo sarà incluso nel totale. Quindi potrebbe non essere super accurato, ma almeno ti darà un&#39;idea di quanto tempo hai giocato a ciascun titolo. </p> <p> </p> <p> Se sei curioso, puoi anche vedere le statistiche di riproduzione dei tuoi amici. Seleziona il <strong> Amici </strong> dalla stessa schermata e scegli l&#39;amico di cui vuoi saperne di più. Questo ti mostrerà quanto tempo hanno trascorso nei loro giochi in un menu identico. </p> <p> Se non vuoi che le tue informazioni sul tempo di gioco siano visibili agli altri giocatori, scorri verso destra e scegli <strong> Impostazioni della privacy </strong> . In quel menu, sotto il <strong> La tua attività </strong> sezione, cambia l&#39;opzione per <strong> Chi può vedere la tua cronologia di gioco </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Alcuni giochi tengono traccia anche del proprio tempo di gioco </h2> <p> Se sei interessato a dati come questo, assicurati di aprire i tuoi giochi preferiti e vedere se tengono traccia di quanto tempo hai trascorso giocando. Un buon numero di titoli include il tempo di riproduzione totale sul file di salvataggio, all&#39;interno del menu di pausa o simili. </p> <p> Sebbene questo non sia coerente tra i giochi e possa o meno includere il tempo trascorso in pausa, può darti maggiori informazioni su un gioco di cui vuoi saperne di più. Alcuni giochi online, come Overwatch, tengono anche traccia del tempo trascorso con ciascun eroe nelle diverse modalità. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Guarda quanto giochi davvero </h2> <p> La PS5 rende facile vedere quanto tempo hai passato a giocare. È una caratteristica piccola ma molto apprezzata, dal momento che la PS4 non ha reso questi dati facilmente accessibili. </p> <p> Nel frattempo, ci sono più modi per gestire il tuo gioco anche al di fuori della console stessa. </p> <p> <small> Credito immagine: LightField Studios/ <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}