{"title":"Come installare un controller intelligente per la porta del garage?","content":"<p> Vuoi controllare la porta del tuo garage con il tuo smartphone o tablet? Un controller intelligente è un&#39;ottima opzione se hai già un apriporta del garage installato nella tua casa. </p> <p> Ti mostreremo come installare un controller intelligente per la porta del garage. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Differenze tra un apri e un controller </h2> <p> Ci sono due differenze principali tra un apriporta da garage intelligente e un controller. Il primo è la dimensione. </p> <p> La maggior parte degli apriporta sono grandi e si montano sul soffitto del garage. Usano un binario meccanico per aprire e chiudere la porta. Un controller per porta da garage, invece, è una piccola unità elettronica che consente di controllare l&#39;apriporta tramite un&#39;app su un dispositivo intelligente. </p> <p> La seconda distinzione tra questi due prodotti è il prezzo. Gli apriporta del garage possono costare circa $ 300. L&#39;installazione di questi apri di solito richiede l&#39;aiuto di un installatore professionista. </p> <p> Un controller, tuttavia, di solito non necessita di un&#39;installazione professionale. Invece, il controller funziona come un&#39;aggiunta al tuo apri esistente. </p> <p> Ciò significa che per una frazione del prezzo di un nuovo apriscatole, puoi ottenere la stessa funzionalità semplicemente utilizzando un controller. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> Quali sono i vantaggi di una porta da garage intelligente? </h2> <p> Ci sono tre vantaggi principali nell&#39;avere una porta da garage intelligente. </p> <ul> <li> <strong> Sicurezza </strong> —Una porta da garage intelligente ti consente di aprire e chiudere la porta praticamente da qualsiasi luogo. </li> <li> <strong> Sicurezza </strong> —La maggior parte degli apriporta e dei controller intelligenti ti avvisano quando il tuo garage è rimasto aperto per un determinato periodo di tempo. </li> <li> <strong> Convenienza </strong> —Se hai mai dovuto tornare a casa per chiudere la porta del garage, avere un&#39;app intelligente per la porta del garage fa risparmiare tempo. Invece di guidare a casa, tira fuori il telefono. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> Come installare un controller intelligente per la porta del garage? </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Se hai deciso che un controller intelligente per porta da garage è giusto per te, questa guida ti mostrerà come installarne uno. In questa dimostrazione, a <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meross MSG100 </a> viene utilizzato, ma questo processo è simile se si utilizza un&#39;altra marca. Consultare la documentazione del controller per i dettagli. </p> <h3 id=\"what-you-ll-need\"> Cosa ti servirà </h3> <ul> <li> Un controller intelligente per il garage </li> <li> Graffatrici o supporti a filo </li> <li> Porta del garage con apertura automatica installata </li> <li> Philips e cacciaviti a taglio </li> <li> Scala </li> </ul> <h3 id=\"plan-the-installation\"> 1. Pianifica l&#39;installazione </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Prima di installare il controller, dovrai esplorare alcuni punti nel tuo garage. Il primo è una fonte di alimentazione per il controller. Il secondo è il percorso del cavo dal controller al sensore montato sulla porta incluso nel kit. E il terzo è la posizione del sensore magnetico. </p> <p> Questo sensore magnetico consente al controller di sapere quando la porta è aperta o chiusa. </p> <p> La maggior parte dei controller utilizza un cavo lungo per connettersi al sensore della porta. Dovrai instradare questo filo attraverso il soffitto o lungo un muro per tenerlo lontano. </p> <p> Una volta pianificata l&#39;installazione, testare l&#39;adattamento del cavo del sensore dal controller alla posizione del sensore. Questo test garantisce che il cavo del sensore raggiunga il controller. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Spegnere l&#39;apriporta del garage </h3> <p> La maggior parte delle porte del garage è collegata all&#39;alimentazione da qualche parte nel soffitto. Per quegli apri, ti consigliamo di assicurarti che siano scollegati prima di procedere. </p> <p> Se il tuo apriscatole non ha una spina e invece è collegato al cablaggio che esce dal soffitto, allora dovrai trovare la scatola dell&#39;interruttore e togliere l&#39;alimentazione all&#39;apri. </p> <p> <strong> Nota: </strong> La corrente domestica da 120 volt può causare lesioni gravi. Se non ti senti a tuo agio con l&#39;elettricità, fermati ora e consulta un installatore e/o un elettricista professionista di porte da garage. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Collegare i cavi inclusi al controller </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> Sull&#39;unità Meross, c&#39;è una serie di fili blu e marroni che devono essere installati nel controller per connettersi all&#39;apriporta del garage. Apri il coperchio di plastica sul controller e dovresti vedere due terminali a vite. </p> <p> Utilizzando un piccolo cacciavite a taglio, allentare le viti su ciascun terminale. Inserisci i fili e stringi le viti. Non importa quale filo va dove. </p> <p> Dai uno strattone delicato ai fili per assicurarti che siano ben saldi. Quindi sostituire il coperchio del controller. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Montare il controller della porta del garage </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Dal momento che hai pianificato le tue posizioni, ora è il momento di montare il controller. Assicurati che il controller si trovi in ​​un luogo in cui possa accedere all&#39;alimentazione di cui ha bisogno senza stressare alcun cablaggio. </p> <p> Quindi, rimuovi il supporto adesivo sul controller e premilo in posizione. Se si dispone di un controller con montaggio a vite, utilizzare il cacciavite per fissare il controller in posizione. </p> <h3 id=\"mount-the-sensor\"> 5. Montare il sensore </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> Successivamente, dovrai montare il sensore per la porta. Si consiglia di posizionare questo sensore dove non ostruisce il percorso della porta. </p> <p> Inoltre, potresti essere tentato di montare il sensore vicino al suolo. Questo non è raccomandato, poiché l&#39;acqua che spruzza ripetutamente direttamente sul sensore può danneggiarlo. Una volta posizionato il sensore, utilizzare il nastro biadesivo in dotazione o le viti per fissarlo. </p> <p> Nella foto sopra, il sensore nero è stato montato a lato della porta del garage con la parte del magnete montata sulla porta stessa. Questo sensore utilizza nastro biadesivo per il montaggio. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Collegare i fili del sensore </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Ora è il momento di collegare i fili al sensore e al controller. Usando il piano che hai fatto nel primo passaggio, instrada i fili e usa la pinzatrice per fissarli alla parete o al soffitto. </p> <p> Assicurati di non pizzicare o attorcigliare i fili in quanto ciò potrebbe danneggiarli. Quando vengono instradati, collegare il connettore di testa femmina rosso sul controller al connettore di testa maschio rosso all&#39;estremità del cavo del sensore. </p> <p> Successivamente, dovrai aprire il coperchio dell&#39;apriporta del garage. Dovrebbero essere presenti quattro fili, due di controllo dell&#39;alimentazione e comuni all&#39;unità, e due di controllo del pulsante a parete. </p> <p> </p> <p> Di solito, questi fili provengono dal soffitto e dovrebbero avere terminali a forcella crimpati che li fissano all&#39;unità di apertura della porta del garage. Se non riesci a determinare quali sono i cavi, fermati e consulta il manuale del proprietario dell&#39;apriporta del garage o consulta un elettricista certificato. </p> <p> Se hai trovato i fili, collega i fili marrone e blu dal controller ai terminali sull&#39;apri che sono collegati al pulsante a muro. Nella foto sopra, i fili del controller sono stati inseriti nei due terminali più a sinistra. </p> <p> Quando hai finito, dovrebbero esserci due fili collegati a ciascun terminale del pulsante a muro. Richiudere il coperchio dell&#39;apriporta del garage, collegare il controller e l&#39;apriporta e l&#39;installazione dovrebbe essere completata. </p> <p> Nel passaggio successivo, collegherai il controller a una rete wireless. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Connetti il ​​controller al Wi-Fi </h3> <p> <strong class=\"gallery__section-title\"> Galleria di immagini (3 immagini) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Espandere <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Espandere <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> <p> Per configurare la connettività Wi-Fi, abbiamo utilizzato l&#39;app Meross. È disponibile per <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> e <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . Questo processo consiste quasi sempre nell&#39;aprire l&#39;app, identificare il prodotto, connettere l&#39;app al Wi-Fi, aprire la schermata Impostazioni e consentire al controller di accedere alla rete. </p> <p> Qui, apri l&#39;app, quindi tocca <strong> Apriporta intelligente per garage </strong> poi <strong> Inizio </strong> . Seleziona il produttore e il modello dell&#39;apriporta del garage che stai utilizzando con il controller. Assicurati di seguire le istruzioni specifiche per la tua app. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Impostare l&#39;intervallo di temporizzazione di apertura/chiusura </h3> <p> <strong class=\"gallery__section-title\"> Galleria di immagini (3 immagini) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Espandere <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Espandere <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> <p> Una cosa importante da impostare prima di testare il nuovo controller è la tempistica dell&#39;apriporta del garage. Nell&#39;app Meross, puoi selezionare tra 10 secondi e 40 secondi a intervalli di cinque secondi, oppure puoi aggiungere un&#39;impostazione personalizzata per le porte che impiegano un numero pari di secondi per chiudersi. </p> <p> Impostare i tempi per la tua porta è facile, ma devi farlo bene. Un intervallo troppo breve lascerà la porta parzialmente aperta e un&#39;impostazione troppo lunga può causare uno stress eccessivo sul motore dell&#39;apriporta del garage. </p> <p> Per impostare l&#39;intervallo, avrai bisogno di un orologio con una lancetta dei secondi o una funzione di cronometro. Puoi anche utilizzare il timer integrato del telefono. Prepara il timer e posizionati vicino al pulsante di apertura della porta del garage. Quindi premi il pulsante contemporaneamente a premere start sul cronometro o annota l&#39;ora sulla lancetta dei secondi. </p> <p> Attendi finché la porta del garage non si ferma e registra il tempo. Questo è il tuo intervallo. Trasferisci queste informazioni nell&#39;app e l&#39;impostazione dell&#39;intervallo è completa. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Prova il controller della porta del garage </h3> <p> Usando la tua app, apri e chiudi la porta alcune volte solo per assicurarti che tutto funzioni. Ora dovresti essere in grado di utilizzare il pulsante a muro o l&#39;app per aprire la porta del garage. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Goditi il ​​tuo controller intelligente per la porta del garage </h2> <p> Portare la tua tecnologia per la casa intelligente su una porta del garage non deve costare una fortuna. </p> <p> L&#39;installazione di un nuovo controller intelligente per porte da garage offre a te e alla tua famiglia maggiore flessibilità, sicurezza e praticità per la tua casa. Fornisce anche la tranquillità che deriva dal sapere che la porta del tuo garage può essere controllata da quasi ovunque. </p>"}