{"title":"Come utilizzare l&#39;app di allenamento di Apple Watch Apple","content":"<p> Comprendere meglio i tuoi progressi di fitness è a portata di tocco con l&#39;Apple Watch. </p> <p> Diamo un&#39;occhiata a tutto ciò che l&#39;app Apple Watch Workout ha da offrire, incluso il funzionamento dell&#39;app, i tipi di allenamento che può monitorare e come visualizzare tutte le informazioni che raccoglie. </p> <h2 id=\"getting-started-with-the-workout-app\"> Iniziare con l&#39;app di allenamento </h2> <p> Puoi aprire l&#39;app Allenamento su un Apple Watch in diversi modi. Innanzitutto, fai clic una volta su once <strong> Corona digitale </strong> per visualizzare l&#39;elenco delle app sull&#39;orologio. Quindi selezionare <strong> Allenarsi </strong> . </p> <p> Un modo ancora più veloce è usare Siri, premendo a lungo il tasto <strong> Corona digitale </strong> o portare l&#39;orologio alla bocca. Quindi dì semplicemente &quot;Apri l&#39;app Allenamento&quot;. </p> <p> Dopo aver aperto l&#39;app, vedrai un&#39;ampia varietà di tipi di allenamento, dal tiro con l&#39;arco allo yoga e tutto il resto. </p> <p> La schermata principale di selezione dell&#39;allenamento è evidenziata dalle opzioni più popolari. Scorri fino alla fine dell&#39;elenco e seleziona <strong> Aggiungi allenamento </strong> per visualizzare un elenco di altri tipi di allenamento. Se per qualche motivo non vedi il tuo tipo di allenamento, puoi anche selezionare <strong> Altro </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> Puoi selezionare il <strong> tre punti </strong> ( <strong> ... </strong> ) su ogni tipo di allenamento per impostare un obiettivo particolare di distanza, calorie bruciate o tempo. Se uno di questi obiettivi non ti interessa, tocca il nome dell&#39;allenamento per iniziare immediatamente. </p> <p> Ci sarà un conto alla rovescia di tre secondi sullo schermo prima che inizi il monitoraggio. </p> <p> Tutte le funzionalità dell&#39;app Allenamento sono disponibili senza un iPhone nelle vicinanze o utilizzando semplicemente un Apple Watch connesso a un segnale Wi-Fi o cellulare. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Comprendi l&#39;app di allenamento </h2> <p> Ci sono tre schermate principali nell&#39;app. Puoi passare da uno all&#39;altro scorrendo verso sinistra o verso destra. </p> <p> La schermata principale mostrerà tutti i tuoi progressi nel tipo di allenamento che hai selezionato. Vedrai il tempo di allenamento, le calorie attive, le calorie totali e la frequenza cardiaca attuale. A seconda del tipo di allenamento, potresti anche vedere la distanza percorsa. </p> <p> Se possiedi un Apple Watch Series 5 o successivo e hai abilitato il display sempre attivo, puoi sempre vedere le statistiche del tuo allenamento. Chiunque abbia un modello precedente dovrà alzare o toccare lo schermo per vedere queste informazioni. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Quando corri o cammini, l&#39;Apple Watch ti fornirà un tocco delicato ogni miglio o chilometro e mostrerà un aggiornamento con le informazioni sull&#39;andatura. Ogni cinque miglia o chilometri si verificheranno un riepilogo ciclistico e un tocco. </p> <p> Se stai eseguendo un allenamento Apple Fitness+, puoi visualizzare i dati sia sull&#39;app Allenamento che sullo schermo dell&#39;iPhone, dell&#39;iPad o dell&#39;Apple Watch. </p> <p> </p> <p> Scorrendo verso destra dalla schermata principale ti mostreranno quattro diverse opzioni: <strong> Serratura </strong> , <strong> Nuovo </strong> , <strong> Fine </strong> , e <strong> Pausa </strong> . </p> <p> Selezione <strong> Serratura </strong> bloccherà lo schermo per evitare tocchi accidentali. Puoi ruotare la Digital Crown per sbloccare lo schermo. Solo per notare, questa opzione si attiverà automaticamente durante qualsiasi tipo di allenamento di nuoto per evitare tocchi accidentali da gocce d&#39;acqua. </p> <p> Come probabilmente puoi immaginare, <strong> Nuovo </strong> termina l&#39;allenamento in corso e consente di scegliere un nuovo tipo di esercizio per ricominciare. Selezione <strong> Fine </strong> terminerà l&#39;allenamento in corso. </p> <p> Se vieni mai interrotto, puoi selezionare il <strong> Pausa </strong> pulsante. Premendolo di nuovo si avvierà il monitoraggio dell&#39;allenamento. Puoi farlo anche premendo contemporaneamente la corona digitale e il pulsante laterale. </p> <p> Scorrendo verso sinistra dalla schermata principale dell&#39;allenamento vengono mostrati i controlli di riproduzione multimediale. È un modo semplice per accedere alla tua musica o a qualsiasi altra cosa tu stia ascoltando mentre ti alleni. Puoi saltare i brani, riprodurre, mettere in pausa e alzare o abbassare il volume. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Promemoria di allenamento automatici </h2> <p> Non devi preoccuparti se dimentichi di iniziare un allenamento. Finché hai watchOS 5 o successivo, un Apple Watch può riconoscere automaticamente quando ti alleni. Ti toccherà il polso e ti chiederà se desideri registrare un allenamento, consentendoti di modificare il tipo di allenamento, disattivare queste notifiche per il giorno o semplicemente ignorare questa notifica. </p> <p> Anche se potrebbero essere necessari alcuni minuti prima che la notifica venga visualizzata, tutto il credito dell&#39;allenamento viene comunque salvato. </p> <p> Puoi ricevere promemoria di allenamento per i seguenti tipi di allenamento: camminata indoor, camminata all&#39;aperto, corsa indoor, corsa all&#39;aperto, ellittica, vogatore, nuoto in piscina e nuoto in acque libere. </p> <p> Per attivare o disattivare la funzione, vai a <strong> Impostazioni &gt; Allenamento &gt; Promemoria inizio allenamento </strong> sul tuo Apple Watch. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> L&#39;Apple Watch può anche rilevare quando un allenamento è completo. Dopo un tocco, vedrai una notifica sullo schermo con le opzioni per terminare o mettere in pausa l&#39;allenamento. Puoi anche ignorare completamente la notifica e continuare l&#39;allenamento. </p> <p> Attiva o disattiva la funzione andando sul tuo Apple Watch e andando su <strong> Impostazioni &gt; Allenamento &gt; Promemoria fine allenamento </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Personalizza i dati mostrati nell&#39;app di allenamento </h2> <p> Nella vista Allenamento di Apple Watch, puoi personalizzare le informazioni mostrate sullo schermo per diversi tipi di allenamento. </p> <p> Per iniziare, apri l&#39;app Watch companion sul tuo iPhone. Nel <strong> Il mio orologio </strong> scheda seleziona <strong> Allenarsi </strong> . Quindi scegli <strong> Visualizzazione allenamento </strong> . Nella parte superiore della pagina, puoi selezionare se mostrare metriche singole o multiple sullo schermo durante un allenamento. Se selezioni <strong> Singola metrica </strong> , scorri la Digital Crown per vedere più dati sul tuo Apple Watch. </p> <p> <strong class=\"gallery__section-title\"> Galleria di immagini (3 immagini) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Espandere <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Espandere <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> <p> Sotto, puoi anche vedere una serie di diversi tipi di allenamento in cui puoi modificare le informazioni mostrate sullo schermo. Seleziona un tipo di allenamento e poi scegli <strong> modificare </strong> in alto a destra dello schermo per personalizzare ciò che viene mostrato sullo schermo e in quale ordine. </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Visualizzazione dei dati di allenamento nell&#39;app Fitness </h2> <p> Una volta che hai finito con un allenamento, tutti i dati sono a pochi tocchi di distanza sul tuo iPhone. </p> <p> Per vederlo, apri il <strong> Fitness </strong> app. </p> <p> <strong class=\"gallery__section-title\"> Galleria di immagini (2 immagini) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Espandere <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> <p> Sotto il <strong> Sommario </strong> scheda, seleziona <strong> Allenamenti </strong> . Vedrai le informazioni su tutti i tuoi allenamenti. I dati sono disponibili anche in <strong> Salute </strong> app. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Rompi il sudore con l&#39;app Apple Watch Workout </h2> <p> Come puoi vedere, l&#39;app Apple Watch Workout è un ottimo modo per tenere traccia di tutte le tue diverse metriche di fitness mentre fai di tutto, dal nuoto alla danza e molto altro. </p> <p> E quando sei pronto a passare la notte e vai a letto, il tuo Apple Watch può ancora essere di grande aiuto con la funzione di monitoraggio del sonno integrata. </p>"}