{"title":"Come gestire i gruppi di utenti con Groupadd su Linux","content":"<p> La gestione degli utenti è piuttosto semplice se utilizzi Linux sul tuo personal computer. Ma, per chi ha un server con migliaia di utenti, la gestione diventa un problema serio di cui prendersi cura. </p> <p> Fortunatamente, i sistemi operativi basati su Linux ti offrono un modo per controllare e gestire gli utenti sul tuo sistema. Puoi creare gruppi e aggiungervi utenti. Quindi, invece di assegnare le autorizzazioni a ogni utente del sistema, è possibile autorizzare facilmente i gruppi di utenti fornendo loro i privilegi associati al flusso di lavoro del sistema. </p> <h2 id=\"create-user-groups-on-linux\"> Crea gruppi di utenti su Linux </h2> <p> Linux viene fornito con un comando predefinito per la creazione di gruppi di utenti. Puoi usare il <strong> groupadd </strong> comando per aggiungere nuovi gruppi al tuo sistema. La sintassi di base del comando è: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> Per creare un nuovo gruppo di utenti &quot;scrittori&quot;: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> L&#39;esecuzione del comando sopra menzionato aggiungerà una nuova voce al <strong> /etc/group </strong> e <strong> /etc/gshadow </strong> file sul tuo sistema. Puoi controllare la nuova voce del gruppo nei file digitando <strong> gatto /etc/group </strong> e <strong> gatto /etc/gshadow </strong> nel tuo terminale. </p> <p> Tieni presente che solo gli utenti con autorizzazioni amministrative possono creare gruppi di utenti. Non dimenticare di passare a superutente prima di eseguire il comando groupadd. </p> <p> Se provi a creare un gruppo con un nome già esistente, vedrai un errore che indica: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> Tuttavia, è possibile eliminare l&#39;errore utilizzando il <strong> -f </strong> o <strong> --vigore </strong> bandiera con il comando. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Crea gruppi di utenti con GID univoco </h3> <p> Quando crei un nuovo gruppo di utenti, il sistema gli assegna automaticamente un ID di gruppo o GID. Se vuoi che il tuo gruppo abbia un ID di gruppo specifico, puoi farlo usando il <strong> -g </strong> o <strong> --gid </strong> bandiera. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Se provi ad assegnare un ID di gruppo già utilizzato, si verificherà il seguente errore. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Anche se non è raccomandato ma puoi aggiungere il <strong> -o </strong> o <strong> --non unico </strong> flag per assegnare forzatamente l&#39;ID del gruppo. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Crea gruppi di utenti con una password </h3> <p> Sebbene tu possa aggiungere una password ai tuoi gruppi, non sono di alcuna utilità pratica per un utente. Il <strong> -p </strong> flag ti consente di specificare una password per il tuo gruppo di utenti. </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Crea gruppi di sistema in Linux </h3> <p> C&#39;è una leggera differenza tra i gruppi di sistema e i gruppi regolari. I gruppi di sistema sono gruppi speciali che includono gli utenti responsabili dell&#39;esecuzione di operazioni di sistema quali backup e manutenzione. </p> <p> Usa il <strong> -r </strong> o <strong> --sistema </strong> flag per creare un gruppo di sistema su Linux: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Ottieni l&#39;elenco dei membri in un gruppo di utenti </h3> <p> Per sapere quanti membri fanno parte di un gruppo specifico, puoi utilizzare il <strong> getente </strong> comando dal tuo terminale. Il seguente comando visualizzerà un elenco di tutti i membri presenti nel gruppo &#39;scrittori&#39;: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Aggiungi utenti ai gruppi </h2> <p> Ora che hai creato un gruppo di utenti sul tuo sistema, è il momento di aggiungervi alcuni utenti. Usermod è una potente utility da riga di comando in quanto contiene varie opzioni associate alla gestione e alla moderazione degli utenti. Ti consente anche di aggiungere facilmente utenti al tuo gruppo. La sintassi di base del comando è: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Aggiungi un utente esistente ai gruppi </h3> <p> Se vuoi aggiungere un utente esistente al tuo gruppo, il <strong> -un </strong> e <strong> -G </strong> le bandiere sono ciò di cui hai bisogno. Il <strong> -G </strong> bandiera sta per gruppi, mentre il <strong> -un </strong> sta per aggiungere, aggiungere o addizione. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> Puoi anche aggiungere un utente a più gruppi. Tutto quello che devi fare è inserire i nomi dei gruppi separati da virgole. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Aggiungi un nuovo utente a un gruppo </h3> <p> Puoi usare il <strong> useradd </strong> comanda quando vuoi <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> aggiungi un nuovo utente al tuo sistema Linux </a> . Useradd ti fornisce un modo per assegnare un gruppo all&#39;utente al momento della sua creazione. Il <strong> -G </strong> flag consente di specificare un gruppo per l&#39;utente. </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> Anche l&#39;aggiunta di un utente a più gruppi è facile. Basta passare i nomi dei gruppi separati dal carattere virgola nel comando predefinito. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Rimuovere utenti da un gruppo </h2> <p> Puoi anche rimuovere utenti da un gruppo usando <strong> usermod </strong> . Tieni presente che in un sistema Linux è possibile assegnare più gruppi a un utente. Uno di questi gruppi viene dichiarato gruppo primario, mentre altri vengono definiti gruppi secondari. </p> <p> Se stai cercando di rimuovere un utente da un gruppo, assicurati che abbia almeno un gruppo principale dopo la rimozione. Ad esempio, l&#39;utente &quot;random&quot; fa parte dei gruppi admin, writer ed editor; dove admin è il gruppo principale e il resto sono gruppi secondari. </p> <p> Puoi rimuovere l&#39;utente solo dal gruppo di autori ed editori. E per farlo, devi passare il nome del gruppo di cui vuoi che l&#39;utente rimanga membro. Ciò significa che, per rimuovere l&#39;utente &#39;random&#39; dagli editor di gruppo, viene utilizzato il seguente comando: </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> Nota che tutto quello che dovevi fare era spogliare il <strong> aggiungi flag (-a) </strong> dal comando che usi per aggiungere un utente a un gruppo. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Elimina gruppi su Linux </h2> <p> Quando non si desidera più mantenere un gruppo di utenti sul sistema, è possibile eliminare il gruppo utilizzando il pulsante <strong> groupdel </strong> comando. La sintassi del comando è: </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> Per eliminare il gruppo di utenti &quot;scrittori&quot;: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Se provi a rimuovere un gruppo che non esiste, riceverai un messaggio di errore che indica: </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Gestione di gruppi di utenti su Linux </h2> <p> La gestione degli utenti può essere difficile se non si conoscono i comandi di Linux che è necessario utilizzare. Diventa davvero facile una volta che conosci l&#39;interno e l&#39;esterno dei comandi relativi alla moderazione e alla gestione. </p> <p> Gli amministratori dei server dovrebbero provare a utilizzare le distribuzioni Linux adatte alle loro esigenze. In questo modo, otterranno subito tutti gli strumenti e le utilità necessari per la gestione del server. </p>"}