{"title":"Come migliorare le tue capacità di editing di Lightroom: 10 semplici modi","content":"<p> Adobe Lightroom è una delle piattaforme di fotoritocco più conosciute sul mercato. Questa soluzione è popolare non solo perché ha così tante funzioni utili, ma anche per la sua facilità d&#39;uso. </p> <p> Quando i fotografi cercano di prendere un po&#39; più sul serio il loro mestiere, la prima cosa che faranno è acquistare un software di editing. Ma anche se sei solo un fotografo occasionale, Lightroom offre molti modi per stupire i tuoi amici. </p> <p> In questa guida scoprirai diversi modi semplici per migliorare le tue foto in Lightroom. Questi suggerimenti funzionano sia per Lightroom Classic che per Lightroom Creative Cloud. </p> <h2 id=\"use-masking\"> 1. Usa la mascheratura </h2> <p> Se affili la tua foto per impostazione predefinita, aggiungerai dettagli all&#39;intera immagine, anche alle aree che non desideri. Questo può lasciarti con un sacco di grano in luoghi indesiderati, come nel cielo e nell&#39;acqua. </p> <p> Corri anche il rischio di far sembrare la tua foto più simile a un disegno che a qualcosa che hai scattato con la tua fotocamera. Fortunatamente, c&#39;è una soluzione facile. </p> <p> Nell&#39;app Lightroom, scorri verso il basso fino a <strong> Dettaglio </strong> . Quando sei lì, vai su <strong> Affilatura </strong> &gt; <strong> mascheramento </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Scorri il cursore fino a selezionare le parti dell&#39;immagine che desideri rendere più nitide. Per vedere cosa stai mascherando, premi il <strong> Alt </strong> tasto sulla tastiera allo stesso tempo. </p> <p> Dopo aver mascherato l&#39;area desiderata, fai scorrere il cursore di nitidezza tanto o quanto ti serve. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Usa i profili della fotocamera invece di quelli predefiniti di Adobe </h2> <p> Se carichi un&#39;immagine in RAW, Adobe aggiungerà uno dei suoi profili di programma per impostazione predefinita. E mentre questi potrebbero rendere la tua immagine migliore in alcuni casi, spesso è meglio sceglierne uno specifico per la fotocamera. </p> <p> Quando utilizzi un profilo della fotocamera, l&#39;immagine diventerà più facile da modificare in base a ciò che hai scattato con il tuo dispositivo. </p> <p> Per modificare il profilo della tua foto, vai su <strong> Profili </strong> &gt; <strong> Corrispondenza fotocamera </strong> . Puoi quindi scegliere tra <strong> Standard </strong> , <strong> Neutro </strong> , <strong> Paesaggio </strong> , e altri look. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Ricorda: </strong> non puoi cambiare il profilo dell&#39;immagine con la stessa profondità se prendi solo JPEG. Quindi, prima di uscire per fare qualche scatto, imposta la fotocamera su una delle due <strong> CRUDO </strong> o <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Sfiora le parti della tua immagine </h2> <p> Hai mai aumentato la nitidezza, la saturazione o i dettagli dell&#39;intera immagine, aspettandoti un capolavoro, ma invece hai ottenuto un&#39;immagine che sembra essere stata scattata in un microonde? In tal caso, potresti trarre vantaggio dal modificare solo parti della tua immagine. </p> <p> In Lightroom, puoi accedere a una funzione chiamata <strong> Spazzola </strong> . Puoi usarlo per &quot;spennellare&quot; su parti della tua foto lasciando il resto da solo. </p> <p> Per utilizzare questo strumento, vai su <strong> Spazzola </strong> icona sul lato destro dello schermo. Puoi ingrandire o rimpicciolire il pennello, a seconda di quanta parte dell&#39;immagine vuoi modificare. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Prima di iniziare a spazzolare, modifica le caratteristiche dell&#39;immagine che desideri modificare. Ad esempio, puoi alzare il cursore della chiarezza se stai cercando di rendere più chiara una parte dell&#39;immagine. </p> <p> Dopo aver modificato queste caratteristiche, sfiora le aree che desideri modificare. stampa <strong> oh </strong> sulla tastiera per vedere dove hai sfiorato. </p> <p> Se hai esagerato in una particolare area, tieni premuto il pulsante <strong> Meno </strong> ( <strong> - </strong> ) e tocca quelle parti per cancellare le modifiche. Sapendo <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> scorciatoie da tastiera per Adobe Lightroom </a> è utile per queste situazioni, quindi non dimenticare di rispolverarle! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Distruggi le tue foto </h2> <p> A volte, la tua fotocamera scatterà foto in cui i bordi hanno colori innaturali. Li noterai soprattutto quando scatti foto in condizioni di luce solare intensa. Vengono principalmente nei toni del verde e del viola. </p> <p> Per eliminare la violazione delle tue foto, scorri verso il basso fino a <strong> disinfrangere </strong> . Puoi scegliere di eliminare le frange viola o verdi. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> Uso <strong> Quantità </strong> per decidere la quantità di eliminazione che desideri aggiungere. Fai scorrere la barra dei colori finché non sei soddisfatto dei risultati. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Usa la geometria per raddrizzare le tue foto </h2> <p> Non importa quanto ci provi, tenere una fotocamera dritta è difficile a meno che tu non abbia un treppiede. Ma grazie alla magia del software di editing, raddrizzare le tue immagini è facile. </p> <p> In Lightroom, puoi raddrizzare automaticamente le tue foto andando su <strong> Ritaglia </strong> sezione. Tuttavia, esiste un modo più accurato per ottenere lo stesso risultato. </p> <p> Nella scheda di destra, seleziona l&#39;opzione in alto. Quindi, scorri verso il basso fino a <strong> Geometria </strong> . Quando sei qui, vai su <strong> verticale </strong> &gt; <strong> Livello </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> Puoi anche disegnare lungo linee rette per rendere la foto il più diritta possibile. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Regola le dimensioni dell&#39;area di affilatura </h2> <p> Ora conosci il mascheramento, ma sapevi che puoi anche affinare aree specifiche della tua foto? </p> <p> Per selezionare l&#39;area all&#39;interno della foto mascherata che desideri rendere più nitida, vai a <strong> Affilatura </strong> , tenere il <strong> Alt </strong> chiave e dirigiti a <strong> Raggio </strong> . La regolazione di questo cursore consente di ingrandire o ridurre l&#39;area di nitidezza. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> Dopo questo, vai su <strong> Affilatura </strong> bar. Allo stesso modo, tieni premuto <strong> Alt </strong> tasto e sposta il cursore verso destra. In questo modo sarà più facile mettere a fuoco un&#39;area specifica della foto, anziché l&#39;intera immagine. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Usa le curve dei punti di colore </h2> <p> Se il colore della tua immagine non sembra corretto anche dopo aver regolato il bilanciamento del bianco, potresti voler controllare le curve dei punti di colore in Lightroom. Puoi usarli per regolare alcuni colori nell&#39;immagine. </p> <p> Troverai tre diversi pannelli delle curve di colore nell&#39;app: rosso, blu e verde. </p> <p> Per arrivare a queste curve di colore, scorri verso il basso fino a <strong> Punto Curva Point </strong> . Quindi, fai clic sul colore che desideri modificare. Puoi quindi giocare con i colori nello stesso modo in cui faresti con lo standard <strong> Punto Curva Point </strong> scheda. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Digita un numero per ogni dispositivo di scorrimento e modifica di conseguenza </h2> <p> Spesso, i nuovi fotografi saranno entusiasti del numero di opzioni di modifica a loro disposizione. Quando aprono Lightroom, faranno scorrere ogni barra troppo lontano in entrambe le direzioni. Ma invece di migliorare la loro immagine, finiscono con un pasticcio sovradimensionato. </p> <p> Quando si modificano le foto, la chiave è apportare piccole modifiche. È probabile che tu sia già un buon fotografo e la foto che hai scattato ha solo bisogno di un po&#39; di messa a punto in post-produzione. </p> <p> </p> <p> Invece di spostare liberamente ciascun dispositivo di scorrimento, prova a cambiare il numero delle aree in base alle quali desideri modificare <strong> +10 </strong> o <strong> -10 </strong> . Se pensi che sia necessario più lavoro, ripeti il ​​processo. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Quando ti senti vicino, sposta lentamente ogni cursore a sinistra oa destra finché non sei felice. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Ritaglia le tue foto </h2> <p> Il ritaglio potrebbe sembrare ovvio, ma molti fotografi continuano a sottoutilizzare la funzione. È anche importante ritagliare le immagini a seconda di dove le utilizzerai. In caso contrario, verranno distorti. </p> <p> Per ritagliare le tue foto, vai su <strong> Ritaglia </strong> icona. Questo è il secondo più alto dall&#39;alto. Vai a <strong> Proporzioni </strong> per modificare le dimensioni e trascinare gli angoli per eliminare eventuali oggetti indesiderati. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> Dopo aver finito di ritagliare, premi il <strong> accedere </strong> key sul tuo computer e le modifiche entreranno in vigore. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Usa l&#39;istogramma </h2> <p> L&#39;istogramma di Lightroom è facile da ignorare ma essenziale da conoscere. Questo piccolo grafico ti mostrerà dove i colori e l&#39;illuminazione non sono uguali nella tua immagine, permettendoti di creare una modifica più pulita. </p> <p> Come regola generale, una foto ben modificata avrà pochi picchi sull&#39;istogramma. A volte, questo è inevitabile. Ma in generale, dovresti cercare di rendere il grafico il più uniforme possibile. </p> <p> A seconda della versione di Lightroom che utilizzi, puoi manipolare l&#39;istogramma più o meno direttamente. In Lightroom Classic, puoi fare clic sull&#39;istogramma e persino sulle cose scorrendo su determinate sezioni. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> In Creative Cloud, l&#39;istogramma è visibile allo stesso modo nell&#39;angolo in alto a destra, ma devi modificare tu stesso i dispositivi di scorrimento per spostare l&#39;istogramma. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> Su entrambe le versioni della piattaforma, l&#39;istogramma è disponibile nella parte superiore dello schermo sopra le funzioni di modifica. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> Il grande editing non è solo per i professionisti </h2> <p> Lightroom è un eccellente software di editing per chiunque desideri portare la propria fotografia a un livello superiore. E anche se non hai mai usato la piattaforma prima, non devi preoccuparti, perché è facile da imparare. </p> <p> Quando modifichi le tue foto in Lightroom, ricorda che meno spesso è di più. Oltre a considerare questi suggerimenti, è una buona idea fare un passo indietro dopo la modifica e tornare più tardi per vedere se sono così ben modificati come pensavi. </p>"}