{"title":"Cibo per la mente a misura di morso: 5 siti per imparare cose nuove in modi brevi e divertenti","content":"<p> Documentari della durata di meno di un minuto. Episodi podcast di soli 60 secondi. Infografiche animate per spiegare argomenti complessi. Ecco dove puoi imparare di più sul mondo in brevi capsule di conoscenza coinvolgente. </p> <p> In un&#39;era di brevi periodi di attenzione e 280 aggiornamenti dei caratteri, anche l&#39;apprendimento deve essere in piccole dosi. Ecco perché ci sono creatori di contenuti specializzati nella creazione di pezzi informativi e divertenti che non richiedono quasi tempo nelle nostre vite impegnate. Dai mini-documentari di persone e argomenti affascinanti alle guide sui social media su argomenti di tendenza, dai alla tua mente un po&#39; di cibo cerebrale da masticare. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 60 Secondi Documenti </a> (Web): profili di persone e argomenti interessanti in 60 secondi </h2> <p> </p> <p> Avere un minuto? 60 Second Docs ha una bella storia da raccontarti su una persona interessante e, a sua volta, un argomento interessante. Ogni documentario dura solo 60 secondi, ma copre le cose migliori che devi sapere sull&#39;argomento. </p> <p> La parte più interessante è che 60 Second Docs si concentra sui profili di persone reali, invece che su concetti o tendenze. Di solito, quella persona sta facendo qualcosa di unico, che si tratti di iniziare una nuova tendenza, esplorare un nuovo argomento o spingere i confini in qualche modo. Facendo riferimento alla persona, non solo ottieni una maggiore comprensione dell&#39;aspetto umano del soggetto unico, ma ti sembra anche più reale ed emotivo. </p> <p> Tutti i 60 Second Docs sono disponibili sul loro canale YouTube o sui social media. È una buona idea seguirli su qualsiasi social network che frequenti, guardando ogni nuovo video nella sua interezza ogni volta che pubblicano un aggiornamento. </p> <p> Se ti piacciono i documentari più lunghi, controlla il <strong> Selezione Ufficiale </strong> pagina sul sito Web 60 Second Docs. Qui, gli editori scelgono documentari di 10-20 minuti che altri hanno girato, su argomenti che pensano che dovresti guardare. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Quindi ne vuoi parlare </a> (Instagram): Mini Guide ad Argomenti Politici e Sociali </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> Chi sapeva che in un mondo di selfie di influencer e hashtag promossi dal marchio, Instagram avrebbe fornito una piattaforma per educare? So You Want To Talk About (Sywtta) utilizza i formati di post con più immagini di Instagram per creare mini-guide su argomenti politici e sociali. </p> <p> Gli argomenti scelti da Sywtta di solito trattano argomenti di tendenza come la cancellazione del prestito studentesco, i diritti e la storia dei neri, gli errori logici, i vaccini COVID-19 e molto altro. Ogni diapositiva utilizza una tipografia splendidamente formattata per istruirti sull&#39;argomento e, inoltre, ogni diapositiva è come una mini-lezione in sé. Ogni guida diventa un corso accelerato rapido e informativo, senza essere troppo pesante con i dati. </p> <p> In un momento in cui devi essere vigile su <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> notizie faziose o false </a> , è anche importante notare le filosofie di ciò che stai leggendo. Quando si tratta di politica, Sywtta propaga le opinioni delle politiche progressiste e di sinistra. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> 60 secondi di scienza </a> (Podcast): brevi spiegazioni audio di scienza, salute e tecnologia </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Se preferisci ascoltare le tue informazioni piuttosto che leggere o guardare, dai un&#39;occhiata al podcast 60 Second Science. Realizzato dal team di Scientific American, questo podcast quotidiano tocca argomenti di scienza, medicina e tecnologia e spiega un argomento in un breve lampo. Sebbene non si limiti più al limite di tempo di un minuto, ogni episodio è ancora inferiore ai cinque minuti. </p> <p> Ogni podcast ha host diversi dal team Scientific American, che copre argomenti come COVID, animali e uccelli, DNA e medicina, scienze ambientali, ecc. Godono di alti valori di produzione, incorporando suoni del mondo reale sul punto di discussione e spesso aggiungendo clip vocali da esperti. </p> <p> Per sfogliare gli archivi degli episodi passati, vai al sito Web ufficiale di 60 Second Science. Qui puoi filtrare gli episodi per argomento (salute, mente, sostenibilità, tecnologia, scienze). Se non vuoi informazioni a raffica, prova il podcast completo di Science Talk. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Animagrafi </a> (Web): infografiche animate di alta qualità per spiegare le cose </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> Come funziona la criptovaluta? Quali sono i dettagli dell&#39;assicurazione auto? Come si fa un moonwalk? Il designer e animatore Jacob O&#39;Neal suddivide argomenti complessi in semplici spiegazioni e disegna infografiche animate di alta qualità per illustrarli. </p> <p> Animagraffs è una raccolta di brevi spiegazioni attraverso guide visive, utilizzando GIF animate. Jacob utilizza una varietà di tecniche di progettazione, come le viste in sezione trasversale per illustrare ogni parte di uno strumento o immagini di grandi dimensioni con parti mobili in cui è possibile ingrandire e rimpicciolire come Google Maps. Ogni stile si adatta all&#39;argomento che stai imparando. </p> <p> Anche i soggetti hanno una vasta gamma, incluso come corre un ghepardo, come funzionano le auto elettriche, come un altoparlante emette il suono e così via. Dovresti anche controllare la sezione &quot;Lavoro del cliente&quot;, dove Jacob mostra gli incarichi pagati per i marchi. Non preoccuparti, anche se sono annunci, sono comunque informativi e divertenti. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Grande Grande Storia </a> (YouTube): veri brevi documentari affascinanti e interessanti </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story ha concluso le operazioni alla fine del 2020, ma non prima di aver lasciato cinque anni di deliziosi brevi documentari. Immergiti negli archivi per trovare video di circa 5 minuti su una serie di argomenti interessanti e persone affascinanti da tutto il mondo. </p> <p> Da un film proiettato in un teatro indiano per 24 anni al fantastico gelato turco che non si scioglie, ogni breve video è uno sguardo di alta qualità e ben studiato sull&#39;argomento. A differenza della maggior parte degli altri video di questo tipo, i creatori di video di Great Big Story viaggiano spesso per il mondo per mettersi al centro della storia. Ordina in base ai più popolari o utilizza le varie playlist personalizzate consigliate dai creatori. </p> <p> Sul canale troverai anche alcuni video più lunghi, di circa 10-15 minuti. Di solito si tratta di elenchi e compilation, che includono alcune clip dei video più brevi. Se hai il tempo di scoprire di più sul mondo che ci circonda, non puoi sbagliare con questi. Anche dopo aver tirato giù le imposte, Great Big Story è uno dei più <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> canali affascinanti ed educativi su YouTube </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Usa l&#39;apprendimento a goccia per conquistare soggetti di grandi dimensioni </h2> <p> Questi siti Web e podcast si concentrano sulla trasformazione di ogni nuovo argomento in un pacchetto di informazioni compatto e divertente. È un bel modo per imparare cose nuove a piccoli morsi. Ma puoi anche applicare la stessa filosofia all&#39;apprendimento di argomenti più complessi e più ampi. </p> <p> Sempre più spesso, l&#39;apprendimento a goccia o il microlearning è un modo popolare per ottenere un&#39;istruzione. Ricevendo <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> piccole lezioni ogni giorno </a> , puoi affrontare argomenti come la programmazione, il design, lo sviluppo di app, la gestione dei prodotti e altro ancora. Una rapida ricerca sul web dovrebbe aiutarti a trovare una versione di apprendimento a goccia di tutto ciò in cui stai cercando di istruirti. </p>"}