{"title":"Come impedire a Windows 10 di bloccare i file scaricati","content":"<p> Quando provi ad aprire un file, Windows 10 potrebbe impedirti di aprirlo direttamente. Ti mostrerà un avviso di sicurezza che il file ha avuto origine da una fonte sconosciuta e può essere non sicuro. Ciò accade quando una funzionalità di Windows 10 chiamata Gestione allegati blocca i file che considera non sicuri per il tuo PC. </p> <p> Sebbene tu possa sbloccare manualmente ogni file, questo può essere un processo faticoso, specialmente se devi farlo per quasi tutti i file che scarichi. In questo articolo, ti mostreremo come impedire a Windows 10 di bloccare i file scaricati. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> Che cos&#39;è Gestione allegati in Windows 10? </h2> <p> In Windows 10, c&#39;è una funzione di sicurezza chiamata Gestione allegati che ti impedisce di aprire file non sicuri. Questi possono essere file che hai scaricato o <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> file che Windows identifica come allegati di posta elettronica non sicuri </a> . Se Gestione allegati considera un file non sicuro, impedisce a Windows 10 di aprirlo e visualizza un messaggio di avviso. Il Gestore allegati classifica i file scaricati in base al tipo di file e all&#39;estensione del nome del file. </p> <p> Windows Attachment Manager utilizza l&#39;interfaccia di programmazione dell&#39;applicazione (API) IattachmentExecute per trovare il tipo di file, l&#39;associazione di file e per determinare l&#39;azione più appropriata da intraprendere. Quando scarichi file e li salvi sul disco, Windows aggiunge metadati specifici a questi file. Questi metadati sono considerati allegati. Quando Windows aggiunge metadati ai file di download come allegato, questo è noto come Informazioni sulla zona. </p> <p> Ora il <strong> Informazioni sulla zona </strong> è dove sta la radice della questione. Quando File Explorer apre un file, legge le informazioni sulla zona allegate memorizzate nella stessa posizione e verifica se il file proviene da una fonte sconosciuta o meno. Se Windows rileva che il file non è riconosciuto o proviene da fonti sconosciute, ne impedisce l&#39;apertura. </p> <p> Verrà visualizzato un avviso di Windows SmartScreen che indica: </p> <blockquote> <p> Windows SmartScreen ha impedito l&#39;avvio di un&#39;app non riconosciuta. L&#39;esecuzione di questa app potrebbe mettere a rischio il tuo PC. </p> </blockquote> <p> Se desideri aprire manualmente un file bloccato, fai clic con il pulsante destro del mouse sul file scaricato e quindi seleziona <strong> Proprietà </strong> . Nella scheda Generale, fare clic su <strong> Sbloccare </strong> , clicca <strong> Applicare </strong> e quindi fare clic su <strong> ok </strong> . </p> <p> Ma immagina di doverlo fare ogni volta che scarichi un file, che può essere fastidioso e richiedere molto tempo. Se scarichi spesso file da Internet o ricevi file come allegati di posta elettronica, potresti voler impedire completamente al tuo PC di bloccare i tuoi file. </p> <p> Per impedire a Windows 10 di impedirti di aprire i tuoi file, devi impedire che aggiunga le informazioni sulla zona ai file che scarichi. È possibile farlo configurando manualmente Gestione allegati utilizzando l&#39;Editor Criteri di gruppo locali o l&#39;Editor del Registro di sistema. </p> <p> Forniremo i passaggi su come farlo. Devi essere registrato come amministratore o dovresti <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> richiedi i diritti di amministratore </a> per poter impedire che i file scaricati vengano bloccati. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Configurare il gestore degli allegati utilizzando l&#39;editor del registro </h2> <p> premi il <strong> Tasto Windows + R </strong> per aprire l&#39;editor del registro. Da lì, digita &quot;Regedit&quot; e fai clic su <strong> accedere </strong> . Apparirà una richiesta di controllo dell&#39;account utente. Quando viene visualizzato questo messaggio, fare clic su <strong> sì </strong> pulsante per continuare. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Passare alla chiave degli allegati nell&#39;editor del registro: <strong> HKEY_CURRENT_USER &gt; Software &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; Politiche &gt; Allegati </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> Se la chiave Allegati è assente nella chiave Politiche, dovrai crearla. Per fare ciò, fare clic con il tasto destro del mouse su <strong> Politiche </strong> tasto, fare clic <strong> Nuovo </strong> , clicca <strong> Chiave </strong> . Questo creerà una nuova chiave, che dovresti chiamare &quot;Allegati&quot;. Se trovi che la chiave degli allegati è già presente, puoi saltare al passaggio successivo. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> Fare clic con il tasto destro del mouse su <strong> Allegati </strong> tasto, fare clic <strong> Nuovo </strong> e poi seleziona <strong> Valore DWORD (32 bit) </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Ti verrà chiesto di nominare questo valore DWORD appena creato. Chiamalo &quot;SaveZoneInformation&quot; e fai clic su <strong> accedere </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> Infine, per disabilitare Gestione allegati in Windows 10, fai doppio clic sul nuovo oggetto <strong> Salva informazioni sulla zonaZ </strong> valore e modifica i suoi dati di valore in 1. Fare clic su <strong> ok </strong> finire. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Una volta completati questi passaggi, chiudi l&#39;editor del registro e riavvia il computer per applicare le modifiche. Da qui in poi, qualsiasi file scaricato non allegherà più le informazioni sulla zona al flusso di dati alternativo del file. Questo ti permetterà di aprire i tuoi file senza alcuna difficoltà. </p> <p> Se desideri tornare indietro e abilitare il Gestore allegati, puoi farlo accedendo alla chiave Allegati nell&#39;Editor del Registro di sistema: <strong> HKEY_CURRENT_USER &gt; Software &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; Politiche &gt; Allegati </strong> . Da qui, sul lato destro, fare doppio clic su <strong> Salva informazioni sulla zonaZ </strong> value e cambia i suoi dati di valore in 3. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Configurare il gestore degli allegati utilizzando l&#39;editor dei criteri di gruppo locali </h2> <p> L&#39;Editor criteri di gruppo locali è disponibile solo nelle edizioni Windows 10 Enterprise, Education e Pro. Di conseguenza, questo metodo non è applicabile se possiedi l&#39;edizione Windows 10 Home. Se il tuo PC funziona con l&#39;edizione Windows 10 Home, dovrai configurare Gestione allegati tramite l&#39;editor del registro. </p> <p> Se stai utilizzando un&#39;edizione di Windows 10 con l&#39;Editor criteri di gruppo locali, puoi configurare Gestione allegati seguendo i passaggi indicati qui. </p> <p> Per iniziare, premi <strong> Tasto Windows + R </strong> , digita &quot;gpedit.msc&quot; e fai clic su <strong> accedere </strong> per aprire l&#39;Editor criteri di gruppo locali. </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Passare a Gestione allegati: <strong> Configurazione utente &gt; Modelli amministrativi &gt; Componenti di Windows &gt; Gestione allegati </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> Nel riquadro di destra di Gestione allegati, fare doppio clic su <strong> Non conservare le informazioni sulla zona nei file allegati </strong> criterio per modificare le impostazioni delle informazioni sulla zona. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> Verrà visualizzata una finestra in cui è possibile scegliere se il Gestore allegati deve o non deve conservare le informazioni sulla zona. </p> <p> Clic <strong> Abilitato </strong> per consentire a Gestione allegati di non conservare le informazioni sulla zona. Ciò assicurerà che Windows non blocchi i tuoi file ogni volta che li apri. Clicca il <strong> Applicare </strong> per salvare le modifiche e quindi fare clic su <strong> ok </strong> . </p> <p> Al termine, chiudi l&#39;Editor Criteri di gruppo locali e riavvia il PC per salvare le modifiche. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows non bloccherà più i tuoi file </h2> <p> Se in precedenza avessi dovuto sbloccare manualmente la maggior parte dei file scaricati, ti saresti reso conto di quanto potesse essere faticoso quel processo. Una volta applicati questi suggerimenti, avrai la libertà di aprire tutti i tuoi file con facilità. </p> <p> Se scarichi file e in qualche modo dubiti della loro credibilità, puoi sempre aprirli in ambienti isolati e sicuri per assicurarti che il tuo PC e i tuoi dati siano al sicuro. </p>"}