{"title":"Che cos&#39;è Unix Time e quando è stata l&#39;epoca di Unix?","content":"<p> Perché Unix ha il suo concetto di tempo? Qual è l&#39;epoca e qual è il problema Y2038? </p> <p> L&#39;ora Unix è un mezzo per rappresentare una data e un&#39;ora specifiche, utilizzato da Linux, macOS e molti altri sistemi interoperabili. È così diffuso che probabilmente lo stai usando senza esserne consapevole. Una volta compreso il tempo di Unix, tuttavia, lo individuerai in molti contesti. Diversi strumenti possono aiutarti a lavorare con il tempo di Unix. </p> <h2 id=\"what-is-the-purpose-of-unix-time\"> Qual è lo scopo di Unix Time? </h2> <p> Il tempo Unix è un conteggio dei secondi totali tra un&#39;ora e una data fisse. È un formato di data/ora (o timestamp) che ha un aspetto diverso dalle date e dalle ore leggibili a cui siamo abituati. Questo è puramente per motivi di efficienza. Ci vuole molto meno spazio per memorizzare un singolo numero che rappresenta i secondi di quanto non faccia per memorizzare valori separati per l&#39;anno, il mese, l&#39;ora, ecc. </p> <p> Ovviamente, in termini moderni, la differenza di spazio non è affatto così grande. Ma considera che Unix è nato alla fine degli anni &#39;60, quando lo spazio di archiviazione disponibile era molto più piccolo. Anche i timestamp sono molto usati, quindi il loro spazio di archiviazione si somma. Ad esempio, a ogni file sono associati tre timestamp. </p> <p> Il formato è praticamente impossibile da tradurre nella tua testa a meno che tu non sia un genio della matematica. Ma ha ancora alcuni vantaggi rispetto ad alternative più leggibili come <strong> Mer 21 Ott 2015 07:28:00 GMT </strong> . Puoi ordinare due timestamp Unix molto facilmente, a colpo d&#39;occhio. Di solito è anche più veloce calcolare la differenza tra due timestamp. Ciò è particolarmente vero per le date ravvicinate, ad esempio nei giorni adiacenti. </p> <p> <img alt=\"A screenshot from the Epoch Converter site showing Unix Time\" src=\"images/epoch-converter-110.png\" loading=\"lazy\"> </p> <h3 id=\"about-the-epoch\"> A proposito dell&#39;Epoca </h3> <p> Quindi, il tempo Unix è un conteggio totale di secondi da un momento specifico. Ma qual è quel momento? Suo <strong> 00:00:00 UTC </strong> sopra <strong> 1 gennaio 1970 </strong> . Questo è spesso indicato come Unix Epoch. I programmatori hanno scelto questa data per l&#39;epoca per comodità poiché era la data rotonda più vicina quando hanno inventato il tempo di Unix. </p> <p> Potresti aver visto questa data quando qualcosa è andato storto. È chiaramente un bug, ma sembra molto strano quando risulta in una data precedente alla nascita di molti di noi! È completamente comprensibile, tuttavia, quando conosci il tempo di Unix. Se un sistema sta cercando di visualizzare un timestamp che non ha alcun valore, spesso si tradurrà in 0 e risulterà nella data dell&#39;epoca esatta. </p> <p> </p> <h2 id=\"the-unix-time-data-format\"> Il formato dei dati temporali di Unix </h2> <p> A rigor di termini, non ce n&#39;è uno. Il tipo di dati originale era un intero a 32 bit, e questo spesso rimane il caso, anche in sistemi molto più potenti. </p> <p> Questo tipo di dati consente al valore di memorizzare un totale di 2^32 secondi, ovvero poco più di 136 anni. Questo valore è in genere firmato, il che significa che può essere negativo o positivo. Quindi, di solito rappresenta 68 anni su entrambi i lati dell&#39;epoca, cioè 1902-2038. </p> <p> Questo è ancora un periodo limitato, ovviamente. Ma l&#39;uso principale del formato timestamp era per concetti come la modifica dei file. La necessità era davvero quella di rappresentare il tempo vicino al presente, piuttosto che la storia antica o lontano nel futuro. Anche per applicazioni come i calendari, raramente è necessario rappresentare le date a più di qualche decennio nel futuro. </p> <p> Ma questo non significa che questo lasso di tempo limitato sia senza problemi... </p> <h3 id=\"the-year-2038-problem\"> Il problema dell&#39;anno 2038 </h3> <p> Il bug dell&#39;anno 2000 ( <a href=\"https://www.makeuseof.com/tag/worst-programming-mistakes-in-history/\" target=\"_blank\" rel=\"nofollow noopener\"> uno dei peggiori errori di programmazione della storia </a> ) interessavano i sistemi informatici che memorizzavano gli anni come valori a due cifre. Quando arrivò l&#39;anno 2000, tali sistemi lo trattarono come se fosse il 1900. In effetti, non fu così catastrofico come temuto, principalmente perché molte persone hanno speso molto tempo e sforzi in anticipo, preparandosi per questo. </p> <p> Se stavi prestando attenzione nella sezione precedente, potresti aver individuato un problema simile che potrebbe influire sul tempo di Unix. Ebbene, il tempo di Unix ha un suo problema con i dati: il problema Y2k38. (Spesso viene definito un problema, non un bug; forse siamo diventati più ottimisti dall&#39;anno 2000!) Quando il tempo di Unix si esaurirà letteralmente nel 2038, i sistemi tratteranno le nuove date come 1902 o 1970. O forse &#39; fallirò del tutto. </p> <p> Almeno questo problema non ci colpirà allo scoccare della mezzanotte di Capodanno. L&#39;ultimo secondo del tempo Unix a 32 bit cadrà il 19 marzo. Nell&#39;eventualità, probabilmente aggiorneremo la maggior parte dei sistemi entro il 2038 o comunque saranno obsoleti per allora. </p> <p> </p> <h2 id=\"some-useful-timestamp-resources\"> Alcune utili risorse di timestamp </h2> <p> Il <a href=\"https://www.epochconverter.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Convertitore d&#39;epoca </a> site è forse il convertitore di timestamp più completo disponibile. Inizia visualizzando l&#39;ora corrente di Unix, in tempo reale, e aggiunge quasi tutte le funzionalità immaginabili. Il suo utilizzo principale è per la conversione tra timestamp e date leggibili dall&#39;uomo, in entrambe le direzioni. </p> <p> Dan&#39;s Tools è una vasta raccolta di utili app web, una delle quali è un <a href=\"https://www.unixtimestamp.com/index.php\" target=\"_blank\" rel=\"nofollow noopener\"> convertitore di marca temporale </a> . È più semplice, ma ha una presentazione molto pulita ed è facile da usare. </p> <p> <a href=\"https://time.is/Unix_time_now\" target=\"_blank\" rel=\"nofollow noopener\"> Il tempo è </a> presenta un altro aspetto ancora più minimalista. Mostra l&#39;ora in diversi formati, incluso l&#39;ora Unix. Include l&#39;ora corrente nel titolo della pagina, il che è utile. </p> <p> <img alt=\"A screenshot of the Time.is websites showing Unix Time\" src=\"images/time-is-177.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"using-unix-time-with-command-line-tools\"> Utilizzo di Unix Time con gli strumenti della riga di comando </h2> <p> Su Linux e macOS, il <strong> Data </strong> Il programma è l&#39;utilità principale per gestire data/ora, inclusi i timestamp Unix. Chiamato senza argomenti, restituisce la data/ora corrente in un formato leggibile dall&#39;uomo: </p> <pre><code class=\"hljs ruby\">$ date<br>Wed Feb 10 12:28:30 GMT 2021</code></pre> <p> Se hai bisogno della data/ora corrente in Unix time, usa il use <strong> +%s </strong> discussione: </p> <pre><code class=\"hljs ruby\">$ date +%s<br>1612960114</code></pre> <p> Puoi convertire da una data leggibile dall&#39;uomo in un timestamp utilizzando il <strong> -d </strong> segnala se la tua versione di <strong> Data </strong> lo supporta. La maggior parte delle versioni di Linux dovrebbe, per impostazione predefinita: </p> <pre><code class=\"hljs ruby\">$ date -d \"Jan 2 1970\" +%s<br>82800</code></pre> <p> Su macOS, <strong> Data </strong> è un programma diverso, che richiede un diverso insieme di flag: </p> <pre><code class=\"hljs perl\">$ date -j -f \"%b %d %Y %T\" \"Jan 02 1970 00:00:00\" \"+%s\"<br>82800</code></pre> <p> Andando nella direzione opposta, puoi convertire da un timestamp Unix usando il <strong> -r </strong> bandiera: </p> <pre><code class=\"hljs ruby\">$ date -r 1600000000<br>Sun 13 Sep 2020 13:26:40 BST</code></pre> <p> Alcuni altri programmi usano il <strong> %S </strong> formato per gestire il tempo di Unix. Ad esempio, se vuoi mostrare la data di modifica di un file in Unix time, con il tasto <a href=\"https://www.makeuseof.com/ls-command-linux/\" target=\"_blank\" rel=\"nofollow noopener\"> Versione Linux di <strong> ls </strong></a> , puoi utilizzare quanto segue: </p> <pre><code class=\"hljs perl\">$ ls -l --time-style=+%s index.tmp.html<br>-rw-r--r-- 1 ubuntu ubuntu 17862 1521649818 index.tmp.html</code></pre> <p> </p> <h2 id=\"how-to-use-unix-time-in-programming-languages\"> Come usare Unix Time nei linguaggi di programmazione </h2> <p> PHP ha il <strong> tempo() </strong> funzione che restituisce il timestamp Unix corrente. Suo <strong> Data() </strong> la funzione prende un timestamp come secondo argomento: </p> <pre><code class=\"hljs ruby\">$ php -r 'echo date(\"Y-m-d\", time());'<br>2021-02-11</code></pre> <p> JavaScript si avvicina alle cose in un modo interessante. Ha un <strong> Data.ora() </strong> metodo per ottenere il numero di millisecondi dall&#39;epoca di Unix. Naturalmente, puoi dividerlo per 1.000 e arrotondare il risultato per ottenere il tempo Unix equivalente in secondi: </p> <pre><code class=\"hljs perl\">> Math.floor(Date.now() / 1000)<br>1613083012</code></pre> <p> </p> <h2 id=\"understanding-unix-time\"> Capire Unix Time </h2> <p> Il tempo Unix è un concetto semplice che emerge in molti luoghi. Una volta compreso, potresti trovarlo molto utile, ad esempio nel calcolo delle differenze di orario. Puoi anche riconoscere quando potrebbe essere la causa di alcuni bug. </p> <p> Concetti come l&#39;epoca e i timestamp sono una parte importante per iniziare con Linux. Per saperne di più su elementi essenziali come <strong> ls </strong> , consulta la nostra guida ai comandi di base di Linux. </p>"}