{"title":"Come eseguire il loop di un video di YouTube","content":"<p> Vuoi mettere in loop un video di YouTube? Che si tratti della tua canzone preferita o di una compilation divertente, non è necessario ricaricare la pagina se vuoi ripetere un video di YouTube. </p> <p> Ti mostreremo come riprodurre in loop un video di YouTube su desktop e dispositivi mobili. </p> <h2 id=\"how-to-loop-a-youtube-video-on-desktop\"> Come riprodurre in loop un video di YouTube sul desktop </h2> <ol> <li> Vai al video che desideri riprodurre in loop. </li> <li> <strong> Fare clic con il pulsante destro del mouse </strong> il video (non intorno ad esso). Si aprirà il menu contestuale di YouTube. </li> <li> Clic <strong> Ciclo continuo </strong> . <p> <img alt=\"youtube video loop desktop\" src=\"images/youtube-video-loop-desktop-114.jpg\" loading=\"lazy\"> </p> </li> </ol> <p> Quando il video arriva alla fine, verrà eseguito automaticamente un loop. Per confermare che è abilitato, <strong> tasto destro del mouse </strong> il video e vedrai un segno di spunta accanto a <strong> Ciclo continuo </strong> (che puoi fare nuovamente clic per disabilitare). </p> <p> </p> <p> </p> <h2 id=\"how-to-loop-a-youtube-video-on-mobile\"> Come riprodurre in loop un video di YouTube su dispositivi mobili </h2> <p> Sfortunatamente, il loop di un video di YouTube sull&#39;app mobile non è così semplice come sul desktop. Invece, devi inserire il video in una playlist. Ecco come farlo: </p> <ol> <li> Vai al video che desideri riprodurre in loop. </li> <li> Sotto il video, tieni premuto il <strong> Salva </strong> pulsante. </li> <li> Rubinetto <strong> Nuova playlist </strong> . </li> <li> Inserisci un nome per la playlist, scegli a <strong> Privacy </strong> impostazione e toccare <strong> Creare </strong> . </li> <li> Rubinetto <strong> Vedi elenco </strong> per andare alla nuova playlist (o andare alla schermata iniziale dell&#39;app, toccare <strong> Biblioteca </strong> dal menu in basso e inserisci la tua playlist). </li> <li> Clicca il <strong> casuale </strong> icona (due frecce intrecciate). <p> <strong class=\"gallery__section-title\"> Galleria di immagini (3 immagini) </strong> <img alt=\"youtube android save\" src=\"images/youtube-android-save-686.jpg\" loading=\"lazy\"> Espandere <img alt=\"youtube android new playlist\" src=\"images/youtube-android-new-playlist-719.jpg\" loading=\"lazy\"> Espandere <img alt=\"youtube android repeat playlist\" src=\"images/youtube-android-repeat-playlist-472.jpg\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> </li> <li> Riproduci il video e tocca la freccia nell&#39;angolo in basso a destra del video. Da lì, tocca <strong> Ciclo continuo </strong> icona (due frecce che formano un rettangolo). </li> </ol> <p> Quando il video arriva alla fine, verrà eseguito automaticamente un loop. Ovviamente puoi anche aggiungere più video a questa playlist. </p> <p> </p> <h2 id=\"how-to-use-an-external-service-to-loop-a-youtube-video\"> Come utilizzare un servizio esterno per riprodurre in loop un video di YouTube YouTube </h2> <p> Se non vuoi utilizzare i metodi nativi di cui sopra per qualsiasi motivo, puoi anche utilizzare un servizio esterno chiamato <a href=\"https://www.youtuberepeater.com\" target=\"_blank\" rel=\"nofollow noopener\"> Ripetitore YouTube YouTube </a> . </p> <p> Per usarlo facilmente, vai al video di YouTube che desideri riprodurre in loop. Nella barra degli URL, sostituisci <strong> youtube.com </strong> con <strong> youtuberepeater.com </strong> , quindi vai a questo nuovo URL. </p> <p> Ad esempio, se volessi eseguire il ciclo <strong> youtube.com/watch?v=n9xhJrPXop4 </strong> , lo cambieresti in <strong> youtuberepeater.com/watch?v=n9xhJrPXop4 </strong> . </p> <p> Questo non funzionerà sui video in cui l&#39;autore del caricamento non ha consentito l&#39;incorporamento del video al di fuori di YouTube. Pertanto, l&#39;utilizzo di uno dei due metodi precedenti è la scelta ideale. </p>"}