{"title":"Come acquisire uno screenshot su un tablet Surface Pro","content":"<p> Fare uno screenshot è un&#39;abilità semplice ma essenziale su qualsiasi dispositivo. Sul tablet Surface Pro, puoi acquisire schermate utilizzando le scorciatoie da tastiera, lo strumento di cattura o persino la barra di gioco Xbox. Ti mostreremo come utilizzare tutti questi metodi per acquisire uno screenshot o persino una registrazione dello schermo sul tuo dispositivo Surface. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Acquisizione di uno screenshot utilizzando le combinazioni di pulsanti </h2> <p> Sulla linea di dispositivi Surface Pro, acquisire uno screenshot utilizzando le combinazioni di pulsanti è semplice e veloce. Per fare uno screenshot, tieni premuto il tasto <strong> Energia </strong> e <strong> Volume su </strong> chiave contemporaneamente. Lo schermo dovrebbe lampeggiare e lo screenshot dovrebbe essere salvato nella cartella screenshot sotto Immagini sul tuo dispositivo. </p> <p> Questo metodo funziona per la linea di dispositivi Surface Pro più recente (ad esempio Surface Pro 7+, Pro X), Surface Go, Surface Go 2 e la linea di dispositivi Surface Book. </p> <p> Se il tuo Surface è un modello precedente (Surface 3 o precedente), la combinazione di pulsanti è leggermente diversa. Devi premere il <strong> Pulsante Windows </strong> (non il tasto Windows sulla tastiera) e il <strong> Volume basso </strong> pulsante contemporaneamente. Il dispositivo salverà lo screenshot nella cartella Screenshot in Foto. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> Allo stesso modo, per acquisire uno screenshot su Surface Duo, tieni premuto il tasto <strong> Energia </strong> pulsante e il <strong> Volume basso </strong> chiave. Lo screenshot dovrebbe essere salvato nella galleria del tuo dispositivo in Screenshot. In alternativa, puoi semplicemente tenere premuto il <strong> Energia </strong> tasto e fare clic su <strong> Immagine dello schermo </strong> pulsante sullo schermo. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> Come acquisire uno screenshot di Surface Pro utilizzando le scorciatoie da tastiera </h2> <p> Le scorciatoie da tastiera sono un altro modo per catturare ciò che è sullo schermo. </p> <p> Queste scorciatoie da tastiera funzionano su tutti i dispositivi Windows, quindi dai un&#39;occhiata <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> altri metodi di screenshot su Windows 10 </a> . Le scorciatoie da tastiera funzionano meglio sulla linea di dispositivi Surface Laptop e Surface Book, ma ovviamente, se disponi dell&#39;accessorio per tastiera per il tuo dispositivo Surface Pro o Go, anche queste scorciatoie funzionano. </p> <h3 id=\"print-screen-methods\"> Metodi di stampa dello schermo </h3> <p> Per acquisire uno screenshot utilizzando il metodo Print Screen, basta premere il tasto <strong> Stampante </strong> pulsante sulla tastiera. Questo farà uno screenshot dell&#39;intero desktop. Tieni presente che questo non salverà lo screenshot su Surface ma lo aggiungerà agli appunti. Devi usare un programma come Microsoft Paint per incollare lo screenshot. </p> <p> premendo <strong> Alt + PrtScn </strong> prenderà uno screenshot solo della tua finestra corrente e allo stesso modo aggiungerà lo screenshot agli appunti. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Ritaglia e disegna </h3> <p> Questo è di gran lunga il metodo più semplice per acquisire uno screenshot sul dispositivo Surface. </p> <p> Per aprire Cattura e Disegna, premi il <strong> Tasto Windows + Maiusc + S, </strong> e una sovrapposizione dovrebbe apparire sullo schermo. Per acquisire uno screenshot completo, premi il pulsante Schermo intero nella parte superiore dell&#39;overlay. Per acquisire uno screenshot solo della finestra corrente, premi il pulsante Cattura finestra accanto al pulsante Schermo intero. </p> <p> Puoi anche fare uno screenshot di un&#39;area specifica dello schermo. Per impostazione predefinita, Cattura e Disegna ha lo Snip rettangolare. Trascina semplicemente sulla parte che desideri acquisire utilizzando il touchscreen o il trackpad. </p> <p> Cattura e Disegna ti darà una notifica nel pannello delle notifiche per dire che lo screenshot è stato copiato negli appunti. Se fai clic su di esso, puoi disegnare e disegnare su uno screenshot, se lo desideri. </p> <p> Per salvarlo nei tuoi file, usa <strong> Ctrl + S </strong> o il pulsante Salva nell&#39;angolo in alto a destra per salvare lo screenshot in una cartella specifica. </p> <h3 id=\"xbox-game-bar\"> Barra di gioco Xbox </h3> <p> Per acquisire uno screenshot utilizzando Xbox Game Bar, premi il tasto <strong> Tasto Windows + G </strong> per aprirlo. </p> <p> Da lì, puoi fare clic sulla scheda Catture e fare clic sul pulsante Fotocamera. Questo metodo ti consentirà anche di acquisire un video del tuo schermo con l&#39;audio. Le acquisizioni salvate verranno visualizzate nella cartella Video e nella sottocartella Acquisizioni. Su Xbox, puoi farlo allo stesso modo <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> cattura schermate e registrazioni </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Acquisizione di uno screenshot di Surface Pro utilizzando la penna per Surface </h2> <p> Per acquisire uno screenshot utilizzando la penna per Surface, fai semplicemente doppio clic sulla gomma e il tuo dispositivo dovrebbe visualizzare Cattura e Disegna dell&#39;intera finestra. Da qui, puoi disegnare ed esportare il tuo screenshot. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> Puoi anche accedervi cercando Windows Ink Workspace sul dock. Da qui, seleziona Cattura schermo intero. Puoi modificare le funzioni dei tasti di scelta rapida della penna per Surface cercando Impostazioni di Windows Ink Workspace e scorrendo verso il basso fino a Windows Ink Workspace. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Fare uno screenshot su Surface, reso semplice Made </h2> <p> Ora conosci tutti i vari metodi per acquisire uno screenshot o registrare lo schermo sul tuo dispositivo Surface. Le combinazioni di pulsanti sono il miglior modo tattile per acquisire uno screenshot se utilizzi Surface Pro o Surface Go, ma anche le scorciatoie da tastiera sono facili. </p>"}