{"title":"Come risolvere il BSOD VIDEO_TDR_FAILURE in Windows 10","content":"<p> L&#39;errore VIDEO_TDR_FAILURE indica che la scheda grafica è difettosa o che i driver dello schermo potrebbero essere obsoleti/non funzionanti. Ma potrebbero esserci altri motivi, come il surriscaldamento dei componenti o file di sistema corrotti. TDR è l&#39;abbreviazione di <strong> Timeout, rilevamento e ripristino </strong> , un metodo utilizzato da Windows per identificare e correggere i componenti software malfunzionanti. </p> <p> Se riscontri questo errore, non temere perché i seguenti metodi risolveranno l&#39;errore VIDEO_TDR_FAILURE più velocemente di quanto ti aspetteresti. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Aggiorna e reinstalla i driver dello schermo </h2> <p> Come accennato in precedenza, l&#39;errore è solitamente il risultato di driver di visualizzazione non funzionanti o obsoleti. Pertanto, dovresti aggiornare i driver della tua scheda grafica. Se ciò non risolve il problema, reinstallali. A seconda della tua scheda grafica, potresti incontrare nomi di file diversi relativi all&#39;errore. </p> <ol> <li> Per gli utenti Nvidia, è <strong> nvlddmkm.sys </strong> . Se sei un utente Nvidia, ecco qui <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 semplici modi per correggere l&#39;errore. </a> </li> <li> Per gli utenti AMD, l&#39;errore si presenta come <strong> atikmpag.sys </strong> . </li> <li> Per gli utenti Intel HD, l&#39;errore è <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> Come aggiornare i driver dello schermo </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> stampa <strong> Tasto Windows + R </strong> per aprire il comando Esegui. Digitare <strong> devmgmt.msc </strong> e premi Invio. </li> <li> Nel <strong> Gestore dispositivi </strong> finestra, vai a <strong> Adattatori per display </strong> ed espanderlo. </li> <li> Fare clic con il pulsante destro del mouse sulla scheda video, quindi selezionare <strong> Aggiorna driver </strong> . </li> <li> Selezionare <strong> Cerca automaticamente il software del driver aggiornato </strong> . </li> <li> Windows cercherà automaticamente nel Web e scaricherà i driver richiesti. Assicurati di avere una connessione Internet attiva mentre lo fai. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> Come reinstallare i driver dello schermo </h3> <p> Se il BSOD dell&#39;errore tdr video persiste dopo l&#39;aggiornamento dei driver dello schermo, è meglio reinstallare questi driver. È consigliabile farlo mentre Windows viene avviato in modalità provvisoria. Ma prima di farlo, dovresti andare al sito Web del produttore della tua scheda grafica e scaricare l&#39;ultima versione dei driver grafici. </p> <p> I produttori più comuni sono <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> , e <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intel </a> . </p> <p> Per avviare in modalità provvisoria, segui questi passaggi: </p> <ol> <li> stampa <strong> Tasto Windows + R, </strong> e nella finestra di dialogo Esegui, digita <strong> msconfig, </strong> e premi Invio. </li> <li> Nel <strong> Configurazione di sistema </strong> finestra, fare clic su <strong> Stivale </strong> scheda. </li> <li> Ora spunta il <strong> Modalità sicura </strong> casella di controllo situata verso il basso. </li> <li> Applica le impostazioni e riavvia il computer. </li> </ol> <p> Dopo l&#39;avvio in modalità provvisoria, è il momento di reinstallare i driver dello schermo. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> Nella barra di ricerca del menu Start, digita <strong> Gestore dispositivi </strong> e aprilo. </li> <li> Cercare <strong> Adattatori per display </strong> ed espandere il menu. </li> <li> Fare clic con il tasto destro sulla GPU e fare clic su <strong> Disinstalla dispositivo </strong> . </li> <li> Nella procedura guidata di disinstallazione, assicurati di controllare il <strong> Elimina il software del driver per questo dispositivo </strong> scatola. </li> <li> Attendi che Windows disinstalli il dispositivo e riavvii il computer. </li> <li> Ora reinstalla i driver grafici che hai scaricato in precedenza. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Usa SFC per scansionare e correggere i file di sistema </h2> <p> SFC è un&#39;utilità Windows integrata che può essere utilizzata per scansionare e riparare file di sistema corrotti. Nel caso di un BSOD, è molto probabile che alcuni file di sistema siano corrotti, quindi è indispensabile eseguire questa utility. È solo uno dei <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> diverse utili utilità disponibili </a> a disposizione di un utente Windows. </p> <p> Per eseguire SFC, segui questi passaggi: </p> <ol> <li> Nella barra di ricerca del menu Start, digita <strong> cmd </strong> . </li> <li> Fare clic con il tasto destro su <strong> Prompt dei comandi </strong> e seleziona <strong> Esegui come amministratore </strong> . </li> <li> Nella console, digita <strong> sfc /scannow </strong> e premi Invio. </li> <li> Al termine del processo di scansione e riparazione, riavvia il computer. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Esegui ripristino all&#39;avvio </h2> <p> Per gli utenti che ricevono l&#39;errore non appena avviano Windows 10 o subito dopo l&#39;accesso, la riparazione all&#39;avvio è una manna dal cielo. Questa funzionalità di Windows verifica la presenza di anomalie durante l&#39;avvio e le risolve immediatamente. </p> <p> Poiché questa sezione è rivolta agli utenti i cui computer sono stati resi inutilizzabili a causa dell&#39;errore, ovvero non possono aprire <strong> impostazioni </strong> , dovranno eseguire un riavvio forzato per accedere a Windows Recovery Environment (winRE). </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Segui questi passaggi per avviare l&#39;ambiente di ripristino di Windows: </p> <ol> <li> Tieni premuto il pulsante di accensione finché il PC non si spegne. </li> <li> Premi nuovamente il pulsante di accensione per avviare il PC. </li> <li> Ripeti il ​​primo e il secondo passaggio finché il PC non si avvia in modalità di ripristino. Sarà una schermata blu. </li> <li> Nella schermata di ripristino, fare clic su <strong> Visualizza le opzioni di riparazione avanzate </strong> . </li> <li> Nella schermata successiva, fai clic su <strong> Risoluzione dei problemi </strong> </li> <li> Clicca su <strong> Opzioni avanzate </strong> </li> <li> Clicca su <strong> Riparazione di avvio </strong> e inserisci le tue credenziali quando richiesto. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Modifica le impostazioni di risparmio energetico </h2> <p> Le impostazioni di risparmio energetico di Windows sono generalmente ben ottimizzate, ma a volte possono interferire con il modo in cui il computer gestisce la grafica. Ciò è particolarmente vero quando il computer ha una GPU discreta. Di seguito sono riportate le impostazioni ottimali per evitare di ottenere il VIDEO_TDR_FAILURE BSOD: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> Nella barra di ricerca del menu Start, digita <strong> Pannello di controllo </strong> e aprilo. </li> <li> Nella barra di ricerca del Pannello di controllo, inserisci &quot;opzioni risparmio energia&quot; e premi Invio. </li> <li> Clicca su <strong> Opzioni di alimentazione, </strong> e accanto al piano di alimentazione che stai utilizzando, fai clic su <strong> Modifica le impostazioni del piano. </strong> </li> <li> Clicca su <strong> Modifica le impostazioni avanzate di alimentazione. </strong> </li> <li> Cercare <strong> PCI E </strong><strong> xpress </strong> ed espanderlo. </li> <li> Gira il <strong> Gestione dell&#39;alimentazione dello stato del collegamento </strong> impostazione su <strong> spento </strong> . </li> <li> Salva le modifiche e riavvia il computer. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Pulisci il tuo computer </h2> <p> Il surriscaldamento non è mai una buona cosa e, di solito, il motivo è l&#39;accumulo di polvere. Si consiglia agli utenti di pulire ogni mese i componenti del PC dalla polvere. Ma fa attenzione. Dovrebbe essere fatto con delicatezza. </p> <p> Assicurati di pulire la parte superiore della scheda grafica, la ventola della CPU, l&#39;alimentatore e le ventole dell&#39;armadio. Tutto sommato, assicurati di evitare <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> errori di manutenzione che potrebbero danneggiare i componenti costosi. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Controlla i componenti hardware </h2> <p> Se l&#39;errore viene ancora visualizzato dopo aver provato tutto ciò che è elencato sopra, potrebbe esserci un errore nell&#39;hardware stesso. Gli utenti che dispongono di una scheda grafica dedicata dovrebbero rimuoverla e avviare il computer. Se l&#39;errore viene risolto, si tratta di un errore hardware nella GPU stessa. Potresti provare a contattare il produttore e provare a far sostituire l&#39;unità. </p> <p> </p> <p> Quando si utilizza la grafica integrata, provare a disabilitarla e avviare. Per disabilitarli, segui questi passaggi: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> stampa <strong> Tasto Windows +R, </strong> genere <strong> devmgmt.msc </strong> nella casella di testo Esegui e premere Invio. </li> <li> Nel <strong> Gestore dispositivi </strong> , cercare <strong> Adattatori per display </strong> ed espandere il menu. </li> <li> Fare clic con il pulsante destro del mouse sulla GPU integrata e fare clic su <strong> Disabilita dispositivo </strong> . </li> <li> Riavvia il computer e controlla se l&#39;errore è stato risolto. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> Errore &quot;Errore TDR video&quot; risolto con successo </h2> <p> Per la maggior parte degli utenti, un semplice aggiornamento o reinstallazione dei driver video risolverà il problema. Ma se il problema peggiora, potrebbe essere necessario ripristinare il PC o sostituire dell&#39;hardware. </p>"}