{"title":"Che cos&#39;è un driver per cuffie e in che modo influisce sul suono?","content":"<p> Le cuffie sono straordinari pezzi di tecnologia. </p> <p> Sono progettati per le persone comuni che ascoltano musica a letto o in viaggio e per i professionisti che hanno bisogno di un audio pulito per modificare musica e video. Esistono vari tipi di cuffie proprio per questo motivo. Che tu stia lavorando o mixando l&#39;audio per ore e ore, c&#39;è un paio di cuffie per te. </p> <p> All&#39;interno di queste cuffie sono <strong> autisti </strong> che variano drasticamente nelle dimensioni e sono realizzati in modo diverso in base a chi sono le cuffie. Questi driver, ovviamente, influenzano il suono che risuona nelle tue orecchie. </p> <h2 id=\"what-is-a-headphone-driver\"> Che cos&#39;è un driver per cuffie? </h2> <p> <img alt=\"Open Back Headphone Driver\" src=\"images/open-back-headphone-driver-548.jpg\" loading=\"lazy\"> </p> <p> Un driver per cuffie è essenzialmente un piccolo altoparlante che converte i segnali elettrici in suoni che possiamo sentire. Questi driver possono variare notevolmente in termini di dimensioni a seconda del tipo di cuffie e del loro utilizzo. </p> <p> Ad esempio, gli auricolari hanno driver molto piccoli che possono essere fino a 8 mm, mentre i driver più grandi hanno un diametro di circa 15 mm. Le cuffie over-ear hanno dimensioni un po&#39; più drastiche, da 20 mm fino a 70 mm. </p> <p> I driver delle cuffie sono costituiti da tre componenti: il <strong> magnete </strong> , <b> bobine vocali </b> , e il <strong> diaframma </strong> . </p> <ul> <li> Il <strong> magnete </strong> crea un campo magnetico ed è solitamente costituito da cobalto o ferrite. </li> <li> <strong> Bobine vocali </strong> permettere alle correnti elettriche di attraversarli, muovendo il diaframma per poi generare suoni che possiamo udire. Queste bobine, solitamente costituite da vari tipi di rame, aiutano a convertire i segnali elettrici in suoni. </li> <li> Il <strong> diaframma </strong> vibra, producendo onde sonore dalle correnti elettriche che passano attraverso le bobine mobili. </li> </ul> <p> </p> <h2 id=\"types-of-headphone-drivers\"> Tipi di driver per cuffie </h2> <p> Non tutti i driver funzionano esattamente allo stesso modo, alcuni producono un audio migliore di altri a seconda dei materiali utilizzati e del processo e della tecnica ingegneristici. </p> <h3 id=\"dynamic-drivers\"> Driver dinamici </h3> <p> <img alt=\"Bose Headphones which use a type of Dynamic Driver\" src=\"images/dynamic-driver-415.jpg\" loading=\"lazy\"> </p> <p> Il tipo più comune di driver per cuffie è il <strong> conducente dinamico dynamic </strong> . Questi driver funzionano come spiegato sopra. Quando il diaframma vibra, sposta l&#39;aria intorno a sé, creando il suono che stai ascoltando. Maggiore è lo spostamento d&#39;aria, maggiore è il volume prodotto. Questo spostamento d&#39;aria aiuta anche a creare una risposta dei bassi realistica. </p> <p> I driver dinamici sono ottimi per produrre basse frequenze, che a volumi più alti possono provocare una distorsione armonica che non suona molto bene alle nostre orecchie. Questi driver non sono tutti male, tuttavia, poiché sono economici da produrre, risultando in cuffie meno costose per il consumatore, oltre ad essere più facili da alimentare. Non tutti i driver dinamici sono creati allo stesso modo, poiché la loro qualità del suono può variare a seconda delle loro custodie e dei materiali utilizzati. </p> <h3 id=\"balanced-armature-drivers\"> Driver con armatura bilanciata </h3> <p> <img alt=\"Apple wired earbuds, which use a balanced armature driver\" src=\"images/apple-wired-earbuds-which-use-a-balanced-armature-driver-119.jpg\" loading=\"lazy\"> </p> <p> <strong> Driver con armatura bilanciata </strong> sono piccoli e si trovano principalmente negli auricolari. Questi driver sono costituiti da un braccio all&#39;interno delle bobine con due magneti su entrambi i lati. Ciò consente al braccio di ruotare verso entrambi i magneti, diventando bilanciato e spostando il diaframma per produrre il suono. A causa del modo in cui funziona il driver, non sposta l&#39;aria come il driver dinamico, con conseguente mancanza di bassi. </p> <p> I driver con armatura bilanciata mancano anche di prese d&#39;aria aggiuntive che aiutano a migliorare l&#39;isolamento acustico. Come con ogni driver, la qualità del suono può variare in base a come sono progettati gli auricolari dentro e fuori. Alcuni produttori possono anche aggiungere un driver dinamico per creare un suono più ricco con una migliore risposta dei bassi. </p> <p> </p> <h3 id=\"planar-magnetic-drivers\"> Driver magnetici planari </h3> <p> <img alt=\"Open Back Headphones using Planar Magnetic Drivers\" src=\"images/open-back-headphones-using-planar-magnetic-drivers-408.jpg\" loading=\"lazy\"> </p> <p> <strong> Driver magnetici planari </strong> si trovano in genere nelle cuffie aperte e di solito hanno un prezzo più alto rispetto ai driver dinamici. Invece di utilizzare bobine vocali, i driver magnetici planari tentano di far vibrare uniformemente il diaframma dai magneti su entrambi i lati per produrre il suono. Poiché questi driver utilizzano magneti più grandi o multipli per far vibrare uniformemente il diaframma, queste cuffie tendono ad essere un po&#39; più pesanti. </p> <p> Le cuffie aperte hanno anche più perdite di suono rispetto a un normale paio di cuffie chiuse che utilizzano driver dinamici, poiché i driver sono completamente aperti senza nulla che li copra. Questo non li rende la scelta migliore per ascoltare musica in pubblico; tuttavia, sono fantastici per l&#39;uso domestico proprio per questo motivo. </p> <p> Una maggiore dispersione del suono si verifica a causa di un maggiore spostamento d&#39;aria, offrendo un suono più pieno con un&#39;eccellente risposta dei bassi, rendendoli perfetti per l&#39;uso domestico </p> <h3 id=\"electrostatic-drivers\"> Driver elettrostatici </h3> <p> <img alt=\"Open Back Headphones That Require an Amplifier\" src=\"images/open-back-headphones-that-require-an-amplifier-271.jpg\" loading=\"lazy\"> </p> <p> <strong> elettrostatico </strong><strong> autisti </strong> sono più rari a causa del loro prezzo elevato e degli usi di nicchia e si trovano principalmente nelle cuffie aperte. </p> <p> Questi driver utilizzano l&#39;elettricità statica per aiutare a produrre il suono. Il diaframma viene tirato avanti e indietro tra due piastre conduttive di carica opposta, consentendo un cambiamento continuo nei segnali elettrici, producendo un suono privo di distorsioni. Simile ai driver magnetici planari, questo design consente anche un maggiore spostamento dell&#39;aria, lasciando all&#39;ascoltatore un suono migliore dei bassi. </p> <p> A causa del modo in cui funzionano i driver elettrostatici, richiedono segnali ad alta tensione, che richiedono di utilizzarli con un amplificatore. Questi segnali sono irraggiungibili nella maggior parte dei jack per cuffie di livello consumer, così come anche in alcuni amplificatori professionali. Per utilizzare le cuffie con driver elettrostatici, avrai bisogno di un amplificatore elettrostatico, che è molto costoso. </p> <p> </p> <p> Sebbene i driver elettrostatici forniscano un&#39;eccellente scena sonora con poca distorsione, è meglio optare per un altro paio di cuffie aperte che utilizzano driver magnetici planari. Questi ti daranno un&#39;esperienza di ascolto simile ai driver elettrostatici ma costeranno meno e sono più facili da usare. </p> <p> </p> <h2 id=\"which-headphone-driver-should-you-get\"> Quale driver per cuffie dovresti ottenere? </h2> <p> <img alt=\"Razer Gaming Headphones\" src=\"images/razer-gaming-headphones-992.jpg\" loading=\"lazy\"> </p> <p> Le cuffie sono progettate per molti tipi diversi di persone. Se sei un musicista che usa solo le cuffie a casa per mixare l&#39;audio, forse dovresti scegliere un paio di cuffie aperte con un driver magnetico planare. </p> <p> Se sei un corridore, acquistare un paio di grandi cuffie aperte sul retro potrebbe non essere la scelta migliore per te. È qui che gli auricolari con driver di armatura bilanciati piccoli ma dal suono eccezionale torneranno utili. Ci sono un paio di cuffie dal suono brillante costruite apposta per te. Ora è il momento di trovarli. </p>"}