{"title":"Come ripristinare i consigli di Apple Music","content":"<p> Apple Music possedeva un modo facilmente accessibile per ri-curare i tuoi consigli musicali riselezionando i tuoi artisti e generi musicali preferiti. Sfortunatamente, durante un aggiornamento dell&#39;app, Apple ha rimosso questo metodo per aggiornare la cura della tua musica. </p> <p> Non temere, ecco una guida sui metodi alternativi per interrompere o ripristinare i suggerimenti automatici di Apple Music. </p> <h2 id=\"apple-music-recommendations-explained\"> Spiegazione dei consigli di Apple Music </h2> <p> Quando avvii inizialmente il tuo account Apple Music per la prima volta, ti chiede di selezionare i tuoi preferiti da un ampio elenco di generi musicali e artisti. Questa cura è il modo in cui Apple Music suggerirà playlist, album, artisti e brani in futuro. </p> <p> Ad esempio, se dovessi selezionare Classic Rock, New Rock e Foo Fighters come alcune delle tue scelte musicali preferite, Apple Music probabilmente suggerirebbe stazioni di ascolto molto simili e promuoverà la musica rock rilasciata di recente. </p> <p> Le modifiche all&#39;app significano che ora puoi curare le tue preferenze musicali solo durante la creazione dell&#39;account iniziale, non puoi ripristinarle in un secondo momento, anche se Apple Music continuerà a modificare i suoi suggerimenti in base alle tue abitudini di ascolto. </p> <p> Questo è solo uno dei tanti utili <a href=\"https://www.makeuseof.com/tag/apple-music-features-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Funzionalità di Apple Music da utilizzare </a> . </p> <p> Non preoccuparti, ci sono ancora alcuni modi per ripristinare la cura di Apple Music disabilitando le preferenze dell&#39;ID Apple o eliminando e ricreando il tuo account Apple Music. </p> <p> Entrambe le opzioni hanno vantaggi e svantaggi, quindi cerchiamo di capire qual è l&#39;opzione migliore per te. </p> <p> </p> <h2 id=\"turn-off-personalized-recommendations\"> Disattiva i consigli personalizzati </h2> <p> Disattivare i consigli personalizzati per il tuo ID Apple è un buon modo per smettere di vedere nuovi suggerimenti in futuro. </p> <p> La disattivazione di questa opzione non rimuoverà i tuoi dati di cura esistenti, il che significa che l&#39;app continuerà a creare suggerimenti in base al tuo utilizzo. Semplicemente non li vedrai più. La disattivazione dei consigli personalizzati influirà anche sui tuoi consigli in altre app di servizi Apple, come Apple Books. </p> <p> Ecco come disabilitare i consigli personalizzati su un iPhone: </p> <ol> <li> Apri il <strong> Apple Music Apple </strong> app. </li> <li> Vai al <b> Ascolta ora </b> scheda. </li> <li> Apri il tuo profilo Apple Music selezionando l&#39;icona circolare con la sagoma di una persona nell&#39;angolo in alto a destra dello schermo. Se hai precedentemente caricato un&#39;immagine come immagine del profilo personale, questa apparirà al posto della silhouette. </li> <li> Selezionare <b> Visualizza l&#39;identificativo Apple </b> che può essere individuato scorrendo fino alla fine del <b> account </b> pagina. </li> <li> Spegni <b> Raccomandazioni personalizzate </b> . </li> <li> Selezionare <b> Fatto </b> nell&#39;angolo in alto a destra e hai finito. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galleria di immagini (3 immagini) </strong> <img alt=\"Apple Music Lisen Now featuring Halle x Chloe\" src=\"images/apple-music-listen-now-page-713.jpg\" loading=\"lazy\"> Espandere <img alt=\"Apple Music Account Options Screenshot\" src=\"images/apple-music-account-page-914.jpg\" loading=\"lazy\"> Espandere <img alt=\"Apple ID Options Screenshot\" src=\"images/apple-id-account-page-817.jpg\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> <p> Dopo averlo fatto, qualsiasi nuova ricerca, download o riproduzione di musica in Apple Music non influenzerà più i tuoi suggerimenti automatici. Questo non cancellerà automaticamente le tue ricerche precedenti, il che significa che potrebbe volerci un po&#39; di tempo per notare gli effetti di questo metodo. </p> <p> </p> <h2 id=\"delete-your-apple-music-profile\"> Elimina il tuo profilo Apple Music </h2> <p> Se hai bisogno di un restyling completo di Apple Music con nuovi suggerimenti musicali, l&#39;opzione migliore è eliminare e ricreare il tuo profilo Apple Music. </p> <p> È importante notare che l&#39;eliminazione del tuo profilo rimuoverà completamente la tua libreria musicale attuale. La creazione di un nuovo profilo ti consentirà di selezionare tutte le nuove preferenze di musica e genere, ma rimuoverà anche completamente qualsiasi cronologia precedente di Apple Music. </p> <p> </p> <p> Se sei interessato a un nuovissimo profilo Apple Music con nuovi preferiti selezionati, segui questi passaggi per crearne uno: </p> <ol> <li> Dal <strong> Ascolta ora </strong> scheda, vai su Apple Music <strong> account </strong> e selezionare <b> Vedi profilo </b> . </li> <li> Selezionare <b> modificare </b> al centro dello schermo sotto il tuo nome. </li> <li> Scorri fino alla parte inferiore dello schermo e seleziona <b> Elimina profilo </b> . Attenzione, si tratta di un&#39;eliminazione permanente che richiederà il ripristino dell&#39;account. </li> <li> Configura un nuovo profilo Apple Music per te stesso che ora è libero dalle tue vecchie selezioni. Se hai disattivato i Consigli personalizzati come descritto nella sezione precedente, non riceverai più suggerimenti musicali personalizzati. In partenza <strong> Raccomandazioni personalizzate </strong> on farà sì che Apple Music suggerisca musica in base alle tue nuove abitudini di ascolto. </li> <li> Naviga liberamente e goditi una vasta gamma di opzioni audio appena selezionate. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galleria di immagini (2 immagini) </strong> <img alt=\"Apple Music Profile feat Halle x Chloe\" src=\"images/apple-music-profile-page-771.jpg\" loading=\"lazy\"> Espandere <img alt=\"Apple Music Profile Options Screenshot\" src=\"images/apple-music-edit-profile-page-450.jpg\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> <p> </p> <h2 id=\"spotify-s-recommendations-might-be-better\"> I consigli di Spotify potrebbero essere migliori </h2> <p> Se non sei ancora soddisfatto dei consigli di Apple Music anche dopo aver creato un nuovo profilo, potrebbe essere il momento di cambiare piattaforma di streaming musicale. Apple Music e Spotify hanno molte caratteristiche molto simili, ma molte persone ritengono che Spotify sia di gran lunga superiore nel suggerire nuova musica. </p> <p> Naturalmente, ci sono anche molti altri fattori da considerare quando si sceglie tra Apple Music e Spotify. </p>"}