{"title":"Come risolvere l&#39;utilizzo elevato della CPU dell&#39;eseguibile del servizio antimalware su Windows 10","content":"<p> Se il tuo computer sembra lento o non risponde, è meglio controllare se qualche processo sta consumando la memoria e la CPU. È probabile che il processo possa essere l&#39;eseguibile del servizio antimalware. Questo problema comune si verifica quando Windows Defender non è stato configurato correttamente o nel sistema è presente malware che interferisce con il suo funzionamento. </p> <p> Ecco come correggere il bug di utilizzo elevato della CPU dell&#39;eseguibile del servizio antimalware su Windows 10. </p> <h2 id=\"optimize-windows-defender-scheduling-options\"> 1. Ottimizza le opzioni di pianificazione di Windows Defender </h2> <p> L&#39;eseguibile del servizio antimalware comporta un utilizzo elevato della CPU quando è pianificata l&#39;esecuzione di una scansione completa del sistema a intervalli regolari. È meglio riprogrammare queste scansioni in un momento in cui è meno probabile che tu tenti attività che richiedono un uso intensivo della CPU o forse addirittura utilizzi il tuo computer. </p> <p> Ecco come modificare la pianificazione di Windows Defender: </p> <ol> <li> Nella barra di ricerca del menu Start, digita &quot;programma di pianificazione&quot; e fai clic su <strong> Agenda </strong> . </li> <li> Nel riquadro di navigazione a sinistra, vai a <strong> Libreria Utilità di pianificazione &gt; Microsoft &gt; Windows &gt; Windows Defender </strong> . Puoi farlo espandendo ciascuna delle suddette librerie. </li> <li> Nel <strong> Windows Defender </strong> libreria, fare doppio clic su <strong> Scansione pianificata di Windows Defender </strong> nel riquadro centrale. </li> <li> Sotto il <strong> Condizioni </strong> scheda, deseleziona tutte le opzioni e fai clic su OK. Questo rimuove tutte le scansioni pianificate. </li> </ol> <p> <img alt=\"Windows Defender Scheduled scan entry in Task Scheduler\" src=\"images/windows-defender-scheduled-scans-807.jpg\" loading=\"lazy\"> </p> <h3 id=\"create-new-scheduled-scans\"> Crea nuove scansioni pianificate </h3> <p> Gli utenti dovrebbero creare nuove scansioni pianificate in modo che il loro computer rimanga protetto. È meglio personalizzarlo in base alle proprie esigenze. Potresti programmarli in momenti in cui sai che non svolgerai attività pesanti per la CPU. Ma la frequenza dovrebbe essere almeno una volta alla settimana. </p> <p> Per creare una nuova pianificazione di Windows Defender, segui questi passaggi: </p> <ol> <li> Aperto <strong> Agenda </strong> e ancora una volta vai a <strong> Libreria Utilità di pianificazione &gt; Microsoft &gt; Windows &gt; Windows Defender </strong> </li> <li> Doppio click <strong> Windows Defender pianificato </strong><strong> Scansione </strong> . </li> <li> Sotto il <strong> Trigger </strong> scheda, fare clic su <strong> Nuovo </strong> . </li> <li> Qui puoi scegliere la frequenza con cui verrà eseguita la scansione. </li> <li> Applica le impostazioni ed esci. </li> </ol> <p> <img alt=\"Adding a new trigger toWindows Defender Scheduled scan using Task Scheduler\" src=\"images/new-trigger-defender-513.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-windows-defender-to-its-own-exclusion-list\"> 2. Aggiungi Windows Defender al proprio elenco di esclusione </h2> <p> Quando si esegue una scansione completa del sistema, Windows Defender esamina ogni singolo file sul sistema. Questo include se stesso che può causare alcuni problemi, più comunemente prestazioni del sistema lente. Gli utenti possono impedirlo aggiungendo l&#39;eseguibile del servizio antimalware all&#39;elenco di esclusione di Windows Defender. </p> <p> Questo può essere fatto seguendo questi passaggi: </p> <ol> <li> stampa <strong> CTRL+MAIUSC+ESC </strong> per lanciare il <strong> Task Manager </strong> . </li> <li> Sotto il <strong> Processi </strong> scheda cerca <strong> Eseguibile del servizio antimalware. </strong> Fare clic con il pulsante destro del mouse e selezionare <strong> Aprire la destinazione del file </strong> . </li> <li> Nella barra degli indirizzi situata in alto in Esplora risorse, copia il percorso del file (CTRL + C). </li> <li> Nella barra di ricerca del menu Start, inserisci &quot;Sicurezza di Windows&quot; e apri l&#39;app. Ha un&#39;icona a forma di scudo blu. </li> <li> Clicca su <strong> Protezione da virus e minacce </strong> e successivamente cliccare su <b> Gestisci le impostazioni </b> . </li> <li> Scorri verso il basso finché non trovi <strong> Esclusioni </strong> e poi clicca su <strong> Aggiungi o rimuovi esclusioni </strong> . </li> <li> Clicca su <strong> Aggiungi un&#39;esclusione </strong> quindi fare clic su File. </li> <li> Nella barra degli indirizzi della finestra Esplora file, incolla il percorso che avevi copiato in precedenza (CTRL + V). </li> <li> Cercare <strong> MsMpEng.exe </strong> e fare clic su Apri. </li> <li> Il file verrà ora escluso da tutte le future scansioni di Windows Defender. </li> </ol> <p> <img alt=\"Adding an entry to windows defender exclusion list\" src=\"images/windows-defender-exclusion-add-843.jpg\" loading=\"lazy\"> </p> <p> </p> <p> </p> <h2 id=\"repair-corrupt-windows-defender-files-using-sfc\"> 3. Ripara i file corrotti di Windows Defender usando SFC </h2> <p> SFC è un&#39;utilità Windows integrata che esegue automaticamente la scansione e la correzione di eventuali file di sistema danneggiati. Questo è ciò che aiuterà a riparare i file corrotti di Windows Defender. </p> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-224.jpg\" loading=\"lazy\"> </p> <p> Per utilizzarlo, procedi come segue: </p> <ol> <li> Nella barra di ricerca del menu Start, digita <strong> cmd </strong> e apri <strong> Prompt dei comandi </strong> . </li> <li> Nella console, digita <strong> sfc /scannow </strong> e premi Invio. </li> <li> Windows impiegherà del tempo per eseguire la scansione e riparare i file di sistema corrotti, inclusi quelli di Windows Defender. </li> </ol> <p> </p> <h2 id=\"disable-windows-defender\"> 4. Disabilita Windows Defender </h2> <p> Quando tutto il resto fallisce, è il momento di disabilitare del tutto Windows Defender. Prima di farlo assicurati di <a href=\"https://www.makeuseof.com/tag/best-antivirus-for-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> scaricare e installare software antivirus di terze parti </a> per mantenere il tuo computer al sicuro. </p> <p> Per disabilitare Windows Defender, segui questi passaggi: </p> <ol> <li> Nella barra di ricerca del menu Start, digita Sicurezza di Windows e aprilo. </li> <li> Nella dashboard, fai clic su <strong> Protezione da virus e minacce </strong> e poi clicca su <strong> Gestisci impostazioni </strong> . </li> <li> Interruttore <strong> Protezione in tempo reale </strong> a spento. </li> <li> Esci e riavvia il computer. </li> </ol> <p> <img alt=\"Disable Windows Defender Protection Temporarily\" src=\"images/disable-windows-defender-protection-temporarily-744.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-clean-boot-to-check-whether-a-third-party-app-may-be-responsible\"> 5. Utilizza un avvio parziale per verificare se un&#39;app di terze parti può essere      Responsabile </h2> <p> A volte, le applicazioni di terze parti possono interferire con i processi di sistema. È anche possibile che il software di terze parti venga interpretato erroneamente come malware. Per escludere app di terze parti come causa del problema, gli utenti dovrebbero eseguire un avvio pulito. </p> <p> Ecco i passaggi su come procedere: </p> <ol> <li> stampa <strong> Tasto Windows + R </strong> per aprire il comando Esegui. genere <strong> msconfig </strong> e premi Invio. </li> <li> Nel <strong> Configurazione di sistema </strong> finestra, vai a <strong> </strong><strong> Servizi </strong> . </li> <li> Controlla il <strong> Nascondi tutti i servizi Microsoft </strong> opzione. Quindi procedere alla verifica di tutti i servizi nell&#39;elenco. </li> <li> Clicca su <strong> Disabilitare tutto </strong> . </li> <li> Salva ed esci. </li> <li> Ora aperto <strong> Task Manager </strong> premendo <strong> CTRL+MAIUSC+ESC </strong> . </li> <li> Sotto il <strong> Avviare </strong> scheda, fare clic su ogni servizio uno per uno e fare clic su <strong> disattivare </strong> . </li> <li> Esci e riavvia il computer. </li> </ol> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-853.png\" loading=\"lazy\"> </p> <p> Il computer si avvierà ora con tutte le applicazioni di terze parti disabilitate. Gli utenti dovrebbero verificare se hanno ancora il problema e, in caso contrario, è meglio disinstallare tutte le applicazioni installate di recente poiché sono i colpevoli. </p> <p> </p> <h2 id=\"check-for-malware-using-third-party-antivirus\"> 6. Verifica la presenza di malware utilizzando antivirus di terze parti </h2> <p> Esistono virus che colpiscono direttamente Windows Defender e possono interromperne il funzionamento o disabilitarlo del tutto. In questi casi, l&#39;unica soluzione è eseguire la scansione del computer utilizzando un software antivirus di terze parti. </p> <p> Ma prima, per assicurarti che Windows Defender sia stato effettivamente infettato, controlla e verifica se la protezione in tempo reale viene disabilitata automaticamente. Ricorda, dovresti sempre assicurarti che <a href=\"https://www.makeuseof.com/easy-ways-boost-security-microsoft-defender-and-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows Defender sta lavorando al suo massimo potenziale. </a> </p> <p> In alcuni casi, gli utenti hanno segnalato di non essere in grado di rimuovere i file infetti (rilevati dallo stesso Windows Defender) utilizzando Windows Defender. </p> <p> <img alt=\"Windows Defender dashboard displaying current threats\" src=\"images/current-threats-windows-defender-707.jpg\" loading=\"lazy\"> </p> <p> Per verificare questo problema, segui semplicemente questi passaggi: </p> <ol> <li> Nella barra di ricerca del menu Start, digita <strong> Sicurezza di Windows </strong> e avviare l&#39;applicazione. </li> <li> Nella dashboard, fai clic su <strong> Protezione da virus e minacce </strong> . </li> <li> Sotto <strong> Minacce attuali, </strong> clicca su <strong> Protezione </strong><strong> storia </strong> . </li> <li> Sotto <strong> Minacce in quarantena </strong> , clicca su <strong> Vedi la cronologia completa </strong> . </li> <li> Ora fai clic su qualsiasi minaccia dall&#39;elenco e seleziona <strong> Rimuovere </strong> . </li> <li> Se Windows Defender rimuove il file, tutto funziona correttamente, ma se non è in grado di rimuovere il file o è presente un&#39;animazione di attesa infinita, Windows Defender è stato infettato. </li> </ol> <p> </p> <p> </p> <h2 id=\"fixing-the-antimalware-service-executable-high-cpu-usage-bug\"> Correzione del bug di utilizzo elevato della CPU eseguibile del servizio antimalware </h2> <p> L&#39;utilizzo dei suggerimenti di cui sopra migliorerà le prestazioni e la reattività del computer. Assicurati solo che il tuo computer non sia mai non protetto dal malware. Si consiglia di scaricare un altro software antivirus prima di disabilitare Windows Defender. </p>"}