{"title":"Come creare o modificare un motivo in Adobe Illustrator","content":"<p> Crea un motivo in Adobe Illustrator e puoi applicarlo rapidamente a forme, tratti e persino testo. Puoi creare qualcosa di semplice, come uno schema di punti, o fare qualcosa di più complesso. Puoi persino utilizzare una parte di un&#39;immagine vettoriale esistente e trasformarla anche in un motivo. </p> <p> I modelli sono ottimi per sfondi, trame e altro ancora. Ecco come utilizzare gli strumenti per i modelli di Illustrator e come creare e modificare i tuoi modelli. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Utilizzo dei modelli predefiniti in Adobe Illustrator </h2> <p> Illustrator viene fornito con diversi modelli incorporati. Oltre ad essere utili di per sé, sono anche un buon modo per vedere come funzionano i modelli. Questi modelli ti daranno anche un&#39;idea su come utilizzare i tuoi modelli una volta creati. </p> <p> </p> <p> Puoi trovare i modelli nella finestra Campioni. Se non è già aperto, vai su <strong> Finestra &gt; Campioni </strong> dal menu in alto. Oltre ai colori a tinta unita, potrebbero esserci già alcuni pattern nella finestra Campioni, ma questi non sono gli unici pattern di Illustrator. </p> <p> Clicca il <strong> Libreria campioni </strong> icona in basso a sinistra nella finestra Swatch. Passa il mouse sopra <strong> Modello </strong> , quindi scegli una delle librerie di campioni di pattern. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Ora puoi applicare questi campioni come faresti con i colori a tinta unita. Qui puoi vedere i modelli dal <strong> Nature_Foliage </strong> libreria applicata come riempimenti e tratti, oltre che al testo. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> Come creare un motivo ripetuto di base in Illustrator </h2> <p> Puoi trasformare qualsiasi vettore in un motivo, che sia qualcosa che hai già progettato o qualcosa che crei con questa intenzione specifica in mente. Puoi farlo con un&#39;intera grafica vettoriale, un singolo livello o qualsiasi altra via di mezzo. </p> <p> Tutto quello che devi fare è selezionare ciò che vuoi trasformare in un motivo, quindi trascinarlo nella finestra Campioni. Ad esempio, puoi trascinare questo occhio di gatto nei tuoi campioni. Ciò creerebbe un campione di pattern, che potresti quindi utilizzare per riempire un rettangolo o qualsiasi altra forma. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> In alternativa, potresti fare la stessa cosa con l&#39;intero vettore. In entrambi i casi, Illustrator creerà un motivo da qualsiasi cosa trascini nella finestra Campioni. Puoi semplicemente applicare il campione come faresti con qualsiasi normale campione di colore. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Se fai doppio clic sul campione di pattern nella finestra Campioni, si aprirà il <strong> Opzioni modello </strong> finestra. Puoi anche aprirlo direttamente da <strong> Finestre &gt; Opzioni modello </strong> nel menu in alto. </p> <p> Qui puoi modificare ulteriormente il tuo modello, incluso il modo in cui si ripete e quanto sono grandi gli spazi tra ogni iterazione dell&#39;immagine. Puoi anche modificare il tuo disegno del modello direttamente qui. La versione dell&#39;immagine che non è in grigio può essere modificata normalmente. Puoi cambiare i colori, spostare i livelli e così via. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> Ci sono varie cose che puoi fare con la finestra Opzioni modello. Ad esempio, puoi ripetere l&#39;immagine in un layout di mattoni sfalsati e ridurre lo spazio tra ciascuna parte del motivo. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> Avvicina abbastanza le parti del tuo disegno e puoi farle sovrapporre. In questo modo, puoi creare una sorta di motivo piastrellato come quello mostrato di seguito. Prova tutte le diverse impostazioni di sovrapposizione in Opzioni modello per trovare qualcosa che funzioni per te. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> Come creare un motivo senza interruzioni in Adobe Illustrator </h2> <p> Se vuoi creare un motivo geometrico senza soluzione di continuità, devi assicurarti che ci sia simmetria nel tuo disegno. Ad esempio, una linea che inizia 10px in alto sul lato sinistro del modello deve terminare 10px in alto sul lato destro. Quando si ripete, quei punti dovranno unirsi. </p> <p> Per fare ciò, crea un nuovo documento con dimensioni quadrate. Abilita la sovrapposizione della griglia premendo by <strong> Ctrl + &quot; </strong> ( <strong> Cmd + &quot; </strong> su Mac). Anche le guide intelligenti sono utili: abilitale con <strong> Ctrl + U </strong> ( <strong> Cmd + U </strong> su Mac). Se i tuoi righelli non sono visibili, premi <strong> Ctrl + R </strong> ( <strong> Cmd + R </strong> su Mac) per abilitarli. </p> <p> Puoi trovare queste impostazioni anche sotto <strong> Visualizza </strong> nel menu in alto, ma ti consigliamo di utilizzare <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Tasti di scelta rapida di Illustrator </a> dove puoi risparmiare tempo. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Disponi il tuo disegno nella piazza. Tutte le parti che superano i bordi dovranno essere allineate sull&#39;altro lato. Il <strong> Allineare </strong> attrezzo ( <strong> Finestra &gt; Allinea </strong> ) può aiutarti ad allineare le cose l&#39;una con l&#39;altra correttamente. Fai clic e trascina dai righelli per creare le tue guide dove ne hai bisogno. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> È importante avere anche un colore di sfondo, anche se è bianco. Assicurati che si adatti perfettamente ai bordi della tavola da disegno perché ne hai bisogno per tagliare il materiale superfluo. </p> <p> Seleziona tutto con <strong> Ctrl + A </strong> ( <strong> Cmd + LA </strong> su Mac), quindi premi <strong> Maiusc + M </strong> per attivare il <strong> Costruttore di forme </strong> attrezzo. Questo può essere trovato anche nella casella degli strumenti. tieni premuto <strong> Alt </strong> ( <strong> Opzione </strong> su Mac). Questo mette il <strong> Costruttore di forme </strong> strumento in modalità di sottrazione. </p> <p> Quando passi con il mouse su parti del tuo disegno con questo strumento, dovresti vederle cambiare leggermente colore. Fai clic sulle aree che non desideri e Illustrator rimuoverà quelle parti, lasciando solo i bit che si sovrappongono al quadrato di sfondo. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> Una volta fatto, seleziona tutto e trascinalo nei tuoi campioni per trasformarlo in un motivo. Per utilizzare il modello in un nuovo documento, puoi salvarlo in una libreria di campioni o utilizzare la libreria Adobe Cloud. </p> <p> In alternativa, puoi anche semplicemente copiarlo da questa finestra Swatch e incollarlo in un&#39;altra finestra Swatch su un documento diverso. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Ora puoi applicare questo modello come faresti con qualsiasi altro. Se lo hai fatto bene, tutto dovrebbe allinearsi senza spazi vuoti. Se necessario, apporta modifiche al documento del modello. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> Quando dovresti usare i modelli in Adobe Illustrator? </h2> <p> L&#39;uso più ovvio dei motivi è creare tessere ripetibili per gli sfondi, ma puoi usarle per riempire le forme per dare loro anche una consistenza. Il testo pieno di motivi è un altro buon uso e può far risaltare davvero la tua tipografia. </p> <p> Se lo desideri, puoi anche creare i tuoi modelli manualmente, copiando e incollando la stessa immagine più e più volte. Potrebbero esserci occasioni in cui vorrai farlo, ma la maggior parte delle volte, la capacità di Illustrator di automatizzare la creazione di modelli sarà la strada da percorrere. </p> <p> È solo uno dei tanti modi in cui Illustrator può semplificarti la vita, dandoti più tempo per lavorare sui tuoi progetti. </p>"}