{"title":"Dai un&#39;occhiata alla versione del browser di xCloud di Microsoft&amp;#","content":"<p> Se stai aspettando con impazienza notizie sulla porta del browser xCloud, allora oggi è il tuo giorno fortunato perché puoi dare un&#39;occhiata a come appare effettivamente. </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> I tester rivelano gli screenshot del browser xCloud </h2> <p> xCloud è attualmente disponibile su una vasta gamma di dispositivi, ma stiamo ancora aspettando che Microsoft rilasci ufficialmente la versione del browser. </p> <p> I dettagli sono stati abbastanza scarsi... fino ad ora. Secondo un rapporto di <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> Il Verge </a> , &quot;fonti che hanno familiarità con i piani Xbox di Microsoft&quot; affermano che &quot;i dipendenti stanno ora testando una versione web di xCloud prima di un&#39;anteprima pubblica&quot;. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Ecco una prima occhiata a xCloud per il Web di Microsoft <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> — The Verge (@verge) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> 15 febbraio 2021 </a></blockquote>  <p> Non dimenticare, queste sono solo immagini dei tester, il che significa che, sebbene sia improbabile, Microsoft potrebbe cambiare completamente l&#39;aspetto della versione del browser xCloud. </p> <p> Dagli screenshot, sembra che xCloud sia configurato in modo molto simile alla versione Android, disponibile su smartphone e tablet. </p> <p> Puoi vedere i giochi aggiunti di recente nella parte superiore dello screenshot, seguito da una sezione &quot;Prossimamente&quot;. Di seguito, hai varie opzioni per selezionare un genere di gioco a tua scelta, con la libreria di giochi xCloud completa disponibile in fondo alla pagina. </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> Come accedi a xCloud nel tuo browser? </h2> <p> Attualmente, non puoi. La versione pubblica della porta web di xCloud non è ancora disponibile. Il che significa che devi aspettare un po&#39; di più se vuoi accedere a xCloud tramite il tuo browser. Presumibilmente, Microsoft ha in programma di rivelare pubblicamente il servizio nel secondo trimestre del 2021. </p> <p> Fino ad allora, dovrai trovare altri metodi per accedere a xCloud. Al momento puoi accedere al servizio di cloud gaming solo su dispositivi Android (per giocare su iOS è necessaria la versione browser, grazie a <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> un litigio tra Apple e Microsoft </a> ). </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> Puoi accedere ai giochi xCloud in altro modo? </h2> <p> Ebbene sì e no. Non puoi accedere a nessun titolo su xCloud, per così dire. No, a meno che non utilizzi un dispositivo Android e l&#39;app ufficiale Game Pass per farlo. </p> <p> Tuttavia, i giochi disponibili sul servizio di cloud gaming di Microsoft sono tutti disponibili su Game Pass. In effetti, hai accesso a xCloud come parte di un abbonamento Game Pass Ultimate. Quindi puoi ancora accedere a quei giochi tramite la tua Xbox o un PC Windows. </p> <p> Quindi, in una parola, sì. Puoi accedere a quei giochi in un altro modo. Semplicemente non usando xCloud, a meno che tu non abbia accesso alla versione Android. </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud: in arrivo su un dispositivo iOS vicino a te </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> Non dovresti aspettare molto prima di poter entrare in possesso della piattaforma di gioco cloud di Microsoft. Una volta che xCloud ha superato i test, Microsoft apporterà le modifiche necessarie prima di consentirci di dare un&#39;occhiata e, si spera non molto tempo dopo, anche di giocarci. </p>"}