{"title":"DeviantArt aggiunge una barra laterale e gruppi alla sua app mobile","content":"<p> Ogni artista visivo ha il proprio processo creativo unico, ma è comune, specialmente nell&#39;era digitale di oggi, che l&#39;ultimo passo in quel processo sia condividere il tuo pezzo finito online. </p> <p> Sono finiti i giorni in cui devi trovare musei che porteranno i tuoi dipinti o fotografie affinché le persone li vedano. Invece, scegli una piattaforma che ti piace di più e posta via! </p> <p> Fondata nel 2000, DeviantArt è una delle più antiche comunità artistiche su Internet. DeviantArt ha lanciato la sua app mobile nel 2017 e il suo aggiornamento più recente è piccolo ma significativo. </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt per dispositivi mobili migliora la sua navigazione </h2> <p> DeviantArt ha migliorato l&#39;interfaccia utente della sua app mobile, aggiungendo una barra laterale molto simile a quella del sito web di DeviantArt. La barra laterale ti consente di accedere rapidamente alla home page, ai devianti (artisti) che segui e ai gruppi. </p> <p> <strong class=\"gallery__section-title\"> Galleria di immagini (2 immagini) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> Espandere <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> Espandere </p> <p> Vicino </p> <p> L&#39;accesso all&#39;ultimo elemento di quell&#39;elenco è particolarmente degno di nota perché prima di questo aggiornamento, i gruppi DeviantArt erano disponibili solo sul sito web. I gruppi DeviantArt funzionano in modo simile a <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> Gruppi Facebook Facebook </a> —raccolte di utenti che si sono uniti sulla piattaforma con interessi o obiettivi comuni. </p> <p> Nella barra laterale, puoi toccare <strong> I miei gruppi </strong> per visualizzare tutti i gruppi di cui fai parte, oppure <strong> Gruppi consigliati </strong> per visualizzare i gruppi che DeviantArt ritiene adatti a te. Puoi anche appuntare i tuoi gruppi preferiti nella parte superiore della barra laterale per un accesso più semplice. </p> <p> Se gestisci il tuo gruppo, potrebbe essere visualizzato nella sezione consigliata per altri devianti che potrebbero essere interessati a partecipare. Se non sei interessato a un gruppo, puoi toccare i tre puntini a destra del suo nome per rimuovere il consiglio. </p> <p> Quando visiti un gruppo nell&#39;app, vedrai sia le sue deviazioni (invii) che i suoi post. Gli amministratori del gruppo sono in grado di pubblicare aggiornamenti al proprio gruppo dal feed dei post. </p> <p> <strong> Scarica: </strong> DeviantArt per <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> (Gratuito) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> Dove condividi le tue creazioni online? </h2> <p> Se sei un artista, un designer o un fotografo che è stato su Internet per molto tempo, è probabile che tu sia stato su DeviantArt ad un certo punto. La community non sembra essere così vivace come nei primi anni 2000, ma il volume di lavori presentati è esploso negli ultimi anni. </p> <p> Con una base di utenti così attiva, dovrebbe diventare della massima importanza per DeviantArt migliorare la sua app mobile. Al momento in cui scriviamo, l&#39;app è valutata 2.6/5.0 su App Store e 3.2/5.0 su Google Play. </p>"}