{"title":"Disney+ è vicino a 100 milioni di abbonati","content":"<p> Mai sottovalutare la Disney. Mentre Disney+ è stato lanciato negli Stati Uniti solo a novembre 2019, il servizio di streaming ora vanta quasi 100 milioni di abbonati. È una crescita che nemmeno l&#39;azienda si aspettava. </p> <h2 id=\"how-many-customers-does-disney-have\"> Quanti clienti ha Disney+? </h2> <p> Come annunciato in <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Rapporto sui guadagni del primo trimestre 2021 di Disney </a> , Disney+ ha 94,9 milioni di abbonati in tutto il mondo, al 2 gennaio 2021. </p> <p> Significa che la cifra non tiene conto degli abbonati guadagnati attraverso il rilascio di successo di WandaVision. Non sarebbe ingiusto presumere che Disney+ abbia ora oltre 100 milioni di abbonati. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Gli ultimi dati sono stati riportati nel dicembre 2020, quando Disney ha annunciato di aver raggiunto 86 milioni di abbonati per il suo servizio di streaming titolare. Il salto da allora può probabilmente essere attribuito a forti contenuti esclusivi come la seconda stagione di The Mandalorian e il lungometraggio della Pixar Soul. </p> <p> Le entrate mensili medie per abbonato sono scese da $ 5,56 un anno fa a $ 4,04 oggi, che possono essere imputate principalmente al costo più basso del servizio in India e Indonesia. </p> <p> Anche Hulu ed ESPN+, servizi di streaming di proprietà di Disney, hanno visto una forte crescita. Il primo è cresciuto del 30% anno su anno a 39,4 milioni di abbonati, mentre il secondo è cresciuto dell&#39;83% anno su anno per un totale di 12,1 milioni di iscritti. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney ha recentemente lanciato un pacchetto che combina tutti i suoi servizi di streaming </a> , quindi è chiaro che l&#39;azienda continua a sostenere tutti e tre. </p> <p> Star dovrebbe anche essere lanciato presto in molte regioni, il che fornirà un enorme impulso al numero di film e programmi TV offerti da Disney+. </p>"}