{"title":"Entra nella terza dimensione: lavorare con i flussi di lavoro 3D in Adobe After Effects","content":"<p> Se stai cercando di migliorare il tuo flusso di lavoro di Adobe After Effects, alla fine dovrai iniziare a gestire l&#39;asse Z, che ti consente di manipolare la profondità 3D di un oggetto. </p> <p> Questo apre una gamma di nuovi elementi visivi e stili con cui lavorare, ma crea anche una serie di limitazioni e considerazioni. </p> <p> In questo articolo, tratteremo come abilitare e lavorare con i livelli 3D, nonché come aggiungere e animare le telecamere 3D per creare movimenti dinamici. Verrà inoltre esaminato uno scenario in cui animiamo e spostiamo il testo in uno spazio 3D. </p> <p> Facciamo un salto! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> Come abilitare e animare i livelli 3D </h2> <p> All&#39;interno della tua composizione, puoi alternare i tuoi livelli nella timeline per abilitarli come 3D. </p> <p> Questo è un processo molto semplice. Trova semplicemente il <strong> Cubo </strong> icona per i tuoi livelli nella timeline e fai clic sulla casella sottostante per abilitare il 3D per quel livello. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> Una volta fatto questo, probabilmente non vedrai cambiamenti immediati. Tuttavia, se vai ai parametri di posizione, scala e rotazione nel tuo livello, vedrai che è apparso un terzo set di numeri regolabili. </p> <p> Questi nuovi numeri ora dettano la rotazione, la posizione e la scala sull&#39;asse Z nello spazio 3D. Proprio come con gli altri parametri, possono essere fotogrammi chiave per consentire l&#39;animazione e la manipolazione. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> Ad esempio, creiamo una composizione e un livello di testo con alcune parole. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Fatto ciò, abilita il livello 3D. Nota che se hai intenzione di usare il <strong> Allineare </strong> strumento per assicurarti che il tuo livello sia perfettamente centrato, dovrai farlo prima di abilitare il 3D. Questo perché il <strong> Allineare </strong> lo strumento funziona solo su livelli 2D. </p> <p> Ora che il nostro livello di testo è un livello 3D, possiamo spostarlo nello spazio 3D lungo l&#39;asse Z. Quindi, facciamo spostare il testo &quot;verso lo schermo&quot;. </p> <p> Per prima cosa, imposteremo il nostro parametro Z-Axis. Per impostazione predefinita, è impostato su zero. Impostiamolo su <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Ora navigheremo di due secondi lungo la nostra timeline e imposteremo il valore dell&#39;asse Z su <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> Con questa modifica, ora dovremmo vedere il testo spostarsi &quot;verso&quot; lo schermo. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> Cosa sono le fotocamere 3D? </h2> <p> Abbiamo animato con successo un oggetto nello spazio 3D in After Effects. Ma cosa succede se hai più oggetti e vuoi creare un senso dello spettatore che si avvicina o si allontana da loro? </p> <p> Potresti semplicemente animare ogni singolo elemento in modo che si muova verso di te, ma ciò richiederebbe molto tempo e non sarebbe particolarmente efficiente. Qui è dove useresti una fotocamera 3D. </p> <p> </p> <p> Se utilizzi software 3D come Cinema 4D o Blender, è probabile che tu abbia già utilizzato telecamere 3D. Se hai mai giocato a un gioco per computer, hai anche sperimentato una telecamera 3D che sposta la tua vista in un mondo 3D. </p> <p> All&#39;inizio tutto questo può sembrare complesso, ma le fotocamere 3D funzionano proprio come farebbe una vera fotocamera. Ti danno un campo visivo che può essere manipolato e spostato in uno spazio 3D. </p> <p> Lavoriamo su un esempio. </p> <h3 id=\"setting-up-a-3d-camera\"> Configurazione di una fotocamera 3D </h3> <p> Per iniziare, crea diversi livelli di testo 3D e posizionali in sequenza lungo l&#39;asse Z. </p> <p> In questo esempio, un gap di <strong> 3.000 pixel </strong> tra ogni strato è stato utilizzato. Il primo strato si trova a zero, il successivo a 3.000, il successivo a 6.000 e così via. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Ora è il momento di creare una fotocamera 3D facendo clic su <strong> Strato </strong> &gt; <strong> Nuovo </strong> &gt; <strong> telecamera </strong> , su cui vedrai una finestra per regolare le impostazioni per il tuo nuovo livello della videocamera. Questi sono di due tipi: <strong> Un nodo </strong> e <strong> Due nodi </strong> . </p> <p> Il <strong> Un nodo </strong> la fotocamera è progettata per azionare ed emulare il più fedelmente possibile una fotocamera del mondo reale e il punto di messa a fuoco è designato manualmente dal movimento della fotocamera. </p> <p> UN <strong> Due nodi </strong> la telecamera è progettata per seguire un singolo punto di interesse, il che la rende ideale per orbitare o seguire un oggetto in movimento. </p> <p> In questo scenario, il <strong> Un nodo </strong> verrà utilizzata la fotocamera. Noterai una serie di impostazioni aggiuntive nella finestra, come <strong> Ingrandisci </strong> , <strong> Punto di vista </strong> , <strong> Abilita la profondità di campo </strong> , e <strong> Lunghezza focale </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Questi hanno lo scopo di rispecchiare le impostazioni della fotocamera del mondo reale. Se sei esperto di come funzionano, sentiti libero di giocarci. In caso contrario, puoi scegliere una serie di preset nell&#39;angolo in alto a destra. </p> <p> Stiamo per selezionare il <strong> 35mm </strong> preimpostato per ora. Ora che il nostro livello della fotocamera è impostato e nella scena, all&#39;inizio non vedrai molta differenza. </p> <h3 id=\"using-3d-camera-navigation\"> Utilizzo della navigazione della fotocamera 3D </h3> <p> Esistono due metodi con cui è possibile regolare e animare la vista della telecamera. Il più accurato è inserendo diversi <strong> Posizione </strong> valori in <strong> Trasformare </strong> impostazioni per il livello della fotocamera. Puoi quindi fare fotogrammi chiave come faresti quando animi qualsiasi altro livello. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> Mentre muovi la telecamera, noterai che tutti gli altri oggetti 3D nella scena si sposteranno in relazione ad essa. Si noti che la fotocamera sarà <strong> non influisce sui livelli 2D </strong> . </p> <p> Quindi, impostiamo la nostra fotocamera in modo che si sposti sull&#39;asse Z da zero a 9.000 in un intervallo di quattro secondi e fotogrammi chiave del nostro movimento. </p> <p> Ecco qui! Se lo hai impostato correttamente, le parole dovrebbero spingere &quot;verso&quot; di te, &quot;attraverso&quot; il campo visivo e &quot;dietro&quot; lo spettatore. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> Altri modi per spostare la fotocamera 3D </h3> <p> Se preferisci essere un po&#39; più sperimentale e meno guidato dai numeri con la tua fotocamera, ci sono altri mezzi per spostarti, navigare e regolare. Il <strong> Orbita </strong> , <strong> Padella </strong> , e <strong> Dolly </strong> gli strumenti nella parte superiore della barra degli strumenti ti consentono di farlo. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> Usandoli, puoi fare clic e trascinare per spostarti da un lato all&#39;altro ( <strong> Padella) </strong> , ruotare intorno ( <strong> Orbita </strong> ) e ingrandisci e rimpicciolisci ( <strong> Dolly </strong> ). Questi controlli sono meno precisi dell&#39;immissione di numeri, ma sono ottimi per pianificare i movimenti e le animazioni approssimativi della fotocamera. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> La pratica porta alla perfezione </h2> <p> Ora dovresti essere in grado di creare e animare livelli 3D lungo l&#39;asse Z e lavorare anche con telecamere 3D per navigare con più oggetti 3D. </p> <p> Se ti piace lavorare in uno spazio 3D, potresti voler esplorare le possibilità più avanzate che un software 3D più dedicato, come Blender, può offrire. </p>"}