{"title":"Fotocamera Sony FX3 rivelata tramite Twitter Leak","content":"<p> Sono passate solo due settimane da quando Sony ha annunciato il rilascio della Sony A1, una fotocamera da 8,6 K in grado di acquisire immagini da 50 MP fino a 30 fps. Ma l&#39;azienda sta suscitando qualcosa in più? </p> <p> Tutto ciò che abbiamo in questo momento sono semplici speculazioni, ma Sony potrebbe aggiungere una nuova fotocamera elegante e compatta alla sua serie FX. </p> <h2 id=\"a-preview-of-the-sony-fx3\"> Un&#39;anteprima del Sony FX3 </h2> <p> Mercoledì, Nokishita ha twittato un&#39;immagine della Sony FX3, una fotocamera che potrebbe cercare di sfidare la EOS C70 di Canon e il Pocket Cinema 6K di Blackmagic Design. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> FX3の画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> #噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> — (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> 10 febbraio 2021 </a></blockquote>  <p> Nokishita è un blog tecnologico giapponese famoso per le prime e accurate perdite di apparecchiature fotografiche e video in arrivo. Nonostante non sia una fonte ufficiale per nessuna azienda di prodotti ottici, alcune persone si spingono fino a dire che le informazioni condivise da Nokishita potrebbero anche essere confermate. </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> TechRadar </a> una volta ha chiamato Nokishita &quot;il Babbo Natale delle voci sulle telecamere&quot;. In risposta al tweet di cui sopra, l&#39;utente di Twitter @miemelaar ha chiesto &quot;[è] reale o un concetto?&quot; e @rauuru_san ha risposto con &quot;se Nokishita lo pubblica, è il vero affare&quot;. </p> <p> Ma anche supponendo che la fuga di notizie fosse vera, quante informazioni ci lasciano davvero? </p> <p> Potremmo supporre che l&#39;FX3 faccia parte della linea FX a causa del suo nome, ma la fotocamera porta un simbolo che sta lasciando confusi molti speculatori. Se quel segno alfa bianco (α) sulla parte anteriore della fotocamera ti sembra familiare, è perché puoi trovare lo stesso sulle fotocamere mirrorless di Sony. </p> <p> Quindi l&#39;FX3 è una cinepresa, una fotocamera mirrorless o una sorta di ibrido in stile DSLR? Bisognerà aspettare che escano maggiori dettagli. Fino ad allora, considera di leggere il nostro articolo sul article <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> differenze chiave tra fotocamere mirrorless, DSLR e videocamere </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> Cosa porterà in tavola il Sony FX3? </h2> <p> Da quando il tweet di Nokishita è caduto, le presunte specifiche del prodotto della fotocamera hanno fatto il giro del web. Tuttavia, ancora nulla da fonti altrettanto affidabili. </p> <p> Per fortuna, dovremmo scoprire di più sul Sony FX3 nelle prossime settimane. Il più grande evento fotografico del Giappone, CP+ 2021, arriverà il 25-28 febbraio. </p>"}