{"title":"Google rilascia l&#39;IA sperimentale che simula la sinestesia","content":"<p> Wassily Kandinsky abbandonò la sua carriera di avvocato per studiare pittura all&#39;Accademia di Belle Arti di Monaco. È considerato uno dei fondatori dell&#39;astrazione pura in pittura, e ciò potrebbe essere dovuto al modo intrigante con cui percepiva i colori e le forme. </p> <p> Questo strumento di intelligenza artificiale ti consente di prendere in prestito le orecchie di Kandinsky. Ora puoi sentire cosa ha fatto mentre dipingeva (o almeno, l&#39;interpretazione di Google di ciò che ha descritto). </p> <h2 id=\"what-if-you-could-hear-color\"> E se potessi sentire il colore? </h2> <p> In collaborazione con il Centre Pompidou di Parigi, Google Arts &amp; Culture ha lanciato un progetto sperimentale chiamato <a href=\"https://artsandculture.google.com/experiment/sgF5ivv105ukhA\" target=\"_blank\" rel=\"nofollow noopener\"> Suona un Kandinsky </a> . </p> <p> Come suggerisce il nome, lo strumento interattivo ti consente di sperimentare i dipinti astratti di Wassily Kandinsky in forma musicale. Kandinsky era un pittore russo che soffriva di una condizione neurologica chiamata sinestesia. </p> <p> <img alt=\"A screenshot of the second part of Play a Kandinsky\" src=\"images/play-kandinsky-screenshot-2-986.png\" loading=\"lazy\"> </p> <p> La colonna sonora, composta da Antoine Bertin e NSDOS, è stata ispirata dalla musica dell&#39;epoca di Kandinsky e generata sul Transformer di Google <a href=\"https://www.makeuseof.com/tag/what-are-neural-networks/\" target=\"_blank\" rel=\"nofollow noopener\"> rete neurale </a> . </p> <p> Dopo aver cliccato <strong> Avvia esperimento </strong> , la musica viene riprodotta e l&#39;IA ti chiede di fare clic alcune volte su un cerchio al centro dello schermo. Ogni volta che lo fai, i colori del cerchio e dello sfondo dietro di esso cambieranno, così come la musica. </p> <p> La sinestesia è una condizione che influenza la tua percezione: la stimolazione di un senso innesca un&#39;esperienza automatica e involontaria in un altro. Ad esempio, un sinesteta (una persona con sinestesia) potrebbe pensare al numero &quot;4&quot; e vedere il rosso, o assaggiare le mele quando sente la parola &quot;amico&quot;. </p> <p> Per Kandinsky, avere la sinestesia significava vedere i colori quando sentiva la musica e ascoltare la musica mentre dipingeva. &quot;Il suono dei colori è così definito che sarebbe difficile trovare qualcuno che esprima un giallo brillante con note basse o un lago scuro con acuti&quot;, ha detto una volta. </p> <p> <img alt=\"Yellow-Red-Blue (1925), by Wassily Kandinsky\" src=\"images/yellow-red-blue-kandinsky-947.png\" loading=\"lazy\"> </p> <p> Nel 1925 creò un capolavoro che chiamò Yellow-Red-Blue (nella foto sopra). Era un dipinto ad olio che lo distingueva dai movimenti artistici influenti del suo tempo, vale a dire il costruttivismo e il suprematismo. </p> <p> La terza parte di Play a Kandinsky permette di ascoltare il dipinto in una sinfonia classica di sette movimenti. Seguono i suoi generosi usi del blu e del giallo in forte contrasto tra loro <a href=\"https://www.makeuseof.com/how-to-use-color-theory-elevate-your-creative-projects/\" target=\"_blank\" rel=\"nofollow noopener\"> teoria del colore </a> del poeta tedesco Johann Wolfgang von Goethe. </p> <p> Google attribuisce colori e forme a Kandinsky nello stesso modo in cui attribuiresti chiavi e corde di uno strumento a un musicista. &quot;Un artista straordinariamente dotato, ha organizzato suoni di colore in sinfonie di colori&quot;, il <a href=\"https://artsandculture.google.com/story/the-sound-of-colours/0ALymHuhPl1jLg\" target=\"_blank\" rel=\"nofollow noopener\"> storia </a> legge. </p> <p> </p> <h2 id=\"there-s-more-to-art-than-meets-the-eye\"> C&#39;è di più nell&#39;arte di quanto non sembri </h2> <p> Non sapremo mai esattamente cosa ha sentito Kandinsky mentre lavorava, ma sono progetti come questo che stimolano davvero la creatività e l&#39;introspezione. </p> <p> Forse c&#39;è una sorta di connessione tra arte e musica che la maggior parte di noi non è in grado di comprendere fino in fondo. L&#39;esperimento di Google fa un buon lavoro nell&#39;esplorare questa possibilità. </p> <p> <small> Credito immagine: Wassily Kandinsky/ <a href=\"https://commons.wikimedia.org/wiki/File:Kandinsky_-_Gelb-Rot-Blau,_1925.jpg\" rel=\"nofollow noopener\" target=\"_blank\"> Wikimedia Commons </a></small> </p>"}