{"title":"Giochi di ruolo per computer vs giochi di ruolo classici: cosa significa CRPG nel 2021?","content":"<p> La storia dei giochi di ruolo per computer è lunga quanto la storia dei videogiochi stessi, evolvendosi e crescendo insieme nel corso degli anni. E proprio come i CRPG si sono evoluti, migliorando la grafica, aggiungendo o eliminando le meccaniche di gioco, così hanno fatto il significato e la terminologia usati per descriverli. </p> <p> L&#39;acronimo CRPG, che tradizionalmente stava per Computer Role Playing Game, ha ampliato il suo significato nel tempo per includere giochi di ruolo per diverse piattaforme. Ora ha adottato un nuovo significato. Sebbene il suo nuovo significato non sia completamente diverso da quello originale, ora descrive uno specifico sottogenere di giochi di ruolo. </p> <h2 id=\"the-history-of-crpgs\"> La storia dei CRPG </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> La storia dei CRPG inizia negli anni &#39;70 con l&#39;uscita del primo adattamento videoludico del gioco di ruolo da tavolo Dungeons &amp; Dragons, Dungeon. Il gioco era originariamente disponibile su Atari (puoi giocarci tramite <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, un servizio di streaming di giochi su Plex </a> ). </p> <p> Sebbene il gameplay di Dungeon fosse principalmente basato sul testo, descriveva completamente i movimenti del tuo gruppo multi-personaggio in un ambiente fantasy implementando la maggior parte dei principi di base di Dungeons &amp; Dragons. </p> <p> A quei tempi, li chiamavamo giochi di ruolo per computer per distinguerli dalle loro controparti da tavolo, che erano molto più popolari all&#39;epoca, e li conoscevamo semplicemente come giochi di ruolo. </p> <p> Negli anni &#39;90 i CRPG erano in piena fioritura, ora in grado di mostrare un mondo fantastico per intero, almeno in una prospettiva dall&#39;alto verso il basso, o vista isometrica. Tale è stato il caso di Ultima VII, uno dei CRPG più interattivi a cui questo scrittore abbia giocato. </p> <p> Quasi tutto ciò che puoi vedere può essere spostato o con cui interagire: puoi creare armi, suonare strumenti e persino portare il tuo membro del gruppo morto fuori da una prigione fino alla sala del trono del re per farlo risorgere! </p> <p> Baldur&#39;s Gate è stato uno di quelli che ha emulato di più l&#39;esperienza dei giochi di ruolo da tavolo. Ha adattato il set di regole di Dungeons &amp; Dragons 2nd Edition (AKA Advanced Dungeons &amp; Dragons) in un&#39;immagine isometrica <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> CRPG plausibile in tempo reale </a> . Questi tipi di GDR enfatizzavano le tattiche in battaglia, la progressione del personaggio, il processo decisionale e incoraggiavano l&#39;esplorazione. </p> <p> </p> <p> Oggi, in un mondo in cui le console dominano il mercato, i videogiochi di ruolo sono diventati più popolari dei giochi di ruolo da tavolo. Nella misura in cui nell&#39;uso moderno, l&#39;acronimo RPG si riferisce più alla sua versione del videogioco. Definiresti Dungeon&#39;s &amp; Dragons un gioco di ruolo da tavolo, piuttosto che un semplice gioco di ruolo. </p> <p> Con l&#39;evoluzione della grafica, le meccaniche di gioco dei CRPG si sono adattate ai moderni standard grafici. Le serie CRPG come The Elder Scrolls, Gothic o The Witcher hanno rivoluzionato il genere, introducendo alcune nuove meccaniche di gioco e lasciandone altre. </p> <p> Questi giochi di ruolo sono più orientati all&#39;azione e dal ritmo frenetico, collocandosi in qualche modo, anche se non completamente, all&#39;interno del sottogenere hack and slash (questi sono comunque giochi di ruolo solidi!) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Una nuova ondata di CRPG </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> Eppure, andando contro la tendenza dell&#39;odierna industria dei videogiochi di puntare sul realismo grafico, è arrivata una nuova ondata di CRPG. I giochi di ruolo della vecchia scuola, o classici, influenzano pesantemente questi giochi e mettono l&#39;accento sulle meccaniche di gioco e sull&#39;immersione, piuttosto che sulla grafica. </p> <p> Sono generalmente giochi isometrici, con battaglie tattiche in pausa in tempo reale o a turni. Questi CRPG fanno anche del loro meglio per essere il più coinvolgenti possibile, fornendo blocchi piuttosto grandi di prosa ben realizzata e un solido retroscena. </p> <p> La maggior parte di loro si basa sul testo piuttosto che sulla recitazione vocale per la maggior parte dei dialoghi, proprio come i CRPG della vecchia scuola. Alcuni di questi CRPG includono Pillars of Eternity, Divinity: Original Sin o Pathfinder: Kingmaker. </p> <p> Questi giochi enfatizzano anche le tattiche di battaglia, la progressione del personaggio, il processo decisionale e incoraggiano l&#39;esplorazione, proprio come facevano i CRPG della vecchia scuola. Per questi motivi, li consideriamo più strettamente correlati ai giochi di ruolo classici che alla maggior parte dei giochi di ruolo moderni. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> Cosa significa CRPG nel 2021 </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> Dagli anni 2000, RPG è diventato il termine standard quando si fa riferimento a qualsiasi videogioco di ruolo. Ma intorno al 2015 pubblicarono Divinity: Original Sin e Pillars of Eternity. </p> <p> Questi giochi di ruolo erano un allontanamento dall&#39;approccio orientato all&#39;azione dei giochi di ruolo moderni, pur essendo molto simili ai titoli più vecchi sia nell&#39;estetica che nella meccanica di gioco. Fu in questo periodo che sorse la necessità di un nuovo termine per distinguere questi giochi di ruolo dai giochi di ruolo moderni. </p> <p> Sebbene le persone abbiano lanciato online per anni i termini &quot;vecchia scuola&quot; e &quot;RPG classico&quot; per descrivere questi giochi, quest&#39;ultimo è quello che è rimasto. Proprio come i moderni videogiochi di ruolo hanno rivendicato l&#39;acronimo RPG per se stessi, le persone ora chiamano i giochi di ruolo della vecchia scuola &quot;CRPG&quot;. </p>"}