{"title":"Gli AirTag tanto attesi potrebbero finalmente debuttare a marzo","content":"<p> Si dice che gli AirTags di Apple, un localizzatore di posizione in miniatura per chiavi e altri piccoli oggetti, siano dietro l&#39;angolo dal 2019. Tuttavia, a sei settimane dall&#39;inizio del 2021, devono ancora essere annunciati da Apple, figuriamoci per iniziare la spedizione ai clienti. </p> <p> Questo potrebbe cambiare il mese prossimo, secondo il perenne informatore di Apple Jon Prosser. In un tweet inviato venerdì 12 febbraio, Prosser ha affermato che &quot;gli AirTag sono ancora attivi per marzo. Questa volta non ho sentito di ulteriori ritardi&quot;. </p> <h2 id=\"what-to-expect-from-airtags\"> Cosa aspettarsi dagli AirTag </h2> <p> Prosser si riferisce a un precedente ritardo segnalato alla fine dello scorso anno, prima dell&#39;evento mediatico di Apple del 13 ottobre. A quel tempo, Prosser ha osservato su <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800\" target=\"_blank\" rel=\"nofollow noopener\"> Twitter </a> che aveva sentito dalle sue fonti (apparentemente ben posizionate) che &quot;Apple ha rinviato l&#39;annuncio e il lancio di AirTag a marzo del 2021&quot;. Arrivando fino a sei mesi dopo, sembra che nessun ulteriore ritardo bloccherà il rilascio degli AirTag. Si spera, almeno. </p> <p> Secondo quanto riferito, AirTags utilizzerà la tecnologia a banda ultra larga di Apple per consentire agli iPhone di determinare la loro posizione precisa con un alto grado di precisione. Presumibilmente useranno sia segnali audio che un marcatore virtuale aumentato per mostrare esattamente dove si trova l&#39;oggetto, attaccato agli AirTag. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Gli AirTag sono ancora attivi per marzo. <br><br> Questa volta non ho sentito di ulteriori ritardi. 🤞 </p> — Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1360265330296250377?ref_src=twsrc%5Etfw\"> 12 febbraio 2021 </a></blockquote>  <p> Trovare i singoli AirTag sarà <a href=\"https://www.makeuseof.com/apple-find-my-items-hidden-tab/\" target=\"_blank\" rel=\"nofollow noopener\"> fatto tramite l&#39;app iOS &quot;Trova il mio&quot; </a> , che consente inoltre agli utenti di monitorare i propri iPhone, iPad, Mac e altri dispositivi Apple. Gli AirTag saranno i rivali di Apple dei popolari prodotti di tracciamento Bluetooth di aziende come Tile. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Quindi, riguardo agli AirTag. <br><br> Questo mi fa male al cuore... <br><br> Mi è stato detto che Apple ha posticipato l&#39;annuncio e il lancio degli AirTag a marzo del 2021 <a href=\"https://t.co/xtUvCAFmoE\"> https://t.co/xtUvCAFmoE </a> <a href=\"https://t.co/DIUlcp01Xy\"> pic.twitter.com/DIUlcp01Xy </a></p> — Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800?ref_src=twsrc%5Etfw\"> 9 ottobre 2020 </a></blockquote>  <p> Apple deve ancora annunciare un evento speciale di marzo, durante il quale potrebbero essere annunciati gli AirTag. Tuttavia, se ne ospiterà uno che sarà in linea con gli ultimi anni. Per sei degli ultimi 10 anni, Apple ha ospitato un evento a marzo in cui ha mostrato nuovi prodotti. </p> <p> L&#39;anno scorso, si vociferava molto di un evento, ma non si è verificato, molto probabilmente a causa dell&#39;inizio della pandemia di COVID-19 negli Stati Uniti e altrove. Ora che Apple è passata agli eventi virtuali, tuttavia, ciò non le impedirà di organizzare un altro evento il mese prossimo. In alternativa, Apple potrebbe annunciare gli AirTag tramite comunicato stampa. </p> <p> </p> <h2 id=\"expect-a-new-ipad-pro-as-well\"> Aspettati anche un nuovo iPad Pro </h2> <p> Anche questo potrebbe non essere l&#39;unico nuovo prodotto Apple il mese prossimo. Prosser ha inoltre risposto a una domanda sul prossimo iPad Pro di Apple, dicendo che è &quot;anche [impostato per] marzo, per quanto ne so&quot;. </p> <p> Sebbene Prosser si sia sbagliato prima, ha un record complessivamente impressionante quando si tratta di annunci Apple accurati. Gli AirTag e l&#39;iPad Pro di nuova generazione saranno tra questi? Non c&#39;è molto da aspettare prima di scoprirlo. </p> <p> <small> Credito immagine: iphonedigital/ <a href=\"https://www.flickr.com/photos/137872055@N03/22522566994/\" target=\"_blank\" rel=\"nofollow noopener\"> Flickr </a></small> </p>"}