{"title":"Google aggiunge il supporto per Face ID a Chrome per iOS","content":"<p> Google sta testando una nuova funzionalità di sicurezza in Chrome 89 per iOS che utilizza l&#39;autenticazione biometrica dell&#39;iPhone per proteggere le tue schede di navigazione privata. Attualmente limitato agli utenti del canale beta di Chrome, questo ti consentirà di bloccare le tue schede di navigazione in incognito con Face ID o Touch ID. </p> <h2 id=\"even-more-private-private-browsing\"> Navigazione privata ancora più privata </h2> <p> Tutte le schede di navigazione in incognito protette con Face o Touch ID sono sfocate nel selettore di schede. Le schede bloccate diventano nuovamente visibili una volta confermate con l&#39;autenticazione biometrica dell&#39;iPhone‌. </p> <p> Questa utile funzione non solo aumenta la tua privacy, ma rafforza anche la tua sicurezza mentre esegui il multitasking tra le app sul tuo iPhone o iPad. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> rileva che non tutti gli utenti beta possono accedere alla nuova opzione di blocco a causa di un componente lato server. </p> <p> </p> <h2 id=\"how-s-this-useful\"> In che modo è utile? </h2> <p> È anche utile quando un amico potrebbe chiedere di prendere in prestito il tuo iPhone per cercare rapidamente qualcosa online. Con la protezione Face ID per la modalità di navigazione privata di Chrome, non saranno in grado di vedere i tuoi siti web di navigazione in incognito aperti quando cambi scheda. </p> <p> </p> <p> &quot;Incognito&quot; è un nome commerciale per la modalità di navigazione privata di Chrome. Durante la navigazione in incognito, puoi navigare sul Web senza che Chrome salvi alcuna informazione sulla sessione. Quando chiudi una finestra di navigazione in incognito, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> tutte le informazioni su quella sessione scompaiono </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> Come abilitare Face o Touch ID in Chrome </h2> <p> Questa nuova funzionalità imminente deve essere attivata manualmente nella sezione Privacy delle impostazioni in-app di Chrome. Un simile blocco della privacy è presente in altre app di Google. </p> <p> Nell&#39;app di ricerca nativa, ad esempio, l&#39;autenticazione biometrica dell&#39;iPhone conferma la tua identità quando torni a una sessione di navigazione in incognito dopo 15 minuti. In Google Drive è disponibile anche un&#39;autenticazione Face o Touch ID facoltativa per proteggere i tuoi file quando esci dall&#39;app. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> Quando uscirà ufficialmente la funzione? </h2> <p> Non si sa ancora quando la nuova opzione di blocco potrebbe essere lanciata per tutti, ma si prevede che Chrome 89 uscirà per il consumo pubblico il prossimo mese. Google potrebbe anche decidere di non rilasciare affatto la funzionalità nonostante sia elencata nelle note di rilascio ufficiali. </p>"}