{"title":"HBO Max verrà lanciato in America Latina a giugno","content":"<p> HBO Max, il servizio di streaming di WarnerMedia, verrà lanciato in America Latina e nei Caraibi nel giugno 2021. È la prima volta che il servizio sarà disponibile al di fuori degli Stati Uniti. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> Dove verrà lanciato HBO Max in America Latina? </h2> <p> Al momento, HBO Max è disponibile solo negli Stati Uniti. Alla fine di giugno 2021, sarà disponibile in molti paesi dell&#39;America Latina e dei Caraibi. La notizia è stata annunciata in a <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> Comunicato stampa WarnerMedia </a> . </p> <p> Nello specifico, tali paesi sono: Anguilla, Antigua, Argentina, Aruba, Isole Vergini britanniche, Bahamas, Barbados, Belize, Bolivia, Brasile, Isole Cayman, Cile, Colombia, Costa Rica, Curacao, Dominica, Repubblica Dominicana, Ecuador, El Salvador , Grenada, Guatemala, Guyana, Haiti, Honduras, Giamaica, Messico, Montserrat, Nicaragua, Panama, Paraguay, Perù, Saint Kitts e Nevis, Santa Lucia, Saint Vincent, Suriname, Trinidad e Tobago, Turks e Caicos, Uruguay e Venezuela. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> Cosa offrirà HBO Max in America Latina? </h2> <p> </p> <p> Gli attuali abbonati a HBO GO che pagano direttamente o tramite &quot;partner idonei&quot; avranno accesso immediato a HBO Max. HBO GO verrà quindi gradualmente eliminato in tutte le regioni. </p> <p> I dettagli sui prezzi non sono stati annunciati, sebbene siano promessi nei prossimi mesi, insieme a informazioni su nuovi contenuti e offerte promozionali. </p> <p> Come negli Stati Uniti, HBO Max offrirà una varietà di pacchetti di abbonamento e dispositivi di supporto come smartphone, tablet e altre piattaforme intelligenti. </p> <p> </p> <p> In un trailer che annuncia la notizia, si possono vedere clip di serie come Game of Thrones and Friends, insieme a film come The Matrix e Casablanca. Tuttavia, alla fine viene visualizzato un piccolo messaggio per avvisare che &quot;non tutti i titoli [saranno] disponibili al lancio&quot;. </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> Quando sarà disponibile HBO Max a livello globale? </h2> <p> L&#39;anno scorso, la Warner Bros. ha annunciato in modo controverso che prevede di rilasciare l&#39;intera lista cinematografica del 2021 su HBO Max. Ha causato il regista <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Christopher Nolan marchierà HBO Max come &quot;il peggior servizio di streaming&quot; </a> . </p> <p> Tuttavia, mentre alcuni nell&#39;industria cinematografica potrebbero lamentarsi, è un&#39;ottima mossa a favore della scelta per i consumatori. </p> <p> Pertanto, è probabile che quelli in America Latina e nei Caraibi siano entusiasti del lancio di HBO Max, nella speranza che l&#39;accordo si applichi anche a loro. </p> <p> Per quanto riguarda il resto del mondo? Non sono state fissate date fisse, ma WarnerMedia ha rivelato che i paesi nordici, la Spagna, l&#39;Europa centrale e il Portogallo dovrebbero essere aggiornati a HBO Max entro la fine dell&#39;anno. </p> <p> Johannes Larcher, capo di HBO Max International, ha dichiarato: </p> <blockquote> <p> Siamo entusiasti del lancio di HBO Max in America Latina e nei Caraibi, che è il primo passo per portare il servizio Direct-to-Consumer di WarnerMedia ai consumatori al di fuori degli Stati Uniti e in tutto il mondo. </p> </blockquote>"}