{"title":"Il controller PS4 non funziona? Come risolvere i problemi più comuni","content":"<p> La maggior parte delle volte, il controller della tua PlayStation 4 probabilmente funziona bene. Ma quando il tuo DualShock 4 smette di connettersi o si disconnette casualmente, è frustrante. </p> <p> Diamo un&#39;occhiata alle correzioni per quando il controller PS4 non funziona, così puoi tornare a giocare. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> Il controller PS4 non si associa o non si connette </h2> <p> Normalmente, quando si preme il tasto <strong> Pulsante PS </strong> sul controller, dovrebbe accendersi e connettersi al sistema. Tuttavia, quando non si connette, vedrai invece la barra luminosa sul controller lampeggiare per un po&#39;, quindi spegnersi. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Questo di solito accade se hai usato il tuo DualShock 4 con un altro dispositivo. Ad esempio, se tu <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> associa il controller PS4 al PC </a> o la console di un amico, ricorderà quel dispositivo in futuro. </p> <p> In questi casi dovrai riassociare il tuo DualShock 4 con la tua PS4. Per fare ciò, collega il controller alla tua PS4 utilizzando un cavo micro-USB. Assicurati di utilizzare un cavo di alta qualità che sai funzionare correttamente. </p> <p> </p> <p> premi il <strong> Pulsante PS </strong> sul controller per un momento e la luce dovrebbe lampeggiare brevemente prima di diventare blu. Ciò significa che il controller è stato associato e connesso correttamente. </p> <p> Se hai accoppiato il tuo DualShock 4 con un altro dispositivo nelle vicinanze, come il tuo telefono o una PlayStation 5, è probabile che questa operazione si accenda e colleghi il controller a quel dispositivo. Dovresti quindi spegnere e scollegare qualsiasi dispositivo a cui il tuo DualShock 4 è collegato per primo. </p> <p> Dopo aver riassociato il controller, puoi scollegare il cavo USB e utilizzare il controller in modalità wireless normalmente. La tua PS4 lo ricorderà fino a quando non abbinerai il controller a un altro dispositivo in futuro. </p> <p> Tieni presente che il numero massimo di controller DualShock 4 che puoi collegare alla PS4 contemporaneamente è quattro. Se hai già quattro controller collegati, dovrai scollegarne uno per fare spazio ad altri. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> Il controller PS4 continua a disconnettersi </h2> <p> Se il tuo DualShock 4 si disconnette casualmente durante il gioco, ci sono un paio di rimedi che puoi provare. </p> <p> Innanzitutto, assicurati che la batteria del controller sia carica. Sembra semplice, ma se la batteria del controller è quasi scarica, potrebbe disconnettersi. Per controllare la durata della batteria del controller, tieni premuto il tasto <strong> Pulsante PS </strong> per visualizzare il Menu rapido sul lato sinistro dello schermo. Vedrai un&#39;icona del controller con il display della batteria in basso. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Collega il controller alla PS4 e visita di nuovo il Menu rapido per assicurarti di vedere l&#39;animazione di ricarica della batteria. Dopo che il controller si è caricato per un po&#39;, prova a utilizzarlo normalmente. </p> <p> Se la batteria non è il tuo problema, assicurati di non provare a utilizzare il controller troppo lontano dal sistema. La portata tipica del Bluetooth è di circa 30 piedi; a seconda della configurazione, potresti essere in grado di utilizzare il controller oltre a questo o essere limitato a utilizzarlo più vicino. </p> <p> A proposito di questo, dovresti cercare di ridurre al minimo le interferenze tra il controller e la console. Rimuovi eventuali oggetti metallici tra i due, come scaffali o laptop, che potrebbero inibire il segnale. Dovresti anche estrarre la tua PS4 da qualsiasi spazio chiuso in cui si trova per una migliore trasmissione e ricezione del segnale. </p> <p> Infine, ricorda che la PS4 ha un&#39;impostazione che spegne i controller dopo che sono rimasti inattivi per un po&#39; di tempo. Se non vuoi che il controller PS4 si spenga quando guardi app multimediali come YouTube, vai su <strong> Impostazioni &gt; Impostazioni di risparmio energetico &gt; Imposta tempo fino allo spegnimento dei controller </strong> e scegli <strong> Mai </strong> . Nota che questo consumerà la batteria anche quando sei inattivo. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> Suggerimenti generali per la riparazione di un controller PlayStation 4 </h2> <p> Abbiamo esaminato soluzioni specifiche per alcuni problemi comuni di DualShock 4 sopra. Successivamente, diamo un&#39;occhiata a soluzioni più generali per i problemi con i controller PS4. Esaminali se hai bisogno di ulteriore aiuto. </p> <h3 id=\"restart-your-console\"> 1. Riavvia la tua console </h3> <p> Sebbene la maggior parte dei problemi del controller derivi dal controller stesso, c&#39;è la possibilità che la tua PS4 sia ciò che sta riscontrando il problema. Per escluderlo, è necessario riavviare la console prima di risolvere ulteriormente i problemi. </p> <p> Se il tuo controller funziona abbastanza per accedere ai menu, tieni premuto il tasto <strong> Pulsante PS </strong> per aprire il Menu rapido, quindi vai a <strong> Accensione &gt; Riavvia PS4 </strong> per riavviare il sistema. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> Nel caso in cui il tuo controller non stia collaborando, tieni premuto il tasto <strong> Energia </strong> sulla tua console PS4 finché non senti due segnali acustici. Questo lo spegnerà completamente (nessuna luce sulla parte anteriore): una volta spento, premi il pulsante <strong> Energia </strong> nuovamente il pulsante per riaccenderlo. </p> <p> Prova a utilizzare nuovamente il controller dopo un riavvio e verifica se questo aiuta. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. Dimentica e riassocia il controller PS4 </h3> <p> Se hai un secondo controller PS4 (o un controller PS Move), puoi utilizzarlo per accedere a un menu che ti consente di rimuovere il controller che presenta un problema. Dirigiti a <strong> Impostazioni &gt; Dispositivi &gt; Dispositivi Bluetooth </strong> e seleziona il <strong> DualShock 4 </strong> voce: è quella che non ha una luce verde accanto. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> Nel menu risultante, premere il tasto <strong> Opzioni </strong> pulsante sul controller e scegli <strong> Dimentica dispositivo </strong> . Ciò farà sì che la tua PS4 lo rimuova dalla memoria, quindi dovrai riassociarlo di nuovo. </p> <p> Questo è un buon momento per provare un metodo di accoppiamento leggermente diverso: farlo riaccoppiare all&#39;avvio. Per fare ciò, spegni la tua PS4 (come spiegato in precedenza). Una volta spento, collega il controller problematico alla tua console con un cavo USB. Colpire il <strong> Pulsante PS </strong> si spera di accendere e associare il controller in un unico processo. </p> <p> Se questo non funziona, riaccendi la tua PS4 e prova ad accoppiarla nel modo normale, come sopra. </p> <h3 id=\"hard-reset-your-controller\"> 3. Hard reset del controller </h3> <p> Se la rimozione e l&#39;associazione del controller non ha funzionato, puoi provare la procedura di ripristino completo per il DualShock 4. Avrai bisogno di un piccolo oggetto appuntito, come una graffetta piegata o uno strumento di espulsione della carta SIM, per farlo . </p> <p> Spegni la tua PS4, quindi capovolgi il controller. Vedrai un piccolo foro accanto alla vite vicino al pulsante L2 (sul lato destro del controller quando capovolto). Usa il tuo strumento appuntito per premere e tenere premuto il pulsante all&#39;interno di questo foro per circa cinque secondi. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> Dopo averlo fatto, collega nuovamente il controller alla PS4 tramite cavo USB e verifica se si accoppia correttamente. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Prova il controller altrove </h3> <p> A questo punto, se non l&#39;hai già fatto, dovresti provare a utilizzare il controller che ha problemi con un altro dispositivo. Se hai problemi simili sulla PS4 di un amico o sul tuo PC, è probabile che il controller sia difettoso. </p> <p> È anche una buona idea provare un altro controller PS4 con la tua console, se possibile. Se prendi in prestito il DualShock 4 di un amico che sai funzionare correttamente e scopri che ha problemi con il tuo sistema, probabilmente c&#39;è qualcosa che non va nella connettività wireless della tua PS4. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Utilizzare il controller in modalità cablata </h3> <p> Prima di rinunciare al controller, dovresti provare a giocare con esso collegato in modo permanente tramite un cavo USB. Tuttavia, tieni presente che funziona solo per il modello rivisto di controller PS4. Saprai di avere questo modello se c&#39;è una barra luminosa all&#39;interno del touchpad sulla parte anteriore del controller. In caso contrario, non puoi forzare la comunicazione cablata. </p> <p> Se non ne hai già uno, acquista un cavo lungo in modo da poter continuare a giocare dal divano. Il <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Ailun confezione da tre </a> di cavi micro-USB da 10 piedi è una buona opzione economica. </p> <p> Per forzare la tua PS4 a collegare i controller tramite USB, vai su <strong> Impostazioni &gt; Dispositivi &gt; Controller &gt; Metodo di comunicazione </strong> e scegli <strong> Usa cavo USB </strong> . Ciò impedirà al DualShock 4 di utilizzare il Bluetooth, anche se connesso tramite USB. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> Opzioni di correzione hardware DualShock 4 </h2> <p> Come la maggior parte dell&#39;hardware, i controller DualShock 4 hanno una garanzia di un anno. Se hai acquistato il controller PS4 nell&#39;ultimo anno e non riesci a risolverlo con tutti i suggerimenti di cui sopra, dovresti visitare <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> Pagina Correggi e sostituisci di PlayStation </a> per inserire una richiesta di riparazione sul controller. </p> <p> Altrimenti, puoi provare a risolvere da solo l&#39;hardware aprendo il controller. Ma a seconda del problema specifico, questo può essere difficile o impossibile. Ti consigliamo di parlare con un tecnico di riparazione locale se non ti senti a tuo agio nel farlo da solo. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> Problemi con il controller PS4, patchati </h2> <p> Ora sai come risolvere i problemi più comuni del controller PS4. Problemi più specifici, come un pulsante che smette di funzionare, sfortunatamente rientrano nelle soluzioni di riparazione hardware menzionate sopra. </p> <p> Spero che il tuo problema sia stato facile da risolvere. Ma in caso contrario, e hai bisogno di prendere un nuovo controller PS4, hai molte fantastiche opzioni. </p> <p> <small> Credito immagine: Joeri Mostmans/ <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}