{"title":"In che modo i migliori servizi di messaggistica istantanea utilizzano la crittografia end-to-end","content":"<p> I dati personali sono più importanti che mai. I governi, le aziende e i criminali informatici bramano che i dati personali delle persone siano al servizio dei loro interessi. Diverse piattaforme online hanno reso facile la divulgazione di dati personali a nostra insaputa. </p> <p> Per questo motivo, è importante avere una buona comprensione di come le piattaforme che utilizzi online proteggono la tua privacy. Uno dei fattori chiave a cui prestare attenzione quando si considerano le misure di protezione delle applicazioni di messaggistica è la crittografia end-to-end. </p> <p> Riconoscendo la necessità di dare priorità alla privacy dei dati, più applicazioni di messaggistica hanno adottato misure significative per implementare la crittografia end-to-end. </p> <h2 id=\"what-is-end-to-end-encryption\"> Che cos&#39;è la crittografia end-to-end? </h2> <p> </p> <p> La crittografia end-to-end è <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> un metodo per crittografare le comunicazioni </a> in modo che terze parti non siano in grado di accedere alle informazioni condivise tra le persone che si scambiano messaggi. </p> <p> Con la crittografia end-to-end, viene utilizzato un codice segreto, anziché testo normale, per nascondere il contenuto dei messaggi. Ciò significa che solo coloro che comunicano su una piattaforma crittografata end-to-end possono leggere i messaggi che si scambiano. </p> <p> Diamo un&#39;occhiata a come tre popolari servizi di messaggistica sicura, Signal, WhatsApp e Telegram, utilizzano la crittografia end-to-end. </p> <p> </p> <h2 id=\"signal\"> Segnale </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signal è considerata una delle applicazioni di messaggistica più sicure. Tutte le comunicazioni sulla piattaforma sono crittografate end-to-end per impostazione predefinita. </p> <p> Signal non esegue il backup dei messaggi sul cloud, il che riduce i rischi di malintenzionati che utilizzano metodi alternativi per acquisire informazioni. Crittografa inoltre i metadati dei messaggi in modo che la posizione e l&#39;ora delle attività di messaggistica non vengano tracciate. </p> <p> Con un motore di crittografia open source, il pubblico beneficia di livelli più elevati di trasparenza sulla tecnologia alla base delle proprie attività di messaggistica. Gli utenti possono guardare più da vicino i dettagli tecnici per comprendere meglio i metodi utilizzati per proteggere la propria privacy. </p> <p> Le piattaforme open source possono rendere il software molto più semplice e sicuro da usare nel lungo periodo. Non solo le persone possono capire meglio come funziona il software, ma possono anche provare a configurare la propria versione dell&#39;applicazione, che potrebbe essere più adatta alle proprie esigenze di sicurezza uniche. </p> <p> Signal utilizza una combinazione di OTR, denominata messaggistica off-the-record Multi-Party che consente di crittografare i messaggi end-to-end nelle chat di gruppo. I rischi di violazione dei dati possono aumentare con l&#39;aumento del numero di partecipanti a una rete. Con la chat di gruppo crittografata end-to-end, tali rischi sono notevolmente ridotti. </p> <p> </p> <h2 id=\"whatsapp\"> WhatsApp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp è stata una delle prime applicazioni di messaggistica popolari ad abilitare la crittografia end-to-end. Utilizza la crittografia end-to-end per messaggi e chiamate. </p> <p> WhatsApp utilizza il protocollo di crittografia end-to-end sviluppato da Open Whisper Systems, il team dietro Signal Messenger. Questo è un vantaggio importante per l&#39;applicazione, considerando quanto sia sicuro il protocollo di crittografia di Signal. </p> <p> </p> <p> L&#39;uso da parte di WhatsApp della propria distribuzione proprietaria significa che potrebbe non essere esaminato con la stessa frequenza da una vasta gamma di ricercatori di sicurezza come il software completamente open source di Signal. </p> <p> Nonostante la crittografia dei messaggi, potrebbero essere utilizzati altri modi per saperne di più sui messaggi inviati su WhatsApp poiché è possibile eseguire il backup dei messaggi sul cloud e i metadati sull&#39;app non sono crittografati. Ciò rende più facile conoscere l&#39;ora e la posizione dei messaggi. Inoltre, sono emersi rapporti sulle chat di gruppo di WhatsApp indicizzate nella ricerca di Google che mettono in discussione la sicurezza delle sue chat di gruppo. </p> <p> </p> <h2 id=\"telegram\"> Telegramma </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegram è amato per il suo uso della crittografia e per i suoi messaggi che si autodistruggono. Purtroppo, ci sono diversi problemi di crittografia end-to-end con Telegram che potrebbero non sembrare così ovvi a molti utenti. </p> <p> Su Telegram, la crittografia end-to-end non è abilitata per impostazione predefinita. Viene offerto solo quando gli utenti passano alle chat segrete. Per gli utenti che non sono tecnicamente inclini, ciò presenta rischi per la sicurezza di cui potrebbero anche non essere a conoscenza. </p> <p> Telegram può accedere ai messaggi archiviati sui suoi server di cui è stato eseguito il backup sul cloud. Alcuni ritengono che ciò presenti ulteriori vettori di attacco che potrebbero portare a violazioni dei dati personali nei casi in cui i criminali informatici tentano di rubare dati di messaggistica dall&#39;applicazione. </p> <p> Detto questo, tutte le chat segrete in Telegram sono specifiche del dispositivo, il che significa che i messaggi che invii tramite chat segrete sono accessibili solo dal dispositivo da cui sono stati inviati. </p> <p> Mentre le chat segrete di Telegram sono crittografate end-to-end, le chat di gruppo non lo sono. Ciò significa che gli utenti potrebbero essere in grado di utilizzare più dispositivi per la stessa chat di gruppo. I registri della chat possono essere scaricati su più dispositivi dagli utenti. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Chat segrete attive <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #Telegramma </a> significa che i tuoi messaggi sono protetti dalla crittografia end-to-end e vengono eliminati dopo un determinato periodo di tempo. <br><br> Ecco come puoi attivare questa funzione. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> — Kaspersky (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 31 gennaio 2021 </a></blockquote>  <p> Telegram crea anteprime dei collegamenti sui suoi server remoti da chat normali e segrete. Quando un utente digita per la prima volta un collegamento in una chat segreta, l&#39;applicazione lo avverte che i collegamenti verranno inviati ai server remoti. Questo è considerato un punto debole della sicurezza poiché l&#39;invio di collegamenti condivisi in una chat privata a un server remoto va contro lo scopo della crittografia end-to-end. </p> <p> Il protocollo di crittografia di Telegram, MTProto, è progettato per l&#39;accesso a un&#39;API del server da applicazioni su dispositivi mobili. È proprietario e solo in parte open source. Ciò mette in discussione il controllo e la comprensione che il pubblico ha sui metodi di crittografia utilizzati per proteggere i propri messaggi. </p> <p> Per fortuna, l&#39;applicazione di messaggistica non ha subito gravi reclami sulle violazioni dei dati, ma è preoccupante sapere che è possibile per i suoi operatori accedere ai tuoi messaggi. </p> <p> Nonostante le preoccupazioni, molti potrebbero essere rassicurati dai vari passaggi legali che dovrebbero essere superati per accedere ai messaggi. Telegram ha chiarito in passato quanto sia difficile per le persone accedere ai messaggi sulla sua piattaforma. Le chiavi dovrebbero essere accessibili da diverse giurisdizioni, il che frustrerebbe molte persone. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> Scelta dell&#39;applicazione di messaggistica più sicura </h2> <p> Sebbene Signal possa non essere così popolare come WhatsApp, il suo protocollo ha contribuito in modo significativo al successo di WhatsApp con la crittografia end-to-end. Sebbene i suoi metodi di crittografia end-to-end siano simili a WhatsApp, è considerato migliore di WhatsApp per la crittografia end-to-end. Si distingue per l&#39;adozione di misure aggiuntive per proteggere gli utenti. </p> <p> La decisione di Telegram di non dare la priorità alla crittografia end-to-end è stata attribuita alla sua preferenza per la comodità. Laddove manca di crittografia, compensa, con i suoi metodi indiretti di protezione degli utenti con crittografia cloud e archiviazione delle chiavi in ​​diverse giurisdizioni legali. </p>"}