{"title":"Il governo degli Stati Uniti vuole conoscere l&#39;accuratezza delle etichette sulla privacy delle app","content":"<p> Con le etichette per la privacy delle app iOS 14 nell&#39;App Store, Apple offre agli utenti un nuovo modo di essere potenziati avendo maggiori conoscenze sulle app che utilizzano e su come tali app potrebbero tenerne traccia. </p> <p> Ma sembra che abbia anche potenzialmente aperto una lattina di worm per se stesso, dal momento che Apple viene ora spinta a garantire l&#39;accuratezza di queste etichette, che gli sviluppatori hanno iniziato a presentare ad Apple a dicembre. </p> <h2 id=\"concerns-over-accuracy\"> Preoccupazioni sulla precisione </h2> <p> Come notato da <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumors </a> , Apple ha ricevuto un <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> lettera </a> dal Comitato della Camera degli Stati Uniti per l&#39;energia e il commercio, chiedendogli di chiarire le informazioni sull&#39;accuratezza fornita dallo sviluppatore delle sue etichette sulla privacy delle app. </p> <p> Queste etichette sono una caratteristica di iOS 14 molto attesa da alcuni e temuta da altri che costringerà gli sviluppatori a essere più aperti su come le loro app interagiscono con i dati degli utenti. Significa che gli utenti saranno in grado di prendere una decisione più informata in merito ai vantaggi e agli svantaggi dell&#39;utilizzo di determinate app. </p> <p> </p> <p> Nella sua lettera, il Comitato della Camera degli Stati Uniti per l&#39;energia e il commercio chiede ad Apple informazioni sui rapporti che suggeriscono che alcune etichette sulla privacy delle app potrebbero fornire agli utenti informazioni &quot;fuorvianti e false&quot;. Ciò si basa su un rapporto, pubblicato il mese scorso, in cui si afferma che molte app con un buono stato di salute potrebbero non essere così innocenti come suggeriscono. </p> <p> Un potenziale problema con la funzione iOS 14 è che si basa sull&#39;onestà degli sviluppatori per dire come vengono raccolti i dati, nonché per confermare che queste informazioni siano accurate. La stessa Apple nota che le informazioni &quot;non sono state verificate da Apple&quot;. </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Richiedere una risposta da Apple </h2> <p> Sebbene sembri probabile che la maggior parte degli sviluppatori giochi in modo corretto e rispetti il ​​sistema di onore, non è qualcosa che può essere dato per scontato. Apple controllerà regolarmente le informazioni inviate. Tuttavia, l&#39;enorme numero di app nell&#39;App Store rende impossibile per Apple verificare personalmente ogni singola scheda. </p> <p> La lettera del Comitato della Camera degli Stati Uniti per l&#39;energia e il commercio continua che: </p> <blockquote> <p> &quot;Esortiamo Apple a migliorare la validità delle sue etichette sulla privacy delle app per garantire che ai consumatori vengano fornite informazioni significative sulle pratiche relative ai dati delle loro app e che i consumatori non siano danneggiati da queste pratiche potenzialmente ingannevoli&quot;. </p> </blockquote> <p> Il comitato ha chiesto ad Apple di fornire maggiori dettagli sul suo processo di audit, se le etichette sulla privacy delle app verranno corrette se ritenute non vere, dettagli su cosa succede quando gli sviluppatori forniscono informazioni imprecise e altro ancora. </p> <p> Stanno chiedendo ad Apple di rispondere con le informazioni richieste entro il 23 febbraio. </p> <p> <small> Credito immagine: Jason Dent/ <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Rimuovi CC </a></small> </p>"}