{"title":"Il co-fondatore di Netflix critica la strategia video di Apple TV+","content":"<p> L&#39;ex capo di Netflix, Marc Randolph, ha criticato la strategia video di Apple, affermando che Apple TV+ è in ritardo rispetto alla concorrenza a causa delle offerte gratuite dell&#39;azienda e della mancanza di contenuti accattivanti. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple non in streaming &quot;con entrambi i piedi&quot; </h2> <p> Se chiedi all&#39;ex CEO e co-fondatore di Netflix Marc Randolph, Apple TV è stata afflitta da un problema di freeloader che ha contribuito alla crescita anemica del servizio rispetto a Netflix, Disney+ e altri servizi di streaming di successo. </p> <p> parlando con <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Yahoo Finanza </a> , ha affermato che Apple TV+ sta sprecando energie in promozioni e offerte gratuite, mentre dovrebbe concentrarsi sull&#39;aggiunta di più contenuti di qualità per aumentare il valore. </p> <blockquote> <p> Se Apple spendesse un quarto del tempo sui contenuti rispetto agli omaggi, potrebbe davvero giocare. Non hanno scuse [e] non ci sono ancora dentro con entrambi i piedi. Devono davvero fare la cosa imprenditoriale e camminare fino al bordo della scogliera e saltare. </p> </blockquote> <p> Saltare dal bordo della scogliera può essere più facile a dirsi che a farsi perché Apple TV+ non ha il potere di mercato di Disney e il riconoscimento del marchio Netflix. In questo momento, è tutto su <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney+ contro Netflix </a> e quale servizio di streaming offre il miglior rapporto qualità-prezzo ai potenziali clienti. </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV+ ha il tasso di abbandono più alto </h2> <p> Randolph sta prendendo posizione contro omaggi e promozioni nel mercato dello streaming, suggerendo che Apple TV+‌ ha il &quot;più alto tasso di abbandono&quot; tra i principali servizi. </p> <blockquote> <p> Non puoi continuare a sostituire le persone. Devi dare loro un motivo per restare. </p> </blockquote> <p> MoffettNathanson-HarrisX ha scoperto che il 29% di coloro che si sono registrati tramite un programma gratuito non ha intenzione di abbonarsi nuovamente una volta scaduta la prova gratuita, come riportato da <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> Varietà </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> Offerte Apple TV+ gratuite </h2> <p> Apple offre 12 mesi di servizio Apple TV+ gratuito a tutti coloro che acquistano un nuovo dispositivo idoneo dall&#39;azienda, come un nuovo iPhone. Intanto, <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple ha esteso gli abbonamenti gratuiti di un anno </a> due volte per chi si è iscritto nel 2019. </p> <p> </p> <p> È un chiaro segnale che la stessa Apple non crede che il servizio fornisca abbastanza contenuti per giustificare il prezzo richiesto di $ 5 al mese. Guardala in un altro modo: se Apple TV+ avesse superato le proiezioni interne, Apple si sarebbe già vantata dei numeri degli abbonati. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney+ e Netflix offrono una concorrenza seria </h2> <p> Sono passati solo 15 mesi da quando Apple TV+ ha fatto il suo debutto a novembre 2019. Poco dopo è seguita Disney+. Apple non sta rivelando quanti abbonati paganti ha Apple TV+, ma Disney ha appena superato i 94 milioni di abbonati, superando di gran lunga anche le sue stesse aspettative. </p> <p> In confronto, Netflix contava 204 milioni di clienti paganti alla fine del 2020. Disney spera di poter eguagliare Netflix in termini di abbonati in soli 12 mesi. </p> <p> </p> <p> Randolph afferma che Disney+ ha &quot;combattuto per raggiungere una posizione davvero forte&quot; grazie ai contenuti. &quot;È davvero una guerra tra chi è pronto a creare il contenuto&quot;, ha aggiunto. </p> <blockquote> <p> Stiamo assistendo allo sviluppo delle nuove regole del gioco. Questo non è solo un annuncio, non è solo avere una promozione --- quello che devi dimostrare è che hai il contenuto, il contenuto, il contenuto. </p> </blockquote> <p> In effetti, il gioco riguarda il contenuto. Ad esempio, come indicato in <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> i suoi piani per il 2021 </a> , Netflix lancerà un nuovo film originale ogni settimana per tutto l&#39;anno. Al contrario, Apple TV+ presenta una manciata di film come il dramma della seconda guerra mondiale con protagonista Tom Hanks Greyhound (basato su eventi reali), il dramma originale Palmer con Justin Timberlake e On The Rocks di Sofia Coppola, solo per citarne alcuni. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> L&#39;approccio a combustione lenta di Apple </h2> <p> Ciò che Randolph non riconosce è che Netflix e Disney+ hanno avuto enormi quantità di contenuti fin dal primo giorno, mentre Apple TV+ sta costruendo da zero la sua libreria di contenuti. </p> <p> Apple ha ovviamente optato per un approccio a combustione lenta, come dimostra la scarsità di spettacoli relativi a Disney+ e Netflix. Non importa come la si guardi, la sua strategia con Apple TV+ sembra richiedere di attirare le persone con offerte gratuite nella speranza che il servizio raccolga abbastanza contenuti di qualità per convertire i clienti gratuiti in abbonati paganti. </p>"}