{"title":"Il browser Edge di Microsoft ospitava emulatori di giochi Nintendo segreti Secret","content":"<p> Microsoft ha eliminato una serie di emulatori di giochi illegali nascosti nel suo negozio di estensioni del browser Microsoft Edge. Il negozio di estensioni di Microsoft Edge ospitava decine di emulatori, che consentivano agli utenti di giocare a diversi giochi iconici, nessuno dei quali veniva pubblicato legalmente nel negozio. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft rimuove gli emulatori di estensioni Edge illegali </h2> <p> In agguato nel negozio di estensioni Microsoft Edge c&#39;erano alcuni dei giochi più iconici di tutti i tempi, tra cui Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2 e persino Minecraft. Ogni gioco è stato lanciato all&#39;interno del browser in una finestra dell&#39;emulatore e ha permesso agli utenti di giocare completamente a ogni titolo. </p> <p> Tuttavia, nessuno dei titoli classici elencava gli sviluppatori di giochi ufficiali, come Nintendo, Sega, Atari e sì, nemmeno Microsoft. I nomi degli sviluppatori elencati includevano Gamelands, Kday e StayReal, tutti interamente inventati e non hanno collegamenti agli sviluppatori originali. </p> <p> Stranamente, l&#39;account Twitter ufficiale di Microsoft Edge Development, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , pubblicato sugli emulatori, che sembra promuovere i giochi disponibili nel negozio di estensioni del browser. Non abbiamo catturato il tweet originale che promuoveva gli emulatori, ma una copia è disponibile tramite <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Resetera </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> Gli emulatori sono illegali? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Gli emulatori ti consentono di eseguire diversi software </a> sul tuo computer. Puoi anche usare un emulatore per giocare a vecchi giochi. </p> <p> Mentre gli emulatori stessi non sono illegali, il download di contenuti protetti da copyright per riprodurli su un emulatore lo è. Il tweet dell&#39;account Microsoft Edge Development ufficiale è stata una mossa strana in quanto gli emulatori hanno scaricato una nuova copia della ROM del gioco per farla giocare all&#39;utente. </p> <p> Anche il tema dell&#39;abbandono del software è un po&#39; un&#39;area grigia. I giochi Abandonware non vengono più pubblicati e non sono più disponibili per la vendita online o in un negozio. Tuttavia, in molti casi, il copyright su questi giochi non è scaduto, ma il detentore del copyright non sta facendo valere attivamente i suoi diritti. </p> <p> </p> <p> In molti casi, l&#39;abbandono del software è illegale. Tuttavia, non ci sono casi giudiziari relativi all&#39;abbandono del software, o almeno nessuno relativo a un vecchio sviluppatore di giochi che persegue qualcuno per aver scaricato un titolo abbandonato. </p> <p> In questo esempio esatto, l&#39;emulazione di questi vecchi giochi all&#39;interno di un browser web è illegale. Inoltre, Nintendo è nota per la rimozione di siti o servizi che tentano di replicare o ridistribuire la sua proprietà intellettuale. </p> <p> Attualmente, i giochi sono stati rimossi dall&#39;archivio delle estensioni di Microsoft Edge. Inoltre, non si sa ancora come i giochi emulati siano finiti nell&#39;extension store o chi li abbia messi lì. Inutile dire che è improbabile che tornino. </p>"}