{"title":"iPhone 13 potrebbe vantare il display &quot;Sempre acceso&quot;","content":"<p> Apple ha introdotto il suo display &quot;always on&quot; per l&#39;Apple Watch Series 5 nel 2019. Un paio di anni dopo, potrebbe essere impostato per arrivare su iPhone, secondo il giornalista Max Weinbach, che ha condiviso le informazioni con il canale YouTube <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> TuttoApplePro </a> . </p> <p> Il rapporto afferma che l&#39;iPhone 13, se è così che Apple decide di chiamarlo, avrà permanentemente illuminate alcune sezioni dello schermo per mostrare alcuni dettagli. </p> <h2 id=\"how-always-on-display-will-work\"> Come funzionerà il display &quot;Sempre attivo&quot;? </h2> <p> Questi dettagli potrebbero includere sia l&#39;orologio che le icone della batteria. Rimarrebbero visibili anche quando l&#39;iPhone è bloccato, il che significa che non viene utilizzato attivamente dall&#39;utente. Le notifiche, come gli avvisi di nuovi messaggi, verrebbero illuminate solo temporaneamente. </p> <p> Questa sarebbe la prima volta che l&#39;iPhone viene fornito con la tecnologia di visualizzazione &quot;always on&quot;. Tuttavia, non sarebbe affatto la prima volta che una tecnologia simile si fa strada su uno smartphone. Nokia ha introdotto una funzionalità dello schermo &quot;sempre attivo&quot; già nel 2009. Più recentemente, è diventata una funzionalità ampiamente disponibile su vari telefoni Android, inclusi i modelli realizzati da Huawei, Motorola, Samsung, Google e altri. </p> <p> Il grande, ovvio vantaggio di &quot;sempre attivo&quot; è che non richiede che l&#39;utente si riattivi o sblocchi il proprio telefono per accedere alle informazioni, anche se si tratta di qualcosa di poco importante come controllare l&#39;ora. </p> <p> Il rovescio della medaglia è che consuma una durata extra della batteria, che può già essere una specie di premio sugli smartphone. Tuttavia, i display AMOLED possono ridurre l&#39;impatto della batteria attivando solo quei pixel sul display necessari per mostrare le informazioni. </p> <p> In altre parole, questo display &quot;sempre attivo&quot; è sempre attivo in senso tecnico, anche se la maggior parte dello schermo è spenta e solo poche parti rimangono illuminate per tutto il tempo. Ciò significa che l&#39;effetto sulla durata della batteria non è così importante come potrebbe essere altrimenti. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> Cosa aspettarsi da iPhone 13 </h2> <p> L&#39;iPhone di nuova generazione arriverà probabilmente a settembre 2021. Secondo Weinbach, vanterà lo stesso design complessivo del telaio della serie iPhone 12, anche se ci saranno alcuni aggiornamenti sotto il cofano. </p> <p> Questi includeranno magneti MagSafe più potenti, un sistema fotografico migliorato per scattare immagini della luna e delle stelle, obiettivo della fotocamera ultra-wide su tutta la gamma di iPhone, video in modalità verticale (piuttosto che solo immagini fisse), retro opaco raffinato e A- chip di serie. Un rapporto precedente ha affermato che Apple potrebbe <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> introdurre Touch ID in-display </a> in alternativa a Face ID. </p> <p> Dato che manca ancora più di mezzo anno, molti nuovi dettagli potrebbero emergere prima che Apple mostri il suo prossimo iPhone nel terzo trimestre. Tuttavia, sembra che il pettegolezzo stia già iniziando a entrare in azione. Guarda questo spazio! </p>"}