{"title":"JPG vs JPEG: qual è la differenza tra questi formati di file immagine?","content":"<p> Non tutti i formati di file immagine sono uguali. Molte di esse, infatti, sono state create per affrontare un problema che un formato già esistente non poteva risolvere. Il JPEG, ad esempio, è nato perché le dimensioni dei file di immagine stavano consumando troppo spazio di archiviazione. </p> <p> Che ci crediate o no, le estensioni dei file JIF, JPEG e JPG si riferiscono più o meno alla stessa cosa. Per capire perché il formato del file ha così tanti nomi, dobbiamo svelare un po&#39; di storia contorta. </p> <h2 id=\"what-is-a-jpeg\"> Che cos&#39;è un JPEG? </h2> <p> L&#39;acronimo JPEG sta per Joint Photographic Experts Group: il tipo di file prende il nome dal sottocomitato che ha contribuito a creare lo standard JPEG Interchange Format (JIF). È stato rilasciato per la prima volta nel 1992 dall&#39;International Organization for Standardization (ISO). </p> <p> I JPEG sono immagini raster fisse a 24 bit, con otto bit in ciascun canale del modello di colore RGB. Questo non lascia spazio per un canale alfa, il che significa che mentre i JPEG possono supportare oltre 16 milioni di colori, non possono supportare la trasparenza. </p> <p> Quando un&#39;immagine viene salvata come JPEG, alcuni dei suoi dati vengono eliminati in un processo denominato lossy <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> compressione dei file </a> . A sua volta, l&#39;immagine occupa il 50-75 percento in meno di spazio di archiviazione (rispetto ai vecchi formati come BMP) con una perdita minima o nulla percettibile della qualità dell&#39;immagine. </p> <p> La compressione JPEG si basa su una tecnica di compressione delle immagini con perdita di dati chiamata trasformata del coseno discreta (DCT), proposta per la prima volta dall&#39;ingegnere elettrico Nasir Ahmed nel 1972. </p> <h3 id=\"what-is-a-jif\"> Che cos&#39;è un JIF? </h3> <p> Puoi pensare che un file JIF sia come un JPEG nella sua forma &quot;più pura&quot;. Tuttavia, il formato non è più utilizzato molto perché presentava alcune limitazioni frustranti. Ad esempio, le definizioni di aspetto del colore e dei pixel di un JIF hanno causato problemi di compatibilità tra codificatori e decodificatori (visualizzatori). </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> Per fortuna, questi problemi sono stati successivamente risolti da altri standard &quot;supplementari&quot; basati sul JIF. Il primo di questi è stato il JPEG File Interchange Format (JFIF), e più tardi, il <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Formato file immagine intercambiabile </a> (Exif) e profili colore ICC. </p> <p> JPEG/JFIF è il formato attualmente più popolare per l&#39;archiviazione e la trasmissione di immagini fotografiche su Internet, mentre JPEG/Exif è quello per fotocamere digitali e altri dispositivi di acquisizione delle immagini. La maggior parte delle persone non distingue la differenza tra queste variazioni e si riferisce semplicemente a entrambe come solo JPEG. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> Che cos&#39;è un JPG2 o JPF? </h3> <p> Nel 2000, il gruppo JPEG ha rilasciato un altro formato di file immagine chiamato JPEG 2000 (le sue estensioni di file sono JPG2 e JPF). Doveva essere un successore del JPEG, ma non era affatto così popolare. Anche quando il suo metodo di codifica avanzato spesso portava a immagini di qualità migliore. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Credito immagine: Dake/ <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Il formato di file JPEG 2000 è floppato per una piccola manciata di motivi. Per prima cosa, era basato su un codice completamente nuovo e quindi non era retrocompatibile con il JPEG. Inoltre, la gestione dei file JPEG 2000 richiedeva più memoria per l&#39;elaborazione, il che all&#39;epoca era un po&#39; un rompicapo. Dopotutto, il computer medio all&#39;epoca aveva solo 64 MB di memoria. </p> <p> Il JPEG 2000 ha visto un po&#39; di rinascita ora che l&#39;hardware del computer, in generale, è notevolmente migliorato negli ultimi 20 anni, ma il formato del file è ancora molto sottoutilizzato. L&#39;unico browser Internet che supporta i file JPEG 2000 al momento della scrittura è Safari. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG contro JPG </h3> <p> Le prime versioni di Windows (in particolare i file system MS-DOS 8.3 e FAT-16) avevano un limite massimo di 3 lettere quando si trattava della lunghezza delle estensioni dei file. JPEG doveva essere abbreviato in JPG per non superare il limite. I computer Mac e Linux non hanno mai avuto una cosa del genere, quindi gli utenti continuerebbero a salvare le immagini come JPEG. </p> <p> </p> <p> Programmi di modifica delle immagini popolari che funzionavano su diversi sistemi operativi, come Photoshop e <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> Gimp </a> —potrebbero eventualmente impostare l&#39;estensione del file JPEG predefinita su JPG nel tentativo di ridurre al minimo la confusione. </p> <p> Ed è così che abbiamo ottenuto due estensioni di file per lo stesso formato: JPEG e JPG. Quando scegli come salvare la tua immagine, non c&#39;è differenza tra loro. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG e PNG: cosa è meglio? </h2> <p> </p> <p> Il JPEG e il PNG sono stati rilasciati nello stesso decennio, con ogni formato di file che risolveva un diverso problema di immagine digitale che il mondo della tecnologia doveva affrontare all&#39;epoca. Si potrebbe dire che è naturale che vengano costantemente confrontati... e lo sono, anche oggi. Tra JPEG e PNG, quale formato di file immagine regna sovrano? </p> <p> Onestamente, la risposta dipende dal tipo di immagine che stai salvando. </p> <p> I JPEG sono più adatti per le fotografie perché utilizzano la compressione con perdita di dati per mantenere dimensioni di file ragionevoli. Le fotografie sono immagini così grandi e dettagliate che gli artefatti della compressione (sottili distorsioni dell&#39;immagine causate dalla compressione) non sono molto evidenti su di esse. </p> <p> D&#39;altra parte, le immagini con punti netti, bordi netti e con ampie aree di un colore (ad esempio loghi vettoriali, pixel art, ecc.) non hanno un aspetto corretto quando vengono salvate come JPEG. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Credito immagine: Axel Grimard/ <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> È qui che potrebbe entrare in gioco il file Portable Network Graphics (PNG). Sviluppato dal PNG Development Group quattro anni dopo il rilascio di JPEG, il PNG supporta la compressione e la trasparenza dei dati senza perdita di dati. I PNG vengono quindi spesso utilizzati se è necessario mantenere la qualità dell&#39;immagine e la dimensione del file non è un problema. </p> <p> Una buona regola è mantenere JPEG per le fotografie e salvare PNG per immagini con trasparenza e immagini non fotografiche. Per ulteriori informazioni sui diversi tipi di file (non solo immagini), consulta la nostra guida a <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> sapere quando usare quale formato di file. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG e JPG sono lo stesso formato di file </h2> <p> Nonostante la confusione che il JPEG ha causato con i suoi numerosi aggiornamenti e variazioni, l&#39;eventuale flusso di immagini digitali su Internet a metà degli anni &#39;90 è stato senza dubbio causato principalmente dalla sua uscita. </p> <p> La prossima volta che sei pronto per esportare una foto da un editor di immagini e ti viene presentato il lungo elenco di formati disponibili, ricorda: JPEG e JPG sono la stessa cosa. </p>"}