{"title":"L&#39;ennesimo marchio non ufficiale di frontalini per PS5 è in scena","content":"<p> dbrand, che produce skin, schermi e custodie per una varietà di dispositivi, si è unito a Sony e ha rilasciato il proprio frontalino non ufficiale per PS5. </p> <h2 id=\"dbrand-releases-darkplates\"> dbrand rilascia Darkplates </h2> <p> Se stai cercando di personalizzare la tua PS5, dbrand è l&#39;ultima azienda ad offrire faceplate di terze parti non ufficiali per la console di nuova generazione. Li chiamano Darkplates, perché sono mascherine nere. </p> <p> Puoi controllare le targhe su <a href=\"https://dbrand.com/shop/special-edition/ps5\" target=\"_blank\" rel=\"nofollow noopener\"> negozio dbrand </a> , dove è possibile acquistare i frontalini neri opachi per $ 49,00 (al momento della scrittura). </p> <p> Puoi anche prendere quella che dbrand chiama una &quot;pelle di mezzo&quot;, che è un adesivo in vinile che va sul pannello centrale nero lucido della PS5. Questo costa $ 11,95 in più ed è disponibile in una gamma di colori e design. </p> <p> <img alt=\"dbrand shell texture detail\" src=\"images/dbrand-shell-texture-detail-544.png\" loading=\"lazy\"> </p> <p> Noterai anche che si vanta della sua trama del frontalino. Questo è simile a <a href=\"https://www.makeuseof.com/sony-how-ps5-controller-textured-playstation-symbols/\" target=\"_blank\" rel=\"nofollow noopener\"> i minuscoli simboli PlayStation che troverai sul DualSense </a> , altri accessori ufficiali per PS5 e i frontalini originali forniti con la console al momento dell&#39;acquisto. Simile, ma sono così impressionanti? </p> <p> </p> <h2 id=\"will-dbrand-last\"> dbrand durerà? </h2> <p> Hai senza dubbio visto il nostro <a href=\"https://www.makeuseof.com/cmp-shells-ps5-faceplate-colors/\" target=\"_blank\" rel=\"nofollow noopener\"> copertura del faceplategate per quanto riguarda CMP Shells </a> , che ha reso abbastanza trionfante il ban di Sony dopo il ritorno. Alcuni potrebbero dire che il suo ritorno è stato arrogante, poiché ha dichiarato legalmente intoccabili i suoi nuovi frontalini. Vedremo. </p> <p> </p> <p> Questo ti fa chiedere perché dbrand si sia preoccupato. Sony categoricamente <strong> non l&#39;ho fatto </strong> prendi gentilmente CMP Shells, in primo luogo perché il suo precedente marchio era troppo simile a PlayStation (PlateStation). </p> <p> Quindi, Sony ha contestato perché ha deciso che i frontalini facevano parte del design della console e quindi copiarli era una violazione della proprietà intellettuale. Cue il battito del martelletto del divieto. CMP Shells ha terminato la produzione, annullando tutti gli ordini prima di riemergere nella sua nuova forma. </p> <p> dbrand è già alla sua quarta ondata di prevendite di clienti potenzialmente insoddisfatti, quindi devi essere veloce se vuoi prendere uno dei faceplate personalizzati. Se le lastre raggiungeranno effettivamente la produzione è un&#39;altra questione. Sony potrebbe far cadere di nuovo il martello. </p> <p> </p> <h2 id=\"should-you-buy-a-dbrand-faceplate\"> Dovresti acquistare un frontalino dbrand? </h2> <p> Come per la saga di CMP Shells, consigliamo a chiunque sia interessato a personalizzare i frontalini di PS5 di prestare attenzione. Questi sono prodotti di terze parti e quindi non hai modo di confermare la loro qualità oltre a quello che ti dice il marchio. </p> <p> Inoltre, data l&#39;insistenza di Sony sul fatto che PlateStation (ora CMP Shells) dovesse cessare la produzione, non sarebbe una sorpresa se non chiamerà rapidamente i suoi avvocati per occuparsi anche del caso di dbrand. </p> <p> In breve, fai attenzione se vuoi personalizzare i tuoi frontalini. CMP Shells ha rimborsato tutti i suoi clienti la prima volta. Ma questo non significa che un altro marchio lo farà. </p> <p> </p> <h2 id=\"do-you-really-need-to-customize-your-ps5\"> Hai davvero bisogno di personalizzare la tua PS5? </h2> <p> <img alt=\"ps5\" src=\"images/ps5-183.jpg\" loading=\"lazy\"> </p> <p> Se non sei soddisfatto dell&#39;aspetto della tua PS5, puoi sempre modificarla in altri modi (significativamente meno costosi). Puoi sempre aggiungere una skin in vinile alla console se vuoi che abbia un aspetto diverso. </p> <p> La PS5 è stata lanciata solo a novembre 2020. Forse prova a giocarci qualche gioco prima di sentire l&#39;irresistibile voglia di cambiare l&#39;aspetto estetico della tua console. </p>"}