{"title":"LastPass ti limiterà a un tipo di dispositivo a meno che tu non paghi","content":"<p> LastPass, il popolare gestore di password, sta subendo un grande cambiamento. Presto, coloro che utilizzano il servizio gratuitamente potranno farlo solo su computer o cellulari, ma non su entrambi, a meno che non paghino. </p> <p> Significa che LastPass non è più una scelta interessante come gestore di password gratuito. In un mondo in cui passiamo costantemente tra computer e cellulari, avere un gestore di password che funziona solo per un tipo di dispositivo è inutile. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> Cosa cambia in LastPass Free? </h2> <p> Come annunciato sul <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog LastPass </a> , sono in corso modifiche per la versione gratuita del gestore di password. </p> <p> Attualmente, LastPass Free ti consente di utilizzare il servizio su tutti i tuoi dispositivi. Che tu usi LastPass sul tuo computer, tablet o cellulare, non importa. Tutto questo è gratuito. Questo dovrebbe cambiare il 16 marzo 2021. </p> <p> Da allora, LastPass Free includerà solo dispositivi illimitati di un tipo: computer o cellulari. </p> <p> Per LastPass, i computer sono classificati come qualsiasi desktop o laptop, mentre i cellulari sono telefoni cellulari, tablet e smartwatch. </p> <p> Quando accedi per la prima volta a LastPass il 16 marzo, dovrai impostare il tipo di dispositivo attivo. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> Ad esempio, se scegli i computer come tipo di dispositivo, sarai in grado di utilizzare LastPass sui tuoi dispositivi desktop e laptop. Tuttavia, se desideri utilizzare LastPass su qualsiasi dispositivo mobile, dovrai eseguire l&#39;aggiornamento a LastPass Premium. </p> <p> In un certo senso, questo sta tornando al LastPass di una volta. La possibilità di utilizzare LastPass gratuitamente su desktop e dispositivi mobili è diventata disponibile solo nel 2015. Prima di allora, dovevi pagare per il supporto mobile. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> Anche il supporto LastPass sta cambiando </h2> <p> LastPass sta anche cambiando il modo in cui fornisce supporto. Dal 17 maggio 2021, l&#39;assistenza via email sarà disponibile solo per i clienti Premium e Family. </p> <p> Gli utenti gratuiti rimarranno bloccati con gli articoli della guida disponibili sul sito Web di supporto LastPass, oppure possono chiedere aiuto all&#39;interno della comunità LastPass. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> Tutti dovrebbero usare un gestore di password </a> . È probabile che sia necessario utilizzarlo su desktop e dispositivi mobili. LastPass lo sa e fa affidamento sull&#39;aggiornamento degli utenti al servizio a pagamento, che attualmente è scontato del 25% per $ 27 all&#39;anno. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> È ora di cambiare gestore di password? </h2> <p> Se usi LastPass Free, è probabile che questo ti abbia fatto prendere in considerazione il passaggio. In tal caso, ci sono molti altri ottimi gestori di password che puoi utilizzare gratuitamente su tutti i tuoi dispositivi. </p> <p> Poi di nuovo, forse pensi che sia giusto pagare una piccola somma a LastPass a sostegno del servizio che fornisce. </p>"}