{"title":"L&#39;intelligenza artificiale di Facebook che rileva l&#39;incitamento all&#39;odio sta dando i suoi frutti","content":"<p> Facebook sta migliorando la sua efficienza nel riconoscere e rimuovere i contenuti che incitano all&#39;odio. La piattaforma <a href=\"https://transparency.facebook.com/community-standards-enforcement\" target=\"_blank\" rel=\"nofollow noopener\"> Rapporto sull&#39;applicazione degli standard comunitari </a> mostra una significativa riduzione della prevalenza dell&#39;incitamento all&#39;odio nell&#39;ultimo trimestre del 2020. </p> <h2 id=\"hate-speech-on-facebook-has-dipped\"> L&#39;incitamento all&#39;odio su Facebook è diminuito </h2> <p> Nel rapporto sull&#39;applicazione degli standard della comunità di Facebook da ottobre a dicembre 2020, la piattaforma ha rivelato importanti miglioramenti nel modo in cui Facebook gestisce l&#39;incitamento all&#39;odio. Guy Rosen, vicepresidente dell&#39;integrità di Facebook, ha pubblicato un post su <a href=\"https://about.fb.com/news/2021/02/community-standards-enforcement-report-q4-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> il blog About Facebook Facebook </a> per evidenziare il suo successo. </p> <p> Per ogni 10.000 visualizzazioni di contenuti di Facebook, solo da sette a otto erano visualizzazioni di contenuti che incitano all&#39;odio. Facebook ha anche preso provvedimenti su 6,3 milioni di post di bullismo e molestie, in aumento rispetto a 2,5 milioni di post nel terzo trimestre. </p> <p> La piattaforma è stata anche in grado di catturare 6,4 milioni di contenuti di odio organizzati, un enorme miglioramento rispetto ai quattro milioni di contenuti rimossi da Facebook nel trimestre precedente. </p> <p> Il Rapporto sull&#39;applicazione degli standard della comunità ha mostrato miglioramenti simili su Instagram. Cinque milioni di post relativi a molestie e bullismo sono stati rimossi su Instagram, insieme a 6,6 milioni di contenuti contenenti discorsi di odio e 308.000 contenuti di odio organizzati. Tutti questi numeri superano le statistiche registrate nel terzo trimestre. </p> <p> Anche il tasso proattivo di Facebook, noto anche come la quantità di contenuti che Facebook rimuove prima che un utente lo segnali, è migliorato. Per bullismo e molestie, il tasso proattivo della piattaforma è aumentato dal 26% al 49% su Facebook e dal 55% all&#39;80% su Instagram. </p> <p> <img alt=\"Facebook graph for bullying\" src=\"images/facebook-content-takedowns-q4-715.png\" loading=\"lazy\"> Credito immagine: Facebook </p> <p> <a href=\"https://www.makeuseof.com/facebooks-ai-tackles-hateful-content/\" target=\"_blank\" rel=\"nofollow noopener\"> L&#39;intelligenza artificiale di Facebook che rileva l&#39;odio </a> ha svolto un ruolo importante nel potenziare la sua risposta all&#39;incitamento all&#39;odio. Rosen osserva che la piattaforma ha apportato miglioramenti alla sua intelligenza artificiale &quot;dove le sfumature e il contesto sono essenziali, come incitamento all&#39;odio o bullismo e molestie&quot;, che alla fine ha contribuito a ridurre la quantità di contenuti che incitano all&#39;odio su Facebook. </p> <p> Mike Schroepfer, chief technology officer di Facebook, ha pubblicato un post separato su <a href=\"https://about.fb.com/news/2021/02/update-on-our-progress-on-ai-and-hate-speech-detection/\" target=\"_blank\" rel=\"nofollow noopener\"> il blog About Facebook Facebook </a> per celebrare i risultati dell&#39;IA in costante miglioramento di Facebook. Nonostante i suoi recenti risultati, Schroepfer spera che l&#39;intelligenza artificiale di Facebook possa migliorare &quot;nella visualizzazione dei contenuti nel contesto di lingue, culture e aree geografiche diverse&quot;. </p> <p> </p> <h2 id=\"facebook-s-ai-is-getting-smarter\"> L&#39;intelligenza artificiale di Facebook sta diventando più intelligente </h2> <p> Facebook ha iniziato a fare più affidamento sul suo sistema di intelligenza artificiale per valutare i contenuti che incitano all&#39;odio a causa della pandemia di COVID-19 in corso. Rosen ha osservato che il team di Facebook sarà probabilmente ancora colpito dalla pandemia &quot;fino a quando un vaccino non sarà ampiamente disponibile&quot;. </p> <p> Anche se un giorno i moderatori di Facebook torneranno a lavorare normalmente, non sembra che l&#39;intelligenza artificiale della piattaforma stia andando da nessuna parte. Facebook ha solo reso la sua intelligenza artificiale più intelligente ed efficiente e non sembra che Facebook abbia intenzione di smettere di progredire presto. </p>"}