{"title":"L&#39;ultimo aggiornamento di WatchOS difende dal bug di Apple Watch-Bricking","content":"<p> L&#39;ultimo aggiornamento di watchOS di Apple, versione software 7.3.1, include una correzione molto importante: la risoluzione di un bug che impedisce ad alcuni dispositivi Apple Watch Series 5 e Apple Watch SE di caricarsi quando entrano in modalità Riserva di carica. </p> <p> L&#39;azienda ha anche lanciato un nuovo programma di riparazione gratuito per i dispositivi interessati che sono intrappolati in questa modalità a basso consumo e non riescono a uscirne. Questo bug essenzialmente &quot;incrina&quot; il loro Apple Watch, rendendolo non più funzionante. </p> <h2 id=\"the-power-reserve-mode-bug\"> Il bug della modalità di riserva di carica </h2> <p> La modalità Riserva di carica viene avviata quando la batteria di un Apple Watch è quasi scarica. Impedisce al tuo Apple Watch di comunicare con il tuo iPhone. Inoltre, impedisce agli utenti di accedere ad altre funzionalità su Apple Watch. Per uscire dalla modalità Riserva di carica, gli utenti devono caricare il proprio Apple Watch. </p> <p> su un <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> pagina di supporto sul bug e sul programma di riparazione </a> , datato 15 febbraio, Apple inizia osservando: </p> <blockquote> <p> Un numero molto ristretto di clienti con modelli Apple Watch Series 5 o Apple Watch SE con watchOS 7.2 o 7.3 ha riscontrato un problema con l&#39;orologio che non si ricarica dopo che è entrato in Riserva di carica. </p> </blockquote> <p> Per scoprire se disponi di un modello di Apple Watch interessato, Apple consiglia di posizionare l&#39;orologio su un caricabatterie e attendere almeno 30 minuti. Se non si carica, contatta il supporto Apple e organizzeranno una riparazione gratuita per posta. </p> <p> Gli orologi verranno esaminati per verificarne l&#39;idoneità e, a condizione che lo siano, la riparazione verrà eseguita gratuitamente e l&#39;orologio riparato verrà restituito al proprietario. </p> <p> Non è chiaro esattamente quanti Apple Watch siano seriamente interessati dal bug. Tuttavia, sembra che il problema riguardi solo un sottoinsieme di modelli Apple Watch Series 5 o Apple Watch SE e nessun altro modello. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> Come eseguire l&#39;aggiornamento a WatchOS 7.3.1 </h2> <p> Per coloro che non hanno riscontrato il bug, vale comunque la pena eseguire l&#39;aggiornamento all&#39;ultima versione di watchOS solo per proteggersi da ciò che potrebbe accadere. </p> <p> L&#39;importanza della correzione del bug è indicata dal fatto che Apple ha immediatamente rilasciato watchOS 7.3.1 a tutti gli utenti. Questo è in contrasto con il modo in cui normalmente rilascia gli aggiornamenti software rendendoli inizialmente disponibili agli sviluppatori per i beta test. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple ha rilasciato watchOS 7.3 </a> a fine gennaio. </p> <p> Gli utenti possono scaricare watchOS 7.3.1 utilizzando l&#39;app Apple Watch su iPhone. Per fare questo, devono andare a <strong> Generale &gt; Aggiornamento software </strong> . Il tuo Apple Watch deve avere almeno il 50 percento di batteria per potersi aggiornare. Deve anche essere nelle immediate vicinanze del tuo iPhone. </p>"}