{"title":"Microsoft lancia Azure Into Space con Spaceborne Computer-2 di HPE","content":"<p> Microsoft sta andando oltre i confini del pianeta per fornire servizi extraterrestri. La società lavorerà con Hewlett Packard Enterprises per connettersi a un PC sulla Stazione Spaziale Internazionale (ISS) tramite la sua piattaforma Azure. </p> <p> Lo Spaceborne Computer-2 si collegherà ad Azure tramite la NASA e le stazioni di terra HPE, fornendo una grande potenza di elaborazione dei dati alla stazione spaziale. </p> <h2 id=\"azure-heads-into-space\"> Azure si dirige nello spazio </h2> <p> Come riportato su <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> il blog di Microsoft Azure </a> , lo Spaceborne Computer-2 (SBC-2) fornirà agli astronauti della ISS tecnologie più simili alle loro controparti terrestri. </p> <p> La speranza è che riduca drasticamente la quantità di tempo necessaria per trasferire i dati tra la ISS e la Terra, oltre a ridurre la quantità di larghezza di banda necessaria per l&#39;elaborazione e l&#39;analisi. </p> <blockquote> <p> Gli astronauti e gli esploratori spaziali meritano l&#39;accesso alle migliori tecnologie di cloud computing e all&#39;elaborazione avanzata all&#39;avanguardia. A volte l&#39;analisi deve essere eseguita immediatamente al limite dove conta ogni momento che passa, e altre volte l&#39;analisi è così massicciamente complessa che può essere eseguita solo con la potenza del cloud iperscala. </p> </blockquote> <p> Spaceborne Computer-2 utilizza il sistema Edgeline Converged Edge di Hewlett Packard Enterprises, che è &quot;progettato appositamente per gli ambienti edge difficili&quot; e porterà un sacco di funzionalità di Azure sulla ISS. </p> <p> Quando la connessione sarà attiva, l&#39;SBC-2 consentirà la ricerca in aree tra cui la modellazione meteorologica per le future missioni su Marte, l&#39;analisi delle piante e idroponica per supportare la crescita di cibo e colture nello spazio e l&#39;imaging medico sulla stessa ISS (per supportare l&#39;assistenza sanitaria degli astronauti ). </p> <p> Il Dr. Mark Fernandez, Solutions Architect di Converged Edge Systems presso HPE e Principal Investigator per Spaceborne Computer-2, ha dichiarato: </p> <blockquote> <p> Unendo Spaceborne Computer-2 di HPE, che si basa sul sistema HPE Edgeline Converged Edge per l&#39;edge computing avanzato e funzionalità di intelligenza artificiale, con Microsoft Azure per connettersi al cloud, stiamo consentendo agli esploratori dello spazio di trasmettere senza soluzione di continuità grandi set di dati da e verso Earth e beneficia di un&#39;esperienza edge-to-cloud </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> La prossima fase dell&#39;iniziativa Azure Space di Microsoft </h2> <p> L&#39;annuncio di Microsoft è un altro passo avanti per la sua <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Spazio Microsoft Azure </a> iniziativa, lanciata nell&#39;ottobre 2020. </p> <p> L&#39;iniziativa Azure Space è lo sforzo di Microsoft per fare &quot;il prossimo passo da gigante nel cloud computing&quot;, portando la sua piattaforma di cloud computing Azure nello spazio. </p> <p> </p> <p> Azure Space ha precedentemente collaborato con il progetto SpaceX Starlink per fornire banda larga satellitare al suo Azure Modular Datacenter (MDC) e continua il suo lavoro sul progetto Azure Orbital, che estenderà la connettività tra i suoi data center cloud utilizzando la tecnologia satellitare. </p>"}