{"title":"Mark Zuckerberg di Facebook ha preso personalmente la spinta alla privacy di Apple","content":"<p> Secondo quanto riferito, il CEO di Facebook Mark Zuckerberg ha detto ai dipendenti di Facebook che &quot;Dobbiamo infliggere dolore&quot; ad Apple per aver trattato così male il gigante dei social media <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> giornale di Wall Street </a> rapporti. </p> <p> Zuckerberg avrebbe fatto il commento nel 2018 dopo che i dirigenti di Apple e Facebook si sono scontrati per lo scandalo Cambridge Analytica, in cui i dati personali di milioni di utenti di Facebook sono stati accessibili senza il loro consenso per pubblicità politica. </p> <h2 id=\"apple-vs-facebook\"> Apple contro Facebook </h2> <p> All&#39;epoca, il CEO di Apple Tim Cook è stato interrogato in un&#39;intervista su come avrebbe risposto se si fosse trovato nella situazione di Zuckerberg, di fronte alla crisi. &quot;Non sarei in questa situazione&quot;, ha detto Cook. </p> <p> Il Wall Street Journal afferma che, mentre Zuckerberg ha commentato che le parole di Cook erano &quot;estremamente disinvolte&quot; e &quot;per nulla in linea con la verità&quot;, dietro le quinte è stato considerevolmente più duro nella sua valutazione. </p> <p> Da allora, il rapporto tra le due società tecnologiche non è migliorato. Apple ha raddoppiato la sua posizione orientata alla privacy, con Cook che ha proclamato che la privacy è una delle <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> le preoccupazioni più urgenti del mondo </a> . iOS 14 contiene più funzionalità relative alla privacy, con cui Facebook ha contestato, sostenendo che hanno il potenziale per danneggiare le piccole imprese. </p> <p> Durante l&#39;ultima chiamata trimestrale degli investitori di Facebook, Zuckerberg ha etichettato Apple &quot; <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> uno dei maggiori concorrenti [di Facebook] </a> &quot; come risultato di queste nuove misure di protezione della privacy. &quot;Apple potrebbe dire che lo stanno facendo per aiutare le persone, ma le mosse seguono chiaramente i loro interessi competitivi&quot;, ha affermato Zuckerberg. </p> <p> </p> <p> Facebook starebbe preparando un caso antitrust contro Apple che trasformerebbe il cecchino tra i due titani della Silicon Valley in una vera battaglia legale. Il rapporto del Wall Street Journal osserva che &quot;i potenziali accordi normativi e le decisioni legali influenzeranno probabilmente centinaia di milioni di telefoni dei consumatori nei prossimi anni&quot;. </p> <p> </p> <h2 id=\"different-approaches\"> Approcci diversi </h2> <p> Il portavoce di Facebook, Dani Lever, ha dichiarato al Wall Street Journal che &quot;Apple afferma che si tratta di privacy, ma si tratta di profitto e ci uniamo agli altri per sottolineare il loro comportamento anticompetitivo e di autopreferenza&quot;. Ha affermato che Facebook &quot;sta deliberatamente tenendo testa ad Apple&quot; per conto delle piccole imprese e degli sviluppatori che sono stati danneggiati dalla funzione Privacy delle app di Apple. </p> <p> Mentre Lever ha negato che la battaglia tra le due società sia personale, va assolutamente oltre i pochi punti di contesa tra due grandi società tecnologiche. Il modello di business finanziato dalla pubblicità su cui opera Facebook è estremamente diverso dal modello finanziato dall&#39;hardware che alimenta Apple. Nessuna delle due società, né i loro leader, probabilmente rinunceranno alle loro convinzioni fondamentali su come costruire il futuro della tecnologia. </p> <p> Il fatto che il CEO di Apple, Tim Cook, parli della privacy in termini morali mostra quanto tutto ciò sia davvero personale, a un certo livello. </p> <p> <small> Credito immagine: Wikipedia/ <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Anthony Quintano CC </a></small> </p>"}