{"title":"Microsoft ha cercato di acquistare Pinterest, ma l&#39;affare è saltato... per ora","content":"<p> Microsoft ha recentemente contattato Pinterest in merito a un potenziale accordo di acquisizione che sarebbe equivalso a una delle più grandi acquisizioni di Redmond di sempre. Attualmente le trattative non sono attive, ma la portata della fusione proposta segna ulteriormente i piani di crescita di Microsoft. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft vuole comprare Pinterest </h2> <p> Come riportato da <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Financial Times </a> , Microsoft ha tentato di acquistare Pinterest, la più grande bacheca per hobbisti al mondo. </p> <p> Pinterest ha attualmente un valore di circa $ 51 miliardi e il suo valore di mercato è aumentato di oltre il 600 percento durante la pandemia di COVID-19 mentre le persone si collegano online durante i blocchi. La notizia del potenziale accordo di acquisizione ha spinto le azioni di Pinterest in rialzo del 7% prima dell&#39;apertura dei mercati giovedì 11 febbraio. </p> <p> La mossa avrebbe portato Pinterest nella scuderia in continua crescita di Microsoft di importanti acquisizioni tecnologiche. Nel 2016, Microsoft ha acquisito LinkedIn con un accordo da 26 miliardi di dollari, seguito dall&#39;acquisto di Github per 7,5 miliardi di dollari nel 2018. </p> <p> Senza contare che Microsoft possiede Minecraft, ha acquistato 2,5 miliardi di dollari nel 2014 e l&#39;acquisizione in corso della principale holding di giochi, ZeniMax, per 7,5 miliardi di dollari. ZeniMax è la società madre di studi di gioco come Bethesda Softworks, id Software, Alpha Dog Games e Tango Gameworks. </p> <p> Inoltre, c&#39;era un <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> tentativo fallito di acquistare TikTok </a> Asset nordamericani, australiani e neozelandesi a metà del 2020. L&#39;accordo alla fine fallì, ma fu valutato tra $ 20-30 miliardi e arrivò dopo l&#39;ex presidente <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Trump ha minacciato di vietare </a> il social network di condivisione video interamente dagli Stati Uniti. </p> <p> Se l&#39;accordo con Pinterest fosse andato avanti, o addirittura se si concludesse in un secondo momento, sarebbe diventata la più grande acquisizione di Microsoft fino ad oggi. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> Perché Microsoft sta acquistando così tante aziende tecnologiche? </h2> <p> Microsoft non è a corto di soldi e vuole espandere il suo impero. Le sue azioni sono aumentate di circa l&#39;80% dall&#39;inizio della pandemia di COVID-19 e recentemente hanno rivelato i suoi profitti da record. </p> <p> </p> <p> L&#39;acquisizione di un&#39;altra piattaforma, come Pinterest, è un biglietto per i dati per gli altri servizi di Microsoft. L&#39;enorme volume di dati generato da piattaforme come LinkedIn è lo strumento perfetto per addestrare le sue tecnologie di intelligenza artificiale. Inoltre, l&#39;assunzione e la gestione di un enorme servizio online come Pinterest funge anche da pubblicità per la sua piattaforma Azure. </p> <p> Come allude anche il rapporto del Financial Times, il discorso su una fusione così enorme tra due società tecnologiche metterebbe alla prova anche l&#39;amministrazione del presidente Biden. La nuova amministrazione è felice di consentire a giganti della tecnologia come Microsoft, Google e Facebook di acquistare la concorrenza? Solo il tempo lo dirà. </p>"}