{"title":"Microsoft rilascia la sua nuova app Office per iPad","content":"<p> Microsoft ha rilasciato la sua app Office unificata per il tablet Apple. Con esso, Word, Excel e PowerPoint sono ora disponibili come download singolo su iPhone e iPad nel <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> App Store </a> . Microsoft fornisce ancora queste app per iPad come download indipendenti. </p> <h2 id=\"better-late-than-never\"> Meglio tardi che mai </h2> <p> &quot;Stiamo combinando le app Word, Excel e PowerPoint che conosci in un&#39;unica app ottimizzata per iPadOS&quot;, ha scritto Microsoft nelle note di rilascio che accompagnano il download. Questa è un&#39;ottima notizia se usi Office e vuoi lavorare in movimento. Per chi cerca <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> trasforma il loro iPad in un sostituto del laptop </a> , questa è una versione cruciale. </p> <p> Le app sono disponibili gratuitamente, ma la modifica e altre funzionalità avanzate richiedono un abbonamento a Office 365. Per coloro che se lo chiedono, Microsoft offre varie opzioni di abbonamento in-app a partire da $ 6,99 al mese. </p> <p> Se hai solo bisogno di un elaboratore di testi sul tuo iPad, potrebbe essere un&#39;idea migliore prendere in considerazione delle alternative in <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> La raccolta di MUO delle migliori app di elaborazione testi per iPad </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> Un&#39;esperienza di ufficio mobile unificata </h2> <p> Per essere chiari, questo è un aggiornamento dell&#39;attuale Office per iOS, non una nuova versione. Il <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> L&#39;app Office all-in-one ha fatto il suo debutto su iPhone </a> e Android nel febbraio 2020. Non è chiaro cosa abbia impiegato Microsoft un anno intero per aggiungere versioni ottimizzate per iPad di Word, Excel e PowerPoint al mix, ma meglio tardi che mai. </p> <p> </p> <p> Prima di oggi, le app di produttività incluse nella suite fornivano un&#39;esperienza scadente su iPad perché venivano eseguite in modalità finestra. Ma con l&#39;ultimo aggiornamento ora disponibile, i clienti Apple possono ora avere l&#39;esperienza Office nativa su iPhone, iPad o iPod touch indipendentemente dalle dimensioni dello schermo. </p> <p> </p> <h2 id=\"ipad-specific-features\"> Funzionalità specifiche per iPad </h2> <p> Microsoft ha aggiunto regolarmente nuove funzionalità ottimizzate per tablet alle sue offerte mobili di Office. Ad esempio, le versioni mobili di Word, Excel e PowerPoint hanno recentemente acquisito il supporto per i gesti del mouse e del trackpad. Le app supportano anche la funzione multitasking affiancata di Split View di iOS. </p> <p> Sebbene le edizioni per dispositivi mobili e desktop di Office non abbiano tutte le stesse funzionalità, il nuovo Office per iOS offre alcune nuove funzionalità. Questi ti permettono di fare cose come firmare documenti con la tua Apple Pencil o con un dito, creare rapidamente PDF dai tuoi documenti, convertire immagini in testo e tabelle e così via. </p> <p> </p> <p> Inoltre, ora puoi inserire facilmente data, forma, immagine e note nei PDF. Per quanto riguarda gli utenti esperti, ora possono accedere alle azioni basate su immagini di Office (come Crea PPT, Crea PDF e altro) tramite il menu Condividi multiuso di iOS. &quot;Inoltre, se sono presenti screenshot recenti quando si apre l&#39;app di Office, questi vengono visualizzati come suggerimento per la conversione in PDF o PPT&quot;, osserva la società. </p> <p> Microsoft apporterà alcune modifiche anche alla sua suite Office per Mac e Windows. Secondo il produttore di Windows, i prossimi aggiornamenti di Office per desktop nel 2021 includeranno licenze perpetue, oltre ad altri miglioramenti. </p>"}