{"title":"Potresti ottenere gratuitamente il nuovo Microsoft Teams Pro","content":"<p> Poco fa, abbiamo coperto un servizio di abbonamento pianificato per Microsoft Teams chiamato &quot;Teams Pro&quot;, che sbloccherà funzionalità aggiuntive per il software. Tuttavia, Microsoft ha quindi dichiarato che alcune persone otterranno Teams Pro senza costi aggiuntivi per i loro piani attuali. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Dichiarazione di Microsoft sugli abbonamenti gratuiti a Teams Pro </h2> <p> Nel caso avessi bisogno di un promemoria, abbiamo già trattato questo argomento nel nostro pezzo su <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro aggiunge webinar al servizio </a> . </p> <p> Ora, un articolo di <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> sullo stesso argomento ha da allora ricevuto una dichiarazione da Microsoft. La dichiarazione è una buona notizia per le persone preoccupate di pagare un extra per i webinar: </p> <blockquote> <p> Il 9 febbraio abbiamo pubblicato un post MC relativo a un nuovo piano di servizio Teams Pro. Per chiarire, non vi è alcuna modifica alle licenze dei prodotti esistenti con l&#39;aggiunta di questo nuovo piano di servizio. Piuttosto, il piano di servizio verrà aggiunto automaticamente alle licenze Microsoft 365 e Office 365 E5/E3/A5/A3 e Microsoft 365 Business Standard/Business Premium e consentirà agli utenti che dispongono di una licenza per questi SKU di ricevere automaticamente le funzionalità implementate su Squadre nel prossimo futuro. </p> </blockquote> <p> Microsoft prosegue affermando che gli amministratori non devono fare nulla per attivare queste nuove funzionalità. Inoltre, chiunque disponga di una licenza compatibile come elencato sopra otterrà queste nuove brillanti funzionalità senza costi aggiuntivi. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Ottenere di più per lo stesso con Microsoft Teams </h2> <p> Microsoft sta lanciando un nuovo piano di abbonamento a Teams Pro che sblocca webinar e altro, ma non tutti dovranno pagare un extra per questo. Se sei abbonato a una delle licenze di cui sopra, puoi aspettarti di ottenere tutte le funzionalità di Teams Pro senza alcun costo aggiuntivo. </p> <p> Questo non vuol dire che le persone senza Teams Pro saranno lasciate all&#39;ombra. Ad esempio, tutti avranno presto accesso a una pratica funzionalità di riepilogo in Microsoft Teams. </p> <p> <small> Credito immagine: Studio postmoderno / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}