{"title":"Presto giocherai con i personaggi MetaHuman di Epic","content":"<p> Se pensi che i giochi sembrino realistici ora, aspetta di prendere un carico di ciò che Epic Games ha in lavorazione con il suo Unreal Engine. Preparati a farti sbalordire. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games svela il nuovo MetaHumans </h2> <p> Probabilmente ti starai chiedendo di che terra stiamo parlando. MetaHuman Creator è l&#39;ultima funzionalità che Epic Games ha aggiunto a Unreal Engine; un ambiente di sviluppo software, che gli sviluppatori di giochi possono utilizzare per creare i loro titoli. </p> <p> Secondo an <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Post sul blog di Unreal Engine </a> annunciando il nuovo entusiasmante strumento di sviluppo: </p> <blockquote> <p> MetaHuman Creator è un&#39;app in streaming cloud progettata per portare la creazione umana digitale in tempo reale da settimane o mesi a meno di un&#39;ora, senza compromettere la qualità. </p> </blockquote> <p> Quindi, è essenzialmente un modo per gli sviluppatori di giochi di creare facsimili umani incredibilmente realistici. Veloce. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> Cosa significa MetaHuman Creator per gli sviluppatori? </h2> <p> </p> <p> Le implicazioni che questo ha per lo sviluppo del software stanno cambiando il gioco (gioco di parole). Immagina quanto velocemente gli sviluppatori popoleranno i loro mondi di gioco con NPC, usando MetaHuman Creator. Non solo, ma anche gli umani digitali sembrano incredibili. </p> <p> Questo ovviamente significa anche che gli sviluppatori possono finire i titoli più velocemente, quindi non devi aspettare innumerevoli ritardi. MetaHuman Creator consente agli sviluppatori di creare rapidamente la propria popolazione NPC, lasciando il tempo per altre questioni più urgenti. </p> <p> Ma perché la necessità di questo strumento? Epic Games spiega: </p> <blockquote> <p> Creare un essere umano digitale di alta qualità è difficile e richiede tempo. Ridimensionare questo sforzo per creare molti umani digitali diversi della qualità richiesta dalle piattaforme di nuova generazione e dalla produzione virtuale di fascia alta è davvero un compito formidabile. </p> </blockquote> <p> Quindi, come abbiamo detto; lo strumento consente di risparmiare tempo e migliora il flusso di lavoro, consentendo agli sviluppatori di dare alle console di nuova generazione i giochi che meritano. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> In che modo il creatore di MetaHuman influenzerà i giochi? </h2> <p> Bene, grazie a MetaHuman Creator, i giochi potrebbero essere rilasciati molto più rapidamente, per cominciare. Con potenti strumenti come questo a loro disposizione, gli sviluppatori potrebbero affinare le meccaniche di gioco o dedicare più tempo alla correzione dei bug prima di rilasciare un gioco rotto... </p> <p> Comunque, amarezza a parte, lo strumento di sviluppo di Epic sembra qualcosa che migliorerà anche l&#39;aspetto dei giochi. Devi solo guardare i rendering per vedere quanto siano davvero mozzafiato gli umani digitali. Quando li vediamo nei giochi, però, è quando accadrà la vera magia. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> Quando vedremo MetaHumans nei giochi? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> È difficile da dire. Attualmente, Epic ha ancorato il software Creator per i test di accesso anticipato nei &quot;prossimi mesi&quot;. Quindi non vedrai nessun MetaHumans in qualunque momento presto. </p> <p> Se hai voglia di provare a creare il tuo umano digitale, devi aspettare se vuoi usare MetaHuman Creator di Unreal Engine. Puoi sempre provare a metterne uno insieme in un altro programma, ma di certo non ci vorrà meno di un&#39;ora! </p>"}