{"title":"Parler torna online dopo un mese di chiusura","content":"<p> Dopo essere stato escluso da Big Tech, Parler è finalmente riemerso sul web. La piattaforma &quot;free speech&quot; è ora accessibile agli utenti esistenti e nelle prossime settimane inizierà presto ad accettare nuove registrazioni di utenti. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler riemerge dopo il grande blackout tecnologico </h2> <p> Parler è tornato alla ribalta dopo un lungo blackout. Il social network alternativo sta guadagnando terreno tra i conservatori politici, ed è stato <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> avviato da Amazon Web Services (AWS), Google e Apple </a> dopo le rivolte in Campidoglio. Parler è stato accusato di non aver fatto abbastanza per moderare i contenuti violenti, con conseguente rimozione dagli app store e dal Web. </p> <p> Al posto di AWS, Parler sta ora utilizzando un host chiamato SkySilk. Il sito ha anche registrato il suo nome di dominio con Epik, un registrar che si rivolge ad altri tipi di reti &quot;libere di parola&quot; come Gab. </p> <p> Un nuovo host e registrar di domini non sono le uniche modifiche apportate da Parler: Parler è persino riemersa con un nuovo CEO ad interim. Questo viene dopo <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> il team Parler avrebbe licenziato il co-fondatore John Matze </a> . </p> <p> Mark Meckler sostituirà temporaneamente Matze come CEO e in precedenza ha co-fondato il gruppo di destra Tea Party Patriots. In una dichiarazione ottenuta da <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> La collina </a> , Meckler ha annunciato il tanto atteso ritorno di Parler, dicendo: </p> <blockquote> <p> Quando Parler è stato messo offline a gennaio da coloro che desiderano mettere a tacere decine di milioni di americani, il nostro team si è riunito, determinato a mantenere la nostra promessa alla nostra comunità altamente impegnata che saremmo tornati più forti che mai. Siamo entusiasti di dare il bentornato a tutti. </p> </blockquote> <p> Meckler ha continuato, rilevando che Parler rimarrà dedito alla &quot;libertà di parola, privacy e dialogo civile&quot;. Ha anche rassicurato gli utenti che &quot;Parler è gestito da un team esperto ed è qui per restare&quot;. </p> <p> Sebbene sia stato eseguito il backup degli account più vecchi sulla piattaforma, i post più vecchi (o &quot;parley&quot;) non sono stati ripristinati. Se hai già un account su Parler, puoi continuare a utilizzare il sito. Altrimenti, dovrai aspettare circa una settimana prima di poterti iscrivere. </p> <p> Ma anche se disponi già di un account Parler, potresti incontrare alcune difficoltà tecniche durante l&#39;utilizzo della piattaforma. Sembra che il servizio non sia stato ancora completamente ripristinato. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> L&#39;app Parler rimane ancora nel limbo </h2> <p> Parler è ancora bandito dal Google Play Store e dall&#39;App Store di Apple, il che potrebbe danneggiare gravemente la sua base di utenti. Allo stato attuale, la piattaforma potrebbe rimanere non disponibile sui dispositivi mobili per un periodo di tempo sconosciuto. </p> <p> Probabilmente non sarà in grado di tornare al Play Store o all&#39;App Store a meno che non cambi le sue politiche di moderazione, cosa che Parler probabilmente rifiuterà di fare. </p>"}