{"title":"Qual è la differenza tra LAN e WAN nella rete?","content":"<p> Se hai ficcato il naso nelle reti di computer, ci sono buone probabilità che ti sia imbattuto nei termini &quot;LAN&quot; e &quot;WAN&quot;. Tuttavia, cosa significa ciascuno e quali sono le differenze quando si confronta una LAN con una WAN? </p> <p> Esploriamo entrambe queste tecnologie e dove ognuna brilla. </p> <h2 id=\"what-does-lan-stand-for\"> Che cosa significa &quot;LAN&quot;? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> Credito di immagine: droga Naroda/ <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Una LAN è una &quot;rete locale&quot;. Questo termine descrive una rete in cui tutti i dispositivi collegati sono vicini l&#39;uno all&#39;altro. Sono tutti in una &quot;zona locale&quot;, da cui il nome. </p> <p> Quando un computer si connette a una LAN, ottiene un indirizzo IP (protocollo Internet locale). Funziona in modo simile all&#39;indirizzo IP che ottieni quando vai online. Tuttavia, un indirizzo IP locale funziona solo per altri computer sulla tua stessa LAN. Ad esempio, non puoi utilizzare un IP locale per connetterti al tuo PC tramite Internet. </p> <p> Il confine fisico della tua LAN domestica probabilmente non lascerà la tua casa. Naturalmente, se porti il ​​telefono o il laptop in giardino per una boccata d&#39;aria fresca, è ancora sulla LAN. Tuttavia, la maggior parte delle volte, tutti i dispositivi connessi alla rete sono al sicuro tra le quattro mura di casa. </p> <p> Anche aziende e istituti realizzano reti LAN. Ad esempio, un&#39;università può collegare tutti i PC della sua biblioteca a una rete in modo che possano parlare tra loro. Le aziende amano anche utilizzare le LAN perché consentono ai lavoratori di inviare file e corrispondenza tra loro senza bisogno di andare online. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> Che cosa significa &quot;WAN&quot;? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Credito immagine: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> D&#39;altra parte, abbiamo la Wide Area Network, o WAN. Se stai leggendo questo articolo, sei già connesso a una WAN: ci piace chiamarla Internet. </p> <p> Il &quot;wide&quot; in Wide Area Network è molto variabile. Se ti connetti a un server esterno nella tua stessa città, quella è una WAN. È anche considerata una WAN se ti connetti a un server in un paese dall&#39;altra parte del pianeta. </p> <p> Pertanto, una WAN viene in genere utilizzata per descrivere qualsiasi rete a cui ti connetti che esiste oltre il tuo router. Non importa se il server è lontano un miglio o un continente; è ancora &quot;largo&quot;. </p> <p> Internet non è l&#39;unica WAN disponibile. Le aziende fanno buon uso delle WAN per connettere uffici che si trovano in paesi diversi. Ad esempio, se un&#39;azienda ha un ufficio a New York, Tokyo e Sydney, può noleggiare il proprio sistema WAN per consentire loro di parlare tra loro. </p> <p> Ma aspetta un minuto; perché le aziende creano la propria WAN quando possono semplicemente connettere tutto a Internet? Il problema con questa soluzione è che la società dovrà pagare le tariffe dell&#39;ISP e, se qualcosa va storto, dovrà lottare con detto ISP per risolverlo. </p> <p> Non solo, ma Internet è progettato per connettersi a molti PC in tutto il mondo. Se un&#39;azienda desidera che i suoi PC si connettano solo ad altri PC dell&#39;ufficio, può utilizzare la propria WAN per proteggersi dalle minacce online. Questa si chiama &quot;intranet&quot;. </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> Quando utilizzare una LAN rispetto a una WAN </h2> <p> Quando desideri connetterti a un altro dispositivo che possiedi, puoi scegliere di farlo tramite LAN o WAN. Ma quali sono i vantaggi e gli svantaggi di ciascuno e quali dovresti usare? </p> <p> Supponiamo che tu abbia un nuovo disco rigido wireless che si connette al router e che tu possa scegliere di consentire le connessioni da Internet (una WAN) o mantenerlo solo locale (LAN). Quale scegli dipende da cosa vuoi dal disco rigido. </p> <p> Fornire funzionalità WAN al disco rigido è fantastico per comodità. Questo lo mette su Internet, il che significa che puoi connetterti da qualsiasi parte del mondo. In quanto tale, non rimarrai mai più bloccato senza i tuoi file; saranno solo una connessione Internet di distanza. </p> <p> Tuttavia, le connessioni WAN consentono anche ad altre persone di accedere ai tuoi dispositivi. Se la sicurezza del tuo disco rigido non è all&#39;altezza, gli hacker possono utilizzare il tuo stesso percorso per vedere tutti i tuoi dati e copiare o eliminare cose importanti. </p> <p> Mettere il disco rigido in modalità solo LAN, d&#39;altra parte, lo protegge da alcune delle strade che un hacker può intraprendere. Non è impermeabile. Ad esempio, qualcuno potrebbe usare il tuo PC per accedere al disco rigido. Tuttavia, è molto più sicuro che trasmettere il disco rigido sulla WAN giorno e notte. </p> <p> Se davvero vuoi aumentare la sicurezza, puoi creare un gap aereo nel disco rigido. Air-gapping significa che esso e tutti i PC sulla stessa rete su di esso non sono connessi a una WAN, come Internet, ad esempio. </p> <p> Un <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> il computer air gap non è totalmente al sicuro dalle minacce online </a> , ma riduce drasticamente la possibilità di un attacco. Gli hacker devono manipolare gli esseri umani affinché eseguano i loro ordini per attaccare un dispositivo air gap, usando tattiche di ingegneria sociale per ottenere ciò che vogliono. </p> <p> Pertanto, quando scegli tra mettere un dispositivo su Internet o tenerlo bloccato sulla LAN di casa, devi considerare se ti connetterai effettivamente ad esso su Internet. Se non pensi di farlo, è meglio disattivare le sue capacità WAN e tenere a bada gli hacker. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> La connessione a Internet trasforma una LAN in una WAN? </h2> <p> Supponiamo che tu abbia una LAN configurata in cui tutti i tuoi dispositivi sono collegati a un router. Sei annoiato, quindi prendi il tuo computer e vai su Netflix. Ora il tuo PC è connesso a una WAN: Internet. </p> <p> Tuttavia, poiché il tuo PC è connesso a una WAN, significa che non fa più parte di una LAN? Fortunatamente, un dispositivo può essere contemporaneamente parte di una LAN e di una WAN. </p> <p> Ricordi come abbiamo detto che i dispositivi LAN hanno il proprio indirizzo IP locale? Ciò non significa che non possa ottenere anche un indirizzo IP Internet. Infatti, se stai leggendo questo articolo su un dispositivo connesso a un router, avrà entrambi! </p> <p> Se vuoi verificare tu stesso, abbiamo coperto <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> come controllare il tuo indirizzo IP su Windows </a> . Se sei sul cellulare, puoi ancora <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> trova i tuoi indirizzi IP su Android o iPhone </a> . </p> <p> Una volta che hai le statistiche, dovresti vedere due indirizzi IP. Il primo inizierà con &quot;192.168&quot;: quello è il tuo indirizzo IP locale. Lo usi se vuoi connetterti al tuo dispositivo attuale da un altro sulla stessa rete. </p> <p> Il secondo apparirà in due modi, a seconda che tu sia su IPv4 o IPv6. Se sei su v4, dovrebbe assomigliare al tuo indirizzo IP locale, ma non inizierà con &quot;192.168.&quot; Se è IPv6, dovrebbe essere un pasticcio di lettere e numeri, divisi in otto blocchi da due punti. </p> <p> In ogni caso, quell&#39;indirizzo è il tuo indirizzo IP Internet. Viene utilizzato quando ti connetti a un altro server su Internet in modo che possa parlare con te; ad esempio, per inviarti quel programma TV che stai guardando su Netflix. </p> <p> In un certo senso, puoi immaginare Internet come un&#39;enorme rete di LAN. Quando guardi Netflix, il tuo PC (sulla tua LAN personale) riceve dati dai server Netflix (che si trova sulla propria LAN). Ogni LAN è come una casa in una città, mentre la connettività Internet è come le strade e le strade che le collegano tutte. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> Eliminare la confusione tra LAN e WAN </h2> <p> LAN e WAN spesso funzionano in tandem, ma funzionano in modi diversi. Ora conosci la differenza tra i due e quando usarli. </p> <p> Sapevi che puoi impostare un gioco LAN in modo che le persone sulla stessa rete possano giocare tra loro? È un ottimo modo per trascorrere del tempo con gli amici senza i problemi di latenza che a volte hanno i giochi su Internet. </p> <p> <small> Credito immagine: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}