{"title":"Roku vuole i tuoi pensieri sul suo telecomando ricaricabile","content":"<p> Roku sta reclutando alcune persone per aderire al suo programma di accesso anticipato, al fine di testare un nuovo telecomando (chiamato Roku Voice Remote Pro) dotato di una batteria ricaricabile. </p> <p> È un&#39;offerta a tempo limitato fino a esaurimento scorte, anche se devi comunque pagare per il telecomando. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> Che cos&#39;è Roku Voice Remote Pro? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> Finalmente un telecomando con batteria ricaricabile </a> a partire dal <a href=\"https://www.reddit.com/r/Roku/\"> Roku </a> </blockquote>  <p> Come notato per la prima volta dall&#39;utente Kingtut206 su <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , Roku sta reclutando persone per il suo programma di accesso anticipato per testare un nuovo telecomando chiamato Roku Voice Remote Pro. </p> <p> Il nuovo telecomando è dotato di una batteria ricaricabile, un telecomando smarrito (ad esempio, puoi dire &quot;Ehi Roku, trova il mio telecomando&quot;), vivavoce e pulsanti di scelta rapida personali accanto ai pulsanti standard con marchio. </p> <p> Come riportato da <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> Il Verge </a> , il telecomando si ricarica tramite micro-USB, piuttosto che USB-C di gran lunga superiore. Forse il feedback raccolto attraverso il programma di accesso anticipato lo riconoscerà. </p> <p> La partecipazione al programma è solo su invito, anche se non si sa cosa ti renda qualificato. </p> <p> Il telecomando costa $ 29,99 e dovrebbe essere spedito il 19 febbraio 2021. </p> <p> Verranno vendute solo 2.000 unità e Roku raccoglierà feedback sulla tua esperienza con il telecomando. Dopo tale periodo, possiamo presumere che il telecomando verrà perfezionato prima di essere potenzialmente messo in vendita generale. </p>"}