{"title":"Rapporto: Android 12 presenterà una modalità con una sola mano","content":"<p> Abbiamo ufficialmente raggiunto la fase del ciclo di vita di Android 11 in cui le voci su Android 12 iniziano a uscire in pieno vigore. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> Sviluppatori XDA </a> ha riferito che Google sta lavorando a una modalità con una sola mano per Android 12 che renderà molto più facile navigare nel telefono con una sola mano. Che tu abbia mani grandi o piccole, questo potrebbe aprire un modo completamente nuovo di interagire con il tuo dispositivo Android. </p> <p> Naturalmente, molti produttori di dispositivi e <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> gli sviluppatori di software hanno introdotto soluzioni per migliorare l&#39;usabilità con una sola mano </a> . Tuttavia, sarà molto più piacevole utilizzarlo quando sarà integrato direttamente nel sistema operativo. </p> <h2 id=\"android-12-s-one-handed-mode\"> Modalità a una mano di Android 12 </h2> <p> Secondo il rapporto, Google sta pianificando di aggiungere la funzionalità con una sola mano ad AOSP, che è la versione open source di Android che qualsiasi produttore di software può utilizzare nei propri dispositivi. Ciò significa anche che gli OEM che devono ancora sviluppare la propria modalità con una sola mano avranno un modo semplice per implementare la funzionalità nei propri dispositivi. </p> <p> Ciò che il rapporto non indicava era se Google avrebbe richiesto ai produttori di telefoni di utilizzare la funzione con una sola mano di Android 12 o se sarebbe stata facoltativa. </p> <p> Poiché è ancora incredibilmente presto, non sappiamo esattamente come funzionerà la modalità a una mano di Android 12. Se la capacità passata di Google di aggiungere funzionalità al sistema operativo è indicativa, ci aspetteremmo che l&#39;azienda faccia un buon lavoro con l&#39;implementazione. Google potrebbe decidere di ridurre l&#39;intero schermo in un angolo del dispositivo per un facile accesso. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> Il rapporto indica anche che la modalità a una mano di Android 12 avrà un modo per attivarla utilizzando la tradizionale modalità a tre pulsanti insieme alla nuova modalità di navigazione gestuale. </p> <p> Come accennato, molti OEM di smartphone hanno già implementato la funzione nella propria versione modificata di Android. Ad esempio, Huawei ha effettivamente provato a inviare la sua versione della funzionalità ad AOSP, ma Google l&#39;ha rifiutata. Forse Google ha rifiutato perché la società sapeva che intendeva portare la propria versione della funzione stessa. </p> <p> Poiché questa perdita è così precoce, nessuna foto dimostra ancora la funzione, quindi dovremo aspettare che Android 12 si avvicini al suo rilascio. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Quando verrà rilasciato Android 12? </h2> <p> Purtroppo, non sappiamo esattamente quando Android 12 verrà distribuito al pubblico (anche se non lo sarà per un po&#39;). Inoltre, non sappiamo esattamente quando questa funzione uscirà per gli sviluppatori o per le versioni Beta o Android stabile. </p> <p> Come sempre con le nuove funzionalità Android, dovremo aspettare e vedere se si tratta del sistema operativo. </p>"}