{"title":"Surface Duo ottiene una data di uscita nel Regno Unito e un calo dei prezzi","content":"<p> Surface Duo di Microsoft non ha avuto un&#39;accoglienza così fantastica, ma sembra che la società sia desiderosa di fare una prima impressione migliore al di fuori degli Stati Uniti. Non solo la società sta tagliando il prezzo del Surface Duo, ma ha anche una data di uscita confermata per il mercato del Regno Unito. </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> Ultimi preparativi all&#39;estero di Microsoft per Surface Duo </h2> <p> Questa notizia ci arriva da <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . Se ricordi, quando è stato lanciato Surface Duo, <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> non ha ricevuto ottime recensioni </a> . Un punto critico centrale era quanto fosse difettoso il sistema operativo del Duo, ma un altro era il suo prezzo allettante a $ 1399,99. </p> <p> Microsoft ha lavorato duramente per risolvere i principali problemi riscontrati dai revisori, ma il suo prezzo elevato è rimasto dov&#39;era. Tuttavia, Microsoft sta pianificando di offrire a Surface Duo un calo significativo del prezzo a $ 999,99. </p> <p> Questo calo è probabilmente in preparazione per la sua uscita all&#39;estero, poiché i critici di tutto il mondo si preparano ad abbattere il Surface Duo pollice per pollice. Con questo prezzo ridotto, oltre alle recenti correzioni del sistema operativo di Surface Duo, la meraviglia a doppio schermo potrebbe ancora fare un&#39;impressione positiva all&#39;estero. </p> <p> Microsoft ha anche confermato quando i fan del Regno Unito possono provare da soli Surface Duo. Se ti trovi nel Regno Unito, tieni d&#39;occhio i rivenditori di elettronica il 18 febbraio 2021. </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> Grattare la superficie dei piani di Microsoft all&#39;estero </h2> <p> Mentre Surface Duo ha faticato a fare una buona impressione negli Stati Uniti, potrebbe esserci ancora speranza all&#39;estero. Con tutte le correzioni al sistema operativo di Surface Duo combinate con questo calo dei prezzi, l&#39;erba potrebbe finire per essere più verde dall&#39;altra parte. </p> <p> Se vuoi sapere che tipo di patch Microsoft ha spinto per Surface Duo, la società ha recentemente rilasciato alcuni aggiornamenti di stabilità per appianare i bug prima del debutto internazionale del Duo. </p> <p> <small> Credito di immagine: Jack Skeens/ <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}