{"title":"Spotify sta testando i testi dal vivo negli Stati Uniti","content":"<p> Ti piace cantare insieme ai tuoi brani Spotify preferiti, ma devi sempre cercare i testi per assicurarti che il tuo karaoke sia accurato? Sei fortunato. Spotify sta ora testando la sua funzione di testi dal vivo per alcune persone negli Stati Uniti. </p> <h2 id=\"spotify-rolls-out-real-time-lyrics\"> Spotify lancia i testi in tempo reale </h2> <p> Se ti trovi negli Stati Uniti, potresti vedere una nuova funzione Spotify che ti consente di visualizzare i testi in tempo reale rispetto alla musica che stai riproducendo. I testi sono forniti dalla società di dati musicali Musixmatch. </p> <p> &quot;Might&quot; è la parola chiave lì, poiché questo è ancora in una fase di test. Ciò significa che solo un gruppo di utenti vedrà la funzione mentre Spotify ne misura l&#39;impatto. Non si sa quanti utenti compongono il gruppo di test. </p> <p> I testi sono stati una funzionalità a lungo richiesta per Spotify, quindi sarebbe sorprendente se alla fine la funzionalità non venisse distribuita a tutti, ma nulla è certo. </p> <p> In un&#39;e-mail a <a href=\"https://www.engadget.com/spotify-live-lyrics-united-states-test-ios-android-140045159.html\" target=\"_blank\" rel=\"nofollow noopener\"> Engadget </a> , un portavoce di Spotify ha dichiarato: </p> <blockquote> <p> Possiamo confermare che stiamo attualmente testando la nostra funzione di testi per un numero selezionato di utenti negli Stati Uniti. In Spotify, conduciamo regolarmente una serie di test nel tentativo di migliorare la nostra esperienza utente. Alcuni di questi test finiscono per spianare la strada alla nostra esperienza utente più ampia e altri servono solo come apprendimento importante. Al momento non abbiamo altre notizie da condividere. </p> </blockquote> <p> </p> <h2 id=\"are-lyrics-new-for-spotify\"> I testi sono nuovi per Spotify? </h2> <p> A rigor di termini, i testi in tempo reale non sono una novità. Questo perché è disponibile in paesi come Brasile, Messico, India e Singapore da giugno 2020. </p> <p> In effetti, molto prima, Spotify aveva una funzione di testi dal vivo in tutto il mondo. È anche il risultato di una partnership con Musixmatch, anche se la funzione è stata rimossa senza tante cerimonie quando l&#39;accordo tra le due società è giunto al termine. </p> <p> Spotify lo ha poi sostituito con un&#39;integrazione con Genius, in una funzione soprannominata &quot;Behind the Lyrics&quot;, che mostra informazioni e fatti divertenti su alcune canzoni. Questo è anche qualcosa che è disponibile su Apple Music, che a sua volta supporta anche i testi dal vivo. </p> <p> Engadget riferisce che &quot;Behind the Lyrics&quot; verrà rimosso da Spotify se la funzione di live lyrics si espanderà ulteriormente. Probabilmente non mancherà a molti. </p> <p> Per quelle persone nelle regioni che non hanno ancora i testi dal vivo, c&#39;è la possibilità di <a href=\"https://www.makeuseof.com/tag/lyrics-currently-playing-songs-spotify/\" target=\"_blank\" rel=\"nofollow noopener\"> usa altre app per visualizzare i testi in Spotify </a> . </p> <p> Naturalmente, puoi anche utilizzare uno dei tanti siti Web di testi di Internet, anche se questi non verranno visualizzati in tempo con la tua musica Spotify. </p>"}