{"title":"Smart Health Card vs. Passaporto vaccinale digitale: qual è la grande differenza?","content":"<p> La pandemia di COVID-19 ha fatto vacillare i sistemi sanitari. Ora, la prospettiva di passaporti sanitari digitali e tessere sanitarie intelligenti sta prendendo piede mentre i governi e le imprese tentano allo stesso modo di tornare alla normalità. </p> <p> Quindi, cos&#39;è una tessera sanitaria intelligente ed è uguale a un passaporto sanitario? </p> <h2 id=\"what-is-a-smart-health-card\"> Che cos&#39;è una tessera sanitaria intelligente? </h2> <p> Una smart card sanitaria è una plastica sottile con un chip di circuito integrato incorporato contenente dati crittografati. </p> <p> Ciò che lo rende intelligente è il chip che funge da supercomputer. Il chip può essere programmato per eseguire diverse azioni con numerose applicazioni, mentre i lettori collegati a un sistema informatico possono accedere o aggiornare i dati del chip. </p> <p> Può sembrare proprio una carta di credito, ma funziona in modo diverso. Utilizzata in molti paesi in Europa e nel mondo, una smart card sanitaria memorizza informazioni sanitarie, copertura assicurativa e altri dati medici vitali. </p> <p> </p> <h2 id=\"advantages-of-using-a-smart-health-card\"> Vantaggi dell&#39;utilizzo di una Smart Health Card </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Sanità in Francia: cos&#39;è una &quot;carta vitale&quot;? <a href=\"https://t.co/5VVcTjZyxh\"> https://t.co/5VVcTjZyxh </a> <a href=\"https://t.co/6I0TCy70wg\"> pic.twitter.com/6I0TCy70wg </a></p> — FrenchEntrée (@FrenchEntrée) <a href=\"https://twitter.com/FrenchEntree/status/738646709308379136?ref_src=twsrc%5Etfw\"> 3 giugno 2016 </a></blockquote>  <p> Tra molti altri vantaggi dell&#39;utilizzo di questo sistema, il più cruciale è il miglioramento delle cure critiche o di emergenza. Le smart card sanitarie forniscono l&#39;accesso immediato ai dati sanitari o alle cartelle cliniche di un paziente in caso di emergenza. </p> <p> Ad esempio, un soccorritore con un lettore di schede portatile avrà informazioni immediate sul paziente mentre è in ambulanza in viaggio verso l&#39;ospedale. Questo è ancora più importante quando il paziente è incosciente, non risponde o semplicemente non è in grado di comunicare al soccorritore le sue informazioni sanitarie. </p> <p> Immagina un soccorritore in grado di inoltrare i dati critici del paziente al personale del pronto soccorso prima che arrivi l&#39;ambulanza. Aiuterà il personale del pronto soccorso a preparare ciò che è necessario per curare il paziente anche prima dell&#39;arrivo. </p> <p> Il trasferimento rapido ed efficiente dei dati dei pazienti durante le cure intensive può migliorare notevolmente i tempi di risposta, salvando così vite umane. </p> <h3 id=\"seamless-transfer-of-data\"> Trasferimento di dati senza interruzioni </h3> <p> L&#39;utilizzo di questo sistema fornisce anche un trasferimento più accurato e fluido delle informazioni sui pazienti dal personale del pronto soccorso agli operatori sanitari in cure ospedaliere. </p> <p> I medici non dovranno fare affidamento sulla memoria del paziente per <a href=\"https://www.makeuseof.com/tag/google-store-medical-data-cloud/\" target=\"_blank\" rel=\"nofollow noopener\"> recuperare dati medici critici </a> , che riduce le possibilità di errore. Oltre a questo, un sistema di smart card sanitarie offre uno scambio continuo di informazioni sui pazienti tra medici. </p> <p> Riduce le possibilità di perdita di dati critici del paziente (che possono essere utilizzati per <a href=\"https://www.makeuseof.com/tag/the-10-pieces-of-information-identity-thieves-are-looking-for/\" target=\"_blank\" rel=\"nofollow noopener\"> furto d&#39;identità </a> ). Questo accade spesso quando le informazioni del paziente vengono condivise tramite fax, telefono o e-mail. </p> <h3 id=\"easier-storage-and-retrieval-of-medical-records\"> Archiviazione e recupero più facili delle cartelle cliniche </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"it\" dir=\"ltr\"> Tessera sanitaria: come richiederne un duplicato <a href=\"https://t.co/2GrFWpanC2\"> https://t.co/2GrFWpanC2 </a> <a href=\"https://t.co/JKR6ampnXq\"> pic.twitter.com/JKR6ampnXq </a></p> — CataniaToday (@CataniaToday) <a href=\"https://twitter.com/CataniaToday/status/1359189830937300995?ref_src=twsrc%5Etfw\"> 9 febbraio 2021 </a></blockquote>  <p> Il sistema fornisce ai pazienti un modo comodo e senza problemi per portare i risultati dei test di laboratorio o le note del medico. </p> <p> È come avere un database di informazioni sanitarie (test precedenti, trattamenti e file per la copertura assicurativa) in una piccola scheda nel portafoglio del paziente. Non è più necessario trascinarsi dietro pezzi di carta per un appuntamento dal medico. </p> <h3 id=\"reduces-medical-errors-and-duplicate-testing\"> Riduce gli errori medici e i test duplicati </h3> <p> Il sistema sanitario del paese può persino trarne vantaggio poiché si possono evitare errori medici e test duplicati. Grazie a questo sistema è possibile ridurre al minimo gli errori medici derivanti dall&#39;immissione di dati impropri, dalle barriere linguistiche o da problemi di comunicazione. </p> <p> L&#39;errore umano a volte può causare una mancata corrispondenza di pazienti e record. Avere una tessera sanitaria intelligente consente agli operatori sanitari di abbinare facilmente il paziente alle cartelle cliniche corrette. Ciò riduce le possibilità di avere record duplicati o più test ridondanti, che potrebbero costare un sacco di soldi. Potrebbe far risparmiare al sistema sanitario spese inutili. </p> <h3 id=\"more-accurate-verification-of-insurance-coverage\"> Verifica più accurata della copertura assicurativa </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> City break? Viaggio di lavoro? Vacanze? Per stare tranquilli, porta sempre con te la tua tessera sanitaria europea! <a href=\"https://t.co/31zoREZAEy\"> https://t.co/31zoREZAEy </a> <a href=\"https://twitter.com/hashtag/EHIC?src=hash&ref_src=twsrc%5Etfw\"> #EHIC </a> <a href=\"https://t.co/o05Jx8aIwq\"> pic.twitter.com/o05Jx8aIwq </a></p> — Commissione europea 🇪🇺 (@EU_Commission) <a href=\"https://twitter.com/EU_Commission/status/893485278114992128?ref_src=twsrc%5Etfw\"> 4 agosto 2017 </a></blockquote>  <p> Il furto di identità medica è diventato un problema serio negli ultimi anni. Il reato consiste nell&#39;uso fraudolento di informazioni assicurative sanitarie per accedere a prestazioni sanitarie o ottenere rimborsi. In poche parole, una persona che non è coperta da una polizza può rubare le informazioni sull&#39;assicurazione sanitaria di qualcun altro per ottenere benefici. </p> <p> Le violazioni del sistema sanitario o dell&#39;assicurazione sanitaria spesso perdono informazioni sensibili di identificazione personale (PII) che gli hacker possono vendere sul dark web. Le PII possono includere informazioni sull&#39;assicurazione sanitaria. </p> <p> Questo è ciò che i ladri usano per accedere a servizi sanitari a cui non dovrebbero avere accesso. Possono acquistare farmaci da prescrizione o presentare reclami assicurativi fraudolenti per procedure che non sono mai state eseguite. </p> <p> Un sistema di smart card sanitaria può prevenire tutto ciò poiché la maggior parte utilizza protocolli di autenticazione e sicurezza. Alcuni possono utilizzare l&#39;autenticazione a 2 fattori (2FA) o l&#39;autenticazione a più fattori (MFA), mentre altri hanno una funzione biometrica che controlla le impronte digitali del paziente per verificarne l&#39;identità. </p> <p> </p> <h2 id=\"disadvantages-of-using-a-smart-health-card-system\"> Svantaggi dell&#39;utilizzo di un sistema Smart Health Card </h2> <p> I problemi di privacy rimangono la principale preoccupazione che scoraggia gli utenti dall&#39;adattare la tecnologia per scopi medici. Molti hanno sollevato preoccupazioni sul fatto di offrire alle persone un facile accesso a una moltitudine di dati sensibili come trattamenti, cartelle cliniche e farmaci. E con le notizie di sistemi sanitari e assicurativi vittime di violazioni dei dati, queste preoccupazioni non sono esattamente infondate. </p> <p> Avere tutti i record in un unico posto può essere conveniente, ma un singolo <a href=\"https://www.makeuseof.com/tag/healthcare-new-attack-vector-scammers-id-thieves/\" target=\"_blank\" rel=\"nofollow noopener\"> violazione dei dati </a> potrebbe far finire dati altamente sensibili nelle mani sbagliate. </p> <h3 id=\"creating-digital-divide\"> Creare un divario digitale </h3> <p> Poi c&#39;è il problema della creazione di un divario digitale. Molti sostengono che le smart card possono essere utilizzate solo da ospedali e comunità con accesso al sistema. Per sfruttare questa tecnologia, la macchina di un ospedale deve supportare lo stesso software, l&#39;interfaccia del lettore di smart card e deve essere in grado di supportare l&#39;hardware necessario. </p> <p> Parlando di hardware, c&#39;è anche la questione dei costi aggiuntivi. L&#39;hardware per il sistema, il software per il lettore e la rete con il database potrebbero costare milioni e potrebbero costare anche di più per la manutenzione. Anche le stesse carte di plastica hanno un costo di produzione. </p> <p> Chi pagherà l&#39;investimento iniziale? Inoltre, quanto tempo prima che questo investimento iniziale raccolga benefici per il governo ei suoi cittadini? </p> <h3 id=\"bugs-and-power-failures\"> Bug e interruzioni di corrente </h3> <p> Naturalmente, questo tipo di tecnologia non è immune da bug e glitch o attacchi informatici che possono causare perdite di dati. Un singolo dispositivo senza patch nel sistema può diventare un gateway per malware che può causare danni alla rete e al database. </p> <p> Ci sono anche preoccupazioni per le interruzioni di corrente. Come può essere sostenuto nelle comunità con problemi di alimentazione o infrastrutture energetiche limitate? Anche i sistemi di alimentazione più sofisticati possono guastarsi in caso di gravi disastri. Immagina di non avere accesso ai dati medici durante un disastro. </p> <p> </p> <h2 id=\"smart-healthcare-vs-digital-vaccination-passport\"> Sanità intelligente vs. Passaporto vaccinale digitale </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Grandi nomi della tecnologia e della sanità, tra cui la Mayo Clinic, l&#39;Evernorth di Cigna e Microsoft, stanno collaborando per creare un passaporto digitale per la vaccinazione contro il COVID-19. <a href=\"https://t.co/KgTVjq9lUe\"> https://t.co/KgTVjq9lUe </a> <a href=\"https://t.co/ZiJIE8xoTY\"> pic.twitter.com/ZiJIE8xoTY </a></p> — Salute dell&#39;albero (@MastAnalytics) <a href=\"https://twitter.com/MastAnalytics/status/1351683116990164993?ref_src=twsrc%5Etfw\"> 20 gennaio 2021 </a></blockquote>  <p> Si è parlato di passaporto vaccinale digitale per viaggiare e accedere a concerti o raduni post-Covid. Sebbene un passaporto sanitario digitale possa sembrare simile alle smart card utilizzate in paesi come Germania, Francia e Austria, ci sono differenze fondamentali. </p> <p> </p> <p> Innanzitutto, il passaporto digitale del vaccino COVID-19 arriverà sotto forma di un certificato digitale scaricato sul telefono di una persona. Il certificato digitale o passaporto per il vaccino Covid è un pass con il nome del paziente e i dettagli del suo vaccino contro il Covid (data di somministrazione, produttore del vaccino, luogo di vaccinazione). È un documento digitale di una pagina con un codice a barre o un codice QR che può essere scansionato ai punti di ingresso. </p> <p> A differenza della tessera sanitaria intelligente, il passaporto sanitario digitale non è pensato per essere una tessera di plastica fisica. </p> <p> Avrà solo informazioni relative ai test COVID-19 della persona, ai registri delle vaccinazioni e alle strutture sanitarie in cui sono state condotte tali vaccinazioni e test. Non avrà l&#39;intera storia medica del paziente. </p> <p> Questi passaporti sanitari digitali daranno alle persone l&#39;accesso a incontri come concerti e luoghi di lavoro in cui saranno in contatto con molte persone o daranno loro l&#39;ingresso in paesi una volta che il viaggio avrà un senso di normalità. Le persone senza smartphone possono stampare i propri codici, scansionati al punto di ingresso. </p> <h3 id=\"breach-of-privacy-and-curtailment-of-human-rights\"> Violazione della privacy e limitazione dei diritti umani </h3> <p> Mentre molti sono desiderosi di ottenere il vaccino, scaricare un passaporto digitale per la vaccinazione e tornare alla normalità, alcuni stanno lanciando l&#39;allarme sulle possibili ripercussioni dell&#39;introduzione di questa tecnologia. Esperti e difensori dei diritti umani avvertono gli sviluppatori di affrontare potenziali problemi di privacy dei dati e diritti umani che un passaporto di vaccinazione potrebbe comportare. </p> <p> Ricerca pubblicata da <a href=\"https://socialsciences.exeter.ac.uk/media/universityofexeter/collegeofsocialsciencesandinternationalstudies/lawimages/research/Policy_brief_-_Digital_Health_Passports_COVID-19_-_Beduschi.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Facoltà di giurisprudenza dell&#39;Università di Exeter </a> avverte come questo passaporto potrebbe limitare i diritti umani fondamentali, compreso il diritto alla privacy, alla libertà di movimento e di riunione pacifica. </p> <p> Secondo il rapporto, il problema deriva dall&#39;uso da parte del passaporto di informazioni sanitarie personali sensibili (come verranno archiviate, chi avrà accesso ad esse?) e come può creare un nuovo divario tra le persone in base al loro stato di salute. </p> <p> Il passaporto può anche potenzialmente determinare o limitare il grado in cui una persona gode di diritti e libertà. L&#39;uso dei passaporti sanitari digitali, avvertono gli esperti, potrebbe aggravare le disuguaglianze tra le comunità che hanno accesso immediato a vaccini o passaporti sanitari e quelle che non lo fanno. </p> <p> </p> <h2 id=\"future-of-healthcare\"> Il futuro della sanità </h2> <p> Paesi come la Francia utilizzano tessere sanitarie intelligenti dagli anni &#39;90, con altri paesi che hanno seguito l&#39;esempio nei primi anni 2000. </p> <p> L&#39;adozione di questa tecnologia è stata piuttosto lenta in paesi come gli Stati Uniti, indicando i problemi di privacy come la preoccupazione principale. Sebbene ci siano molti vantaggi nell&#39;adottare questo sistema, ci sono anche diversi svantaggi che meritano un&#39;attenta considerazione. </p>"}