{"title":"Twitter per etichettare gli account personali dei funzionari governativi","content":"<p> Twitter inizierà presto ad apporre etichette sugli account personali dei funzionari governativi. Le etichette dovrebbero aiutare gli utenti a identificare facilmente chiunque sia associato al governo. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Altri funzionari governativi riceveranno un&#39;etichetta su Twitter </h2> <p> Secondo un post su <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> il blog di Twitter </a> , la piattaforma inizierà a etichettare gli account personali dei &quot;capi di stato&quot; il 17 febbraio 2021. Apporrà etichette anche agli account associati ai media affiliati allo stato. </p> <p> Twitter sta anche espandendo la portata delle sue etichette per coprire i funzionari governativi in ​​più paesi. Queste località includono Canada, Cuba, Ecuador, Egitto, Germania, Honduras, Indonesia, Iran, Italia, Giappone, Arabia Saudita, Serbia, Spagna, Tailandia, Turchia ed Emirati Arabi Uniti. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Credito immagine: Twitter </p> <p> La piattaforma spera che queste etichette aiutino gli utenti a &quot;avere un&#39;esperienza più informata su Twitter&quot; e prevede anche di modificare il testo dell&#39;etichetta per &quot;aggiungere più specificità&quot; &quot;differenziando tra individui e istituzioni&quot;. </p> <p> La prima ondata di etichette di Twitter per gli account affiliati al governo è stata lanciata nell&#39;agosto 2020. Inizialmente, queste etichette si applicavano solo ai funzionari associati ai cinque paesi del Consiglio di sicurezza delle Nazioni Unite e non includevano gli account personali di tali funzionari. </p> <p> Detto questo, queste etichette non sono a <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> colpo palese alla disinformazione </a> , ma aiuteranno comunque gli utenti a ottenere più contesto su ciò che stanno leggendo e da chi proviene. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter continuerà solo ad espandere le sue etichette </h2> <p> Alla fine del suo post sul blog, Twitter ha notato che spera di espandere le sue etichette ad &quot;ulteriori paesi nel tempo&quot;. L&#39;etichetta appare come una bandiera grigio chiaro sul profilo Twitter di una persona ed è probabile che la incontrerai più spesso nelle prossime settimane. </p>"}