{"title":"Un enorme aggiornamento di Microsoft Edge è diretto verso di te","content":"<p> Microsoft sta lavorando molto duramente per rendere il suo browser Internet, Edge, il migliore in assoluto. Ora, l&#39;azienda sta apportando tre caratteristiche significative e le cose sembrano rosee per il futuro di Edge. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Cosa ha pianificato Microsoft per Edge </h2> <p> Il grande aggiornamento del paraurti è stato catturato da <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows più recente </a> . Le tre funzionalità dovrebbero arrivare in un unico grande aggiornamento, quindi vale la pena tenere d&#39;occhio Edge nel prossimo futuro. </p> <p> Innanzitutto, Microsoft Edge sta ottenendo il supporto per i widget Web. Questi widget sono un modo pratico per dare una rapida occhiata alle informazioni vitali durante la giornata. Il gigante del software vuole sperimentare widget di tutte le forme e dimensioni, ma ha deciso di iniziare con un widget di notizie per dare il via alle cose. </p> <p> Successivamente, Microsoft Edge sta ottenendo una funzione di ricerca delle schede. Se ti suona familiare, è probabile che tu abbia letto il <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> speculazione iniziale su Edge che ottiene uno strumento di ricerca per schede </a> . Fortunatamente, questa speculazione è diventata realtà e Microsoft prevede di portare la funzionalità di Chrome in Edge. </p> <p> Infine, sarai in grado di gestire tutte le tue estensioni Edge da un unico menu. Apparirà come un pezzo di puzzle sulla barra delle applicazioni del browser e, quando lo fai clic, ti mostrerà tutte le estensioni installate insieme a un modo rapido per abilitarle e disabilitarle. </p> <p> Non è sicuro quando verrà rilasciato esattamente questo aggiornamento, ma Windows più recente lo ha bloccato per &quot;il prossimo grande aggiornamento&quot;. Pertanto, non passerà molto tempo prima che Microsoft Edge diventi una scelta interessante per le persone che cercano qualcosa di nuovo. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: la prossima grande cosa? </h2> <p> Per molto tempo, i browser di Microsoft sono stati considerati gestori di download avanzati per l&#39;installazione di Chrome o Firefox. Da quando Microsoft ha adottato una base di codice Chromium per il suo browser, tuttavia, è passato oltre essere lo zimbello del mondo dei browser. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCount </a> elenca Microsoft Edge come il secondo browser Windows più utilizzato negli Stati Uniti al momento della stesura. Sapevamo già che Firefox veniva lasciato nella polvere da Edge, ma da allora il divario si è solo ampliato. </p> <p> Ora Edge rappresenta il 5,25 percento della quota di mercato statunitense, rispetto al 3,35 percento che possiede Firefox. Entrambi sono ben lontani dal 45,83 percento di Chrome, ma è un inizio. </p> <p> Pertanto, se in precedenza hai storto il naso con il browser di Microsoft, ora è un buon momento per dargli una seconda possibilità. Chissà, potresti essere conquistato dal miglior browser di Microsoft di sempre! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Spingere il browser al limite </h2> <p> Se non sei stato un fan dei browser Microsoft in passato, è un buon momento per entrare e vedere di cosa si tratta. Un grande aggiornamento è in lavorazione e da qui in poi non farà che migliorare. </p> <p> Microsoft sa che è su una formula vincente. In effetti, la società ha recentemente riferito che 600 milioni di persone in tutto il mondo ora utilizzano Edge per navigare sul Web. </p> <p> <small> Credito di immagine: DANIEL COSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}