{"title":"VW afferma che Apple non ha avuto un giro facile nell&#39;industria automobilistica","content":"<p> Herbert Diess, amministratore delegato del Gruppo Volkswagen, ha minimizzato qualsiasi potenziale impatto di una Apple Car sull&#39;industria automobilistica, affermando che VW non ha paura del Progetto Titan. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW &quot;Non ha paura&quot; di un&#39;auto Apple </h2> <p> Sebbene Diess riconosca che un&#39;automobile a marchio Apple può davvero avere senso, non pensa che Apple possa dominare il panorama automobilistico &quot;da un giorno all&#39;altro&quot; a causa dell&#39;intensa concorrenza. Tagliare l&#39;acciaio e vendere auto a consumatori esigenti è un&#39;attività difficile da affrontare, ha suggerito, aggiungendo che questo non è un campo che una sola azienda può &quot;prendere il controllo in un sol colpo&quot;. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> trasmette ciò che Diess ha detto alla Frankfurter Allgemeine Sonntagszeitung in un&#39;intervista: </p> <blockquote> <p> L&#39;industria automobilistica non è un tipico settore tecnologico che potresti rilevare in un colpo solo. Apple non ce la farà dall&#39;oggi al domani. Eppure non abbiamo paura. </p> </blockquote> <p> Tuttavia, un veicolo a marchio Apple avrebbe senso date le competenze di Apple in batterie, software, design industriale e le sue risorse apparentemente infinite, ha aggiunto il dirigente. Apple non offre alcun prodotto correlato all&#39;auto a parte il <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Software cruscotto CarPlay </a> che consente a un&#39;autoradio o a un&#39;unità principale di fungere da display e controller per un iPhone. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> Il segreto peggio tenuto del settore Industry </h2> <p> I piani per Project Titan (il nome in codice interno per un&#39;auto Apple) non sono ancora pubblici nonostante una raffica di voci recenti che dicono <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple stava cercando di collaborare con Hyundai/Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Si dice che Apple abbia parlato con altre case automobilistiche </a> e produttori a contratto, tra cui Magna, Nissan e Foxconn, sulla costruzione del suo veicolo a guida autonoma. Le fonti dicono che un&#39;auto Apple potrebbe non avere il volante perché inizialmente potrebbe <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> focus sulla consegna di cibo e operazioni di robotaxi </a> prima di essere venduto ai consumatori. </p> <p> </p> <p> Il più grande da asporto dal commento di Herbert sarebbe che l&#39;industria automobilistica ha prestato molta attenzione al Progetto Titan. Chiaramente, il solo pensiero che Apple entri in questo settore sta innervosendo alcuni dei massimi dirigenti. Detto questo, la storia è piena di persone che avrebbero dovuto sapere meglio del ridicolo Apple per aver inserito una nuova categoria di prodotti. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Come il CEO di Palm ha riso dell&#39;iPhone </h2> <p> Il miglior esempio di ciò è l&#39;ex CEO di Palm Ed Colligan. Poche settimane prima dell&#39;introduzione dell&#39;iPhone originale nel 2007, Colligan ha riso dell&#39;idea che un&#39;azienda nota per la progettazione di bei computer potesse conquistare clienti nel competitivo settore degli smartphone, dicendo: </p> <blockquote> <p> Abbiamo imparato e lottato per alcuni anni qui per capire come realizzare un telefono decente. I ragazzi del PC non si limiteranno a capirlo. Non entreranno semplicemente. </p> </blockquote> <p> Simile a come Colligan ha descritto Apple come &quot;ragazzi PC&quot;, il capo della Volkswagen sta cercando di minimizzare l&#39;idea che un&#39;azienda tecnologica possa acquisire clienti nel settore della produzione di automobili. La storia mostrerà se il commento di Herbert invecchierà meglio di quello di Colligan. </p>"}