{"title":"Volkswagen utilizzerà Microsoft Azure nelle auto a guida autonoma","content":"<p> Microsoft è desiderosa di entrare nel mercato delle auto a guida autonoma, ma non ha alcuna esperienza nella progettazione e costruzione di un&#39;auto. Tuttavia, può fornire il cervello dietro un&#39;auto intelligente e Volkswagen è interessata a utilizzare i servizi di Microsoft per i propri veicoli. </p> <h2 id=\"microsoft-and-volkswagen-s-partnership-for-automatic-cars\"> Partnership tra Microsoft e Volkswagen per le auto automatiche </h2> <p> La notizia di questa partnership si è diffusa il <a href=\"https://www.reuters.com/article/us-microsoft-volkswagen/volkswagen-taps-microsofts-cloud-to-develop-self-driving-software-idUSKBN2AB0SZ\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> . Volkswagen sta coinvolgendo Microsoft per aiutarla a entrare nel mondo delle auto a guida autonoma. </p> <p> Volkswagen possiede in realtà alcune diverse case automobilistiche, come Audi, Porshe e Lamborghini. Il problema era che gli ingegneri di ogni azienda stavano seguendo la propria strada verso la progettazione di un&#39;auto a guida autonoma invece di condividere le informazioni tra loro. </p> <p> Per risolvere questo problema, Volkswagen ha riunito tutti i suoi ingegneri automobilistici a guida autonoma in un unico grande gruppo, chiamato Car.Software. L&#39;idea era che il gruppo potesse unirsi e creare un&#39;unica piattaforma per auto intelligenti che Volkswagen potesse utilizzare per tutte le sue auto. </p> <p> Tuttavia, come si è scoperto, diversi ingegneri all&#39;interno di Car.Software stavano ancora utilizzando piattaforme diverse per sviluppare il loro codice. Pertanto, Volkswagen si è rivolta a Microsoft per fornire a tutti una piattaforma di base su cui lavorare. </p> <p> Ciò non significa che le auto Volkswagen stiano utilizzando Windows 10. Microsoft ha un&#39;altra piattaforma chiamata Azure, progettata per connettere dispositivi Internet of Things (IoT). </p> <p> Se questo suona familiare, è perché è lo stesso servizio che <a href=\"https://www.makeuseof.com/microsoft-powered-self-driving-car/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft si è offerta a Cruise per le sue auto a guida autonoma </a> . Ora è chiaro che l&#39;accordo Cruise non è stato un affare una tantum; Microsoft è seriamente intenzionata a far funzionare le auto su Azure. </p> <p> Considerando le prestazioni di Azure per Microsoft, non sorprende che il gigante del software voglia colpire il ferro finché è caldo. La combinazione dei servizi Azure e Xbox di Microsoft ha <a href=\"https://www.makeuseof.com/microsoft-reveals-record-profits/\" target=\"_blank\" rel=\"nofollow noopener\"> ha guadagnato all&#39;azienda un buon profitto durante la pandemia </a> . </p> <p> In quanto tale, c&#39;è un enorme incentivo a portare Azure su auto a guida autonoma per dargli una presenza ancora più grande nel mondo dei dispositivi intelligenti. Per quanto riguarda se Azure diventerà o meno un attore importante nel mondo delle auto intelligenti è ancora da vedere. </p> <p> </p> <h2 id=\"starting-the-engine-for-microsoft-azure\"> Avvio del motore per Microsoft Azure </h2> <p> Microsoft Azure è già un&#39;enorme fonte di guadagno per il gigante della tecnologia, il che significa che l&#39;azienda è in una posizione perfetta per espandersi in nuovi territori. Sia le auto a guida autonoma di Cruise che quelle di Volkswagen utilizzeranno Microsoft Azure come base, che può potenzialmente diventare un attore significativo nel futuro delle automobili. </p> <p> Per uno strano scherzo del destino, la vecchia rivalità tra Microsoft e Apple si sta diffondendo nel mondo delle auto intelligenti. Invece di fornire alle case automobilistiche solo la parte &quot;intelligente&quot;, Apple intende produrre &quot;Apple Cars&quot; complete entro il 2024. </p> <p> <small> Credito immagine: Andrey Suslov / <a href=\"https://www.shutterstock.com/image-vector/autonomous-smart-car-scans-road-operates-635238704\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}