{"title":"Facebookから永久に禁止される5つのこと","content":"<p> Facebookは、アカウントを削除することでTwitterほどよく知られていません。ただし、Facebookが単なる警告ラベル以上のもので対応する、いくつかの忌まわしい犯罪があります。 </p> <p> ここでは、Facebookの利用規約と、Facebookがその行動のために「プラットフォームを解除」したユーザーの歴史的な例を見て、会社がどこに線を引くかを探ります。 </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> Facebookの恒久的禁止に対する姿勢 </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> 他のソーシャルメディアサイトとは異なり、Facebookは恒久的な禁止につながる多くの犯罪をリストしていません。代わりに、主な要因として、違反の重大度ではなく、繰り返しの違反を挙げています。その結果、理論的には、Facebookの違反が何度も繰り返されると、プロファイルがブロックされる可能性があります。 </p> <p> しかし、完全に禁止される活動はほとんどなく、Facebookは驚くほど緩慢で、いくつかの違法な活動が認められています。たとえば、銃やマリファナなどの「規制された商品」をFacebookのマーケットプレイスで販売することは許可されていませんが、Facebookはそれを禁止可能な犯罪としてリストしていません。 </p> <p> Facebookは、プロファイルを削除するのではなく、投稿ごとにコンテンツにフラグを付けたり削除したりすることを好みます。ただし、例外があります。 </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1.ツールとデータの誤用 </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> Facebookの利用規約は、3つの禁止された違反を規定しています。 1つ目はアクションのコレクションであり、この記事の残りの部分ではこれについて詳しく説明します。 2番目と3番目はより具体的であり、Facebookのツールとデータの誤用と関係があります。 </p> <p> この一般的な利用規約は、開発者用に予約されているはずのサイトの一部にアクセスして使用することを禁じています。また、Facebookを使用してウイルスやマルウェアを拡散するなど、意図的に悪意のある方法で公開サイトツールを使用することも禁じられています。 </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2.公安への脅威 </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Facebookがアカウントを無効にすると言っている唯一のケースの1つは、「身体的危害または公共の安全に対する直接の脅威の真のリスク」のケースです。 Facebookはまた、「暴力的な使命を宣言する、または暴力に従事している」プロファイルを削除します。 </p> <p> これが、2021年1月の米国議会議事堂での暴動の後、当時の大統領ドナルド・トランプを無期限に禁止した理由でした。 </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3.暴力的なグループとの関係 </h2> <p> Facebookは、2020年10月に、個々のプロファイルに暴力的なコンテンツがなくても、QAnonの陰謀に関連するプロファイルを削除したときに、有害で脅威的なコンテンツに対して連想レベルのスタンスを取りました。陰謀グループは、2016年以来暴力的なエピソードを引き起こしています。 </p> <p> </p> <p> Facebookはまた、憎悪グループであるプラウドボーイズを参照する投稿について、音楽グループTraptを禁止しました。過激派の政治組織は、2016年以来、米国とカナダで街頭レベルの暴力に関与しています。 </p> <p> また、アカウントがFacebookに法的リスクをもたらす場合、会社はアカウントを無効にする権利を留保します。さらに、Facebookは、この種のコンテンツに遭遇したときに法執行機関やアウトリーチ組織と協力することについて、他のソーシャルメディアプラットフォームよりも断固として取り組んでいます。 </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4.他のアカウントのセキュリティを危険にさらす </h2> <p> Facebookがリストしているまれな禁止可能な犯罪のもう1つは、「他のアカウントと当社のサービスのセキュリティを危険にさらす」ことです。 Facebookのサービスのセキュリティを危険にさらすことは、利用規約に記載されているマルウェアや誤用によく似ています。ただし、他のアカウントのセキュリティを危険にさらすという考えは、doxingを指します。 </p> <p> </p> <p> Doxxingは、ソーシャルメディアユーザーの機密の実世界情報のリリースです。これには、自宅や職場の住所、個人の電話番号、またはリアルタイムの物理的な場所が含まれる可能性があります。この慣行は、多くの場合、その人に危害を加えることを目的として行われます。 </p> <p> </p> <h2 id=\"misinformation\"> 5.誤報 </h2> <p> </p> <p> Facebookの公式ガイドラインによると、Facebookは誤った情報を削除せず、他の人を誤解させることなく対話に貢献できるように、代わりにラベルを付けることを選択しています。ただし、停止されたアカウント所有者の多くは、Facebookが「FalseNews」と呼んでいるものが原因で削除されたと述べています。 </p> <p> これが発生する理由はいくつかあります。場合によっては、Facebookは、虚偽のニュースが個人または公衆の健康にも有害であると判断します。 </p> <p> これは。。。でした <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> 陰謀論者のデイビッド・アイクを削除するためのFacebookの説明 </a> とりわけ、5GインターネットがCovid-19を引き起こすと主張したことに対して。 Facebookはまた、Ickeが「繰り返し違反した」ポリシーを持っていたと述べた。 </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Facebookのポリシーとあなたのアカウント </h2> <p> プラットフォームを悪用して他の人に危害を加えない限り、ほとんどの場合、Facebookは問題を起こしません。ただし、会社が砂に線を引くという特定の問題があります。 </p> <p> これらの利用規約に違反しない場合は、Facebookの恒久的な禁止から安全を確保する必要があります。 </p>"}