{"title":"ソーシャルメディアがあなたが新しい言語を学ぶのを助けることができる8つの方法","content":"<p> 学校で受けたスペイン語の教科書やフランス語の授業の悪夢はまだありますか？恐れるな。インターネットのおかげで、最近の新しい言語を学ぶことは楽しくてアクセスしやすいものになります。 </p> <p> 特にソーシャルメディアは、世界中の何百万人もの言語学習者をつなぐのに役立っています。ドイツ語のように人気のあるものを学んでいる場合でも、フェロー語のようにわかりにくいものを学んでいる場合でも、旅の手助けとなる幅広いリソースを見つけることができます。 </p> <p> ソーシャルメディアを使用して次の外国語を習得する方法をいくつか紹介します。 </p> <h2 id=\"join-facebook-groups\"> 1.Facebookグループに参加する </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> Facebookには、考えられるほぼすべての言語のグループがあります。スキルの向上を目指している、新しく引っ越した外国人のコミュニティや、世界中の学習者のためのグループがあります。あなたの経験を最大限に活用するには、両方に参加する必要があります。 </p> <p> 適切なFacebookグループを見つけるには、簡単なオンライン検索を実行できます。または、Facebook内から探しているものを見つけることができます。これを行うには、グループに移動して言語を検索します。次に、これらのニーズに一致するコミュニティのリストを取得します。 </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> 地元の語学学校で勉強している場合は、クラスメートとつながるための独自のグループを作成することもできます。これをする、 <strong> [グループ]&gt; [新しいグループの作成]に移動します </strong> 。その後、設定を編集して、メンバーの招待を開始できます。 </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2.Redditを利用する </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Redditは、言語学習者にとって金鉱である人気のあるオンラインフォーラムです。特定の言語と一般的な言語学習の両方のサブレディットがあります。 </p> <p> subredditに参加すると、あなたの道を歩んだ他の学習者からの多くの役立つヒントやヒントを見つけることができます。また、間違いなく関連するミームがたくさんあります。 </p> <p> subredditを見つけるには、上部の検索バーに移動して、言語を入力します。結果が読み込まれたら、地域の習慣についてさらに学ぶために、学習固有のグループと文化的なグループの両方に参加する価値があります。 </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3.ネイティブスピーカーと接続する </h2> <p> 言語を早く学ぶための最良の方法は、すでにそれを話している人々と話すことです。そして、ソーシャルメディアはこれらの講演者を見つけるのに最適な場所です。あなたは数人に手を差し伸べる必要があるかもしれません、しかし結局、あなたはあなたを助けるためにいくらかの時間を取っておくことをいとわない誰かを見つけるでしょう。 </p> <p> ソーシャルメディアでネイティブスピーカーとつながるときは、最初に友情を築くことに焦点を合わせます。あなたが彼らと同じ都市にいるなら、彼らに会い、コーヒーの代金を払うことを申し出てください。さらに遠くにいる人のために、あなたがすでに話している言語の1つを彼らが学ぶのを手伝うことを申し出てください。 </p> <p> これらの手順は、各ソーシャルメディアプラットフォームで類似しています。 InstagramまたはTwitterで、それらをフォローしてメッセージを送信します（プライバシー設定で許可されている場合）。 Facebookでも同様のアプローチを取ることができますが、知らない人からの友達リクエストを受け入れる気がない人もいます。 </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4.独自のソーシャルメディアコンテンツを作成する </h2> <p> あなたは自分自身が言語を学ぶのを助けるためにソーシャルメディアで消費する必要はありません。独自の投稿も作成してみてください。そうすることはあなたがあなたのスピーキングとライティングを練習するのを助けるだけではありません。また、練習する新しいユーザーを見つけるかもしれません。 </p> <p> コンテンツの作成に関しては、多くのオプションがあります。 Twitterでは、会話に参加したり、ターゲット言語でツイートの一部を書き込んだりできます。 Instagramを使用すると、キャプションを書き込んだり、グラフィックを作成したり、自分の会話を録音したりできます。 </p> <p> 独自のソーシャルメディアコンテンツを作成すると、ネイティブスピーカーからのフィードバックも得られます。それに加えて、ポートフォリオを拡大し、いくつかの有用な新しいスキルを学ぶこともできます。 </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5.アプリを学習している言語に設定します </h2> <p> 電話の設定を変更することは、あなた自身があなたの目標言語で考え、それを快適に読むようにする簡単な方法です。また、語彙に数十の新しい単語を追加します。 </p> <p> </p> <p> すべての大規模なソーシャルメディアネットワークには、言語を変更できるアプリ内設定があります。たとえば、Instagramでは、 <strong> アカウント&gt;言語 </strong> 。次に、使用できるすべての言語のドロップダウンが表示されます。 </p> <p> <strong class=\"gallery__section-title\"> 画像ギャラリー（2画像） </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> 展開 <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> 展開 </p> <p> 閉じる </p> <p> 電話の設定を使用して、アプリのすべての言語を一度に変更することもできます。に移動 <strong> 設定 </strong> &gt;&gt; <strong> 一般&gt;言語と地域 </strong> 。そこから、利用可能なすべての言語のリストが表示されます。小さい言語の場合、アカウントを最適化できない場合があることに注意してください。 </p> <p> <strong class=\"gallery__section-title\"> 画像ギャラリー（2画像） </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> 展開 <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> 展開 </p> <p> 閉じる </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6.ハッシュタグを最大限に活用する </h2> <p> ハッシュタグを使用して検索することは、学習している言語でより多くのユーザーを見つけるための強力な方法です。さまざまなものを使用することで、ネイティブスピーカーと他の学習者の両方のコンテンツに接続して消費することができます。 </p> <p> 探しているコンテンツの種類を見つけるには、他の学習者が何を使用するかを考えてください。また、特定の国の既存のトピックを検索して、ネイティブスピーカーのコンテンツを見つけることもできます。多くの場合、これらはトレンドの投稿や記事で見つけることができます。 </p> <p> ハッシュタグを検索するには、使用しているソーシャルメディアアプリで検索機能を使用します。それらを使用する投稿をクリックして、すべてのレイアウトされた結果を見つけることもできます。 </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7.ターゲット言語でアカウントをフォローする </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> あなたが英語でフォローしているすべての興味深いアカウントは、おそらくあなたのターゲット言語で同等のものを持っています。これらは大規模な出版物である場合もあれば、母国語で作品を作成する方が快適な日常の講演者である場合もあります。 </p> <p> </p> <p> また、お気に入りの雑誌、スポーツチーム、音楽アーティストがターゲット言語のアカウントを持っているかどうかも確認する必要があります。たとえば、世界最大のスポーツクラブの多くは、英語、スペイン語などのアカウントを持っています。 </p> <p> 学習したい言語でアカウントをフォローする場合、経験則として、英語のコンテンツが同じように興味深いと感じた場合にのみフォローすることをお勧めします。そうしないと、後でそれらを無視してフォローを解除することになります。 </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8.ソーシャルメディアで言語学習アプリをフォローする </h2> <p> <strong class=\"gallery__section-title\"> 画像ギャラリー（2画像） </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> 展開 <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> 展開 </p> <p> 閉じる </p> <p> 言語学習アプリには、アクティブなソーシャルメディアプロファイルも含まれていることがよくあります。これらは、一般的なヒントを理解し、ノルウェー語を学んでいるか日本語を学んでいるかにかかわらず、誰もが直面する一般的な闘争に関連するのに最適です。 </p> <p> フォローする価値のあるアカウントには、Babbel、Busuu、Duolingoがあります。 </p> <p> ただし、これらのアプリを消費のために使用する必要はありません。コメントにあなたの考えを自由に追加してください。彼らがあなたとは完全に異なる言語を学んでいるとしても、あなたは何人かの新しい友達を作るかもしれません。 </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> ソーシャルメディアで言語を楽しく学ぶ </h2> <p> だから、あなたはそれを持っています。今、あなたはあなたの言語学習の旅を楽しくするのを助けるためにソーシャルメディアを使うというより多くの考えを持っています。教科書の仕事はまだ重要ですが、それがあなたの唯一の選択肢ではありません。 </p> <p> アプリをターゲット言語に最適化できない場合でも、接続できるネイティブスピーカーや仲間の学習者がたくさんいます。 </p> <p> ソーシャルメディアで言語を学ぶための鍵は、従事することと消費することの両方です。そうすることで、あなたの経験はより充実したものになり、教科書では決して教えられなかった言葉を拾うでしょう。 </p>"}