{"title":"キヤノンはあなたのベストショットを見つける写真カリングアプリを起動します","content":"<p> ほぼすべての完璧な写真の背後には、ほぼ同じように見える他の写真でいっぱいのカメラロールがあります。写真家がシャッターボタンを押したままにしておくことは珍しくありません。一瞬を逃してしまうのではないかと恐れています。 </p> <p> 数十枚、場合によっては数百枚の写真を調べてお気に入りを選び、ストレージスペースを空けるのは、長くて煩わしいプロセスになる可能性があります。ありがたいことに、キヤノンはあなたのためにそれを自動的に行う新しいアプリをリリースしました。 </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> 簡単に写真を数枚まで撮りましょう </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> キヤノンUSA </a> で写真カリングアプリを起動しました <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> App Store </a> それはあなたがあなたの最高の写真を素早くそして簡単に見つけることを可能にします。アプリ自体は無料ですが、それを使用するには、$ 14.99 /年または$ 2.99 /月のサブスクリプションを取得する必要があります。どちらのサブスクリプションオプションにも3日間の試用版があります。 </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> キヤノンUSAのエグゼクティブバイスプレジデントである「トニー」カノタツロは次のように説明しています。 </p> <blockquote> <p> 何千枚もの写真がキャプチャされ、人のスマートフォンに保存される今日の絶え間なく変化する圧倒的な世界では、消費者は、長年の信頼できる知識と技術に基づいて最適な写真を決定するのに役立つ、専門家で信頼性が高く直感的な写真ツールを必要としています。 </p> </blockquote> <p> キヤノンのアプリは、単にPhoto Cullingという名前で、写真インテリジェンスラーニングまたは略してPHILと呼ばれるAIで動作します。 PHILは、選択した2つの写真カリングオプションのどちらに基づいて、どの写真を保持し、どの写真を削除するかを提案します。 </p> <p> 最初のオプション、 <strong> 全体の淘汰 </strong> 、に最適です <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> より良いポートレート写真 </a> 。このオプションを選択すると、PHILは、シャープネス、ノイズ、感情、および被写体の目を閉じているかどうか（該当する場合）の4つの要素に基づいてスコアを付け、最適な写真を決定します。 </p> <p> 一方、 <strong> 同様の淘汰 </strong> オプションは、類似した写真間のスコアを比較することにより、ベストショットを選択します。たとえば、雲の写真を何枚か撮り、次に花の写真を何枚か撮ったとします。アプリは、雲の写真と花の写真を別々のグループに分けます。 </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> どちらのカリングオプションを選択しても、写真のスコアが設定した目標スコアを超えている場合、その写真はキーパーと見なされます。その後、PHILは、スコアが十分に高くなかった残りの写真を削除することを提案します。 PHILに同意できない場合でも、心配する必要はありません。あなたはまだあなたのすべてのショットを完全に制御することができます。 </p> <p> </p> <p> アプリのその他の機能には、写真の数と保存容量の表示情報、フォトアルバム、写真のスコアのパラメータ設定、ダークモードを使用するオプションなどがあります。 </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> キヤノンのフォトカリングアプリをダウンロードしますか？ </h2> <p> キヤノンの写真カリングアプリには、最高の写真を選ぶプロセスを面倒にするために必要なものがすべて揃っているようです。しかし、結局のところ、自分でできることに対してお金を払うことを正当化するのに十分な写真カリングを嫌うかどうかを決めるのはあなた次第です（おそらく非常にゆっくりで退屈ですが）。 </p> <p> 執筆時点では、このアプリはAndroidで利用できませんが、おそらくキヤノンは将来のカードにそれを持っています。 </p>"}