{"title":"コンピューターRPGとクラシックRPG：2021年のCRPGとはどういう意味ですか？","content":"<p> コンピュータRPGの歴史は、ビデオゲーム自体の歴史と同じくらい長く、何年にもわたって進化し、共に成長しています。そして、CRPGが進化し、グラフィックを改善し、ゲームプレイメカニズムを追加または削除したように、CRPGを説明するために使用された意味と用語も進化しました。 </p> <p> 伝統的にコンピューターロールプレイングゲームの略であった頭字語CRPGは、時間の経過とともにその意味を拡大し、さまざまなプラットフォーム用のRPGを含めました。今、それは新しい意味を採用しています。その新しい意味は元の意味と完全に異なるわけではありませんが、特定のRPGサブジャンルを説明するようになりました。 </p> <h2 id=\"the-history-of-crpgs\"> CRPGの歴史 </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> CRPGの歴史は、1970年代に、卓上RPG Dungeons＆Dragons、Dungeonの最も初期のビデオゲーム適応のリリースから始まりました。ゲームはもともとアタリで利用可能でした（あなたはそれを介してプレイすることができます <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade、Plexのゲームストリーミングサービス </a> ）。 </p> <p> ダンジョンのゲームプレイは主にテキストベースでしたが、ダンジョンズ＆ドラゴンズの基本的な信条のほとんどを実装しながら、ファンタジーの設定でマルチキャラクターパーティーの動きを完全に説明しました。 </p> <p> 当時、私たちはそれらをコンピューターRPGとラベル付けして、当時はるかに人気があった卓上型のものと区別し、単にRPGとして知っていました。 </p> <p> 1990年代までに、満開のCRPGは、少なくともトップダウンの視点またはアイソメトリックビューでファンタジーの世界を完全に表示できるようになりました。これは、この作家がプレイした中で最もインタラクティブなCRPGの1つであるウルティマVIIの場合でした。 </p> <p> 見ることができるほとんどすべてのものを移動したり、操作したりできます。武器を作ったり、楽器を演奏したり、死んだパーティーメンバーをダンジョンから王の玉座まで運んで復活させたりすることもできます。 </p> <p> Baldur&#39;s Gateは、卓上RPG体験を最も厳密にエミュレートしたものの1つでした。 Dungeons＆Dragons 2nd Editionのルールセット（別名Advanced Dungeons＆Dragons）をアイソメトリックに適合させました <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> リアルタイムの一時停止可能なCRPG </a> 。これらの種類のCRPGは、戦闘、キャラクターの進行、意思決定における戦術を強調し、探索を奨励しました。 </p> <p> </p> <p> 今日、コンソールが市場を支配している世界では、ロールプレイングビデオゲームが卓上RPGよりも人気が高まっています。現代の使用では、頭字語RPGはそのビデオゲームバージョンをより指します。 Dungeon&#39;s＆Dragonsは、単なるRPGではなく、卓上RPGと呼ばれます。 </p> <p> グラフィックスの進化に伴い、CRPGのゲームプレイメカニズムは最新のグラフィックス標準に適合しました。 The Elder Scrolls、Gothic、The WitcherなどのCRPGシリーズは、このジャンルに革命をもたらし、いくつかの新しいゲームプレイメカニズムを導入し、他のメカニズムを削除しました。 </p> <p> これらのRPGは、よりアクション指向でペースが速く、完全ではありませんが、ハックアンドスラッシュのサブジャンル内にある程度配置されています（これらはまだ堅実なRPGです！） </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> CRPGの新しい波 </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> それでも、グラフィックのリアリズムを求める今日のビデオゲーム業界の傾向に逆らって、CRPGの新たな波がやって来ました。オールドスクールまたはクラシックのRPGは、これらのゲームに大きな影響を与え、ビジュアルよりもゲームプレイの仕組みと没入感に重点を置いています。 </p> <p> それらは一般的に等角ゲームであり、リアルタイムの一時停止可能またはターンベースの戦術的な戦いがあります。これらのCRPGは、可能な限り没入型になるように最善を尽くし、巧妙に作成された散文のやや大きなブロックと堅実なバックストーリーを提供します。 </p> <p> それらのほとんどは、古い学校のCRPGのように、ほとんどの対話で声優ではなくテキストに依存しています。これらのCRPGには、Pillars of Eternity、Divinity：Original Sin、Pathfinder：Kingmakerなどがあります。 </p> <p> これらのゲームは、昔ながらのCRPGと同じように、戦闘戦術、キャラクターの進行、意思決定を強調し、探索を促します。これらの理由から、私たちはそれらをほとんどの最新のRPGよりもクラシックRPGに密接に関連していると考えています。 </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> 2021年のCRPGの意味 </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> 2000年代以降、RPGは、ロールプレイングビデオゲームを指すときの標準的な用語になりました。しかし、2015年頃、彼らはDivinity：Original Sin and Pillars ofEternityをリリースしました。 </p> <p> これらのRPGは、美学とゲームプレイの仕組みの両方で古いタイトルと非常に似ている一方で、現代のRPGのアクション指向のテイクからの逸脱でした。これらのRPGを現代のRPGと区別するために、新しい用語が必要になったのはこの頃でした。 </p> <p> 人々はこれらのゲームを説明するために何年もの間オンラインで「オールドスクール」と「クラシックRPG」という用語を投げかけてきましたが、後者は行き詰まっています。現代のロールプレイングビデオゲームが自分たちの頭字語RPGを主張したように、人々は今では古い学校のRPGを「CRPG」と呼んでいます。 </p>"}