{"title":"あなたの個人データを雇用者から安全に保つ方法","content":"<p> 監視技術は、オフィスの内外で横行しています。多くの雇用主は、電話、ラップトップ、タブレットなどの会社発行のデバイスにモバイル管理製品を利用しています。これらには、企業を盗難、企業スパイ、または悪意から保護するように設計されたプログラムが含まれています。 </p> <p> ただし、これはすべて会社を保護するのに最適ですが、必ずしも最善の方法ではありません。もはや問題ではありません <strong> もし </strong> あなたの会社はあなたを追跡しています。次に質問する必要があるのは、企業が実際に見つけることができるデータの量です。驚いたことに、たくさん。 </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> 雇用主は会社のWi-Fiとリモートデバイスで何を見ることができますか？ </h2> <p> ほとんどの人は、企業がデータにアクセスできる範囲や、企業のデバイスを使用するときにサインオーバーするデータの量に気づいていません。下記は用例です。 </p> <h3 id=\"location\"> ロケーション </h3> <p> 多くの従業員は、仮想プライベートネットワーク（VPN）を使用するだけで、自分が本来あるべき場所にいると雇用主に信じ込ませることができると考えています。 </p> <p> 個人のデバイスで実際の場所を隠す方法はありますが、特に会社が発行した電子メールアドレスまたは携帯電話番号を使用してアプリケーションやWebサイトにログインした場合、完全に確実な方法ではありません。 </p> <p> </p> <p> 会社が発行したデバイスを使用する場合、実際の場所を隠すことはほぼ不可能です。たとえば、電気通信会社は、ローミングパートナーのいずれかに接続したことを検出できます。 </p> <p> さらに、企業VPNは、ゲートウェイが内部ITチームによって監視されている商用VPNとは異なります。 </p> <h3 id=\"notes-documents-and-emails\"> メモ、ドキュメント、および電子メール </h3> <p> あなたが次の仕事を見つけるために会社のWi-Fiを使用していることを誰も知らないと思うなら、あなたは間違っています。会社のメールアドレスを使用していない場合でも、多くの企業では、リアルタイムのアクティビティログ、閲覧履歴の更新、開いているドキュメントやメールのスクリーンショットなど、会社のノートパソコンにプログラムがプリインストールされています。 </p> <p> 多くの企業は、起こりうるデータ侵害から保護することを前提として、これらをレポートメカニズムまたは生産性トラッカーとしても使用しています。 </p> <p> </p> <h3 id=\"online-messaging-history\"> オンラインメッセージングの履歴 </h3> <p> 暗号化されたプラットフォームの台頭にもかかわらず、実際には、メッセージは企業のデバイス上で完全にプライベートではありません。メッセージングプラットフォームを使用する場合、企業は取引所の正確な詳細を確認できない場合がありますが、ファイルサイズやタイプなどのメタデータは認識できる可能性があります。 </p> <p> これにより、WhatsAppなどのアプリを介して大きなサイズのPDFを送信することにした場合、会社の侵入検知システムが疑わしい動作のフラグを立てる可能性があります。企業のガイドラインに沿って、彼らはあなたの行動が悪意のあるものではないことを証明するようにあなたに求めるかもしれず、クリアランスのためにリーダーシップからの承認を要求する必要があるかもしれません。 </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> 雇用主との個人データの共有を回避する方法 </h2> <p> 個人情報、会話、活動を常に完全に手の届かないところに置く絶対的な方法はありません。ただし、リスクを軽減する方法はいくつかあります。 </p> <p> 私たちはあなたの雇用主からデータを隠すことを推奨しません。実際、彼らには従業員に関する情報を収集する権利があります。 <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> あなたを合法的に追跡することができます </a> 。しかし、物事を自分自身に留めておくことが適切な時期を知る必要があり、それは個々の企業によって異なります。 </p> <h3 id=\"read-company-policies\"> 会社の方針を読む </h3> <p> データの透明性について議論する前に、雇用主のために働くことによって故意に雇用主に提供している情報の種類も理解する必要があります。何が期待されているかを知っている場合にのみ、適切な専門的境界を確立することができます。 </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> 収集する前に、会社のデータ収集ポリシーと手順を理解することを目指します。そこから、必要以上の情報の提供をオプトアウトする計画を効果的に立てることができます。 </p> <h3 id=\"use-personal-gadgets\"> パーソナルガジェットを使用する </h3> <p> 会社のデバイスを使用してお金を節約することは常に魅力的ですが、現実には、本当に無料のものはありません。個人使用のためのラップトップ、携帯電話、およびタブレットに投資します。 </p> <p> 個別の個人用デバイスを持つことも、特にリモートで作業する場合に、境界を確立するための優れた方法です。 </p> <p> 独自のデバイスを使用すると、データを詮索好きな目から守るために必要なさまざまなセキュリティ対策を確立して管理することができます。不必要な出費のように思えるかもしれませんが、安心を保つのに大いに役立ちます。 </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> パーソナルデバイスでゲストプロファイルを使用する </h3> <p> 自分のものではないネットワークに接続することは、たとえそれが職場にあるとしても、常にセキュリティリスクです。会社のWi-Fiにサインインすると、雇用主はメッセージのメタデータから閲覧履歴ログまですべてにアクセスすることができます。 </p> <p> 会社のネットワークで個人のラップトップを使用する必要がある場合は、ゲストプロファイルを使用して、リモートでアクセスできるデータの量を減らすことができます。または、個人の携帯電話のデータプランまたはポータブルWi-Fiデバイスに接続することもできます。 </p> <h3 id=\"keep-your-passwords-safe\"> パスワードを安全に保つ </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> 強力なパスワードの作成 </a> 十分ではありません。パスワードが会社のデバイスに保存されないようにする必要があります。所有していないガジェットにオンラインバンキングアカウント、個人のメール、政府のウェブサイトの個人パスワードを保存すると、会社のデータベースが危険にさらされた場合にデータがすぐに危険にさらされます。 </p> <p> 重要なアカウント、特にお金が関係するアカウントにアクセスするには、個人の携帯電話またはラップトップのみを使用してください。可能な限り、2要素認証を有効にしてください。 </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> 仕事と私生活を分ける </h2> <p> 雇用主は、あなたが何らかの形の違法行為に参加している、会社情報を危険にさらしている、または法執行機関から調査を求められている疑いがある場合、会社が発行したデバイスにリモートでアクセスする権利があります。 </p> <p> ただし、これは個人用デバイスとは異なります。 </p> <p> あなたのセキュリティは、あなたが接触している人々、つまりあなたの雇用主と同じくらい強力です。個人用デバイスと仕事用デバイスを分離しておくことは、データを分散化するための1つのステップにすぎません。強力なセキュリティ対策を講じることで、ハッカーがドキュメント、メール、ネットワークにアクセスできるアクセスポイントの数を制限できます。 </p> <p> 個人データの分散化は、個人としてのあなたとあなたの会社を盗難、詐欺、およびその他の形態のサイバー犯罪から保護するために必要です。 </p>"}