{"title":"トップインスタントメッセージングサービスがエンドツーエンド暗号化を使用する方法","content":"<p> 個人データはこれまで以上に重要です。政府、企業、サイバー犯罪者は、人々の個人データが彼らの利益に役立つことを切望しています。オンラインのさまざまなプラットフォームにより、私たちの知らないうちに個人データを簡単に配布できるようになりました。 </p> <p> このため、オンラインで使用するプラットフォームがプライバシーをどのように保護しているかをよく理解することが重要です。メッセージングアプリケーションの保護対策を検討する際に注意すべき重要な要素の1つは、エンドツーエンドの暗号化です。 </p> <p> データプライバシーを優先する必要性を認識し、より多くのメッセージングアプリケーションがエンドツーエンド暗号化を実装するために重要な措置を講じています。 </p> <h2 id=\"what-is-end-to-end-encryption\"> エンドツーエンド暗号化とは何ですか？ </h2> <p> </p> <p> エンドツーエンド暗号化は <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> 通信を暗号化する方法 </a> そのため、サードパーティは、互いにメッセージをやり取りする人々の間で共有される情報にアクセスできません。 </p> <p> エンドツーエンド暗号化では、プレーンテキストではなくシークレットコードを使用してメッセージのコンテンツを隠します。これは、エンドツーエンドの暗号化されたプラットフォームで通信している人だけが、自分たちの間で送信されているメッセージを読み取ることができることを意味します。 </p> <p> 3つの人気のある安全なメッセージングサービスであるSignal、WhatsApp、Telegramがエンドツーエンド暗号化をどのように使用しているかを見てみましょう。 </p> <p> </p> <h2 id=\"signal\"> 信号 </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signalは、最も安全なメッセージングアプリケーションの1つと見なされています。プラットフォーム上のすべての通信は、デフォルトでエンドツーエンドで暗号化されます。 </p> <p> Signalはクラウド上のメッセージをバックアップしないため、情報を取得するための代替方法を使用して悪意のある人物のリスクが軽減されます。また、メッセージのメタデータを暗号化して、メッセージングアクティビティの場所と時刻が追跡されないようにします。 </p> <p> オープンソースの暗号化エンジンを使用することで、一般の人々は、メッセージング活動の背後にあるテクノロジーの透明性を高めることができます。ユーザーは、技術的な詳細を詳しく調べて、プライバシーを保護するために使用される方法をよりよく理解できます。 </p> <p> オープンソースプラットフォームは、ソフトウェアを長期的に使用するのをはるかに簡単かつ安全にすることができます。人々はソフトウェアがどのように機能するかをよりよく理解できるだけでなく、独自のバージョンのアプリケーションをセットアップしようとすることもできます。これは、独自のセキュリティニーズにより適している可能性があります。 </p> <p> Signalは、マルチパーティオフレコメッセージングと呼ばれるOTRの組み合わせを使用します。これにより、グループチャットでメッセージをエンドツーエンドで暗号化できます。ネットワークの参加者数が増えると、データ侵害のリスクが高まる可能性があります。エンドツーエンドの暗号化されたグループチャットを使用すると、このようなリスクが大幅に軽減されます。 </p> <p> </p> <h2 id=\"whatsapp\"> WhatsApp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsAppは、エンドツーエンドの暗号化を可能にした最初の人気のあるメッセージングアプリケーションの1つでした。メッセージと通話にエンドツーエンドの暗号化を使用します。 </p> <p> WhatsAppは、Signalメッセンジャーの背後にあるチームであるOpen WhisperSystemsによって開発されたエンドツーエンドの暗号化プロトコルを使用します。 Signalの暗号化プロトコルの安全性を考えると、これはアプリケーションにとって大きなプラスです。 </p> <p> </p> <p> WhatsAppが独自の展開を使用しているということは、Signalの完全なオープンソースソフトウェアほど、幅広いセキュリティ研究者によって頻繁に調査されない可能性があることを意味します。 </p> <p> メッセージの暗号化にもかかわらず、メッセージはクラウドにバックアップでき、アプリのメタデータは暗号化されていないため、他の方法を使用して、WhatsAppで送信されているメッセージの詳細を調べることができます。これにより、メッセージの時間と場所を簡単に知ることができます。さらに、Google検索でインデックスに登録されたWhatsAppグループチャットのレポートが浮上し、グループチャットのセキュリティに疑問が投げかけられました。 </p> <p> </p> <h2 id=\"telegram\"> 電報 </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegramは、暗号化と自己破壊型メッセージの使用で愛されています。悲しいことに、Telegramにはエンドツーエンドの暗号化に関する懸念がいくつかありますが、多くのユーザーにはそれほど明白ではないように思われるかもしれません。 </p> <p> Telegramでは、エンドツーエンド暗号化はデフォルトで有効になっていません。ユーザーがシークレットチャットに切り替えた場合にのみ提供されます。技術的な傾向がないユーザーにとって、これは彼らが気づいてさえいないかもしれないセキュリティリスクを提示します。 </p> <p> Telegramは、クラウドにバックアップされているサーバーに保存されているメッセージにアクセスできます。これは、サイバー犯罪者がアプリケーションからメッセージングデータを盗もうとした場合に、個人データの侵害につながる可能性のある追加の攻撃ベクトルを提示すると考える人もいます。 </p> <p> そうは言っても、Telegramのすべてのシークレットチャットはデバイス固有です。つまり、シークレットチャットを介して送信するメッセージには、送信元のデバイスからのみアクセスできます。 </p> <p> Telegramのシークレットチャットはエンドツーエンドで暗号化されていますが、グループチャットは暗号化されていません。これは、ユーザーが同じグループチャットに複数のデバイスを使用できる可能性があることを意味します。チャットログは、ユーザーが複数のデバイスにダウンロードできます。 </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> 上の秘密のチャット <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> ＃電報 </a> つまり、メッセージはエンドツーエンドの暗号化によって保護され、設定された時間が経過すると削除されます。 <br><br> この機能を有効にする方法は次のとおりです。 <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> —カスペルスキー（@kaspersky） <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 2021年1月31日 </a></blockquote>  <p> Telegramは、通常のチャットと秘密のチャットの両方から、リモートサーバー上にリンクプレビューを作成します。ユーザーがシークレットチャットで初めてリンクを入力すると、アプリケーションはリンクがリモートサーバーに送信されることを警告します。プライベートチャットで共有されているリンクをリモートサーバーに送信すると、エンドツーエンドの暗号化の目的に反するため、これはセキュリティ上の弱点と見なされます。 </p> <p> Telegramの暗号化プロトコルであるMTProtoは、モバイル上のアプリケーションからサーバーAPIにアクセスするように設計されています。これは独自仕様であり、部分的にのみオープンソースです。これは、メッセージを保護するために使用されている暗号化方法に対して、一般の人々がどれだけの制御と理解を持っているかということに疑問を投げかけています。 </p> <p> ありがたいことに、メッセージングアプリケーションはデータ侵害について深刻な主張に直面していませんが、そのオペレーターがあなたのメッセージにアクセスする可能性があることを知っているのは心配です。 </p> <p> 懸念にもかかわらず、多くの人は、メッセージにアクセスするためにジャンプする必要があるさまざまな法的フープによって安心するかもしれません。 Telegramは過去に、人々がそのプラットフォーム上のメッセージにアクセスすることがいかに難しいかを明らかにしました。キーは、多くの人々を苛立たせるさまざまな管轄区域からアクセスする必要があります。 </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> 最も安全なメッセージングアプリケーションの選択 </h2> <p> SignalはWhatsAppほど人気が​​ないかもしれませんが、そのプロトコルは、エンドツーエンド暗号化でのWhatsAppの成功に大きく貢献しています。エンドツーエンド暗号化の方法はWhatsAppに似ていますが、エンドツーエンド暗号化に関してはWhatsAppよりも優れていると考えられています。ユーザーを保護するために追加の手順を実行することで、他とは一線を画しています。 </p> <p> エンドツーエンド暗号化を優先しないというTelegramの決定は、利便性を優先することに起因しています。暗号化が不足している場合は、クラウド暗号化でユーザーを保護する間接的な方法と、さまざまな法域でのキーの保存で補います。 </p>"}