{"title":"HBOMaxは6月にラテンアメリカで発売されます","content":"<p> WarnerMediaのストリーミングサービスであるHBOMaxは、2021年6月にラテンアメリカとカリブ海全域で開始されます。このサービスが米国以外で利用できるのはこれが初めてです。 </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> ラテンアメリカでHBOMaxはどこで発売されますか？ </h2> <p> 現在、HBOMaxは米国でのみご利用いただけます。 2021年6月下旬に、ラテンアメリカとカリブ海の多くの国で利用できるようになります。ニュースはで発表されました <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> ワーナーメディアのプレスリリース </a> 。 </p> <p> 具体的には、これらの国は次のとおりです。アンギラ、アンティグア、アルゼンチン、アルバ、ブリティッシュバージンアイルズ、バハマ、バルバドス、ベリーズ、ボリビア、ブラジル、ケイマン諸島、チリ、コロンビア、コスタリカ、クラカオ、ドミニカ、ドミニカ共和国、エクアドル、エルサルバドール、グレナダ、グアテマラ、ガイアナ、ハイチ、ホンジュラス、ジャマイカ、メキシコ、モントセラト、ニカラグア、パナマ、パラグアイ、ペルー、セントクリストファーネイビス、セントルシア、セントビンセント、スリナム、トリニダードとトバゴ、タークスカイコス諸島、ウルグアイ、およびベネズエラ。 </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> HBO Maxはラテンアメリカで何を提供しますか？ </h2> <p> </p> <p> 直接または「適格パートナー」を通じて支払う既存のHBOGOサブスクライバーは、HBOMaxに即座にアクセスできます。その後、HBOGOは地域全体で段階的に廃止されます。 </p> <p> 価格の詳細は発表されていませんが、新しいコンテンツやプロモーションのオファーに関する情報とともに、今後数か月で約束されています。 </p> <p> 米国と同様に、HBO Maxはさまざまなサブスクリプションパッケージを提供し、スマートフォン、タブレット、その他のスマートプラットフォームなどのデバイスをサポートします。 </p> <p> </p> <p> ニュースを発表する予告編では、ゲーム・オブ・スローンズやフレンズなどのシリーズのクリップと、マトリックスやカサブランカなどの映画を見ることができます。ただし、最後に小さなメッセージが表示され、「発売時にすべてのタイトルが利用できるわけではありません」と警告されます。 </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> HBO Maxはいつグローバルに利用可能になりますか？ </h2> <p> 昨年、ワーナーブラザースは、2021年の劇場版全体をHBOMaxにリリースする計画を物議をかもして発表しました。それは監督を引き起こした <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> クリストファー・ノーランがHBOMaxを「最悪のストリーミングサービス」とブランド化 </a> 。 </p> <p> それにもかかわらず、映画業界の一部はうめき声を上げているかもしれませんが、それは消費者にとって素晴らしい選択の動きです。 </p> <p> そのため、ラテンアメリカとカリブ海諸国の人々は、この取引が彼らにも当てはまることを期待して、HBOMaxの発売に興奮する可能性があります。 </p> <p> 残りの世界は？確定した日付は設定されていませんが、ワーナーメディアは、北欧、スペイン、中央ヨーロッパ、ポルトガルが今年後半にHBOMaxにアップグレードされる予定であることを明らかにしました。 </p> <p> HBO MaxInternationalの責任者であるJohannesLarcherは、次のように述べています。 </p> <blockquote> <p> ラテンアメリカとカリブ海地域でHBOMaxを発売することに興奮しています。これは、米国外および世界中の消費者にWarnerMediaのDirect-to-Consumerサービスを提供するための最初のステップです。 </p> </blockquote>"}