{"title":"スマートガレージドアコントローラーをインストールする方法","content":"<p> スマートフォンやタブレットでガレージのドアを制御しますか？あなたがすでにあなたの家にガレージドアオープナーをインストールしているならば、スマートコントローラーは素晴らしいオプションです。 </p> <p> スマートガレージドアコントローラーの取り付け方法を紹介します。 </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> オープナーとコントローラーの違い </h2> <p> スマートガレージドアオープナーとコントローラーの間には2つの主な違いがあります。 1つ目はサイズです。 </p> <p> ほとんどのオープナーは大きく、ガレージの天井に取り付けられます。彼らは機械的なトラックを使用してドアを開閉します。一方、ガレージドアコントローラーは、スマートデバイスのアプリを使用してオープナーを制御できる小さな電子ユニットです。 </p> <p> これら2つの製品の2つ目の違いは、価格です。ガレージドア開閉装置の費用は約300ドルです。これらのオープナーのインストールには、通常、専門のインストーラーの助けが必要です。 </p> <p> ただし、コントローラーは通常、専門家によるインストールは必要ありません。代わりに、コントローラーは既存のオープナーへのアドオンとして機能します。 </p> <p> これは、新しいオープナーの数分の1の価格で、コントローラーを使用するだけで同じ機能を実現できることを意味します。 </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> スマートガレージドアの利点は何ですか？ </h2> <p> スマートガレージドアを持つことの3つの主な利点があります。 </p> <ul> <li> <strong> 安全性 </strong> —スマートなガレージドアを使用すると、ほとんどどこからでもドアを開閉できます。 </li> <li> <strong> セキュリティ </strong> -ほとんどのスマートガレージドアオープナーとコントローラーは、ガレージが特定の時間開いているときに警告を発します。 </li> <li> <strong> 利便性 </strong> —ガレージのドアを閉めるために家に帰らなければならなかった場合は、スマートなガレージドアアプリを使用すると時間を節約できます。家に帰る代わりに、電話を抜くだけです。 </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> スマートガレージドアコントローラーをインストールする方法 </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> スマートガレージドアコントローラーがあなたに適していると判断した場合は、このガイドでインストール方法を説明します。このデモンストレーションでは、 <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> メロスMSG100 </a> が使用されますが、別のブランドを使用する場合、このプロセスは同様です。詳細については、コントローラーのドキュメントを参照してください。 </p> <h3 id=\"what-you-ll-need\"> 必要なもの </h3> <ul> <li> スマートガレージコントローラー </li> <li> ステープルガンまたはワイヤーマウント </li> <li> オートオープナーが取り付けられたガレージドア </li> <li> フィリップスとマイナスドライバー </li> <li> はしご </li> </ul> <h3 id=\"plan-the-installation\"> 1.インストールを計画します </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> コントローラをインストールする前に、ガレージのいくつかの場所を偵察する必要があります。 1つ目はコントローラーの電源です。 2つ目は、コントローラーからキットに含まれているドアに取り付けられたセンサーまでの配線経路です。そして3番目は磁気センサーの位置です。 </p> <p> この磁気センサーにより、コントローラーはドアがいつ開閉したかを知ることができます。 </p> <p> ほとんどのコントローラーは、ドアセンサーに接続するために長いワイヤーを使用します。ワイヤーが邪魔にならないように、このワイヤーを天井を越えて、または壁を下って配線する必要があります。 </p> <p> インストールの計画を立てたら、コントローラーからセンサーの位置にセンサーワイヤーをテストフィットします。このテストフィットにより、センサーワイヤーがコントローラーに到達することが保証されます。 </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2.ガレージドアオープナーの電源を切ります </h3> <p> ほとんどのガレージドアは、天井のどこかで電源に接続されています。これらのオープナーについては、先に進む前に、プラグが抜かれていることを確認する必要があります。 </p> <p> オープナーにプラグがなく、代わりに天井から出ている配線に接続されている場合は、ブレーカーボックスを見つけて、そこでオープナーの電源を切る必要があります。 </p> <p> <strong> 注意： </strong> 120ボルトの家庭電流は重傷を引き起こす可能性があります。電気の操作に不安がある場合は、今すぐ停止して、専門のガレージドア設置業者や電気技師に相談してください。 </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3.付属のワイヤーをコントローラーに接続します </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> メロスユニットには、ガレージドアオープナーに接続するためにコントローラーに取り付ける必要のある青と茶色のワイヤーのセットがあります。コントローラのプラスチックカバーを開くと、2つのネジ留め式端子が見えるはずです。 </p> <p> 小さなマイナスドライバーを使用して、各端子のネジを緩めます。ワイヤーを挿入し、ネジを締めます。どのワイヤーがどこに行くかは問題ではありません。 </p> <p> ワイヤーを軽く引っ張って、しっかりと固定されていることを確認します。次に、コントローラーのカバーを元に戻します。 </p> <h3 id=\"mount-the-garage-door-controller\"> 4.ガレージドアコントローラーを取り付けます </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> 場所を計画したので、今がコントローラーをマウントするときです。コントローラが、配線にストレスをかけずに必要な電源にアクセスできる場所にあることを確認してください。 </p> <p> 次に、コントローラーの粘着性のあるバッキングを取り外し、所定の位置に押し込みます。ネジマウント付きのコントローラーがある場合は、ドライバーを使用してコントローラーを所定の位置に固定します。 </p> <h3 id=\"mount-the-sensor\"> 5.センサーを取り付けます </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> 次に、ドアのセンサーを取り付ける必要があります。このセンサーは、ドアの進路を妨げない場所に配置することをお勧めします。 </p> <p> また、センサーを地面の近くに取り付けたくなるかもしれません。センサーに直接水が繰り返し飛散すると、センサーが損傷する可能性があるため、これはお勧めしません。センサーを配置したら、付属の両面テープまたはネジを使用してセンサーを固定します。 </p> <p> 上の写真では、黒いセンサーがガレージドアの横に取り付けられており、磁石部分がドア自体に取り付けられています。このセンサーは、取り付けに両面テープを使用しています。 </p> <h3 id=\"connect-the-sensor-wires\"> 6.センサーワイヤーを接続します </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> 次に、ワイヤーをセンサーとコントローラーに接続します。最初のステップで作成した計画を使用して、ワイヤーを配線し、ステープルガンを使用してワイヤーを壁または天井に固定します。 </p> <p> ワイヤーを挟んだりねじったりしないでください。ワイヤーが損傷する可能性があります。配線したら、コントローラーの赤いメスのバットコネクターをセンサーワイヤーの端にある赤いオスのバットコネクターに接続します。 </p> <p> 次に、ガレージドアオープナーのカバーを開ける必要があります。 4本のワイヤーがあり、2本は電源を制御し、ユニットに共通であり、2本は壁のボタンを制御する必要があります。 </p> <p> </p> <p> 通常、これらのワイヤーは天井から出ており、ガレージドアオープナーユニットに固定する圧着スペード端子が必要です。どのワイヤーがどれであるかがわからない場合は、停止してガレージドアオープナーのオーナーズマニュアルを参照するか、認定された電気技師に相談してください。 </p> <p> ワイヤーを見つけたら、コントローラーからの茶色と青のワイヤーを、壁のボタンに接続されているオープナーの端子に接続します。上の写真では、コントローラーのワイヤーが左端の2つの端子に挿入されています。 </p> <p> 終了したら、各壁ボタン端子に2本のワイヤーが接続されているはずです。ガレージドアオープナーのカバーを再度固定し、コントローラーとオープナーを差し込むと、取り付けが完了します。 </p> <p> 次のステップでは、コントローラーをワイヤレスネットワークに接続します。 </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7.コントローラーをWi-Fiに接続します </h3> <p> <strong class=\"gallery__section-title\"> 画像ギャラリー（3画像） </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> 展開 <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> 展開 <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> 展開 </p> <p> 閉じる </p> <p> Wi-Fi接続を設定するために、Merossアプリを使用しました。それはのために利用可能です <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> そして <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> アンドロイド </a> 。このプロセスは、ほとんどの場合、アプリを開き、製品を識別し、アプリをWi-Fiに接続し、[設定]画面を開き、コントローラーがネットワークにアクセスできるようにすることで構成されます。 </p> <p> ここで、アプリを開き、タップします <strong> スマートガレージドアオープナー </strong> その後 <strong> 開始 </strong> 。コントローラーで使用しているガレージドアオープナーのメーカーとモデルを選択します。アプリに固有の手順に必ず従ってください。 </p> <h3 id=\"set-the-open-close-timing-interval\"> 8.開閉のタイミング間隔を設定します </h3> <p> <strong class=\"gallery__section-title\"> 画像ギャラリー（3画像） </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> 展開 <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> 展開 <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> 展開 </p> <p> 閉じる </p> <p> 新しいコントローラーをテストする前に設定することが重要なことの1つは、ガレージドアオープナーのタイミングです。 Merossアプリでは、5秒間隔で10秒から40秒の間で選択するか、偶数秒で閉じるドアのカスタム設定を追加できます。 </p> <p> ドアのタイミングを設定するのは簡単ですが、正しく設定する必要があります。間隔が短すぎるとドアが部分的に開いたままになり、設定が長すぎるとガレージドアオープナーのモーターに過度のストレスがかかる可能性があります。 </p> <p> 間隔を設定するには、秒針付きの時計またはストップウォッチ機能が必要です。また、携帯電話の内蔵タイマーを使用することもできます。タイマーの準備をして、ガレージドア開閉装置のボタンの近くに立ってください。次に、ストップウォッチのスタートを押すと同時にボタンを押すか、秒針で時刻をメモします。 </p> <p> ガレージのドアが動かなくなるまで待って、時間を記録します。これはあなたの間隔です。その情報をアプリに転送すると、間隔の設定が完了します。 </p> <h3 id=\"test-the-garage-door-controller\"> 9.ガレージドアコントローラーをテストします </h3> <p> アプリを使用して、ドアを数回開閉して、すべてが機能していることを確認します。これで、壁のボタンまたはアプリを使用してガレージのドアを開くことができるようになります。 </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> スマートガレージドアコントローラーをお楽しみください </h2> <p> スマートホームテクノロジーをガレージのドアに持ち込むのに大金を費やす必要はありません。 </p> <p> 新しいスマートガレージドアコントローラーをインストールすると、あなたとあなたの家族はあなたの家にもっと柔軟性、安全性、セキュリティ、そして便利さを提供します。また、ガレージのドアをほぼどこからでも制御できるという安心感も得られます。 </p>"}