{"title":"LastPassは、支払いがない限り、1つのデバイスタイプに制限します","content":"<p> 人気のパスワードマネージャーであるLastPassは大きな変化を遂げています。間もなく、無料でサービスを利用する人は、有料でない限り、コンピューターまたは携帯電話でのみ利用できるようになり、両方では利用できなくなります。 </p> <p> これは、LastPassが無料のパスワードマネージャーとして魅力的な選択肢ではなくなったことを意味します。私たちが常にコンピューターとモバイルを切り替える世界では、1つのデバイスタイプでのみ機能するパスワードマネージャーを持つことは無意味です。 </p> <h2 id=\"what-s-changing-in-lastpass-free\"> LastPass Freeの何が変わったのですか？ </h2> <p> で発表されたように <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> LastPassブログ </a> 、パスワードマネージャーの無料バージョンの変更が進行中です。 </p> <p> 現在、LastPass Freeでは、すべてのデバイスでサービスを使用できます。コンピューター、タブレット、モバイルのいずれでLastPassを使用する場合でも、問題はありません。それはすべて無料です。これは2021年3月16日の変更によるものです。 </p> <p> それ以降、LastPass Freeには、コンピューターまたはモバイルという1つのタイプの無制限のデバイスのみが含まれます。 </p> <p> LastPassの場合、コンピューターはデスクトップまたはラップトップとして分類されますが、モバイルは携帯電話、タブレット、およびスマートウォッチです。 </p> <p> 3月16日にLastPassに初めてログインするときは、アクティブなデバイスタイプを設定する必要があります。 </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> たとえば、デバイスタイプとしてコンピューターを選択した場合、デスクトップデバイスとラップトップデバイスでLastPassを使用できるようになります。ただし、モバイルデバイスでLastPassを使用する場合は、LastPassプレミアムにアップグレードする必要があります。 </p> <p> ある意味で、これは古いLastPassに戻っています。デスクトップとモバイルでLastPassを無料で使用できるようになったのは、2015年だけでした。それ以前は、モバイルサポートの料金を支払う必要がありました。 </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> LastPassのサポートも変更されています </h2> <p> LastPassはサポートの提供方法も変えています。 2021年5月17日以降、メールサポートはプレミアムおよびファミリーのお客様のみが利用できるようになります。 </p> <p> 無料のユーザーは、LastPassサポートWebサイトで利用できるヘルプ記事にとらわれるか、LastPassコミュニティ内でヘルプを求めることができます。 </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> 誰もがパスワードマネージャーを使用する必要があります </a> 。おそらく、デスクトップとモバイルで使用する必要があります。 LastPassはこれを知っており、有料サービスにアップグレードするユーザーを利用しています。有料サービスは現在、年間27ドルで25％オフです。 </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> パスワードマネージャーを変更する時が来ましたか？ </h2> <p> LastPass Freeを使用している場合は、切り替えを検討している可能性があります。もしそうなら、あなたが無料であなたのすべてのデバイスで使うことができるそこに他の多くの素晴らしいパスワードマネージャーがあります。 </p> <p> 繰り返しになりますが、LastPassが提供するサービスをサポートするために、LastPassに少額を支払うのは公平だと思うかもしれません。 </p>"}