{"title":"MicrosoftのEdgeブラウザは秘密の任天堂ゲームエミュレータのホストでした","content":"<p> Microsoftは、MicrosoftEdgeブラウザ拡張機能ストアに隠れている一連の違法なゲームエミュレータを削除しました。 Microsoft Edge拡張機能ストアは数十のエミュレーターのホストであり、ユーザーはいくつかの象徴的なゲームをプレイできましたが、いずれも合法的にストアに投稿されていませんでした。 </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> マイクロソフトは違法なエッジ拡張エミュレーターを削除します </h2> <p> Microsoft Edge拡張機能ストアには、マリオカート64、スーパーマリオブラザーズ、パックマン、テトリス、ソニックザヘッジホッグ2、さらにはマインクラフトなど、これまでで最も象徴的なゲームが潜んでいました。各ゲームはブラウザ内のエミュレータウィンドウで起動され、ユーザーは各タイトルを完全にプレイできました。 </p> <p> ただし、任天堂、セガ、アタリ、そしてはい、マイクロソフトなどの公式ゲーム開発者をリストした古典的なタイトルはありませんでした。リストされている開発者の名前には、Gamelands、Kday、StayRealが含まれています。これらはすべて完全に架空のものであり、元の開発者へのリンクはありません。 </p> <p> 不思議なことに、公式のMicrosoft Edge DevelopmentTwitterアカウントは <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> 、エミュレーターについて投稿され、ブラウザー拡張機能ストアで入手可能なゲームを宣伝しているように見えます。エミュレーターを宣伝する元のツイートは見つかりませんでしたが、コピーは次のURLから入手できます。 <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> リセッテラ </a> 。 </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> エミュレーターは違法ですか？ </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> エミュレータを使用すると、さまざまなソフトウェアを実行できます </a> お使いのコンピュータで。エミュレーターを使用して古いゲームをプレイすることもできます。 </p> <p> エミュレータ自体は違法ではありませんが、エミュレータで再生するために著作権コンテンツをダウンロードすることは違法です。エミュレーターがユーザーがプレイできるようにゲームROMの新しいコピーをダウンロードしたため、公式のMicrosoft EdgeDevelopmentアカウントからのツイートは奇妙な動きでした。 </p> <p> アバンダンウェアのトピックもやや灰色の領域です。アバンダンウェアゲームは公開されなくなり、オンラインまたはストアでの販売もできなくなります。ただし、多くの場合、これらのゲームの著作権は失効していませんが、著作権所有者は積極的にその権利を行使していません。 </p> <p> </p> <p> 多くの場合、アバンダンウェアは違法です。それでも、アバンダンウェアに関連する訴訟はなく、少なくとも、アバンダンウェアのタイトルをダウンロードしたとして誰かを起訴する古いゲーム開発者に関連する訴訟はありません。 </p> <p> この正確な例では、Webブラウザ内でのこれらの古いゲームのエミュレーションは違法です。また、任天堂は、知的財産を複製または再配布しようとするサイトやサービスを削除することで有名です。 </p> <p> 現在、ゲームはMicrosoftEdge拡張機能ストアから削除されています。さらに、エミュレートされたゲームがどのようにして拡張ストアに置かれたのか、誰がそこに置いたのかはまだわかっていません。言うまでもなく、彼らは戻ってくる可能性は低いです。 </p>"}