{"title":"新しい調査によると、AndroidユーザーはiPhoneユーザーよりも優れたパートナーを作る","content":"<p> iPhoneとAndroidのスマートフォンユーザーの間で激怒する果てしない戦いがあります。バトルに参加していない人でも、スマホを選ぶだけでサイドを選ぶ。 </p> <p> 戦いには新しいしわがあります。 <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> CompareMyMobile </a> iPhoneまたはAndroidユーザーがより良い関係パートナーを作るかどうかに関する最近の研究を行いました。結局のところ、iPhoneユーザーはAndroidユーザーよりも迷惑な電話の習慣を持っている傾向があり、Androidユーザーはより良いパートナーになるという結論に至ります。 </p> <p> もちろん、データにはその単純な結論以上のものがあるので、もう少し深く掘り下げて見てみましょう。 </p> <h2 id=\"iphone-and-android-relationship-study\"> iPhoneとAndroidの関係調査 </h2> <p> この調査の全体的な結論は、AndroidユーザーはiPhoneユーザーよりも優れたパートナーになるというものですが、結果はその表面的な結論よりもはるかに深くなります。合計で、この調査は2,000人を超えるユーザーを調査したため、かなり大きなサンプルサイズを提供します。 </p> <p> 最も厄介なスマートフォンの習慣を調べたところ、iPhoneユーザーはAndroidを所有しているユーザーよりも12％多く犯罪を犯していることがわかりました。実際、iPhoneユーザーは、調査のすべてのカテゴリでAndroidユーザーよりも多くの電話使用の残虐行為を犯しました。 </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> 迷惑な犯罪の例としては、パートナーを読んだままにしておく、映画の最中に携帯電話を使用する、運転中に携帯電話を使用するなどがあります（これは迷惑なだけでなく、非常に危険です）。 iPhoneユーザーはAndroidユーザーよりも携帯電話を落としたり壊したりする可能性がさらに高く、これは本当に驚くべき統計です。 </p> <p> 他のいくつかの迷惑な習慣が含まれます <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> 他の人のソーシャルメディアプロファイルに忍び寄る </a> 、写真に過度のフィルターを使用し、複数の1行メッセージを送信し（私はこの方法をやりすぎていることを知っています）、会話中に電話を使用します。 </p> <p> 興味深いことに、この研究では、男性は女性よりも迷惑な（場合によってはまったく安全でない）習慣のほとんどを実行する可能性が高いこともわかりました。 </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> しかし、Appleユーザーはより多くの日付を取得します </h2> <p> CompareMyMobileが公開した別の調査によると、iPhoneユーザーはオンラインの出会い系アプリで日付を取得する可能性が高くなります。 50,000回以上のスワイプを調査したこの調査によると、iPhoneユーザーは、出会い系アプリで話しているときに、Android携帯を持っている人よりも76％多くデートをする可能性があります。 </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> 最初の調査を信じる場合、iPhoneユーザーが運転中に他のソーシャルメディアプロファイルやテキストメッセージに忍び寄るため、関係がうまくいかない可能性があります。それでも、前の関係がうまくいかないとき、彼らは次のパートナーを見つける可能性が高くなります。 </p> <p> 結局、デートは決して簡単ではありません。だから、あなたの電話が良いものを殺すデバイスにならないように最善を尽くしてください！ </p>"}