{"title":"パーラーは1か月の長いシャットダウンの後にオンラインに戻ります","content":"<p> ビッグテックによって締め出された後、パーラーはついにウェブ上に再登場しました。 「言論の自由」プラットフォームは現在、既存のユーザーがアクセスでき、数週間以内に新しいユーザー登録の受け入れを開始します。 </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> ビッグテックの停電後にパーラーが再登場 </h2> <p> パーラーは、長い停電の後にカムバックしました。代替のソーシャルネットワークは、政治的保守派の間で勢いを増してきており、 <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> アマゾンウェブサービス（AWS）、グーグル、アップルが起動 </a> 国会議事堂の暴動に続いて。パーラーは、暴力的なコンテンツを緩和するのに十分なことをしていないと非難され、その結果、アプリストアとウェブから削除されました。 </p> <p> AWSの代わりに、ParlerはSkySilkと呼ばれるホストを使用しています。このサイトはまた、Gabのような他の種類の「言論の自由」ネットワークに対応するレジストラであるEpikにドメイン名を登録しました。 </p> <p> Parlerが行った変更は、新しいホストとドメインレジストラだけではありません。Parlerは、新しい暫定CEOと再会しました。これは後に来る <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> パーラーチームは共同創設者のジョン・メイツを解雇したとされています </a> 。 </p> <p> マークメックラーは一時的にマツェに代わってCEOを務め、以前は右翼のティーパーティーパトリオッツグループを共同設立しました。によって得られた声明で <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> ヒル </a> 、メックラーはパーラーの待望の復帰を発表し、次のように述べています。 </p> <blockquote> <p> 1月に数千万人のアメリカ人を沈黙させたいと願う人々によってパーラーがオフラインになったとき、私たちのチームは集まり、これまで以上に強く戻るという私たちの非常に熱心なコミュニティへの約束を守ることを決意しました。皆様のお越しを心よりお待ちしております。 </p> </blockquote> <p> メックラーは続けて、パーラーは「言論の自由、プライバシー、市民の対話」に専念し続けると述べた。彼はまた、「パーラーは経験豊富なチームによって運営されており、ここにとどまる」とユーザーを安心させました。 </p> <p> プラットフォーム上の古いアカウントはバックアップされていますが、古い投稿（または「パレー」）は復元されていません。すでにParlerにアカウントをお持ちの場合は、引き続きサイトをご利用いただけます。それ以外の場合は、サインアップできるようになるまで約1週間待つ必要があります。 </p> <p> ただし、すでにParlerアカウントをお持ちの場合でも、プラットフォームの使用中に技術的な問題が発生する可能性があります。サービスがまだ完全に復元されていないように見えます。 </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> ParlerアプリはまだLimboに残っています </h2> <p> パーラーは依然としてGooglePlayストアとAppleApp Storeから禁止されており、ユーザーベースに深刻な損害を与える可能性があります。現状では、プラットフォームは不明な期間、モバイルデバイスで利用できないままになる可能性があります。 </p> <p> モデレートポリシーを変更しない限り、PlayストアまたはApp Storeに戻ることはできません。これは、Parlerが拒否する可能性が高いことです。 </p>"}