{"title":"スマートヘルスカードとデジタル予防接種パスポート：大きな違いは何ですか？","content":"<p> COVID-19のパンデミックは、ヘルスケアシステムを巻き起こしました。現在、政府と企業が同様に正常に戻ろうとするにつれて、デジタルヘルスパスポートとスマートヘルスカードの見通しが高まっています。 </p> <p> では、スマートヘルスカードとは何ですか？それはヘルスパスポートと同じですか？ </p> <h2 id=\"what-is-a-smart-health-card\"> スマートヘルスカードとは何ですか？ </h2> <p> スマートヘルスカードは、暗号化されたデータを含む集積回路チップが埋め込まれた薄いプラスチックです。 </p> <p> それを賢くするのは、スーパーコンピューターとして機能するチップです。チップは、多数のアプリケーションでさまざまなアクションを実行するようにプログラムできますが、コンピュータシステムに接続されているリーダーは、チップのデータにアクセスまたは更新できます。 </p> <p> クレジットカードのように見えるかもしれませんが、機能が異なります。スマートヘルスカードは、ヨーロッパや世界中の多くの国で使用されており、医療情報、保険の適用範囲、その他の重要な医療データを保存しています。 </p> <p> </p> <h2 id=\"advantages-of-using-a-smart-health-card\"> スマートヘルスカードを使用する利点 </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> フランスの医療：「CarteVitale」とは何ですか？ <a href=\"https://t.co/5VVcTjZyxh\"> https://t.co/5VVcTjZyxh </a> <a href=\"https://t.co/6I0TCy70wg\"> pic.twitter.com/6I0TCy70wg </a></p> —FrenchEntrée（@FrenchEntree） <a href=\"https://twitter.com/FrenchEntree/status/738646709308379136?ref_src=twsrc%5Etfw\"> 2016年6月3日 </a></blockquote>  <p> このシステムを使用する他の多くの利点の中で、最も重要なのは、クリティカルケアまたは緊急ケアを改善することです。スマートヘルスカードを使用すると、緊急時に患者の健康データや医療記録にすぐにアクセスできます。 </p> <p> たとえば、ポータブルカードリーダーを備えた緊急対応要員は、病院に向かう途中の救急車にいる間、患者に関する情報を即座に入手できます。これは、患者が意識を失っている、反応がない、または単に応答者に自分の医療情報を伝えることができない場合に、さらに重要になります。 </p> <p> 救急車が到着する前に、重要な患者データを緊急治療室のスタッフに転送できるレスポンダーを想像してみてください。 ERスタッフは、到着前でも患者の治療に必要なものを準備するのに役立ちます。 </p> <p> クリティカルケア中の高速で効率的な患者データ転送は、応答時間を大幅に改善し、それによって人命を救うことができます。 </p> <h3 id=\"seamless-transfer-of-data\"> データのシームレスな転送 </h3> <p> このシステムを使用すると、救急治療室のスタッフから入院患者の医療提供者への患者情報のより正確で流動的な転送も提供されます。 </p> <p> 医師は患者の記憶に頼る必要はありません <a href=\"https://www.makeuseof.com/tag/google-store-medical-data-cloud/\" target=\"_blank\" rel=\"nofollow noopener\"> 重要な医療データを取得する </a> 、エラーの可能性を減らします。これとは別に、スマートヘルスカードシステムは、医師間で患者情報をシームレスに交換します。 </p> <p> これにより、重要な患者データが漏洩する可能性が低くなります（ <a href=\"https://www.makeuseof.com/tag/the-10-pieces-of-information-identity-thieves-are-looking-for/\" target=\"_blank\" rel=\"nofollow noopener\"> 個人情報の盗難 </a> ）。これは、患者情報がファックス、電話、または電子メールで共有されている場合によく発生します。 </p> <h3 id=\"easier-storage-and-retrieval-of-medical-records\"> 医療記録のより簡単な保管と検索 </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"it\" dir=\"ltr\"> Tessera sanitaria：richiederne unduplicatoに来てください <a href=\"https://t.co/2GrFWpanC2\"> https://t.co/2GrFWpanC2 </a> <a href=\"https://t.co/JKR6ampnXq\"> pic.twitter.com/JKR6ampnXq </a></p> — CataniaToday（@CataniaToday） <a href=\"https://twitter.com/CataniaToday/status/1359189830937300995?ref_src=twsrc%5Etfw\"> 2021年2月9日 </a></blockquote>  <p> このシステムは、患者に、臨床検査結果や医師のメモを運ぶための便利で手間のかからない方法を提供します。 </p> <p> これは、患者の財布にある小さなカードに、医療情報（以前の検査、治療、保険の適用範囲のファイル）のデータベースがあるようなものです。医者の予約のために紙片を持ち歩く必要はもうありません。 </p> <h3 id=\"reduces-medical-errors-and-duplicate-testing\"> 医療過誤と重複テストを削減します </h3> <p> 国の医療システムは、医療過誤や重複検査を回避できるため、これからも恩恵を受けることができます。このシステムにより、不適切なデータ入力、言語の壁、または誤解に伴う医療過誤を最小限に抑えることができます。 </p> <p> ヒューマンエラーは、患者と記録の不一致を引き起こす場合があります。スマートヘルスカードを持っていると、医療提供者は患者を正しい健康記録と簡単に照合できます。これにより、レコードが重複したり、複数の冗長テストが発生したりする可能性が低くなり、多額の費用がかかる可能性があります。それは医療システムの不必要な費用を節約することができます。 </p> <h3 id=\"more-accurate-verification-of-insurance-coverage\"> 保険適用範囲のより正確な検証 </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> 街の休憩？出張？休日？安心のために、常に欧州健康保険カードを携帯してください！ <a href=\"https://t.co/31zoREZAEy\"> https://t.co/31zoREZAEy </a> <a href=\"https://twitter.com/hashtag/EHIC?src=hash&ref_src=twsrc%5Etfw\"> #EHIC </a> <a href=\"https://t.co/o05Jx8aIwq\"> pic.twitter.com/o05Jx8aIwq </a></p> —欧州委員会🇪🇺（@EU_Commission） <a href=\"https://twitter.com/EU_Commission/status/893485278114992128?ref_src=twsrc%5Etfw\"> 2017年8月4日 </a></blockquote>  <p> 近年、個人情報の盗難が深刻な問題となっています。この犯罪には、医療サービスにアクセスしたり、払い戻しを受けるために健康保険情報を不正に使用することが含まれます。簡単に言えば、保険の対象外の人は、他人の健康保険情報を盗んで給付を受けることができます。 </p> <p> ヘルスケアまたは健康保険システムの違反は、ハッカーがダークウェブで販売できる機密の個人情報（PII）を漏らすことがよくあります。 PIIには、健康保険情報を含めることができます。 </p> <p> これは、泥棒がアクセスしてはならない医療サービスにアクセスするために使用するものです。彼らは処方薬を購入したり、実行されたことのない手順について不正な保険金請求を提出したりすることができます。 </p> <p> スマートヘルスカードシステムは、ほとんどが認証およびセキュリティプロトコルを使用するため、これらすべてを防ぐことができます。 2要素認証（2FA）または多要素認証（MFA）を使用できるものもあれば、患者の指紋をチェックして身元を確認する生体認証機能を備えているものもあります。 </p> <p> </p> <h2 id=\"disadvantages-of-using-a-smart-health-card-system\"> スマートヘルスカードシステムを使用することのデメリット </h2> <p> プライバシーの問題は、ユーザーが医療目的でテクノロジーを採用することを思いとどまらせる最大の懸念事項です。多くの人が、治療、病気の記録、投薬などの多数の機密データに簡単にアクセスできるようにすることについて懸念を表明しています。また、医療や保険システムがデータ侵害の被害者になっているというニュースがあり、これらの懸念は完全に根拠のないものではありません。 </p> <p> すべてのレコードを1つの場所に置くと便利ですが、1つ <a href=\"https://www.makeuseof.com/tag/healthcare-new-attack-vector-scammers-id-thieves/\" target=\"_blank\" rel=\"nofollow noopener\"> データ侵害 </a> 機密性の高いデータが悪意のある人の手に渡る可能性があります。 </p> <h3 id=\"creating-digital-divide\"> デジタルデバイドの作成 </h3> <p> 次に、デジタルデバイドの作成の問題があります。スマートヘルスカードは、システムにアクセスできる病院やコミュニティでのみ使用できると多くの人が主張しています。このテクノロジーを利用するには、病院のマシンが同じソフトウェア、スマートカードリーダーインターフェイスをサポートし、必要なハードウェアをサポートできる必要があります。 </p> <p> ハードウェアと言えば、追加コストの問題もあります。システムのハードウェア、リーダーのソフトウェア、およびデータベースを備えたネットワークは、数百万ドルの費用がかかり、維持にさらに多くの費用がかかる可能性があります。プラスチックカード自体でさえ、製造するのにお金がかかります。 </p> <p> 誰が初期投資を行うのですか？さらに、この初期投資が政府とその市民に利益をもたらすまでにどれくらいの時間がかかりますか？ </p> <h3 id=\"bugs-and-power-failures\"> バグと停電 </h3> <p> もちろん、この種のテクノロジーは、データ漏洩を引き起こす可能性のあるバグやグリッチ、サイバー攻撃の影響を受けません。システム内のパッチが適用されていない単一のデバイスは、ネットワークとデータベースに損傷を与える可能性のあるマルウェアのゲートウェイになる可能性があります。 </p> <p> 停電も懸念されます。電力または電力インフラの問題が限られているコミュニティで、これをどのように維持できますか？最も洗練された電力システムでさえ、大規模な災害で故障する可能性があります。災害時に医療データにアクセスできないことを想像してみてください。 </p> <p> </p> <h2 id=\"smart-healthcare-vs-digital-vaccination-passport\"> スマートヘルスケア対。デジタル予防接種パスポート </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> メイヨークリニック、シグナのエバーノース、マイクロソフトなど、テクノロジーとヘルスケアの大手企業が協力して、デジタルCOVID-19ワクチン接種パスポートを作成しています。 <a href=\"https://t.co/KgTVjq9lUe\"> https://t.co/KgTVjq9lUe </a> <a href=\"https://t.co/ZiJIE8xoTY\"> pic.twitter.com/ZiJIE8xoTY </a></p> —マストヘルス（@MastAnalytics） <a href=\"https://twitter.com/MastAnalytics/status/1351683116990164993?ref_src=twsrc%5Etfw\"> 2021年1月20日 </a></blockquote>  <p> Covid後の旅行やコンサートや集会へのアクセスのためのデジタル予防接種パスポートの話がありました。デジタルヘルスパスポートは、ドイツ、フランス、オーストリアなどの国で使用されているスマートヘルスカードに似ているように見えるかもしれませんが、重要な違いがあります。 </p> <p> </p> <p> まず、デジタルCOVID-19ワクチンパスポートは、個人の電話にダウンロードされたデジタル証明書の形式で提供されます。デジタル証明書またはCovidワクチンパスポートは、患者の名前とCovidワクチンの詳細（投与日、ワクチンメーカー、ワクチン接種場所）が記載されたパスです。これは、エントリポイントでスキャンできるバーコードまたはQRコードを含む1ページのデジタルドキュメントです。 </p> <p> スマートヘルスカードとは異なり、デジタルヘルスパスポートは物理的なプラスチックカードを意図したものではありません。 </p> <p> 個人のCOVID-19検査、予防接種記録、およびそれらの予防接種と検査が実施された医療施設に関連する情報のみが含まれます。患者の病歴全体が含まれるわけではありません。 </p> <p> これらのデジタルヘルスパスポートは、コンサートや職場などの集まりにアクセスして、多くの人と接触したり、旅行が正常に感じられたら国に入ることができるようにします。スマートフォンを持っていない人は、入力時にスキャンしたコードを印刷できます。 </p> <h3 id=\"breach-of-privacy-and-curtailment-of-human-rights\"> プライバシーの侵害と人権の削減 </h3> <p> 多くの人がジャブを手に入れ、デジタル予防接種パスポートをダウンロードして通常に戻ることを熱望していますが、このテクノロジーの導入による影響の可能性について警鐘を鳴らしている人もいます。専門家と人権擁護者は、予防接種パスポートがもたらす可能性のある潜在的なデータプライバシーと人権問題に対処するよう開発者に警告しています。 </p> <p> によって公開された研究 <a href=\"https://socialsciences.exeter.ac.uk/media/universityofexeter/collegeofsocialsciencesandinternationalstudies/lawimages/research/Policy_brief_-_Digital_Health_Passports_COVID-19_-_Beduschi.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> エクセター大学ロースクール </a> このパスポートがプライバシーの権利、移動の自由、平和的な集会などの基本的人権をどのように削減できるかを警告します。 </p> <p> レポートによると、問題はパスポートが機密性の高い個人の健康情報を使用していること（これはどのように保存され、誰がアクセスできるのか）と、健康状態に基づいて人々の間に新たな隔たりを生み出す方法に起因します。 </p> <p> パスポートは、人が権利と自由を享受する程度を決定または制限する可能性もあります。専門家は、デジタル健康パスポートの使用は、ワクチンまたは健康パスポートにすぐにアクセスできるコミュニティとそうでないコミュニティとの間の不平等を深める可能性があると警告しています。 </p> <p> </p> <h2 id=\"future-of-healthcare\"> ヘルスケアの未来 </h2> <p> フランスのような国では90年代からスマートヘルスカードが使用されており、他の国では2000年代初頭に続いています。 </p> <p> このテクノロジーの採用は、米国のような国ではかなり遅く、プライバシーの問題が主な懸念事項であると述べています。このシステムを採用することには多くの利点がありますが、慎重に検討する必要があるいくつかの欠点もあります。 </p>"}