{"title":"米国政府は、アプリのプライバシーラベルの正確性について知りたがっています","content":"<p> Appleは、AppStoreにiOS14 App Privacyラベルを付けて、ユーザーが使用するアプリと、それらのアプリがそれらを追跡する方法についてより多くの知識を持つことで、ユーザーに力を与える新しい方法を提供しています。 </p> <p> しかし、Appleは現在、開発者が12月にAppleに提出し始めたこれらのラベルの正確さを保証するように迫られているため、ワームの缶が開かれる可能性もあるようです。 </p> <h2 id=\"concerns-over-accuracy\"> 精度に関する懸念 </h2> <p> によって指摘されたように <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumors </a> 、Appleは <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> 文字 </a> 米国下院エネルギー・商業委員会から、アプリのプライバシーラベルのデベロッパー提供の正確性に関する情報を明確にするよう求めています。 </p> <p> これらのラベルは、iOS 14の一部の四半期で熱心に期待され、他の人では恐れられている機能であり、開発者はアプリがユーザーデータとどのように相互作用するかについてよりオープンになります。これは、特定のアプリを使用することのメリットとデメリットに関して、ユーザーがより多くの情報に基づいて決定できることを意味します。 </p> <p> </p> <p> その手紙の中で、米国下院エネルギー・商業委員会は、特定のアプリプライバシーラベルがユーザーに「誤解を招く誤った」情報を提供する可能性があることを示唆するレポートについてAppleに尋ねています。これは先月公開されたレポートに基づいており、クリーンな健康状態を与えられた多くのアプリは、彼らが示唆するほど無実ではないかもしれないと主張しています。 </p> <p> iOS 14機能の潜在的な問題は、データがどのように収集されるかを開発者が正直に言って、この情報が正確であることを確認することに依存していることです。 Apple自体は、情報が「Appleによって検証されていない」と述べています。 </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Appleからの応答の要求 </h2> <p> ほとんどの開発者は公平にプレーし、名誉システムを順守する可能性が高いようですが、それは当然のことと見なすことができるものではありません。 Appleは、送信された情報を定期的に監査します。ただし、App Storeには膨大な数のアプリがあるため、Appleがすべてのリストを個人的に確認することは不可能です。 </p> <p> 米国下院エネルギー・商業委員会の書簡は次のように続けています。 </p> <blockquote> <p> 「Appleは、アプリのプライバシーラベルの有効性を改善して、消費者にアプリのデータ慣行に関する有意義な情報を提供し、消費者がこれらの潜在的に欺瞞的な慣行によって害を受けないようにすることを強く求めます。」 </p> </blockquote> <p> 委員会はAppleに、監査プロセスの詳細、アプリのプライバシーラベルが正しくないことが判明した場合に修正されるかどうか、開発者が不正確な情報を提供した場合に何が起こるかなどの詳細を提供するように依頼しました。 </p> <p> 彼らはAppleに2月23日までに要求された情報で返答するように求めている。 </p> <p> <small> 画像クレジット：Jason Dent / <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> スプラッシュ解除CC </a></small> </p>"}