{"title":"ネットワークにおけるLANとWANの違いは何ですか？","content":"<p> コンピュータネットワークに夢中になっている場合は、「LAN」と「WAN」という用語に出くわす可能性があります。しかし、それぞれが何を意味し、LANとWANを比較した場合の違いは何ですか？ </p> <p> これらのテクノロジーの両方と、それぞれが優れている点を探りましょう。 </p> <h2 id=\"what-does-lan-stand-for\"> 「LAN」とは何の略ですか？ </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> 画像クレジット：Drug Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> LANは「ローカルエリアネットワーク」です。この用語は、接続されているすべてのデバイスが互いに近接しているネットワークを表します。それらはすべて「ローカルエリア」にあるため、その名前が付けられています。 </p> <p> コンピューターがLANに接続すると、ローカルインターネットプロトコル（IP）アドレスを取得します。これは、オンラインになったときに取得するIPアドレスと同様に機能します。ただし、ローカルIPアドレスは、同じLAN上の他のコンピューターでのみ機能します。たとえば、ローカルIPを使用してインターネット経由でPCに接続することはできません。 </p> <p> ホームLANの物理的な境界は、おそらく家を離れることはありません。もちろん、携帯電話やラップトップを庭に持ち出して新鮮な空気を取り入れても、LAN上にあります。ただし、ほとんどの場合、ネットワークに接続されたすべてのデバイスは、家の4つの壁の中に安全にあります。 </p> <p> 企業や機関もLANを作っています。たとえば、大学は、図書館内のすべてのPCをネットワークに接続して、すべてのPCが相互に通信できるようにする場合があります。また、LANを使用すると、従業員がオンラインに接続しなくてもファイルや通信を相互に送信できるため、企業はLANの使用を好みます。 </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> 「WAN」は何の略ですか？ </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> 画像クレジット：metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> 一方、ワイドエリアネットワーク（WAN）があります。この記事を読んでいる場合は、すでにWANに接続しています。これをインターネットと呼びます。 </p> <p> ワイドエリアネットワークの「ワイド」は非常に変動します。同じ都市の外部サーバーに接続する場合、それはWANです。地球の反対側の国のサーバーに接続する場合も、WANと見なされます。 </p> <p> そのため、WANは通常、ルーターを超えて存在する接続先のネットワークを表すために使用されます。サーバーが1マイル離れているか、大陸から離れているかは関係ありません。それはまだ「広い」です。 </p> <p> そこにあるWANはインターネットだけではありません。企業はWANをうまく利用して、さまざまな国にあるオフィスを接続しています。たとえば、企業がニューヨーク、東京、シドニーにオフィスを構えている場合、独自のWANシステムを採用して、相互に通信できるようにすることができます。 </p> <p> しかし、ちょっと待ってください。すべてをインターネットに接続するだけで、企業が独自のWANを作成するのはなぜですか。このソリューションの問題は、会社がISPの料金を支払わなければならず、何か問題が発生した場合、問題を解決するためにISPと格闘しなければならないことです。 </p> <p> それだけでなく、インターネットは世界中の多くのPCに接続することを中心に設計されています。企業が自社のPCを他のオフィスのPCにのみ接続したい場合は、独自のWANを使用してオンラインの脅威から身を守ることができます。これは「イントラネット」と呼ばれます。 </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> LANとWANをいつ使用するか </h2> <p> 所有している別のデバイスに接続する場合は、LANまたはWAN経由で接続することを選択できます。しかし、それぞれの長所と短所は何ですか、そしてどちらを使用する必要がありますか？ </p> <p> ルーターに接続する新しいワイヤレスハードドライブがあり、インターネットからの接続を許可するか（WAN）、ローカルのみに維持するか（LAN）を選択できるとします。どちらを選択するかは、ハードドライブに何を求めるかによって異なります。 </p> <p> ハードドライブにWAN機能を提供することは、利便性のために素晴らしいことです。これにより、インターネット上に配置されます。つまり、世界中のどこからでも接続できます。そのため、ファイルなしで立ち往生することは二度とありません。彼らはただインターネット接続になります。 </p> <p> ただし、WAN接続を使用すると、他のユーザーがデバイスにアクセスすることもできます。ハードドライブのセキュリティが完全ではない場合、ハッカーは同じルートを使用してすべてのデータを表示し、重要なものをコピーまたは削除できます。 </p> <p> 一方、ハードドライブをLAN専用モードにすると、ハッカーがとることができるいくつかの手段からハードドライブを保護します。それは不浸透性ではありません。たとえば、誰かがあなたのPCを使用してハードドライブにアクセスする可能性があります。ただし、ハードドライブをWANで毎日および夜間にブロードキャストするよりもはるかに安全です。 </p> <p> 本当に本当にセキュリティを強化したい場合は、ハードドライブにエアギャップを設けることができます。エアギャップとは、エアギャップとその上の同じネットワーク上のすべてのPCが、たとえばインターネットなどのWANに接続されていないことを意味します。 </p> <p> アン <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> エアギャップコンピュータはオンラインの脅威から完全に保護されているわけではありません </a> 、しかしそれは攻撃の可能性を劇的に減らします。ハッカーは、ソーシャルエンジニアリングの戦術を使用して、人間を操作してエアギャップデバイスを攻撃するように入札する必要があります。 </p> <p> そのため、デバイスをインターネットに配置するか、ホームLANにロックしておくかを選択するときは、実際にインターネット経由で接続するかどうかを検討する必要があります。そう思わない場合は、WAN機能をオフにして、ハッカーを寄せ付けないようにするのが最善です。 </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> インターネットに接続するとLANがWANに変わりますか？ </h2> <p> すべてのデバイスがルーターに接続されているLANが設定されているとします。あなたは退屈しているので、あなたはあなたのコンピュータに乗り、Netflixに向かいます。これで、PCがWAN（インターネット）に接続されました。 </p> <p> しかし、あなたのPCはWANに接続されているので、それはもはやLANの一部ではないということですか？幸い、デバイスは同時にLANとWANの両方の一部になることができます。 </p> <p> LANデバイスには独自のローカルIPアドレスがあると言ったことを覚えていますか？これは、インターネットIPアドレスも取得できないという意味ではありません。実際、ルーターに接続されたデバイスでこの記事を読んでいる場合は、両方が含まれています。 </p> <p> 自分で確認したい場合は、 <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> WindowsでIPアドレスを確認する方法 </a> 。モバイルを使用している場合でも、 <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> AndroidまたはiPhoneでIPアドレスを見つける </a> 。 </p> <p> 統計を取得すると、2つのIPアドレスが表示されます。最初のアドレスは「192.168」で始まります。これはローカルIPアドレスです。同じネットワーク上の別のデバイスから現在のデバイスに接続する場合は、これを使用します。 </p> <p> 2つ目は、IPv4とIPv6のどちらを使用しているかに応じて、2つの方法のいずれかになります。 v4を使用している場合は、ローカルIPアドレスのように見えますが、「192.168。」で始まりません。 IPv6の場合、コロンで8つのブロックに分割された文字と数字の混乱である必要があります。 </p> <p> いずれにせよ、そのアドレスはあなたのインターネットIPアドレスです。これは、インターネット上の別のサーバーに接続して通信できるようにするときに使用されます。たとえば、Netflixで視聴しているテレビ番組を送信します。 </p> <p> ある意味で、インターネットはLANの巨大なネットワークとして想像することができます。 Netflixを視聴すると、PC（パーソナルLAN上）がNetflixサーバー（独自のLAN上）からデータを取得しています。各LANは都市の家のようなものですが、インターネット接続はそれらすべてを接続する道路や通りのようなものです。 </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> LANとWANの混乱を解消する </h2> <p> LANとWANは連携して動作することがよくありますが、動作は異なります。これで、2つの違いと、それぞれをいつ使用するかがわかりました。 </p> <p> 同じネットワーク上の人々が互いに遊ぶことができるようにLANゲームを設定できることをご存知ですか？これは、インターネットゲームで時々発生する遅延の問題なしに、友達と時間を過ごすのに最適な方法です。 </p> <p> <small> 画像クレジット：metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}