{"title":"MTA-STSとは何ですか？それはどのようにあなたのEメールを保護しますか？","content":"<p> メールは、ほとんどのサイバー攻撃の背後にある最大の原因です。マルウェア、アドウェア、スパム、フィッシングへの簡単なアクセスポイントであり、攻撃者があなたの個人情報を入手するための無限の機会を提供します。 </p> <p> これらの脅威を軽減するには、個人用とビジネス用の両方の電子メールアカウントに対して厳格なセキュリティ対策を講じる必要があります。 </p> <h2 id=\"email-security-and-encryption\"> 電子メールのセキュリティと暗号化 </h2> <p> 他の通信モードの人気にもかかわらず、電子メールメッセージングは​​、個人または組織にとって転送中のデータの最大の形式です。メールの内容を保護することは非常に重要です。 </p> <p> 電子メールのセキュリティには、すべての受信および送信電子メールトラフィックの検査と暗号化が含まれます。暗号化は、安全なSMTP（Simple Mail Transfer Protocol）接続を確保することにより、電子メールコンテンツのプライバシーを損なわないようにする上で重要な役割を果たします。 </p> <p> 最近まで、暗号化はSMTPのオプション要件にすぎませんでした。 </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> 電子メール暗号化はどのように機能しますか？ </h2> <p> メールの暗号化は、メッセージコンテンツに暗号またはコードを追加して、解読できないようにするプロセスです。電子メールデータをコードに変換することにより、コンテンツは不正な露出から保護されます。簡単に言えば、あなたのメールはスクランブルされています。 </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> 追加のセキュリティとして、暗号化プロセスでは公開鍵と秘密鍵を利用し、暗号化された鍵を交換して、コード化された電子メールをロックおよびロック解除します。送信者は公開鍵暗号を使用して電子メールを暗号化し、その後、受信者は秘密鍵を使用して受信したメッセージを解読します。 </p> <p> 暗号化は、最初から最後まで、電子メールの全行程に適用されます。ベストプラクティスとして、機密情報を含むメールだけでなく、すべての受信メールと送信メールを暗号化する必要があります。これにより、攻撃者がシステムへのエントリポイントを取得するのを防ぎます。 </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> SMTPの背景と問題 </h2> <p> SMTPプロトコルが1982年に登場したとき、メールの暗号化は一般的な方法ではなく、デフォルトでは、メールはプレーンテキストで送受信されていました。トランスポートレベルでセキュリティを導入するために、1990年代後半にSTARTTLSコマンドが追加されました。このコマンドは、 <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> TLS（トランスポート層セキュリティ）プロトコル </a> 。 </p> <p> TLSのアップグレードが聞こえたのと同じくらい有望でしたが、2つのセキュリティの抜け穴がそのまま残っていました。 </p> <ol> <li> 暗号化オプションは次のとおりです。 <strong> オプション </strong> 。安全でないメールは依然として横行しており、サイバー攻撃が急増しました。 </li> <li> STARTTLSを設定しても、SMTPサーバーは証明書を検証しないため、送信者のサーバーのIDを認証する方法はありませんでした。 </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> MTA-STSの到着 </h2> <p> 2019年、Googleはついにプレートにステップアップし、新しいMTA-STS（メール転送エージェント/厳密なトランスポートセキュリティ）標準の採用を発表しました（ <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ）。 </p> <p> これにより、メールサービスプロバイダーはSMTP接続を保護するためにTLSを課すことができ、信頼できるサーバー証明書を使用してTLSを提供しないMXホストへのメール配信を拒否するオプションも提供されます。 </p> <p> MTA-STSは、通信するSMTPサーバー間で暗号化を実施することにより、SMTPに関するこれまでのすべての問題を最終的に処理します。しかし、実際にはどのように機能しますか？確認してみましょう！ </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> MTA-STSはどのように機能しますか？ </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STSは、次の2つの条件でのみ別のSMTPサーバーと通信するようにSMTPサーバーに指示することで機能します。 </p> <ol> <li> SMTPサーバー <strong> しなければならない </strong> 暗号化されます。 </li> <li> サーバーの証明書のドメイン名はポリシーのドメインと一致し、証明書は最新のものです。 </li> </ol> <p> DNSとHTTPSの組み合わせを使用してポリシーを公開することにより、MTA-STSは、暗号化された通信チャネルを開始できない場合の続行方法を送信側に通知します。 </p> <p> 受信者側でMTA-STSを実装するのは簡単ですが、送信者の場合は、次のようなサポートメールサーバーソフトウェア <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> 使用すべきです。 </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> MTA-STSはどのような種類の攻撃を軽減しますか？ </h2> <p> MTA-STSが電子メール通信に適用される場合、次の脅威に正面から向き合います。 </p> <p> <strong> 中間者（MITM）攻撃： </strong> この攻撃は、攻撃者が2者間の通信の途中で介入して、データを盗んだり変更したりしたときに実行されます。電子メールの場合、これは通常、2つの通信SMTPサーバーを意味します。 MTA-STSを採用することで、これらの攻撃を簡単に防ぐことができます。 </p> <p> <strong> ダウングレード攻撃： </strong> 攻撃者は、ネットワークチャネルを安全でないデータ送信モードに強制的に変更します。例として、この攻撃はWebサイトの訪問者をHTTPSバージョンのサイトからHTTPバージョンにリダイレクトする可能性があります。 MTA-STSは、不正アクセスを防止することにより、これらの攻撃との戦いに役立ちます。 </p> <p> <strong> DNSスプーフィング攻撃： </strong> これらの狡猾な攻撃は、ユーザーの意図した宛先のDNSレコードを変更し、ユーザーをだまして、正当なサイトまたはドメインにアクセスしていると信じ込ませます。 MTA-STSを実装すると、これらの攻撃を軽減するのに大いに役立ちます。 </p> <p> </p> <p> MTA-STSに慣れてきたので、TLSレポートと呼ばれるSMTPの新しいレポート標準に触れるときが来ました。 </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> SMTP TLSレポート（TLS-RPT）とは何ですか？ </h2> <p> MTA-STSと同様に、TLS-RPTは、接続の問題と送信アプリケーション間の不一致を検出するレポート標準です。有効にすると、メールの送信中に外部サーバーで発生した接続の問題に関する日次レポートが送信されます。 </p> <p> レポートを使用して潜在的な問題や構成の問題を測定およびトリアージできるトラブルシューティングツールと考えてください。 </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> TLS-RPTはどのような種類の問題を解決しますか？ </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> 診断レポート： </strong> TLSレポートは、配信の問題に直面している受信メールに関する包括的な詳細を含むJSONファイル形式の診断レポートを提供します。また、ダウングレード攻撃などが原因で返送された、または配信されなかった電子メールも検出します。 </p> <p> <strong> 視認性の向上： </strong> TLS-RPTを有効にすることで、すべての電子メールチャネルの可視性を向上させることができます。これにより、失敗したメッセージを含む、進行中のすべてのデータを監視できます。 </p> <p> <strong> 日報： </strong> 診断レポートは、MTA-STSポリシーを詳細にカバーおよび監視するために、少なくとも1日に1回送信されます。レポートには、トラフィック統計だけでなく、エラーや配信の失敗に関する詳細情報も含まれます。 </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> 他のすべてが失敗すると、暗号化が優先されます </h2> <p> サイバー脅威は絶えず進化しているため、安全で安全な電子メール配信には、厳格なセキュリティ対策と暗号化が必須です。 </p> <p> 強力な暗号化機能とMTA-STS標準を提供するさまざまなメールプロバイダーのおかげで、完全に安全なメール転送はもはや現実のものではありません。 </p>"}