{"title":"ヘッドホンドライバーとは何ですか？それはサウンドにどのように影響しますか？","content":"<p> ヘッドフォンは素晴らしいテクノロジーです。 </p> <p> ベッドや通勤で音楽を聴く日常の人々や、音楽やビデオを編集するためにクリーンなサウンドのオーディオを必要とする専門家向けに構築されています。このため、ヘッドフォンにはさまざまな種類があります。エクササイズをしている場合でも、何時間もオーディオをミキシングしている場合でも、ヘッドフォンが用意されています。 </p> <p> これらのヘッドフォンの中には <strong> 運転手 </strong> サイズは大幅に異なり、ヘッドホンの用途によって製造方法が異なります。もちろん、これらのドライバーは、耳に響く音に影響を与えます。 </p> <h2 id=\"what-is-a-headphone-driver\"> ヘッドフォンドライバーとは何ですか？ </h2> <p> <img alt=\"Open Back Headphone Driver\" src=\"images/open-back-headphone-driver-548.jpg\" loading=\"lazy\"> </p> <p> ヘッドホンドライバーは本質的に、電気信号を私たちが聞くことができる音に変換する小さなスピーカーです。これらのドライバーは、ヘッドホンの種類と用途によってサイズが大きく異なる場合があります。 </p> <p> たとえば、イヤフォンには8mm程度の非常に小さいドライバーがあり、大きいドライバーの直径は約15mmです。オーバーイヤーヘッドホンのサイズは、20mmから70mmまで、もう少し大幅に異なります。 </p> <p> ヘッドフォンドライバーは、次の3つのコンポーネントで構成されています。 <strong> 磁石 </strong> 、 <b> ボイスコイル </b> 、 そしてその <strong> 横隔膜 </strong> 。 </p> <ul> <li> ザ・ <strong> 磁石 </strong> 磁場を生成し、通常はコバルトまたはフェライトでできています。 </li> <li> <strong> ボイスコイル </strong> 電流がそれらを通過できるようにし、ダイアフラムを動かして、私たちが聞くことができる音を生成します。これらのコイルは通常、さまざまな種類の銅でできており、電気信号を音に変換するのに役立ちます。 </li> <li> ザ・ <strong> 横隔膜 </strong> ボイスコイルを流れる電流から音波を発生させて振動します。 </li> </ul> <p> </p> <h2 id=\"types-of-headphone-drivers\"> ヘッドホンドライバーの種類 </h2> <p> すべてのドライバーがまったく同じように動作するわけではありません。使用する材料やエンジニアリングプロセスおよび技術によっては、他のドライバーよりも優れたオーディオを生成するドライバーもあります。 </p> <h3 id=\"dynamic-drivers\"> ダイナミックドライバー </h3> <p> <img alt=\"Bose Headphones which use a type of Dynamic Driver\" src=\"images/dynamic-driver-415.jpg\" loading=\"lazy\"> </p> <p> 最も一般的なタイプのヘッドフォンドライバーは <strong> ダイナミックドライバー </strong> 。これらのドライバーは、上記で説明したとおりに機能します。ダイヤフラムが振動すると、ダイヤフラムが周囲の空気を押しのけて、聴いている音を作り出します。空気の移動量が多いほど、生成される量は多くなります。この空気の変位は、リアルな低音レスポンスの作成にも役立ちます。 </p> <p> ダイナミックドライバは、低周波数を生成するのに優れています。低周波数を生成すると、音量が大きくなると、高調波歪みが発生し、耳によく聞こえない場合があります。ただし、これらのドライバーはすべてが悪いわけではありません。製造が安価であるため、消費者向けのヘッドホンが安価であり、電力供給も簡単です。ハウジングや使用する素材によって音質が異なるため、すべてのダイナミックドライバーが同じように作成されているわけではありません。 </p> <h3 id=\"balanced-armature-drivers\"> バランスドアーマチュアドライバー </h3> <p> <img alt=\"Apple wired earbuds, which use a balanced armature driver\" src=\"images/apple-wired-earbuds-which-use-a-balanced-armature-driver-119.jpg\" loading=\"lazy\"> </p> <p> <strong> バランスドアーマチュアドライバー </strong> 小さく、主にイヤフォンに見られます。これらのドライバーは、コイルの内側にアームがあり、両側に2つの磁石があります。これにより、アームがどちらかの磁石に向かって回転し、バランスが取れて、ダイヤフラムを動かして音を出すことができます。ドライバーの働き方により、ダイナミックドライバーのように空気を排出せず、低音が不足します。 </p> <p> バランスの取れたアーマチュアドライバーには、遮音性を高めるための追加の通気孔もありません。すべてのドライバーと同様に、音質はイヤフォンの内側と外側の設計方法によって異なります。一部のメーカーは、ダイナミックドライバーを追加して、より優れた低音応答でより豊かなサウンドを作成することもできます。 </p> <p> </p> <h3 id=\"planar-magnetic-drivers\"> 平面磁気ドライバー </h3> <p> <img alt=\"Open Back Headphones using Planar Magnetic Drivers\" src=\"images/open-back-headphones-using-planar-magnetic-drivers-408.jpg\" loading=\"lazy\"> </p> <p> <strong> 平面磁気ドライバー </strong> 通常、オープンバックヘッドホンに見られ、ダイナミックドライバーよりも高価格で提供されます。ボイスコイルを使用する代わりに、平面磁気ドライバーは、両側の磁石からダイアフラムを均等に振動させて音を生成しようとします。これらのドライバーは、横隔膜を均等に振動させるために、より大きな磁石または複数の磁石を使用するため、これらのヘッドホンは少し重い傾向があります。 </p> <p> オープンバックヘッドホンは、ドライバーが完全に開いており、何も覆われていないため、ダイナミックドライバーを使用する通常のクローズドバックヘッドホンよりも音漏れが多くなります。このため、公共の場で音楽を聴くのに最適な選択肢ではありません。しかし、まさにこの理由から、家庭での使用には最適です。 </p> <p> 空気の移動量が多いため、音漏れが多くなり、低音域のレスポンスに優れた豊かな音になり、ご家庭での使用に最適です。 </p> <h3 id=\"electrostatic-drivers\"> 静電ドライバー </h3> <p> <img alt=\"Open Back Headphones That Require an Amplifier\" src=\"images/open-back-headphones-that-require-an-amplifier-271.jpg\" loading=\"lazy\"> </p> <p> <strong> 静電 </strong><strong> 運転手 </strong> 価格が高くニッチな用途であるため、より一般的ではなく、主にオープンバックヘッドフォンに見られます。 </p> <p> これらのドライバーは、静電気を利用して音を出します。ダイアフラムは、反対に帯電した2つの導電性プレートの間で前後に引っ張られ、電気信号の連続的な変化を可能にし、歪みのない音を生成します。平面磁気ドライバーと同様に、この設計はより多くの空気変位を可能にし、リスナーにより良い響きの低音を残します。 </p> <p> 静電ドライバーの動作方法により、高電圧信号が必要になり、アンプと一緒に使用する必要があります。これらの信号は、ほとんどの民生用ヘッドフォンジャックだけでなく、一部のプロ仕様のアンプでも到達できません。静電ドライバー付きのヘッドホンを使用するには、非常に高価な静電アンプが必要になります。 </p> <p> </p> <p> 静電ドライバーは歪みの少ない優れたサウンドステージを提供しますが、平面磁気ドライバーを使用する別のオープンバックヘッドフォンを使用することをお勧めします。これらは、静電ドライバーと同様のリスニング体験を提供しますが、コストが低く、操作が簡単です。 </p> <p> </p> <h2 id=\"which-headphone-driver-should-you-get\"> どのヘッドフォンドライバーを入手する必要がありますか？ </h2> <p> <img alt=\"Razer Gaming Headphones\" src=\"images/razer-gaming-headphones-992.jpg\" loading=\"lazy\"> </p> <p> ヘッドフォンは、さまざまな種類の人々のために作られています。自宅でオーディオをミキシングするときにヘッドホンのみを使用するミュージシャンの場合は、平面磁気ドライバーを備えたオープンバックヘッドホンを使用する必要があります。 </p> <p> あなたがランナーなら、大きなオープンバックヘッドフォンを手に入れるのはあなたにとって最良の選択ではないかもしれません。そこで、小さいながらも素晴らしいサウンドのバランスの取れたアーマチュアドライバーを備えたイヤフォンが役に立ちます。あなたのためだけに作られた、素晴らしいサウンドのヘッドフォンがあります。今度はそれらを見つける時です。 </p>"}