{"title":"すぐにエピックのメタヒューマンキャラクターでゲームをプレイします","content":"<p> ゲームが今現実的に見えると思う場合は、EpicGamesがUnrealEngineで動作するものの負荷をキャッチするまで待ちます。あなたの心を吹き飛ばす準備をしてください。 </p> <h2 id=\"epic-games-unveils-new-metahumans\"> EpicGamesが新しいメタヒューマンを発表 </h2> <p> あなたはおそらく私たちが話している地球が何であるか疑問に思っているでしょう。 MetaHuman Creatorは、EpicGamesがUnrealEngineに追加した最新の機能です。ゲーム開発者がタイトルを作成するために使用できるソフトウェア開発環境。 </p> <p> によると <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> UnrealEngineのブログ投稿 </a> エキサイティングな新しい開発ツールを発表： </p> <blockquote> <p> MetaHuman Creatorは、品質を犠牲にすることなく、リアルタイムのデジタルヒューマンクリエーションを数週間または数か月から1時間未満にするように設計されたクラウドストリーミングアプリです。 </p> </blockquote> <p> つまり、これは本質的に、ゲーム開発者が信じられないほどリアルな人間のファクシミリを作成する方法です。速い。 </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> MetaHuman Creatorは開発者にとって何を意味しますか？ </h2> <p> </p> <p> これがソフトウェア開発に与える影響は、ゲームを変えることです（しゃれを意図したもの）。 MetaHuman Creatorを使用して、開発者がゲームの世界にNPCをすばやく投入することを想像してみてください。それだけでなく、デジタルヒューマンも素晴らしく見えます。 </p> <p> これは明らかに、開発者がタイトルをより早く完成させることができることを意味するので、数え切れないほどの遅延を待つ必要はありません。 MetaHuman Creatorを使用すると、開発者はNPCの数をすばやく増やすことができ、他のより差し迫った問題に時間を割くことができます。 </p> <p> しかし、なぜこのツールが必要なのでしょうか。 Epic Gamesの説明： </p> <blockquote> <p> 高品質のデジタルヒューマンを1人作成することは、困難で時間がかかります。次世代プラットフォームとハイエンドの仮想制作に必要な品質の多くの多様なデジタルヒューマンを作成するためのその努力を拡大することは、確かに手ごわい仕事です。 </p> </blockquote> <p> だから、私たちが言ったように;このツールは時間を節約し、ワークフローを改善するため、開発者は新世代のコンソールにふさわしいゲームを提供できます。 </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> MetaHuman Creatorはゲームにどのように影響しますか？ </h2> <p> さて、MetaHuman Creatorのおかげで、ゲームは最初にリリースがはるかに速くなるかもしれません。このような強力なツールを自由に使用できるため、開発者はゲームの仕組みを磨いたり、壊れたゲームをリリースする前に実際にバグを修正するためにより多くの時間を費やしたりできます... </p> <p> とにかく、苦味はさておき、Epicの開発ツールはゲームの見栄えも良くするもののようです。レンダリングを見るだけで、デジタルヒューマンが実際にどれほど息をのむかを確認できます。しかし、ゲームでそれらを見るときは、本当の魔法が起こるときです。 </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> ゲームでメタヒューマンはいつ見られますか？ </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> それは言うのが難しいです。現在、Epicは、「今後数か月」の早期アクセステストのためにCreatorソフトウェアをペグしています。したがって、メタヒューマンはすぐには表示されません。 </p> <p> 独自のデジタルヒューマンの作成に挑戦したい場合は、UnrealEngineのMetaHumanCreatorを使用するかどうかを待つ必要があります。いつでも別のプログラムにまとめてみることができますが、1時間もかからないことは確かです。 </p>"}