{"title":"거대한 Microsoft Edge 업데이트가 당신을 향하고 있습니다","content":"<p> 마이크로 소프트는 인터넷 브라우저 인 엣지를 최선을 다해 최선을 다하고 있습니다. 이제이 회사는 세 가지 중요한 기능을 제공하고 있으며 Edge의 미래에는 모든 것이 장밋빛처럼 보입니다. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Microsoft가 Edge를 위해 계획 한 것 </h2> <p> 큰 범퍼 업데이트는 <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 최신 </a> . 세 가지 기능은 하나의 큰 업데이트로 제공 될 예정이므로 가까운 장래에 Edge를 주시하는 것이 좋습니다. </p> <p> 먼저 Microsoft Edge는 웹 위젯 지원을 받고 있습니다. 이러한 위젯은 하루 종일 중요한 정보를 빠르게 확인할 수있는 편리한 방법입니다. 이 소프트웨어 거대 기업은 모든 모양과 크기의 위젯을 실험하고 싶지만 일을 시작하기 위해 뉴스 위젯으로 시작하기로 결정했습니다. </p> <p> 다음으로 Microsoft Edge에는 탭 검색 기능이 있습니다. 이것이 익숙한 것처럼 들리면 아마도 <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> 탭 검색 도구를 얻는 Edge의 초기 추측 </a> . 다행히도 이러한 추측이 현실이되었으며 Microsoft는 Chrome 기능을 Edge에 도입 할 계획입니다. </p> <p> 마지막으로 단일 메뉴에서 모든 Edge 확장을 관리 할 수 ​​있습니다. 브라우저 작업 표시 줄에 퍼즐 조각으로 나타나며, 클릭하면 각 확장 프로그램을 빠르게 활성화 및 비활성화 할 수있는 방법과 함께 설치된 모든 확장 프로그램이 표시됩니다. </p> <p> 이 업데이트가 정확히 언제 출시 될지는 확실하지 않지만 Windows Latest는 &quot;다음 대규모 업데이트&quot;를 위해 고정했습니다. 따라서 Microsoft Edge가 새로운 것을 찾는 사람들에게 매력적인 선택이 될 때까지 그리 오래 걸리지 않을 것입니다. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge : 다음 큰 일은? </h2> <p> 오랫동안 Microsoft의 브라우저는 Chrome 또는 Firefox를 설치하기위한 고급 다운로드 관리자로 간주되었습니다. 그러나 Microsoft가 브라우저에 Chromium 코드베이스를 채택한 이후로 브라우저 세계의 웃음 거리가되었습니다. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCounter </a> 작성 당시 미국에서 두 번째로 많이 사용되는 Windows 브라우저로 Microsoft Edge를 나열합니다. Firefox가 Edge에 의해 먼지에 남아 있다는 것을 이미 알고 있었지만 그 이후로 그 격차는 더 커졌습니다. </p> <p> 현재 Edge는 Firefox가 소유 한 3.35 %에 비해 미국 시장 점유율 5.25 %를 차지합니다. 둘 다 Chrome의 45.83 %와는 거리가 멀지 만 시작에 불과합니다. </p> <p> 따라서 이전에 Microsoft의 브라우저를 사용했다면 지금이 두 번째 기회를 제공 할 좋은 기회입니다. 누가 알겠습니까? Microsoft 최고의 브라우저에 의해 이길 수 있습니다! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> 브라우저를 엣지로 푸시 </h2> <p> 과거에 마이크로 소프트 브라우저의 팬이 아니었다면 지금은 그 소란이 무엇인지 알아보기에 좋은시기입니다. 큰 업데이트가 진행 중이며 여기에서 나아질 것입니다. </p> <p> 마이크로 소프트는 그것이 승리하는 공식에 있다는 것을 알고 있습니다. 실제로이 회사는 최근 전 세계 6 억 명의 사람들이 현재 Edge를 사용하여 웹을 검색했다고보고했습니다. </p> <p> <small> 이미지 크레딧 : DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}