{"title":"한 입 크기의 두뇌 음식 : 짧고 재미있는 방법으로 새로운 것을 배울 수있는 5 가지 사이트","content":"<p> 1 분 미만의 다큐멘터리. 60 초의 팟 캐스트 에피소드. 복잡한 주제를 설명하는 애니메이션 인포 그래픽. 여기에서 흥미로운 지식의 빠른 캡슐을 통해 세계에 대해 자세히 알아볼 수 있습니다. </p> <p> 주의 집중 시간이 짧고 문자가 280 개 업데이트되는 시대에는 학습도 아주 조금만해야합니다. 그렇기 때문에 바쁜 일상에서 거의 시간이 걸리지 않는 정보적이고 재미있는 작품을 전문적으로 만드는 콘텐츠 제작자가 있습니다. 매혹적인 사람들과 주제의 미니 다큐멘터리부터 유행하는 주제에 대한 소셜 미디어 가이드에 이르기까지 마음에 씹을 수있는 한 입 크기의 두뇌 음식을 제공하세요. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 60 초 문서 </a> (웹) : 60 초 만에 흥미로운 인물과 주제의 프로필 </h2> <p> </p> <p> 시간있어? 60 Second Docs에는 흥미로운 사람에 대해 이야기하는 멋진 이야기가 포함되어 있습니다. 각 다큐멘터리는 길이가 60 초에 불과하지만 주제에 대해 알아야 할 가장 좋은 내용을 다룹니다. </p> <p> 가장 멋진 부분은 60 Second Docs가 개념이나 트렌드가 아닌 실제 사람의 프로필에 초점을 맞춘다는 것입니다. 일반적으로 그 사람은 새로운 트렌드를 시작하거나 새로운 주제를 탐색하거나 어떤 방식 으로든 경계를 넓히는 등 독특한 일을하고 있습니다. 사람에 대해 이야기함으로써 독특한 주제의 인간적 측면에 대한 더 많은 통찰력을 얻을 수있을뿐만 아니라 더 현실적이고 감정적 인 느낌을 갖게됩니다. </p> <p> 모든 60 초 문서는 YouTube 채널 또는 소셜 미디어 핸들에서 사용할 수 있습니다. 자주 방문하는 소셜 네트워크에서 이들을 팔로우하고 업데이트를 게시 할 때마다 모든 새로운 비디오를 전체적으로 보는 것이 좋습니다. </p> <p> 더 긴 다큐멘터리를 좋아한다면 <strong> 공식 선정 </strong> 60 Second Docs 웹 사이트의 페이지. 여기서 편집자들은 다른 사람들이 촬영 한 10 ~ 20 분 분량의 다큐멘터리를 여러분이 봐야한다고 생각하는 주제에 대해 선택합니다. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> 그래서 당신은 얘기하고 싶어 </a> (Instagram) : 정치 및 사회 주제에 대한 미니 가이드 </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> 인플 루 언서 셀카와 브랜드 홍보 해시 태그의 세계에서 인스 타 그램이 교육 플랫폼을 제공한다는 사실을 누가 알았습니까? So You Want To Talk About (Sywtta)은 Instagram의 다중 이미지 게시물 형식을 사용하여 정치 및 사회적 주제에 대한 미니 가이드를 만듭니다. </p> <p> Sywtta가 선택한 주제는 일반적으로 학자금 대출 취소, 흑인 권리 및 역사, 논리적 오류, COVID-19 백신 등과 같은 유행하는 주제를 다룹니다. 각 슬라이드는 주제에 대해 교육하기 위해 아름다운 형식의 타이포그래피를 사용하며, 모든 슬라이드는 그 자체로 미니 레슨과 같습니다. 각 가이드는 데이터가 너무 많지 않으면 서 빠르고 유익한 단기 집중 코스가됩니다. </p> <p> 경계해야 할 때 <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> 편견 또는 가짜 뉴스 </a> , 읽고있는 내용의 철학에 주목하는 것도 중요합니다. 정치와 관련하여 Sywtta는 진보적 및 좌파 정책의 견해를 전파합니다. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 삼. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> 60 초 과학 </a> (팟 캐스트) : 과학, 건강 및 기술에 대한 짧은 오디오 설명 </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> 읽거나 보는 것보다 정보를 듣는 것을 선호한다면 60 초 과학 팟 캐스트를 확인하십시오. Scientific American 팀이 제작 한이 팟 캐스트는 과학, 의학 및 기술 관련 주제를 다루고 한 가지 주제를 짧은 시간 안에 설명합니다. 더 이상 분 시간 제한으로 제한되지 않지만 각 에피소드는 여전히 5 분 미만입니다. </p> <p> 각 팟 캐스트에는 COVID, 동물 및 새, DNA 및 의학, 환경 과학 등과 같은 주제를 다루는 Scientific American 팀의 호스트가 다릅니다. 그들은 높은 생산 가치를 즐기고 토론의 요점에 대한 실제 사운드를 통합하고 종종 음성 클립을 추가합니다. 전문가로부터. </p> <p> 지난 에피소드의 아카이브를 검색하려면 60-Second Science 공식 웹 사이트를 방문하세요. 여기에서 주제 (건강, 정신, 지속 가능성, 기술, 과학)별로 에피소드를 필터링 할 수 있습니다. 짧은 순간에 정보를 얻고 싶지 않다면 전체 길이의 Science Talk 팟 캐스트를 사용해보십시오. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 애니 마 그래프 </a> (웹) : 사물을 설명하는 고품질 애니메이션 인포 그래픽 </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> 암호 화폐는 어떻게 작동합니까? 자동차 보험의 내용은 무엇입니까? 문 워크는 어떻게하나요? 디자이너이자 애니메이터 인 Jacob O&#39;Neal은 복잡한 주제를 간단한 설명으로 나누고이를 설명하기 위해 고품질의 애니메이션 인포 그래픽을 그립니다. </p> <p> Animagraffs는 애니메이션 GIF를 사용하여 시각적 가이드를 통한 짧은 설명 모음입니다. Jacob은 악기의 모든 부분을 보여주는 횡단면보기 또는 Google지도처럼 확대 및 축소 할 수있는 움직이는 부품이있는 큰 이미지와 같은 다양한 디자인 기술을 사용합니다. 각 스타일은 학습중인 주제에 적합합니다. </p> <p> 주제도 치타가 달리는 방식, 전기 자동차가 작동하는 방식, 스피커가 소리를내는 방식 등을 포함하여 광범위한 범위를 가지고 있습니다. Jacob이 브랜드에 대한 유료 과제를 보여주는 &quot;클라이언트 작업&quot;섹션도 확인해야합니다. 광고이긴하지만 정보가 풍부하고 재미 있습니다. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> 그레이트 빅 스토리 </a> (YouTube) : 매력적이고 흥미로운 진정한 단편 다큐멘터리 </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story는 2020 년 말에 작업을 마쳤지만 5 년 분량의 유쾌한 단편 다큐멘터리를 남기기 전에는 끝나지 않았습니다. 아카이브에 들어가서 다양한 흥미로운 주제와 전 세계의 매력적인 사람들에 대한 약 5 분 분량의 비디오를 찾으십시오. </p> <p> 인도 극장에서 24 년 동안 상영되는 영화부터 녹지 않는 놀라운 터키 아이스크림에 이르기까지 각 짧은 비디오는 주제에 대한 고품질의 잘 연구 된 모습입니다. 대부분의 다른 동영상과는 달리 Great Big Story의 동영상 제작자는 종종 전 세계를 여행하여 이야기의 중간에 있습니다. 가장 인기있는 순서로 정렬하거나 제작자가 추천하는 다양한 사용자 지정 재생 목록을 사용합니다. </p> <p> 채널에는 약 10 ~ 15 분 길이의 더 긴 동영상도 있습니다. 일반적으로 짧은 동영상의 몇 개의 클립이 포함 된 목록 및 편집입니다. 우리 주변의 세계에 대해 더 많이 알아볼 시간이 있다면 이것으로 잘못 갈 수 없습니다. 셔터를 내리고도 Great Big Story는 <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> YouTube의 흥미롭고 교육적인 채널 </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> 드립 학습을 사용하여 큰 주제 정복 </h2> <p> 이러한 웹 사이트와 팟 캐스트는 각각의 새로운 주제를 작고 재미있는 정보 패키지로 바꾸는 데 중점을 둡니다. 조금씩 새로운 것을 배울 수있는 좋은 방법입니다. 그러나 더 복잡하고 더 큰 과목에 대해 배우는 데 동일한 철학을 적용 할 수도 있습니다. </p> <p> 점점 더 드립 학습 또는 마이크로 학습이 인기있는 교육 방법입니다. 수신함으로써 <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> 매일 한입 크기의 수업 </a> , 프로그래밍, 디자인, 앱 개발, 제품 관리 등과 같은 주제를 다룰 수 있습니다. 빠른 웹 검색은 자신을 교육하려는 모든 것에 대한 드립 학습 버전을 찾는 데 도움이 될 것입니다. </p>"}