{"title":"BitPay는 Bitcoin을 Apple Pay로 가져옵니다.","content":"<p> 미국의 BitPay 사용자는 이제 선불 비트 코인 카드를 Apple의 지갑 앱에 추가 할 수 있습니다. <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple Pay로 물건을 지불하는 데 사용 </a> . Apple이 아닌 고객은 곧 MasterCard 브랜드 BitPay 카드를 Google Pay 및 Samsung Pay에 추가 할 수 있습니다. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> Apple Wallet에 BitPay 카드를 추가하는 방법 </h2> <p> BitPay 카드를 Apple 기기에 추가하려면 iPhone에서 월렛 앱을 열고 오른쪽 상단의 &#39;+&#39;를 탭한 다음 화면의 안내에 따라 카드 추가를 완료하세요. </p> <p> 월렛 앱에서 BitPay를 사용하면 다음으로 이동하여 Apple Pay에 카드를 추가 할 수 있습니다. <strong> 설정&gt; Wallet 및 Apple Pay </strong> 을 탭한 다음 &quot;카드 추가&quot;라고 표시된 옵션을 탭하십시오. BitPay 사용자가되어 선불 카드를 주문하려면 다음에서 BitPay 지갑 앱을 다운로드하십시오. <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> 앱 스토어 </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Apple Pay로 지출하는 새로운 방법 </h2> <p> 에 대한 게시물 <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> BitPay 블로그 </a> Apple Pay에 BitPay 카드를 추가하는 것은 이전보다 더 많은 곳에서 암호 화폐를 사용하는 편리한 방법이라고 말합니다. &quot;우리는 항상 새로운 장소와 암호 화폐를 사용할 방법을 찾고있는 BitPay 카드를 사용하는 수천 명의 BitPay 지갑 앱 고객을 보유하고 있습니다.&quot;라고 BitPay CEO Stephen Pair는 말했습니다. <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> 보도 자료 </a> . </p> <p> </p> <p> Apple Pay를 사용하면 BitPay 카드 소지자는 실제 매장, Apple Pay를 지원하는 앱 및 웹에서 안전한 비접촉식 구매를 할 수 있습니다. 이 회사는 플라스틱 카드 배송을 기다리는 고객이 공식 BitPay 지갑 앱을 통해 Apple 지갑에 가상 카드를 추가 할 수 있다는 점에 주목합니다. 그렇게하면 즉시 지출을 시작할 수 있습니다. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> BitPay 카드 란 무엇입니까? </h2> <p> Mastercard 네트워크를 사용하는 선불 카드 인 BitPay 카드를 사용하면 비접촉 결제와 PIN 결제를 모두 쉽게 수행하고 호환되는 ATM에서 현금을 인출 할 수 있습니다. 앱을 통해 고객은 잔액을 확인하고, 새 PIN을 요청하고, 즉시 재충전 할 수있을뿐만 아니라 암호 화폐를 법정 화폐로 변환 할 수 있습니다 (그런 다음 카드에로드되어 전 세계적으로 마스터 카드 직불이 허용되는 곳이면 어디에서나 사용할 수 있습니다). </p> <blockquote> <p> 파워 블록 체인 사용자를 위해 BitPay 지갑 앱은 암호 화폐를 구매 및 저장하고 온라인 결제를 할 수있는 다양한 옵션을 지원합니다. 사용자는 상점과 온라인에있는 수백 개의 상위 소매 업체에서 즉시 기프트 카드를 구매할 수 있습니다. </p> </blockquote> <p> 카드에는 EMV 칩이 있으며 긴급 상황시 앱을 사용하여 잠글 수 있습니다. </p> <p> 회사에 따르면 구글 페이와 삼성 페이에 대한 지원은 &quot;이번 분기 말&quot;로 계획되어있다. BitPay 앱의 경우 현재 Bitcoin, Bitcoin Cash 및 Ether는 물론 4 달러 고정 스 테이블 코인, USDC, GUSD, PAX 및 BUSD 암호 화폐를 지원합니다. </p>"}