{"title":"컴퓨터 RPG vs. 클래식 RPG : 2021 년 CRPG는 무엇을 의미합니까?","content":"<p> 컴퓨터 RPG의 역사는 비디오 게임 자체의 역사만큼이나 오랜 세월에 걸쳐 함께 진화하고 성장합니다. 그리고 CRPG가 진화하여 그래픽을 개선하고 게임 플레이 메커니즘을 추가하거나 삭제하는 것처럼이를 설명하는 데 사용 된 의미와 용어도 마찬가지였습니다. </p> <p> 전통적으로 컴퓨터 롤 플레잉 게임의 약어 인 CRPG는 시간이 지남에 따라 다양한 플랫폼 용 RPG를 포함하도록 그 의미를 확장했습니다. 이제 그것은 새로운 의미를 채택했습니다. 새로운 의미가 원래의 의미와 완전히 다르지는 않지만 이제는 특정 RPG 하위 장르를 설명합니다. </p> <h2 id=\"the-history-of-crpgs\"> CRPG의 역사 </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> CRPG의 역사는 1970 년대 탁상용 RPG Dungeons &amp; Dragons, Dungeon의 가장 초기 비디오 게임을 출시하면서 시작되었습니다. 이 게임은 원래 Atari에서 사용할 수있었습니다. <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex의 게임 스트리밍 서비스, Plex Arcade </a> ). </p> <p> Dungeon의 게임 플레이는 주로 텍스트 기반 이었지만 Dungeons &amp; Dragons의 대부분의 기본 교리를 구현하면서 판타지 설정에서 다중 캐릭터 파티의 움직임을 완전히 설명했습니다. </p> <p> 당시 우리는 컴퓨터 RPG라는 이름을 붙여 그 당시 훨씬 더 인기가 있었던 탁상용 게임과 구별되도록했으며 단순히 RPG라고 알고있었습니다. </p> <p> 1990 년대에 만발한 CRPG는 이제 판타지 세계를 적어도 하향식 관점 또는 등각 투영 뷰로 전체적으로 표시 할 수 있습니다. 이 작가가 플레이 한 가장 인터랙티브 한 CRPG 중 하나 인 Ultima VII의 경우도 마찬가지입니다. </p> <p> 당신이 볼 수있는 거의 모든 것들이 움직이거나 상호 작용할 수 있습니다 : 당신은 무기를 만들고, 악기를 연주 할 수 있으며, 심지어 죽은 파티원을 던전에서 왕의 왕좌까지 데려다가 부활시킬 수 있습니다! </p> <p> Baldur &#39;s Gate는 탁상용 RPG 경험을 가장 가깝게 모방 한 것 중 하나였습니다. Dungeons &amp; Dragons 2nd Edition의 규칙 세트 (일명 Advanced Dungeons &amp; Dragons)를 등각 투영으로 조정했습니다. <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> 실시간 일시 중지 가능한 CRPG </a> . 이러한 종류의 CRPG는 전투, 캐릭터 진행, 의사 결정의 전술을 강조하고 탐험을 장려했습니다. </p> <p> </p> <p> 오늘날 콘솔이 시장을 장악하고있는 세상에서 롤 플레잉 비디오 게임이 탁상 형 RPG보다 더 인기를 얻고 있습니다. 현대적 사용에서 RPG는 비디오 게임 버전을 더 많이 지칭합니다. Dungeon &#39;s &amp; Dragons를 단순한 RPG가 아닌 탁상 형 RPG라고 부를 것입니다. </p> <p> 그래픽의 진화와 함께 CRPG의 게임 플레이 메커니즘은 최신 그래픽 표준에 맞게 조정되었습니다. The Elder Scrolls, Gothic 또는 The Witcher와 같은 CRPG 시리즈는 장르에 혁명을 일으켜 새로운 게임 플레이 메커니즘을 도입하면서 다른 게임을 떨어 뜨 렸습니다. </p> <p> 이 RPG는 더 액션 지향적이고 빠른 속도로 진행되며, 완전히는 아니지만 해킹 및 슬래시 하위 장르 내에 다소 배치됩니다 (그래도 여전히 견고한 RPG입니다!). </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> CRPG의 새로운 물결 </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> 그러나 오늘날의 비디오 게임 업계에서 그래픽 현실성을 추구하는 추세에 반하여 CRPG의 새로운 물결이 나타났습니다. 구식 또는 클래식 RPG는 이러한 게임에 큰 영향을 미치며 비주얼보다는 게임 플레이 메커니즘과 몰입감을 강조합니다. </p> <p> 일반적으로 실시간 일시 중지 가능 또는 턴 기반 전술 전투가있는 아이소 메트릭 게임입니다. 이 CRPG는 가능한 한 몰입 할 수 있도록 최선을 다하여 잘 만들어진 산문과 탄탄한 배경 이야기를 제공합니다. </p> <p> 대부분은 구식 CRPG와 마찬가지로 대부분의 대화에서 음성 연기보다는 텍스트에 의존합니다. 이러한 CRPG 중 일부에는 Pillars of Eternity, Divinity : Original Sin 또는 Pathfinder : Kingmaker가 포함됩니다. </p> <p> 이 게임은 또한 구식 CRPG처럼 전투 전술, 캐릭터 진행, 의사 결정을 강조하고 탐험을 장려합니다. 이러한 이유로 우리는 그것들이 대부분의 최신 RPG보다 클래식 RPG와 더 밀접한 관련이 있다고 생각합니다. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> 2021 년 CRPG의 의미 </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> 2000 년대부터 RPG는 롤 플레잉 비디오 게임을 지칭 할 때 표준 용어가되었습니다. 그러나 2015 년경, 그들은 Divinity : Original Sin과 Pillars of Eternity를 발표했습니다. </p> <p> 이 RPG는 현대 RPG의 액션 지향적 테이크에서 벗어 났으며 미학과 게임 플레이 메커니즘 모두에서 이전 타이틀과 매우 유사합니다. 이러한 RPG를 현대 RPG와 구별하기 위해 새로운 용어가 필요하게 된 것은이 무렵이었습니다. </p> <p> 사람들은 이러한 게임을 설명하기 위해 수년 동안 온라인에서 &quot;오래된 학교&quot;와 &quot;클래식 RPG&quot;라는 용어를 던졌지 만 후자가 붙어있는 게임입니다. 현대의 롤 플레잉 비디오 게임이 스스로 RPG라는 약어를 주장했듯이, 사람들은 이제 구식 RPG를 &quot;CRPG&quot;라고 부르고 있습니다. </p>"}