{"title":"Facebook의 Mark Zuckerberg가 Apple의 개인 정보 보호 정책을 개인적으로 수행했습니다.","content":"<p> 페이스 북 CEO 인 마크 주 커버 그는 페이스 북 직원들에게 소셜 미디어 거대 기업을 너무 나쁘게 대우 한 이유로 애플에 &quot;고통을 주어야한다&quot;고 말했다. <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> 월 스트리트 저널 </a> 보고서. </p> <p> 주 커버 그는 2018 년에 애플과 페이스 북의 수석 간부가 정치 광고에 대한 동의없이 수백만 페이스 북 사용자의 개인 데이터에 접근 한 캠브리지 아 날리 티카 스캔들에 머리를 맞대고 발언을 한 것으로 추정된다. </p> <h2 id=\"apple-vs-facebook\"> 애플 vs. 페이스 북 </h2> <p> 당시 애플 CEO 인 팀 쿡은 인터뷰에서 그가 위기에 직면 한 주커 버그의 상황에있을 때 어떻게 대응할 것인지에 대한 질문을 받았다. &quot;나는 이런 상황에 있지 않을 것&quot;이라고 쿡은 말했다. </p> <p> 월스트리트 저널은 주커 버그가 쿡의 말이 &quot;엄청나게 냉정하고&quot; &quot;진실과 전혀 일치하지 않는다&quot;고 언급 한 반면, 그가 평가에서 상당히 가혹하다고 주장했다. </p> <p> 그 이후로 두 기술 회사 간의 관계는 더 나아지지 않았습니다. 애플은 프라이버시 지향적 입장을 두 배로 늘 렸으며 Cook은 프라이버시를 다음 중 하나라고 선언했습니다. <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> 세계에서 가장 시급한 문제 </a> . iOS 14에는 여러 개인 정보 보호 관련 기능이 포함되어 있습니다. Facebook은 중소기업에 피해를 줄 가능성이 있다고 주장하면서 문제를 해결했습니다. </p> <p> Facebook의 최근 분기 별 투자자 통화에서 Zuckerberg는 Apple에 &quot; <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> [Facebook]의 가장 큰 경쟁자 중 하나 </a> &quot;이러한 새로운 개인 정보 보호 조치의 결과입니다.&quot;Apple은 사람들을 돕기 위해 이러한 조치를 취하고 있다고 말할 수 있지만 이러한 움직임은 경쟁적 이익에 따라 명확하게 추적됩니다. &quot;라고 Zuckerberg는 말했습니다. </p> <p> </p> <p> 페이스 북은 두 실리콘 밸리의 거물들 ​​사이의 저격을 전면적 인 법적 싸움으로 바꿀 애플에 대한 반독점 소송을 준비하고있는 것으로 보인다. 월스트리트 저널 보고서는 &quot;잠재적 인 규제 합의 및 법적 결정이 향후 수억 대의 소비자 휴대폰에 영향을 미칠 것&quot;이라고 지적합니다. </p> <p> </p> <h2 id=\"different-approaches\"> 다양한 접근 방식 </h2> <p> 페이스 북 대변인 다니 레버는 월스트리트 저널에 &quot;Apple은 이것이 개인 정보 보호에 관한 것이라고 주장하지만 이는 이익에 관한 것이며 우리는 다른 사람들과 협력하여 그들의 자기 선호, 반 경쟁적 행동을 지적하고 있습니다.&quot;라고 말했습니다. 그녀는 페이스 북이 애플의 앱 프라이버시 기능으로 인해 피해를 입은 중소 기업과 개발자를 대신하여 &quot;애플에 고의적으로 맞서고있다&quot;고 말했다. </p> <p> 레버는 두 회사 간의 싸움이 개인적인 것이라고 부인했지만, 두 대기업 간의 경쟁이 벌어 질 수밖에 없다. Facebook이 운영하는 광고 자금 지원 비즈니스 모델은 Apple을 지원하는 하드웨어 자금 지원 모델과는 매우 다릅니다. 두 회사 (또는 리더) 모두 기술의 미래를 구축하는 방법에 대한 핵심 신념을 물러서지 않을 것입니다. </p> <p> Apple CEO 인 Tim Cook이 도덕적 관점에서 프라이버시를 논의한다는 사실은 이것이 진정으로 얼마나 개인적인 것인지를 보여줍니다. </p> <p> <small> 이미지 크레딧 : Wikipedia / <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> 앤서니 퀸 타노 CC </a></small> </p>"}