{"title":"Apple 음악 권장 사항을 재설정하는 방법","content":"<p> Apple Music은 좋아하는 아티스트와 음악 장르를 다시 선택하여 음악 추천을 다시 선별 할 수있는 쉽게 접근 할 수있는 방법을 가지고있었습니다. 불행히도 앱 업데이트 중에 Apple은 음악 큐 레이션을 새로 고치는이 방법을 제거했습니다. </p> <p> 걱정하지 마십시오. Apple Music 자동 제안을 중지하거나 재설정하는 대체 방법에 대한 가이드가 있습니다. </p> <h2 id=\"apple-music-recommendations-explained\"> Apple Music 권장 사항 설명 </h2> <p> 처음으로 Apple Music 계정을 시작하면 다양한 음악 장르 및 아티스트 목록에서 즐겨 찾기를 선택하라는 메시지가 표시됩니다. 이 큐 레이션은 Apple Music이 앞으로 나아갈 재생 목록, 앨범, 아티스트 및 노래를 제안하는 방법입니다. </p> <p> 예를 들어, Classic Rock, New Rock 및 Foo Fighters를 좋아하는 음악 선택으로 선택했다면 Apple Music은 매우 유사한 청취 스테이션을 제안하고 최근 출시 된 록 음악을 홍보 할 것입니다. </p> <p> 앱을 변경하면 이제 초기 계정 생성 중에 만 음악 환경 설정을 선별 할 수 있으며 나중에 재설정 할 수는 없습니다. Apple Music은 사용자의 청취 습관에 따라 제안을 계속 수정합니다. </p> <p> 이것은 몇 가지 유용한 중 하나입니다. <a href=\"https://www.makeuseof.com/tag/apple-music-features-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> 사용할 Apple Music 기능 </a> . </p> <p> 걱정하지 마십시오. Apple ID 환경 설정을 비활성화하거나 Apple Music 계정을 삭제하고 다시 생성하여 Apple Music 큐 레이션을 재설정 할 수있는 몇 가지 방법이 있습니다. </p> <p> 두 옵션 모두 장점과 단점이 있으므로 어떤 옵션이 가장 적합한 지 알아 봅시다. </p> <p> </p> <h2 id=\"turn-off-personalized-recommendations\"> 개인화 된 권장 사항 해제 </h2> <p> Apple ID에 대한 개인화 된 추천을 끄는 것은 앞으로 나아갈 새로운 제안을 보지 못하게하는 좋은 방법입니다. </p> <p> 이 옵션을 비활성화해도 기존 큐 레이션 데이터가 제거되지는 않습니다. 즉, 앱에서 사용량에 따라 제안을 계속 작성합니다. 더 이상 볼 수 없습니다. 개인화 된 추천을 끄면 Apple Books와 같은 다른 Apple 서비스 앱의 추천에도 영향을 미칩니다. </p> <p> iPhone에서 개인화 된 추천을 비활성화하는 방법은 다음과 같습니다. </p> <ol> <li> 열기 <strong> 애플 뮤직 </strong> 앱. </li> <li> 다음으로 이동 <b> 지금 들어보세요 </b> 탭. </li> <li> 화면 오른쪽 상단 모서리에있는 사람의 실루엣이있는 원형 아이콘을 선택하여 Apple Music 프로필을 엽니 다. 이전에 개인 프로필 사진으로 이미지를 업로드 한 경우 실루엣 대신 표시됩니다. </li> <li> 고르다 <b> Apple ID보기 </b> 하단으로 스크롤하여 찾을 수 있습니다. <b> 계정 </b> 페이지. </li> <li> 끄다 <b> 맞춤형 추천 </b> . </li> <li> 고르다 <b> 끝난 </b> 오른쪽 상단 모서리에서 완료됩니다. </li> </ol> <p> <strong class=\"gallery__section-title\"> 이미지 갤러리 (3 이미지) </strong> <img alt=\"Apple Music Lisen Now featuring Halle x Chloe\" src=\"images/apple-music-listen-now-page-713.jpg\" loading=\"lazy\"> 넓히다 <img alt=\"Apple Music Account Options Screenshot\" src=\"images/apple-music-account-page-914.jpg\" loading=\"lazy\"> 넓히다 <img alt=\"Apple ID Options Screenshot\" src=\"images/apple-id-account-page-817.jpg\" loading=\"lazy\"> 넓히다 </p> <p> 닫기 </p> <p> 이렇게하면 Apple Music의 새로운 음악 검색, 다운로드 또는 재생이 더 이상 자동 제안에 영향을주지 않습니다. 이렇게하면 이전 검색이 자동으로 삭제되지 않으므로이 방법의 효과를 확인하는 데 약간의 시간이 걸릴 수 있습니다. </p> <p> </p> <h2 id=\"delete-your-apple-music-profile\"> Apple 음악 프로필 삭제 </h2> <p> 신선한 음악 제안으로 완전한 Apple Music 화장이 필요한 경우 가장 좋은 방법은 Apple Music 프로필을 삭제하고 다시 만드는 것입니다. </p> <p> 프로필을 삭제하면 현재 음악 라이브러리가 완전히 제거된다는 점에 유의해야합니다. 새 프로필을 생성하면 완전히 새로운 음악 및 장르 환경 설정을 선택할 수 있지만 이전 Apple Music 기록도 완전히 제거됩니다. </p> <p> </p> <p> 새로 선택한 즐겨 찾기가 포함 된 새로운 Apple Music 프로필에 관심이있는 경우 다음 단계에 따라 만듭니다. </p> <ol> <li> 로부터 <strong> 지금 들어보세요 </strong> 탭, Apple Music으로 이동 <strong> 계정 </strong> , 선택 <b> 프로필보기 </b> . </li> <li> 고르다 <b> 편집하다 </b> 이름 아래 화면 중앙에 있습니다. </li> <li> 화면 하단으로 스크롤하여 <b> 프로필 삭제 </b> . 주의하십시오. 이것은 계정을 재설정해야하는 영구적 인 삭제입니다. </li> <li> 이제 이전 선택에서 무료로 제공되는 새로운 Apple Music 프로필을 직접 설정하십시오. 위 섹션에 설명 된대로 맞춤 추천을 비활성화하면 맞춤 음악 추천을 더 이상 경험할 수 없습니다. 퇴거 <strong> 맞춤형 추천 </strong> 켜면 Apple Music이 새로운 청취 습관에 따라 음악을 제안합니다. </li> <li> 자유롭게 탐색하고 새로 선택한 다양한 오디오 옵션을 즐기십시오. </li> </ol> <p> <strong class=\"gallery__section-title\"> 이미지 갤러리 (이미지 2 개) </strong> <img alt=\"Apple Music Profile feat Halle x Chloe\" src=\"images/apple-music-profile-page-771.jpg\" loading=\"lazy\"> 넓히다 <img alt=\"Apple Music Profile Options Screenshot\" src=\"images/apple-music-edit-profile-page-450.jpg\" loading=\"lazy\"> 넓히다 </p> <p> 닫기 </p> <p> </p> <h2 id=\"spotify-s-recommendations-might-be-better\"> Spotify의 권장 사항이 더 좋을 수 있습니다. </h2> <p> 새 프로필을 만든 후에도 Apple Music의 권장 사항에 만족하지 않는다면 대신 음악 스트리밍 플랫폼을 전환해야 할 때일 수 있습니다. Apple Music과 Spotify에는 매우 유사한 기능이 많이 있지만 많은 사람들은 Spotify가 새로운 음악을 제안하는 데 훨씬 뛰어나다 고 생각합니다. </p> <p> 물론 Apple Music과 Spotify 중에서 선택할 때 고려해야 할 다른 요소가 많이 있습니다. </p>"}