{"title":"최고의 인스턴트 메시징 서비스가 종단 간 암호화를 사용하는 방법","content":"<p> 개인 데이터는 그 어느 때보 다 중요합니다. 정부, 기업 및 사이버 범죄자는 사람들의 이익을 위해 개인 데이터를 원합니다. 온라인 플랫폼이 다르기 때문에 우리가 알지 못하는 사이에 개인 데이터를 쉽게 제공 할 수 있습니다. </p> <p> 이러한 이유로 온라인에서 사용하는 플랫폼이 개인 정보를 보호하는 방법을 잘 이해하는 것이 중요합니다. 메시징 응용 프로그램의 보호 조치를 고려할 때주의해야 할 핵심 요소 중 하나는 종단 간 암호화입니다. </p> <p> 데이터 프라이버시의 우선 순위를 정해야 할 필요성을 인식하고 더 많은 메시징 애플리케이션이 종단 간 암호화를 구현하기 위해 중요한 조치를 취했습니다. </p> <h2 id=\"what-is-end-to-end-encryption\"> 종단 간 암호화 란 무엇입니까? </h2> <p> </p> <p> 종단 간 암호화는 <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> 통신을 암호화하는 방법 </a> 제 3자가 서로 메시지를주고받는 사람들간에 공유 된 정보에 액세스 할 수 없도록합니다. </p> <p> 종단 간 암호화를 사용하면 일반 텍스트가 아닌 비밀 코드를 사용하여 메시지 내용을 숨 깁니다. 즉, 암호화 된 종단 간 플랫폼에서 통신하는 사람 만 서로간에 전송되는 메시지를 읽을 수 있습니다. </p> <p> 세 가지 인기있는 보안 메시징 서비스 인 Signal, WhatsApp 및 Telegram이 어떻게 종단 간 암호화를 사용하는지 살펴 보겠습니다. </p> <p> </p> <h2 id=\"signal\"> 신호 </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signal은 가장 안전한 메시징 응용 프로그램 중 하나로 간주됩니다. 플랫폼의 모든 통신은 기본적으로 종단 간 암호화됩니다. </p> <p> Signal은 클라우드에 메시지를 백업하지 않으므로 정보를 획득하는 대체 방법을 사용하여 악의적 인 행위자의 위험을 줄일 수 있습니다. 또한 메시징 활동의 위치와 시간이 추적되지 않도록 메시지의 메타 데이터를 암호화합니다. </p> <p> 오픈 소스 암호화 엔진을 통해 대중은 메시징 활동 뒤에있는 기술에 대한 높은 수준의 투명성을 통해 이익을 얻습니다. 사용자는 개인 정보를 보호하는 데 사용되는 방법을 더 잘 이해하기 위해 기술적 세부 사항을 자세히 살펴볼 수 있습니다. </p> <p> 오픈 소스 플랫폼을 사용하면 장기적으로 소프트웨어를 훨씬 쉽고 안전하게 사용할 수 있습니다. 사람들은 소프트웨어의 작동 방식을 더 잘 이해할 수있을뿐만 아니라 고유 한 보안 요구 사항에 더 적합 할 수있는 자체 버전의 애플리케이션을 설정하려고 시도 할 수도 있습니다. </p> <p> Signal은 그룹 채팅에서 메시지를 종단 간 암호화 할 수 있도록하는 Multi-Party Off-the-Record Messaging이라고하는 OTR의 조합을 사용합니다. 네트워크 참여자가 증가함에 따라 데이터 침해의 위험이 증가 할 수 있습니다. 종단 간 암호화 된 그룹 채팅을 사용하면 이러한 위험이 크게 줄어 듭니다. </p> <p> </p> <h2 id=\"whatsapp\"> WhatsApp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp은 종단 간 암호화를 지원하는 최초의 인기 메시징 응용 프로그램 중 하나였습니다. 메시지와 통화에 종단 간 암호화를 사용합니다. </p> <p> WhatsApp은 Signal 메신저 팀인 Open Whisper Systems에서 개발 한 종단 간 암호화 프로토콜을 사용합니다. 이것은 Signal의 암호화 프로토콜이 얼마나 안전한지 고려할 때 응용 프로그램의 주요 장점입니다. </p> <p> </p> <p> WhatsApp이 자체 독점 배포를 사용한다는 것은 Signal의 완전한 오픈 소스 소프트웨어만큼 광범위한 보안 연구자들이 자주 검사하지 않을 수 있음을 의미합니다. </p> <p> 메시지 암호화에도 불구하고 메시지는 클라우드에 백업 될 수 있고 앱의 메타 데이터는 암호화되지 않기 때문에 WhatsApp에서 전송되는 메시지에 대해 자세히 알아 내기 위해 다른 방법을 사용할 수 있습니다. 이렇게하면 메시지의 시간과 위치를 더 쉽게 알 수 있습니다. 또한 Google 검색에 색인 된 WhatsApp 그룹 채팅에 대한 보고서가 공개되어 그룹 채팅의 보안에 의문을 제기했습니다. </p> <p> </p> <h2 id=\"telegram\"> 전보 </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegram은 암호화 및 자체 파괴 메시지 사용으로 사랑 받고 있습니다. 안타깝게도 Telegram에는 많은 사용자에게 그다지 분명하지 않은 여러 종단 간 암호화 문제가 있습니다. </p> <p> Telegram에서 종단 간 암호화는 기본적으로 활성화되지 않습니다. 사용자가 비밀 채팅으로 전환 할 때만 제공됩니다. 기술적 인 경향이없는 사용자에게는 인식하지 못할 수도있는 보안 위험이 있습니다. </p> <p> Telegram은 클라우드에 백업 된 서버에 저장된 메시지에 액세스 할 수 있습니다. 일부 사람들은 이것이 사이버 범죄자가 애플리케이션에서 메시징 데이터를 훔치려 고 시도하는 경우 개인 데이터 침해로 이어질 수있는 추가적인 공격 벡터를 제공한다고 생각합니다. </p> <p> 즉, Telegram의 모든 비밀 채팅은 장치별로 다르므로 비밀 채팅을 통해 보내는 메시지는 보낸 장치에서만 액세스 할 수 있습니다. </p> <p> Telegram의 비밀 채팅은 종단 간 암호화되지만 그룹 채팅은 암호화되지 않습니다. 이는 사용자가 동일한 그룹 채팅에 여러 장치를 사용할 수 있음을 의미합니다. 채팅 로그는 사용자가 여러 장치에 다운로드 할 수 있습니다. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> 비밀 채팅 <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #전보 </a> 메시지가 종단 간 암호화로 보호되고 일정 시간 후에 삭제됨을 의미합니다. <br><br> 이 기능을 활성화하는 방법은 다음과 같습니다. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> — Kaspersky (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 2021 년 1 월 31 일 </a></blockquote>  <p> Telegram은 일반 채팅과 비밀 채팅 모두에서 원격 서버에 링크 미리보기를 생성합니다. 사용자가 비밀 채팅에서 처음으로 링크를 입력하면 응용 프로그램은 링크가 원격 서버로 전송 될 것이라고 경고합니다. 이것은 개인 채팅에서 공유 된 링크를 원격 서버로 보내는 것이 종단 간 암호화의 목적에 위배되기 때문에 보안 취약점으로 간주됩니다. </p> <p> Telegram의 암호화 프로토콜 인 MTProto는 모바일 애플리케이션에서 서버 API에 액세스하도록 설계되었습니다. 독점적이며 부분적으로 만 오픈 소스입니다. 이것은 메시지를 보호하기 위해 사용되는 암호화 방법에 대해 대중이 얼마나 많은 통제와 이해를 가지고 있는지 의문을 제기합니다. </p> <p> 고맙게도 메시징 애플리케이션은 데이터 침해에 대한 심각한 주장에 직면하지 않았지만 운영자가 귀하의 메시지에 액세스 할 수 있다는 사실을 알고 있어야합니다. </p> <p> 우려에도 불구하고 많은 사람들은 메시지에 액세스하기 위해 건너 뛰어야하는 다양한 법적 후프에 대해 안심할 수 있습니다. Telegram은 사람들이 플랫폼에서 메시지에 액세스하는 것이 얼마나 어려운지를 과거에 분명히했습니다. 많은 사람들을 좌절시킬 다른 관할권에서 키에 액세스해야합니다. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> 가장 안전한 메시징 애플리케이션 선택 </h2> <p> Signal은 WhatsApp만큼 인기가 없지만 프로토콜은 종단 간 암호화를 통해 WhatsApp의 성공에 중요한 기여를했습니다. 종단 간 암호화 방법은 WhatsApp과 유사하지만 종단 간 암호화의 경우 WhatsApp보다 나은 것으로 간주됩니다. 사용자를 보호하기 위해 추가 조치를 취함으로써 차별화됩니다. </p> <p> 종단 간 암호화의 우선 순위를 지정하지 않기로 한 Telegram의 결정은 편의성을 선호했기 때문입니다. 암호화가 부족한 경우 클라우드 암호화로 사용자를 보호하고 다른 법적 관할권에서 키를 저장하는 간접적 인 방법으로 보완합니다. </p>"}