{"title":"Apple Fitness +로 걷는 시간을 사용하는 방법","content":"<p> Apple Fitness +는 Apple Watch의 힘을 활용하여 건강을 유지하는 좋은 방법을 제공하는 다양한 비디오 운동을 제공합니다. 그러나 서비스의 도보 시간 기능은 약간 다릅니다. </p> <p> 이 기능은 화면 앞에서는 대신 영향력 있고 개성있는 스타들의 의미있는 사진을 보면서 산책을하고 이야기를들을 수 있도록합니다. 아래에서 기능과 시작하는 데 필요한 사항에 대해 자세히 설명합니다. </p> <h2 id=\"what-is-time-to-walk\"> 걸을 시간은 무엇입니까? </h2> <p> <img alt=\"Draymond Green Time to walk\" src=\"images/draymond-green-time-to-walk-1-269.jpg\" loading=\"lazy\"> </p> <p> Time to Walk를 유명인 및 기타 영향력있는 이름과 함께하는 독특한 팟 캐스트와 같은 경험으로 생각하십시오. 일부 에피소드에는 컨트리 음악의 전설 Dolly Parton, NBA 스타 Draymond Green, 뮤지션 Sean Mendes, Emmy 상 수상자 Uzo Aduba가 포함됩니다. </p> <p> 25 ~ 40 분 분량의 에피소드에서 게스트는 개인적인 삶을 형성하는 순간에 대해 이야기합니다. Apple Watch의 화면에서 이야기를 전달하는 데 도움이되는 사진을 볼 수도 있습니다. 이야기가 끝나면 게스트가 선택한 의미있는 노래의 이야기 재생 목록을 듣게됩니다. </p> <p> </p> <p> </p> <h2 id=\"getting-started-with-time-to-walk\"> 걸을 시간 시작하기 </h2> <p> Time to Walk에 액세스하려면 Apple Fitness +를 구독해야합니다. 또한 Apple Watch Series 3 이상 및 Apple의 AirPod와 같은 Bluetooth 헤드폰이 필요합니다. </p> <p> 좋은 소식은 Time to Walk 에피소드를 다운로드하기 위해 아무것도 할 필요가 없다는 것입니다. Apple Watch가 충전 중이고 Wi-Fi에 연결되어 있으면 최신 에피소드 5 개가 자동으로 시계에 다운로드됩니다. </p> <p> 참고로 시계의 무료 저장 용량은 사용 가능한 에피소드 수에 영향을 미칠 수 있습니다. 에피소드를 들으면 시계가 자동으로 삭제합니다. 그런 다음 새로운 에피소드가 대신합니다. </p> <p> iPhone을 사용하여 특정 Time to Walk 에피소드를 다운로드 할 수도 있습니다. 머리 <strong> 적합 </strong> 앱을 선택하고 <strong> 피트니스 + </strong> 탭. 에서 <strong> 걷는 시간 </strong> 섹션, 선택 <strong> 모두 표시 </strong> . 여기에서 사용 가능한 모든 에피소드를 볼 수 있습니다. </p> <p> 에피소드를 탭하면 예상 할 내용과 재생 목록의 노래에 대한 자세한 정보를 볼 수 있습니다. 해당 페이지에서 <strong> 더하다 </strong> 버튼을 눌러 에피소드를 시계에 다운로드합니다. 에피소드가 이미 시계에 다운로드 된 경우 다음과 같이 표시됩니다. <strong> 다운로드 됨 </strong> 체크 표시를합니다. </p> <p> <strong class=\"gallery__section-title\"> 이미지 갤러리 (3 이미지) </strong> <img alt=\"Apple Activity App\" src=\"images/apple-activity-app-625.jpg\" loading=\"lazy\"> 넓히다 <img alt=\"Apple Fitness+ Time to Walk\" src=\"images/apple-fitness-time-to-walk-841.jpg\" loading=\"lazy\"> 넓히다 <img alt=\"Time to Walk Episode\" src=\"images/time-to-walk-episode-915.jpg\" loading=\"lazy\"> 넓히다 </p> <p> 닫기 </p> <p> 셀룰러 지원 Apple Watch가있는 경우 근처에 iPhone이 없어도 에피소드를 스트리밍 할 수 있으므로 에피소드를 다운로드해야하는 것에 대해 걱정할 필요가 없습니다. </p> <p> </p> <p> 산책 할 준비가되면 Apple Watch를 엽니 다. <strong> 연습 </strong> 앱. 탭 <strong> 걷는 시간 </strong> 시작할 에피소드. Apple Watch의 GPS를 사용하여 움직임이 감지되면 운동은 야외 걷기로 기록됩니다. 그렇지 않은 경우 운동은 실내 걷기로 계산됩니다. </p> <p> <img alt=\"Apple Watch Time to Walk \" src=\"images/apple-watch-time-to-walk-217.jpg\" loading=\"lazy\"> </p> <p> 걷는 동안 왼쪽으로 스 와이프하여 시계 화면을 잠 그거나 운동을 일시 중지하거나 운동을 종료합니다. 오른쪽으로 스 와이프하면 미디어 컨트롤이 나타나고 오디오를 일시 중지하거나 에피소드에서 앞뒤로 건너 뛰거나 재생 목록 노래 사이를 이동할 수 있습니다. </p> <p> Time to Walk 에피소드를 수동으로 삭제하려면 Apple Watch에서 Workout 앱을 열고 <strong> 나는 </strong> 유명인 이름 근처의 아이콘. 아래쪽으로 스크롤 한 다음 <strong> 없애다 </strong> . </p> <p> </p> <h2 id=\"making-exercise-even-better-with-time-to-walk\"> 걸을 시간에 더 나은 운동 만들기 </h2> <p> 걷기는 누구나 필요한 운동을 할 수있는 가장 쉽고 인기있는 방법 중 하나입니다. Time to Walk는 산책하는 동안 동기를 부여하는 독특한 방법을 제공합니다. </p> <p> 장거리 산책을위한 충분한 주스를 확보하려면 Apple Watch의 배터리 수명을 보존하는 데 도움이되는 팁을 따르십시오. </p>"}