{"title":"HBO Max, 6 월 중남미 출시 예정","content":"<p> WarnerMedia의 스트리밍 서비스 인 HBO Max는 2021 년 6 월 중남미와 카리브해 전역에서 출시됩니다. 미국 이외 지역에서 서비스를 사용할 수있는 것은 이번이 처음입니다. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> HBO Max는 라틴 아메리카에서 어디로 출시됩니까? </h2> <p> 현재 HBO Max는 미국에서만 사용할 수 있습니다. 2021 년 6 월 말부터 라틴 아메리카와 카리브해 전역의 많은 국가에서 사용할 수 있습니다. 뉴스는 <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> WarnerMedia 보도 자료 </a> . </p> <p> 구체적으로 이러한 국가는 앵 귈라, 안티구아, 아르헨티나, 아루바, 영국령 버진 제도, 바하마, 바베이도스, 벨리즈, 볼리비아, 브라질, 케이맨 제도, 칠레, 콜롬비아, 코스타리카, 큐라 소, 도미니카, 도미니카 공화국, 에콰도르, 엘살바도르입니다. , 그레나다, 과테말라, 가이아나, 아이티, 온두라스, 자메이카, 멕시코, 몬세 라트, 니카라과, 파나마, 파라과이, 페루, 세인트 키츠 네비스, 세인트 루시아, 세인트 빈센트, 수리남, 트리니다드 토바고, 터크 스케이 커스, 우루과이 , 그리고 베네수엘라. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> HBO Max는 라틴 아메리카에서 무엇을 제공합니까? </h2> <p> </p> <p> 직접 또는 &quot;적격 파트너&quot;를 통해 지불하는 기존 HBO GO 가입자는 HBO Max에 즉시 액세스 할 수 있습니다. 그런 다음 HBO GO는 지역 전체에서 단계적으로 중단됩니다. </p> <p> 가격 세부 정보는 발표되지 않았지만 다음 달에 새로운 콘텐츠 및 프로모션 제안에 대한 정보와 함께 약속됩니다. </p> <p> 미국에서와 마찬가지로 HBO Max는 다양한 구독 패키지를 제공하고 스마트 폰, 태블릿 및 기타 스마트 플랫폼과 같은 장치를 지원합니다. </p> <p> </p> <p> 뉴스를 알리는 예고편에서 The Matrix 및 Casablanca와 같은 영화와 함께 Game of Thrones and Friends와 같은 시리즈의 클립을 볼 수 있습니다. 그러나 끝에 &quot;일부 타이틀을 출시 할 때 사용할 수있는 것은 아님&quot;을 경고하는 작은 메시지가 나타납니다. </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> HBO Max는 언제 전 세계적으로 제공됩니까? </h2> <p> 작년에 Warner Bros.는 2021 년 극장판 전체를 HBO Max에 공개 할 계획이라고 논란의 여지가 있습니다. 감독을 일으켰다 <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Christopher Nolan, HBO Max &quot;최악의 스트리밍 서비스&quot;브랜드화 </a> . </p> <p> 그럼에도 불구하고 영화 산업의 일부는 신음 할 수 있지만 소비자에게는 훌륭한 선택권입니다. </p> <p> 따라서 라틴 아메리카와 카리브해 지역의 사람들은 거래가 그들에게도 적용되기를 바라면서 HBO Max의 출시에 흥분 할 것입니다. </p> <p> 나머지 세계는? 확정 날짜는 정해지지 않았지만 WarnerMedia는 북유럽, 스페인, 중부 유럽 및 포르투갈이 올해 말 HBO Max로 업그레이드 될 예정이라고 밝혔다. </p> <p> HBO Max International의 책임자 인 Johannes Larcher는 다음과 같이 말했습니다. </p> <blockquote> <p> WarnerMedia의 Direct-to-Consumer 서비스를 미국 외 지역 및 전 세계 소비자에게 제공하는 첫 번째 단계 인 라틴 아메리카 및 카리브해 지역에서 HBO Max를 출시하게되어 매우 기쁩니다. </p> </blockquote>"}