{"title":"PS5를 수직에서 수평으로 (또는 그 반대로) 바꾸는 방법","content":"<p> PlayStation 5는 수직 또는 수평 설정으로 작동합니다. 선호하는 방향으로 마음이 바뀌면 PS5를 수직에서 수평으로 (또는 그 반대로) 쉽게 이동할 수 있습니다. </p> <p> PS5를 수직 방향에서 수평 방향으로 안전하게 이동하고 다시 뒤로 이동하는 방법을 살펴 보겠습니다. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> 첫째 : PS5를 종료하고 플러그를 뽑습니다. </h2> <p> PlayStation 5를 물리적으로 이동하기 전에 모든 작업을 종료하고 모든 플러그를 뽑는 것이 중요합니다. 이렇게하면 전원이 켜져있는 동안 이동할 때 발생할 수있는 시스템 손상을 방지 할 수 있습니다. </p> <p> PS5를 완전히 꺼야합니다. 이렇게하려면 <strong> PS 버튼 </strong> 컨트롤러에서 화면 하단에 빠른 메뉴를 불러옵니다. 고르다 <strong> 힘 </strong> 오른쪽에서 <strong> PS5 끄기 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> 본체의 표시등이 꺼질 때까지 기다린 다음 전원 케이블, HDMI 케이블 및 시스템에 연결된 다른 모든 것을 분리합니다. 이제 PS5의 방향을 변경할 준비가되었습니다. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> 스탠드 나사 제거 </h2> <p> PS5를 수직으로 설치할 때, 포함 된 나사를베이스의 구획에서 꺼내 수직으로 놓을 때 콘솔에베이스를 고정하는 데 사용해야했습니다. 결과적으로이 나사를 제거하는 것은 본체의 방향을 변경하는 첫 번째 단계입니다. </p> <p> PS5를 옆으로 살짝 뒤집어 바닥에있는 스탠드에 접근 할 수 있습니다. 일자 드라이버, 동전 등을 사용하여베이스를 시스템에 고정하는 은색 나사 1 개를 제거합니다. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> 나사가 풀리면베이스가 풀립니다. 나사를 보관할 수있는 바닥에 작은 구획이 있습니다. 제자리에 끼워 넣은 다음 작은 구멍에 밀어 넣어 고정합니다. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> 또한이 칸에는 작은 검은 색 스토퍼가 있습니다 (초기 설정시 거기에 두는 한). 이 스토퍼를 제거하고 나사를 빼낸 PS5 바닥의 구멍을 막는 데 사용합니다. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> 베이스 회전 </h2> <p> 이제 수평 방향으로 콘솔에 맞도록베이스를 회전해야합니다. 이렇게하면 나사를 넣은 작은 구획도 닫히고 고정됩니다. </p> <p> 베이스를 위에서 볼 때 (방금 나사를 보관 한 위치와 반대) 회전해야합니다. 스탠드의 올려 진 부분을 &quot;북쪽&quot;으로 취급하는 경우 아래 그림과 같이 스탠드의 바깥 쪽 부분을 &quot;북서쪽&quot;으로 회전해야합니다. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> 이것은 스탠드를 수평으로 사용하기위한 올바른 방향입니다. 올바른 위치에 있으면 딸깍 소리가 나고 부드럽게 멈 춥니 다. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> 수평 위치로 스탠드 부착 </h2> <p> 이제 PS5를 수평으로 놓은 상태에서 스탠드를 부착 할 수 있습니다. 시스템이 올바른 방향으로 놓여 있는지 확인하십시오 .-- PS 로고가 위를 향해야합니다. </p> <p> 시스템 뒷면의 두 개의 USB 포트 아래 및 그 근처에서 콘솔에 일부 PlayStation 컨트롤러 기호가 각인되어 있습니다. (방금 회전 한)베이스의 바깥 쪽 암을이 패턴이 양쪽에서 끝나는 시스템 주변으로 밀어 넣습니다. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> 클립을 눌러 고정하되이 위치에서는 스탠드가 제자리에 완전히 고정되지 않는다는 점에 유의하십시오 (수직으로 배치 할 때 나사를 사용하는 것과 같음). 시스템을 내려 놓을 때 조심하고 스탠드를 잡아 당기면 스탠드가 미끄러질 수 있습니다. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> 이제 PS5를 가로 방향으로 사용하도록 설정되었습니다. 모든 케이블을 다시 연결하고 다시 시작하여 재생으로 돌아갑니다. 표준 PS5를 사용하는 경우이 방향으로 앞면이 위로 오도록 디스크를 삽입합니다. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> PS5 뒷면을 수평에서 수직으로 변경하는 방법 </h2> <p> PS5의 수직 방향으로 돌아가고 싶습니까? 아니면 처음에 PS5를 수평 형태로 설정했고 지금 수직으로 가고 싶습니까? 어느 쪽이든 위의 과정을 역순으로 진행하는 것은 쉽습니다. PS5가 현재 켜져 있거나 휴지 모드에있는 경우 먼저 PS5를 종료하고 플러그를 뽑아야합니다. </p> <p> </p> <p> 수직 방향으로 바꾸려면 먼저 PS5를 들어 올리고 시스템에서 스탠드를 조심스럽게 당겨 제거합니다. 다음으로베이스의 바깥 쪽 팔을 회전시켜야합니다. 위에서 볼 때 팔은 볼록한 부분과 나란히 &quot;북쪽&quot;이어야합니다. 부드러운 딸깍 소리가 나는지 확인하여 올바른 위치에 있는지 확인하십시오. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> 바닥에 접근 할 수 있도록 PS5를 배치 한 다음 통풍구의 대략 중앙에있는 가운데 구멍에서 검은 색 스토퍼를 제거하십시오. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> 이 검은 색 스토퍼를베이스 밑면에있는 구획의 작은 구멍 안에 넣습니다. 스토퍼가 제자리에 딱 맞아야합니다. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> 다음으로,베이스의 동일한 구획에서 나사를 제거합니다. 이제 적절한 위치에 스탠드를 부착해야합니다. 이렇게하려면 아래 그림과 같이 본체 뒷면이 위를 향하도록 PS5를 세우십시오. </p> <p> 스탠드를 잡고 나사 구멍이 방금 스토퍼를 제거한 나사 구멍과 일직선이되도록 놓습니다. 전원 커넥터 아래의 시스템 후면에있는베이스 암에 클립을 배치합니다. 스탠드는 쉽게 정렬되어야합니다. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> 이제 드라이버 또는 유사한 것을 사용하여 나사를 조입니다. 작업을 마치고 스탠드가 단단히 부착 된 느낌을 받으면 PS5를 세로로 사용할 수 있습니다. 모든 케이블을 다시 연결하여 작업을 완료하십시오. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> PS5를 수직 또는 수평으로 세워야합니까? </h2> <p> 소니는 PS5의 수직 및 수평 사용을 지원하므로 시스템에 충분한 공기 흐름이 유지되는 한 옳고 그른 방법이 없습니다. 사용해야하는 방향은 필요에 따라 다릅니다. </p> <p> </p> <p> 공간이 많고 PS5가 수평 공간을 많이 차지하는 것을 신경 쓰지 않는다면 수평 모양이 매끄 럽습니다. 표준 모델 PS5를 사용하는 경우 레이블이 항상 위를 향해야하므로 디스크 삽입 프로세스가 조금 더 쉬워집니다. 디스크 레이블이 왼쪽을 향해야하는 세로 방향에서는 기억하기가 조금 더 어렵습니다. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> 그러나 수평 설치를 수용 할 수있는 엔터테인먼트 시스템 내부에 공간이 없을 수 있습니다. 이러한 경우 수직으로 이동하는 것이 최선의 방법입니다. PS5는 어느 쪽이든 거대한 콘솔이지만 수직으로 배치하면 TV 스탠드 또는 이와 유사한 옆에 멋지게 배치됩니다. 이것은 아래 이미지와 같이 내가 사용하는 설정입니다. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> PS5에서 어떤 방향을 선택하든 스탠드를 사용해야합니다. 시스템이지면에 닿지 않게하여 공기 흐름을 개선합니다. 스탠드는 또한 PS5를 고정하므로 넘어져서 손상 될 가능성이 있습니다. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> PS5를 설정하고 플레이하기 </h2> <p> 이제 PS5를 수직에서 수평으로 바꾸고 몇 분만에 다시 바꾸는 방법을 알게되었습니다. 시스템이 설정되면 실행하고 PS5 최고의 타이틀 중 일부를 즐기십시오. </p> <p> 거의 모든 PS4 라이브러리가 PS5에서도 작동하므로 더 많은 것을 즐길 수 있습니다. </p> <p> <small> 이미지 크레딧 : Alex Van Aken / <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}