{"title":"Surface Pro 태블릿에서 스크린 샷을 찍는 방법","content":"<p> 스크린 샷을 찍는 것은 모든 기기에서 간단하지만 필수적인 기술입니다. Surface Pro 태블릿에서는 바로 가기 키, 캡처 ​​도구 또는 Xbox Game Bar를 사용하여 스크린 샷을 찍을 수 있습니다. 이러한 모든 방법을 활용하여 Surface 장치에서 스크린 샷 또는 화면 녹화를 찍는 방법을 보여 드리겠습니다. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> 버튼 조합을 사용하여 스크린 샷 찍기 </h2> <p> Surface Pro 장치 제품군에서는 버튼 조합을 사용하여 스크린 샷을 찍는 것이 빠르고 쉽습니다. 스크린 샷을 찍으려면 <strong> 힘 </strong> 과 <strong> 볼륨 업 </strong> 동시에 키. 화면이 깜박이고 스크린 샷이 장치의 사진 아래에있는 스크린 샷 폴더에 저장되어야합니다. </p> <p> 이 방법은 최신 Surface Pro 장치 제품군 (예 : Surface Pro 7+, Pro X), Surface Go, Surface Go 2 및 Surface Book 장치 제품군에서 작동합니다. </p> <p> Surface가 이전 모델 (Surface 3 이상) 인 경우 버튼 조합이 약간 다릅니다. 당신은 눌러야 <strong> Windows 버튼 </strong> (키보드의 Windows 키가 아님) 및 <strong> 볼륨 작게 </strong> 버튼을 동시에 누릅니다. 장치는 사진 아래의 스크린 샷 폴더에 스크린 샷을 저장합니다. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> 마찬가지로 Surface Duo에서 스크린 샷을 찍으려면 <strong> 힘 </strong> 버튼과 <strong> 볼륨 작게 </strong> 키. 스크린 샷은 스크린 샷 아래 장치의 갤러리에 저장되어야합니다. 또는 <strong> 힘 </strong> 키를 누르고 <strong> 스크린 샷 </strong> 화면의 버튼. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> 바로 가기 키를 사용하여 Surface Pro 스크린 샷을 찍는 방법 </h2> <p> 키보드 단축키는 화면에있는 내용을 캡처 할 수있는 또 다른 방법입니다. </p> <p> 이러한 키보드 단축키는 모든 Windows 장치에서 작동하므로 <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10의 다른 스크린 샷 방법 </a> . 바로 가기 키는 Surface Laptop 및 Surface Book 장치 제품군에서 가장 잘 작동하지만 물론 Surface Pro 또는 Go 장치 용 키보드 연결이있는 경우 이러한 바로 가기도 작동합니다. </p> <h3 id=\"print-screen-methods\"> 화면 인쇄 방법 </h3> <p> 화면 인쇄 방법을 사용하여 스크린 샷을 찍으려면 <strong> PrtScn </strong> 키보드의 버튼. 전체 데스크톱의 스크린 샷이 찍 힙니다. 이렇게하면 스크린 샷이 Surface에 저장되지 않고 클립 보드에 추가됩니다. 스크린 샷을 붙여 넣으려면 Microsoft Paint와 같은 프로그램을 사용해야합니다. </p> <p> 누르기 <strong> Alt + PrtScn </strong> 현재 창의 스크린 샷 만 찍고 마찬가지로 클립 보드에 스크린 샷을 추가합니다. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> 캡처 및 스케치 </h3> <p> 이것은 Surface 장치에서 스크린 샷을 찍는 가장 쉬운 방법입니다. </p> <p> 캡처 및 스케치를 열려면 <strong> Windows 키 + Shift + S, </strong> 화면에 오버레이가 나타납니다. 전체 스크린 샷을 찍으려면 오버레이 상단의 전체 화면 버튼을 누르십시오. 현재 창의 스크린 샷을 찍으려면 전체 화면 버튼 옆에있는 창 캡처 버튼을 누릅니다. </p> <p> 화면의 특정 영역에 대한 스크린 샷을 찍을 수도 있습니다. 기본적으로 Snip 및 Sketch에는 직사각형 Snip이 있습니다. 터치 스크린이나 트랙 패드를 사용하여 스크린 샷을 찍으려는 부분 위로 드래그하기 만하면됩니다. </p> <p> Snip and Sketch는 스크린 샷이 클립 보드에 복사되었다는 알림을 알림 패널에 표시합니다. 클릭하면 원하는 경우 스크린 샷 위에 그리고 스케치 할 수 있습니다. </p> <p> 파일에 저장하려면 <strong> Ctrl + S </strong> 또는 오른쪽 상단의 저장 버튼을 눌러 스크린 샷을 특정 폴더에 저장합니다. </p> <h3 id=\"xbox-game-bar\"> Xbox 게임 바 </h3> <p> Xbox Game Bar를 사용하여 스크린 샷을 찍으려면 <strong> Windows 키 + G </strong> 그것을 엽니 다. </p> <p> 여기에서 캡처 탭을 클릭하고 카메라 버튼을 클릭 할 수 있습니다. 이 방법을 사용하면 오디오와 함께 화면을 비디오로 캡처 할 수도 있습니다. 저장된 캡처는 비디오 폴더 및 캡처 하위 폴더 아래에 나타납니다. Xbox에서도 유사하게 <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> 화면 캡처 및 녹음 캡처 </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Surface 펜을 사용하여 Surface Pro 스크린 샷 찍기 </h2> <p> Surface 펜을 사용하여 스크린 샷을 찍으려면 지우개를 두 번 클릭하면 장치에 전체 창의 캡처 및 스케치가 표시됩니다. 여기에서 스크린 샷을 스케치하고 내보낼 수 있습니다. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> 도크에서 Windows Ink 작업 영역을 검색하여 액세스 할 수도 있습니다. 여기에서 전체 화면 캡처를 선택합니다. Windows Ink 작업 영역 설정을 검색하고 Windows Ink 작업 영역으로 스크롤하여 Surface 펜의 단추 바로 가기가 수행하는 작업을 변경할 수 있습니다. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> 간단하게 Surface에서 스크린 샷 찍기 </h2> <p> 이제 Surface 장치에서 스크린 샷을 찍거나 화면을 기록하는 다양한 방법을 모두 알게되었습니다. 버튼 조합은 Surface Pro 또는 Surface Go를 사용하는 경우 스크린 샷을 찍는 가장 좋은 촉각 방법이지만 키보드 단축키도 쉽습니다. </p>"}