{"title":"JPG 대 JPEG :이 이미지 파일 형식의 차이점은 무엇입니까?","content":"<p> 모든 이미지 파일 형식이 동일하지는 않습니다. 실제로 이미 존재하는 형식으로는 해결할 수없는 문제를 해결하기 위해 많은 것들이 만들어졌습니다. 예를 들어 JPEG는 이미지 파일 크기가 너무 많은 저장 공간을 차지하기 때문에 발생했습니다. </p> <p> 믿거 나 말거나 JIF, JPEG 및 JPG 파일 확장자는 거의 동일한 것을 나타냅니다. 파일 형식에 왜 그렇게 많은 이름이 있는지 이해하려면 복잡한 역사를 조금 풀어야합니다. </p> <h2 id=\"what-is-a-jpeg\"> JPEG 란 무엇입니까? </h2> <p> JPEG 약어는 JIF (JPEG Interchange Format) 표준을 만드는 데 도움을 준 소위원회의 이름을 따서 명명 된 Joint Photographic Experts Group의 약자입니다. ISO (International Organization for Standardization)에서 1992 년에 처음 발행했습니다. </p> <p> JPEG는 RGB 색상 모델의 각 채널에 8 비트가있는 24 비트 스틸 래스터 이미지입니다. 이것은 알파 채널을위한 공간을 남기지 않습니다. 즉, JPEG는 1600 만 개 이상의 색상을 지원할 수 있지만 투명도는 지원할 수 없습니다. </p> <p> 이미지가 JPEG로 저장되면 손실이라고하는 프로세스에서 일부 데이터가 삭제됩니다. <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> 파일 압축 </a> . 결과적으로 이미지는 이미지 품질의 손실이 거의 또는 전혀없이 BMP와 같은 이전 형식에 비해 저장 공간을 50-75 % 적게 차지합니다. </p> <p> JPEG 압축은 1972 년 전기 엔지니어 Nasir Ahmed가 처음 제안한 DCT (discrete cosine transform)라는 손실 이미지 압축 기술을 기반으로합니다. </p> <h3 id=\"what-is-a-jif\"> JIF 란 무엇입니까? </h3> <p> JIF 파일은 &quot;가장 순수한&quot;형태의 JPEG라고 생각할 수 있습니다. 그러나이 형식은 일부 실망스러운 한계를 제시했기 때문에 더 이상 많이 사용되지 않습니다. 예를 들어, JIF의 색상 및 픽셀 측면 정의로 인해 인코더와 디코더 (뷰어)간에 호환성 문제가 발생했습니다. </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> 고맙게도 이러한 문제는 나중에 JIF를 기반으로 구축 된 다른 &#39;보충&#39;표준으로 해결되었습니다. 그 중 첫 번째는 JPEG 파일 교환 형식 (JFIF)이었고 나중에는 <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> 교환 가능한 이미지 파일 형식 </a> (Exif) 및 ICC 색상 프로파일. </p> <p> JPEG / JFIF는 현재 인터넷에서 사진 이미지를 저장하고 전송하는 데 가장 많이 사용되는 형식이고 JPEG / Exif는 디지털 카메라 및 기타 이미지 캡처 기기 용 형식입니다. 대부분의 사람들은 이러한 변형의 차이점을 구별하지 않고 단순히 둘 다 JPEG로만 언급합니다. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> JPG2 또는 JPF 란 무엇입니까? </h3> <p> 2000 년에 JPEG 그룹은 JPEG 2000이라는 또 다른 이미지 파일 형식을 출시했습니다 (파일 확장자는 JPG2 및 JPF). JPEG의 후속 제품 이었지만, 그다지 인기가 없었습니다. 고급 인코딩 방법이 종종 더 나은 품질의 이미지로 이어 졌을 때에도. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> 이미지 크레딧 : Dake / <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> 위키 미디어 커먼즈 </a> </p> <p> JPEG 2000 파일 형식은 몇 가지 이유로 실패했습니다. 하나는 완전히 새로운 코드를 기반으로했기 때문에 JPEG와 역 호환되지 않았습니다. 게다가 JPEG 2000 파일을 처리하려면 처리하는 데 더 많은 메모리가 필요했는데, 그 당시에는 약간의 문제가있었습니다. 결국 당시 평균 컴퓨터의 메모리는 64MB에 불과했습니다. </p> <p> JPEG 2000은 일반적으로 컴퓨터 하드웨어가 지난 20 년 동안 크게 향상되었지만 파일 형식은 여전히 ​​많이 사용되지 않고 있습니다. 작성 당시 JPEG 2000 파일을 지원하는 유일한 인터넷 브라우저는 Safari입니다. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG와 JPG </h3> <p> 초기 버전의 Windows (특히 MS-DOS 8.3 및 FAT-16 파일 시스템)는 파일 확장명의 길이와 관련하여 최대 3 자로 제한되었습니다. 제한을 초과하지 않도록 JPEG를 JPG로 줄여야했습니다. Mac과 Linux 컴퓨터에는 그런 것이 없었으므로 사용자는 계속해서 이미지를 JPEG로 저장합니다. </p> <p> </p> <p> Photoshop과 같은 다양한 운영 체제에서 작동하는 인기있는 이미지 편집 프로그램 <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> 단 </a> -혼동을 최소화하기 위해 결국 기본 JPEG 파일 확장자를 JPG로 설정합니다. </p> <p> 이것이 바로 JPEG와 JPG라는 동일한 형식에 대해 두 개의 파일 확장자를 갖게 된 방법입니다. 이미지를 저장할 대상을 선택할 때 차이가 없습니다. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG vs. PNG : 어떤 것이 더 낫습니까? </h2> <p> </p> <p> JPEG와 PNG는 같은 10 년 내에 출시되었으며, 각 파일 형식은 당시 기술 세계가 직면했던 다른 디지털 이미지 문제를 해결했습니다. 지속적으로 비교되는 것은 당연하다고 말할 수 있습니다. 그리고 오늘날에도 그렇습니다. JPEG와 PNG 중 어떤 이미지 파일 형식이 가장 우월합니까? </p> <p> 솔직히 대답은 저장하는 이미지의 종류에 따라 다릅니다. </p> <p> JPEG는 손실 압축을 사용하여 적절한 파일 크기를 유지하기 때문에 사진에 더 적합합니다. 사진은 매우 크고 섬세한 이미지이므로 압축 아티팩트 (압축으로 인한 미묘한 이미지 왜곡)가 눈에 잘 띄지 않습니다. </p> <p> 반면에 점이 선명하고 가장자리가 선명하며 한 가지 색상의 넓은 영역 (예 : 벡터 로고, 픽셀 아트 등)이있는 이미지는 JPEG로 저장하면 제대로 보이지 않습니다. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> 이미지 크레딧 : Axel Grimard / <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> 위키 미디어 커먼즈 </a> </p> <p> PNG (Portable Network Graphics) 파일이 여기에 들어올 수 있습니다. PNG 개발 그룹에서 JPEG 출시 4 년 후 개발 한 PNG는 무손실 데이터 압축 및 투명성을 지원합니다. PNG는 이미지 품질을 유지해야하고 파일 크기가 문제가되지 않는 경우에 자주 사용됩니다. </p> <p> 경험상 좋은 규칙은 사진에 JPEG를 유지하고 투명하고 사진이 아닌 이미지의 경우 PNG를 저장하는 것입니다. 이미지뿐만 아니라 다양한 유형의 파일에 대한 자세한 내용은 다음 가이드를 확인하세요. <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> 언제 어떤 파일 형식을 사용할지 알 수 있습니다. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG와 JPG는 동일한 파일 형식입니다. </h2> <p> 많은 업데이트 및 변형으로 인해 JPEG가 야기한 혼란에도 불구하고 90 년대 중반 인터넷에서 디지털 이미지의 홍수는 의심 할 여지없이 주로 출시로 인해 발생했습니다. </p> <p> 다음에 이미지 편집기에서 사진을 내보낼 준비가되고 사용 가능한 형식의 긴 목록이 표시되면 JPEG와 JPG는 하나이며 동일하다는 점을 기억하십시오. </p>"}