{"title":"LastPass는 지불하지 않는 한 하나의 장치 유형으로 제한합니다","content":"<p> 인기있는 암호 관리자 인 LastPass가 큰 변화를 겪고 있습니다. 머지 않아 무료로 서비스를 사용하는 사람들은 컴퓨터 나 모바일에서만 사용할 수 있지만 둘 다 지불 할 수는 없습니다. </p> <p> 이는 LastPass가 더 이상 무료 암호 관리자로서 매력적인 선택이 아니라는 것을 의미합니다. 컴퓨터와 모바일 사이를 끊임없이 전환하는 세상에서 하나의 장치 유형에만 작동하는 암호 관리자를 갖는 것은 쓸모가 없습니다. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> LastPass Free에서 변경되는 사항은 무엇입니까? </h2> <p> 에 발표 된대로 <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> LastPass 블로그 </a> , 암호 관리자의 무료 버전에 대한 변경 사항이 진행 중입니다. </p> <p> 현재 LastPass Free를 사용하면 모든 장치에서 서비스를 사용할 수 있습니다. 컴퓨터, 태블릿 또는 모바일에서 LastPass를 사용하든 상관 없습니다. 모두 무료입니다. 이는 2021 년 3 월 16 일에 변경 될 예정입니다. </p> <p> 그때부터 LastPass Free에는 컴퓨터 또는 모바일의 한 가지 유형의 무제한 장치 만 포함됩니다. </p> <p> LastPass의 경우 컴퓨터는 데스크톱 또는 랩톱으로 분류되는 반면 모바일은 휴대폰, 태블릿 및 스마트 워치입니다. </p> <p> 3 월 16 일에 LastPass에 처음 로그인 할 때 활성 장치 유형을 설정해야합니다. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> 예를 들어, 장치 유형으로 컴퓨터를 선택하면 데스크톱 및 노트북 장치에서 LastPass를 사용할 수 있습니다. 그러나 모든 모바일 장치에서 LastPass를 사용하려면 LastPass Premium으로 업그레이드해야합니다. </p> <p> 어떤 의미에서 이것은 이전의 LastPass로 되돌아갑니다. LastPass를 데스크톱과 모바일에서 무료로 사용할 수 있다는 것은 2015 년에만 가능해졌습니다. 그 전에는 모바일 지원 비용을 지불해야했습니다. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> LastPass 지원도 변경됩니다 </h2> <p> LastPass는 지원을 제공하는 방법도 변경하고 있습니다. 2021 년 5 월 17 일부터 이메일 지원은 Premium 및 Family 고객에게만 제공됩니다. </p> <p> 무료 사용자는 LastPass 지원 웹 사이트에서 제공되는 도움말 기사에 갇히거나 LastPass 커뮤니티 내에서 도움을 요청할 수 있습니다. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> 누구나 비밀번호 관리자를 사용해야합니다. </a> . 데스크톱과 모바일에서 사용해야 할 가능성이 있습니다. LastPass는이를 알고 있으며 현재 연간 27 달러에 25 % 할인 된 유료 서비스로 업그레이드하는 사용자를 대상으로합니다. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> 암호 관리자를 변경할 때입니까? </h2> <p> LastPass Free를 사용하는 경우 전환을 고려할 가능성이 있습니다. 그렇다면 모든 장치에서 무료로 사용할 수있는 다른 훌륭한 암호 관리자가 많이 있습니다. </p> <p> 다시 말하지만, LastPass가 제공하는 서비스를 지원하기 위해 적은 금액을 LastPass에 지불하는 것이 공정하다고 생각할 수 있습니다. </p>"}