{"title":"최신 WatchOS 업데이트는 Apple Watch-Bricking 버그로부터 방어","content":"<p> Apple의 최신 watchOS 업데이트 인 소프트웨어 버전 7.3.1에는 매우 중요한 수정 사항이 포함되어 있습니다. 일부 Apple Watch Series 5 및 Apple Watch SE 기기가 절전 모드로 전환 될 때 충전되지 않도록하는 버그를 해결합니다. </p> <p> 이 회사는 또한이 저전력 모드에 갇혀 빠져 나갈 수없는 영향을받는 기기에 대한 새로운 무료 수리 프로그램을 시작했습니다. 이 버그는 본질적으로 Apple Watch를 &quot;벽돌&quot;로 만들어 더 이상 작동하지 않게합니다. </p> <h2 id=\"the-power-reserve-mode-bug\"> 파워 리저브 모드 버그 </h2> <p> Power Reserve 모드는 Apple Watch의 배터리가 부족할 때 시작됩니다. Apple Watch가 iPhone과 통신하는 것을 중지합니다. 또한 사용자가 Apple Watch의 다른 기능에 액세스하는 것을 차단합니다. 절전 모드를 종료하려면 사용자가 Apple Watch를 충전해야합니다. </p> <p> 에 <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> 버그 및 수리 프로그램에 대한 지원 페이지 </a> , 2 월 15 일자 Apple은 다음과 같은 사항에 주목합니다. </p> <blockquote> <p> watchOS 7.2 또는 7.3을 실행하는 Apple Watch Series 5 또는 Apple Watch SE 모델을 사용하는 극소수의 고객은 시계가 Power Reserve에 들어간 후 충전되지 않는 문제를 경험했습니다. </p> </blockquote> <p> 영향을받는 Apple Watch 모델이 있는지 확인하려면 Apple Watch를 충전기에 놓고 최소 30 분 동안 기다리도록 권장합니다. 요금이 청구되지 않는 경우 Apple 지원에 문의하면 무료 우편 수리를받을 수 있습니다. </p> <p> 시계가 적격한지 확인하기 위해 검사를 받게되며, 해당하는 경우 수리가 무료로 수행되고 수리 된 시계는 소유자에게 반환됩니다. </p> <p> 버그로 인해 얼마나 많은 Apple Watch가 심각한 영향을 받는지는 명확하지 않습니다. 그러나 문제는 Apple Watch Series 5 또는 Apple Watch SE 모델의 하위 집합에만 영향을 미치고 다른 모델에는 영향을 미치지 않는 것으로 보입니다. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> WatchOS 7.3.1로 업그레이드하는 방법 </h2> <p> 버그를 경험하지 않은 사람들에게는 잠재적으로 발생할 수있는 일로부터 자신을 보호하기 위해 최신 watchOS 버전으로 업그레이드하는 것이 좋습니다. </p> <p> 버그 수정의 중요성은 Apple이 모든 사용자에게 watchOS 7.3.1을 즉시 푸시했다는 사실로 알 수 있습니다. 이는 소프트웨어 업데이트를 처음에 개발자가 베타 테스트를 위해 사용할 수 있도록함으로써 일반적으로 소프트웨어 업데이트를 발행하는 방식과는 대조적입니다. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple, watchOS 7.3 출시 </a> 1 월 말. </p> <p> 사용자는 iPhone에서 Apple Watch 앱을 사용하여 watchOS 7.3.1을 다운로드 할 수 있습니다. 이렇게하려면 다음으로 이동해야합니다. <strong> 일반&gt; 소프트웨어 업데이트 </strong> . 업데이트하려면 Apple Watch의 배터리가 50 % 이상이어야합니다. 또한 iPhone과 가까운 거리에 있어야합니다. </p>"}