{"title":"Microsoft, HPE의 Spaceborne Computer-2로 Azure Into Space 출시","content":"<p> Microsoft는 외계 서비스를 제공하기 위해 지구 끝을 넘어서고 있습니다. 이 회사는 Hewlett Packard Enterprises와 협력하여 Azure 플랫폼을 통해 ISS (International Space Station)의 PC에 연결합니다. </p> <p> Spaceborne Computer-2는 NASA 및 HPE 지상국을 통해 Azure에 연결되어 우주 정거장에 훨씬 뛰어난 데이터 처리 능력을 제공합니다. </p> <h2 id=\"azure-heads-into-space\"> 우주로 향하는 Azure </h2> <p> 보고 된대로 <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Azure 블로그 </a> , Spaceborne Computer-2 (SBC-2)는 ISS 우주 비행사에게 지상파와 더 유사한 기술을 제공합니다. </p> <p> 희망은 ISS와 지구간에 데이터를 전송하는 데 걸리는 시간을 대폭 줄이고 처리 및 분석에 필요한 대역폭의 양을 줄이는 것입니다. </p> <blockquote> <p> 우주 비행사와 우주 탐험가는 최고의 클라우드 컴퓨팅 기술과 첨단 프로세싱에 액세스 할 자격이 있습니다. 때때로 분석은 지나가는 모든 순간이 중요한 엣지에서 즉시 수행되어야하며, 분석이 너무 복잡하여 하이퍼 스케일 클라우드의 힘으로 만 수행 할 수있는 경우도 있습니다. </p> </blockquote> <p> Spaceborne Computer-2는 Hewlett Packard Enterprises의 Edgeline Converged Edge 시스템을 사용합니다.이 시스템은 &quot;가혹한 엣지 환경을 위해 의도적으로 설계&quot;되었으며 ISS에 Azure 기능의 힙을 가져올 것입니다. </p> <p> 연결이 설정되고 실행되면 SBC-2는 미래 화성 임무를위한 기상 모델링, 우주에서의 식량 및 작물 성장을 지원하기위한 식물 및 수경 재배 분석, ISS 자체에 대한 의료 영상 (우주 비행사 의료 지원 ). </p> <p> HPE의 컨 버지 드 에지 시스템 솔루션 설계자이자 Spaceborne Computer-2의 수석 조사자 인 Mark Fernandez 박사는 다음과 같이 말했습니다. </p> <blockquote> <p> 고급 에지 컴퓨팅 및 AI 기능을위한 HPE Edgeline Converged Edge 시스템을 기반으로하는 HPE의 Spaceborne Computer-2를 Microsoft Azure와 결합하여 클라우드에 연결함으로써 우주 탐험가가 대규모 데이터 세트를주고받을 수 있습니다. 지구와 엣지-투-클라우드 경험의 혜택 </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> Microsoft Azure Space Initiative의 다음 단계 </h2> <p> 마이크로 소프트의 발표는 <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Azure 공간 </a> 이니셔티브는 2020 년 10 월에 시작되었습니다. </p> <p> Azure Space 이니셔티브는 Azure 클라우드 컴퓨팅 플랫폼을 우주로 가져와 &quot;클라우드 컴퓨팅의 다음 큰 도약&quot;을위한 Microsoft의 노력입니다. </p> <p> </p> <p> Azure Space는 이전에 SpaceX Starlink 프로젝트와 협력하여 위성 광대역을 Azure Modular Datacenter (MDC)에 제공했으며, 위성 기술을 사용하여 클라우드 데이터 센터 간의 연결을 확장하는 Azure Orbital 프로젝트에서 계속 작업했습니다. </p>"}