{"title":"Microsoft의 Edge 브라우저는 비밀 Nintendo 게임 에뮬레이터에 호스트되었습니다.","content":"<p> Microsoft는 Microsoft Edge 브라우저 확장 저장소에 숨어있는 일련의 불법 게임 에뮬레이터를 삭제했습니다. Microsoft Edge 확장 저장소는 수십 개의 에뮬레이터를 호스팅하여 사용자가 몇 가지 상징적 인 게임을 플레이 할 수있게했으며이 중 어떤 것도 합법적으로 저장소에 게시되지 않았습니다. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft, 잘못된 Edge 확장 에뮬레이터 제거 </h2> <p> Microsoft Edge 확장 스토어에는 Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2, 심지어 Minecraft까지 가장 상징적 인 게임이 숨어있었습니다. 각 게임은 에뮬레이터 창에서 브라우저 내에서 시작되어 사용자가 각 타이틀을 전체적으로 플레이 할 수 있습니다. </p> <p> 그러나 닌텐도, 세가, 아타리 등 공식 게임 개발자를 나열한 클래식 타이틀은 없었습니다. 나열된 개발자의 이름에는 Gamelands, Kday 및 StayReal이 포함되었으며 모두 완전히 허구이며 원래 개발자와의 링크가 없습니다. </p> <p> 이상하게도 공식 Microsoft Edge Development Twitter 계정은 <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> 뿡 빵뀨 </a> 에뮬레이터에 대해 게시했으며 브라우저 확장 저장소에서 사용할 수있는 게임을 홍보하는 것으로 보입니다. 에뮬레이터를 홍보하는 원본 트윗을 잡지 못했지만 사본은 <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Resetera </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> 에뮬레이터는 불법입니까? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> 에뮬레이터를 사용하면 다른 소프트웨어를 실행할 수 있습니다. </a> 컴퓨터에서. 에뮬레이터를 사용하여 오래된 게임을 할 수도 있습니다. </p> <p> 에뮬레이터 자체는 불법이 아니지만 에뮬레이터에서 재생하기 위해 저작권 콘텐츠를 다운로드하는 것은 가능합니다. 공식 Microsoft Edge Development 계정의 트윗은 에뮬레이터가 사용자가 플레이 할 수 있도록 게임 ROM의 새 복사본을 다운로드함에 따라 이상한 움직임이었습니다. </p> <p> 포기의 주제도 다소 회색 영역입니다. Abandonware 게임은 더 이상 게시되지 않으며 더 이상 온라인이나 상점에서 판매 할 수 없습니다. 그러나 대부분의 경우 이러한 게임에 대한 저작권은 만료되지 않았지만 저작권 보유자는 해당 권리를 적극적으로 시행하지 않습니다. </p> <p> </p> <p> 대부분의 경우 포기는 불법입니다. 그럼에도 불구하고 포기와 관련된 법정 소송은 없으며, 포기 소프트웨어 타이틀을 다운로드 한 혐의로 누군가를 기소하는 오래된 게임 개발자와 관련된 소송은 없습니다. </p> <p> 이 정확한 예에서 웹 브라우저 내에서 이러한 오래된 게임의 에뮬레이션은 불법입니다. 또한 Nintendo는 지적 재산을 복제하거나 재배포하려는 사이트 또는 서비스를 삭제하는 것으로 유명합니다. </p> <p> 현재 게임은 Microsoft Edge 확장 저장소에서 제거되었습니다. 게다가 에뮬레이트 된 게임이 어떻게 확장 스토어에 올라 갔는지 또는 누가 거기에 넣었는지 아직 알려지지 않았습니다. 말할 필요도없이 그들은 돌아 오지 않을 것입니다. </p>"}