{"title":"Netflix 공동 창립자, Apple TV + 비디오 전략 비판","content":"<p> 전 Netflix의 최고 책임자 인 Marc Randolph는 Apple의 무료 제공 및 매력적인 콘텐츠 부족으로 인해 Apple TV +가 경쟁사보다 뒤처지고 있다고 말하면서 Apple의 비디오 전략을 꺾었습니다. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple이 &quot;양발로&quot;스트리밍되지 않음 </h2> <p> 전 Netflix CEO이자 공동 창립자 인 Marc Randolph에게 물어 보면 Apple TV는 Netflix, Disney + 및 기타 성공적인 스트리밍 서비스에 비해 서비스의 빈약 한 성장에 기여한 프리 로더 문제에 시달렸습니다. </p> <p> 말하기 <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> 야후 금융 </a> , 그는 Apple TV +가 프로모션과 무료 서비스에 에너지를 낭비하고 있지만 가치를 높이기 위해 더 많은 양질의 콘텐츠를 추가하는 데 초점을 맞춰야한다고 말했습니다. </p> <blockquote> <p> 애플이 경품 행사에 비해 콘텐츠에 1/4의 시간을 투자했다면 실제로 플레이 할 수있었습니다. 그들은 변명의 여지가 없으며 여전히 두 발로 그 안에 있지 않습니다. 그들은 정말로 기업가적인 일을하고 절벽 끝까지 걸어 가서 점프해야합니다. </p> </blockquote> <p> Apple TV +에는 Disney의 시장 지배력과 Netflix의 브랜드 인지도가 부족하기 때문에 절벽 가장자리에서 뛰어 내리는 것이 말처럼 쉽지 않을 수 있습니다. 지금은 <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney + 대 Netflix </a> 잠재 고객에게 최고의 가치를 제공하는 스트리밍 서비스 </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> 이탈률이 가장 높은 Apple TV + </h2> <p> Randolph는 스트리밍 시장의 경품 및 판촉에 반대하며 Apple TV + ‌가 주요 서비스 중 &quot;가장 높은 이탈률&quot;을 가지고 있음을 시사합니다. </p> <blockquote> <p> 사람들을 계속 대체 할 수는 없습니다. 그들에게 머물 이유를 알려줘야합니다. </p> </blockquote> <p> MoffettNathanson-HarrisX에서보고 한 바와 같이 무료로 가입 한 사용자 중 29 %가 무료 평가판이 만료되면 다시 가입 할 계획이 없다는 사실을 발견했습니다. <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> 종류 </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> 무료 Apple TV + 할인 </h2> <p> Apple은 새 iPhone과 같이 회사에서 적격 한 새 기기를 구입하는 모든 사람에게 12 개월 동안 무료 Apple TV + 서비스를 제공하고 있습니다. 그동안 <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple은 1 년 무료 구독을 연장했습니다. </a> 2019 년에 가입 한 사람들에게는 두 번. </p> <p> </p> <p> 이는 Apple 자체가 서비스가 매월 5 달러의 요청 가격을 정당화하기에 충분한 콘텐츠를 제공한다고 믿지 않는다는 분명한 신호입니다. 다른 방식으로 생각해보십시오. Apple TV +가 내부 예상치를 초과했다면 Apple은 이미 구독자 수를 자랑했을 것입니다. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney +와 Netflix는 심각한 경쟁을 제공합니다 </h2> <p> Apple TV +가 2019 년 11 월에 데뷔 한 것은 불과 15 개월 전이었습니다. Disney +가 곧 이어졌습니다. Apple은 Apple TV +의 유료 구독자 수를 밝히지 않았지만 Disney는 구독자 수가 9 천 4 백만 명을 넘어 섰으며 이는 자체 기대치를 훨씬 뛰어 넘었습니다. </p> <p> 이에 비해 Netflix는 2020 년 말에 2 억 4 천만 명의 유료 고객을 집계했습니다. Disney는 단 12 개월 만에 구독자 측면에서 Netflix와 비교할 수 있기를 희망합니다. </p> <p> </p> <p> Randolph는 Disney +가 콘텐츠 덕분에 &quot;정말 강력한 지위까지 올라 갔다&quot;고 말합니다. 그는 &quot;실제로 누가 콘텐츠를 만들 준비가되었는지에 대한 전쟁&quot;이라고 덧붙였다. </p> <blockquote> <p> 우리는 게임 개발의 새로운 규칙을보고 있습니다. 이것은 단순히 발표하는 것이 아닙니다. 이것은 단지 홍보를하는 것이 아닙니다. 당신이 보여 주어야 할 것은 당신이 콘텐츠, 콘텐츠, 콘텐츠를 가지고 있다는 것입니다. </p> </blockquote> <p> 실제로 게임은 콘텐츠에 관한 것입니다. 예를 들어, <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> 2021 년 계획 </a> , Netflix는 일년 내내 매주 새로운 오리지널 영화를 출시합니다. 반면 Apple TV +에는 Tom Hanks가 출연 한 2 차 세계 대전 드라마 그레이하운드 (실제 사건을 바탕으로 한), Justin Timberlake가 출연 한 오리지널 드라마 Palmer, Sofia Coppola의 On The Rocks 등 몇 가지 영화가 있습니다. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> Apple의 느린 굽기 접근 방식 </h2> <p> Randolph가 인정하지 않는 것은 Netflix와 Disney +가 첫날부터 엄청난 양의 콘텐츠를 보유한 반면 Apple TV +는 처음부터 콘텐츠 라이브러리를 구축하고 있다는 것입니다. </p> <p> Apple은 Disney + 및 Netflix와 관련된 쇼가 부족하다는 사실에서 알 수 있듯이 느리게 굽기 방식을 선택했습니다. 아무리 봐도 Apple TV + 전략은 서비스가 무료 고객을 유료 구독자로 전환 할 수있는 충분한 품질의 콘텐츠를 수집하기를 바라며 무료 제품으로 사람들을 유인해야하는 것 같습니다. </p>"}