{"title":"새로운 연구에 따르면 Android 사용자는 iPhone 사용자보다 더 나은 파트너가됩니다.","content":"<p> iPhone과 Android 스마트 폰 사용자 간에는 끝없는 전투가 치열합니다. 전투에 참여하지 않는 사람도 스마트 폰 만 골라 편을 택했다. </p> <p> 전투에 새로운 주름이 있습니다. <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> CompareMyMobile </a> iPhone 또는 Android 사용자가 더 나은 관계 파트너를 만드는지에 대한 최근 연구를 수행했습니다. 밝혀진 바와 같이 iPhone 사용자는 Android 사용자보다 성가신 전화 습관이 더 많아서 Android 사용자가 더 나은 파트너가된다는 결론을 내립니다. </p> <p> 물론 데이터에는 단순한 결론보다 더 많은 것이 있으므로 좀 더 자세히 살펴보고 살펴 보겠습니다. </p> <h2 id=\"iphone-and-android-relationship-study\"> iPhone 및 Android 관계 연구 </h2> <p> 이 연구의 전체적인 결론은 안드로이드 사용자가 아이폰 사용자보다 더 나은 파트너를 만든다는 것이지만 그 결과는 피상적 인 결론보다 훨씬 더 깊습니다. 전체적으로이 연구는 2,000 명 이상의 사용자를 대상으로 설문 조사를 실시했기 때문에 상당히 큰 표본 크기를 제공합니다. </p> <p> 가장 성가신 스마트 폰 습관을 살펴보면 iPhone 사용자가 Android 사용자보다 공격을 할 가능성이 12 % 더 높은 것으로 나타났습니다. 실제로 iPhone 사용자는 설문 조사의 모든 범주에서 Android 사용자보다 더 많은 전화 사용 잔학 행위를 저질렀습니다. </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> 성가신 범죄의 예로는 파트너가 책을 읽도록두고, 영화를 보는 동안 휴대폰을 사용하고, 심지어 운전 중에 휴대폰을 사용하는 것 등이 있습니다 (성 가실뿐만 아니라 엄청나게 위험합니다). iPhone 사용자는 Android 사용자보다 휴대 전화를 떨어 뜨리고 파손 할 가능성이 훨씬 더 높습니다. 이는 정말 놀라운 통계입니다. </p> <p> 다른 성가신 습관은 다음과 같습니다. <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> 다른 사람들의 소셜 미디어 프로필에 </a> , 사진에 과도한 필터를 사용하고, 여러 개의 단선 메시지를 보내고 (나는이 방법을 너무 많이 사용한다는 것을 알고 있습니다), 대화를하는 동안 전화를 사용합니다. </p> <p> 흥미롭게도이 연구는 남성이 여성보다 성가신 (어떤 경우에는 완전히 안전하지 않은) 습관의 대부분을 수행 할 가능성이 더 높다는 것을 발견했습니다. </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> 그러나 Apple 사용자는 더 많은 날짜를 얻습니다. </h2> <p> CompareMyMobile에서 발표 한 다른 연구에 따르면 iPhone 사용자는 온라인 데이트 앱에서 데이트를 할 가능성이 더 높습니다. 50,000 회 이상의 스 와이프를 조사한이 연구에서는 데이트 앱을 통해 대화 할 때 iPhone 사용자가 Android 휴대 전화를 사용하는 사람보다 데이트를 할 확률이 76 % 더 높다는 사실을 발견했습니다. </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> 첫 번째 연구가 믿어 진다면 iPhone 사용자가 운전 중에 다른 소셜 미디어 프로필과 문자 메시지를 표시하기 때문에 관계가 잘 풀리지 않을 수 있습니다. 그래도 이전 관계가 잘 풀리지 않을 때 다음 파트너를 찾을 가능성이 더 높습니다. </p> <p> 결국 데이트는 결코 쉽지 않습니다. 그러니 휴대 전화가 좋은 일을 죽이는 장치가되지 않도록 최선을 다하세요! </p>"}