{"title":"Parler는 한 달 동안 종료 된 후 온라인으로 돌아옵니다.","content":"<p> Big Tech에 의해 폐쇄 된 후 Parler는 마침내 웹에 다시 등장했습니다. &quot;발언의 자유&quot;플랫폼은 이제 기존 사용자가 액세스 할 수 있으며 조만간 새로운 사용자 등록을 수락하기 시작할 것입니다. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler는 Big Tech 정전 후 다시 나타납니다. </h2> <p> 팔러는 오랜 정전 후 복귀했다. 대체 소셜 네트워크는 정치 보수 주의자들 사이에서 주목을 받고 있으며 <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> Amazon Web Services (AWS), Google 및 Apple에서 부팅 </a> 국회 의사당 폭동 이후. Parler는 폭력적인 콘텐츠를 충분히 검토하지 않아 앱 스토어와 웹에서 삭제 된 것으로 비난 받았습니다. </p> <p> AWS 대신 Parler는 이제 SkySilk라는 호스트를 사용하고 있습니다. 이 사이트는 또한 Gab과 같은 다른 종류의 &quot;언론의 자유&quot;네트워크를 제공하는 등록 기관인 Epik에 도메인 이름을 등록했습니다. </p> <p> 새로운 호스트 및 도메인 등록 기관이 Parler가 만든 유일한 변경 사항은 아닙니다. Parler는 새로운 임시 CEO로 다시 합류했습니다. 이것은 이후에 온다 <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> Parler 팀은 공동 창립자 John Matze를 해고했다. </a> . </p> <p> Mark Meckler는 일시적으로 Matze를 CEO로 대체하고 이전에는 우익 Tea Party Patriots 그룹을 공동 창립했습니다. 에 의해 얻은 진술에서 <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> 언덕 </a> , Meckler는 오랫동안 기다려온 Parler의 복귀를 다음과 같이 발표했습니다. </p> <blockquote> <p> 1 월에 수천만 명의 미국인을 침묵시키려는 사람들에 의해 Parler가 오프라인 상태가되었을 때, 우리 팀은 함께 모여 그 어느 때보 다 강하게 돌아올 것이라는 우리의 적극적인 커뮤니티에 대한 약속을 지키기로 결심했습니다. 모두를 환영하게되어 기쁩니다. </p> </blockquote> <p> Meckler는 계속해서 Parler가 &quot;언론의 자유, 개인 정보 보호 및 시민 대화&quot;에 전념 할 것이라고 언급했습니다. 그는 또한 &quot;Parler는 숙련 된 팀에 의해 운영되고 있으며 여기에 머물러 있습니다&quot;라고 사용자를 안심 시켰습니다. </p> <p> 플랫폼의 이전 계정은 백업되지만 이전 게시물 (또는 &quot;팔리&quot;)은 복원되지 않았습니다. Parler에 이미 계정이있는 경우 사이트를 계속 사용할 수 있습니다. 그렇지 않으면 가입 할 수있을 때까지 일주일 정도 기다려야합니다. </p> <p> 그러나 이미 Parler 계정이 있더라도 플랫폼을 사용하는 동안 기술적 인 문제가 발생할 수 있습니다. 서비스가 아직 완전히 복원되지 않은 것처럼 보입니다. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> Parler 앱은 여전히 ​​Limbo에 남아 있습니다. </h2> <p> Parler는 여전히 Google Play 스토어 및 Apple App Store에서 금지되어 사용자 기반에 심각한 피해를 줄 수 있습니다. 현재로서는 알 수없는 시간 동안 모바일 장치에서 플랫폼을 사용할 수 없게 될 수 있습니다. </p> <p> 중재 정책을 변경하지 않는 한 Play Store 또는 App Store로 돌아갈 수 없을 것입니다. 이는 Parler가 거부 할 가능성이 높은 조치입니다. </p>"}