{"title":"스마트 건강 카드 vs. 디지털 예방 접종 여권 : 큰 차이점은 무엇입니까?","content":"<p> COVID-19 전염병은 의료 시스템을 곤혹스럽게 만들었습니다. 이제 정부와 기업 모두 정상화를 시도함에 따라 디지털 건강 여권과 스마트 건강 카드의 전망이 가속화되고 있습니다. </p> <p> 그렇다면 스마트 건강 카드는 무엇이며 건강 여권과 동일합니까? </p> <h2 id=\"what-is-a-smart-health-card\"> 스마트 건강 카드 란 무엇입니까? </h2> <p> 스마트 건강 카드는 암호화 된 데이터가 포함 된 집적 회로 칩이 내장 된 얇은 플라스틱입니다. </p> <p> 스마트하게 만드는 것은 슈퍼 컴퓨터 역할을하는 칩입니다. 이 칩은 다양한 애플리케이션에서 다양한 작업을 수행하도록 프로그래밍 할 수 있으며 컴퓨터 시스템에 연결된 리더는 칩의 데이터에 액세스하거나 업데이트 할 수 있습니다. </p> <p> 신용 카드처럼 보이지만 기능이 다릅니다. 유럽 ​​및 전 세계의 여러 국가에서 사용되는 스마트 건강 카드는 건강 관리 정보, 보험 적용 범위 및 기타 중요한 의료 데이터를 저장합니다. </p> <p> </p> <h2 id=\"advantages-of-using-a-smart-health-card\"> 스마트 건강 카드 사용의 장점 </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> 프랑스의 건강 관리 : &amp; # 39; Carte Vitale &quot;이란 무엇입니까? <a href=\"https://t.co/5VVcTjZyxh\"> https://t.co/5VVcTjZyxh </a> <a href=\"https://t.co/6I0TCy70wg\"> pic.twitter.com/6I0TCy70wg </a></p> — FrenchEntrée (@FrenchEntree) <a href=\"https://twitter.com/FrenchEntree/status/738646709308379136?ref_src=twsrc%5Etfw\"> 2016 년 6 월 3 일 </a></blockquote>  <p> 이 시스템을 사용하는 다른 많은 장점 중에서 가장 중요한 것은 중대 또는 응급 치료를 개선하는 것입니다. 스마트 건강 카드는 응급 상황에서 환자의 건강 데이터 또는 의료 기록에 즉시 액세스 할 수 있도록합니다. </p> <p> 예를 들어, 휴대용 카드 리더기가있는 응급 구조자는 병원으로가는 도중 구급차에있는 동안 환자에 대한 즉각적인 정보를 얻을 수 있습니다. 이것은 환자가 의식이 없거나 반응이 없거나 단순히 응답자에게 자신의 건강 관리 정보를 말할 수 없을 때 더욱 중요합니다. </p> <p> 구급차가 도착하기 전에 응급실 직원에게 중요한 환자 데이터를 전달할 수있는 구조 대원을 상상해보십시오. 응급실 직원이 도착하기 전에 환자를 치료하는 데 필요한 것을 준비하는 데 도움이됩니다. </p> <p> 중환자 치료 중 빠르고 효율적인 환자 데이터 전송은 응답 시간을 크게 개선하여 생명을 구할 수 있습니다. </p> <h3 id=\"seamless-transfer-of-data\"> 원활한 데이터 전송 </h3> <p> 이 시스템을 사용하면 응급실 직원의 환자 정보를 입원 환자 치료의 의료 서비스 제공자에게보다 정확하고 유동적으로 전송할 수 있습니다. </p> <p> 의사는 환자의 기억에 의존 할 필요가 없습니다. <a href=\"https://www.makeuseof.com/tag/google-store-medical-data-cloud/\" target=\"_blank\" rel=\"nofollow noopener\"> 중요한 의료 데이터 검색 </a> , 오류 가능성을 줄입니다. 이 외에도 스마트 건강 카드 시스템은 의사간에 환자 정보를 원활하게 교환 할 수 있습니다. </p> <p> 중요한 환자 데이터가 유출 될 가능성을 줄입니다. <a href=\"https://www.makeuseof.com/tag/the-10-pieces-of-information-identity-thieves-are-looking-for/\" target=\"_blank\" rel=\"nofollow noopener\"> 신분 도용 </a> ). 이것은 종종 환자 정보가 팩스, 전화 또는 이메일을 통해 공유 될 때 발생합니다. </p> <h3 id=\"easier-storage-and-retrieval-of-medical-records\"> 의료 기록의 간편한 저장 및 검색 </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"it\" dir=\"ltr\"> Tessera Sanitaria : Richiederne un duplicato로 오세요 <a href=\"https://t.co/2GrFWpanC2\"> https://t.co/2GrFWpanC2 </a> <a href=\"https://t.co/JKR6ampnXq\"> pic.twitter.com/JKR6ampnXq </a></p> — CataniaToday (@CataniaToday) <a href=\"https://twitter.com/CataniaToday/status/1359189830937300995?ref_src=twsrc%5Etfw\"> 2021 년 2 월 9 일 </a></blockquote>  <p> 이 시스템은 환자에게 실험실 테스트 결과 또는 의사의 메모를 편리하고 간편하게 휴대 할 수있는 방법을 제공합니다. </p> <p> 환자 지갑에있는 작은 카드에 이전 테스트, 치료 및 보험 적용 파일과 같은 의료 정보 데이터베이스를 가지고있는 것과 같습니다. 더 이상 의사의 진료를 받기 위해 종이를 둘러 볼 필요가 없습니다. </p> <h3 id=\"reduces-medical-errors-and-duplicate-testing\"> 의료 오류 및 중복 검사 감소 </h3> <p> 의료 오류와 중복 검사를 피할 수 있기 때문에 국가의 의료 시스템이이 혜택을받을 수도 있습니다. 이 시스템을 통해 부적절한 데이터 입력, 언어 장벽 또는 잘못된 의사 소통으로 인한 의료 오류를 최소화 할 수 있습니다. </p> <p> 인적 오류는 때때로 환자와 기록의 불일치를 유발할 수 있습니다. 스마트 건강 카드가 있으면 의료 서비스 제공자가 환자와 정확한 건강 기록을 쉽게 일치시킬 수 있습니다. 이렇게하면 많은 비용이들 수있는 중복 레코드 또는 여러 개의 중복 테스트가 발생할 가능성이 줄어 듭니다. 의료 시스템의 불필요한 비용을 절약 할 수 있습니다. </p> <h3 id=\"more-accurate-verification-of-insurance-coverage\"> 보험 적용 범위에 대한보다 정확한 확인 </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> 도시 휴식? 출장? 휴가? 마음의 평화를 위해 항상 유럽 건강 보험 카드를 휴대하십시오! <a href=\"https://t.co/31zoREZAEy\"> https://t.co/31zoREZAEy </a> <a href=\"https://twitter.com/hashtag/EHIC?src=hash&ref_src=twsrc%5Etfw\"> #EHIC </a> <a href=\"https://t.co/o05Jx8aIwq\"> pic.twitter.com/o05Jx8aIwq </a></p> — 유럽위원회 🇪🇺 (@EU_Commission) <a href=\"https://twitter.com/EU_Commission/status/893485278114992128?ref_src=twsrc%5Etfw\"> 2017 년 8 월 4 일 </a></blockquote>  <p> 의료 신분 도용은 최근 몇 년 동안 심각한 문제가되었습니다. 범죄에는 건강 보험 정보를 부정하게 사용하여 의료 서비스에 접근하거나 보상을받는 것이 포함됩니다. 간단히 말해 보험이 적용되지 않는 사람은 혜택을 받기 위해 다른 사람의 건강 보험 정보를 훔칠 수 있습니다. </p> <p> 건강 관리 또는 건강 보험 시스템 침해는 종종 해커가 다크 웹에서 판매 할 수있는 민감한 개인 식별 정보 (PII)를 유출합니다. PII에는 건강 보험 정보가 포함될 수 있습니다. </p> <p> 이것이 도둑이 액세스해서는 안되는 의료 서비스에 액세스하는 데 사용하는 것입니다. 그들은 처방약을 구입하거나 한 번도 수행되지 않은 절차에 대해 사기 보험 청구를 할 수 있습니다. </p> <p> 스마트 건강 카드 시스템은 대부분이 인증 및 보안 프로토콜을 사용하기 때문에 이러한 모든 것을 방지 할 수 있습니다. 일부는 2 단계 인증 (2FA) 또는 다단계 인증 (MFA)을 사용할 수 있으며, 다른 일부는 환자의 지문을 확인하여 신원을 확인하는 생체 인식 기능이 있습니다. </p> <p> </p> <h2 id=\"disadvantages-of-using-a-smart-health-card-system\"> 스마트 건강 카드 시스템 사용의 단점 </h2> <p> 개인 정보 보호 문제는 사용자가 의료 목적으로 기술을 채택하는 것을 막는 가장 큰 관심사입니다. 많은 사람들이 사람들이 치료, 질병 기록 및 약물과 같은 수많은 민감한 데이터에 쉽게 액세스 할 수 있도록하는 것에 대해 우려를 제기했습니다. 의료 및 보험 시스템이 데이터 침해의 피해자가된다는 소식이 있기 때문에 이러한 우려는 근거없는 것이 아닙니다. </p> <p> 모든 기록을 한 곳에 보관하는 것이 편리 할 수 ​​있지만 <a href=\"https://www.makeuseof.com/tag/healthcare-new-attack-vector-scammers-id-thieves/\" target=\"_blank\" rel=\"nofollow noopener\"> 데이터 유출 </a> 매우 민감한 데이터를 잘못된 손에 넣을 수 있습니다. </p> <h3 id=\"creating-digital-divide\"> 디지털 분할 만들기 </h3> <p> 그리고 디지털 격차를 만드는 문제가 있습니다. 많은 사람들이 스마트 건강 카드는 시스템에 액세스 할 수있는 병원과 커뮤니티에서만 사용할 수 있다고 주장합니다. 이 기술을 활용하려면 병원의 기계가 동일한 소프트웨어, 스마트 카드 리더 인터페이스를 지원하고 필요한 하드웨어를 지원할 수 있어야합니다. </p> <p> 하드웨어와 관련하여 추가 비용 문제도 있습니다. 시스템 용 하드웨어, 리더 용 소프트웨어 및 데이터베이스가있는 네트워크는 수백만 달러의 비용이들 수 있으며 유지 관리 비용이 더 많이들 수 있습니다. 플라스틱 카드 자체도 생산하는 데 비용이 듭니다. </p> <p> 초기 투자는 누가 부담합니까? 게다가이 초기 투자가 정부와 시민들에게 이익을 가져 오기까지 얼마나 걸립니까? </p> <h3 id=\"bugs-and-power-failures\"> 버그 및 정전 </h3> <p> 물론 이러한 종류의 기술은 데이터 유출을 유발할 수있는 버그와 결함 또는 사이버 공격에 영향을받지 않습니다. 시스템에서 패치되지 않은 단일 장치는 네트워크 및 데이터베이스에 손상을 줄 수있는 맬웨어의 게이트웨이가 될 수 있습니다. </p> <p> 정전에 대한 우려도 있습니다. 제한된 전력 또는 전력 인프라 문제가있는 커뮤니티에서 어떻게 유지 될 수 있습니까? 가장 정교한 전력 시스템조차도 큰 재난에서 실패 할 수 있습니다. 재난 중에 의료 데이터에 액세스 할 수 없다고 상상해보십시오. </p> <p> </p> <h2 id=\"smart-healthcare-vs-digital-vaccination-passport\"> 스마트 헬스 케어 대. 디지털 백신 접종 여권 </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Mayo Clinic, Cigna의 Evernorth 및 Microsoft를 포함한 기술 및 의료 분야의 거물들은 디지털 COVID-19 예방 접종 여권을 만들기 위해 협력하고 있습니다. <a href=\"https://t.co/KgTVjq9lUe\"> https://t.co/KgTVjq9lUe </a> <a href=\"https://t.co/ZiJIE8xoTY\"> pic.twitter.com/ZiJIE8xoTY </a></p> — Mast Health (@MastAnalytics) <a href=\"https://twitter.com/MastAnalytics/status/1351683116990164993?ref_src=twsrc%5Etfw\"> 2021 년 1 월 20 일 </a></blockquote>  <p> 코로나 19 이후 여행 및 콘서트 또는 모임에 대한 액세스를위한 디지털 예방 접종 여권에 대한 이야기가있었습니다. 디지털 건강 여권은 독일, 프랑스 및 오스트리아와 같은 국가에서 사용되는 스마트 건강 카드와 비슷해 보일 수 있지만 주요 차이점이 있습니다. </p> <p> </p> <p> 첫째, 디지털 COVID-19 백신 여권은 개인 휴대 전화에 다운로드 된 디지털 인증서 형태로 제공됩니다. 디지털 인증서 또는 Covid 백신 여권은 환자의 이름과 환자의 Covid 백신 세부 정보 (투여 날짜, 백신 제조업체, 백신 접종 장소)가 포함 된 패스입니다. 입력 지점에서 스캔 할 수있는 바코드 또는 QR 코드가 포함 된 한 페이지 디지털 문서입니다. </p> <p> 스마트 건강 카드와 달리 디지털 건강 여권은 실제 플라스틱 카드가 아닙니다. </p> <p> 개인의 COVID-19 검사, 예방 접종 기록, 예방 접종 및 검사가 수행 된 의료 시설과 관련된 정보 만 포함됩니다. 환자의 전체 병력이있는 것은 아닙니다. </p> <p> 이 디지털 건강 여권은 사람들이 많은 사람들과 접촉 할 수있는 콘서트 및 직장과 같은 모임에 액세스 할 수 있도록하거나 여행이 정상화되면 국가에 입국 할 수 있도록합니다. 스마트 폰이없는 사람은 입력 지점에서 스캔 한 코드를 인쇄 할 수 있습니다. </p> <h3 id=\"breach-of-privacy-and-curtailment-of-human-rights\"> 개인 정보 침해 및 인권 축소 </h3> <p> 많은 사람들이 잽을 얻고, 디지털 예방 접종 여권을 다운로드하고, 정상으로 돌아 가기를 열망하지만, 일부는이 기술을 도입 할 때 발생할 수있는 영향에 대해 경고합니다. 전문가와 인권 옹호자들은 예방 접종 여권이 가져올 수있는 잠재적 인 데이터 프라이버시 및 인권 문제를 해결하도록 개발자에게 경고하고 있습니다. </p> <p> 에 의해 발표 된 연구 <a href=\"https://socialsciences.exeter.ac.uk/media/universityofexeter/collegeofsocialsciencesandinternationalstudies/lawimages/research/Policy_brief_-_Digital_Health_Passports_COVID-19_-_Beduschi.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> 엑서 터 로스쿨 대학교 </a> 이 여권이 사생활권, 이동의 자유, 평화로운 집회를 포함한 기본적인 인권을 어떻게 축소 할 수 있는지 경고합니다. </p> <p> 보고서에 따르면 문제는 여권의 민감한 개인 건강 정보 (이 정보는 어떻게 저장되고 누가 액세스 할 수 있는가)를 사용하는지와 건강 상태에 따라 사람들 사이에 새로운 구분을 만들 수있는 방법에서 비롯됩니다. </p> <p> 여권은 또한 사람이 권리와 자유를 누리는 정도를 잠재적으로 결정하거나 제한 할 수 있습니다. 전문가들은 디지털 건강 여권을 사용하면 백신이나 건강 여권에 즉각적으로 접근 할 수있는 지역 사회와 그렇지 않은 지역 사회 간의 불평등이 심화 될 수 있다고 경고합니다. </p> <p> </p> <h2 id=\"future-of-healthcare\"> 의료의 미래 </h2> <p> 프랑스와 같은 국가에서는 90 년대부터 스마트 건강 카드를 사용해 왔으며 다른 국가에서는 2000 년대 초반에이를 따랐습니다. </p> <p> 이 기술의 채택은 미국과 같은 국가에서 다소 느리며 개인 정보 문제를 주요 관심사로 언급했습니다. 이 시스템을 채택하면 많은 이점이 있지만 신중하게 고려해야하는 몇 가지 단점도 있습니다. </p>"}