{"title":"미국 정부는 앱 개인 정보 레이블의 정확성에 대해 알고 싶어합니다.","content":"<p> App Store의 iOS 14 앱 개인 정보 보호 레이블을 통해 Apple은 사용자가 사용하는 앱에 대한 더 많은 지식과 앱이 앱을 추적하는 방법에 대해 더 많은 지식을 보유함으로써 권한을 부여 할 수있는 새로운 방법을 제공하고 있습니다. </p> <p> 그러나 애플은 이제 개발자들이 12 월에 애플에 제출하기 시작한 라벨의 정확성을 보증하도록 밀어 붙이고 있기 때문에 잠재적으로 스스로 웜 캔을 열어 놓은 것 같습니다. </p> <h2 id=\"concerns-over-accuracy\"> 정확성에 대한 우려 </h2> <p> 언급했듯이 <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumors </a> , Apple은 <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> 편지 </a> 미국 하원 에너지 및 상거래위원회에서 개발자가 제공 한 앱 개인 정보 보호 라벨의 정확성에 대한 정보를 명확히하도록 요청했습니다. </p> <p> 이 레이블은 개발자가 앱이 사용자 데이터와 상호 작용하는 방식에 대해 더 개방적으로 만들도록하는 iOS 14의 4 분의 1에서 간절히 기대되는, 다른 사람이 두려워하는 기능입니다. 이는 사용자가 특정 앱 사용의 장점과 단점에 대해 더 많은 정보를 바탕으로 결정을 내릴 수 있음을 의미합니다. </p> <p> </p> <p> 미국 하원 에너지 및 상거래위원회는 특정 앱 개인 정보 보호 레이블이 사용자에게 &quot;오도 및 허위&quot;정보를 제공 할 수 있다는보고에 대해 Apple에 요청합니다. 이는 지난달에 발표 된 보고서에 근거하여 깨끗한 건강 청구서를받은 많은 앱이 그들이 제안하는 것만 큼 순진하지 않을 수 있다고 주장합니다. </p> <p> iOS 14 기능의 잠재적 인 문제는 데이터가 수집되는 방식을 말하고이 정보가 정확한지 확인하기 위해 개발자 정직에 의존한다는 것입니다. Apple은 해당 정보가 &quot;Apple에서 확인되지 않았습니다&quot;라고 지적합니다. </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Apple의 응답 요청 </h2> <p> 대부분의 개발자가 공정하게 플레이하고 명예 시스템을 따를 것 같지만 당연한 것으로 받아 들일 수있는 것은 아닙니다. Apple은 전송 된 정보를 정기적으로 감사합니다. 그러나 App Store에있는 수많은 앱으로 인해 Apple이 모든 목록을 개인적으로 확인하는 것은 불가능합니다. </p> <p> 미국 하원 에너지 및 상업위원회 서한은 다음과 같이 계속합니다. </p> <blockquote> <p> &quot;우리는 Apple이 앱 개인 정보 보호 레이블의 유효성을 개선하여 소비자에게 앱의 데이터 관행에 대한 의미있는 정보를 제공하고 이러한 잠재적 인기만 관행으로 인해 피해를 입지 않도록 할 것을 촉구합니다.&quot; </p> </blockquote> <p> 위원회는 감사 프로세스에 대한 자세한 내용, 사실이 아닌 것으로 판명 된 경우 앱 개인 정보 레이블이 수정되는지 여부, 개발자가 부정확 한 정보를 제공 할 때 발생하는 상황 등에 대한 세부 정보를 Apple에 제공하도록 요청했습니다. </p> <p> 그들은 2 월 23 일까지 요청한 정보로 Apple에 응답 할 것을 요청하고 있습니다. </p> <p> <small> 이미지 크레딧 : Jason Dent / <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Unsplash CC </a></small> </p>"}