{"title":"VW, Apple이 자동차 산업에서 쉽게 타지 못했다고 주장","content":"<p> 폭스 바겐 그룹의 CEO 인 허버트 다이스 (Herbert Diess)는 폭스 바겐이 프로젝트 타이탄을 &quot;두렵지 않다&quot;며 애플 자동차가 자동차 산업에 미칠 잠재적 인 영향을 경시했다. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> 애플 자동차의 폭스 바겐 &quot;두려워하지 않음&quot; </h2> <p> Diess는 애플 브랜드의 자동차가 실제로 합리적 일 수 있음을 인정하지만, 치열한 경쟁으로 인해 애플이 &quot;하룻밤&quot;자동차 제조 환경을 지배 할 수 있다고 생각하지 않습니다. 강철을 자르고 까다로운 소비자에게 자동차를 판매하는 것은 어려운 사업이라고 그는 덧붙였다. 그는이 분야가 어떤 회사도 &quot;한 번에 인수 할 수있는&quot;분야가 아니라고 덧붙였다. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> 로이터 </a> Diess가 인터뷰에서 Frankfurter Allgemeine Sonntagszeitung에게 말한 내용을 전달합니다. </p> <blockquote> <p> 자동차 산업은 한 번에 인수 할 수있는 일반적인 기술 분야가 아닙니다. 애플은 하룻밤 사이에 그것을 관리하지 않을 것입니다. 그래도 우리는 두려워하지 않습니다. </p> </blockquote> <p> 그럼에도 불구하고 Apple 브랜드 차량은 배터리, 소프트웨어, 산업 디자인 및 무한 해 보이는 리소스에 대한 Apple의 역량을 감안할 때 의미가 있다고 덧붙였습니다. Apple은 다음을 제외하고 자동차 관련 제품을 제공하지 않습니다. <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> CarPlay 대시 보드 소프트웨어 </a> 자동차 라디오 또는 헤드 유닛이 iPhone의 디스플레이 및 컨트롤러 역할을 할 수 있도록합니다. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> 업계 최악의 비밀 </h2> <p> Project Titan (Apple Car의 내부 코드 명) 계획은 최근 소문이 쇄도하지만 아직 공개되지 않았습니다. <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> 애플은 현대 / 기아와 파트너를 찾고 있었다 </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> 애플은 다른 자동차 회사와 이야기를 나눴다고합니다. </a> Magna, Nissan, Foxconn을 포함한 계약 제조업체는 자율 주행 차량을 만드는 방법에 대해 설명합니다. 소식통에 따르면 Apple Car는 처음에는 스티어링 휠이 없을 수 있습니다. <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> 음식 배달 및 robotaxi 운영에 집중 </a> 소비자에게 판매되기 전에. </p> <p> </p> <p> Herbert의 의견에서 가장 큰 점은 자동차 산업이 Project Titan에 세심한 관심을 기울이고 있다는 것입니다. 분명히 애플이이 분야에 진입한다는 생각 자체가 최고 경영진 중 일부를 불안하게 만들고있다. 그렇긴하지만, 역사는 새로운 제품 카테고리에 진입 한 것에 대해 애플을 조롱하는 것보다 더 잘 알고 있었어야하는 사람들로 가득 차 있습니다. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Palm CEO가 iPhone에서 웃었던 방법 </h2> <p> 가장 좋은 예는 전 팜 CEO Ed Colligan입니다. 2007 년 원래 iPhone이 출시되기 몇 주 전에 Colligan은 예쁜 컴퓨터를 설계하는 것으로 알려진 회사가 경쟁 스마트 폰 부문에서 고객을 확보 할 수 있다는 생각을 웃으며 다음과 같이 말했습니다. </p> <blockquote> <p> 우리는 여기서 몇 년 동안 괜찮은 전화를 만드는 방법을 배우고 고생했습니다. PC 직원들은이 문제를 이해하지 못할 것입니다. 그들은 그냥 들어 가지 않을 것입니다. </p> </blockquote> <p> 콜리 건이 애플을 &#39;PC 전문가&#39;라고 묘사 한 것과 비슷하게 폭스 바겐 상사는 기술 회사가 자동차 제조 사업에서 고객을 확보 할 수 있다는 생각을 경시하려고합니다. 역사는 Herbert의 의견이 Colligan의 의견보다 나이가 더 잘 드는지 여부를 보여줄 것입니다. </p>"}