{"title":"폭스 바겐, 자율 주행 차에 Microsoft Azure 사용","content":"<p> 마이크로 소프트는 자율 주행 차 시장에 진출하기를 열망하고 있지만 자동차 설계 및 제작에 대한 전문 지식이 없다. 그러나 스마트 카의 두뇌를 제공 할 수 있으며 폭스 바겐은 자체 차량에 Microsoft의 서비스를 사용하는 데 관심이 있습니다. </p> <h2 id=\"microsoft-and-volkswagen-s-partnership-for-automatic-cars\"> 자동 자동차에 대한 Microsoft와 Volkswagen의 파트너십 </h2> <p> 이 파트너십에 대한 소식이 끊겼습니다. <a href=\"https://www.reuters.com/article/us-microsoft-volkswagen/volkswagen-taps-microsofts-cloud-to-develop-self-driving-software-idUSKBN2AB0SZ\" target=\"_blank\" rel=\"nofollow noopener\"> 로이터 </a> . 폭스 바겐은 자율 주행 차의 세계에 뛰어들 수 있도록 마이크로 소프트를 도입하고있다. </p> <p> Volkswagen은 실제로 Audi, Porshe 및 Lamborghini와 같은 몇 가지 다른 자동차 회사를 소유하고 있습니다. 문제는 각 회사의 엔지니어들이 서로 정보를 공유하는 대신 자율 주행 차를 설계하는 방향으로 나름대로의 길을 가고 있다는 것입니다. </p> <p> 이를 해결하기 위해 폭스 바겐은 모든 자율 주행 자동차 엔지니어를 Car.Software라는 하나의 큰 그룹에 넣었습니다. 아이디어는 그룹이 통합하여 폭스 바겐이 모든 자동차에 사용할 수있는 단일 스마트 자동차 플랫폼을 만들 수 있다는 것이 었습니다. </p> <p> 그러나 결과적으로 Car.Software 내의 다른 엔지니어들은 여전히 ​​다른 플랫폼을 사용하여 코드를 개발했습니다. 따라서 Volkswagen은 모든 사람이 작업 할 수있는 기본 플랫폼을 제공하기 위해 Microsoft를 선택했습니다. </p> <p> 그렇다고 폭스 바겐의 자동차가 Windows 10에서 실행되고 있다는 의미는 아닙니다. Microsoft에는 사물 인터넷 (IoT) 장치를 연결하도록 설계된 Azure라는 또 다른 플랫폼이 있습니다. </p> <p> 익숙한 것 같으면 동일한 서비스이기 때문입니다. <a href=\"https://www.makeuseof.com/microsoft-powered-self-driving-car/\" target=\"_blank\" rel=\"nofollow noopener\"> 마이크로 소프트는 자율 주행 차를 위해 크루즈를 제안했다 </a> . 이제 크루즈 거래가 일회성 거래가 아님이 분명합니다. Microsoft는 자동차를 Azure에서 실행하는 것에 대해 진지하게 생각합니다. </p> <p> Azure가 Microsoft에서 얼마나 잘 수행되는지를 감안할 때 소프트웨어 거인이 철이 뜨거울 때 공격하기를 원한다는 것은 놀라운 일이 아닙니다. Microsoft의 Azure 및 Xbox 서비스 조합은 <a href=\"https://www.makeuseof.com/microsoft-reveals-record-profits/\" target=\"_blank\" rel=\"nofollow noopener\"> 대유행 기간 동안 회사는 깔끔한 이익을 얻었습니다. </a> . </p> <p> 따라서 Azure를 자율 주행 자동차에 탑재하여 스마트 장치 세계에서 더 큰 존재감을 부여하는 데 큰 인센티브가 있습니다. Azure가 스마트 카 세계에서 주요 플레이어가 될지 여부는 아직 밝혀지지 않았습니다. </p> <p> </p> <h2 id=\"starting-the-engine-for-microsoft-azure\"> Microsoft Azure 용 엔진 시작 </h2> <p> 마이크로 소프트 애저는 이미 거대 기술 기업에게 엄청난 돈을 벌어 들이고있는 회사 다. 이는 회사가 새로운 영역으로 진출하기에 완벽한 위치에 있음을 의미한다. Cruise와 Volkswagen의 자율 주행 차는 모두 Microsoft Azure를 기반으로 사용할 것이며, 이는 잠재적으로 자동차의 미래에 중요한 플레이어가 될 수 있습니다. </p> <p> 운명의 이상한 반전 속에서 마이크로 소프트와 애플 사이의 오랜 경쟁이 스마트 카 세계로 확산되고있다. 자동차 제조업체에 &quot;스마트&quot;부품 만 공급하는 대신 애플은 2024 년까지 완전한 &quot;애플 카&quot;를 생산할 계획입니다. </p> <p> <small> 이미지 크레딧 : Andrey Suslov / <a href=\"https://www.shutterstock.com/image-vector/autonomous-smart-car-scans-road-operates-635238704\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}