{"title":"헤드폰 드라이버 란 무엇이며 사운드에 어떤 영향을 줍니까?","content":"<p> 헤드폰은 놀라운 기술입니다. </p> <p> 침대에서 또는 출퇴근길에 음악을 듣는 일상적인 사람들과 음악과 비디오를 편집하기 위해 깨끗한 사운드 오디오가 필요한 전문가를 위해 제작되었습니다. 바로 이러한 이유로 다양한 유형의 헤드폰이 있습니다. 운동을하든 몇 시간 동안 오디오를 믹싱하든 상관없이 당신을위한 헤드폰이 있습니다. </p> <p> 이 헤드폰에는 <strong> 드라이버 </strong> 크기가 크게 다르며 헤드폰의 용도에 따라 다르게 만들어집니다. 물론 이러한 드라이버는 귀에 들리는 소리에 영향을줍니다. </p> <h2 id=\"what-is-a-headphone-driver\"> 헤드폰 드라이버 란? </h2> <p> <img alt=\"Open Back Headphone Driver\" src=\"images/open-back-headphone-driver-548.jpg\" loading=\"lazy\"> </p> <p> 헤드폰 드라이버는 본질적으로 전기 신호를 우리가들을 수있는 소리로 변환하는 작은 스피커입니다. 이 드라이버는 헤드폰 유형과 사용 용도에 따라 크기가 크게 다를 수 있습니다. </p> <p> 예를 들어, 이어 버드에는 8mm 정도의 매우 작은 드라이버가 있으며 더 큰 드라이버는 직경이 약 15mm입니다. 오버 이어 헤드폰은 크기가 20mm에서 최대 70mm까지 조금 더 다양합니다. </p> <p> 헤드폰 드라이버는 다음 세 가지 구성 요소로 구성됩니다. <strong> 자석 </strong> , <b> 보이스 코일 </b> , 그리고 <strong> 횡격막 </strong> . </p> <ul> <li> 그만큼 <strong> 자석 </strong> 자기장을 생성하며 일반적으로 코발트 또는 페라이트로 만들어집니다. </li> <li> <strong> 보이스 코일 </strong> 전류를 통과시켜 진동판을 움직여 우리가들을 수있는 소리를 생성하도록합니다. 일반적으로 다양한 유형의 구리로 구성된이 코일은 전기 신호를 소리로 변환하는 데 도움이됩니다. </li> <li> 그만큼 <strong> 횡격막 </strong> 진동하여 보이스 코일을 통과하는 전류에서 음파를 생성합니다. </li> </ul> <p> </p> <h2 id=\"types-of-headphone-drivers\"> 헤드폰 드라이버 유형 </h2> <p> 모든 드라이버가 정확히 동일하게 작동하는 것은 아닙니다. 일부 드라이버는 사용 된 재료와 엔지니어링 프로세스 및 기술에 따라 다른 드라이버보다 더 나은 오디오를 생성합니다. </p> <h3 id=\"dynamic-drivers\"> 동적 드라이버 </h3> <p> <img alt=\"Bose Headphones which use a type of Dynamic Driver\" src=\"images/dynamic-driver-415.jpg\" loading=\"lazy\"> </p> <p> 가장 일반적인 유형의 헤드폰 드라이버는 <strong> 동적 드라이버 </strong> . 이러한 드라이버는 위에서 설명한대로 작동합니다. 진동판이 진동하면 주변의 공기가 이동하여 듣고있는 소리가 생성됩니다. 공기 변위가 많을수록 부피가 커집니다. 이 공기 변위는 또한 사실적인 저음 응답을 생성하는 데 도움이됩니다. </p> <p> 다이내믹 드라이버는 낮은 주파수를 생성하는 데 탁월합니다. 볼륨이 클수록 우리 귀에 좋지 않은 고조파 왜곡이 발생할 수 있습니다. 이 드라이버는 생산 비용이 저렴하여 소비자에게 더 저렴한 헤드폰을 제공 할뿐만 아니라 전원을 공급하기가 더 쉽기 때문에 모두 나쁘지는 않습니다. 사용되는 하우징과 재료에 따라 음질이 다를 수 있으므로 모든 다이나믹 드라이버가 똑같이 만들어지는 것은 아닙니다. </p> <h3 id=\"balanced-armature-drivers\"> 밸런스드 아마추어 드라이버 </h3> <p> <img alt=\"Apple wired earbuds, which use a balanced armature driver\" src=\"images/apple-wired-earbuds-which-use-a-balanced-armature-driver-119.jpg\" loading=\"lazy\"> </p> <p> <strong> 밸런스드 아마추어 드라이버 </strong> 작고 주로 이어 버드에서 발견됩니다. 이 드라이버는 양쪽에 두 개의 자석이있는 코일 내부의 암으로 구성됩니다. 이렇게하면 암이 자석쪽으로 회전하여 균형을 이루고 다이어프램을 움직여 사운드를 생성 할 수 있습니다. 드라이버가 작동하는 방식으로 인해 다이내믹 드라이버처럼 공기를 대체하지 않아 저음이 부족합니다. </p> <p> 밸런스드 아마추어 드라이버는 또한 더 나은 차음에 도움이되는 추가 통풍구가 없습니다. 모든 드라이버와 마찬가지로 음질은 이어 버드의 내부 및 외부 디자인에 따라 달라질 수 있습니다. 일부 제조업체는 더 나은 저음 응답으로 더 풍부한 사운드를 생성하기 위해 동적 드라이버를 추가 할 수도 있습니다. </p> <p> </p> <h3 id=\"planar-magnetic-drivers\"> 평면 자기 드라이버 </h3> <p> <img alt=\"Open Back Headphones using Planar Magnetic Drivers\" src=\"images/open-back-headphones-using-planar-magnetic-drivers-408.jpg\" loading=\"lazy\"> </p> <p> <strong> 평면 자기 드라이버 </strong> 일반적으로 개방형 헤드폰에서 발견되며 일반적으로 동적 드라이버보다 높은 가격으로 제공됩니다. 보이스 코일을 사용하는 대신 평면 자기 드라이버는 양쪽의 자석에서 다이어프램을 고르게 진동시켜 사운드를 생성합니다. 이러한 드라이버는 더 크거나 여러 개의 자석을 사용하여 진동판을 고르게 진동시키기 때문에이 헤드폰은 약간 더 무거워지는 경향이 있습니다. </p> <p> 개방형 헤드폰은 다이내믹 드라이버를 사용하는 일반 폐쇄 형 헤드폰보다 더 많은 소리가 새어 나옵니다. 드라이버가 완전히 개방되어 있고 아무것도 덮지 않기 때문입니다. 이것은 대중에서 음악을 듣기위한 최선의 선택이 아닙니다. 그러나 그들은 바로 이러한 이유로 가정에서 사용하기에 환상적입니다. </p> <p> 더 많은 공기 변위로 인해 더 많은 사운드 누출이 발생하여 탁월한 저음 응답으로 더 풍부한 사운드를 제공하여 가정에서 사용하기에 적합합니다. </p> <h3 id=\"electrostatic-drivers\"> 정전기 드라이버 </h3> <p> <img alt=\"Open Back Headphones That Require an Amplifier\" src=\"images/open-back-headphones-that-require-an-amplifier-271.jpg\" loading=\"lazy\"> </p> <p> <strong> 정전기 </strong><strong> 드라이버 </strong> 높은 가격과 틈새 용도로 인해 더 드물며 주로 오픈 백 헤드폰에서 발견됩니다. </p> <p> 이 드라이버는 정전기를 사용하여 사운드를 생성합니다. 다이어프램은 반대로 대전 된 두 개의 전도 판 사이에서 앞뒤로 당겨져 전기 신호의 지속적인 변화를 허용하여 왜곡없는 사운드를 생성합니다. 평면 마그네틱 드라이버와 유사하게이 디자인은 더 많은 공기 변위를 허용하여 청취자에게 더 나은 저음을 남깁니다. </p> <p> 정전기 드라이버가 작동하는 방식으로 인해 고전압 신호가 필요하므로 증폭기와 함께 사용해야합니다. 이러한 신호는 대부분의 소비자 용 헤드폰 잭은 물론 일부 전문 앰프에서도 얻을 수 없습니다. 정전기 드라이버가있는 헤드폰을 사용하려면 매우 비싼 정전기 증폭기가 필요합니다. </p> <p> </p> <p> 정전기 드라이버는 왜곡이 거의없는 우수한 사운드 스테이지를 제공하지만 평면 자기 드라이버를 사용하는 다른 오픈 백 헤드폰을 사용하는 것이 좋습니다. 이는 정전기 드라이버와 유사한 청취 경험을 제공하지만 비용이 적게 들고 작업하기가 더 쉽습니다. </p> <p> </p> <h2 id=\"which-headphone-driver-should-you-get\"> 어떤 헤드폰 드라이버를 받아야합니까? </h2> <p> <img alt=\"Razer Gaming Headphones\" src=\"images/razer-gaming-headphones-992.jpg\" loading=\"lazy\"> </p> <p> 헤드폰은 다양한 종류의 사람들을 위해 제작되었습니다. 오디오를 믹싱 할 때 집에서 헤드폰 만 사용하는 음악가라면 평면 마그네틱 드라이버가있는 개방형 헤드폰을 사용하는 것이 좋습니다. </p> <p> 달리기 선수라면 대형 오픈 백 헤드폰을 구입하는 것이 최선의 선택이 아닐 수 있습니다. 작지만 훌륭한 사운드의 밸런스드 아마추어 드라이버가있는 이어 버드가 유용 할 것입니다. 당신을 위해 만들어진 뛰어난 사운드의 헤드폰이 있습니다. 이제 그들을 찾을 시간입니다. </p>"}