{"title":"MTA-STS 란 무엇이며 이메일을 어떻게 보호합니까?","content":"<p> 이메일은 대부분의 사이버 공격의 가장 큰 원인입니다. 멀웨어, 애드웨어, 스팸, 피싱에 대한 쉬운 액세스 포인트이며 위협 행위자가 개인 정보를 얻을 수있는 무한한 기회를 제공합니다. </p> <p> 이러한 위협을 완화하려면 개인 및 비즈니스 이메일 계정 모두에 대해 엄격한 보안 조치를 취해야합니다. </p> <h2 id=\"email-security-and-encryption\"> 이메일 보안 및 암호화 </h2> <p> 다른 통신 모드의 인기에도 불구하고 이메일 메시징은 개인이나 조직에서 전송되는 데이터의 가장 큰 형태입니다. 이메일 콘텐츠 보안은 필수입니다. </p> <p> 이메일 보안은 모든 수신 및 발신 이메일 트래픽의 검사 및 암호화를 수반합니다. 암호화는 안전한 SMTP (Simple Mail Transfer Protocol) 연결을 보장하여 이메일 콘텐츠의 개인 정보를 그대로 유지하는 데 중요한 역할을합니다. </p> <p> 최근까지 암호화는 SMTP의 선택적 요구 사항 일뿐이었습니다. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> 이메일 암호화는 어떻게 작동합니까? </h2> <p> 이메일 암호화는 메시지 콘텐츠에 암호 또는 코드를 추가하여 해독 할 수 없도록 만드는 프로세스입니다. 이메일 데이터를 코드로 변환함으로써 콘텐츠가 무단 노출로부터 보호됩니다. 간단히 말해, 귀하의 이메일은 스크램블됩니다. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> 보안을 강화하기 위해 암호화 프로세스는 암호화 된 키가 암호화 된 이메일을 잠그고 잠금 해제하기 위해 교환되는 공개 및 개인 키를 사용합니다. 발신자는 공개 키 암호화를 사용하여 이메일을 암호화 한 다음 수신자는 개인 키를 사용하여 수신 된 메시지를 해독합니다. </p> <p> 암호화는 처음부터 끝까지 이메일의 전체 과정에 적용됩니다. 모범 사례로 중요한 정보를 전달하는 이메일뿐 아니라 모든 수신 및 발신 이메일을 암호화해야합니다. 이는 위협 행위자가 시스템에 진입하는 것을 방지합니다. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> SMTP 관련 배경 및 문제 </h2> <p> 1982 년에 SMTP 프로토콜이 등장했을 때 이메일 암호화는 일반적인 관행이 아니 었으며 기본적으로 이메일은 일반 텍스트로주고 받았습니다. 전송 수준에서 보안을 도입하기 위해 1990 년대 후반에 STARTTLS 명령이 추가되어 다음을 통해 암호화 옵션을 제공했습니다. <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> TLS (Transport Layer Security) 프로토콜 </a> . </p> <p> TLS 업그레이드가 유망한 것처럼 보이지만 두 가지 보안 허점을 그대로 유지했습니다. </p> <ol> <li> 암호화 옵션은 다음과 같습니다. <strong> 선택 과목 </strong> . 보안되지 않은 이메일이 여전히 만연하여 사이버 공격이 급증했습니다. </li> <li> STARTTLS를 사용하더라도 SMTP 서버는 인증서의 유효성을 검사하지 않기 때문에 보낸 사람의 서버 ID를 인증 할 방법이 없었습니다. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> MTA-STS의 등장 </h2> <p> 2019 년에 Google은 마침내 한 발짝 더 나아가 새로운 MTA-STS (Mail Transfer Agent / Strict Transport Security) 표준의 채택을 발표했습니다. <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> 이를 통해 메일 서비스 제공 업체는 SMTP 연결 보안을 위해 TLS를 적용 할 수 있으며 신뢰할 수있는 서버 인증서로 TLS를 제공하지 않는 MX 호스트에 대한 이메일 전송을 거부 할 수있는 옵션도 제공합니다. </p> <p> MTA-STS는 마지막으로 통신하는 SMTP 서버간에 암호화를 적용하여 SMTP의 모든 이전 문제를 처리합니다. 그러나 실제로 어떻게 작동합니까? 알아 보자! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> MTA-STS는 어떻게 작동합니까? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS는 다음 두 가지 조건에서 다른 SMTP 서버와 만 통신하도록 SMTP 서버에 지시하여 작동합니다. </p> <ol> <li> SMTP 서버 <strong> 절대로 필요한 것 </strong> 암호화됩니다. </li> <li> 서버 인증서의 도메인 이름이 정책의 도메인과 일치하며 인증서가 최신 상태입니다. </li> </ol> <p> DNS와 HTTPS의 조합을 사용하여 정책을 게시함으로써 MTA-STS는 암호화 된 통신 채널을 시작할 수없는 경우 발신자에게 진행 방법을 알립니다. </p> <p> 수신자 측에서 MTA-STS를 구현하는 것은 쉽지만 발신자에게는 다음과 같은 지원 메일 서버 소프트웨어가 필요합니다. <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> 사용되어야한다. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> MTA-STS는 어떤 유형의 공격을 완화합니까? </h2> <p> MTA-STS가 전자 메일 통신에 적용되면 다음 위협이 정면으로 충족됩니다. </p> <p> <strong> MITM (Man-In-The-Middle) 공격 : </strong> 이 공격은 공격자가 데이터를 훔치거나 변경하기 위해 두 당사자 간의 통신 중에 개입 할 때 수행됩니다. 이메일의 경우 일반적으로 두 개의 통신 SMTP 서버를 의미합니다. MTA-STS를 사용하면 이러한 공격을 쉽게 예방할 수 있습니다. </p> <p> <strong> 다운 그레이드 공격 : </strong> 위협 행위자는 네트워크 채널을 안전하지 않은 데이터 전송 모드로 강제로 변경합니다. 예를 들어이 공격은 웹 사이트 방문자를 HTTPS 버전의 사이트에서 HTTP 버전으로 리디렉션 할 수 있습니다. MTA-STS는 무단 액세스를 방지하여 이러한 공격을 방지합니다. </p> <p> <strong> DNS 스푸핑 공격 : </strong> 이러한 교활한 공격은 사용자가 의도 한 대상의 DNS 레코드를 변경하고 합법적 인 사이트 나 도메인을 방문하고 있다고 믿도록 속입니다. MTA-STS를 구현하면 이러한 공격을 완화하는 데 크게 도움이됩니다. </p> <p> </p> <p> 이제 MTA-STS에 익숙해 졌으므로 TLS보고로 알려진 새로운 SMTP보고 표준을 살펴볼 차례입니다. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> SMTP TLS보고 (TLS-RPT) 란 무엇입니까? </h2> <p> MTA-STS와 마찬가지로 TLS-RPT는 전송 응용 프로그램 간의 연결 문제 및 불일치를 감지하는보고 표준입니다. 활성화되면 이메일을 보내는 동안 외부 서버에서 발생한 모든 연결 문제에 대한 일일 보고서를 보냅니다. </p> <p> 보고서를 사용하여 잠재적 인 문제 및 구성 문제를 측정하고 분류하는 데 사용할 수있는 문제 해결 도구로 생각하십시오. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> TLS-RPT는 어떤 유형의 문제를 해결합니까? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> 진단보고 : </strong> TLS보고는 전송 문제에 직면 한 인바운드 이메일에 대한 포괄적 인 세부 정보가 포함 된 JSON 파일 형식의 진단 보고서를 제공합니다. 예를 들어 다운 그레이드 공격으로 인해 반송되었거나 전송되지 않은 이메일도 탐지합니다. </p> <p> <strong> 가시성 향상 : </strong> TLS-RPT를 활성화하면 모든 이메일 채널에 대한 가시성을 향상시킬 수 있습니다. 이를 통해 실패한 메시지도 포함하여 진행중인 모든 데이터를 주시 할 수 있습니다. </p> <p> <strong> 일일 보고서 : </strong> 진단 보고서는 MTA-STS 정책을 심층적으로 다루고 준수하기 위해 하루에 한 번 이상 전송됩니다. 보고서에는 오류 및 실패한 배달에 대한 자세한 정보는 물론 트래픽 통계도 포함됩니다. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> 다른 모든 것이 실패하면 암호화가 우선합니다 </h2> <p> 지속적으로 진화하는 사이버 위협의 특성으로 인해 엄격한 보안 조치 및 암호화는 안전하고 안전한 이메일 전송을 위해 반드시 필요합니다. </p> <p> 강력한 암호화 기능과 MTA-STS 표준을 제공하는 다양한 이메일 제공 업체 덕분에 완전히 안전한 이메일 전송은 더 이상 먼 현실이 아닙니다. </p>"}