{"title":"Samsung Galaxy S21에 어떤 충전기가 필요합니까?","content":"<p> 충성도 높은 삼성 사용자에게 충격으로 다가 왔을 수있는 주력 제조업체는 Galaxy S21, Galaxy S21 + 및 Galaxy S21 Ultra 용 상자에 충전기를 포함하지 않기로 결정했습니다. </p> <p> 이는 iPhone 12 시리즈에서 충전기를 제거하려는 Apple의 큰 움직임에 따라 소비자가 미리 구입 한 충전기를 사용하거나 새 충전기를 구입하도록 강요합니다. </p> <p> 이제 충전기에서 무엇을 찾아야하는지 궁금 할 것입니다. Samsung Galaxy S21 용 새 충전기를 구입할 때 알아야 할 사항을 나열했습니다. </p> <h2 id=\"galaxy-s21-charger-how-many-watts-do-you-need\"> Galaxy S21 충전기 : 얼마나 많은 와트가 필요합니까? </h2> <p> 당신이 <a href=\"https://www.makeuseof.com/samsung-galaxy-s21-worth-upgrading/\" target=\"_blank\" rel=\"nofollow noopener\"> Samsung Galaxy S21 시리즈로 전환 </a> , 당신은 몇 가지 훌륭한 업그레이드와 하나의 큰 다운 그레이드를 찾을 수 있습니다 : 무료 중 하나로서 충전기 제외. 대신 삼성은 데이터 전송 또는 기존 충전기 연결 용 USB-C 케이블 만 제공합니다. </p> <p> 충전기를 구매하거나 오래된 충전기를 재사용 할 때 가장 중요한 것은 완전히 호환되는지 확인하는 것입니다. </p> <ul> <li> Samsung Galaxy S21 라인업은 USB Power Delivery 3.0을 지원하는 USB-C 충전기와 호환되며, <strong> 최대 25 와트 </strong> , 또는 Quick Charge 2.0. </li> <li> 전력을 공급하는 충전기 <strong> 25 와트 미만은 여전히 ​​작동합니다. </strong> ,하지만 훨씬 더 천천히 전화를 충전합니다. </li> </ul> <p> 이는 노트북이나 다른 장치를 통해 충전하기로 선택한 경우에도 적용됩니다. 따라서 장치에서 초고속 또는 고속 충전 기능을 활성화하는 충전기의 기능을 확인하십시오. </p> <p> 25W 충전의 경우 30 분 충전으로 약 50 %의 배터리 수명을 제공합니다. </p> <p> </p> <h2 id=\"what-types-of-charger-work-with-the-s21\"> S21에서 작동하는 충전기 유형은 무엇입니까? </h2> <p> <img alt=\"samsung wireless charging\" src=\"images/wireless-charger-221.jpg\" loading=\"lazy\"> 이미지 크레딧 : <a href=\"https://www.samsungmobilepress.com/mediaresources/wiresless_charger_trio/images?imgType=lifeStyle\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> 삼성 </a> </p> <p> Galaxy 기기에 맞는 전력 용량을 확인한 후 이제 라이프 스타일과 편의를 지원하는 다양한 유형의 충전기 중에서 선택할 수 있습니다. </p> <ul> <li> <strong> 벽 충전기 : </strong> 벽면 충전기에는 한쪽 끝에 USB 포트가있는 벽면 소켓에 삽입하는 플러그 역할을하는 브릭이 함께 제공됩니다. 이러한 충전기는 충전기 유형 중에서 가장 일반적이며 일반적으로 휴대 전화의 최대 충전 기능을 제공 할 수 있습니다. Samsung Galaxy S21은 고속 충전을 위해 최대 25W의 벽면 충전기를 지원합니다. </li> <li> <strong> 파워 뱅크 : </strong> 파워 뱅크는 휴대폰과 같은 배터리로 작동하는 품목을 충전하는 휴대용 전원 공급원입니다. 일반적으로 고속 충전에 필요한 25W 미만을 제공하지만 백업 전원 공급 장치로는 좋습니다. Galaxy S21 용으로 삼성에서 승인 한 보조 배터리를 살펴 보는 것이 가장 좋습니다. </li> <li> <strong> 무선 충전기 : </strong> 무선 충전기 또는 유도 충전기는 휴대 전화를 상단에 놓거나 충전기의 지정된 위치에 놓을 때 충전하는 플랫폼으로 점점 인기를 얻고 있습니다. <a href=\"https://www.makeuseof.com/wireless-charging-how-it-works-and-everything-else-you-must-know/\" target=\"_blank\" rel=\"nofollow noopener\"> 무선 충전 </a> 기기가 완전히 충전되면 자동으로 꺼 지므로 스마트 폰의 콘센트가 마모되지 않고 과열을 방지합니다. 약 15W의 전력을 제공합니다. </li> </ul> <p> </p> <h2 id=\"how-to-find-the-right-charger\"> 올바른 충전기를 찾는 방법 </h2> <p> 좋은 충전기는 스스로 말할 필요가 없습니다. 제품을 테스트 한 후 제품에 대한 신뢰할 수있는 리뷰를 제공하는 인터넷 포럼이 있습니다. </p> <p> <img alt=\"samsung wall charger\" src=\"images/samsung-charger-479.jpg\" loading=\"lazy\"> </p> <p> 우수한 충전기의 정의 요소 중 일부는 충전기 블록 또는 케이스에 CE, MFI 및 RoHS 기호로 표시된 내구성 및 수명, 우수한 출력 전압 조절, 방음 및 임베디드 인증입니다. </p> <p> 공식 삼성 충전기를 사용하지 않기로 결정한 경우에도 Ebay와 같은 곳에서 찾을 수있는 저렴한 모델 중 하나보다는 알려진 브랜드를 선택하는 것이 좋습니다. 또는 물론 오래된 휴대폰의 충전기를 사용할 수도 있습니다. </p> <p> </p> <h2 id=\"use-an-old-charger-with-the-s21\"> S21에 오래된 충전기 사용 </h2> <p> S21 상자에 충전기가 없다는 것은 실망 스럽지만 삼성은 대부분의 사용자가 어쨌든 이미 하나 (또는 ​​그 이상)를 가지고있을 것이라고 생각하며 아마도 옳을 것입니다. S20에는 25W 충전기가 있었고 지난 몇 년 동안의 대부분의 다른 휴대폰에는 15-25W 충전기가 있었으며 때로는 그 이상이있었습니다. 새 충전기를 전혀 구입할 필요가 없습니다. </p> <p> 그리고 처음으로 삼성 기기로 전환하는 경우 One UI에 익숙해지는 데 도움이 필요할 수 있습니다. 속도를 높이려면이 소프트웨어 사용에 대한 팁과 요령을 확인하십시오. </p>"}