{"title":"곧 Epic의 MetaHuman 캐릭터로 게임을 플레이하게됩니다.","content":"<p> 지금 게임이 현실적으로 보인다고 생각한다면, 에픽 게임즈가 언리얼 엔진으로 작업 한 내용을 충분히 파악할 때까지 기다리십시오. 마음이 날아갈 준비를하십시오. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> 에픽 게임즈, 새로운 MetaHumans 공개 </h2> <p> 당신은 아마도 우리가 말하는 지구가 무엇인지 궁금 할 것입니다. MetaHuman Creator는 Epic Games가 언리얼 엔진에 추가 한 최신 기능입니다. 게임 개발자가 자신의 타이틀을 만드는 데 사용할 수있는 소프트웨어 개발 환경입니다. </p> <p> 에 따르면 <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> 언리얼 엔진 블로그 포스트 </a> 흥미 진진한 새 개발 도구 발표 : </p> <blockquote> <p> MetaHuman 창조주는 클라우드 스트리밍 품질을 손상시키지 않고, 한 시간 미만으로 몇 주 또는 몇 달에서 실시간 디지털 인간 생성을하도록 설계 응용 프로그램을. </p> </blockquote> <p> 따라서 이것은 본질적으로 게임 개발자가 믿을 수 없을 정도로 사실적인 인간 팩시밀리를 만드는 방법입니다. 빠른. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> MetaHuman Creator는 개발자에게 무엇을 의미합니까? </h2> <p> </p> <p> 이것이 소프트웨어 개발에 미치는 영향은 게임 변화입니다. 개발자가 MetaHuman Creator를 사용하여 NPC로 게임 세계를 얼마나 빨리 채울지 상상해보십시오. 뿐만 아니라 디지털 휴먼도 놀랍게 보입니다. </p> <p> 이것은 또한 개발자가 타이틀을 더 빨리 끝낼 수 있다는 것을 의미하므로 수많은 지연을 기다릴 필요가 없습니다. MetaHuman Creator를 사용하면 개발자가 NPC 인구를 빠르게 구축하여 다른 더 긴급한 문제에 시간을 할애 할 수 있습니다. </p> <p> 하지만이 도구가 필요한 이유는 무엇입니까? Epic Games는 다음과 같이 설명합니다. </p> <blockquote> <p> 한 명의 고품질 디지털 휴먼을 만드는 것은 어렵고 시간이 많이 걸립니다. 차세대 플랫폼과 고급 가상 프로덕션에 필요한 품질의 다양한 디지털 휴먼을 만들기위한 노력을 확장하는 것은 참으로 엄청난 작업입니다. </p> </blockquote> <p> 그래서 우리가 말했듯이 이 도구는 시간을 절약하고 워크 플로를 개선하여 개발자가 새로운 세대의 콘솔에 적합한 게임을 제공 할 수 있도록합니다. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> MetaHuman Creator는 게임에 어떤 영향을 미칠까요? </h2> <p> 음, MetaHuman Creator 덕분에 게임 출시가 훨씬 더 빨라질 수 있습니다. 이와 같은 강력한 도구를 사용하여 개발자는 게임 메커니즘을 연마하거나 깨진 게임을 출시하기 전에 실제로 버그를 수정하는 데 더 많은 시간을 할애 할 수 있습니다. </p> <p> 어쨌든, 쓴맛은 제쳐두고, 에픽의 개발 도구는 게임을 더보기 좋게 만들어 줄 것 같습니다. 디지털 휴먼이 실제로 얼마나 숨이 멎는 지보기 위해 렌더링 만 보면됩니다. 하지만 게임에서 볼 때 진정한 마법이 일어날 때입니다. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> 언제 게임에서 MetaHumans를 볼 수 있습니까? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> 말하기 어렵습니다. 현재 Epic은 &quot;앞으로 몇 달&quot;에 조기 액세스 테스트를 위해 Creator 소프트웨어를 고정했습니다. 따라서 곧 MetaHumans를 볼 수 없습니다. </p> <p> 자신 만의 디지털 휴먼을 만들고 싶다면 언리얼 엔진의 MetaHuman Creator를 사용하려면 기다려야합니다. 항상 다른 프로그램에 하나를 조합 해 볼 수는 있지만 확실히 한 시간도 걸리지 않을 것입니다! </p>"}