{"title":"10 rzeczy, o których nie wiedziałeś, że Dokumenty Google mogą zrobić","content":"<p> Dokument Google może wydawać się prosty na pierwszy rzut oka, ale narzędzie produktywności w chmurze ma wiele pomijanych funkcji, które mogą pomóc Ci zrobić więcej w pracy. </p> <p> W tym artykule przyjrzymy się kilku funkcjom Dokumentów Google, o których prawdopodobnie nie wiedziałeś, oraz sposobom ich wykorzystania, aby zaoszczędzić czas na tworzeniu treści. </p> <p> Pamiętaj, że te funkcje są dostępne głównie w komputerowej wersji narzędzia Dokumenty Google. Zostaną wskazane te, które można również wykorzystać w wersji mobilnej. </p> <h2 id=\"voice-typing\"> 1. Pisanie głosowe </h2> <p> Aby skorzystać z funkcji pisania głosowego, otwórz dokument i kliknij <strong> Przybory </strong> z paska menu u góry strony. Wybierz <strong> Pisanie głosowe </strong> z listy rozwijanej. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> Na ekranie pojawi się mikrofon z menu języka, w którym możesz wybrać preferowany język mówienia. Aby wypowiedzieć tekst, kliknij mikrofon lub naciśnij <strong> Cmd + Shift + S </strong> (jeśli używasz Maca) lub <strong> Ctrl + Shift + S </strong> (jeśli używasz komputera z systemem Windows), aby rozpocząć nagrywanie. </p> <p> Aby dodać interpunkcję między tekstem, wypowiedz nazwę znaku interpunkcyjnego, który chcesz dodać, np. „kropkę”, „przecinek” lub „znak zapytania”. Możesz podać instrukcje formatowania, takie jak „nowy wiersz” lub „nowy akapit” lub „przestań słuchać”, jeśli chcesz zrobić sobie przerwę od pisania głosowego, i „wznów”, gdy będziesz gotowy do kontynuowania. </p> <p> Wyszukaj zaawansowane polecenia edycji z tego miejsca <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> lista poleceń </a> na stronie pomocy technicznej Google. </p> <p> Możesz również użyć tej funkcji do transkrypcji dowolnego dźwięku. Po prostu odtwórz dźwięk (z telefonu lub dowolnego innego urządzenia) do zamiany głosu na tekst i powinien to dla Ciebie wpisać. Być może będziesz musiał dokonać kilku zmian, ale zaoszczędzisz dużo czasu. </p> <p> </p> <p> Funkcja pisania głosowego jest dostępna tylko na komputerze, ale działa tylko w przeglądarce Chrome. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Edycja offline </h2> <p> Wiele osób uwielbia Dokumenty Google za funkcję natychmiastowego zapisywania w chmurze, ale może to być niewygodne, jeśli przez jakiś czas nie masz dostępu do Internetu. Dobrą wiadomością jest to, że nadal możesz uzyskiwać dostęp do swoich plików i edytować je w trybie offline. </p> <p> Ta funkcja jest dostępna tylko w Google Chrome i musisz zainstalować i aktywować <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Rozszerzenie Dokumentów Google offline do Chrome </a> . Upewnij się też, że nie przeglądasz w trybie prywatnym. </p> <p> Ta funkcja musi być uruchomiona, gdy jesteś online, ale gdy to zrobisz, możesz pisać i edytować tekst w trybie offline, a następnie zostaną zapisane w chmurze, gdy uzyskasz dostęp do Internetu. Oto jak. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> Aby było możliwe possible <strong> otwieraj i zapisuj pliki Dokumentów Google w trybie offline </strong> , podążać <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> te instrukcje </a> . Ta funkcja jest dostępna na komputerach PC, iOS i Android. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Śledź/przywróć historię wersji dokumentu </h2> <p> Jeśli pracujesz nad dokumentem sam lub z innymi osobami, możesz śledzić zmiany w dokumencie za pomocą funkcji Historia wersji. </p> <p> Możesz także tymczasowo lub na stałe przywrócić dokument do poprzedniej wersji; funkcja, która może uratować życie, jeśli przypadkowo usuniesz części dokumentu i nie możesz użyć <strong> Cofnij </strong> przycisk, aby je przywrócić. </p> <p> Aby skorzystać z funkcji historii wersji, kliknij <strong> Plik </strong> z paska menu i wybierz <strong> Historia wersji </strong> z listy rozwijanej. Zobaczysz, że możesz również nazwać wersję, dzięki czemu możesz używać tego do śledzenia ciągłych zmian w dokumencie, zwłaszcza jeśli inni użytkownicy edytują ten sam dokument. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Ta funkcja jest dostępna tylko na komputerze. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Tryb sugestii i recenzji Review </h2> <p> Chociaż wspaniale jest współpracować z innymi i wspólnie edytować dokument, śledzenie zmian wprowadzonych przez każdą osobę może być trudne (i niechlujne). </p> <p> Funkcja sugerowania pozwala po prostu zasugerować zmiany, jeśli nie chcesz całkowicie zmieniać dokumentu. Twoje sugestie pojawią się w edytorze jako komentarze na pasku bocznym, a redaktor może wprowadzić natychmiastowe zmiany, akceptując sugestię. Możesz także prowadzić wątki konwersacji z <strong> Odpowiadać </strong> , dzięki czemu możesz przekazywać i otrzymywać opinie bezpośrednio na stronie dokumentu bez konieczności wysyłania e-maili tam i z powrotem. </p> <p> Aby zasugerować zmiany, kliknij ikonę ołówka trybu edycji w prawym górnym rogu otwartego dokumentu, a następnie wybierz <strong> Sugestia </strong> . </p> <p> Aby wyświetlić dokument bez sugestii, kliknij <strong> Przeglądanie </strong> . Będziesz mógł czytać bez przekreśleń i wyskakujących okienek komentarzy. </p> <p> Aby zaoszczędzić czas, możesz od razu zaakceptować lub odrzucić wszystkie sugestie. Kliknij <strong> Przybory </strong> , a następnie wybierz <strong> Sprawdź sugerowane zmiany </strong> . Kliknij <strong> Akceptuj wszystkie </strong> lub <strong> Odrzuć wszystko </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Ta funkcja jest dostępna tylko na komputerze. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Dodaj czcionki </h2> <p> Jeśli kiedykolwiek będziesz chciał <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> stylizuj swój tekst </a> w celu dopasowania do Twojego przekazu możesz to zrobić również w Dokumentach Google. Oprócz 24 domyślnych czcionek, które są już zaprogramowane w narzędziu Dokumentów Google, możesz dodać kilka fajnych czcionek do wyboru, aby wizualnie wzmocnić tekst. </p> <p> Aby dodać czcionki, po prostu kliknij <strong> Czcionki </strong> na pasku menu i wybierz <strong> Więcej czcionek </strong> . Wybierz tyle czcionek, ile chcesz z dostarczonej kolekcji. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Ta funkcja jest dostępna tylko na komputerze. </p> <p> </p> <h2 id=\"compare-documents\"> 6. Porównaj dokumenty </h2> <p> To kolejna funkcja, której możesz użyć do śledzenia zmian wprowadzonych w dokumencie przez Ciebie lub współpracownika. Jest to szczególnie przydatne w przypadku dużych dokumentów, a jak sama nazwa wskazuje, możesz porównać dwa dokumenty, aby zobaczyć różnice między nimi. </p> <p> Aby skorzystać z tej funkcji, otwórz dokument bazowy, dla którego chcesz dokonać porównania, a następnie kliknij <strong> Przybory </strong> i wybierz <strong> Porównaj dokumenty </strong> . </p> <p> W wyświetlonym oknie dialogowym wybierz dokument, z którym chcesz go porównać na Dysku, i kliknij <strong> Porównać </strong> . w <strong> Przypisz różnice do </strong> wpisz nazwę współpracownika, który będzie autorem sugerowanych zmian w dokumencie końcowym. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> Różnice pokażą się w taki sam sposób, jak w przypadku <strong> Sugestia </strong> tryb, który omówiliśmy powyżej, a także możesz akceptować lub odrzucać zmiany. </p> <p> Ta funkcja jest dostępna tylko na komputerze. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Znajdź i zamień </h2> <p> Jeśli kiedykolwiek będziesz musiał zastąpić wiele wystąpień błędu w tekście, Dokumenty Google ułatwiają to dzięki funkcji Znajdź i zamień. </p> <p> W przypadku użytkowników, którzy znają funkcję Znajdź i zamień w programie Microsoft Word, działa to tak samo. </p> <p> Aby znaleźć określone słowo lub wyrażenie w dokumencie, użyj skrótu <strong> Ctrl + F </strong> na komputerze z systemem Windows lub <strong> Polecenie + F </strong> na Macu. Wpisz słowo w polu „Znajdź w dokumencie”. </p> <p> Aby zastąpić znaleziony tekst, kliknij trzy kropki po prawej stronie i wybierz <strong> Znajdź i zamień </strong> . </p> <p> Następnie wprowadź tekst w <strong> Odnaleźć </strong> pole, a tekst zastępczy w <strong> Zamienić </strong> pole. Przewiń instancje tekstu za pomocą kursora w górę iw dół, a następnie kliknij <strong> Zastąpić </strong> wymieniać je indywidualnie. Lub kliknij <strong> Zamień wszystko </strong> aby zamienić cały zaznaczony tekst na raz. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Użyj słownika </h2> <p> Aby pomóc Ci się skoncentrować i uniknąć konieczności przełączania się między kartami, gdy szukasz znaczenia słowa, Dokumenty Google mają słownik w aplikacji. </p> <p> Gdy piszesz i chcesz wyszukać słowo, zaznacz je, a następnie kliknij prawym przyciskiem myszy i wybierz <strong> Definiować </strong> z menu. Narzędzie Słownik wyszuka definicję słowa w Internecie i pojawi się po prawej stronie ekranu. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Dodaj akcenty językowe </h2> <p> Pożegnaj się z zapamiętywaniem skrótów klawiszowych z akcentami lub kopiowaniem/wklejaniem liter z akcentami z innych dokumentów. </p> <p> Aby używać liter akcentowanych, musisz pobrać <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> dodatek „Łatwe akcenty” </a> . Umożliwia wstawianie akcentów dla 20 różnych języków bezpośrednio z paska bocznego w dokumencie. </p> <p> Pobierz dodatek Google Doc, otwierając <strong> Przybory </strong> menu, a następnie kliknij <strong> Dodatki </strong> i <strong> Pobierz dodatki </strong> . W wyświetlonym oknie Google Marketplace wyszukaj <strong> Łatwe akcenty </strong> i kliknij niebieski przycisk instalacji, aby dodać go do swojej kolekcji dodatków Google Docs. </p> <p> Po zainstalowaniu kliknij na <strong> Dodatki </strong> wybierz dodatek Easy Accents i zacznij dodawać poprawne akcenty do wszystkich słów obcych. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Ten dodatek jest dostępny tylko na komputerach stacjonarnych, ale klawiatury mobilne zazwyczaj obsługują akcenty językowe, dzięki czemu możesz pisać tekst ze znakami akcentu na telefonie bez dodatku. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Twórz niestandardowe skróty </h2> <p> Większość ludzi zna <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Skróty Microsoft Word </a> , ale możesz też tworzyć własne skróty w Dokumentach Google. Aby utworzyć niestandardowe skróty, kliknij <strong> Narzędzia &gt; Preferencje &gt; Zastępowanie. </strong> Przekonasz się, że istnieje już kilka skrótów do ułamków i symboli (np. zmiana 3/4 na ¾), ale możesz dodać własne. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Ta funkcja jest dostępna tylko na komputerze. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Zrób więcej z Dokumentami Google </h2> <p> Teraz, gdy znasz już te narzędzia Dokumentów Google, możesz je wykorzystać podczas tworzenia kolejnego dokumentu. Mamy nadzieję, że ułatwią ci to! </p>"}