{"title":"5 rzeczy, które mogą sprawić, że zostaniesz na stałe zbanowany z Facebooka","content":"<p> Facebook nie jest tak znany jak Twitter do usuwania kont. Istnieją jednak pewne przestępstwa, które można zabronić, na które Facebook reaguje nie tylko etykietą ostrzegawczą. </p> <p> W tym miejscu przyjrzymy się regulaminowi Facebooka i miejscu, w którym firma wyznacza granicę, przyglądając się historycznym przykładom użytkowników, których Facebook „zde-platformował” ze względu na ich zachowanie. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> Stanowisko Facebooka w sprawie trwałych zakazów </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> W przeciwieństwie do innych serwisów społecznościowych, Facebook nie wymienia wielu wykroczeń, które skutkują trwałym banem. Zamiast tego jako główny czynnik podaje powtarzające się wykroczenia, a nie ich wagę. W rezultacie, teoretycznie, każde naruszenie Facebooka powtarzające się wystarczająco często może skutkować zablokowaniem profilu. </p> <p> Jednak niewiele działań skutkuje całkowitym zakazem, a Facebook jest zaskakująco luźny, jeśli chodzi o niektóre uznane nielegalne działania. Na przykład sprzedaż „towarów podlegających regulacjom”, takich jak broń i marihuana, nie jest dozwolona na portalu Facebook, ale Facebook nie wymienia tego jako zakazanego przestępstwa. </p> <p> Facebook woli oznaczać lub usuwać treści po kolei, zamiast usuwać profile. Są jednak wyjątki. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Niewłaściwe wykorzystanie narzędzi i danych </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> Warunki korzystania z usługi Facebooka określają trzy zakazane przestępstwa. Pierwszym z nich jest zbiór działań, o którym w dalszej części tego artykułu przyjrzymy się bardziej szczegółowo. Drugi i trzeci są bardziej szczegółowe i dotyczą niewłaściwego wykorzystywania narzędzi i danych Facebooka. </p> <p> Te wspólne warunki korzystania z usługi zabraniają dostępu i korzystania z części witryny, które mają być zarezerwowane dla programistów. . Zabrania również używania narzędzi publicznych witryn w sposób, który jest celowo złośliwy, na przykład używanie Facebooka do rozpowszechniania wirusów i złośliwego oprogramowania. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Zagrożenia dla bezpieczeństwa publicznego </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Jednym z niewielu przypadków, w których Facebook twierdzi, że wyłącza konta, jest „rzeczywiste ryzyko obrażeń fizycznych lub bezpośredniego zagrożenia bezpieczeństwa publicznego”. Facebook usuwa również profile, które „głoszą misję przemocy lub są zaangażowane w przemoc”. </p> <p> To było uzasadnienie dla bezterminowego zakazu ówczesnego prezydenta Donalda Trumpa po zamieszkach na Kapitolu w styczniu 2021 roku. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Związek z brutalnymi grupami </h2> <p> Facebook zajął stanowisko w sprawie szkodliwych i groźnych treści na poziomie asocjacyjnym w październiku 2020 r., Kiedy usunął profile związane ze spiskiem QAnon, nawet jeśli poszczególne profile nie zawierały treści zawierających przemoc. Grupa konspiracyjna prowadziła do aktów przemocy od 2016 roku. </p> <p> </p> <p> Facebook zabronił również grupie muzycznej Trapt za posty odnoszące się do grupy nienawiści The Proud Boys. Ekstremistyczna organizacja polityczna od 2016 r. jest zamieszana w przemoc na poziomie ulicy w USA i Kanadzie. </p> <p> Firma zastrzega sobie również prawo do wyłączenia kont, jeśli te konta stanowią zagrożenie prawne dla Facebooka. Ponadto Facebook jest bardziej nieugięty niż inne platformy mediów społecznościowych, jeśli chodzi o współpracę z organami ścigania i organizacjami pomocowymi w przypadku napotkania tego rodzaju treści. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Naruszenie bezpieczeństwa innych kont </h2> <p> Innym z rzadkich przestępstw, które można zabronić na Facebooku, jest „naruszanie bezpieczeństwa innych kont i naszych usług”. Naruszenie bezpieczeństwa usług Facebooka przypomina złośliwe oprogramowanie i niewłaściwe użycie wymienione w warunkach korzystania z usługi. Jednak pomysł naruszenia bezpieczeństwa innych kont prowadzi do doxxingu. </p> <p> </p> <p> Doxxing to udostępnianie poufnych informacji ze świata rzeczywistego użytkownika mediów społecznościowych, potencjalnie obejmujących jego adres domowy lub służbowy, prywatny numer telefonu lub fizyczną lokalizację w czasie rzeczywistym. . Ta praktyka jest często wykonywana z zamiarem wyrządzenia tej osobie krzywdy. </p> <p> </p> <h2 id=\"misinformation\"> 5. Dezinformacja </h2> <p> </p> <p> Oficjalne wytyczne Facebooka mówią, że Facebook nie usuwa dezinformacji, zamiast tego decyduje się na etykietowanie ich, aby mógł przyczyniać się do dialogów bez wprowadzania innych w błąd. Jednak wielu zawieszonych posiadaczy kont twierdzi, że ich usunięcie wynikało z tego, co Facebook nazywa „fałszywymi wiadomościami”. </p> <p> Istnieje wiele powodów, dla których tak się dzieje. W niektórych przypadkach Facebook ustala, że ​​fałszywe wiadomości są również szkodliwe dla zdrowia osobistego lub publicznego. </p> <p> To było <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> Wyjaśnienie Facebooka dotyczące usunięcia teoretyka spiskowego Davida Icke </a> za twierdzenie m.in., że internet 5G powoduje Covid-19. Facebook powiedział również, że Icke „wielokrotnie naruszał” zasady. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Zasady Facebooka i Twoje konto </h2> <p> W większości przypadków Facebook nie ma z tobą problemu, o ile nie używasz platformy do wyrządzania krzywdy innym. Są jednak pewne problemy, w których firma wyznacza linię na piasku. </p> <p> Jeśli nie naruszasz tych warunków korzystania z usługi, powinieneś zachować bezpieczeństwo przed permanentną blokadą na Facebooku. </p>"}