{"title":"8 sposobów, w jakie media społecznościowe mogą pomóc w nauce nowego języka","content":"<p> Czy nadal masz koszmary związane z hiszpańskimi podręcznikami i słabo wyuczonymi lekcjami francuskiego, które uczyłeś się w szkole? Nie bój się. Dzięki internetowi nauka nowego języka może być w dzisiejszych czasach zarówno zabawna, jak i przystępna. </p> <p> W szczególności media społecznościowe pomogły połączyć miliony osób uczących się języków na całym świecie. Niezależnie od tego, czy uczysz się czegoś popularnego, takiego jak niemiecki, czy bardziej mało znanego, takiego jak farerski, znajdziesz szeroki wachlarz zasobów, które pomogą Ci w podróży. </p> <p> Oto kilka sposobów wykorzystania mediów społecznościowych do nauki kolejnego języka obcego. </p> <h2 id=\"join-facebook-groups\"> 1. Dołącz do grup na Facebooku </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> Na Facebooku znajdziesz grupy dla prawie każdego języka, jaki można sobie wyobrazić. Znajdziesz społeczności nowo przybyłych emigrantów, którzy chcą poprawić swoje umiejętności, a także grupy dla uczniów z całego świata. Aby w pełni wykorzystać swoje doświadczenie, powinieneś dołączyć do obu. </p> <p> Aby znaleźć odpowiednie grupy na Facebooku, możesz wykonać proste wyszukiwanie online. Alternatywnie możesz znaleźć to, czego szukasz, z poziomu Facebooka. Aby to zrobić, przejdź do Grup dyskusyjnych i wyszukaj swój język. Otrzymasz wtedy listę społeczności odpowiadających tym potrzebom. </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> Jeśli uczysz się w lokalnej szkole językowej, możesz również stworzyć własną grupę, aby połączyć się z kolegami z klasy. Aby to zrobić, <strong> Przejdź do Grupy &gt; Utwórz nową grupę </strong> . Następnie możesz edytować ustawienia i zacząć zapraszać członków. </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2. Skorzystaj z Reddita </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit to popularne forum internetowe, które jest kopalnią złota dla osób uczących się języków. Znajdziesz subreddity zarówno dla konkretnych języków, jak i ogólnej nauki języków. </p> <p> Gdy dołączysz do subreddita, odkryjesz wiele przydatnych wskazówek i wskazówek od innych uczniów, którzy przeszli Twoją ścieżkę. Znajdziesz również wiele memów, do których bez wątpienia będziesz się odnosił. </p> <p> Aby znaleźć subreddit, przejdź do paska wyszukiwania u góry i wpisz swój język. Po załadowaniu wyników warto dołączyć zarówno do grup uczących się, jak i kulturowych, aby dowiedzieć się więcej o lokalnych zwyczajach. </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. Połącz się z native speakerami </h2> <p> Najlepszym sposobem na szybką naukę języka jest rozmowa z ludźmi, którzy już nim mówią. A media społecznościowe mogą być świetnym miejscem do znalezienia tych prelegentów. Być może będziesz musiał dotrzeć do kilku osób, ale w końcu znajdziesz kogoś, kto będzie chciał poświęcić trochę czasu, aby ci pomóc. </p> <p> Łącząc się z native speakerami w mediach społecznościowych, skup się najpierw na budowaniu przyjaźni. Jeśli jesteś w tym samym mieście co oni, zaproponuj spotkanie z nimi i zapłać za kawę. Osobom znajdującym się dalej, zaoferuj pomoc w nauce jednego z języków, którymi już mówisz. </p> <p> Ich kroki są podobne na każdej platformie mediów społecznościowych. Na Instagramie lub Twitterze obserwuj ich i wyślij wiadomość (jeśli pozwalają na to ich ustawienia prywatności). Możesz zastosować podobne podejście na Facebooku, chociaż niektórzy ludzie mogą być mniej chętni do przyjmowania próśb od znajomych od tych, których nie znają. </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. Twórz własne treści w mediach społecznościowych </h2> <p> Nie musisz tylko konsumować w mediach społecznościowych, aby pomóc sobie w nauce języka. Spróbuj też tworzyć własne posty. Takie postępowanie nie tylko pomoże ci ćwiczyć mówienie i pisanie; możesz również odkryć nowych użytkowników, z którymi możesz ćwiczyć. </p> <p> Masz wiele możliwości tworzenia treści. Na Twitterze możesz dołączyć do rozmów lub napisać kilka swoich tweetów w swoim języku docelowym. Dzięki Instagramowi możesz pisać podpisy, tworzyć grafiki i nagrywać swoje rozmowy. </p> <p> Tworząc własne treści w mediach społecznościowych, otrzymasz również informację zwrotną od native speakerów. Poza tym możesz także rozbudować swoje portfolio i nauczyć się kilku przydatnych nowych umiejętności. </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. Ustaw swoje aplikacje na język, którego się uczysz </h2> <p> Zmiana ustawień telefonu to łatwy sposób na myślenie w języku docelowym i wygodne czytanie. Dodasz także dziesiątki nowych słów do swojego słownika. </p> <p> </p> <p> Wszystkie duże sieci społecznościowe mają ustawienia w aplikacji, w których możesz zmienić język. Na przykład na Instagramie przejdź do <strong> Konto &gt; Język </strong> . Zobaczysz wtedy listę wszystkich języków, których możesz używać. </p> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (2 obrazy) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> Rozszerzać <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> Możesz też zmienić wszystkie języki aplikacji jednocześnie, korzystając z ustawień telefonu. Iść do <strong> Ustawienia </strong> &gt; <strong> Ogólne &gt; Język i region </strong> . Stamtąd zobaczysz listę wszystkich dostępnych języków. Pamiętaj, że w przypadku mniejszych języków optymalizacja konta może nie być możliwa. </p> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (2 obrazy) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> Rozszerzać <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. Wykorzystaj w pełni hashtagi </h2> <p> Używanie i wyszukiwanie za pomocą hashtagów to potężny sposób na znalezienie większej liczby użytkowników w języku, którego się uczysz. Korzystając z różnorodności, możesz łączyć się i korzystać z treści zarówno native speakerów, jak i innych uczniów. </p> <p> Aby znaleźć rodzaj treści, których szukasz, zastanów się, z czego będą korzystać inni uczniowie. Możesz także znaleźć treści native speakerów, wyszukując istniejące tematy w dowolnym kraju. Często można je znaleźć w popularnych postach i artykułach. </p> <p> Aby wyszukać hashtagi, użyj funkcji wyszukiwania w dowolnej aplikacji społecznościowej, której używasz. Możesz także kliknąć posty, które ich używają i znaleźć wszystkie ułożone wyniki. </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. Śledź konta w Twoim języku docelowym </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> Każde interesujące konto, które obserwujesz w języku angielskim, prawdopodobnie ma również odpowiednik w Twoim języku docelowym. Mogą to być masowe publikacje lub mogą być zwykłymi mówcami, którzy czują się bardziej komfortowo, tworząc prace w swoim ojczystym języku. </p> <p> </p> <p> Sprawdź też, czy Twoje ulubione czasopisma, drużyny sportowe i artyści muzyczni mają konta w Twoim języku docelowym. Na przykład wiele największych światowych klubów sportowych ma konta w języku angielskim, hiszpańskim i nie tylko. </p> <p> Podczas obserwowania kont w języku, którego chcesz się nauczyć, dobrą zasadą jest podążanie za nimi tylko wtedy, gdy ich anglojęzyczne treści są równie interesujące. W przeciwnym razie zignorujesz je i przestaniesz obserwować później. </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. Śledź aplikacje do nauki języków w mediach społecznościowych </h2> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (2 obrazy) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> Rozszerzać <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> Aplikacje do nauki języków często mają również aktywne profile w mediach społecznościowych. Są one świetne do zbierania ogólnych wskazówek i odnoszenia się do typowych problemów, z którymi borykają się wszyscy – niezależnie od tego, czy uczą się norweskiego, czy japońskiego. </p> <p> Niektóre konta, które warto śledzić, to Babbel, Busuu i Duolingo. </p> <p> Nie musisz jednak używać tych aplikacji tylko do konsumpcji. Zapraszam do dodawania swoich przemyśleń w komentarzach. Możesz nawet poznać nowych przyjaciół, nawet jeśli uczą się oni zupełnie innego języka niż ty. </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> Spraw, aby nauka języka była przyjemnością dzięki mediom społecznościowym </h2> <p> Więc masz to. Teraz masz więcej pomysłów na wykorzystanie mediów społecznościowych, aby uczynić swoją przygodę z nauką języka przyjemną. Chociaż praca podręcznikowa jest nadal ważna, nie powinna być jedyną opcją. </p> <p> Nawet jeśli nie możesz zoptymalizować aplikacji do języka docelowego, nadal znajdziesz wielu native speakerów i innych uczniów, z którymi możesz się połączyć. </p> <p> Kluczem do nauki języka za pomocą mediów społecznościowych jest zaangażowanie i konsumpcja. Kiedy to zrobisz, odkryjesz, że twoje doświadczenie jest bardziej satysfakcjonujące i nauczysz się słów, których podręczniki nigdy cię nie nauczyły. </p>"}