{"title":"Apple naprawia błąd instalatora macOS Big Sur, który może spowodować utratę danych","content":"<p> Firma Apple naprawiła krytyczny błąd w instalatorze macOS Big Sur, który wyświetlał komunikat o błędzie podczas próby uaktualnienia komputera Mac bez wymaganej dostępnej przestrzeni dyskowej. </p> <p> Zmieniona aktualizacja macOS Big Sur 11.2.1, teraz dostępna w <a href=\"https://apps.apple.com/app/macos-big-sur/id1526878132?mt=12\" target=\"_blank\" rel=\"nofollow noopener\"> Sklep z aplikacjami na komputery Mac </a> , prawidłowo sprawdza, czy masz wystarczająco dużo wolnego miejsca przed rozpoczęciem instalacji, powiedział pan Macintosh <a href=\"https://twitter.com/ClassicII_MrMac/status/1361428354306633728\" target=\"_blank\" rel=\"nofollow noopener\"> Świergot </a> . </p> <p> macOS Big Sur wymaga 35 gigabajtów wolnego miejsca na dysku startowym komputera, z wyłączeniem 13-gigabajtowego instalatora. </p> <p> Nie mogło to nastąpić wcześniej, ponieważ jedną z konsekwencji niedziałającego instalatora jest potencjalna utrata danych. Dla osób, które nie wykształciły nawyku regularnego <a href=\"https://www.makeuseof.com/how-to-back-up-mac/\" target=\"_blank\" rel=\"nofollow noopener\"> tworzenie kopii zapasowej komputera Mac za pomocą Time Machine </a> , ten dość podstawowy błąd może potencjalnie mieć straszne konsekwencje. </p> <h2 id=\"how-to-install-the-new-update\"> Jak zainstalować nową aktualizację </h2> <p> Nowa aktualizacja jest dostępna przez <strong> Preferencje systemowe &gt; Aktualizacja oprogramowania </strong> na komputerze Mac. Jeśli jakieś aktualizacje są dostępne, naciśnięcie przycisku „Aktualizuj teraz” spowoduje ich zainstalowanie. Możesz zostać poproszony o podanie hasła administratora. </p> <p> Aktualizacja nie będzie widoczna, jeśli poprawiona wersja macOS Big Sur 11.2.1 jest już zainstalowana na Twoim komputerze. Zmieniony instalator ma numer kompilacji „20D75”. Aby zobaczyć numer kompilacji oprogramowania macOS Big Sur zainstalowanego na komputerze Mac, kliknij menu Apple i wybierz opcję „O tym Macu”. </p> <p> </p> <p> W otwartym oknie Informacje o tym Macu kliknij kartę „Przegląd”. Zobaczysz nazwę oprogramowania systemu operacyjnego macOS na komputerze, a następnie jego numer wersji. Aby wyświetlić również numer kompilacji, po prostu kliknij numer wersji. </p> <p> Możesz sprawdzić, która wersja systemu macOS jest najnowsza w dokumencie pomocy na <a href=\"https://support.apple.com/HT201260\" target=\"_blank\" rel=\"nofollow noopener\"> Witryna Apple </a> . </p> <p> </p> <h2 id=\"big-sur-s-broken-free-space-check\"> Kontrola wolnej przestrzeni Big Sur </h2> <p> Sprawa wyszła niedawno na jaw dzięki panu Macintoshowi, który pierwotnie zgłosił problem. Publikacja wykryła, że ​​aktualizacja Big Sur zostanie pobrana bez problemów, ale odmówiła rozpoczęcia, ponieważ „Wystąpił błąd podczas przygotowywania aktualizacji oprogramowania”. </p> <p> Problem został napisany kredą do błędu w sprawdzaniu wolnego miejsca w Big Sur. Pan Macintosh mówi, że ludzie narzekają na to od czasu wydania pierwszej publicznej wersji macOS Big Sur w listopadzie 2020 r. Po publikacji, o której Apple powiadomił o problemie, firma szybko przystąpiła do usunięcia paskudnego błędu. </p> <p> </p> <p> „Aktualizacja rozpocznie się, nawet jeśli pozostanie tylko 1% wolnego miejsca i zakończy się niepowodzeniem” <a href=\"https://mrmacintosh.com/big-sur-upgrade-not-enough-hd-space-serious-issue-possible-data-loss/\" target=\"_blank\" rel=\"nofollow noopener\"> Poczta </a> wyjaśnia. A gdy dysk startowy jest prawie w 100% zapełniony, instalator utknął w niekończącej się pętli rozruchowej, próbując ukończyć procedurę instalacji. </p> <p> „To sprawia, że ​​nie masz dostępu do swoich danych” – ostrzegł pan Macintosh. </p> <p> Jedynym sposobem, aby to naprawić, było skasowanie i ponowne zainstalowanie oprogramowania macOS. Ale dzięki poprawionej aktualizacji dostępnej teraz w Mac App Store właściciele komputerów Mac mogą żyć na co dzień, nie martwiąc się, czy aktualizacja do Big Sur może wymazać ich dysk startowy. </p>"}