{"title":"BitPay przenosi Bitcoin do Apple Pay","content":"<p> Użytkownicy BitPay w USA mogą teraz dodawać swoje przedpłacone karty bitcoin do aplikacji Apple Wallet i <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> używaj go do płacenia za rzeczy za pomocą Apple Pay </a> . Klienci spoza Apple wkrótce będą mogli dodawać swoje karty BitPay marki MasterCard do Google Pay i Samsung Pay. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> Jak dodać kartę BitPay do portfela Apple? </h2> <p> Aby dodać kartę BitPay do urządzenia Apple, otwórz aplikację Portfel na iPhonie i kliknij „+” w prawym górnym rogu, a następnie postępuj zgodnie z instrukcjami wyświetlanymi na ekranie, aby zakończyć dodawanie karty. </p> <p> Korzystając z BitPay w aplikacji Portfel, możesz dodać kartę do Apple Pay, przechodząc do <strong> Ustawienia &gt; Portfel i Apple Pay </strong> , a następnie stuknij opcję „Dodaj kartę”. Aby zostać użytkownikiem BitPay i zamówić kartę przedpłaconą, pobierz aplikację BitPay Wallet z <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> Sklep z aplikacjami </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Nowy sposób na wydawanie pieniędzy z Apple Pay </h2> <p> Post na <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog BitPay </a> mówi, że dodanie karty BitPay do Apple Pay to wygodny sposób na wydawanie kryptowalut w większej liczbie miejsc niż wcześniej. „Mamy tysiące klientów aplikacji BitPay Wallet korzystających z karty BitPay, którzy zawsze szukają nowych miejsc i sposobów na wydanie swoich kryptowalut” – powiedział Stephen Pair, dyrektor generalny BitPay. <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> komunikat prasowy </a> . </p> <p> </p> <p> Dzięki Apple Pay posiadacze kart BitPay mogą dokonywać bezpiecznych zakupów zbliżeniowych w sklepach fizycznych, aplikacjach obsługujących Apple Pay oraz w Internecie. Firma zauważa, że ​​klienci oczekujący na dostawę plastikowej karty mogą dodać jej wirtualny odpowiednik do Apple Wallet za pośrednictwem oficjalnej aplikacji BitPay Wallet. Dzięki temu od razu zaczniesz wydawać pieniądze. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> Co to jest karta BitPay? </h2> <p> Karta przedpłacona, która korzysta z sieci Mastercard, karta BitPay umożliwia łatwe dokonywanie płatności zbliżeniowych i płatności PIN, a także wypłatę gotówki z dowolnego kompatybilnego bankomatu. Dzięki aplikacji klienci mogą wykonywać takie czynności, jak przeglądanie salda, żądanie nowego kodu PIN, natychmiastowe doładowanie, a także konwertowanie kryptowaluty na walutę fiducjarną (która jest następnie ładowana na kartę, gotowa do wydania wszędzie tam, gdzie debet Mastercard jest akceptowany na całym świecie). </p> <blockquote> <p> Dla zaawansowanych użytkowników blockchain aplikacja BitPay Wallet obsługuje szereg opcji kupowania i przechowywania kryptowalut oraz dokonywania płatności online. Użytkownicy mogą natychmiast kupować karty podarunkowe od setek najlepszych sprzedawców w sklepach stacjonarnych i internetowych. </p> </blockquote> <p> Karta ma chip EMV i można ją zablokować w sytuacji awaryjnej za pomocą aplikacji. </p> <p> Według firmy, wsparcie dla Google Pay i Samsung Pay planowane jest „pod koniec tego kwartału”. Jeśli chodzi o aplikację BitPay, obecnie obsługuje ona Bitcoin, Bitcoin Cash i Ether, a także cztery kryptowaluty ze stałymi monetami, USDC, GUSD, PAX i BUSD. </p>"}