{"title":"Co to jest czas uniksowy i kiedy była epoka uniksowa?","content":"<p> Dlaczego Unix ma własną koncepcję czasu? Jaka jest epoka i jaki jest problem Y2038? </p> <p> Czas uniksowy to sposób reprezentowania określonej daty i godziny, używany przez Linux, macOS i wiele innych interoperacyjnych systemów. Jest tak rozpowszechniony, że prawdopodobnie używasz go, nie zdając sobie z tego sprawy. Kiedy jednak zrozumiesz czas uniksowy, zauważysz go w wielu kontekstach. Kilka narzędzi może pomóc w pracy z czasem uniksowym. </p> <h2 id=\"what-is-the-purpose-of-unix-time\"> Jaki jest cel czasu uniksowego? </h2> <p> Czas uniksowy to całkowita liczba sekund od ustalonej godziny i daty. Jest to format daty/godziny (lub sygnatury czasowej), który wygląda inaczej niż daty i godziny czytelne dla człowieka, do których jesteśmy przyzwyczajeni. Dzieje się tak wyłącznie ze względu na wydajność. Przechowywanie pojedynczej liczby reprezentującej sekundy zajmuje znacznie mniej miejsca niż przechowywanie oddzielnych wartości dla roku, miesiąca, godziny itp. </p> <p> Oczywiście we współczesnym ujęciu różnica w przestrzeni wcale nie jest taka duża. Ale weź pod uwagę, że Unix powstał pod koniec lat sześćdziesiątych, kiedy dostępna pamięć była znacznie mniejsza. Znacznie używane są również znaczniki czasu, więc ich pamięć się sumuje. Na przykład z każdym plikiem są powiązane trzy sygnatury czasowe. </p> <p> Format jest prawie niemożliwy do przetłumaczenia w twojej głowie, chyba że jesteś matematycznym geniuszem. Ale nadal ma pewne zalety w porównaniu z bardziej czytelnymi alternatywami, takimi jak <strong> śro, 21 paź 2015 07:28:00 GMT </strong> . Możesz bardzo łatwo zamówić dwa uniksowe znaczniki czasu na pierwszy rzut oka. Zwykle szybciej jest też ustalić różnicę między dwoma znacznikami czasu. Dotyczy to w szczególności dat zbliżonych do siebie, takich jak sąsiednie dni. </p> <p> <img alt=\"A screenshot from the Epoch Converter site showing Unix Time\" src=\"images/epoch-converter-110.png\" loading=\"lazy\"> </p> <h3 id=\"about-the-epoch\"> O Epoce </h3> <p> Tak więc czas uniksowy to całkowita liczba sekund od określonego punktu w czasie. Ale jaki jest ten moment w czasie? Jego <strong> 00:00:00 UTC </strong> na <strong> 1 stycznia 1970 </strong> . Jest to często określane jako Epoka Uniksa. Programiści wybrali tę datę dla epoki z wygody, ponieważ była to najbliższa okrągła data, kiedy wymyślili czas uniksowy. </p> <p> Być może widziałeś tę datę, kiedy coś poszło nie tak. To oczywiście błąd, ale taki, który wygląda bardzo dziwnie, gdy skutkuje datą sprzed czasu, gdy wielu z nas się urodziło! Jest to jednak całkowicie zrozumiałe, gdy znasz czas uniksowy. Jeśli jakikolwiek system próbuje wyświetlić znacznik czasu, który nie ma żadnej wartości, często przekłada się to na 0 i daje dokładną datę epoki. </p> <p> </p> <h2 id=\"the-unix-time-data-format\"> Uniksowy format danych czasu </h2> <p> Ściśle mówiąc, nie ma takiego. Pierwotnym typem danych była 32-bitowa liczba całkowita i często tak jest, nawet w znacznie potężniejszych systemach. </p> <p> Ten typ danych pozwala wartości przechowywać łącznie 2^32 sekundy, czyli nieco ponad 136 lat. Ta wartość jest zwykle podpisana, co oznacza, że ​​może być ujemna lub dodatnia. Tak więc zwykle reprezentuje 68 lat po obu stronach epoki, tj. 1902-2038. </p> <p> Oczywiście jest to nadal ograniczony okres. Ale głównym zastosowaniem formatu sygnatury czasowej były koncepcje, takie jak modyfikacja plików. Bardzo potrzebna była reprezentacja czasu bliskiego teraźniejszości, a nie starożytnej historii lub dalekiej przyszłości. Nawet w przypadku aplikacji takich jak kalendarze rzadko występuje potrzeba przedstawiania dat w przyszłości na więcej niż kilkadziesiąt lat. </p> <p> Ale to nie znaczy, że ten ograniczony czas jest bezproblemowy… </p> <h3 id=\"the-year-2038-problem\"> Problem roku 2038 </h3> <p> Błąd Y2K ( <a href=\"https://www.makeuseof.com/tag/worst-programming-mistakes-in-history/\" target=\"_blank\" rel=\"nofollow noopener\"> jeden z najgorszych błędów programistycznych w historii </a> ) dotyczyło systemów komputerowych przechowujących lata jako wartości dwucyfrowe. Kiedy nadszedł rok 2000, takie systemy traktowały go tak, jakby był rok 1900. W rzeczywistości nie było to tak katastrofalne, jak się obawiano, głównie dlatego, że wiele osób poświęciło dużo czasu i wysiłku z góry, przygotowując się do tego. </p> <p> Jeśli zwracałeś uwagę w poprzedniej sekcji, być może zauważyłeś podobny problem, który mógł mieć wpływ na czas uniksowy. Cóż, czas uniksowy ma swój własny problem z danymi: problem Y2k38. (Często jest to określane jako problem, a nie błąd; być może od 2000 roku staliśmy się bardziej optymistyczni!) Kiedy czas uniksowy dosłownie skończy się w 2038 roku, systemy będą traktować nowe daty jako 1902 lub 1970. Po prostu całkowicie mi się nie uda. </p> <p> Przynajmniej ten problem nie dotknie nas z wybiciem północy w sylwestra. Ostatnia sekunda 32-bitowego czasu Unix wypadnie 19 marca. Ewentualnie prawdopodobnie zaktualizujemy większość systemów do 2038 r. W przeciwnym razie i tak będą one do tego czasu przestarzałe. </p> <p> </p> <h2 id=\"some-useful-timestamp-resources\"> Niektóre przydatne zasoby sygnatury czasowej </h2> <p> <a href=\"https://www.epochconverter.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Konwerter Epoki </a> witryna jest prawdopodobnie najbardziej wszechstronnym konwerterem znaczników czasu. Rozpoczyna się od wyświetlenia aktualnego czasu uniksowego — w czasie rzeczywistym — i dodaje do tego prawie każdą możliwą do wyobrażenia funkcję. Jego głównym zastosowaniem jest konwersja między znacznikami czasu a datami czytelnymi dla człowieka w obu kierunkach. </p> <p> Narzędzia Dana to ogromna kolekcja przydatnych aplikacji internetowych, z których jedna to <a href=\"https://www.unixtimestamp.com/index.php\" target=\"_blank\" rel=\"nofollow noopener\"> konwerter znaczników czasu </a> . Jest bardziej podstawowy, ale ma bardzo przejrzystą prezentację i jest łatwy w użyciu. </p> <p> <a href=\"https://time.is/Unix_time_now\" target=\"_blank\" rel=\"nofollow noopener\"> Czas jest </a> prezentuje kolejny, jeszcze bardziej minimalistyczny wygląd. Pokazuje czas w wielu formatach, w tym czas uniksowy. Zawiera aktualny czas w tytule strony, co jest przydatne. </p> <p> <img alt=\"A screenshot of the Time.is websites showing Unix Time\" src=\"images/time-is-177.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"using-unix-time-with-command-line-tools\"> Używanie czasu uniksowego z narzędziami wiersza poleceń </h2> <p> W systemach Linux i macOS <strong> data </strong> program jest podstawowym narzędziem do radzenia sobie z datą/czasem, w tym uniksowymi znacznikami czasu. Wywoływana bez żadnych argumentów, zwraca bieżącą datę/godzinę w formacie czytelnym dla człowieka: </p> <pre><code class=\"hljs ruby\">$ date<br>Wed Feb 10 12:28:30 GMT 2021</code></pre> <p> Jeśli potrzebujesz bieżącej daty/godziny w czasie uniksowym, użyj <strong> +%s </strong> argument: </p> <pre><code class=\"hljs ruby\">$ date +%s<br>1612960114</code></pre> <p> Możesz przekonwertować datę czytelną dla człowieka na znacznik czasu za pomocą times <strong> -re </strong> oflaguj, jeśli twoja wersja <strong> data </strong> wspiera to. Większość wersji Linuksa powinna domyślnie: </p> <pre><code class=\"hljs ruby\">$ date -d \"Jan 2 1970\" +%s<br>82800</code></pre> <p> W systemie macOS, <strong> data </strong> to inny program, który wymaga innego zestawu flag: </p> <pre><code class=\"hljs perl\">$ date -j -f \"%b %d %Y %T\" \"Jan 02 1970 00:00:00\" \"+%s\"<br>82800</code></pre> <p> Idąc w innym kierunku, możesz przekonwertować ze znacznika czasu uniksowego za pomocą <strong> -r </strong> flaga: </p> <pre><code class=\"hljs ruby\">$ date -r 1600000000<br>Sun 13 Sep 2020 13:26:40 BST</code></pre> <p> Niektóre inne programy używają <strong> %s </strong> format do radzenia sobie z czasem uniksowym. Na przykład, jeśli chcesz pokazać datę modyfikacji pliku w czasie uniksowym, z <a href=\"https://www.makeuseof.com/ls-command-linux/\" target=\"_blank\" rel=\"nofollow noopener\"> Wersja dla systemu Linux <strong> ls </strong></a> , możesz użyć: </p> <pre><code class=\"hljs perl\">$ ls -l --time-style=+%s index.tmp.html<br>-rw-r--r-- 1 ubuntu ubuntu 17862 1521649818 index.tmp.html</code></pre> <p> </p> <h2 id=\"how-to-use-unix-time-in-programming-languages\"> Jak korzystać z czasu uniksowego w językach programowania? </h2> <p> PHP ma <strong> czas() </strong> funkcja, która zwraca aktualny uniksowy znacznik czasu. Jego <strong> data() </strong> funkcja przyjmuje znacznik czasu jako drugi argument: </p> <pre><code class=\"hljs ruby\">$ php -r 'echo date(\"Y-m-d\", time());'<br>2021-02-11</code></pre> <p> JavaScript podchodzi do rzeczy w ciekawy sposób. To ma <strong> Data.teraz() </strong> metoda, aby uzyskać liczbę milisekund od epoki Uniksa. Oczywiście możesz podzielić to przez 1000 i zaokrąglić wynik, aby otrzymać równoważny czas uniksowy w sekundach: </p> <pre><code class=\"hljs perl\">> Math.floor(Date.now() / 1000)<br>1613083012</code></pre> <p> </p> <h2 id=\"understanding-unix-time\"> Zrozumienie czasu uniksowego </h2> <p> Czas uniksowy to prosta koncepcja, która pojawia się w wielu miejscach. Kiedy już to zrozumiesz, może ci się to przydać, na przykład przy obliczaniu różnic czasowych. Możesz także rozpoznać, kiedy może to być przyczyną pewnych błędów. </p> <p> Pojęcia takie jak epoka i znaczniki czasu są ważną częścią rozpoczęcia pracy z Linuksem. Aby dowiedzieć się więcej o podstawowych sprawach, takich jak <strong> ls </strong> , zapoznaj się z naszym przewodnikiem po podstawowych poleceniach systemu Linux. </p>"}