{"title":"Canon wprowadza aplikację do usuwania zdjęć, która znajduje Twoje najlepsze ujęcia","content":"<p> Za prawie każdym zdjęciem, które ma idealne zdjęcie, kryje się rolka aparatu pełna innych zdjęć, które wyglądają prawie dokładnie tak samo. Często zdarza się, że fotografowie prawie zawsze trzymają wciśnięty przycisk migawki, obawiając się, że mogą przegapić ulotną chwilę. </p> <p> Przeglądanie dziesiątek, a może nawet setek zdjęć w celu wybrania ulubionych i wolnej przestrzeni dyskowej może być długim i denerwującym procesem. Na szczęście firma Canon wydała nową aplikację, która automatycznie robi to za Ciebie. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> Z łatwością zabierz rolkę zdjęć do kilku najlepszych </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Kanon USA </a> uruchomił aplikację do usuwania zdjęć na <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> Sklep z aplikacjami </a> który pozwala szybko i łatwo znaleźć najlepsze zdjęcia. Sama aplikacja jest bezpłatna, ale aby z niej korzystać, musisz wykupić subskrypcję za 14,99 USD rocznie lub 2,99 USD miesięcznie. Obie opcje subskrypcji mają trzydniowy okres próbny. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> Wiceprezes wykonawczy Canon USA, Tatsuro „Tony” Kano, wyjaśnia: </p> <blockquote> <p> W dzisiejszym ciągle zmieniającym się i przytłaczającym świecie, w którym tysiące zdjęć są rejestrowane i przechowywane w smartfonie, konsumenci potrzebują specjalistycznego, niezawodnego i intuicyjnego narzędzia fotograficznego, które pomoże im wybrać najlepsze zdjęcia w oparciu o lata zaufanej wiedzy i technologii. </p> </blockquote> <p> Aplikacja firmy Canon, nazwana po prostu Photo Culling, działa w oparciu o sztuczną inteligencję o nazwie Photography Intelligence Learning lub w skrócie PHIL. PHIL sugeruje, które zdjęcia należy zachować, a które usunąć, na podstawie wybranej z dwóch opcji usuwania zdjęć. </p> <p> Pierwsza opcja, <strong> Cały ubój </strong> , świetnie nadaje się do <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> lepsza fotografia portretowa </a> . Po wybraniu tej opcji PHIL określi najlepsze zdjęcia, oceniając je na podstawie czterech czynników: ostrości, szumu, emocji oraz tego, czy oczy fotografowanej osoby są zamknięte (jeśli dotyczy). </p> <p> Tymczasem <strong> Podobny ubój </strong> opcja wybiera najlepsze ujęcia, porównując wyniki między podobnymi zdjęciami. Załóżmy na przykład, że zrobiłeś kilka zdjęć chmur, a potem kilka zdjęć kwiatów. Aplikacja podzieli zdjęcia w chmurze i zdjęcia kwiatów na osobne grupy. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Bez względu na wybraną opcję uboju, jeśli wynik zdjęcia jest wyższy od ustawionego wyniku docelowego, zdjęcie zostanie uznane za obrońcę. PHIL zasugeruje usunięcie pozostałych zdjęć, które nie uzyskały wystarczająco wysokiej oceny. Jeśli nie zgadzasz się z PHIL, nie martw się. Nadal masz pełną kontrolę nad wszystkimi swoimi strzałami. </p> <p> </p> <p> Inne funkcje aplikacji obejmują liczbę zdjęć i informacje o wyświetlaniu miejsca w pamięci, albumy ze zdjęciami, ustawienia parametrów ocen zdjęć oraz opcję korzystania z trybu ciemnego. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> Czy pobierzesz aplikację firmy Canon do usuwania zdjęć? </h2> <p> Wydawałoby się, że aplikacja Canon do usuwania zdjęć ma wszystko, czego potrzebujesz, aby proces wyboru najlepszych zdjęć był mniej żmudny. Jednak pod koniec dnia to do Ciebie należy decyzja, czy nienawidzisz uboju zdjęć na tyle, aby uzasadnić płacenie za coś, co możesz zrobić sam (choć prawdopodobnie bardzo powoli i znudzony). </p> <p> W chwili pisania tego tekstu aplikacja nie jest dostępna na Androida, ale być może Canon ma to w swoich kartach na przyszłość. </p>"}