{"title":"Czy możesz uzyskać Netflix na swoim Nintendo Switch?","content":"<p> Wygląda na to, że możesz uzyskać Netflix na każdej platformie. Niezależnie od tego, czy jest to telewizor, dekoder czy telefon, najpopularniejsza na świecie usługa przesyłania strumieniowego jest dostępna wszędzie, gdzie chcesz. Albo to jest? </p> <p> Jeśli posiadasz Nintendo Switch, możesz się zastanawiać, czy możesz na nim oglądać Netflix. Dowiedzmy Się... </p> <h2 id=\"can-you-watch-netflix-on-the-nintendo-switch\"> Czy możesz oglądać Netflix na Nintendo Switch? </h2> <p> <a href=\"https://www.makeuseof.com/nintendo-switch-streaming-services/\" target=\"_blank\" rel=\"nofollow noopener\"> Nintendo Switch obsługuje kilka usług przesyłania strumieniowego </a> ale Netflix nie jest jednym z nich. Przynajmniej oficjalnie. </p> <p> Oznacza to, że nie możesz wejść do eShopu i pobrać aplikacji Netflix. W rzeczywistości w chwili pisania tego tekstu usługi przesyłania strumieniowego oferowane przez Nintendo Switch za pośrednictwem eShopu są ograniczone do Hulu, YouTube i Funimation. </p> <p> Nie możesz też używać przeglądarki internetowej konsoli do oglądania serwisu Netflix. To nie zadziała. </p> <p> Możesz jednak zainstalować Androida na swoim Nintendo Switch, a Netflix jest dostępny na Androida. Jest to skomplikowany proces, który nie jest obsługiwany przez Nintendo. Spowoduje to unieważnienie gwarancji i powinno być podejmowane wyłącznie przez użytkowników, którzy rozumieją proces i konsekwencje. </p> <p> W przypadku większości osób najlepiej jest mieć nadzieję, że Netflix w przyszłości oficjalnie wesprze konsolę Nintendo Switch. </p> <p> W wywiadzie z 2017 r. z <a href=\"https://www.washingtonpost.com/news/the-switch/wp/2017/03/08/nintendos-u-s-ceo-responds-to-our-biggest-gripes-with-the-switch/\" target=\"_blank\" rel=\"nofollow noopener\"> Washington Post </a> , ówczesny prezydent Nintendo of America, Reggie Fils-Aime, powiedział, że Nintendo rozmawiało z Netflix – oczywiście minęło dużo czasu od tego czasu i nic nie zostało zrealizowane. </p> <p> </p> <h2 id=\"can-you-watch-netflix-on-other-nintendo-consoles\"> Czy możesz oglądać Netflix na innych konsolach Nintendo? </h2> <p> Zarówno Nintendo Wii, jak i Nintendo Wii U miały w przeszłości dedykowane aplikacje Netflix. </p> <p> Jednak od 31 grudnia 2020 r. aplikacja Netflix nie była już dostępna dla nowych użytkowników do pobrania z eShopu. </p> <p> 30 czerwca 2021 r. aplikacja Netflix zostanie całkowicie zamknięta dla dotychczasowych użytkowników. W tym momencie żadna konsola Nintendo nie będzie obsługiwała Netflixa. </p> <p> Na razie wystarczy cieszyć się ograniczonymi opcjami przesyłania strumieniowego wideo, które obsługuje Switch, i oglądać Netflix na innym urządzeniu. </p>"}