{"title":"Co to jest MTA-STS i jak chroni Twoje e-maile?","content":"<p> Poczta e-mail jest największym winowajcą większości cyberataków. Jest to łatwy punkt dostępu do złośliwego oprogramowania, oprogramowania reklamowego, spamu i phishingu, który zapewnia cyberprzestępcom nieskończone możliwości zdobycia Twoich danych osobowych. </p> <p> Aby złagodzić te zagrożenia, należy wprowadzić rygorystyczne środki bezpieczeństwa zarówno dla indywidualnych, jak i biznesowych kont e-mail. </p> <h2 id=\"email-security-and-encryption\"> Bezpieczeństwo i szyfrowanie poczty e-mail </h2> <p> Pomimo popularności innych sposobów komunikacji, wiadomości e-mail są nadal największą formą przesyłania danych dla każdej osoby lub organizacji. Zabezpieczanie treści e-maili jest istotną koniecznością. </p> <p> Bezpieczeństwo poczty e-mail obejmuje kontrolę i szyfrowanie całego przychodzącego i wychodzącego ruchu e-mail. Szyfrowanie odgrywa kluczową rolę w zachowaniu prywatności treści wiadomości e-mail w stanie nienaruszonym, zapewniając bezpieczne połączenia SMTP (Simple Mail Transfer Protocol). </p> <p> Do niedawna szyfrowanie było tylko opcjonalnym wymogiem dla SMTP. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> Jak działa szyfrowanie poczty e-mail? </h2> <p> Szyfrowanie wiadomości e-mail to proces polegający na dodawaniu szyfru lub fragmentu kodu do treści wiadomości, dzięki czemu staje się ona nieczytelna. Dzięki konwersji danych e-mail na kod, zawartość jest chroniona przed nieautoryzowanym dostępem. Mówiąc najprościej, Twój e-mail jest zaszyfrowany. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> Jako dodatkowe zabezpieczenie, proces szyfrowania wykorzystuje klucze publiczne i prywatne, w których zaszyfrowane klucze są wymieniane w celu zablokowania i odblokowania zaszyfrowanych wiadomości e-mail. Nadawca szyfruje wiadomość e-mail za pomocą kryptografii klucza publicznego, a następnie odbiorca używa klucza prywatnego do odszyfrowania otrzymanej wiadomości. </p> <p> Szyfrowanie jest stosowane na całej drodze wiadomości e-mail, od początku do końca. Zgodnie z najlepszą praktyką wszystkie przychodzące i wychodzące e-maile powinny być szyfrowane — nie tylko te zawierające poufne informacje. Uniemożliwia to cyberprzestępcom uzyskanie dostępu do systemu. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> Tło i problemy z SMTP </h2> <p> Gdy protokół SMTP powstał w 1982 r., szyfrowanie wiadomości e-mail nie było powszechną praktyką i domyślnie e-maile były wysyłane i odbierane w postaci zwykłego tekstu. Aby wprowadzić bezpieczeństwo na poziomie transportu, pod koniec lat 90. dodano polecenie STARTTLS, które oferowało opcję szyfrowania za pośrednictwem <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> Protokół TLS (Transport Layer Security) </a> . </p> <p> Choć aktualizacja TLS brzmiała obiecująco, pozostawiła nienaruszone dwie luki w zabezpieczeniach: </p> <ol> <li> Opcja szyfrowania była po prostu taka: <strong> opcjonalny </strong> . Niezabezpieczone e-maile wciąż szerzyły się, powodując gwałtowny wzrost liczby cyberataków. </li> <li> Nawet przy włączonym STARTTLS nie było możliwości uwierzytelnienia tożsamości serwera nadawcy, ponieważ serwery SMTP nie weryfikują certyfikatów. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> Przybycie MTA-STS </h2> <p> W 2019 r. firma Google w końcu podeszła do głosu i ogłosiła przyjęcie nowego standardu MTA-STS (Mail Transfer Agent/Strict Transport Security) ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> Daje to dostawcom usług pocztowych możliwość narzucenia TLS w celu zabezpieczenia połączeń SMTP, a także oferuje opcję odmowy dostarczania poczty e-mail do hostów MX, które nie oferują TLS z wiarygodnym certyfikatem serwera. </p> <p> MTA-STS wreszcie zajmuje się wszystkimi poprzednimi problemami z SMTP, wymuszając szyfrowanie między komunikującymi się serwerami SMTP. Ale jak to właściwie działa? Dowiedzmy Się! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> Jak działa MTA-STS? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS zaczyna działać, instruując serwer SMTP, aby komunikował się z innym serwerem SMTP tylko pod dwoma warunkami: </p> <ol> <li> Serwer SMTP <strong> musieć </strong> być zaszyfrowane. </li> <li> Nazwa domeny w certyfikacie serwera jest zgodna z domeną w zasadach, a certyfikaty są aktualne. </li> </ol> <p> Używając kombinacji DNS i HTTPS do publikowania polityki, MTA-STS informuje stronę wysyłającą, jak postępować, jeśli nie można zainicjować zaszyfrowanego kanału komunikacji. </p> <p> Zaimplementowanie MTA-STS po stronie odbiorcy jest łatwe, ale dla nadawcy odpowiednie oprogramowanie serwera poczty, takie jak <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> powinien być używany. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> Jaki rodzaj ataków łagodzi MTA-STS? </h2> <p> Następujące zagrożenia są spotykane bezpośrednio, jeśli MTA-STS zostanie zastosowany do komunikacji e-mail: </p> <p> <strong> Ataki Man-In-The-Middle (MITM): </strong> Atak ten jest przeprowadzany, gdy atakujący interweniuje w trakcie komunikacji między dwiema stronami, aby ukraść lub zmienić dane. W przypadku wiadomości e-mail oznacza to zazwyczaj dwa komunikujące się serwery SMTP. Stosując MTA-STS, można łatwo zapobiec takim atakom. </p> <p> <strong> Ataki obniżające poziom: </strong> Aktor zagrożenia wymusza zmianę kanału sieciowego na niezabezpieczony tryb transmisji danych. Na przykład ten atak może przekierować odwiedzającego witrynę z wersji HTTPS witryny na wersję HTTP. MTA-STS pomaga zwalczać te ataki, zapobiegając nieautoryzowanemu dostępowi. </p> <p> <strong> Ataki fałszowania DNS: </strong> Te sprytne ataki zmieniają rekordy DNS miejsca docelowego użytkownika i sprawiają, że sądzi, że odwiedza legalną witrynę lub domenę. Wdrożenie MTA-STS bardzo pomaga w ograniczaniu tych ataków. </p> <p> </p> <p> Teraz, gdy znamy już MTA-STS, nadszedł czas, aby połączyć bazę z nowym standardem raportowania dla SMTP, znanym jako raportowanie TLS. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> Co to jest raportowanie SMTP TLS (TLS-RPT)? </h2> <p> Podobnie jak MTA-STS, TLS-RPT jest standardem raportowania, który wykrywa problemy z łącznością i rozbieżności między aplikacjami wysyłającymi. Po włączeniu wysyła codzienne raporty dotyczące wszelkich problemów z połączeniem napotkanych przez serwery zewnętrzne podczas wysyłania e-maili. </p> <p> Pomyśl o tym jako o narzędziu do rozwiązywania problemów, w którym raporty mogą być używane do oceny i selekcji potencjalnych problemów i problemów z konfiguracją. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> Jakiego rodzaju problemy rozwiązuje TLS-RPT? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Raportowanie diagnostyczne: </strong> Raportowanie TLS oferuje raporty diagnostyczne w formacie pliku JSON, które zawierają szczegółowe informacje dotyczące wszelkich przychodzących wiadomości e-mail, które napotykają problemy z dostarczaniem. Wykrywa również wiadomości e-mail, które zostały odrzucone lub nie zostały dostarczone na przykład z powodu ataku obniżającego wersję. </p> <p> <strong> Lepsza widoczność: </strong> Włączając TLS-RPT, możesz poprawić widoczność we wszystkich swoich kanałach e-mail. Dzięki temu możesz mieć oko na wszystkie dane, które zbliżają się do Ciebie, w tym również nieudane wiadomości. </p> <p> <strong> Dzienne raporty: </strong> Raporty diagnostyczne są wysyłane co najmniej raz dziennie w celu dokładnego omówienia i przestrzegania zasad MTA-STS. Raporty zawierają również statystyki ruchu oraz szczegółowe informacje o błędach i nieudanych dostawach. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Gdy wszystko inne zawiedzie, szyfrowanie zwycięża </h2> <p> Ze względu na stale ewoluujący charakter zagrożeń cybernetycznych, rygorystyczne środki bezpieczeństwa i kryptografia są niezbędnymi elementami bezpiecznego dostarczania poczty e-mail. </p> <p> Dzięki różnym dostawcom poczty e-mail oferującym silne możliwości szyfrowania i standardom MTA-STS w pełni bezpieczne przesyłanie poczty e-mail nie jest już naciąganą rzeczywistością. </p>"}