{"title":"Disney+ ma blisko 100 milionów subskrybentów","content":"<p> Nigdy nie lekceważ Disneya. Podczas gdy Disney+ został uruchomiony w USA dopiero w listopadzie 2019 r., usługa przesyłania strumieniowego ma teraz prawie 100 milionów subskrybentów. To wzrost, którego nawet firma się nie spodziewała. </p> <h2 id=\"how-many-customers-does-disney-have\"> Ilu klientów ma Disney+? </h2> <p> Jak ogłoszono w <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Raport o wynikach Disneya za I kwartał 2021 r. </a> , Disney+ ma 94,9 mln subskrybentów na całym świecie od 2 stycznia 2021 r. </p> <p> Oznacza to, że liczba ta nie uwzględnia subskrybentów pozyskanych dzięki udanemu wydaniu WandaVision. Nie byłoby niesprawiedliwe założyć, że Disney+ ma teraz ponad 100 milionów subskrybentów. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Ostatnie dane zostały zgłoszone w grudniu 2020 r., Kiedy Disney ogłosił, że zgromadził 86 milionów subskrybentów swojej tytułowej usługi przesyłania strumieniowego. Skok od tego czasu można prawdopodobnie przypisać silnym ekskluzywnym treściom, takim jak drugi sezon The Mandalorian i film fabularny Pixar Soul. </p> <p> Średni miesięczny przychód na abonenta spadł z 5,56 USD rok temu do 4,04 USD dzisiaj, co można przypisać głównie niższym kosztom usługi w Indiach i Indonezji. </p> <p> Hulu i ESPN+, usługi przesyłania strumieniowego, które również należą do Disneya, również odnotowały silny wzrost. Pierwsza z nich wzrosła o 30% rok do roku do 39,4 mln abonentów, podczas gdy druga wzrosła o 83% rok do roku, łącznie 12,1 mln abonentów. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney uruchomił niedawno pakiet łączący wszystkie swoje usługi przesyłania strumieniowego </a> , więc jasne jest, że firma nadal wspiera wszystkie trzy. </p> <p> Star ma również wkrótce pojawić się w wielu regionach, co zapewni ogromny wzrost liczby filmów i programów telewizyjnych oferowanych przez Disney+. </p>"}