{"title":"DeviantArt dodaje pasek boczny i grupy do swojej aplikacji mobilnej","content":"<p> Każdy artysta wizualny ma swój własny, unikalny proces twórczy, ale często — zwłaszcza w dzisiejszej erze cyfrowej — ostatnim krokiem w tym procesie jest udostępnienie gotowego dzieła online. </p> <p> Dawno minęły czasy, kiedy trzeba było szukać muzeów, które zabierają twoje obrazy lub fotografie, aby ludzie mogli je zobaczyć. Zamiast tego wybierz platformę, która najbardziej Ci się podoba i publikuj! </p> <p> Założona w 2000 roku DeviantArt jest jedną z najstarszych społeczności artystycznych w Internecie. DeviantArt uruchomił swoją aplikację mobilną w 2017 roku, a jej najnowsza aktualizacja jest niewielka, ale znacząca. </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt for Mobile poprawia swoją nawigację </h2> <p> DeviantArt ulepszył interfejs użytkownika swojej aplikacji mobilnej, dodając pasek boczny bardzo podobny do tego na stronie DeviantArt. Pasek boczny zapewnia szybki dostęp do strony głównej, dewiantów (artystów), których obserwujesz, oraz grup. </p> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (2 obrazy) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> Rozszerzać <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> Dostęp do ostatniej pozycji na tej liście jest szczególnie godny uwagi, ponieważ przed tą aktualizacją grupy DeviantArt były dostępne tylko w witrynie. Grupy DeviantArt działają podobnie do <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> Grupy na Facebooku </a> — kolekcje użytkowników, którzy zrzeszyli się na platformie o wspólnych zainteresowaniach lub celach. </p> <p> Na pasku bocznym możesz dotknąć <strong> Moje grupy </strong> aby wyświetlić wszystkie grupy, do których należysz, lub <strong> Polecane grupy </strong> aby wyświetlić grupy, które według DeviantArt byłyby dla Ciebie odpowiednie. Możesz także przypiąć ulubione grupy u góry paska bocznego, aby uzyskać łatwiejszy dostęp. </p> <p> Jeśli prowadzisz własną grupę, może ona pojawić się w zalecanej sekcji dla innych dewiantów, którzy mogą być zainteresowani dołączeniem. Jeśli nie jesteś zainteresowany grupą, możesz kliknąć trzy kropki po prawej stronie jej nazwy, aby usunąć rekomendację. </p> <p> Gdy odwiedzasz grupę w aplikacji, zobaczysz zarówno jej odchylenia (zgłoszenia), jak i posty. Administratorzy grup mogą publikować aktualizacje swojej grupy z kanału postów. </p> <p> <strong> Ściągnij: </strong> DeviantArt dla <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> (Wolny) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> Gdzie udostępniasz swoje dzieła online? </h2> <p> Jeśli jesteś artystą, projektantem lub fotografem, który jest w Internecie od dłuższego czasu, prawdopodobnie byłeś kiedyś na DeviantArt. Społeczność nie wydaje się być tak żywa, jak na początku 2000 roku, ale w ostatnich latach liczba nadesłanych prac eksplodowała. </p> <p> Przy tak aktywnej bazie użytkowników niezwykle ważne dla DeviantArt powinno stać się ulepszanie swojej aplikacji mobilnej. W chwili pisania tego tekstu aplikacja ma ocenę 2,6/5,0 w App Store i 3,2/5,0 w Google Play. </p>"}