{"title":"Google udostępnia eksperymentalną sztuczną inteligencję, która symuluje synestezję","content":"<p> Wassily Kandinsky porzucił karierę prawniczą, by studiować malarstwo na Akademii Sztuk Pięknych w Monachium. Jest uznawany za jednego z założycieli czystej abstrakcji w malarstwie, a może to wynikać z intrygującego sposobu, w jaki postrzegał kolory i kształty. </p> <p> To narzędzie AI pozwala pożyczyć uszy Kandinsky&#39;ego. Teraz możesz usłyszeć, co zrobił podczas malowania (lub przynajmniej interpretację Google tego, co opisał). </p> <h2 id=\"what-if-you-could-hear-color\"> Co by było, gdybyś słyszał kolor? </h2> <p> We współpracy z Centre Pompidou w Paryżu firma Google Arts &amp; Culture uruchomiła eksperymentalny projekt o nazwie <a href=\"https://artsandculture.google.com/experiment/sgF5ivv105ukhA\" target=\"_blank\" rel=\"nofollow noopener\"> Zagraj w Kandinsky </a> . </p> <p> Jak sama nazwa wskazuje, interaktywne narzędzie pozwala doświadczyć abstrakcyjnych obrazów Wassily&#39;ego Kandinsky&#39;ego w muzycznej formie. Kandinsky był rosyjskim malarzem, który cierpiał na schorzenie neurologiczne zwane synestezją. </p> <p> <img alt=\"A screenshot of the second part of Play a Kandinsky\" src=\"images/play-kandinsky-screenshot-2-986.png\" loading=\"lazy\"> </p> <p> Partytura, skomponowana przez Antoine&#39;a Bertina i NSDOS, została zainspirowana muzyką z czasów Kandinsky&#39;ego i wygenerowana na Transformerze Google&#39;a <a href=\"https://www.makeuseof.com/tag/what-are-neural-networks/\" target=\"_blank\" rel=\"nofollow noopener\"> sieć neuronowa </a> . </p> <p> Po kliknięciu <strong> Uruchom eksperyment </strong> , odtwarzana jest muzyka, a sztuczna inteligencja poprosi Cię o kilkakrotne kliknięcie okręgu na środku ekranu. Za każdym razem, gdy to zrobisz, zmienią się kolory zarówno koła, jak i tła za nim, a także muzyka. </p> <p> Synestezja to stan, który wpływa na twoją percepcję – pobudzenie jednego zmysłu wyzwala automatyczne, mimowolne doświadczenie w innym. Na przykład synestetyk (osoba z synestezją) może pomyśleć o cyfrze „4” i zobaczyć czerwony kolor lub posmakować jabłek, gdy usłyszy słowo „przyjaciel”. </p> <p> Dla Kandinsky’ego synestezja oznaczała, że ​​widział kolory, gdy słyszał muzykę i słyszał muzykę podczas malowania. „Brzmienie kolorów jest tak wyraźne, że trudno byłoby znaleźć kogoś, kto wyrażałby jasnożółty z nutami basowymi lub ciemny lazur z sopranami” – powiedział kiedyś. </p> <p> <img alt=\"Yellow-Red-Blue (1925), by Wassily Kandinsky\" src=\"images/yellow-red-blue-kandinsky-947.png\" loading=\"lazy\"> </p> <p> W 1925 stworzył arcydzieło, które nazwał żółto-czerwono-niebieskim (na zdjęciu powyżej). To obraz olejny odróżniał go od wpływowych nurtów artystycznych jego czasów, czyli konstruktywizmu i suprematyzmu. </p> <p> Trzecia część Play a Kandinsky pozwala usłyszeć obraz w klasycznej symfonii siedmiu części. Jego hojne użycie koloru niebieskiego i żółtego w silnym kontraście do siebie podąża za <a href=\"https://www.makeuseof.com/how-to-use-color-theory-elevate-your-creative-projects/\" target=\"_blank\" rel=\"nofollow noopener\"> teoria koloru </a> niemieckiego poety Johanna Wolfganga von Goethego. </p> <p> Google przypisuje Kandinsky&#39;emu kolory i formy w taki sam sposób, w jaki przypisuje się klawisze i struny instrumentu muzykowi. „Niezwykle utalentowany artysta, ułożył kolorowe dźwięki w kolorowe symfonie” <a href=\"https://artsandculture.google.com/story/the-sound-of-colours/0ALymHuhPl1jLg\" target=\"_blank\" rel=\"nofollow noopener\"> fabuła </a> czyta. </p> <p> </p> <h2 id=\"there-s-more-to-art-than-meets-the-eye\"> Sztuka to coś więcej niż na pierwszy rzut oka </h2> <p> Nigdy nie dowiemy się dokładnie, co Kandinsky słyszał podczas pracy, ale to projekty takie jak ten naprawdę pobudzają kreatywność i introspekcję. </p> <p> Może istnieje jakiś związek między sztuką a muzyką, którego większość z nas nie jest w stanie do końca zrozumieć. Eksperyment Google dobrze sprawdza się w badaniu tej możliwości. </p> <p> <small> Źródło: Wassily Kandinsky/ <a href=\"https://commons.wikimedia.org/wiki/File:Kandinsky_-_Gelb-Rot-Blau,_1925.jpg\" rel=\"nofollow noopener\" target=\"_blank\"> Wikimedia Commons </a></small> </p>"}