{"title":"Google dodaje obsługę Face ID do Chrome na iOS","content":"<p> Google testuje nową funkcję zabezpieczeń w Chrome 89 na iOS, która wykorzystuje uwierzytelnianie biometryczne iPhone&#39;a do ochrony kart przeglądania prywatnego. Obecnie jest to ograniczone do osób korzystających z kanału beta Chrome, dzięki czemu możesz blokować karty incognito za pomocą Face ID lub Touch ID. </p> <h2 id=\"even-more-private-private-browsing\"> Jeszcze bardziej prywatne przeglądanie prywatne </h2> <p> Wszystkie karty incognito chronione za pomocą funkcji Face lub Touch ID są rozmyte na przełączniku kart. Zablokowane karty stają się ponownie widoczne po potwierdzeniu za pomocą uwierzytelniania biometrycznego iPhone&#39;a. </p> <p> Ta pomocna funkcja nie tylko zwiększa Twoją prywatność, ale także zwiększa Twoje bezpieczeństwo podczas wykonywania wielu zadań jednocześnie w aplikacjach na iPhonie lub iPadzie. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9do5Google </a> zauważa, że ​​nie wszyscy użytkownicy wersji beta mogą uzyskać dostęp do nowej opcji blokowania ze względu na komponent po stronie serwera. </p> <p> </p> <h2 id=\"how-s-this-useful\"> Jak to jest przydatne? </h2> <p> Jest to również przydatne w sytuacjach, gdy znajomy może poprosić o pożyczenie iPhone&#39;a, aby szybko wyszukać coś w Internecie. Dzięki funkcji Face ID w trybie przeglądania prywatnego w Chrome nie będą mogli zobaczyć Twoich otwartych witryn w trybie incognito podczas przełączania kart. </p> <p> </p> <p> „Incognito” to nazwa marketingowa trybu przeglądania prywatnego w Chrome. W trybie incognito możesz przeglądać internet bez zapisywania przez Chrome żadnych informacji o sesji. Gdy zamkniesz okno incognito, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> wszystkie informacje z tej sesji znikają </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> Jak włączyć Face lub Touch ID w Chrome </h2> <p> Ta nadchodząca nowa funkcja musi zostać ręcznie włączona w sekcji Prywatność w ustawieniach przeglądarki Chrome. Podobna blokada prywatności jest obecna w innych aplikacjach Google. </p> <p> Na przykład w natywnej aplikacji wyszukiwania uwierzytelnianie biometryczne iPhone&#39;a potwierdza Twoją tożsamość po powrocie do sesji incognito po 15 minutach. Opcjonalne uwierzytelnianie Face lub Touch ID jest również dostępne na Dysku Google, aby chronić Twoje pliki po zamknięciu aplikacji. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> Kiedy funkcja zostanie oficjalnie wydana? </h2> <p> Na razie nie wiadomo, kiedy nowa opcja blokowania może zostać udostępniona wszystkim, ale oczekuje się, że Chrome 89 zostanie udostępniony publicznie w przyszłym miesiącu. Google może również zdecydować, że w ogóle nie wyda tej funkcji, mimo że jest wymieniona w oficjalnych informacjach o wydaniu. </p>"}