{"title":"HBO Max zadebiutuje w Ameryce Łacińskiej w czerwcu","content":"<p> HBO Max, usługa przesyłania strumieniowego WarnerMedia, zostanie uruchomiona w Ameryce Łacińskiej i na Karaibach w czerwcu 2021 roku. Po raz pierwszy usługa będzie dostępna poza Stanami Zjednoczonymi. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> Gdzie jest premiera HBO Max w Ameryce Łacińskiej? </h2> <p> W tej chwili HBO Max jest dostępny tylko w USA. Pod koniec czerwca 2021 r. będzie dostępny w wielu krajach Ameryki Łacińskiej i Karaibów. Wiadomość została ogłoszona w <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> Komunikat prasowy WarnerMedia </a> . </p> <p> W szczególności są to: Anguilla, Antigua, Argentyna, Aruba, Brytyjskie Wyspy Dziewicze, Bahamy, Barbados, Belize, Boliwia, Brazylia, Kajmany, Chile, Kolumbia, Kostaryka, Curacao, Dominika, Dominikana, Ekwador, Salwador , Grenada, Gwatemala, Gujana, Haiti, Honduras, Jamajka, Meksyk, Montserrat, Nikaragua, Panama, Paragwaj, Peru, St. Kitts i Nevis, St. Lucia, St. Vincent, Surinam, Trynidad i Tobago, Turks i Caicos, Urugwaj i Wenezueli. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> Co HBO Max zaoferuje w Ameryce Łacińskiej? </h2> <p> </p> <p> Obecni abonenci HBO GO, którzy płacą bezpośrednio lub za pośrednictwem „kwalifikujących się partnerów”, otrzymają natychmiastowy dostęp do HBO Max. HBO GO będzie następnie stopniowo wycofywane w różnych regionach. </p> <p> Szczegóły cenowe nie zostały ogłoszone, ale są obiecane w najbliższych miesiącach, wraz z informacjami o nowych treściach i ofertach promocyjnych. </p> <p> Podobnie jak w USA, HBO Max będzie oferować różnorodne pakiety subskrypcji i urządzenia pomocnicze, takie jak smartfony, tablety i inne inteligentne platformy. </p> <p> </p> <p> W zwiastunie zapowiadającym wiadomości można zobaczyć klipy z serii takich jak Gra o tron ​​i przyjaciele, a także filmy takie jak Matrix i Casablanca. Jednak na końcu pojawia się mały komunikat ostrzegający, że „nie wszystkie tytuły [będą] dostępne w momencie premiery”. </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> Kiedy HBO Max będzie dostępny na całym świecie? </h2> <p> W zeszłym roku Warner Bros. kontrowersyjnie ogłosił, że planuje wydać całą swoją kinową tablicę z 2021 roku dla HBO Max. To spowodowało, że reżyser <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Christopher Nolan nazwał HBO Max „najgorszą usługą streamingową” </a> . </p> <p> Niemniej jednak, podczas gdy niektórzy z branży filmowej mogą narzekać, jest to świetny ruch pro-wyboru dla konsumentów. </p> <p> W związku z tym mieszkańcy Ameryki Łacińskiej i Karaibów prawdopodobnie będą podekscytowani premierą HBO Max, mając nadzieję, że umowa dotyczy również ich. </p> <p> A co do reszty świata? Nie ustalono żadnych konkretnych dat, ale WarnerMedia ujawniło, że Skandynawia, Hiszpania, Europa Środkowa i Portugalia mają zostać uaktualnione do HBO Max jeszcze w tym roku. </p> <p> Johannes Larcher, szef HBO Max International, powiedział: </p> <blockquote> <p> Jesteśmy podekscytowani wprowadzeniem HBO Max w Ameryce Łacińskiej i na Karaibach, co jest pierwszym krokiem do udostępnienia usługi WarnerMedia Direct-to-Consumer konsumentom poza Stanami Zjednoczonymi i na całym świecie. </p> </blockquote>"}