{"title":"iPhone 13 może pochwalić się wyświetlaczem „zawsze włączonym”","content":"<p> Apple wprowadził swój „zawsze włączony” wyświetlacz dla Apple Watch Series 5 w 2019 roku. Kilka lat później może pojawić się na iPhonie, według reportera Maxa Weinbacha, który udostępnił informacje na kanale YouTube <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> WszystkoApplePro </a> . </p> <p> Raport twierdzi, że iPhone 13 – jeśli rzeczywiście tak nazwał go Apple – będzie miał na stałe podświetlone niektóre sekcje ekranu, aby pokazać pewne szczegóły. </p> <h2 id=\"how-always-on-display-will-work\"> Jak działa wyświetlacz „Zawsze włączony”? </h2> <p> Te szczegóły mogą obejmować zarówno ikony zegara, jak i baterii. Pozostałyby widoczne nawet wtedy, gdy iPhone jest zablokowany, co oznacza, że ​​nie jest aktywnie używany przez użytkownika. Powiadomienia, takie jak powiadomienia o nowych wiadomościach, byłyby podświetlane tylko tymczasowo. </p> <p> Byłby to pierwszy raz, gdy iPhone jest wyposażony w technologię wyświetlania „zawsze włączoną”. Nie byłby to jednak pierwszy raz, kiedy podobna technologia trafiła na smartfona. Nokia wprowadziła funkcję „zawsze na ekranie” już w 2009 roku. Niedawno stała się ona powszechnie dostępna w różnych telefonach z Androidem – w tym w modelach Huawei, Motoroli, Samsunga, Google i innych. </p> <p> Dużą, oczywistą zaletą opcji „zawsze włączony” jest to, że nie wymaga, aby użytkownik obudził się lub odblokował swój telefon w celu uzyskania dostępu do informacji, nawet jeśli jest to coś tak drobnego jak sprawdzenie godziny. </p> <p> Minusem jest to, że zużywa dodatkową żywotność baterii, co już może być czymś premium na smartfonach. Jednak wyświetlacze AMOLED mogą zmniejszyć ten wpływ baterii, aktywując tylko te piksele na wyświetlaczu, które są potrzebne do wyświetlenia informacji. </p> <p> Innymi słowy, ten „zawsze włączony” wyświetlacz jest zawsze włączony w sensie technicznym – chociaż większość ekranu jest wyłączona i tylko kilka jego części pozostaje podświetlonych przez cały czas. Oznacza to, że wpływ na żywotność baterii nie jest tak duży, jak mógłby być w innym przypadku. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> Czego można oczekiwać od iPhone&#39;a 13 </h2> <p> IPhone nowej generacji prawdopodobnie pojawi się we wrześniu 2021 r. Według Weinbacha będzie on miał taką samą ogólną konstrukcję obudowy, jak seria iPhone 12, chociaż będą pewne ulepszenia pod maską. </p> <p> Obejmą one silniejsze magnesy MagSafe, ulepszony system kamer do robienia zdjęć księżyca i gwiazd, ultraszerokokątny obiektyw aparatu w całej gamie iPhone&#39;a, wideo w trybie portretowym (zamiast tylko zdjęć), wyrafinowany matowy tył i ulepszone A- chip serii. Poprzedni raport twierdził, że Apple może <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> wprowadzenie na wyświetlaczu Touch ID </a> jako alternatywa dla Face ID. </p> <p> Biorąc pod uwagę, że do tego zostało jeszcze ponad pół roku, wiele nowych szczegółów może się pojawić, zanim Apple zaprezentuje swojego kolejnego iPhone&#39;a w trzecim kwartale. Niemniej jednak wydaje się, że młyn plotek już zaczyna działać. Obserwuj tą przestrzeń! </p>"}