{"title":"Jak stworzyć lub edytować wzór w programie Adobe Illustrator","content":"<p> Utwórz wzór w programie Adobe Illustrator, aby szybko zastosować go do kształtów, pociągnięć, a nawet tekstu. Możesz zrobić coś prostego, na przykład wzór kropek, lub zrobić coś bardziej złożonego. Możesz nawet użyć części istniejącej grafiki wektorowej i przekształcić ją również we wzór. </p> <p> Wzory świetnie nadają się do tła, tekstur i nie tylko. Poniżej opisano, jak korzystać z narzędzi do tworzenia wzorców programu Illustrator oraz jak tworzyć i edytować własne wzorce. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Korzystanie z domyślnych wzorów w programie Adobe Illustrator </h2> <p> Program Illustrator zawiera kilka wbudowanych wzorów. Oprócz tego, że są użyteczne same w sobie, są również dobrym sposobem na sprawdzenie, jak działają wzorce. Te wzory dadzą ci również wyobrażenie o tym, jak używać własnych wzorów po ich utworzeniu. </p> <p> </p> <p> Wzorce można znaleźć w oknie Próbki. Jeśli nie jest jeszcze otwarty, przejdź do <strong> Okno &gt; Próbki </strong> z górnego menu. Oprócz jednolitych kolorów w oknie Próbki mogą już znajdować się pewne wzory — ale nie są to jedyne wzory, jakie ma program Illustrator. </p> <p> Kliknij <strong> Biblioteka próbek </strong> w lewym dolnym rogu okna próbki. Najedź na <strong> Wzór </strong> , a następnie wybierz jedną z bibliotek wzorków. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Możesz teraz zastosować te próbki tak samo, jak w przypadku jednolitych kolorów. Tutaj możesz zobaczyć wzory z <strong> Natura_Liście </strong> biblioteka zastosowana jako wypełnienia i obrysy, a także do tekstu. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> Jak zrobić podstawowy powtarzający się wzór w programie Illustrator </h2> <p> Możesz zmienić dowolny wektor we wzór, niezależnie od tego, czy jest to coś, co już zaprojektowałeś, czy coś, co tworzysz z myślą o tym konkretnym zamiarze. Możesz to zrobić z całą grafiką wektorową, pojedynczą warstwą lub czymkolwiek pomiędzy. </p> <p> Wszystko, co musisz zrobić, to wybrać, co chcesz zamienić we wzór, a następnie przeciągnąć go do okna Próbki. Na przykład możesz przeciągnąć kocie oko do swoich próbek. W ten sposób powstałaby próbka wzoru, której można następnie użyć do wypełnienia prostokąta lub dowolnego innego kształtu. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> Alternatywnie możesz zrobić to samo z całym wektorem. W obu przypadkach program Illustrator utworzy wzór z tego, co przeciągniesz do okna Próbki. Możesz po prostu zastosować próbkę tak, jak w przypadku zwykłej próbki koloru. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Jeśli klikniesz dwukrotnie próbkę wzoru w oknie Próbki, otworzy się <strong> Opcje wzoru </strong> okno. Możesz również otworzyć to bezpośrednio z <strong> Okna &gt; Opcje wzoru </strong> w górnym menu. </p> <p> Tutaj możesz dalej edytować swój wzór, w tym sposób, w jaki się powtarza i jak duże są przerwy między każdą iteracją obrazu. Możesz również edytować swój projekt wzoru bezpośrednio tutaj. Wersję obrazu, która nie jest przyciemniona, można normalnie edytować. Możesz zmieniać kolory, przenosić warstwy i tak dalej. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> Jest wiele rzeczy, które możesz zrobić w oknie Opcje wzoru. Możesz na przykład powtórzyć swój obraz w układzie cegieł naprzemiennych i zmniejszyć odstęp między poszczególnymi częściami wzoru. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> Dopasuj części wzoru wystarczająco blisko siebie i możesz je nakładać. W ten sposób możesz stworzyć rodzaj kafelkowego wzoru, jak ten pokazany poniżej. Wypróbuj różne ustawienia nakładania w Opcjach wzoru, aby znaleźć coś, co Ci odpowiada. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> Jak stworzyć jednolity wzór w Adobe Illustrator </h2> <p> Jeśli chcesz stworzyć bezproblemowy geometryczny wzór, musisz upewnić się, że projekt ma symetrię. Na przykład linia, która zaczyna się 10 pikseli w górę po lewej stronie wzoru, musi kończyć się 10 pikseli w górę po prawej stronie. Kiedy się powtórzy, te punkty będą musiały się połączyć. </p> <p> Aby to zrobić, utwórz nowy dokument o wymiarach kwadratowych. Włącz nakładkę siatki, naciskając <strong> Ctrl + &quot; </strong> ( <strong> Polecenie + &quot; </strong> na Macu). Przydatne są też inteligentne przewodniki — włącz je za pomocą <strong> Ctrl + U </strong> ( <strong> Polecenie + U </strong> na Macu). Jeśli twoje władcy nie są widoczne, naciśnij <strong> Ctrl + R </strong> ( <strong> Polecenie + R </strong> na Macu), aby je włączyć. </p> <p> Możesz również znaleźć te ustawienia pod <strong> Widok </strong> w górnym menu, ale zalecamy używanie <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Klawisze skrótów programu Illustrator </a> gdzie możesz zaoszczędzić czas. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Rozłóż swój projekt na kwadracie. Wszelkie części, które przechodzą przez krawędzie, muszą być wyrównane po drugiej stronie. <strong> Wyrównać </strong> narzędzie ( <strong> Okno &gt; Wyrównaj </strong> ) może pomóc w prawidłowym uporządkowaniu spraw. Kliknij i przeciągnij z linijek, aby utworzyć własne prowadnice tam, gdzie ich potrzebujesz. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> Ważne jest również, aby mieć kolor tła, nawet jeśli jest biały. Upewnij się, że idealnie pasuje do krawędzi obszaru roboczego, ponieważ potrzebujesz go do przycięcia zbędnego materiału. </p> <p> Wybierz wszystko za pomocą <strong> Ctrl + A </strong> ( <strong> Polecenie + A </strong> na Macu), a następnie naciśnij <strong> Shift + M </strong> aby aktywować <strong> Konstruktor kształtów </strong> narzędzie. Można to również znaleźć w przyborniku. Przytrzymaj <strong> Alt </strong> ( <strong> Opcja </strong> na Macu). To stawia <strong> Konstruktor kształtów </strong> narzędzie w tryb odejmowania. </p> <p> Gdy najedziesz kursorem na części projektu za pomocą tego narzędzia, powinieneś zobaczyć, jak nieznacznie zmieniają kolor. Kliknij obszary, których nie chcesz, a program Illustrator usunie te części, pozostawiając tylko te części, które nakładają się na kwadrat tła. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> Gdy to zrobisz, zaznacz wszystko i przeciągnij do swoich próbek, aby przekształcić je we wzór. Aby użyć wzoru w nowym dokumencie, możesz zapisać go w bibliotece próbek lub skorzystać z biblioteki Adobe Cloud. </p> <p> Możesz też po prostu skopiować go z tego okna próbki i wkleić do innego okna próbki w innym dokumencie. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Możesz teraz zastosować ten wzór jak każdy inny. Jeśli zrobiłeś to dobrze, wszystko powinno być wyrównane bez przerw. W razie potrzeby wprowadź poprawki w dokumencie wzoru. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> Kiedy należy używać wzorów w programie Adobe Illustrator? </h2> <p> Najbardziej oczywistym zastosowaniem wzorów jest tworzenie powtarzalnych kafelków dla tła, ale można ich używać do wypełniania kształtów, aby nadać im również teksturę. Tekst wypełniony wzorkiem to kolejny dobry użytek, który może naprawdę wyróżnić Twoją typografię. </p> <p> Jeśli chcesz, możesz nawet ręcznie tworzyć własne wzory, kopiując i wklejając ten sam obraz w kółko. Może się zdarzyć, że zechcesz to zrobić, ale w większości przypadków najlepszym rozwiązaniem będzie zdolność programu Illustrator do zautomatyzowania tworzenia wzorów. </p> <p> To tylko jeden z wielu sposobów, dzięki którym program Illustrator może ułatwić Ci życie, dając Ci więcej czasu na pracę nad projektami. </p>"}