{"title":"Jak najlepsze komunikatory internetowe wykorzystują szyfrowanie typu end-to-end","content":"<p> Dane osobowe są ważniejsze niż kiedykolwiek. Rządy, firmy i cyberprzestępcy pragną, aby dane osobowe ludzi służyły ich interesom. Różne platformy internetowe ułatwiają przekazywanie danych osobowych bez naszej wiedzy. </p> <p> Z tego powodu ważne jest, aby dobrze zrozumieć, w jaki sposób platformy, z których korzystasz online, chronią Twoją prywatność. Jednym z kluczowych czynników, na który należy zwrócić uwagę przy rozważaniu środków ochrony aplikacji do przesyłania wiadomości, jest szyfrowanie typu end-to-end. </p> <p> Uznając potrzebę priorytetowego traktowania prywatności danych, coraz więcej aplikacji do przesyłania wiadomości podjęło znaczące kroki w celu wdrożenia szyfrowania typu end-to-end. </p> <h2 id=\"what-is-end-to-end-encryption\"> Co to jest szyfrowanie typu end-to-end? </h2> <p> </p> <p> Szyfrowanie od końca do końca to <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> metoda szyfrowania komunikacji </a> aby osoby trzecie nie miały dostępu do informacji udostępnianych między osobami komunikującymi się ze sobą. </p> <p> W przypadku szyfrowania typu end-to-end do ukrycia treści wiadomości używany jest tajny kod, a nie zwykły tekst. Oznacza to, że tylko osoby komunikujące się na platformie zaszyfrowanej od końca do końca mogą czytać wiadomości przesyłane między sobą. </p> <p> Przyjrzyjmy się, jak trzy popularne bezpieczne usługi przesyłania wiadomości, Signal, WhatsApp i Telegram, wykorzystują szyfrowanie typu end-to-end. </p> <p> </p> <h2 id=\"signal\"> Sygnał </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signal jest uważany za jedną z najbezpieczniejszych aplikacji do przesyłania wiadomości. Cała komunikacja na platformie jest domyślnie szyfrowana end-to-end. </p> <p> Signal nie tworzy kopii zapasowych wiadomości w chmurze, co zmniejsza ryzyko złych podmiotów korzystających z alternatywnych metod pozyskiwania informacji. Szyfruje również metadane wiadomości, dzięki czemu lokalizacja i czas działań związanych z przesyłaniem wiadomości nie są śledzone. </p> <p> Dzięki mechanizmowi szyfrowania o otwartym kodzie źródłowym opinia publiczna korzysta z wyższego poziomu przejrzystości technologii stojącej za ich działaniami związanymi z przesyłaniem wiadomości. Użytkownicy mogą przyjrzeć się bliżej szczegółom technicznym, aby lepiej zrozumieć metody stosowane do ochrony ich prywatności. </p> <p> Platformy open source mogą sprawić, że oprogramowanie będzie znacznie łatwiejsze i bezpieczne w dłuższej perspektywie. Ludzie mogą nie tylko lepiej zrozumieć, jak działa oprogramowanie, ale mogą również spróbować skonfigurować własną wersję aplikacji, która może być bardziej odpowiednia dla ich unikalnych potrzeb w zakresie bezpieczeństwa. </p> <p> Signal wykorzystuje kombinację OTR, określaną jako Multi-Party Off-the-Record Messaging, która umożliwia kompleksowe szyfrowanie wiadomości w czatach grupowych. Ryzyko naruszenia danych może wzrosnąć wraz ze wzrostem liczby uczestników sieci. Dzięki szyfrowanemu czatowi grupowemu typu end-to-end takie ryzyko jest znacznie zmniejszone. </p> <p> </p> <h2 id=\"whatsapp\"> WhatsApp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp był jedną z pierwszych popularnych aplikacji do przesyłania wiadomości, która umożliwiała szyfrowanie typu end-to-end. Wykorzystuje szyfrowanie typu end-to-end dla wiadomości i połączeń. </p> <p> WhatsApp korzysta z protokołu szyfrowania end-to-end opracowanego przez Open Whisper Systems, zespół odpowiedzialny za komunikator Signal. To duży plus dla aplikacji, biorąc pod uwagę, jak bezpieczny jest protokół szyfrowania Signal. </p> <p> </p> <p> Korzystanie przez WhatsApp z własnego, zastrzeżonego wdrożenia oznacza, że ​​może nie być tak często badane przez szerokie grono badaczy bezpieczeństwa, jak w pełni otwarte oprogramowanie Signal. </p> <p> Pomimo szyfrowania wiadomości można wykorzystać inne sposoby, aby dowiedzieć się więcej o wiadomościach wysyłanych przez WhatsApp, ponieważ wiadomości można tworzyć w chmurze, a metadane w aplikacji nie są szyfrowane. Ułatwia to poznanie czasu i lokalizacji wiadomości. Ponadto pojawiły się raporty o czatach grupowych WhatsApp zindeksowanych w wyszukiwarce Google, podważając bezpieczeństwo czatów grupowych. </p> <p> </p> <h2 id=\"telegram\"> Telegram </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegram jest uwielbiany za szyfrowanie i samozniszczenie wiadomości. Niestety, w Telegramie istnieje kilka problemów związanych z szyfrowaniem typu end-to-end, które dla wielu użytkowników mogą nie wydawać się tak oczywiste. </p> <p> W Telegramie szyfrowanie typu end-to-end nie jest domyślnie włączone. Jest oferowany tylko wtedy, gdy użytkownicy przełączają się na tajne czaty. Dla użytkowników, którzy nie są technicznie zaawansowani, stanowi to zagrożenie dla bezpieczeństwa, którego mogą nawet nie być świadomi. </p> <p> Telegram może uzyskać dostęp do wiadomości przechowywanych na jego serwerach, których kopie zapasowe są tworzone w jego chmurze. Niektórzy uważają, że stanowi to dodatkowe wektory ataków, które mogą prowadzić do naruszeń danych osobowych w przypadkach, gdy cyberprzestępcy próbują wykraść dane z wiadomości z aplikacji. </p> <p> To powiedziawszy, wszystkie tajne czaty w Telegramie są specyficzne dla urządzenia, co oznacza, że ​​do wiadomości wysyłanych za pośrednictwem tajnych czatów można uzyskać dostęp tylko z urządzenia, z którego zostały wysłane. </p> <p> Podczas gdy tajne czaty Telegrama są szyfrowane od końca do końca, czaty grupowe nie są. Oznacza to, że użytkownicy mogą korzystać z wielu urządzeń w tym samym czacie grupowym. Dzienniki czatów mogą być pobierane przez użytkowników na wiele urządzeń. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Sekretne czaty włączone <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #Telegram </a> oznacza, że ​​Twoje wiadomości są chronione przez szyfrowanie typu end-to-end i są usuwane po określonym czasie. <br><br> Oto jak możesz aktywować tę funkcję. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> — Kasperski (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 31 stycznia 2021 </a></blockquote>  <p> Telegram tworzy podgląd łączy na swoich zdalnych serwerach zarówno z normalnych, jak i tajnych czatów. Gdy użytkownik wpisze link po raz pierwszy na tajnym czacie, aplikacja ostrzega go, że linki zostaną wysłane do zdalnych serwerów. Jest to uważane za słabość bezpieczeństwa, ponieważ wysyłanie łączy udostępnianych na prywatnym czacie do zdalnego serwera jest sprzeczne z celem szyfrowania end-to-end. </p> <p> Protokół szyfrowania Telegrama, MTProto, jest przeznaczony do dostępu do API serwera z aplikacji mobilnych. Jest zastrzeżony i tylko częściowo open source. Stawia to pod znakiem zapytania, jak dużą kontrolę i zrozumienie opinii publicznej ma nad metodami szyfrowania używanymi do ochrony ich wiadomości. </p> <p> Na szczęście aplikacja do przesyłania wiadomości nie spotkała się z poważnymi roszczeniami dotyczącymi naruszeń danych, ale powinna wiedzieć, że operatorzy mogą uzyskać dostęp do Twoich wiadomości. </p> <p> Pomimo obaw, wielu może być uspokojonych różnymi prawnymi obręczami, przez które trzeba będzie przeskoczyć, aby uzyskać dostęp do wiadomości. Telegram wyjaśnił w przeszłości, jak trudno jest ludziom uzyskać dostęp do wiadomości na swojej platformie. Klucze musiałyby być dostępne z różnych jurysdykcji, co frustrowało wielu ludzi. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> Wybór najbezpieczniejszej aplikacji do przesyłania wiadomości </h2> <p> Chociaż Signal może nie być tak popularny jak WhatsApp, jego protokół był znaczącym czynnikiem przyczyniającym się do sukcesu WhatsApp w zakresie szyfrowania end-to-end. Chociaż jego metody szyfrowania end-to-end są podobne do WhatsApp, uważa się, że jest lepsze niż WhatsApp pod względem szyfrowania end-to-end. Wyróżnia się podejmowaniem dodatkowych kroków w celu ochrony użytkowników. </p> <p> Decyzja Telegrama, aby nie traktować priorytetowo szyfrowania typu end-to-end, została przypisana do jego preferencji dla wygody. Tam, gdzie brakuje szyfrowania, nadrabia to pośrednimi metodami ochrony użytkowników za pomocą szyfrowania w chmurze i przechowywania kluczy w różnych jurysdykcjach prawnych. </p>"}