{"title":"Jak zresetować rekomendacje Apple Music","content":"<p> Apple Music posiadało łatwo dostępny sposób na ponowne wybieranie rekomendacji muzycznych poprzez ponowne wybieranie ulubionych wykonawców i gatunków muzycznych. Niestety, podczas aktualizacji aplikacji firma Apple usunęła tę metodę odświeżania Twojej kuracji muzycznej. </p> <p> Nie obawiaj się, oto przewodnik dotyczący alternatywnych metod zatrzymywania lub resetowania automatycznych sugestii Apple Music. </p> <h2 id=\"apple-music-recommendations-explained\"> Wyjaśnienie rekomendacji Apple Music </h2> <p> Przy pierwszym uruchomieniu konta Apple Music po raz pierwszy pojawi się prośba o wybranie ulubionych z szerokiej listy gatunków muzycznych i wykonawców. W ten sposób Apple Music będzie sugerować listy odtwarzania, albumy, artystów i utwory w przyszłości. </p> <p> Na przykład, jeśli wybierzesz Classic Rock, New Rock i Foo Fighters jako jedne z twoich ulubionych utworów muzycznych, Apple Music prawdopodobnie zasugeruje bardzo podobne stacje słuchania i będzie promować niedawno wydaną muzykę rockową. </p> <p> Zmiany w aplikacji oznaczają, że możesz teraz wybierać swoje preferencje muzyczne tylko podczas początkowego tworzenia konta, nie możesz ich zresetować w późniejszym terminie — chociaż Apple Music będzie nadal modyfikować swoje sugestie na podstawie twoich nawyków słuchania. </p> <p> To tylko jeden z kilku przydatnych <a href=\"https://www.makeuseof.com/tag/apple-music-features-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Funkcje Apple Music do użycia </a> . </p> <p> Nie martw się, wciąż istnieje kilka sposobów na zresetowanie Apple Music poprzez wyłączenie preferencji Apple ID lub usunięcie i ponowne utworzenie konta Apple Music. </p> <p> Obie opcje mają zalety i wady, więc zastanówmy się, która opcja jest dla Ciebie najlepsza. </p> <p> </p> <h2 id=\"turn-off-personalized-recommendations\"> Wyłącz spersonalizowane rekomendacje </h2> <p> Wyłączenie spersonalizowanych rekomendacji dla Twojego Apple ID to dobry sposób, aby nie widzieć nowych sugestii. </p> <p> Wyłączenie tej opcji nie spowoduje usunięcia istniejących danych dotyczących kuratorstwa, co oznacza, że ​​aplikacja będzie nadal tworzyć sugestie na podstawie Twojego wykorzystania. Po prostu już ich nie zobaczysz. Wyłączenie spersonalizowanych rekomendacji wpłynie również na rekomendacje w innych aplikacjach serwisowych Apple, takich jak Apple Books. </p> <p> Oto jak wyłączyć spersonalizowane rekomendacje na iPhonie: </p> <ol> <li> Otworzyć <strong> Muzyka Apple </strong> aplikacja. </li> <li> Przejdź do <b> Słuchaj teraz </b> patka. </li> <li> Otwórz swój profil Apple Music, wybierając okrągłą ikonę z sylwetką osoby w prawym górnym rogu ekranu. Jeśli wcześniej przesłałeś zdjęcie jako osobiste zdjęcie profilowe, pojawi się ono zamiast sylwetki. </li> <li> Wybierz <b> Wyświetl Apple ID </b> które można znaleźć, przewijając w dół <b> Konto </b> strona. </li> <li> Wyłączyć <b> Spersonalizowane rekomendacje </b> . </li> <li> Wybierz <b> Gotowy </b> w prawym górnym rogu i gotowe. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (3 obrazy) </strong> <img alt=\"Apple Music Lisen Now featuring Halle x Chloe\" src=\"images/apple-music-listen-now-page-713.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"Apple Music Account Options Screenshot\" src=\"images/apple-music-account-page-914.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"Apple ID Options Screenshot\" src=\"images/apple-id-account-page-817.jpg\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> Po wykonaniu tej czynności wszelkie nowe wyszukiwania, pobieranie lub odtwarzanie muzyki w Apple Music nie będą już wpływać na Twoje automatyczne sugestie. Nie spowoduje to automatycznego usunięcia poprzednich wyszukiwań, co oznacza, że ​​może trochę potrwać, zanim zauważysz efekty tej metody. </p> <p> </p> <h2 id=\"delete-your-apple-music-profile\"> Usuń swój profil Apple Music </h2> <p> Jeśli potrzebujesz kompletnej metamorfozy Apple Music ze świeżymi sugestiami muzycznymi, najlepszą opcją jest usunięcie i ponowne utworzenie profilu Apple Music. </p> <p> Pamiętaj, że usunięcie profilu spowoduje całkowite usunięcie Twojej obecnej biblioteki muzycznej. Utworzenie nowego profilu umożliwi wybór zupełnie nowych preferencji muzycznych i gatunkowych, ale także całkowicie usunie wszelką poprzednią historię Apple Music. </p> <p> </p> <p> Jeśli interesuje Cię zupełnie nowy profil Apple Music z nowo wybranymi ulubionymi, wykonaj następujące kroki, aby go utworzyć: </p> <ol> <li> Od <strong> Słuchaj teraz </strong> przejdź do Apple Music <strong> Konto </strong> i wybierz <b> Zobacz profil </b> . </li> <li> Wybierz <b> Edytować </b> na środku ekranu pod Twoim imieniem. </li> <li> Przewiń w dół ekranu i wybierz <b> Usuń profil </b> . Ostrzegamy, że jest to trwałe usunięcie, które będzie wymagało zresetowania konta. </li> <li> Skonfiguruj dla siebie nowy profil Apple Music, który jest teraz wolny od starych wyborów. Jeśli wyłączyłeś Spersonalizowane rekomendacje zgodnie z opisem w powyższej sekcji, nie będziesz już otrzymywać spersonalizowanych sugestii muzycznych. Odejście <strong> Spersonalizowane rekomendacje </strong> spowoduje, że Apple Music zasugeruje muzykę w oparciu o Twoje nowe nawyki słuchania. </li> <li> Przeglądaj swobodnie i ciesz się szeroką gamą nowo wybranych opcji audio. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (2 obrazy) </strong> <img alt=\"Apple Music Profile feat Halle x Chloe\" src=\"images/apple-music-profile-page-771.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"Apple Music Profile Options Screenshot\" src=\"images/apple-music-edit-profile-page-450.jpg\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> </p> <h2 id=\"spotify-s-recommendations-might-be-better\"> Rekomendacje Spotify mogą być lepsze </h2> <p> Jeśli nadal nie jesteś zadowolony z zaleceń Apple Music, nawet po utworzeniu nowego profilu, być może nadszedł czas, aby zamiast tego zmienić platformy strumieniowego przesyłania muzyki. Apple Music i Spotify mają wiele bardzo podobnych funkcji, ale wiele osób uważa, że ​​Spotify jest znacznie lepszy w sugerowaniu nowej muzyki. </p> <p> Oczywiście, wybierając między Apple Music a Spotify, należy wziąć pod uwagę wiele innych czynników. </p>"}