{"title":"Jak zarządzać grupami użytkowników za pomocą Groupadd w systemie Linux?","content":"<p> Zarządzanie użytkownikami jest całkiem proste, jeśli używasz Linuksa na swoim komputerze osobistym. Ale dla tych, którzy mają serwer z tysiącami użytkowników, zarządzanie staje się poważnym problemem, którym należy się zająć. </p> <p> Na szczęście systemy operacyjne oparte na Linuksie umożliwiają kontrolowanie użytkowników i zarządzanie nimi. Możesz tworzyć grupy i dodawać do nich użytkowników. Wtedy zamiast przydzielać uprawnienia każdemu użytkownikowi w systemie, możesz w prosty sposób autoryzować grupy użytkowników, nadając im uprawnienia związane z przepływem pracy systemu. </p> <h2 id=\"create-user-groups-on-linux\"> Twórz grupy użytkowników w systemie Linux </h2> <p> Linux jest dostarczany z domyślnym poleceniem do tworzenia grup użytkowników. Możesz użyć <strong> groupadd </strong> polecenie w celu dodania nowych grup do systemu. Podstawowa składnia polecenia to: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> Aby utworzyć nową grupę użytkowników „writers”: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> Uruchomienie powyższego polecenia spowoduje dodanie nowego wpisu do <strong> /etc/grupa </strong> i <strong> /etc/gshadow </strong> pliki w twoim systemie. Możesz sprawdzić nowy wpis grupy w plikach, wpisując <strong> kot /etc/grupa </strong> i <strong> kot /etc/gshadow </strong> w swoim terminalu. </p> <p> Pamiętaj, że tylko użytkownicy z uprawnieniami administracyjnymi mogą tworzyć grupy użytkowników. Nie zapomnij przełączyć się na superużytkownika przed wykonaniem polecenia groupadd. </p> <p> Jeśli spróbujesz utworzyć grupę o nazwie, która już istnieje, zobaczysz komunikat o błędzie: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> Możesz jednak odrzucić błąd, używając <strong> -fa </strong> lub <strong> --siła </strong> flaga z poleceniem. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Twórz grupy użytkowników z unikalnym identyfikatorem GID </h3> <p> Podczas tworzenia nowej grupy użytkowników system automatycznie przypisuje jej identyfikator grupy lub GID. Jeśli chcesz, aby Twoja grupa miała określony identyfikator grupy, możesz to zrobić za pomocą <strong> -sol </strong> lub <strong> --kołowacizna </strong> flaga. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Jeśli spróbujesz przypisać identyfikator grupy, który jest już zajęty, wystąpi następujący błąd. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Chociaż nie jest to zalecane, ale możesz dodać <strong> -o </strong> lub <strong> --nieunikalny </strong> flaga, aby wymusić przypisanie identyfikatora grupy. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Twórz grupy użytkowników za pomocą hasła </h3> <p> Chociaż możesz dodać hasło do swoich grup, nie mają one praktycznego zastosowania dla użytkownika. <strong> -p </strong> flaga umożliwia określenie hasła dla grupy użytkowników. </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Twórz grupy systemowe w systemie Linux </h3> <p> Istnieje niewielka różnica między grupami systemowymi a zwykłymi grupami. Grupy systemowe to specjalne grupy obejmujące użytkowników odpowiedzialnych za wykonywanie operacji systemowych, takich jak tworzenie kopii zapasowych i konserwacja. </p> <p> Użyj <strong> -r </strong> lub <strong> --system </strong> flaga, aby utworzyć grupę systemową w systemie Linux: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Uzyskaj listę członków w grupie użytkowników </h3> <p> Aby dowiedzieć się, ilu członków należy do określonej grupy, możesz użyć przycisku <strong> getent </strong> polecenie z terminala. Następujące polecenie wyświetli listę wszystkich członków obecnych w grupie &#39;writers&#39;: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Dodaj użytkowników do grup </h2> <p> Po utworzeniu grupy użytkowników w systemie nadszedł czas, aby dodać do niej kilku użytkowników. Usermod to potężne narzędzie wiersza poleceń, ponieważ zawiera różne opcje związane z zarządzaniem użytkownikami i moderacją. Umożliwia także łatwe dodawanie użytkowników do grupy. Podstawowa składnia polecenia to: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Dodaj istniejącego użytkownika do grup </h3> <p> Jeśli chcesz dodać istniejącego użytkownika do swojej grupy, <strong> -za </strong> i <strong> -SOL </strong> flagi są tym, czego potrzebujesz. <strong> -SOL </strong> flaga oznacza grupy, natomiast <strong> -za </strong> oznacza dołączanie, dodawanie lub dodawanie. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> Możesz także dodać użytkownika do wielu grup. Wystarczy wpisać nazwy grup oddzielone przecinkiem. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Dodaj nowego użytkownika do grupy </h3> <p> Możesz użyć <strong> useradd </strong> polecenie, kiedy chcesz <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> dodaj nowego użytkownika do swojego systemu Linux </a> . Useradd umożliwia przypisanie grupy do użytkownika w momencie jej tworzenia. <strong> -SOL </strong> flaga umożliwia określenie grupy dla użytkownika. </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> Dodanie użytkownika do wielu grup jest również łatwe. Po prostu przekaż nazwy grup oddzielone przecinkiem w domyślnym poleceniu. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Usuń użytkowników z grupy </h2> <p> Możesz także usunąć użytkowników z grupy za pomocą <strong> mod użytkownika </strong> . Należy pamiętać, że w systemie Linux do użytkownika można przypisać wiele grup. Jedna z tych grup jest zadeklarowana jako grupa podstawowa, podczas gdy inne są określane jako grupy drugorzędne. </p> <p> Jeśli próbujesz usunąć użytkownika z grupy, upewnij się, że po usunięciu ma on co najmniej jedną grupę podstawową. Na przykład użytkownik „losowy” jest częścią grupy admin, autorzy i redaktorzy; gdzie admin to grupa podstawowa, a reszta to grupy drugorzędne. </p> <p> Możesz usunąć użytkownika tylko z grupy autorów i redaktorów. Aby to zrobić, musisz przekazać nazwę grupy, do której chcesz, aby użytkownik pozostał członkiem. Oznacza to, że aby usunąć użytkownika „losowo” z edytorów grup, używa się następującego polecenia: </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> Zauważ, że wszystko, co musiałeś zrobić, to rozebrać <strong> dołącz flagę (-a) </strong> z polecenia użytego do dodania użytkownika do grupy. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Usuń grupy w systemie Linux </h2> <p> Jeśli nie chcesz już utrzymywać grupy użytkowników w swoim systemie, możesz usunąć grupę za pomocą <strong> groupdel </strong> Komenda. Składnia polecenia to: </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> Aby usunąć grupę użytkowników „writers”: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Jeśli spróbujesz usunąć grupę, która nie istnieje, otrzymasz komunikat o błędzie: </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Zarządzanie grupami użytkowników w systemie Linux </h2> <p> Zarządzanie użytkownikami może być trudne, jeśli nie znasz poleceń systemu Linux, których musisz użyć. Staje się to naprawdę proste, gdy znasz wszystkie polecenia związane z moderacją i zarządzaniem. </p> <p> Administratorzy serwerów powinni próbować używać dystrybucji Linuksa, które są dobrze dopasowane do ich potrzeb. W ten sposób otrzymają od razu wszystkie narzędzia i narzędzia wymagane do zarządzania serwerem. </p>"}