{"title":"Jak przesłać tekst dalej na Androida","content":"<p> Jeśli chcesz przekazać komuś tekst ze swojego urządzenia z Androidem, nie musisz go wpisywać ani kopiować i wklejać. Zamiast tego możesz skorzystać z funkcji przekazywania. </p> <p> Proces różni się nieco w zależności od używanej aplikacji do przesyłania wiadomości. To powiedziawszy, kroki są proste i mniej więcej takie same. </p> <p> Pokażemy Ci, jak przekazać wiadomość tekstową SMS w standardowej aplikacji Wiadomości na Androida i jej odpowiedniku w Samsungu. </p> <h2 id=\"how-to-forward-a-text-on-android-stock\"> Jak przekazać tekst na Androida (stock) </h2> <ol> <li> W standardowej aplikacji Wiadomości na Androida otwórz rozmowę tekstową zawierającą wiadomość, którą chcesz przekazać dalej. </li> <li> <strong> Nacisnij i przytrzymaj </strong> w wiadomości. </li> <li> Stuknij w <strong> trzy pionowe kropki </strong> w prawym górnym rogu. </li> <li> Z listy wybierz, do kogo chcesz przekazać wiadomość. Ewentualnie, aby wysłać go do osoby, której nie ma na tej liście, dotknij <strong> Nowa wiadomość </strong> . </li> <li> Przekazywana wiadomość pojawi się w polu wiadomości. W razie potrzeby możesz dodać lub zmienić tę wiadomość. Gdy wszystko będzie gotowe, dotknij <strong> przycisk Wyślij </strong> (strzałka w prawo), aby przekazać wiadomość. </li> </ol> <p> </p> <h2 id=\"how-to-forward-a-text-on-samsung-phones\"> Jak przesłać tekst dalej na telefony Samsung </h2> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (3 obrazy) </strong> <img alt=\"forward message android\" src=\"images/forward-message-android-497.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"forward message android searching names\" src=\"images/forward-message-android-searching-names-240.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"forward message android multiple names selected\" src=\"images/forward-message-android-multiple-names-selected-924.jpg\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <ol> <li> Otwórz rozmowę tekstową zawierającą wiadomość, którą chcesz przekazać dalej. </li> <li> <strong> Nacisnij i przytrzymaj </strong> w wiadomości. </li> <li> Kran <strong> Naprzód </strong> . </li> <li> Znajdź odbiorcę, korzystając z <strong> Rozmowy </strong> lub <strong> Łączność </strong> patka. Kliknij ich imię. W razie potrzeby możesz wybrać wielu odbiorców. </li> <li> Kran <strong> Gotowy </strong> . </li> <li> Przekazywana wiadomość pojawi się w polu wiadomości. W razie potrzeby możesz dodać lub zmienić tę wiadomość. Gdy wszystko będzie gotowe, dotknij <strong> przycisk Wyślij </strong> (strzałka w prawo), aby przekazać wiadomość. </li> </ol> <p> </p> <p> </p> <h2 id=\"why-can-t-i-forward-a-text-on-android\"> Dlaczego nie mogę przekazać SMS-a na Androida? </h2> <p> Jeśli nie widzisz opcji przesyłania dalej, prawdopodobnie jest to spowodowane zaznaczeniem całej rozmowy lub wielu tekstów. W przeciwieństwie do niektórych <a href=\"https://www.makeuseof.com/tag/messaging-apps-phone-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> najlepsze aplikacje do przesyłania wiadomości </a> podobnie jak WhatsApp, większość aplikacji do SMS-ów nie pozwala na przesyłanie wielu tekstów jednocześnie. Jeśli napotkasz ten problem, upewnij się, że wybierasz jeden tekst. </p> <p> </p> <h2 id=\"forward-your-calls-on-android\"> Przekieruj swoje połączenia na Androida </h2> <p> Czy wiesz, że wiadomości tekstowe to nie jedyna rzecz, którą możesz przekazywać na Androida? Możesz także skonfigurować przekierowanie połączeń, aby móc przekierowywać połączenia na inny numer. </p>"}