{"title":"Jak zrobić własną grę planszową w Tabletop Simulator","content":"<p> Myślałeś kiedyś o stworzeniu gry do grania ze znajomymi w Tabletop Simulator (TTS)? A może jesteś twórcą gier planszowych, który chce tworzyć prototypy gier i testować je online. </p> <p> Nigdy nie było lepszego czasu na skorzystanie z wszechstronnego środowiska gier TTS. Dzisiaj nauczymy Cię, jak to zrobić. </p> <h2 id=\"what-is-tabletop-simulator\"> Co to jest symulator stołowy? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Dla tych, którzy nie wiedzą, Tabletop Simulator (TTS) zapewnia środowisko 3D do grania w gry planszowe, lokalnie lub online. To świetny sposób na <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> graj w gry planszowe online ze znajomymi </a> . </p> <p> Gry, w które można grać na TTS, obejmują wszystko, od pokera, warcabów, Dungeons &amp; Dragons, minigolfa, a nawet najnowsze gry planszowe. Każda gra, w którą chcesz zagrać, jest zazwyczaj dostępna jako DLC lub w warsztacie społeczności. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> Dlaczego warto korzystać z symulatora stołowego? </h2> <p> Jeśli kiedykolwiek próbowałeś stworzyć fizyczną grę planszową, wiesz, jak czasochłonne może być nie tylko budowanie elementów gry, ale także ich modyfikowanie lub zastępowanie, gdy zdecydujesz się poprawić lub poprawić grę. </p> <p> W TTS wszystko, od koloru po wagę obiektu, można zmienić jednym kliknięciem myszy, dzięki czemu proces weryfikacji jest płynny i bezbolesny. </p> <p> Ponadto łatwo jest przesyłać strumieniowo swoją rozgrywkę na żywo i prezentować ją w mediach społecznościowych i platformach strumieniowych. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> Czego potrzebujesz, aby zacząć </h2> <p> Zanim zaczniesz, będziesz potrzebować: </p> <ul> <li> Konto użytkownika Steam </li> <li> Symulator tabletu zainstalowany na twoim komputerze </li> <li> Obrazy JPG Twoich projektów plansz i kart </li> </ul> <p> <strong> Ściągnij: </strong> Symulator stołowy włączony <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> Parowy </a> (19,99 USD) </p> <p> Projektowanie elementów gry najlepiej wykonywać w oprogramowaniu ilustrującym lub skanując obrazy fizycznych kart, które już stworzyłeś. Upewnij się tylko, że mają rozszerzenia JPG i są zapisywane pojedynczo. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Tworzenie plansz i plansz graczy </h2> <p> Kiedy projektujesz swoje tablice i inne obiekty 2D, upewnij się, że rozdzielczość jest wystarczająco wysoka, aby można było ją odpowiednio dopasować bez utraty jakości. TTS automatycznie dostosuje jego rozmiar po zaimportowaniu i będziesz mógł zmienić jego rozmiar dokładnie tak, jak chcesz. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Tworzenie kart </h2> <p> Karty w TTS mają trzy aspekty: awers, rewers i ukrytą kartę (jak karta będzie wyglądać dla innych w ręce gracza). Będziesz musiał mieć projekty dla każdego z nich, chociaż możesz po prostu umieścić ukrytą kartę z tyłu karty. </p> <h3 id=\"create-and-arrange-card-faces\"> Twórz i układaj twarze kart </h3> <p> Zamiast importować każdą kartę pojedynczo, najlepiej zaimportować wszystkie lub większość swoich kart jako jedną talię. </p> <p> Aby utworzyć talię, skopiuj i wklej każdy projekt na arkusz kart 7x10. Korzystanie z szablonu takiego jak ten poniżej pomoże Ci rozpocząć. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> Szablon wyznacza miejsca dla każdej karty w Twojej talii, umożliwiając jednoczesne importowanie do 69 kart. Jeśli nie potrzebujesz ich tak wielu, możesz pozostawić niewykorzystane miejsca, a jeśli masz ich więcej, po zaimportowaniu możesz łączyć talie lub duplikaty kart. </p> <p> Nie musisz jednak używać tego szablonu. Arkusz kart może w rzeczywistości mieć dowolny rozmiar, a TTS automatycznie podzieli go na siatkę 7x10. </p> <p> Dla Twojej wygody powyższy szablon i szablon karty kwadratowej są dostępne w lokalnym katalogu plików TTS. </p> <p> Jeśli nie masz pewności, gdzie znajdują się Twoje pliki lokalne, możesz je znaleźć w swojej bibliotece Steam, otwierając <strong> Nieruchomości </strong> menu dla TTS. Wybierz <strong> Pliki lokalne </strong> tab i kliknij <strong> Przeglądaj </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Rewersy kart </h3> <p> Jeśli chcesz mieć tylko jeden projekt na tył całej talii, wystarczy jeden obraz JPG projektu; nie będzie potrzebny żaden arkusz karty. </p> <p> Jeśli twoja talia ma mieć wiele unikalnych rewersów, musisz utworzyć dodatkowy arkusz kart z wzorami rewersów odpowiadającymi wzorom awersów na pierwszym arkuszu kart. Aby zaprojektować twarz w gnieździe pierwszym, umieść jej wyznaczony tył w gnieździe pierwszym na tylnej stronie. W przypadku drugiej twarzy umieść jej tył w gnieździe drugim i tak dalej. </p> <h3 id=\"hidden-cards\"> Ukryte karty </h3> <p> W slocie 70 arkusza kart, oznaczonym na szablonie jako „Ukryta karta dla innych graczy”, umieść dowolny wzór, który chcesz, aby był widoczny dla przeciwników, gdy karty z tej talii znajdują się w ręce gracza. Tradycyjnie jest to jednolita czerń lub biel, lub ma konstrukcję z tyłu talii. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Importowanie elementów </h2> <p> Teraz, po utworzeniu desek i talii, możesz rozpocząć importowanie. </p> <p> Zanim zaczniesz hostować serwer z twoją grą, warto rozpocząć grę dla jednego gracza i zaimportować elementy z wyprzedzeniem. Następnie możesz zapisać konfigurację i być gotowym do natychmiastowego rozpoczęcia, gdy pojawią się gracze. </p> <p> Uruchom TTS i kliknij <strong> Stwórz </strong> , a następnie wybierz <strong> Jeden gracz </strong> stworzyć środowisko. Usuń wszystkie elementy wygenerowane przez TTS i wybierz stół, na którym chcesz grać. </p> <p> Gdy środowisko jest gotowe, kliknij <strong> Obiekty </strong> w górnym menu, a następnie wybierz <strong> Zwyczaj </strong> Kategoria. </p> <h3 id=\"boards-and-player-mats\"> Plansze i maty graczy </h3> <p> Wybierz <strong> Tablica </strong> od <strong> Zwyczaj </strong> menu i kliknij w dowolnym miejscu na stole, w którym ma się pojawić tablica. Kliknij prawym przyciskiem myszy w dowolnym miejscu, aby otworzyć okno dialogowe importu tablicy. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Przejdź do swojego obrazu tablicy, a TTS zapyta, czy chcesz przesłać go na swoje konto Steam Cloud, czy zachować plik lokalny. Prześlij pliki do chmury, jeśli planujesz kiedykolwiek grać w swoją grę online lub na innym urządzeniu. </p> <p> Możesz opcjonalnie przesłać swoje obrazy na inny host, taki jak Dropbox, Photobucket lub Imgur, i wkleić tutaj adres URL. Hosty zewnętrzne są jednak mniej niezawodne i nie są zalecane. </p> <p> Kiedy prześlesz go do Steam Cloud, TTS poprosi Cię o nadanie mu nazwy pliku. Po zakończeniu przesyłania kliknij <strong> Import </strong> . </p> <p> Po zaimportowaniu tablicy możesz ją teraz zmniejszyć lub powiększyć za pomocą <strong> - </strong> i <strong> + </strong> klawisze na klawiaturze. Aby zablokować go w miejscu, aby nie został przypadkowo przesunięty podczas gry, kliknij prawym przyciskiem myszy na planszy i poniżej <strong> Przełącza </strong> , Kliknij <strong> Zamek </strong> . </p> <h3 id=\"card-decks\"> Talie kart </h3> <p> w <strong> Obiekt niestandardowy </strong> menu, kliknij <strong> Pokład </strong> . Kliknij w dowolnym miejscu na stole, w którym ma się pojawić talia, a następnie kliknij prawym przyciskiem myszy, aby rozpocząć importowanie. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Dostosuj ustawienia w następujący sposób: </p> <ul> <li> <strong> Rodzaj: </strong> Zmień to, jeśli masz na myśli określony kształt inny niż zwykła prostokątna karta z okrągłym rogiem. </li> <li> <strong> Twarz: </strong> Kliknij <strong> Przeglądaj lokalne pliki </strong> i znajdź arkusz swojej twarzy. Ponownie zalecamy opcję Steam Cloud zamiast plików lokalnych lub hostów zewnętrznych. </li> <li> <strong> Unikalne plecy: </strong> Zaznacz tę opcję, jeśli twoja talia będzie miała wiele wzorów rewersów, a następnie prześlij arkusz rewersów w <strong> Z powrotem </strong> pudełko. Jeśli używasz jednego wzoru dla całej talii, po prostu prześlij swój projekt pleców. </li> <li> <strong> Szerokość i wysokość: </strong> Dostosuj to, jeśli użyłeś innego współczynnika niż standardowa prostokątna karta, 10x7. </li> <li> <strong> Numer: </strong> Upewnij się, że liczba ta odpowiada liczbie importowanych kart. </li> <li> <strong> Bokiem: </strong> Zmienia to orientację <strong> Alt Zoom </strong> funkcja w TTS. Pozostaw to pole niezaznaczone, chyba że chcesz, aby karta była wyświetlana bokiem. </li> <li> <strong> Powrót jest ukryty: </strong> Zaznacz to, jeśli chcesz, aby ukryty widok twoich kart był po prostu odwrotnymi stronami kart. </li> </ul> <p> Gdy ustawienia są prawidłowe, kliknij <strong> Import </strong> . Twoja talia pojawi się na stole i możesz zacząć tasować i rozdawać. </p> <p> Jeśli chcesz, aby Twoje karty miały nazwy ułatwiające sortowanie, kliknij prawym przyciskiem myszy pojedynczą kartę i kliknij <strong> Nazwa </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Importowanie innych elementów gry </h2> <p> Importowanie innych obiektów 2D jest podobne do procesu importowania plansz. Nie zapominaj, że TTS ma wiele wspólnych elementów do gry, takich jak kości i figurki, gotowych do użycia w <strong> Obiekty </strong> menu. </p> <p> Jeśli masz niestandardowe elementy 3D, których chcesz użyć, wykonaj <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> Przewodnik TTS dotyczący importowania modeli 3D </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Zapisywanie pełnej gry </h2> <p> Po rozmieszczeniu komponentów w początkowym stanie konfiguracji, kliknij przycisk <strong> Gry </strong> w górnym menu. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Wybierz <strong> Zapisz i wczytaj </strong> i kliknij <strong> Zapisz grę </strong> przycisk. Nadaj mu nazwę i kliknij <strong> Zapisać </strong> . Teraz za każdym razem, gdy hostujesz gry, możesz je ponownie załadować w idealnej konfiguracji, uzyskując dostęp do <strong> Zapisz i wczytaj </strong> menu. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Maksymalne wykorzystanie niestandardowych gier stołowych </h2> <p> Projektowanie i granie w gry niestandardowe w Tabletop Simulator jest proste, gdy już wiesz, jak to zrobić. Zaproś znajomych lub poszukaj gotowych i chętnych do zabawy testerów w <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> społeczność TTS </a> . Teraz możesz pochwalić się swoją niestandardową grą innym! </p>"}