{"title":"JPG vs. JPEG: jaka jest różnica między tymi formatami plików obrazów?","content":"<p> Nie wszystkie formaty plików graficznych są sobie równe. W rzeczywistości wiele z nich zostało stworzonych w celu rozwiązania problemu, którego nie mógł rozwiązać istniejący już format. Na przykład JPEG powstał, ponieważ rozmiary plików graficznych pochłaniały zbyt dużo miejsca do przechowywania. </p> <p> Wierzcie lub nie, ale rozszerzenia plików JIF, JPEG i JPG odnoszą się mniej więcej do tego samego. Aby zrozumieć, dlaczego format pliku ma tak wiele nazw, musimy rozwikłać trochę zawiłej historii. </p> <h2 id=\"what-is-a-jpeg\"> Co to jest JPEG? </h2> <p> Akronim JPEG oznacza Joint Photographic Experts Group – typ pliku został nazwany na cześć podkomisji, która pomogła w stworzeniu standardu JPEG Interchange Format (JIF). Po raz pierwszy został wydany w 1992 roku przez Międzynarodową Organizację Normalizacyjną (ISO). </p> <p> JPEG to 24-bitowe nieruchome obrazy rastrowe, z ośmioma bitami w każdym kanale modelu kolorów RGB. Nie pozostawia to miejsca na kanał alfa, co oznacza, że ​​chociaż pliki JPEG mogą obsługiwać ponad 16 milionów kolorów, nie mogą obsługiwać przezroczystości. </p> <p> Gdy obraz jest zapisywany jako JPEG, niektóre jego dane są usuwane w procesie określanym jako stratny <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> kompresja pliku </a> . Z kolei obraz zajmuje od 50 do 75 procent mniej miejsca (w porównaniu ze starszymi formatami, takimi jak BMP) przy niewielkiej lub zerowej zauważalnej utracie jakości obrazu. </p> <p> Kompresja JPEG opiera się na stratnej technice kompresji obrazu zwanej dyskretną transformatą kosinusową (DCT), którą po raz pierwszy zaproponował inżynier elektryk Nasir Ahmed w 1972 roku. </p> <h3 id=\"what-is-a-jif\"> Co to jest JIF? </h3> <p> Możesz myśleć, że plik JIF to plik JPEG w swojej „najczystszej” formie. Jednak format ten nie jest już zbyt często używany, ponieważ przedstawiał pewne frustrujące ograniczenia. Na przykład definicje kolorów i pikseli w JIF powodowały problemy ze zgodnością między koderami i dekoderami (przeglądarkami). </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> Na szczęście problemy te zostały później rozwiązane przez inne „dodatkowe” standardy oparte na JIF. Pierwszym z nich był format wymiany plików JPEG (JFIF), a później <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Wymienny format pliku obrazu </a> (Exif) i profile kolorów ICC. </p> <p> JPEG/JFIF to obecnie najpopularniejszy format do przechowywania i przesyłania obrazów fotograficznych w Internecie, podczas gdy JPEG/Exif jest przeznaczony do aparatów cyfrowych i innych urządzeń do przechwytywania obrazów. Większość ludzi nie rozróżnia różnicy między tymi odmianami i po prostu nazywa je po prostu JPEG. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> Co to jest JPG2 lub JPF? </h3> <p> W 2000 r. grupa JPEG wydała inny format pliku obrazu o nazwie JPEG 2000 (jego rozszerzenia to JPG2 i JPF). Miał być następcą JPEG, ale nie był tak popularny. Nawet jeśli jego zaawansowana metoda kodowania często prowadziła do lepszej jakości obrazów. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Źródło obrazu: Dake/ <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Format pliku JPEG 2000 okazał się klapą z kilku powodów. Po pierwsze, był oparty na zupełnie nowym kodzie i dlatego nie był wstecznie kompatybilny z JPEG. Co więcej, obsługa plików JPEG 2000 wymagała więcej pamięci do przetworzenia, co wtedy było trochę łamaczem umowy. W końcu przeciętny komputer w tym czasie miał tylko 64 MB pamięci. </p> <p> JPEG 2000 nieco się odrodził teraz, gdy sprzęt komputerowy ogólnie znacznie się poprawił w ciągu ostatnich 20 lat, ale format pliku jest nadal bardzo słabo wykorzystywany. Jedyną przeglądarką internetową, która w chwili pisania tego tekstu obsługuje pliki JPEG 2000, jest Safari. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG vs. JPG </h3> <p> Wczesne wersje systemu Windows (w szczególności systemy plików MS-DOS 8.3 i FAT-16) miały maksymalny limit 3 liter, jeśli chodzi o długość rozszerzeń plików. JPEG musiał zostać skrócony do JPG, aby nie przekroczyć limitu. Komputery Mac i Linux nigdy czegoś takiego nie miały, więc użytkownicy nadal zapisywali obrazy w formacie JPEG. </p> <p> </p> <p> Popularne programy do edycji obrazów, które działały w różnych systemach operacyjnych, takich jak Photoshop i <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> Kordonek </a> — w końcu ustawiłby domyślne rozszerzenie pliku JPEG na JPG, próbując zminimalizować zamieszanie. </p> <p> I tak otrzymaliśmy dwa rozszerzenia plików dla tego samego formatu: JPEG i JPG. Wybierając, jak zapisać obraz, nie ma między nimi żadnej różnicy. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG czy PNG: co jest lepsze? </h2> <p> </p> <p> JPEG i PNG zostały wydane w ciągu tej samej dekady, a każdy format pliku rozwiązuje inny problem z obrazem cyfrowym, z którym borykał się świat technologii. Można powiedzieć, że to naturalne, że są ciągle porównywane... i są, nawet do dziś. Pomiędzy JPEG i PNG, który format pliku obrazu króluje? </p> <p> Szczerze mówiąc, odpowiedź zależy od rodzaju obrazu, który zapisujesz. </p> <p> Pliki JPEG lepiej nadają się do zdjęć, ponieważ wykorzystują kompresję stratną, aby zachować rozsądne rozmiary plików. Zdjęcia są tak dużymi, szczegółowymi obrazami, że artefakty kompresji (subtelne zniekształcenia obrazu spowodowane kompresją) nie są na nich bardzo widoczne. </p> <p> Z drugiej strony obrazy z ostrymi punktami, ostrymi krawędziami i dużymi obszarami jednego koloru (np. logo wektorowe, grafika pikselowa itp.) nie wyglądają dobrze po zapisaniu jako JPEG. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Źródło: Axel Grimard/ <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Tutaj może pojawić się plik Portable Network Graphics (PNG). Opracowany przez PNG Development Group cztery lata po wydaniu JPEG, PNG obsługuje bezstratną kompresję danych i przezroczystość. Pliki PNG są więc często używane, jeśli trzeba zachować jakość obrazu, a rozmiar pliku nie stanowi problemu. </p> <p> Dobrą zasadą jest przechowywanie JPEG na zdjęciach i zapisywanie PNG dla obrazów z przezroczystością i obrazów innych niż fotograficzne. Aby uzyskać więcej informacji na temat wielu różnych typów plików (nie tylko obrazów), zapoznaj się z naszym przewodnikiem po <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> wiedząc, kiedy użyć jakiego formatu pliku. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG i JPG to ten sam format pliku </h2> <p> Pomimo zamieszania, jakie spowodował JPEG z wieloma aktualizacjami i odmianami, ostateczna powódź cyfrowych obrazów w Internecie w połowie lat 90. była niewątpliwie spowodowana przede wszystkim jego wydaniem. </p> <p> Następnym razem, gdy będziesz gotowy do wyeksportowania zdjęcia z edytora obrazów i zobaczysz długą listę dostępnych formatów, pamiętaj: JPEG i JPG to jedno i to samo. </p>"}