{"title":"Jak korzystać z aplikacji treningowej Apple Watch","content":"<p> Lepsze zrozumienie swoich postępów w kondycji to tylko jedno kliknięcie dzięki Apple Watch. </p> <p> Przyjrzymy się wszystkim, co ma do zaoferowania aplikacja Apple Watch Workout, w tym jej działaniu, typom treningu, które może śledzić i sposobom przeglądania wszystkich gromadzonych informacji. </p> <h2 id=\"getting-started-with-the-workout-app\"> Pierwsze kroki z aplikacją treningową </h2> <p> Aplikację Trening na zegarku Apple Watch można otworzyć na kilka sposobów. Najpierw po prostu kliknij raz na <strong> Cyfrowa korona </strong> aby wyświetlić listę aplikacji na zegarku. Następnie wybierz <strong> Trening </strong> . </p> <p> Jeszcze szybszym sposobem jest użycie Siri, albo przez długie naciśnięcie <strong> Cyfrowa korona </strong> lub podnosząc zegarek do ust. Następnie po prostu powiedz „Otwórz aplikację Trening”. </p> <p> Po otwarciu aplikacji zobaczysz szeroką gamę rodzajów ćwiczeń — od łucznictwa po jogę i wszystko pomiędzy. </p> <p> Główny ekran wyboru treningu jest wyróżniony najpopularniejszymi opcjami. Przewiń w dół listy i wybierz <strong> Dodaj trening </strong> aby zobaczyć listę innych rodzajów treningów. Jeśli z jakiegoś powodu nie widzisz swojego typu treningu, możesz również wybrać <strong> Inny </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> Możesz wybrać <strong> trzy kropki </strong> ( <strong> ... </strong> ) na każdym typie treningu, aby ustawić konkretny cel dotyczący dystansu, spalonych kalorii lub czasu. Jeśli którykolwiek z tych celów Cię nie interesuje, po prostu dotknij nazwy treningu, aby natychmiast rozpocząć. </p> <p> Na ekranie pojawi się trzysekundowe odliczanie przed rozpoczęciem śledzenia. </p> <p> Wszystkie funkcje aplikacji Trening są dostępne bez iPhone&#39;a w pobliżu lub przy użyciu tylko zegarka Apple Watch podłączonego do sieci Wi-Fi lub sieci komórkowej. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Poznaj aplikację treningową </h2> <p> W aplikacji dostępne są trzy główne ekrany. Możesz przełączać się między nimi, przesuwając palcem w lewo lub w prawo. </p> <p> Główny ekran pokaże wszystkie Twoje postępy w wybranym typie treningu. Zobaczysz czas treningu, aktywne kalorie, łączne kalorie i aktualne tętno. W zależności od typu treningu możesz również zobaczyć przebytą odległość. </p> <p> Jeśli masz zegarek Apple Watch Series 5 lub nowszy i włączony zawsze wyświetlacz, zawsze możesz zobaczyć statystyki treningu. Każdy, kto ma starszy model, będzie musiał podnieść lub dotknąć ekranu, aby zobaczyć te informacje. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Gdy biegasz lub chodzisz, Apple Watch delikatnie stuka co milę lub kilometr i wyświetla aktualizację z informacjami o tempie. Co pięć mil lub kilometrów nastąpi podsumowanie i stuknięcie na rowerze. </p> <p> Jeśli wykonujesz trening Apple Fitness+, możesz wyświetlać dane zarówno w aplikacji Trening, jak i na ekranie iPhone&#39;a, iPada lub Apple Watch. </p> <p> </p> <p> Przesunięcie w prawo z ekranu głównego pokaże cztery różne opcje — <strong> Zamek </strong> , <strong> Nowy </strong> , <strong> Koniec </strong> , i <strong> Pauza </strong> . </p> <p> Wybieranie <strong> Zamek </strong> zablokuje ekran, aby uniknąć przypadkowych dotknięć. Możesz obrócić Digital Crown, aby odblokować ekran. Warto zauważyć, że ta opcja automatycznie włączy się podczas każdego rodzaju treningu pływackiego, aby zapobiec przypadkowym dotknięciom kropli wody. </p> <p> Jak można się domyślić, <strong> Nowy </strong> kończy bieżący trening i pozwala wybrać nowy rodzaj ćwiczeń, aby rozpocząć od nowa. Wybieranie <strong> Koniec </strong> zakończy bieżący trening. </p> <p> Jeśli kiedykolwiek zostaniesz przerwany, możesz wybrać <strong> Pauza </strong> przycisk. Ponowne naciśnięcie tego przycisku rozpocznie śledzenie treningu. Możesz to również zrobić, naciskając jednocześnie cyfrową koronę i przycisk boczny. </p> <p> Przeciągnięcie w lewo z głównego ekranu treningu pokazuje elementy sterujące odtwarzaniem multimediów. To łatwy sposób na dostęp do muzyki lub czegokolwiek innego, czego słuchasz podczas ćwiczeń. Możesz pomijać utwory, odtwarzać, wstrzymywać i zwiększać lub zmniejszać głośność. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Automatyczne przypomnienia o treningu </h2> <p> Nie musisz się martwić, jeśli zapomnisz rozpocząć trening. Jeśli masz system watchOS 5 lub nowszy, zegarek Apple Watch może automatycznie rozpoznawać, kiedy ćwiczysz. Dotknie Cię w nadgarstek i zapyta, czy chcesz nagrać trening, umożliwiając zmianę typu treningu, wyciszenie tych powiadomień na cały dzień lub po prostu odrzucenie tego powiadomienia. </p> <p> Chociaż może minąć kilka minut, zanim pojawi się powiadomienie, cały kredyt treningowy zostanie zapisany. </p> <p> Możesz otrzymywać przypomnienia o treningu dla następujących typów treningów: spacer w pomieszczeniu, spacer na świeżym powietrzu, bieg w pomieszczeniu, bieg na zewnątrz, orbitrek, wioślarz, pływanie w basenie i pływanie na otwartym akwenie. </p> <p> Aby włączyć lub wyłączyć tę funkcję, przejdź do <strong> Ustawienia &gt; Trening &gt; Przypomnienie o rozpoczęciu treningu </strong> na zegarku Apple Watch. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> Apple Watch może również wykryć zakończenie treningu. Po dotknięciu zobaczysz powiadomienie na ekranie z opcjami zakończenia lub wstrzymania treningu. Możesz także całkowicie odrzucić powiadomienie i kontynuować trening. </p> <p> Przełącz funkcję, przechodząc do Apple Watch i przechodząc do <strong> Ustawienia &gt; Trening &gt; Przypomnienie o zakończeniu treningu </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Dostosuj dane wyświetlane w aplikacji treningowej </h2> <p> W widoku Trening na Apple Watch możesz dostosować informacje wyświetlane na ekranie dla wielu różnych typów treningu. </p> <p> Aby rozpocząć, otwórz towarzyszącą aplikację Watch na swoim iPhonie. w <strong> Mój zegarek </strong> wybierz zakładkę <strong> Trening </strong> . Następnie wybierz <strong> Widok treningu </strong> . U góry strony możesz wybrać, czy podczas treningu wyświetlać na ekranie jedną, czy wiele danych. Jeśli wybierzesz <strong> Pojedyncza metryka </strong> , po prostu przewiń Digital Crown, aby zobaczyć więcej danych na zegarku Apple Watch. </p> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (3 obrazy) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> Poniżej możesz również zobaczyć kilka różnych typów treningów, w których możesz edytować informacje wyświetlane na ekranie. Wybierz typ treningu, a następnie wybierz <strong> Edytować </strong> w prawym górnym rogu ekranu, aby dostosować to, co jest wyświetlane na ekranie i w jakiej kolejności. </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Wyświetlanie danych treningowych w aplikacji Fitness </h2> <p> Gdy skończysz trening, wszystkie dane są w zasięgu zaledwie kilku kliknięć na Twoim iPhonie. </p> <p> Aby to zobaczyć, otwórz <strong> Zdatność </strong> aplikacja. </p> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (2 obrazy) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> Pod <strong> streszczenie </strong> zakładka, wybierz <strong> Treningi </strong> . Zobaczysz informacje o wszystkich swoich treningach. Dane są również dostępne w <strong> Zdrowie </strong> aplikacja. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Przełam pot dzięki aplikacji treningowej Apple Watch </h2> <p> Jak widać, aplikacja Apple Watch Workout to świetny sposób na śledzenie wszystkich różnych wskaźników kondycji podczas robienia wszystkiego, od pływania po taniec i wiele więcej. </p> <p> A kiedy zechcesz spędzić noc i iść spać, zegarek Apple Watch nadal może być bardzo pomocny dzięki wbudowanej funkcji śledzenia snu. </p>"}