{"title":"Jaka jest różnica między siecią LAN i WAN w sieciach?","content":"<p> Jeśli wsadziłeś nos w sieci komputerowe, istnieje duża szansa, że ​​natknąłeś się na terminy „LAN” i „WAN”. Jednak co każdy z nich oznacza i jakie są różnice w porównaniu sieci LAN i WAN? </p> <p> Przyjrzyjmy się obu tym technologiom i gdzie każda z nich świeci. </p> <h2 id=\"what-does-lan-stand-for\"> Co oznacza „LAN”? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> Źródło: lek Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Sieć LAN to „sieć lokalna”. Termin ten opisuje sieć, w której wszystkie podłączone urządzenia znajdują się blisko siebie. Wszyscy znajdują się w „lokalnej okolicy”, stąd nazwa. </p> <p> Gdy komputer łączy się z siecią LAN, otrzymuje adres lokalnego protokołu internetowego (IP). Działa to podobnie do adresu IP, który otrzymujesz, gdy łączysz się z Internetem. Jednak lokalny adres IP działa tylko dla innych komputerów w tej samej sieci LAN, co Ty. Nie możesz na przykład używać lokalnego adresu IP do łączenia się z komputerem przez Internet. </p> <p> Fizyczna granica domowej sieci LAN prawdopodobnie nie wyjdzie z domu. Oczywiście, jeśli zabierzesz swój telefon lub laptop do ogrodu, aby zaczerpnąć świeżego powietrza, nadal jest on podłączony do sieci LAN. Jednak przez większość czasu wszystkie urządzenia podłączone do sieci znajdują się bezpiecznie w czterech ścianach domu. </p> <p> Firmy i instytuty również tworzą sieci LAN. Na przykład uniwersytet może podłączyć wszystkie komputery w swojej bibliotece do sieci, aby mogły się ze sobą komunikować. Firmy lubią również korzystać z sieci LAN, ponieważ umożliwiają one pracownikom przesyłanie między sobą plików i korespondencji bez konieczności łączenia się z Internetem. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> Co oznacza „WAN”? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Źródło obrazu: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Z drugiej strony mamy sieć rozległą, czyli WAN. Jeśli czytasz ten artykuł, masz już połączenie z siecią WAN — lubimy nazywać to Internetem. </p> <p> „Szeroki” w sieci rozległej jest bardzo zmienny. Jeśli łączysz się z zewnętrznym serwerem w tym samym mieście, co Ty, jest to sieć WAN. Jest również uważana za sieć WAN, jeśli łączysz się z serwerem w kraju po drugiej stronie planety. </p> <p> W związku z tym nazwa WAN jest zwykle używana do opisania każdej sieci, z którą się łączysz, która istnieje za routerem. Nie ma znaczenia, czy serwer jest oddalony o milę czy kontynent; nadal jest „szeroki”. </p> <p> Internet nie jest jedyną dostępną siecią WAN. Firmy dobrze wykorzystują sieci WAN do łączenia biur znajdujących się w różnych krajach. Na przykład, jeśli firma ma biuro w Nowym Jorku, Tokio i Sydney, może wynająć własny system WAN, aby umożliwić im komunikację. </p> <p> Ale poczekaj chwilę; dlaczego firmy tworzą własną sieć WAN, skoro mogą po prostu podłączyć wszystko do internetu? Problem z tym rozwiązaniem polega na tym, że firma będzie musiała zapłacić opłaty za dostawcę usług internetowych, a jeśli coś pójdzie nie tak, będzie musiała zmagać się ze wspomnianym dostawcą usług internetowych, aby to naprawić. </p> <p> Nie tylko to, ale Internet jest zaprojektowany tak, aby łączyć się z wieloma komputerami na całym świecie. Jeśli firma chce, aby jej komputery PC łączyły się tylko z innymi komputerami biurowymi, mogą korzystać z własnej sieci WAN, aby chronić się przed zagrożeniami internetowymi. Nazywa się to „intranetem”. </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> Kiedy używać sieci LAN, a kiedy WAN </h2> <p> Jeśli chcesz połączyć się z innym posiadanym urządzeniem, możesz to zrobić przez sieć LAN lub WAN. Ale jakie są zalety i wady każdego z nich i których należy użyć? </p> <p> Załóżmy, że masz nowy bezprzewodowy dysk twardy, który łączy się z routerem i masz wybór zezwalania na połączenia z Internetu (WAN) lub utrzymywania go tylko lokalnie (LAN). To, który wybierzesz, zależy od tego, czego chcesz od dysku twardego. </p> <p> Zapewnienie możliwości WAN dyskowi twardemu jest fantastyczne dla wygody. To umieszcza go w Internecie, co oznacza, że ​​możesz się z nim połączyć z dowolnego miejsca na świecie. W związku z tym nigdy więcej nie utkniesz bez swoich plików; będą po prostu mieć połączenie z internetem. </p> <p> Jednak połączenia WAN umożliwiają również innym osobom uzyskanie dostępu do Twoich urządzeń. Jeśli zabezpieczenia Twojego dysku twardego nie są wystarczające, hakerzy mogą skorzystać z tej samej drogi, co Ty, aby zobaczyć wszystkie Twoje dane oraz skopiować lub usunąć ważne rzeczy. </p> <p> Z drugiej strony ustawienie dysku twardego w trybie tylko LAN chroni go przed niektórymi drogami, które może wykorzystać haker. Nie jest nieprzepuszczalny. Na przykład ktoś może użyć komputera, aby uzyskać dostęp do dysku twardego. Jest to jednak o wiele bezpieczniejsze niż przesyłanie zawartości dysku twardego w sieci WAN codziennie i w nocy. </p> <p> Jeśli naprawdę, naprawdę chcesz wzmocnić zabezpieczenia, możesz zrobić szczelinę powietrzną w dysku twardym. Przerwa powietrzna oznacza, że ​​komputer i każdy komputer w tej samej sieci nie są połączone z siecią WAN — na przykład z Internetem. </p> <p> Na <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> komputer z luką powietrzną nie jest całkowicie zabezpieczony przed zagrożeniami internetowymi </a> , ale drastycznie zmniejsza to szansę na atak. Hakerzy muszą manipulować ludźmi, aby zaatakowali urządzenie z pustką powietrzną, używając taktyk socjotechnicznych, aby postawić na swoim. </p> <p> W związku z tym, wybierając między umieszczeniem urządzenia w Internecie lub zablokowaniem go w domowej sieci LAN, musisz rozważyć, czy rzeczywiście połączysz się z nim przez Internet. Jeśli nie sądzisz, że to zrobisz, najlepiej wyłączyć jego funkcje WAN i trzymać hakerów na dystans. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> Czy połączenie z Internetem zmienia sieć LAN w WAN? </h2> <p> Załóżmy, że masz skonfigurowaną sieć LAN, w której wszystkie Twoje urządzenia są podłączone do routera. Nudzisz się, więc wsiadasz do komputera i idziesz do Netflixa. Teraz Twój komputer jest podłączony do sieci WAN: Internetu. </p> <p> Jednak ponieważ Twój komputer jest podłączony do sieci WAN, czy to oznacza, że ​​nie jest już częścią sieci LAN? Na szczęście urządzenie może być jednocześnie częścią sieci LAN i WAN. </p> <p> Pamiętasz, jak powiedzieliśmy, że urządzenia LAN mają swój własny lokalny adres IP? Nie oznacza to, że nie może również uzyskać internetowego adresu IP. W rzeczywistości, jeśli czytasz ten artykuł na urządzeniu podłączonym do routera, będzie miał oba! </p> <p> Jeśli chcesz sprawdzić sam, omówiliśmy <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> jak sprawdzić swój adres IP w systemie Windows </a> . Jeśli korzystasz z telefonu komórkowego, nadal możesz <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> znajdź swoje adresy IP na Androidzie lub iPhonie </a> . </p> <p> Gdy masz już statystyki, powinieneś zobaczyć dwa adresy IP. Pierwszy zacznie się od „192.168” – ten jest twoim lokalnym adresem IP. Używasz tego, jeśli chcesz połączyć się z bieżącym urządzeniem z innego w tej samej sieci. </p> <p> Drugi będzie wyglądał na jeden z dwóch sposobów, w zależności od tego, czy korzystasz z IPv4 czy IPv6. Jeśli korzystasz z wersji 4, powinien wyglądać jak lokalny adres IP, ale nie zaczyna się od „192.168”. Jeśli jest to IPv6, powinien to być bałagan liter i cyfr, podzielony na osiem bloków dwukropkami. </p> <p> Tak czy inaczej, ten adres jest twoim internetowym adresem IP. To jest używane, gdy łączysz się z innym serwerem w Internecie, aby mógł z tobą rozmawiać; na przykład, aby wysłać Ci program telewizyjny, który oglądasz w serwisie Netflix. </p> <p> W pewnym sensie można sobie wyobrazić internet jako ogromną sieć LAN. Kiedy oglądasz Netflix, Twój komputer (w Twojej osobistej sieci LAN) pobiera dane z serwerów Netflix (które znajdują się we własnej sieci LAN). Każda sieć LAN jest jak dom w mieście, a łączność internetowa jest jak drogi i ulice, które je łączą. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> Usuwanie zamieszania między siecią LAN a WAN </h2> <p> Sieci LAN i WAN często działają w tandemie, ale działają na różne sposoby. Teraz znasz różnicę między tymi dwoma i kiedy użyć każdego z nich. </p> <p> Czy wiesz, że możesz skonfigurować grę LAN, aby ludzie w tej samej sieci mogli ze sobą grać? To świetny sposób na spędzenie czasu z przyjaciółmi bez problemów z opóźnieniami, które czasami mają gry internetowe. </p> <p> <small> Źródło obrazu: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}