{"title":"Jak zainstalować inteligentny kontroler drzwi garażowych?","content":"<p> Chcesz sterować bramą garażową za pomocą smartfona lub tabletu? Inteligentny sterownik to świetna opcja, jeśli masz już zainstalowany w domu automat do otwierania drzwi garażowych. </p> <p> Pokażemy Ci, jak zainstalować inteligentny sterownik bramy garażowej. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Różnice między otwieraczem a kontrolerem </h2> <p> Istnieją dwie główne różnice między inteligentnym otwieraczem drzwi garażowych a sterownikiem. Pierwszy to rozmiar. </p> <p> Większość otwieraczy jest duża i montowana do sufitu garażu. Do otwierania i zamykania drzwi używają szyny mechanicznej. Z drugiej strony kontroler bramy garażowej to niewielka jednostka elektroniczna, która umożliwia sterowanie otwieraczem za pomocą aplikacji na urządzeniu inteligentnym. </p> <p> Drugą różnicą pomiędzy tymi dwoma produktami jest cena. Otwieracze do drzwi garażowych mogą kosztować około 300 USD. Montaż tych otwieraczy zwykle wymaga pomocy profesjonalnego instalatora. </p> <p> Jednak kontroler zazwyczaj nie wymaga profesjonalnej instalacji. Zamiast tego kontroler działa jako dodatek do istniejącego otwieracza. </p> <p> Oznacza to, że za ułamek ceny nowego otwieracza możesz osiągnąć tę samą funkcjonalność za pomocą samego kontrolera. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> Jakie są zalety inteligentnych bram garażowych? </h2> <p> Istnieją trzy główne zalety posiadania inteligentnych bram garażowych. </p> <ul> <li> <strong> Bezpieczeństwo </strong> —Inteligentna brama garażowa umożliwia otwieranie i zamykanie bramy z niemal dowolnego miejsca. </li> <li> <strong> Bezpieczeństwo </strong> — Większość inteligentnych urządzeń do otwierania drzwi garażowych i sterowników ostrzega, gdy garaż jest otwarty przez określony czas. </li> <li> <strong> Wygoda </strong> — Jeśli kiedykolwiek musiałeś wracać do domu, aby zamknąć bramę garażową, posiadanie aplikacji do inteligentnych drzwi garażowych pozwala zaoszczędzić czas. Zamiast jechać do domu, po prostu wyciągnij telefon. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> Jak zainstalować inteligentny kontroler drzwi garażowych? </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Jeśli zdecydowałeś, że inteligentny sterownik do bram garażowych jest właśnie dla Ciebie, ten przewodnik pokaże Ci, jak go zainstalować. W tej demonstracji <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meross MSG100 </a> jest używany, ale ten proces jest podobny w przypadku korzystania z innej marki. Aby uzyskać szczegółowe informacje, zapoznaj się z dokumentacją kontrolera. </p> <h3 id=\"what-you-ll-need\"> Co będziesz potrzebował </h3> <ul> <li> Inteligentny kontroler garażu </li> <li> Uchwyty zszywacza lub drutu </li> <li> Brama garażowa z zainstalowanym automatycznym otwieraczem </li> <li> Wkrętaki krzyżakowe i płaskie </li> <li> Drabina </li> </ul> <h3 id=\"plan-the-installation\"> 1. Zaplanuj instalację </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Zanim zainstalujesz kontroler, musisz zbadać kilka miejsc w garażu. Pierwszy to źródło zasilania kontrolera. Drugi to ścieżka przewodowa od kontrolera do czujnika zamontowanego na drzwiach dołączonego do zestawu. A trzeci to lokalizacja czujnika magnetycznego. </p> <p> Ten czujnik magnetyczny pozwala kontrolerowi wiedzieć, kiedy drzwi są otwarte lub zamknięte. </p> <p> Większość kontrolerów używa długiego przewodu do połączenia z czujnikiem drzwi. Będziesz musiał poprowadzić ten przewód po suficie lub w dół ściany, aby nie przeszkadzał. </p> <p> Po zaplanowaniu instalacji sprawdź, czy przewód czujnika biegnie od sterownika do lokalizacji czujnika. To dopasowanie testowe zapewnia, że ​​przewód czujnika dotrze do kontrolera. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Wyłącz zasilanie do otwierania drzwi garażowych </h3> <p> Większość bram garażowych jest podłączona do zasilania gdzieś w suficie. W przypadku tych otwieraczy upewnij się, że są odłączone przed kontynuowaniem. </p> <p> Jeśli twój otwieracz nie ma wtyczki, a zamiast tego jest podłączony do okablowania wychodzącego z sufitu, musisz znaleźć skrzynkę z wyłącznikiem i odłączyć tam zasilanie. </p> <p> <strong> Uwaga: </strong> Prąd domowy 120 V może spowodować poważne obrażenia. Jeśli nie czujesz się komfortowo w pracy z elektrycznością, zatrzymaj się teraz i skonsultuj się z profesjonalnym instalatorem bram garażowych i/lub elektrykiem. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Podłącz dołączone przewody do kontrolera </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> W jednostce Meross znajduje się zestaw niebieskich i brązowych przewodów, które należy zainstalować w sterowniku, aby połączyć się z mechanizmem otwierania drzwi garażowych. Otwórz plastikową osłonę kontrolera i powinieneś zobaczyć dwa zaciski śrubowe. </p> <p> Za pomocą małego śrubokręta płaskiego poluzuj śruby na każdym zacisku. Włóż przewody i dokręć śruby. Nie ma znaczenia, który przewód dokąd idzie. </p> <p> Delikatnie pociągnij przewody, aby upewnić się, że są bezpieczne. Następnie załóż pokrywę sterownika. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Zamontuj kontroler drzwi garażowych </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Skoro już zaplanowałeś swoje lokalizacje, nadszedł czas na zamontowanie kontrolera. Upewnij się, że kontroler znajduje się w miejscu, w którym ma dostęp do potrzebnej mu mocy bez obciążania okablowania. </p> <p> Następnie usuń lepką podkładkę z kontrolera i wciśnij ją na miejsce. Jeśli masz kontroler z mocowaniem śrubowym, użyj śrubokręta, aby zabezpieczyć kontroler na miejscu. </p> <h3 id=\"mount-the-sensor\"> 5. Zamontuj czujnik </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> Następnie musisz zamontować czujnik do drzwi. Zaleca się umieszczenie tego czujnika w miejscu, w którym nie będzie przeszkadzał drzwiom. </p> <p> Możesz też pokusić się o zamontowanie czujnika blisko ziemi. Nie jest to zalecane, ponieważ wielokrotne pryskanie wody bezpośrednio na czujnik może spowodować jego uszkodzenie. Po umieszczeniu czujnika użyj dołączonej dwustronnej taśmy lub śrub, aby go zabezpieczyć. </p> <p> Na powyższym zdjęciu czarny czujnik został zamontowany obok bramy garażowej z częścią magnesu zamontowaną do samych drzwi. Ten czujnik wykorzystuje do montażu taśmę dwustronną. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Podłącz przewody czujnika </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Teraz czas na podłączenie przewodów do czujnika i sterownika. Korzystając z planu, który wykonałeś w pierwszym kroku, poprowadź przewody i użyj zszywacza, aby przymocować przewody do ściany lub sufitu. </p> <p> Uważaj, aby nie ściskać ani nie zaginać przewodów, ponieważ może to spowodować ich uszkodzenie. Gdy są poprowadzone, podłącz czerwone złącze żeńskie na kontrolerze do czerwonego złącza męskiego na końcu przewodu czujnika. </p> <p> Następnie musisz otworzyć pokrywę otwieracza drzwi garażowych. Powinny być obecne cztery przewody, dwa sterujące i wspólne dla urządzenia oraz dwa sterujące przyciskiem na ścianie. </p> <p> </p> <p> Zazwyczaj przewody te wychodzą z sufitu i powinny mieć zaciśnięte końcówki widełkowe mocujące je do modułu otwierania drzwi garażowych. Jeśli nie możesz określić, które przewody są które, zatrzymaj się i zapoznaj się z instrukcją obsługi otwierania drzwi garażowych lub skonsultuj się z wykwalifikowanym elektrykiem. </p> <p> Jeśli znalazłeś przewody, podłącz brązowy i niebieski przewód od kontrolera do zacisków na otwieraczu, które są połączone z przyciskiem ściennym. Na powyższym zdjęciu przewody kontrolera zostały włożone do dwóch skrajnych lewych zacisków. </p> <p> Po zakończeniu do każdego zacisku naściennego powinny być podłączone dwa przewody. Ponownie zamocuj pokrywę otwieracza drzwi garażowych, podłącz kontroler i otwieracz, a instalacja powinna być zakończona. </p> <p> W następnym kroku połączysz kontroler z siecią bezprzewodową. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Podłącz kontroler do Wi-Fi </h3> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (3 obrazy) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> Aby skonfigurować łączność Wi-Fi, skorzystaliśmy z aplikacji Meross. Jest dostępny dla <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> i <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . Ten proces prawie zawsze polega na otwarciu aplikacji, zidentyfikowaniu produktu, podłączeniu aplikacji do sieci Wi-Fi, otwarciu ekranu Ustawienia i umożliwieniu kontrolerowi dostępu do sieci. </p> <p> Tutaj otwórz aplikację, a następnie dotknij <strong> Inteligentne otwieranie drzwi garażowych </strong> i wtedy <strong> Początek </strong> . Wybierz producenta i model otwierania drzwi garażowych, którego używasz ze sterownikiem. Upewnij się, że postępujesz zgodnie z instrukcjami dotyczącymi Twojej aplikacji. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Ustaw interwał otwarcia/zamknięcia </h3> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (3 obrazy) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> Jedną rzeczą, którą należy ustawić przed przetestowaniem nowego kontrolera, jest czas otwierania drzwi garażowych. W aplikacji Meross możesz wybrać od 10 sekund do 40 sekund w pięciosekundowych odstępach lub dodać niestandardowe ustawienie dla drzwi, których zamknięcie zajmuje parzystą liczbę sekund. </p> <p> Ustalenie czasu dla twoich drzwi jest łatwe, ale musisz to zrobić dobrze. Zbyt krótka przerwa spowoduje częściowe otwarcie drzwi, a zbyt długa nastawa może spowodować nadmierne obciążenie silnika mechanizmu otwierania drzwi garażowych. </p> <p> Aby ustawić interwał, potrzebujesz zegarka z sekundnikiem lub funkcją stopera. Możesz także użyć wbudowanego timera telefonu. Przygotuj swój minutnik i stań w pobliżu przycisku otwierania drzwi garażowych. Następnie naciśnij przycisk w tym samym czasie, co start na stoperze lub zanotuj czas na sekundniku. </p> <p> Poczekaj, aż brama garażowa przestanie się poruszać i zapisz czas. To jest twoja przerwa. Przenieś te informacje do aplikacji, a ustawienie interwału zostanie zakończone. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Przetestuj kontroler drzwi garażowych </h3> <p> Za pomocą aplikacji otwórz i zamknij drzwi kilka razy, aby upewnić się, że wszystko działa. Teraz powinieneś być w stanie użyć przycisku ściennego lub aplikacji, aby otworzyć bramę garażową. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Ciesz się inteligentnym kontrolerem drzwi garażowych </h2> <p> Wprowadzenie technologii inteligentnego domu do bramy garażowej nie musi kosztować fortuny. </p> <p> Zainstalowanie nowego inteligentnego kontrolera drzwi garażowych zapewnia Tobie i Twojej rodzinie większą elastyczność, bezpieczeństwo i wygodę w Twoim domu. Zapewnia również spokój ducha, ponieważ wiesz, że bramą garażową można sterować z niemal dowolnego miejsca. </p>"}