{"title":"Jak uzyskać dostęp do statystyk gry PS4 i PS5 na 2020 rok?","content":"<p> Sony wypuściło PlayStation Wrap-Up, dzięki któremu możesz zastanowić się nad swoją podróżą do PlayStation w ciągu ostatniego roku. </p> <p> Powiemy Ci, jak uzyskać dostęp do tego doświadczenia i uświadomimy Ci kilka wymagań. </p> <h2 id=\"what-is-playstation-wrap-up\"> Co to jest podsumowanie PlayStation? </h2> <p> Jak informowaliśmy, <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> Podsumowanie PlayStation Wrap-Up to podsumowanie ostatniego roku w grach </a> . </p> <p> Jest to spersonalizowana strona, która zawiera szczegółowe informacje o Twoich nawykach związanych z graniem na PS4 i PS5, w tym liczbę granych gier, czas grania w nie i liczbę zdobytych trofeów. </p> <p> Możesz także otrzymać darmowy dynamiczny motyw z kształtami PlayStation. Myląco, jest to dostępne tylko na PS4, a nie na nowo wydanej PS5. </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> Jak uzyskać dostęp do podsumowania PlayStation </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> Aby wyświetlić swój raport, przejdź do <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> Strona podsumowująca PlayStation </a> . Musisz zalogować się na swoje konto Sony, jeśli jeszcze tego nie zrobiłeś. Po wejściu na stronę możesz przewinąć w dół, aby wyświetlić swoje statystyki i wykorzystać motyw PS4. </p> <p> Podsumowanie będzie dostępne tylko do 2 marca 2021 r. W związku z tym nie zwlekaj, jeśli chcesz wziąć udział. </p> <p> Istnieją warunki, które musisz spełnić, aby korzystać z podsumowania PlayStation: </p> <ul> <li> Posiadaj zarejestrowane konto PSN w swoim regionie. </li> <li> Mieć co najmniej 18 lat. </li> <li> Graj w gry przez co najmniej 10 godzin na konsoli PS4 między 1 stycznia 2020 r. a 31 grudnia 2020 r. </li> </ul> <p> Ponadto użytkownicy w Europie, na Bliskim Wschodzie, w Afryce, Australii, Indiach i Rosji musieli włączyć zbieranie danych <strong> Dodatkowe dane </strong> . Możesz to włączyć na PS4 przez <strong> Ustawienia </strong> &gt; <strong> Dane urządzenia/Zdrowie i bezpieczeństwo </strong> &gt; <strong> Dane urządzenia </strong> . </p> <p> Na koniec możesz otrzymać wiadomość e-mail zawierającą podsumowanie podsumowania PlayStation. Musisz jednak wyrazić zgodę na otrzymywanie e-maili marketingowych, co możesz zrobić za pośrednictwem <strong> Ustawienia powiadomień </strong> na swoim koncie PSN. </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> Czy będzie podsumowanie roku 2021? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> To już drugi rok z rzędu, w którym Sony przeprowadziło proces podsumowania. Ponieważ analizuje tylko dane z 2020 roku, skupia się bardziej na PS4. </p> <p> Miejmy nadzieję, że Sony zrobi to ponownie w przyszłym roku, kiedy PS5 wyjdzie dłużej i wyda więcej gier. </p>"}