{"title":"Jak chronić swoje dane osobowe przed pracodawcami","content":"<p> Technologia nadzoru szerzy się w biurze i poza nim. Wielu pracodawców korzysta z produktów do zarządzania urządzeniami mobilnymi na urządzeniach firmowych, takich jak telefony, laptopy i tablety. Zawierają one programy mające na celu ochronę firm przed kradzieżą, szpiegostwem korporacyjnym lub złośliwymi zamiarami. </p> <p> Jednak chociaż wszystko to jest świetne dla ochrony Twojej firmy, nie są one dla Ciebie najlepsze. To już nie jest kwestia <strong> gdyby </strong> Twoja firma Cię śledzi; następnie należy zapytać, ile danych firmy mogą faktycznie znaleźć? Zaskakująco dużo. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> Co mogą zobaczyć pracodawcy w firmowej sieci Wi-Fi i urządzeniach zdalnych? </h2> <p> Większość ludzi nie zdaje sobie sprawy, w jakim stopniu firmy mają dostęp do swoich danych ani ile z nich rejestrują podczas korzystania z urządzeń firmowych. Oto kilka przykładów. </p> <h3 id=\"location\"> Lokalizacja </h3> <p> Wielu pracowników uważa, że ​​korzystanie z wirtualnej sieci prywatnej (VPN) wystarczy, aby ich pracodawcy uwierzyli, że są tam, gdzie powinni. </p> <p> Chociaż istnieją sposoby na ukrycie swojej prawdziwej lokalizacji na urządzeniu osobistym, nie jest to całkowicie niezawodne, zwłaszcza po zalogowaniu się w dowolnej aplikacji lub witrynie internetowej za pomocą adresu e-mail lub numeru telefonu komórkowego wydanego przez firmę. </p> <p> </p> <p> Ukrycie swojej prawdziwej lokalizacji podczas korzystania z urządzeń firmowych może być prawie niemożliwe. Na przykład firmy telekomunikacyjne mogą wykryć, kiedy łączysz się z którymkolwiek z ich partnerów roamingowych. </p> <p> Ponadto korporacyjne sieci VPN różnią się od komercyjnych sieci VPN z bramami monitorowanymi przez wewnętrzne zespoły IT. </p> <h3 id=\"notes-documents-and-emails\"> Notatki, dokumenty i e-maile </h3> <p> Jeśli uważasz, że nikt nie wie, że korzystasz z firmowego Wi-Fi, aby znaleźć następną pracę, to się mylisz. Nawet jeśli nie używasz firmowego adresu e-mail, wiele firm ma wstępnie zainstalowane programy na firmowych laptopach, które zawierają dzienniki aktywności w czasie rzeczywistym, aktualizacje historii przeglądania oraz zrzuty ekranu z otwartymi dokumentami i e-mailami. </p> <p> Zakładając ochronę przed możliwymi naruszeniami danych, wiele firm wykorzystuje je również jako mechanizmy raportowania lub narzędzia do śledzenia wydajności. </p> <p> </p> <h3 id=\"online-messaging-history\"> Historia wiadomości online </h3> <p> Pomimo wzrostu liczby platform szyfrowanych w rzeczywistości Twoje wiadomości nie są całkowicie prywatne na urządzeniach firmowych. Korzystając z platform komunikacyjnych, firmy mogą nie być w stanie zobaczyć dokładnych szczegółów Twoich giełd, ale prawdopodobnie nadal będą w stanie rozpoznać metadane, takie jak rozmiar i typ pliku. </p> <p> Dzięki temu, jeśli zdecydujesz się wysłać pliki PDF o dużych rozmiarach za pośrednictwem aplikacji takiej jak WhatsApp, system wykrywania włamań Twojej firmy prawdopodobnie zgłosi podejrzane zachowanie. Zgodnie z wytycznymi korporacyjnymi mogą poprosić Cię o udowodnienie, że Twoje działania nie były złośliwe i mogą wymagać uzyskania zgody kierownictwa. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> Jak uniknąć udostępniania danych osobowych pracodawcy </h2> <p> Nie ma absolutnego sposobu, aby Twoje dane osobowe, rozmowy i działania były całkowicie poza zasięgiem przez cały czas. Istnieje jednak kilka sposobów na ograniczenie ryzyka. </p> <p> Nie zalecamy ukrywania danych przed pracodawcami; w rzeczywistości mają prawo zbierać informacje o swoich pracownikach – nawet będąc <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> w stanie Cię legalnie śledzić </a> . Ale musisz wiedzieć, kiedy należy zachować rzeczy dla siebie, a to zależy od poszczególnych firm. </p> <h3 id=\"read-company-policies\"> Przeczytaj zasady firmy </h3> <p> Zanim będziesz mógł spierać się o przejrzystość danych, musisz również zrozumieć rodzaj informacji, które świadomie przekazujesz swojemu pracodawcy, pracując dla niego. Dopiero gdy wiesz, czego się oczekuje, możesz ustalić odpowiednie granice zawodowe. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Staraj się zrozumieć firmowe zasady i procedury gromadzenia danych przed ich zebraniem. Stamtąd możesz skutecznie zaplanować rezygnację z dostarczania większej ilości informacji niż jest to konieczne. </p> <h3 id=\"use-personal-gadgets\"> Używaj gadżetów osobistych </h3> <p> Chociaż korzystanie z urządzeń firmowych w celu zaoszczędzenia pieniędzy zawsze jest kuszące, w rzeczywistości nic nie jest naprawdę darmowe. Zainwestuj w laptopy, telefony komórkowe i tablety do użytku osobistego. </p> <p> Posiadanie oddzielnych urządzeń osobistych to również świetny sposób na ustalenie granic, zwłaszcza podczas pracy zdalnej. </p> <p> Korzystanie z własnego urządzenia daje możliwość ustanowienia różnych praktyk bezpieczeństwa niezbędnych do ochrony danych przed wzrokiem ciekawskich i zarządzania nimi. Może wydawać się to niepotrzebnym wydatkiem, ale jest to długa droga do zachowania spokoju ducha. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Używaj profili gości na urządzeniach osobistych </h3> <p> Łączenie się z dowolną siecią, która nie jest Twoją własną, zawsze stanowi zagrożenie bezpieczeństwa, nawet jeśli znajduje się w miejscu pracy. Zalogowanie się do firmowej sieci Wi-Fi daje pracodawcy uprawnienia dostępu do wszystkiego, od metadanych wiadomości po przeglądanie dzienników historii. </p> <p> Jeśli absolutnie musisz korzystać z osobistego laptopa w sieciach firmowych, możesz zdecydować się na użycie profilu gościa, aby zmniejszyć ilość danych, do których mogą uzyskać zdalny dostęp. Alternatywnie możesz połączyć się z planem transmisji danych osobistego telefonu komórkowego lub przenośnym urządzeniem Wi-Fi. </p> <h3 id=\"keep-your-passwords-safe\"> Dbaj o bezpieczeństwo swoich haseł </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Tworzenie silnych haseł </a> nie wystarczy. Musisz upewnić się, że Twoje hasła nie zostaną zapisane na urządzeniach firmowych. Zapisywanie osobistych haseł do kont bankowości internetowej, osobistych e-maili lub witryn rządowych na gadżetach, których nie jesteś właścicielem, naraża Twoje dane na bezpośrednie ryzyko, jeśli baza danych Twojej firmy zostanie naruszona. </p> <p> Korzystaj wyłącznie z osobistego telefonu komórkowego lub laptopa, aby uzyskać dostęp do ważnych kont, zwłaszcza tych, w których w grę wchodzą pieniądze. Jeśli to możliwe, włącz uwierzytelnianie dwuskładnikowe. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> Oddziel pracę od życia osobistego </h2> <p> Pracodawcy mają prawo do zdalnego dostępu do urządzenia wydanego przez firmę, jeśli podejrzewają, że bierzesz udział w jakiejkolwiek formie nielegalnej działalności, narażasz informacje firmy na ryzyko lub zażądasz przeprowadzenia dochodzenia przez organy ścigania. </p> <p> Różni się to jednak od urządzeń osobistych. </p> <p> Twoje bezpieczeństwo jest tylko tak silne, jak ludzie, z którymi się kontaktujesz – w tym Twój pracodawca. Oddzielenie urządzeń osobistych i służbowych to tylko jeden krok w kierunku decentralizacji danych. Stosując silne środki bezpieczeństwa, możesz ograniczyć liczbę punktów dostępu hakerów do dokumentów, e-maili i sieci. </p> <p> Decentralizacja danych osobowych jest konieczna, ponieważ chroni Ciebie jako osobę i Twoją firmę przed kradzieżą, oszustwami i innymi formami cyberprzestępczości. </p>"}