{"title":"Jak zatrzymać system Windows 10 przed blokowaniem pobranych plików?","content":"<p> Podczas próby otwarcia pliku system Windows 10 może uniemożliwić jego bezpośrednie otwarcie. Wyświetli ostrzeżenie dotyczące bezpieczeństwa, że ​​plik pochodzi z nieznanego źródła i może być niezabezpieczony. Dzieje się tak, gdy funkcja systemu Windows 10 o nazwie Menedżer załączników blokuje pliki, które uważa za niebezpieczne dla komputera. </p> <p> Chociaż możesz ręcznie odblokować każdy plik, może to być męczący proces - zwłaszcza jeśli musisz to zrobić dla prawie każdego pobieranego pliku. W tym artykule pokażemy, jak powstrzymać system Windows 10 przed blokowaniem pobranych plików. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> Co to jest Menedżer załączników w systemie Windows 10? </h2> <p> W systemie Windows 10 dostępna jest funkcja zabezpieczeń o nazwie Menedżer załączników, która blokuje otwieranie niebezpiecznych plików. Mogą to być pliki, które pobrałeś lub <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> pliki, które system Windows identyfikuje jako niebezpieczne załączniki do wiadomości e-mail </a> . Jeśli Menedżer załączników uzna plik za niebezpieczny, uniemożliwia systemowi Windows 10 jego otwarcie i wyświetla komunikat ostrzegawczy. Menedżer załączników klasyfikuje pobierane pliki na podstawie typu pliku i rozszerzenia nazwy pliku. </p> <p> Menedżer załączników systemu Windows używa interfejsu programowania aplikacji (API) IattachmentExecute, aby znaleźć typ pliku, skojarzenie plików i określić najbardziej odpowiednią akcję do wykonania. Podczas pobierania plików i zapisywania ich na dysku system Windows dodaje do tych plików określone metadane. Te metadane są uważane za załączniki. Gdy system Windows dodaje metadane do pobieranych plików jako załącznik, jest to znane jako Informacje o strefie. </p> <p> Teraz <strong> Informacje o strefie </strong> to jest miejsce, w którym tkwi sedno sprawy. Gdy Eksplorator plików otwiera plik, odczytuje dołączone informacje o strefie przechowywane w tej samej lokalizacji i sprawdza, czy plik pochodzi z nieznanego źródła, czy nie. Jeśli system Windows stwierdzi, że plik jest nierozpoznany lub pochodzi z nieznanych źródeł, uniemożliwia jego otwarcie. </p> <p> Pojawi się ostrzeżenie Windows SmartScreen z informacją: </p> <blockquote> <p> Windows SmartScreen uniemożliwił uruchomienie nierozpoznanej aplikacji. Uruchomienie tej aplikacji może narazić komputer na ryzyko. </p> </blockquote> <p> Jeśli chcesz ręcznie otworzyć zablokowany plik, kliknij pobrany plik prawym przyciskiem myszy, a następnie wybierz <strong> Nieruchomości </strong> . Na karcie Ogólne kliknij <strong> Odblokować </strong> , Kliknij <strong> Zastosować </strong> a następnie kliknij <strong> dobrze </strong> . </p> <p> Ale wyobraź sobie, że musisz to robić za każdym razem, gdy pobierasz plik, co może być denerwujące i czasochłonne. Jeśli często pobierasz pliki z Internetu lub odbierasz pliki jako załączniki do wiadomości e-mail, możesz całkowicie uniemożliwić komputerowi blokowanie plików. </p> <p> Aby system Windows 10 nie blokował Ci otwierania plików, musisz uniemożliwić mu dodawanie informacji o strefie do pobieranych plików. Można to zrobić, konfigurując Menedżera załączników ręcznie za pomocą Edytora lokalnych zasad grupy lub Edytora rejestru. </p> <p> Podamy kroki, jak możesz to zrobić. Musisz być zalogowany jako administrator lub powinieneś <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> poproś o uprawnienia administratora </a> aby móc zatrzymać blokowanie pobranych plików. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Skonfiguruj Menedżera załączników za pomocą Edytora rejestru </h2> <p> wciśnij <strong> Klawisz Windows + R </strong> aby otworzyć Edytor rejestru. Następnie wpisz „Regedit” i kliknij <strong> Wchodzić </strong> . Pojawi się monit Kontrola konta użytkownika. Gdy pojawi się ten monit, kliknij <strong> tak </strong> przycisk, aby kontynuować. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Przejdź do klucza załączników w Edytorze rejestru: <strong> HKEY_CURRENT_USER &gt; Oprogramowanie &gt; Microsoft &gt; Windows &gt; Bieżąca wersja &gt; Zasady &gt; Załączniki </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> Jeśli klucz załączników jest nieobecny w kluczu zasad, musisz go utworzyć. Aby to zrobić, kliknij prawym przyciskiem myszy <strong> Zasady </strong> klawisz, kliknij <strong> Nowy </strong> , Kliknij <strong> Klucz </strong> . Spowoduje to utworzenie nowego klucza, który należy nazwać „Załącznikami”. Jeśli okaże się, że klucz załączników jest już obecny, możesz przejść do następnego kroku. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> Kliknij prawym przyciskiem myszy <strong> Załączniki </strong> klawisz, kliknij <strong> Nowy </strong> a następnie wybierz <strong> Wartość DWORD (32-bitowa) </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Zostaniesz poproszony o nazwanie tej nowo utworzonej wartości DWORD. Nazwij go „SaveZoneInformation” i kliknij <strong> Wchodzić </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> Na koniec, aby wyłączyć Menedżera załączników w systemie Windows 10, kliknij dwukrotnie nowo utworzony <strong> ZapiszInformacje o Strefie </strong> wartość i zmień jej dane wartości na 1. Kliknij <strong> dobrze </strong> skończyć. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Po wykonaniu tych kroków zamknij Edytor rejestru i uruchom ponownie komputer, aby zastosować zmiany. Od tego momentu żaden pobrany plik nie będzie już dołączać informacji o strefie do alternatywnego strumienia danych pliku. Umożliwi to bezproblemowe otwarcie plików. </p> <p> Jeśli chcesz wrócić i włączyć Menedżera załączników, możesz to zrobić, przechodząc do klucza załączników w Edytorze rejestru: <strong> HKEY_CURRENT_USER &gt; Oprogramowanie &gt; Microsoft &gt; Windows &gt; Bieżąca wersja &gt; Zasady &gt; Załączniki </strong> . Stąd, po prawej stronie, kliknij dwukrotnie <strong> ZapiszInformacje o Strefie </strong> wartość i zmień jej dane wartości na 3. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Skonfiguruj Menedżera załączników za pomocą lokalnego edytora zasad grupy </h2> <p> Edytor lokalnych zasad grupy jest dostępny tylko w wersjach Windows 10 Enterprise, Education i Pro. W rezultacie ta metoda nie ma zastosowania, jeśli posiadasz wersję Windows 10 Home. Jeśli Twój komputer działa w wersji Windows 10 Home, musisz skonfigurować Menedżera załączników za pomocą Edytora rejestru. </p> <p> Jeśli używasz wersji systemu Windows 10 z Edytorem lokalnych zasad grupy, możesz skonfigurować Menedżera załączników, wykonując czynności wskazane tutaj. </p> <p> Aby rozpocząć, naciśnij <strong> Klawisz Windows + R </strong> , wpisz „gpedit.msc” i kliknij <strong> Wchodzić </strong> aby otworzyć Edytor lokalnych zasad grupy. </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Przejdź do Menedżera załączników: <strong> Konfiguracja użytkownika &gt; Szablony administracyjne &gt; Składniki systemu Windows &gt; Menedżer załączników </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> W prawym okienku Menedżera załączników kliknij dwukrotnie ikonę <strong> Nie zachowuj informacji o strefie w plikach załączników </strong> zasady, aby edytować ustawienia informacji o strefie. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> Pojawi się okno, w którym możesz wybrać, czy Menedżer załączników powinien, czy nie powinien zachowywać informacji o strefie. </p> <p> Kliknij <strong> Włączone </strong> aby zezwolić Menedżerowi załączników na niezachowywanie informacji o strefie. Zapewni to, że system Windows nie zablokuje twoich plików za każdym razem, gdy je otworzysz. Kliknij <strong> Zastosować </strong> przycisk, aby zapisać zmiany, a następnie kliknij <strong> dobrze </strong> . </p> <p> Po zakończeniu zamknij Edytor lokalnych zasad grupy i uruchom ponownie komputer, aby zapisać zmiany. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows nie będzie już blokować twoich plików </h2> <p> Jeśli wcześniej musiałeś ręcznie odblokować większość pobranych plików, zdałeś sobie sprawę, jak męczący może być ten proces. Po zastosowaniu tych wskazówek będziesz mieć swobodę otwierania wszystkich plików z łatwością. </p> <p> Jeśli pobierasz pliki i w jakiś sposób wątpisz w ich wiarygodność, zawsze możesz je otworzyć w bezpiecznych, odizolowanych środowiskach, aby upewnić się, że Twój komputer i dane są bezpieczne. </p>"}