{"title":"Jak wyświetlić statystyki czasu gry na PS5?","content":"<p> Jeśli lubisz widzieć, ile czasu spędziłeś na graniu w gry, PS5 ma dla Ciebie ukrytą, ale przydatną funkcję. Śledzi, ile czasu spędziłeś na graniu w gry w systemie. </p> <p> Oto, jak sprawdzić, ile czasu spędziłeś na graniu w gry na PlayStation 5. Co może Cię zachęcić do <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> wyłącz PS5 </a> częściej. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> Jak sprawdzić statystyki czasu gry na PlayStation 5? </h2> <p> Na ekranie głównym PS5 wybierz ikonę swojego profilu w prawym górnym rogu. Możesz nacisnąć <strong> Trójkąt </strong> aby szybko przenieść zaznaczenie do tego obszaru ekranu. Po otwarciu tego menu wybierz <strong> Profil </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Teraz przejdź do <strong> Gry </strong> patka. Tutaj zobaczysz wszystkie gry, w które grałeś na swoim koncie PlayStation. Każdy z nich pokazuje ostatni czas, w którym grałeś w grę, a także łączną liczbę godzin gry. Nie jest to jednak dokładne co do minuty. Zobaczysz czas gry zaokrąglony do godziny. </p> <p> Zobaczysz tutaj również czas odtwarzania swoich tytułów na PS4, nawet jeśli nie grałeś w nie na PS5. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> O ile nam wiadomo, ten czas gry obejmuje cały czas, w którym gra była uruchomiona — nie tylko wtedy, gdy aktywnie grałeś. Oznacza to, że jeśli opuściłeś grę w menu pauzy, gdy odebrałeś telefon lub zjadłeś coś do jedzenia, ten czas zostanie doliczony do sumy. Może nie jest to zbyt dokładne, ale przynajmniej da ci wyobrażenie o tym, jak długo grałeś w każdy tytuł. </p> <p> </p> <p> Jeśli jesteś ciekawy, możesz również zobaczyć statystyki czasu gry swoich znajomych. Wybierz <strong> Przyjaciele </strong> na tym samym ekranie i wybierz znajomego, o którym chcesz dowiedzieć się więcej. To pokaże ci, ile czasu spędzili w swoich grach w identycznym menu. </p> <p> Jeśli nie chcesz, aby informacje o Twoim czasie gry były widoczne dla innych graczy, przewiń w prawo i wybierz <strong> Ustawienia prywatności </strong> . W tym menu, pod <strong> Twoja aktywność </strong> sekcji, zmień opcję na <strong> Kto może zobaczyć Twoją historię gier </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Niektóre gry również śledzą swój czas gry Play </h2> <p> Jeśli interesują Cię takie dane, otwórz swoje ulubione gry i sprawdź, czy śledzą, ile czasu spędziłeś na graniu. Spora liczba tytułów obejmuje całkowity czas odtwarzania w pliku zapisu, w menu pauzy lub podobnym. </p> <p> Chociaż nie jest to spójne we wszystkich grach i może, ale nie musi uwzględniać czasu spędzonego podczas pauzy, może dać ci lepszy wgląd w grę, o której chcesz dowiedzieć się więcej. Niektóre gry online, takie jak Overwatch, śledzą nawet czas spędzony z każdym bohaterem w różnych trybach. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Zobacz, ile naprawdę grasz </h2> <p> PS5 ułatwia sprawdzenie, ile czasu spędziłeś na graniu w gry. To mała, ale bardzo ceniona funkcja, ponieważ PS4 nie udostępniało tych danych w łatwy sposób. </p> <p> Tymczasem istnieje więcej sposobów zarządzania grą, grając poza samą konsolą. </p> <p> <small> Źródło zdjęcia: LightField Studios/ <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}