{"title":"Jak naprawić BSOD VIDEO_TDR_FAILURE w systemie Windows 10?","content":"<p> Błąd VIDEO_TDR_FAILURE oznacza, że ​​karta graficzna jest uszkodzona lub sterowniki ekranu mogą być przestarzałe lub niesprawne. Ale mogą istnieć inne przyczyny, takie jak przegrzanie komponentów lub uszkodzone pliki systemowe. TDR to skrót od <strong> Limit czasu, wykrywanie i odzyskiwanie </strong> , metoda używana przez system Windows do identyfikowania i naprawiania nieprawidłowo działających składników oprogramowania. </p> <p> Jeśli napotkasz ten błąd, nie obawiaj się, ponieważ poniższe metody naprawią błąd VIDEO_TDR_FAILURE szybciej, niż się spodziewasz. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Zaktualizuj i ponownie zainstaluj sterowniki ekranu </h2> <p> Jak wspomniano powyżej, błąd jest zwykle wynikiem nieprawidłowego działania lub nieaktualnych sterowników ekranu. Dlatego powinieneś zaktualizować sterowniki karty graficznej. Jeśli to nie rozwiąże problemu, zainstaluj je ponownie. W zależności od karty graficznej możesz napotkać różne nazwy plików związane z błędem. </p> <ol> <li> Dla użytkowników Nvidii jest to <strong> nvlddmkm.sys </strong> . Jeśli jesteś użytkownikiem Nvidii, oto <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 prostych sposobów na naprawienie błędu. </a> </li> <li> W przypadku użytkowników AMD błąd pojawia się jako <strong> atikmpag.sys </strong> . </li> <li> W przypadku użytkowników Intel HD błąd to <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> Jak zaktualizować sterowniki ekranu </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> naciśnij <strong> Klawisz Windows + R </strong> aby otworzyć polecenie Uruchom. Wpisz <strong> devmgmt.msc </strong> i naciśnij Enter. </li> <li> w <strong> Menadżer urządzeń </strong> okno, przejdź do <strong> Karty graficzne </strong> i rozwiń go. </li> <li> Kliknij prawym przyciskiem myszy kartę graficzną, a następnie wybierz <strong> Uaktualnij sterownik </strong> . </li> <li> Wybierz <strong> Wyszukaj automatycznie zaktualizowane oprogramowanie sterownika </strong> . </li> <li> System Windows automatycznie przeszuka sieć i pobierze wymagane sterowniki. Upewnij się, że masz aktywne połączenie internetowe. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> Jak ponownie zainstalować sterowniki ekranu </h3> <p> Jeśli błąd BSOD wideo tdr nadal występuje po zaktualizowaniu sterowników ekranu, najlepiej jest ponownie zainstalować te sterowniki. Zaleca się to zrobić, gdy system Windows jest uruchomiony w trybie awaryjnym. Ale zanim to zrobisz, powinieneś udać się na stronę producenta karty graficznej i pobrać najnowszą wersję sterowników graficznych. </p> <p> Najpopularniejszymi producentami są <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> , i <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intel </a> . </p> <p> Aby uruchomić komputer w trybie awaryjnym, wykonaj następujące kroki: </p> <ol> <li> naciśnij <strong> Klawisz Windows + R, </strong> i w oknie dialogowym Uruchom wpisz <strong> msconfig, </strong> i naciśnij Enter. </li> <li> w <strong> Konfiguracja systemu </strong> kliknij na <strong> Bagażnik </strong> patka. </li> <li> Teraz zaznacz <strong> Tryb bezpieczeństwa </strong> pole wyboru znajdujące się na dole. </li> <li> Zastosuj ustawienia i uruchom ponownie komputer. </li> </ol> <p> Po uruchomieniu w trybie awaryjnym nadszedł czas na ponowną instalację sterowników ekranu. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> W pasku wyszukiwania menu Start wpisz, <strong> Menadżer urządzeń </strong> i otwórz. </li> <li> Szukać <strong> Karty graficzne </strong> i rozwiń menu. </li> <li> Kliknij prawym przyciskiem na GPU i kliknij <strong> Odinstaluj urządzenie </strong> . </li> <li> W kreatorze dezinstalacji sprawdź <strong> Usuń oprogramowanie sterownika dla tego urządzenia </strong> pudełko. </li> <li> Poczekaj, aż system Windows odinstaluje urządzenie i ponownie uruchomi komputer. </li> <li> Teraz ponownie zainstaluj pobrane wcześniej sterowniki graficzne. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Użyj SFC do skanowania i naprawy plików systemowych </h2> <p> SFC to wbudowane narzędzie Windows, które może być używane do skanowania i naprawiania uszkodzonych plików systemowych. W przypadku BSOD jest bardzo prawdopodobne, że niektóre pliki systemowe są uszkodzone, więc uruchomienie tego narzędzia jest konieczne. To tylko jeden z <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> dostępnych kilka przydatnych narzędzi </a> do dyspozycji użytkownika Windows. </p> <p> Aby uruchomić SFC, wykonaj następujące kroki: </p> <ol> <li> W pasku wyszukiwania menu Start wpisz, <strong> cmd </strong> . </li> <li> Kliknij prawym przyciskiem myszy <strong> Wiersz polecenia </strong> i wybierz <strong> Uruchom jako administrator </strong> . </li> <li> W konsoli wpisz <strong> sfc /skanuj </strong> i naciśnij Enter. </li> <li> Po zakończeniu procesu skanowania i naprawy uruchom ponownie komputer. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Uruchom naprawę podczas uruchamiania </h2> <p> Dla użytkowników, którzy otrzymują błąd zaraz po uruchomieniu systemu Windows 10 lub wkrótce po zalogowaniu, naprawa podczas uruchamiania jest darem niebios. Ta funkcja systemu Windows sprawdza anomalie podczas uruchamiania i natychmiast je naprawia. </p> <p> Ponieważ ta sekcja jest skierowana do użytkowników, których komputery stały się bezużyteczne z powodu błędu, tj. nie mogą otworzyć <strong> Ustawienia </strong> , będą musieli wykonać twardy restart, aby przejść do środowiska odzyskiwania systemu Windows (winRE). </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Wykonaj poniższe czynności, aby uruchomić środowisko odzyskiwania systemu Windows: </p> <ol> <li> Naciśnij i przytrzymaj przycisk zasilania, aż komputer się wyłączy. </li> <li> Naciśnij ponownie przycisk zasilania, aby uruchomić komputer. </li> <li> Powtarzaj pierwszy i drugi krok, aż komputer uruchomi się w trybie odzyskiwania. To będzie niebieski ekran. </li> <li> Na ekranie odzyskiwania kliknij <strong> Zobacz zaawansowane opcje naprawy </strong> . </li> <li> Na następnym ekranie kliknij <strong> Rozwiązywanie problemów </strong> </li> <li> Kliknij <strong> Zaawansowane opcje </strong> </li> <li> Kliknij <strong> Naprawa przy rozruchu </strong> i wprowadź swoje dane uwierzytelniające, gdy zostaniesz o to poproszony. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Zmień ustawienia zarządzania energią </h2> <p> Ustawienia zarządzania energią w systemie Windows są zwykle dobrze zoptymalizowane, ale czasami mogą zakłócać obsługę grafiki przez komputer. Jest to szczególnie ważne, gdy komputer ma dyskretny procesor graficzny. Optymalne ustawienia, aby uniknąć BSOD VIDEO_TDR_FAILURE, podano poniżej: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> W pasku wyszukiwania menu Start wpisz, <strong> Panel sterowania </strong> i otwórz. </li> <li> Na pasku wyszukiwania Panelu sterowania wpisz „opcje zasilania” i naciśnij Enter. </li> <li> Kliknij <strong> Opcje mocy, </strong> i obok planu zasilania, którego używasz, kliknij <strong> Zmień ustawienia planu. </strong> </li> <li> Kliknij <strong> Zmień zaawansowane ustawienia zasilania. </strong> </li> <li> Szukać <strong> PCI E </strong><strong> xpress </strong> i rozwiń go. </li> <li> Włącz <strong> Zarządzanie energią stanu łącza </strong> ustawienie na <strong> Poza </strong> . </li> <li> Zapisz zmiany i uruchom ponownie komputer. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Wyczyść swój komputer </h2> <p> Przegrzanie nigdy nie jest dobrą rzeczą i zwykle przyczyną jest gromadzenie się kurzu. Zalecamy użytkownikom czyszczenie komponentów komputera z kurzu co miesiąc. Ale bądź ostrożny. Należy to zrobić delikatnie. </p> <p> Pamiętaj o wyczyszczeniu górnej części karty graficznej, wentylatora procesora, zasilacza i wentylatorów szafy. W sumie należy unikać <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> błędy konserwacyjne, które mogłyby uszkodzić drogie komponenty. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Sprawdź komponenty sprzętowe </h2> <p> Jeśli błąd nadal pojawia się po wypróbowaniu wszystkiego, co zostało wymienione powyżej, może to oznaczać usterkę samego sprzętu. Użytkownicy posiadający dedykowaną kartę graficzną powinni ją wyjąć i uruchomić komputer. Jeśli błąd został rozwiązany, oznacza to, że jest to usterka sprzętowa samego GPU. Możesz spróbować skontaktować się z producentem i spróbować wymienić urządzenie. </p> <p> </p> <p> Korzystając z wbudowanej grafiki, spróbuj je wyłączyć i uruchomić. Aby je wyłączyć, wykonaj następujące kroki: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> naciśnij <strong> Klawisz Windows +R, </strong> rodzaj <strong> devmgmt.msc </strong> w polu tekstowym Uruchom i naciśnij klawisz Enter. </li> <li> W <strong> Menadżer urządzeń </strong> , szukać <strong> Karty graficzne </strong> i rozwiń menu. </li> <li> Kliknij prawym przyciskiem na wbudowany procesor graficzny i kliknij <strong> Wyłącz urządzenie </strong> . </li> <li> Uruchom ponownie komputer i sprawdź, czy błąd został rozwiązany. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> Błąd „Awaria wideo TDR” został rozwiązany pomyślnie </h2> <p> W przypadku większości użytkowników prosta aktualizacja lub ponowna instalacja sterowników ekranu rozwiąże problem. Ale jeśli sytuacja się pogorszy, może być konieczne zresetowanie komputera lub wymiana sprzętu. </p>"}