{"title":"Jak poprawić swoje umiejętności edycji Lightroom: 10 łatwych sposobów","content":"<p> Adobe Lightroom to jedna z najbardziej znanych platform do edycji zdjęć na rynku. To rozwiązanie jest popularne nie tylko ze względu na tak wiele przydatnych funkcji, ale także ze względu na łatwość obsługi. </p> <p> Kiedy fotografowie chcą potraktować swoje rzemiosło trochę poważniej, pierwszą rzeczą, jaką zrobią, będzie zakup oprogramowania do edycji. Ale nawet jeśli jesteś zwykłym fotografem, Lightroom oferuje wiele sposobów, aby zachwycić znajomych. </p> <p> W tym przewodniku odkryjesz kilka prostych sposobów na poprawienie zdjęć w Lightroomie. Te wskazówki dotyczą zarówno programu Lightroom Classic, jak i Lightroom Creative Cloud. </p> <h2 id=\"use-masking\"> 1. Użyj maskowania </h2> <p> Jeśli domyślnie wyostrzysz zdjęcie, dodasz szczegóły do ​​całego obrazu — nawet do niechcianych obszarów. To może pozostawić dużo zboża w niepożądanych miejscach, takich jak niebo i woda. </p> <p> Ryzykujesz również, że Twoje zdjęcie będzie wyglądać bardziej jak rysunek niż coś, co zrobiłeś aparatem. Na szczęście istnieje proste rozwiązanie. </p> <p> W aplikacji Lightroom przewiń w dół do <strong> Szczegół </strong> . Kiedy tam będziesz, idź do <strong> Ostrzenie </strong> &gt; <strong> Maskowanie </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Przesuwaj suwak, aż zostaną zaznaczone części obrazu, które chcesz wyostrzyć. Aby zobaczyć, co maskujesz, naciśnij <strong> Alt </strong> klawisz na klawiaturze w tym samym czasie. </p> <p> Po zamaskowaniu odpowiedniego obszaru przesuń suwak wyostrzania tyle, ile potrzebujesz. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Użyj profili aparatu zamiast domyślnych Adobe One One </h2> <p> Jeśli prześlesz obraz w formacie RAW, Adobe doda domyślnie jeden ze swoich profili programowych. I chociaż w niektórych przypadkach może to sprawić, że Twoje zdjęcie będzie wyglądało lepiej, często lepiej wybrać ten przeznaczony do aparatu. </p> <p> Gdy używasz profilu aparatu, zdjęcie będzie łatwiejsze do edycji na podstawie tego, co zrobiłeś za pomocą urządzenia. </p> <p> Aby zmienić profil swojego zdjęcia, przejdź do <strong> Profile </strong> &gt; <strong> Dopasowanie kamery </strong> . Następnie możesz wybierać spośród <strong> Standard </strong> , <strong> Neutralny </strong> , <strong> Krajobraz </strong> i inne spojrzenia. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Zapamiętaj: </strong> nie można zmienić profilu obrazu na tak dużą głębokość, jeśli robisz tylko pliki JPEG. Tak więc, zanim wyjdziesz, aby zrobić kilka ujęć, ustaw aparat na albo <strong> SUROWY </strong> lub <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Posmaruj części swojego zdjęcia </h2> <p> Czy kiedykolwiek podniosłeś klarowność, nasycenie lub szczegółowość całego obrazu, oczekując arcydzieła, ale zamiast tego uzyskałeś obraz, który wygląda tak, jakby został zrobiony w kuchence mikrofalowej? Jeśli tak, możesz zamiast tego poprawić tylko części obrazu. </p> <p> W Lightroom możesz uzyskać dostęp do funkcji o nazwie <strong> Szczotka </strong> . Możesz użyć tego do „szczotkowania” części obrazu, pozostawiając resztę w spokoju. </p> <p> Aby skorzystać z tego narzędzia, przejdź do <strong> Szczotka </strong> po prawej stronie ekranu. Możesz powiększyć lub zmniejszyć pędzel, w zależności od tego, ile obrazu chcesz edytować. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Przed rozpoczęciem szczotkowania zmień cechy obrazu, które chcesz dostosować. Na przykład możesz podnieść suwak przejrzystości, jeśli chcesz, aby jedna część obrazu była wyraźniejsza. </p> <p> Po zmianie tych funkcji przeciągnij palcem po obszarach, które chcesz edytować. naciśnij <strong> O </strong> na klawiaturze, aby zobaczyć, gdzie przejechałeś. </p> <p> Jeśli przekroczyłeś zbyt wiele w danym obszarze, przytrzymaj <strong> Minus </strong> ( <strong> - </strong> ) i przesuń palcem po tych częściach, aby usunąć zmiany. Porozumiewawczy <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> skróty klawiaturowe dla Adobe Lightroom </a> przydaje się w takich sytuacjach, więc nie zapomnij ich odświeżyć! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Chroń swoje zdjęcia </h2> <p> Czasami aparat robi zdjęcia, w których krawędzie mają nienaturalne kolory. Zauważysz je szczególnie podczas robienia zdjęć w ostrym świetle słonecznym. Występują głównie w odcieniach zieleni i fioletu. </p> <p> Aby usunąć ramkę ze zdjęć, przewiń w dół do <strong> Odrzuć </strong> . Możesz pozbyć się fioletowych lub zielonych frędzli. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> Posługiwać się <strong> Ilość </strong> aby zdecydować, ile odliczenia chcesz dodać. Przesuń pasek kolorów, aż będziesz zadowolony z wyników. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Użyj geometrii, aby wyprostować swoje zdjęcia </h2> <p> Bez względu na to, jak bardzo się starasz, trzymanie aparatu prosto jest trudne, chyba że masz statyw. Ale dzięki magii oprogramowania do edycji prostowanie zdjęć jest łatwe. </p> <p> W Lightroomie możesz automatycznie wyprostować swoje zdjęcia, przechodząc do <strong> Przyciąć </strong> Sekcja. Istnieje jednak dokładniejszy sposób na osiągnięcie tego samego wyniku. </p> <p> Na karcie po prawej stronie wybierz górną opcję. Następnie przewiń w dół do <strong> Geometria </strong> . Kiedy tu będziesz, idź do <strong> Pionowo </strong> &gt; <strong> Poziom </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> Możesz także rysować wzdłuż linii prostych, aby zdjęcie było jak najprostsze. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Dostosuj rozmiar obszaru ostrzenia </h2> <p> Wiesz już o maskowaniu, ale czy wiesz, że możesz też wyostrzyć określone obszary zdjęcia? </p> <p> Aby wybrać obszar na zamaskowanym zdjęciu, który chcesz wyostrzyć, przejdź do <strong> Ostrzenie </strong> , przytrzymaj <strong> Alt </strong> klucz i przejdź do <strong> Promień </strong> . Regulacja tego suwaka pozwala powiększyć lub pomniejszyć obszar ostrzenia. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> Następnie przejdź do <strong> Ostrzenie </strong> bar. Podobnie, przytrzymaj <strong> Alt </strong> i przesuń suwak w prawo. Ułatwi to wyostrzenie określonego obszaru zdjęcia, a nie całego obrazu. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Użyj krzywych punktów koloru </h2> <p> Jeśli kolor obrazu nie wygląda prawidłowo nawet po dostosowaniu balansu bieli, warto sprawdzić krzywe punktów koloru w programie Lightroom. Możesz ich użyć do dostosowania niektórych kolorów obrazu. </p> <p> W aplikacji znajdziesz trzy różne panele krzywych kolorów: czerwony, niebieski i zielony. </p> <p> Aby dostać się do tych krzywych kolorów, przewiń w dół do <strong> Krzywa punktowa </strong> . Następnie kliknij kolor, który chcesz zmienić. Następnie możesz bawić się kolorami w taki sam sposób, jak w przypadku standardu <strong> Krzywa punktowa </strong> patka. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Wpisz liczbę dla każdego suwaka i odpowiednio dostosuj </h2> <p> Często nowi fotografowie będą podekscytowani liczbą dostępnych opcji edycji. Kiedy otworzą Lightroom, przesuną każdy pasek zbyt daleko w dowolnym kierunku. Ale zamiast poprawiać swój wizerunek, kończą z przesadnym bałaganem. </p> <p> Podczas edycji zdjęć kluczowe jest wprowadzanie drobnych zmian. Są szanse, że jesteś już dobrym fotografem, a zrobione zdjęcie wymaga jedynie drobnego dopracowania w postprodukcji. </p> <p> </p> <p> Zamiast swobodnie przesuwać każdy suwak, spróbuj zmienić liczbę w obszarach, o które chcesz zmienić <strong> +10 </strong> lub <strong> -10 </strong> . Jeśli uważasz, że potrzeba więcej pracy, powtórz proces. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Kiedy czujesz, że jesteś blisko, powoli przesuwaj każdy suwak w lewo lub w prawo, aż będziesz zadowolony. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Przytnij swoje zdjęcia </h2> <p> Przycinanie może wydawać się oczywiste, ale wielu fotografów wciąż nie wykorzystuje tej funkcji. Ważne jest również przycinanie obrazów w zależności od tego, gdzie zamierzasz ich użyć. W przeciwnym razie zostaną zniekształcone. </p> <p> Aby przyciąć zdjęcia, przejdź do to <strong> Przyciąć </strong> Ikona. To drugi najwyższy od góry. Iść do <strong> Współczynnik proporcji </strong> aby zmienić rozmiar i przeciągnij rogi, aby pozbyć się niechcianych obiektów. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> Po zakończeniu przycinania naciśnij <strong> Wchodzić </strong> na komputerze, a zmiany wejdą w życie. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Użyj histogramu </h2> <p> Histogram Lightrooma można łatwo zignorować, ale trzeba go znać. Ten mały wykres pokaże, gdzie kolory i oświetlenie są nierówne na Twoim obrazie, co pozwala na bardziej przejrzystą edycję. </p> <p> Z reguły dobrze edytowane zdjęcie będzie miało kilka skoków na histogramie. Czasami jest to nieuniknione. Ale ogólnie powinieneś starać się, aby wykres był jak najbardziej wyrównany. </p> <p> W zależności od używanej wersji Lightrooma możesz manipulować histogramem mniej lub bardziej bezpośrednio. W Lightroom Classic możesz kliknąć histogram, a nawet rzeczy, przesuwając niektóre sekcje. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> W Creative Cloud histogram jest podobnie widoczny w prawym górnym rogu, ale musisz samodzielnie zmienić suwaki, aby histogram się poruszał. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> W obu wersjach platformy histogram jest dostępny u góry ekranu nad funkcjami edycji. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> Świetna edycja nie jest tylko dla profesjonalistów </h2> <p> Lightroom to doskonałe oprogramowanie do edycji dla każdego, kto chce przenieść swoje zdjęcia na wyższy poziom. A nawet jeśli nigdy wcześniej nie korzystałeś z platformy, nie musisz się martwić, ponieważ jest łatwa do nauczenia. </p> <p> Podczas edycji zdjęć w Lightroomie pamiętaj, że mniej często oznacza więcej. Oprócz rozważenia tych wskazówek, dobrym pomysłem jest cofnięcie się po edycji i powrót później, aby sprawdzić, czy są one tak dobrze edytowane, jak myślałeś. </p>"}