{"title":"Jak sprawdzić, kto obserwuje Cię na Facebooku?","content":"<p> Jeśli zależy Ci na zdobywaniu większej liczby obserwujących na Facebooku tak bardzo, jak lubisz rosnących znajomych na Facebooku, możesz zobaczyć, kto obserwuje Cię na Facebooku. Możesz to łatwo zrobić zarówno na komputerze stacjonarnym, jak i telefonie komórkowym. </p> <p> Oto jak dowiedzieć się, ilu masz obserwujących na Facebooku. </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-desktop\"> Jak sprawdzić, kto obserwuje Cię na Facebooku (komputer stacjonarny) </h2> <p> Na komputerze możesz zobaczyć, kto obserwuje Cię na Facebooku, ale nie liczbę obserwujących. Jednak aplikacja mobilna Facebook pozwala zobaczyć, kto Cię obserwuje i liczbę Twoich obserwujących. </p> <p> <img alt=\"Facebook profile interface with friends\" src=\"images/click-more-and-select-followers-786.jpg\" loading=\"lazy\"> </p> <p> Najpierw zaloguj się do swojego <a href=\"https://web.facebook.com\" target=\"_blank\" rel=\"nofollow noopener\"> konto na Facebooku </a> za pośrednictwem przeglądarki i skorzystaj z poniższych instrukcji, aby zobaczyć swoich obserwatorów na Facebooku: </p> <ol> <li> Po zalogowaniu kliknij <strong> mała ikona obrazka </strong> obok Twojego imienia na pasku bocznym. </li> <li> W menu Profil kliknij <strong> Przyjaciele </strong> . </li> <li> W menu Znajomi kliknij <strong> Jeszcze </strong> menu rozwijane po prawej stronie. </li> <li> Z listy rozwijanej wybierz <strong> Obserwujący </strong> aby wyświetlić wszystkich swoich obserwujących na Facebooku. </li> </ol> <p> </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-mobile\"> Jak sprawdzić, kto obserwuje Cię na Facebooku (komórka) </h2> <p> Jak wspomnieliśmy wcześniej, aplikacja mobilna Facebook umożliwia dostęp do listy i liczby osób śledzących Cię na Facebooku. </p> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (3 obrazy) </strong> <img alt=\"Facebook profile about info menu\" src=\"images/tap-see-your-about-info-732.png\" loading=\"lazy\"> Rozszerzać <img alt=\"Mobile Facebook interface displaying Facebook followers\" src=\"images/tap-see-all-to-load-a-list-of-your-followers-895.png\" loading=\"lazy\"> Rozszerzać <img alt=\"Mobile Facebook page displaying a list of followers and their numbers\" src=\"images/look-to-the-upper-right-corner-to-see-the-number-of-followers-677.png\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> Zaloguj się do swojego konta na Facebooku przez aplikację mobilną. Następnie postępuj zgodnie z tymi instrukcjami: </p> <ol> <li> Na stronie głównej aplikacji mobilnej dotknij okrągłej ikony obrazu obok <strong> Co masz na myśli? </strong> pasek wyszukiwania, aby załadować swój profil. </li> <li> W menu profilu dotknij <strong> Zobacz swoje informacje o firmie </strong> . </li> <li> Przewiń na dół strony. Następnie pod <strong> Obserwujący </strong> , dotknij <strong> Widzieć wszystko </strong> aby załadować listę wszystkich swoich obserwujących na Facebooku. </li> <li> Spójrz na prawy górny róg strony (naprzeciw <strong> Obserwujący </strong> ), aby zobaczyć liczbę osób, które obserwują Cię na Facebooku. </li> </ol> <p> Nie będziesz mieć możliwości sprawdzenia swoich obserwujących na Facebooku, jeśli ich nie masz. W rezultacie wykonanie powyższych kroków nie pozwoli Ci sprawdzić swoich obserwujących, ponieważ ich nie ma. </p> <p> Możesz również nie uzyskać tej opcji, jeśli Twoje konto na Facebooku jest nowe, ponieważ prawdopodobnie nie masz jeszcze żadnych obserwujących. Albo możesz potrzebować <a href=\"https://www.makeuseof.com/tag/quickly-switch-facebook-profiles/\" target=\"_blank\" rel=\"nofollow noopener\"> przełącz się na inne konto na Facebooku </a> . Ewentualnie Twoje konto może nie być ustawione tak, aby umożliwić innym obserwowanie Cię na Facebooku — poniżej wyjaśnimy, jak to zmienić. </p> <p> </p> <p> </p> <h2 id=\"how-to-give-the-public-access-to-follow-you-on-facebook\"> Jak dać publiczny dostęp do obserwowania Cię na Facebooku? </h2> <p> Czasami, jeśli nie zezwoliłeś publiczności na obserwowanie Cię, ogranicza to szanse na zdobycie większej liczby obserwujących na Facebooku. </p> <p> Dzieje się tak, ponieważ osoby, których nie ma na Twojej liście znajomych, nie mogą śledzić Cię na Facebooku, jeśli im na to nie pozwolisz. Możesz jednak ustawić preferencje obserwowania jako „Publiczne”, aby każdy mógł Cię obserwować, a nie tylko Twoi znajomi. </p> <p> <strong> Aby to zrobić na komputerze: </strong> </p> <p> <img alt=\"Facebook privacy settings page\" src=\"images/click-on-public-post-and-change-who-can-follow-you-to-public-880.jpg\" loading=\"lazy\"> </p> <ol> <li> Przejdź do swojego profilu. </li> <li> Kliknij <strong> okrągła ikona rozwijana </strong> w prawym górnym rogu paska menu. </li> <li> Z listy wybierz <strong> Ustawienia i prywatność </strong> . </li> <li> Kliknij <strong> Ustawienia </strong> . </li> <li> Na pasku bocznym menu Ustawienia kliknij <strong> Posty publiczne </strong> . </li> <li> Spójrz na prawo od <strong> Kto może mnie śledzić </strong> opcję i kliknij <strong> Przyjaciele </strong> upuścić. </li> <li> Wybierz <strong> Publiczny </strong> aby dać dostęp do obserwowania każdemu, w tym osobom, które nie są Twoimi znajomymi na Facebooku. . </li> </ol> <p> <strong> Aby to zrobić w aplikacji mobilnej Facebook: </strong> </p> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (3 obrazy) </strong> <img alt=\"Facebook menu list\" src=\"images/tap-the-three-menu-bars-and-go-to-settings-170.png\" loading=\"lazy\"> Rozszerzać <img alt=\"Facebook settings list\" src=\"images/scroll-down-and-select-public-posts-754.png\" loading=\"lazy\"> Rozszerzać <img alt=\"Facebook followers settings page\" src=\"images/tick-the-public-option-under-who-can-follow-728.png\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <ol> <li> Otwórz aplikację mobilną Facebook i dotknij <strong> trzy poziome paski menu </strong> po prawej stronie strony głównej. </li> <li> Przewiń w dół i wybierz <strong> Ustawienia </strong> . </li> <li> Kran <strong> Posty publiczne </strong> . </li> <li> Pod <strong> Kto może mnie śledzić </strong> , kleszcz <strong> Publiczny </strong> . </li> </ol> <p> </p> <h2 id=\"keep-control-over-your-facebook-followers\"> Zachowaj kontrolę nad obserwującymi na Facebooku </h2> <p> Jeśli używasz Facebooka do promowania swojej marki lub firmy, konieczne jest śledzenie swoich obserwujących. To dobry sposób na moderowanie tego, co ludzie mogą o Tobie zobaczyć. </p> <p> Jeśli chcesz mieć większą kontrolę nad znajomymi i obserwującymi na Facebooku, rozważ ukrycie ich w swoim kanale. </p>"}