{"title":"Jak zmienić PS5 z pionu na poziom (lub odwrotnie)","content":"<p> PlayStation 5 działa w konfiguracji pionowej lub poziomej. Jeśli zmienisz zdanie na temat preferowanej orientacji, możesz łatwo przesunąć PS5 z pionu na poziom (lub odwrotnie). </p> <p> Przyjrzyjmy się, jak bezpiecznie przenieść PS5 z pozycji pionowej do poziomej na boku iz powrotem. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> Po pierwsze: wyłącz i odłącz PS5 </h2> <p> Zanim zaczniesz wykonywać jakąkolwiek pracę, fizycznie przenosząc PlayStation 5, ważne jest, aby ją wyłączyć i odłączyć wszystko od zasilania. Zapobiegnie to uszkodzeniom systemu, które mogą wystąpić, jeśli przeniesiesz go, gdy jest włączony. </p> <p> Powinieneś całkowicie wyłączyć PS5. Aby to zrobić, naciśnij <strong> Przycisk PS </strong> na kontrolerze, aby wyświetlić szybkie menu u dołu ekranu. Wybierz <strong> Moc </strong> po prawej i wybierz <strong> Wyłącz PS5 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Poczekaj, aż diody konsoli zgasną, a następnie odłącz kabel zasilający, kabel HDMI i wszystkie inne elementy podłączone do systemu. Teraz możesz zmienić orientację swojego PS5. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Usuń śrubę podstawy </h2> <p> Po ustawieniu PS5 w pionie trzeba było wyjąć dołączoną śrubę z przegrody w podstawie i użyć jej do przymocowania podstawy do konsoli, gdy jest ustawiona pionowo. W rezultacie wykręcenie tej śruby jest pierwszym krokiem do zmiany orientacji konsoli. </p> <p> Delikatnie odwróć PS5 na bok, aby uzyskać dostęp do podstawki na dole. Za pomocą płaskiego śrubokręta, monety lub podobnego narzędzia odkręć pojedynczą srebrną śrubę mocującą podstawę do systemu. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Gdy śruba jest poluzowana, podstawa zostanie uwolniona. W podstawie znajduje się mały schowek, w którym można przechowywać śrubę. Zatrzaśnij go tam, a następnie wsuń do małego otworu, aby go zabezpieczyć. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> Również w tej przegrodzie znajdziesz mały czarny korek (o ile założysz go tam podczas początkowej konfiguracji). Usuń ten korek i użyj go do zatkania otworu na spodzie PS5, w którym właśnie wykręciłeś śrubę. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Obróć podstawę </h2> <p> Teraz będziesz chciał obrócić podstawę, aby pasowała do konsoli w orientacji poziomej. To również zamyka małą komorę, w której umieściłeś śrubę, dodatkowo ją zabezpieczając. </p> <p> Powinieneś obrócić podstawę, patrząc na nią od góry (naprzeciwko miejsca, w którym właśnie schowałeś śrubę). Jeśli potraktujesz podniesioną część stojaka jako „północ”, musisz obrócić zewnętrzną część stojaka na „północny zachód”, jak pokazano poniżej. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Jest to właściwa orientacja przy używaniu stojaka w poziomie. Zatrzaśnie się i delikatnie zatrzyma, gdy znajdziesz go we właściwym miejscu. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Zamocuj stojak w pozycji poziomej </h2> <p> Teraz możesz przymocować podstawkę do PS5, gdy jest ona ustawiona poziomo. Upewnij się, że system jest prawidłowo ustawiony ---logo PS powinno być skierowane do góry. </p> <p> Z tyłu systemu, pod i w pobliżu dwóch portów USB, zobaczysz nadrukowane na konsoli symbole kontrolera PlayStation. Wsuń zewnętrzne ramiona podstawy (którą właśnie obróciłeś) na system wokół miejsca, w którym ten wzór kończy się z każdej strony. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Popchnij klipsy, aby je zabezpieczyć, ale pamiętaj, że w tej pozycji stojak nie jest całkowicie zablokowany na swoim miejscu (tak jak w przypadku śruby, gdy jest umieszczony pionowo). Zachowaj ostrożność podczas odkładania systemu i pamiętaj, że podstawka może się ześlizgnąć, jeśli ją pociągniesz. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Teraz możesz już używać PS5 w orientacji poziomej. Podłącz wszystkie kable z powrotem i uruchom go, aby wrócić do gry. Jeśli masz standardową konsolę PS5, włożysz płyty stroną zadrukowaną do góry w tej orientacji. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> Jak zmienić PS5 z powrotem z poziomu na pion? </h2> <p> Chcesz wrócić do orientacji pionowej na PS5, a może początkowo ustawiłeś PS5 w formie poziomej i chcesz teraz przejść w pionie? Tak czy inaczej, łatwo jest przejść przez powyższy proces w odwrotnej kolejności. Upewnij się, że najpierw wyłączasz i odłączasz PS5, jeśli jest aktualnie włączony lub w trybie spoczynku. </p> <p> </p> <p> Aby zmienić orientację na pionową, najpierw podnieś PS5 i delikatnie wyciągnij podstawkę z systemu, aby ją wyjąć. Następnie należy obrócić zewnętrzne ramię podstawy. Patrząc na nią od góry, ramię powinno być „na północ”, w jednej linii z podniesioną częścią. Upewnij się, że czujesz delikatne kliknięcie, aby wiedzieć, że jest we właściwym miejscu. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> Ustaw PS5 tak, aby mieć dostęp do dna, a następnie wyjmij czarny korek z otworu pośrodku — znajduje się mniej więcej pośrodku otworów wentylacyjnych. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Umieść ten czarny korek w małym otworze w komorze na spodzie podstawy. Korek powinien zatrzasnąć się na swoim miejscu. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> Następnie wykręć śrubę z tej samej komory w podstawie. Teraz musisz przymocować stojak we właściwej pozycji. Aby to zrobić, postaw PS5 tak, aby tył konsoli był skierowany do góry, jak pokazano poniżej. </p> <p> Weź podstawkę i umieść ją tak, aby otwór na śrubę pokrywał się z otworem na śrubę, z którego właśnie usunięto korek. Umieść zaciski na ramieniu podstawy z tyłu systemu poniżej złącza zasilania. Stojak powinien być łatwo wyrównany. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Teraz użyj śrubokręta lub podobnego, aby dokręcić śrubę. Gdy skończysz, a podstawka będzie dobrze przymocowana, możesz używać PS5 w pionie. Podłącz wszystkie kable z powrotem, aby zakończyć pracę. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> Czy powinieneś ustawić PS5 w pionie czy w poziomie? </h2> <p> Sony obsługuje używanie PS5 zarówno w pionie, jak iw poziomie, więc nie ma na to dobrego ani złego sposobu, o ile Twój system ma wystarczający przepływ powietrza. Wybór orientacji zależy od Twoich potrzeb. </p> <p> </p> <p> Jeśli masz dużo miejsca i nie przeszkadza ci, że PS5 zajmuje dużo miejsca w poziomie, poziomy wygląd jest elegancki. Dla osób ze standardowym modelem PS5 ułatwia to również proces wkładania płyt, ponieważ etykieta powinna być zawsze skierowana do góry. Jest to nieco trudniejsze do zapamiętania przy orientacji pionowej, gdzie etykieta płyty powinna być skierowana w lewo. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> Jednak wewnątrz systemu rozrywki może nie być miejsca, aby pomieścić konfigurację poziomą. W takich przypadkach najlepszym rozwiązaniem jest ustawienie pionowe. PS5 jest ogromną konsolą tak czy inaczej, ale po ustawieniu pionowo ładnie leży obok stojaka telewizyjnego lub podobnego. To jest konfiguracja, której używam, jak pokazano na poniższym obrazku. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> Niezależnie od orientacji, którą wybierzesz dla swojego PS5, upewnij się, że używasz podstawki. Utrzymuje system nad ziemią, co poprawia przepływ powietrza. Podstawka zabezpiecza również PS5, co utrudnia przewrócenie i potencjalne uszkodzenie. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> Skonfiguruj PS5 i zacznij grać </h2> <p> Teraz wiesz, jak zmienić PS5 z pionowego na poziomy iz powrotem w ciągu zaledwie kilku minut. Po skonfigurowaniu systemu uruchom go i ciesz się najlepszymi tytułami na PS5. </p> <p> Nie zapominaj, że prawie cała biblioteka PS4 działa również na PS5, dając ci dużo więcej radości. </p> <p> <small> Źródło: Alex Van Aken/ <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}