{"title":"Jak zrobić zrzut ekranu na tablecie Surface Pro","content":"<p> Robienie zrzutów ekranu to prosta, ale niezbędna umiejętność na każdym urządzeniu. Na tablecie Surface Pro możesz robić zrzuty ekranu za pomocą skrótów klawiaturowych, narzędzia do wycinania, a nawet paska gier Xbox. Pokażemy Ci, jak wykorzystać wszystkie te metody, aby zrobić zrzut ekranu, a nawet nagranie ekranu na urządzeniu Surface. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Wykonywanie zrzutu ekranu za pomocą kombinacji przycisków </h2> <p> W linii urządzeń Surface Pro robienie zrzutu ekranu za pomocą kombinacji przycisków jest szybkie i łatwe. Aby zrobić zrzut ekranu, przytrzymaj <strong> Moc </strong> i <strong> Zwiększanie głośności </strong> klucz w tym samym czasie. Ekran powinien migać, a zrzut ekranu powinien zostać zapisany w folderze zrzutów ekranu w sekcji Zdjęcia na urządzeniu. </p> <p> Ta metoda działa w przypadku najnowszej linii urządzeń Surface Pro (tj. Surface Pro 7+, Pro X), Surface Go, Surface Go 2 i linii urządzeń Surface Book. </p> <p> Jeśli Twój Surface to starszy model (Surface 3 lub starszy), kombinacja przycisków jest nieco inna. Musisz nacisnąć <strong> Przycisk Windows </strong> (nie klawisz Windows na klawiaturze) i <strong> Ściszanie </strong> przycisk w tym samym czasie. Urządzenie zapisze zrzut ekranu w folderze Zrzuty ekranu w sekcji Zdjęcia. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> Podobnie, aby zrobić zrzut ekranu na urządzeniu Surface Duo, przytrzymaj przycisk <strong> Moc </strong> przycisk i <strong> Ściszanie </strong> klucz. Zrzut ekranu należy zapisać w galerii urządzenia w sekcji Zrzuty ekranu. Możesz też po prostu przytrzymać <strong> Moc </strong> i kliknij <strong> Zrzut ekranu </strong> na ekranie. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> Jak zrobić zrzut ekranu Surface Pro za pomocą skrótów klawiaturowych </h2> <p> Skróty klawiaturowe to kolejny sposób na przechwytywanie zawartości ekranu. </p> <p> Te skróty klawiaturowe działają na wszystkich urządzeniach z systemem Windows, więc sprawdź <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> inne metody wykonywania zrzutów ekranu w systemie Windows 10 </a> . Skróty klawiaturowe działają najlepiej na urządzeniach Surface Laptop i Surface Book, ale oczywiście, jeśli masz przystawkę do klawiatury do urządzenia Surface Pro lub Go, te skróty również działają. </p> <h3 id=\"print-screen-methods\"> Metody drukowania ekranu </h3> <p> Aby zrobić zrzut ekranu metodą Print Screen, wystarczy nacisnąć just <strong> PrtScn </strong> przycisk na klawiaturze. Spowoduje to wykonanie zrzutu ekranu całego pulpitu. Pamiętaj, że nie spowoduje to zapisania zrzutu ekranu na urządzeniu Surface, ale doda go do schowka. Aby wkleić zrzut ekranu, musisz użyć programu, takiego jak Microsoft Paint. </p> <p> Pilny <strong> Alt + PrtScn </strong> wykona zrzut ekranu tylko z bieżącego okna i podobnie doda zrzut ekranu do schowka. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Wycinek i szkic </h3> <p> Jest to zdecydowanie najłatwiejsza metoda robienia zrzutów ekranu na urządzeniu Surface. </p> <p> Aby otworzyć Snip and Sketch, naciśnij <strong> Klawisz Windows + Shift + S, </strong> a na ekranie powinna pojawić się nakładka. Aby zrobić pełny zrzut ekranu, naciśnij przycisk Pełny ekran u góry nakładki. Aby zrobić zrzut ekranu tylko bieżącego okna, naciśnij przycisk Wycinanie okna obok przycisku Pełny ekran. </p> <p> Możesz także zrobić zrzut ekranu z określonego obszaru ekranu. Domyślnie Wycinek i Szkic mają Wycinek prostokątny. Po prostu przeciągnij na część, którą chcesz zrobić zrzut ekranu, używając ekranu dotykowego lub gładzika. </p> <p> Snip i Sketch wyślą powiadomienie w panelu powiadomień, aby powiedzieć, że zrzut ekranu został skopiowany do schowka. Jeśli go klikniesz, możesz w razie potrzeby narysować i naszkicować zrzut ekranu. </p> <p> Aby zapisać go w swoich plikach, użyj <strong> Ctrl + S </strong> lub przycisk Zapisz w prawym górnym rogu, aby zapisać zrzut ekranu w określonym folderze. </p> <h3 id=\"xbox-game-bar\"> Pasek gier Xbox </h3> <p> Aby zrobić zrzut ekranu przy użyciu aplikacji Xbox Game Bar, naciśnij przycisk <strong> Klawisz Windows + G </strong> by go otworzyć. </p> <p> Stamtąd możesz kliknąć kartę Przechwytywanie i kliknąć przycisk aparatu. Ta metoda pozwoli również na zrobienie przechwytywania wideo ekranu z dźwiękiem. Zapisane ujęcia pojawią się w folderze Wideo i podfolderze Ujęcia. Na Xboksie możesz podobnie <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> przechwytywanie zrzutów ekranu i nagrań </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Wykonywanie zrzutu ekranu Surface Pro za pomocą pióra Surface </h2> <p> Aby zrobić zrzut ekranu za pomocą pióra Surface, po prostu kliknij dwukrotnie gumkę, a urządzenie powinno wyświetlić wycinek i szkic całego okna. Stąd możesz naszkicować i wyeksportować zrzut ekranu. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> Możesz również uzyskać do niego dostęp, wyszukując obszar roboczy Windows Ink w stacji dokującej. Stąd wybierz opcję Wycinek pełnoekranowy. Możesz zmienić działanie skrótów przycisków pióra Surface, wyszukując Ustawienia obszaru roboczego Windows Ink i przewijając w dół do obszaru roboczego Windows Ink. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Proste wykonywanie zrzutów ekranu na powierzchni, </h2> <p> Teraz znasz wszystkie różne metody robienia zrzutów ekranu lub nagrywania ekranu na urządzeniu Surface. Kombinacje przycisków to najlepszy dotykowy sposób robienia zrzutów ekranu, jeśli używasz Surface Pro lub Surface Go, ale skróty klawiaturowe są również łatwe. </p>"}