{"title":"Jak dostosować monit zsh w terminalu macOS?","content":"<p> Od czasu aktualizacji do wersji 10.15 Catalina system macOS domyślnie zawiera powłokę Z (zsh) zamiast Bash w aplikacji Terminal. To powiedziawszy, nadal masz to samo czarne okno z białym tekstem w terminalu. Rzeczy nie muszą tak pozostać. </p> <p> Możesz ulepszyć monit zsh, aby był minimalny i jak najlepiej wykorzystać przestrzeń. Pokażemy Ci, jak dostosować monit zsh w aplikacji Terminal, aby wyróżniał się na dowolnym tle. </p> <h2 id=\"basics-of-the-zsh-prompt\"> Podstawy monitu zsh </h2> <p> Po uruchomieniu aplikacji Terminal wyświetla kilka przydatnych informacji, takich jak ostatnie logowanie i wiersz polecenia. Tak zazwyczaj domyślnie wygląda monit. </p> <pre><code class=\"hljs ruby\">Last login: Wed Feb 3 22:00:40 on console<br>samir@MacBook-Air ~ %</code></pre> <p> Monit zsh pokazuje ciąg tekstowy składający się z nazwy użytkownika i modelu komputera, takiego jak MacBook Air, MacBook Pro, Mac Mini i tak dalej. Tylda (~) wskazuje lokalizację monitu w katalogu domowym. </p> <p> <img alt=\"Default View of zsh prompt\" src=\"images/default-view-of-zsh-prompt-685.jpg\" loading=\"lazy\"> </p> <p> </p> <p> </p> <h2 id=\"create-a-z-shell-profile-to-store-all-settings\"> Utwórz profil powłoki Z, aby przechowywać wszystkie ustawienia </h2> <p> Zazwyczaj musisz majstrować przy plikach systemowych, aby zmienić domyślny wygląd. Dzieje się tak, ponieważ aktualizacje systemu macOS resetują wszystkie pliki systemowe do wartości domyślnych i utracisz wszystkie wprowadzone zmiany. </p> <p> Możesz więc utworzyć określony plik ustawień, znany jako plik dot, dla swojego profilu zsh, aby przechowywać wszystkie zmiany i ustawienia, które chcesz w monicie zsh. </p> <p> Cóż, nie znajdziesz tego pliku dotfile domyślnie w systemie MacOS, więc będziesz musiał go utworzyć. Zaleca się utworzenie nowego profilu .zshrc, aby przechowywać wszystkie ustawienia, takie jak wygląd i zachowanie monitu zsh. </p> <p> Oto jak stworzyć profil zsh (dotfile): </p> <p> 1. Otwórz <strong> Terminal </strong> aplikacja. </p> <p> 2. Wpisz następujące polecenie i naciśnij klawisz Return. </p> <pre><code class=\"hljs\">touch ~/.zshrc</code></pre> <p> Spowoduje to utworzenie profilu .zshrc w katalogu domowym Twojego konta użytkownika. Możesz go zobaczyć w ścieżce /User// w Finderze, jeśli włączyłeś wyświetlanie ukrytych plików systemowych. </p> <p> Następnie profil zsh będzie dostępny do logowania i interaktywnych powłok za każdym razem, gdy uruchomisz Terminal. Jednak nie będzie aktywny w sesjach SSH. </p> <p> Wszystkie zmiany, które chcesz wprowadzić do monitu zsh, można uwzględnić w tym profilu. </p> <p> </p> <h2 id=\"customize-the-zsh-prompt-in-terminal\"> Dostosuj monit zsh w terminalu </h2> <p> Zazwyczaj domyślny monit zsh zawiera informacje, takie jak nazwa użytkownika, nazwa komputera i lokalizacja, zaczynając od katalogu domowego użytkownika. Te szczegóły są przechowywane w pliku systemowym powłoki zsh w lokalizacji /etc/zshrc. </p> <pre><code class=\"hljs perl\">PS1=\"%n@%m %1~ %#\"</code></pre> <p> W tym ciągu zmiennych: </p> <ul> <li> %n to nazwa użytkownika Twojego konta. </li> <li> %m to nazwa modelu MacBooka. </li> <li> Symbol %1~ oznacza bieżącą ścieżkę katalogu roboczego, w której ~ usuwa lokalizację katalogu $HOME. </li> <li> %# oznacza, że ​​znak zachęty pokaże #, jeśli powłoka działa z uprawnieniami roota (administratora), lub zaoferuje %, jeśli tak nie jest. </li> </ul> <p> Aby wprowadzić jakąkolwiek zmianę w domyślnym znaku zachęty zsh, musisz dodać odpowiednie wartości, aby monit był wyświetlany inaczej niż domyślny. </p> <p> Oto jak się do tego zabrać. otwarty <strong> Terminal </strong> , wpisz następujące polecenie i naciśnij Enter. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Będzie puste, jeśli uzyskujesz do niego dostęp po raz pierwszy. Możesz dodać nowy wiersz z tekstem PROMPT=&#39;...&#39; i umieścić odpowiednie wartości w wielokropkach. </p> <p> Aby dokonać prostej modyfikacji monitu zsh, możesz wpisać te wartości w profilu .zshrc. </p> <pre><code class=\"hljs ruby\">PROMPT='%n~$'</code></pre> <p> Trafienie <strong> Ctrl + O </strong> aby potwierdzić dokonanie tych zmian w pliku, a następnie naciśnij <strong> Ctrl + X </strong> aby wyjść z edytora nano. </p> <p> <img alt=\"Use only the username in the zsh prompt\" src=\"images/use-only-the-username-in-the-zsh-prompt-531.jpg\" loading=\"lazy\"> </p> <p> Otwórz nowy <strong> Terminal </strong> okno, aby potwierdzić i wyświetlić wprowadzone zmiany. Twój nowy monit zsh pokaże nazwę użytkownika komputera Mac, katalog domowy i symbol $ na końcu. </p> <p> </p> <h2 id=\"add-date-and-time-in-the-zsh-prompt\"> Dodaj datę i godzinę w wierszu zsh </h2> <p> Oprócz nazwy użytkownika możesz dołączyć aktualną datę lub godzinę, dzięki czemu nie musisz odwracać wzroku od aktywnego okna terminala, aby sprawdzić te informacje. </p> <p> Uruchom Terminal i otwórz profil .zshrc. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Aby dołączyć datę do monitu, możesz użyć %D, aby data była wyświetlana w formacie rr-mm-dd lub %W, aby była wyświetlana w formacie mm/dd/rr. Wtedy pojawi się nowy monit: </p> <pre><code class=\"hljs ruby\">PROMPT='%n:%W:~$'</code></pre> <p> <img alt=\"How to add date to the zsh prompt\" src=\"images/how-to-add-date-to-the-zsh-prompt-245.jpg\" loading=\"lazy\"> </p> <p> Jeśli chcesz dołączyć czas systemowy do monitu zsh, dodaj %T dla bieżącego czasu w formacie 24-godzinnym, %t dla czasu wyświetlanego w formacie am/pm lub 12-godzinnym lub użyj %*, aby wyświetlić czas w formacie 24-godzinnym wraz z sekundami. </p> <pre><code class=\"hljs ruby\">PROMPT='%n:%T:~$'</code></pre> <p> <img alt=\"How to show Time on the zsh prompt\" src=\"images/how-to-show-time-on-the-zsh-prompt-258.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-color-to-text-in-the-zsh-prompt\"> Dodaj kolor do tekstu w zsh Prompt </h2> <p> Czy jesteś znudzony białym tekstem monitu zsh? Oprócz <a href=\"https://www.makeuseof.com/tag/customize-mac-terminal/\" target=\"_blank\" rel=\"nofollow noopener\"> modyfikowanie aplikacji Terminal </a> z kolorami możesz dodać trochę koloru do tekstu, aby uzyskać przyjemną wizualną przerwę. </p> <p> Uruchomić <strong> Terminal </strong> i otwórz profil .zshrc. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Zsh obsługuje kolory i odcienie szarości tekstu monitu, tak aby uzupełniał tło. Możesz wybrać kolor pierwszego planu (tekstu) między czarnym, białym, żółtym, zielonym, czerwonym, niebieskim, cyjan i magenta. </p> <p> Oto jak z nich korzystać. </p> <pre><code class=\"hljs ruby\">PROMPT='%F{cyan}%n%f:~$'</code></pre> <p> <img alt=\"How to add color the zsh prompt\" src=\"images/how-to-add-color-the-zsh-prompt-993.jpg\" loading=\"lazy\"> </p> <p> Jeśli chcesz wybrać określony odcień, możesz wybrać od 0 do 256 8-bitowych kolorów obsługiwanych przez Terminal. Oto jak używać wartości liczbowych kolorów. </p> <pre><code class=\"hljs ruby\">PROMPT='%F{51}%n%f:~$'</code></pre> <p> Musisz umieścić domyślne zmienne koloru pierwszego planu %F i %f pomiędzy odpowiednim tekstem, który chcesz pokolorować. </p> <p> </p> <h2 id=\"adding-visual-effects-in-the-zsh-prompt\"> Dodawanie efektów wizualnych w wierszu zsh </h2> <p> Jeśli kolorowanie tekstu monitu nie wystarczy, możesz podświetlić monit zsh, aby wyróżniał się na ścianie tekstu i można go łatwo zauważyć. Na początek możesz pogrubić monit zsh. </p> <pre><code class=\"hljs ruby\">PROMPT='%B%F{51}%n%f%b:~$'</code></pre> <p> Dodanie %B na początku i umieszczenie %b na końcu między odpowiednim tekstem spowoduje, że będzie on pogrubiony. </p> <p> <img alt=\"How to bold text in the zsh prompt text\" src=\"images/how-to-bold-the-zsh-prompt-text-261.jpg\" loading=\"lazy\"> </p> <p> Podobnie możesz umieścić %S na początku i %s na końcu, aby wyróżnić tekst. Podświetlenie będzie miało ten sam kolor, który wybrałeś między zmiennymi %S i %s. </p> <pre><code class=\"hljs ruby\">PROMPT='%S%F{51}%n%f%s:~$'</code></pre> <p> <img alt=\"How to Highlight the zsh prompt\" src=\"images/how-to-highlight-the-zsh-prompt-422.jpg\" loading=\"lazy\"> </p> <p> Możesz także podkreślić tekst monitu zsh. Aby dodać podkreślenie do monitu, możesz dołączyć zmienną %U na początku i %u na końcu odpowiedniego tekstu. </p> <pre><code class=\"hljs ruby\">PROMPT='%U%F{51}%n%f%u:~$'</code></pre> <p> <img alt=\"How to Underline the zsh prompt\" src=\"images/how-to-underline-the-zsh-prompt-962.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-last-login-details-from-the-zsh-prompt\"> Usuń ostatnie dane logowania z monitu zsh </h2> <p> Ukrywanie lub wyłączanie górnej linii ujawniającej ostatni czas logowania w aplikacji Terminal może sprawić, że monit zsh będzie wyglądał czystszy. Możesz użyć następującego polecenia, aby ukryć te informacje. </p> <pre><code class=\"hljs\">touch ~/.hushlogin</code></pre> <p> Następnym razem, gdy otworzysz Terminal, nie zobaczysz niczego powyżej monitu zsh. </p> <p> </p> <h2 id=\"spice-up-the-zsh-prompt-in-terminal\"> Urozmaicić monit zsh w terminalu </h2> <p> Nawet jeśli od czasu do czasu używasz aplikacji Terminal w systemie MacOS, możesz dostosować sposób wyświetlania monitu zsh. Możesz pogrubić, podkreślić, skrócić, a nawet uwzględnić w nim datę i godzinę. </p> <p> Teraz, gdy zacząłeś dostosowywać monit zsh, poeksperymentuj trochę i dostosuj go. </p>"}