{"title":"Jak wykonać czysty rozruch w systemie Windows 10","content":"<p> Prawdopodobnie masz wiele aplikacji innych firm zainstalowanych na komputerze z systemem Windows. Nie martw się, większość ludzi to robi. </p> <p> Od wykonywania podstawowych zadań, takich jak przeglądanie stron internetowych, po wydawanie złożonych linii kodu, ludzie wolą używać alternatywnych aplikacji od tych wbudowanych w system Windows. Chociaż te aplikacje ułatwiają nam życie, czasami zakłócają funkcje systemu. Mogą to być drobne wpadki, błędy krytyczne i BSOD. </p> <p> Tutaj pojawia się czysty rozruch. </p> <h2 id=\"what-is-a-windows-clean-boot-anyway\"> Co to jest czysty rozruch systemu Windows? </h2> <p> Czysty rozruch systemu Windows 10 umożliwia użytkownikom wykluczenie aplikacji innych firm jako przyczyny błędu. Odbywa się to po prostu przez uruchomienie urządzenia z wyłączonymi wszystkimi aplikacjami innych firm. I chociaż nazwa brzmi, jakby była wbudowaną funkcją systemu Windows, tak nie jest. Musisz ręcznie wyczyścić rozruch komputera. </p> <p> Korzyści płynące z czystego rozruchu nie ograniczają się tylko do diagnozowania błędów. Wiadomo, że pomaga, gdy <a href=\"https://www.makeuseof.com/tag/fix-windows-update-error-0x80070057/\" target=\"_blank\" rel=\"nofollow noopener\"> Aktualizacje systemu Windows nie instalują się poprawnie </a> . Jest to również szczególnie przydatne, gdy system operacyjny działa wolno i chcesz sprawdzić, co może być przyczyną problemu. </p> <p> </p> <p> </p> <h2 id=\"how-to-clean-boot-and-fix-errors\"> Jak wyczyścić rozruch i naprawić błędy? </h2> <p> Czyste uruchamianie jest stosunkowo prostym procesem, gdy użytkownicy wypróbowali go kilka razy. </p> <p> Przed wyświetleniem kroków użytkownicy powinni wiedzieć, że niektóre czynności wymagają uprawnień administratora. Twój komputer może również nie działać w sposób, do którego przywykłeś, ale nie ma potrzeby się pocić. Dzieje się tak, ponieważ czasami użytkownicy nie są nawet świadomi, że niektóre drobne zadania są wykonywane przez oprogramowanie innych firm. </p> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-128.png\" loading=\"lazy\"> </p> <p> Oto kroki, jak wyczyścić rozruch systemu Windows 10: </p> <ol> <li> W pasku wyszukiwania menu Start wpisz <strong> sysconfig </strong> i kliknij <strong> Konfiguracja systemu </strong> . </li> <li> w <strong> Konfiguracja systemu </strong> okno, przejdź do <strong> Usługi </strong> patka. </li> <li> Sprawdź <strong> Ukryj wszystkie usługi Microsoft </strong> pudełko. </li> <li> Sprawdź wszystkie usługi na liście i kliknij <strong> Wyłącz wszystkie </strong> znajduje się w prawym dolnym rogu, a następnie zapisz i wyjdź. </li> <li> Teraz otwórz <strong> Menadżer zadań </strong> . Możesz to zrobić, klikając prawym przyciskiem myszy pasek zadań i wybierając <strong> Menadżer zadań </strong> lub używając <strong> Ctrl + Alt + Usuń </strong> . </li> <li> w <strong> Menadżer zadań </strong> przejdź do okna to <strong> Uruchomienie </strong> patka. </li> <li> Wybierz wszystkie usługi jeden po drugim i kliknij <strong> Wyłączyć </strong> . </li> <li> Wyjście <strong> Menadżer zadań </strong> i <strong> Uruchom ponownie </strong> Twój komputer. </li> </ol> <p> <img alt=\"Startup tab in the task manager\" src=\"images/startup-tab-task-manager-383.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"fixing-errors-with-clean-boot\"> Naprawianie błędów za pomocą czystego rozruchu </h2> <p> Po wykonaniu powyższych kroków, Twój <a href=\"https://www.makeuseof.com/tag/clean-computer-original-state-reinstalling-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Komputer uruchomi się w stanie czystym. </a> Pierwszą rzeczą, którą użytkownicy powinni zrobić, to poczekać i sprawdzić, czy ten sam błąd pojawia się ponownie. Czasami źródłem błędu mogą być pliki systemowe Windows, w którym to przypadku błąd się pojawi, ale może to potrwać dłużej niż podczas normalnego rozruchu. </p> <p> Jeśli błąd się nie pojawia, czas zawęzić listę podejrzanych. Jest to dość żmudne zadanie, ale niestety również najlepszy sposób, aby się do tego zabrać. Aby zawęzić listę, wykonaj następujące czynności: </p> <ol> <li> W stanie czystego rozruchu otwórz <strong> Konfiguracja systemu </strong> . </li> <li> Pod <strong> Usługi </strong> wybierz górną połowę listy i kliknij <strong> Włączyć </strong> . Upewnij się, że <strong> Ukryj wszystkie usługi Microsoft </strong> pole jest zaznaczone. </li> <li> Teraz otwarte <strong> Menadżer zadań </strong> i idź do <strong> Uruchomienie </strong> patka. </li> <li> Podobnie włącz górną połowę usług i uruchom ponownie komputer. </li> </ol> <p> Po ponownym uruchomieniu, jeśli błąd się nie pojawi, możesz wykluczyć wybrane oprogramowanie i usługi z listy winowajców. Będziesz musiał powtarzać te kroki, aż znajdziesz odpowiedzialny program lub usługę i odinstalujesz go. </p> <p> </p> <h2 id=\"clean-boot-windows-10-to-isolate-errors\"> Czysty rozruch systemu Windows 10 w celu wyizolowania błędów </h2> <p> Teraz czas na standardowe ponowne uruchomienie systemu Windows 10. Po prostu otwórz <strong> Konfiguracja systemu </strong> i <strong> Menadżer zadań </strong> i włącz wszystkie usługi i programy. Zaleca się, aby użytkownicy przeprowadzili czysty rozruch przed skorzystaniem z bardziej zaawansowanych poprawek, gdy system Windows ulegnie awarii lub wyświetli BSOD. </p>"}