{"title":"Jak naprawić kod zatrzymania BSOD „SYSTEM THREAD EXCEPTION NOT HANDLED” w systemie Windows 10","content":"<p> „NIEOBSŁUGIWANY WYJĄTEK WĄTKU SYSTEMU” jest częstym błędem systemu Windows 10, który występuje głównie z powodu przestarzałego lub niezgodnego sterownika. </p> <p> To, co utrudnia naprawę niż inne BSOD, polega na tym, że wiele sterowników może powodować problem, a czasami komputer może nie wykryć ich wszystkich. Dlatego pierwszym krokiem, jaki użytkownicy powinni podjąć podczas rozwiązywania tego błędu, jest znalezienie dokładnego sterownika, który powoduje problem. </p> <p> Oto, jak naprawić wyjątek wątku systemowego, który nie jest obsługiwany w systemie Windows 10. </p> <h2 id=\"boot-into-safe-mode\"> 1. Uruchom w trybie awaryjnym </h2> <p> Pierwszym krokiem, jaki użytkownicy powinni wykonać przed próbą rozwiązania tego problemu, jest uruchomienie komputera w trybie awaryjnym. W zależności od Twoich preferencji i tego, czy możesz uruchomić komputer na ekranie logowania, możesz to zrobić na kilka sposobów: </p> <h3 id=\"boot-into-safe-mode-via-settings\"> Uruchom w trybie awaryjnym za pomocą ustawień </h3> <ol> <li> Kliknij na <strong> Początek </strong> przycisk, a następnie wybierz <strong> Ustawienia </strong> . </li> <li> Nawigować do <strong> Aktualizacja i bezpieczeństwo </strong> następnie kliknij <strong> Poprawa </strong> . </li> <li> Pod <strong> Zaawansowane uruchomienie, </strong> Kliknij <strong> Zrestartuj teraz. </strong> </li> <li> Po ponownym uruchomieniu komputera <strong> Wybierz opcję </strong> powinien pojawić się ekran. </li> <li> Stąd przejdź do <strong> Rozwiązywanie problemów &gt; Opcje zaawansowane &gt; Ustawienia uruchamiania </strong> . Następnie kliknij <strong> Uruchom ponownie </strong> </li> <li> Po ponownym uruchomieniu komputera naciśnij <strong> F5 </strong> uruchomić komputer w <strong> Tryb bezpieczny w sieci </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> Z ekranu logowania </h3> <ol> <li> Po prostu przytrzymaj <strong> Zmiana </strong> i wybierz <strong> Moc </strong> przycisk, a następnie <strong> Uruchom ponownie </strong> . </li> <li> Wykonaj kroki 4, 5 i 6 z powyższej sekcji. </li> </ol> <h3 id=\"from-a-blank-screen\"> Z pustego ekranu </h3> <ol> <li> Jeśli nie możesz przejść do ekranu logowania, wykonaj następujące czynności. </li> <li> Przytrzymaj przycisk zasilania na urządzeniu przez 10 sekund, aby je wyłączyć. </li> <li> Naciśnij ponownie przycisk zasilania, aby go uruchomić. </li> <li> Zaraz po uruchomieniu komputera, tj. Pojawieniu się logo producenta, ponownie naciśnij przycisk zasilania przez 10 sekund. </li> <li> Naciśnij przycisk zasilania, aby uruchomić urządzenie. </li> <li> Jeśli zrobisz to poprawnie, komputer uruchomi się w <strong> Środowisko odzyskiwania systemu Windows </strong> . </li> <li> Wykonaj kroki 4, 5 i 6 z pierwszej sekcji. </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. Ustalenie, który kierowca jest odpowiedzialny </h2> <p> Ponieważ błąd jest najprawdopodobniej spowodowany przez nieprawidłowo działający sterownik, możesz użyć dziennika systemu Windows, aby dowiedzieć się, który z nich. </p> <p> Aby to zrobić, wykonaj następujące kroki: </p> <ol> <li> naciśnij <strong> Klawisz Windows + R </strong> i w <strong> Biegać </strong> okno dialogowe, wpisz <strong> eventvwr. </strong> </li> <li> Przejdź do <strong> Dzienniki Windows Windows </strong> menu i rozwiń je, a następnie wybierz <strong> System. </strong> </li> <li> Poszukaj dziennika o nazwie <strong> system_thread_exception_not_handled </strong> i kliknij go, aby dowiedzieć się, który sterownik powoduje problem. </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> Zwykle powiązany sterownik będzie sterownikiem ekranu lub sterownikiem sieciowym, ponieważ są one znane z powodowania tego BSOD. Jeśli powiązany plik jest <strong> nvlddmkm.sys </strong> , możesz rzucić okiem na <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> kilka prostych sposobów, aby to naprawić. </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. Przywróć lub zaktualizuj sterowniki </h2> <p> W zależności od tego, który sterownik jest odpowiedzialny za nieobsługiwany błąd wątku systemowego, może być konieczne zaktualizowanie lub ponowne zainstalowanie powiązanych sterowników. </p> <p> Jeśli sterownik nie był aktualizowany przez długi czas, aktualizacja sterownika najprawdopodobniej rozwiąże problem. Jeśli sterownik został niedawno zaktualizowany, najlepszym rozwiązaniem może być wycofanie sterownika lub ponowne zainstalowanie aktualizacji. </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> Jak zaktualizować sterowniki w systemie Windows 10 </h3> <ol> <li> naciśnij <strong> Klawisz Windows + R </strong> i wpisz <strong> devmgmt.msc </strong> otworzyć <strong> Menadżer urządzeń </strong> . </li> <li> Przejdź do powiązanego urządzenia i rozwiń menu. Na przykład, jeśli błąd był spowodowany przez sterownik ekranu, musisz rozwinąć <strong> Karty graficzne </strong> opcja. </li> <li> Kliknij prawym przyciskiem myszy sterownik i kliknij <strong> Uaktualnij sterownik </strong> . </li> <li> W otwartym oknie dialogowym kliknij click <strong> Wyszukaj automatycznie zaktualizowane oprogramowanie sterownika </strong> . </li> <li> System Windows automatycznie wyszuka w Internecie najnowsze sterowniki i zainstaluje je. </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> Jak przywrócić sterowniki w systemie Windows 10 </h3> <ol> <li> otwarty <strong> Menadżer urządzeń </strong> i przejdź do odpowiedniego kierowcy. </li> <li> Rozwiń menu i kliknij prawym przyciskiem myszy sterownik. </li> <li> Kliknij <strong> Nieruchomości </strong> . </li> <li> Pod <strong> Kierowca </strong> zakładka, kliknij <strong> Wycofaj kierowcę </strong> . </li> <li> System Windows automatycznie przywróci ostatnią dostępną wersję sterownika. </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. Zmień nazwę wadliwego pliku </h2> <p> Po pobraniu nazwy pliku skojarzonej z nieobsługiwanym błędem wątku systemowego użytkownicy powinni zmienić nazwę pliku. Spowoduje to, że system Windows utworzy nową kopię i ponownie ją zainstaluje. Pliki sterowników znajdują się w <strong> C:\\ Windows\\ System32\\ sterowniki </strong> </p> <p> Wykonaj następujące kroki, aby zmienić nazwę pliku: </p> <ol> <li> otwarty <strong> Przeglądarka plików </strong> i idź do <strong> C:\\Windows\\System32\\sterowniki </strong> </li> <li> Poszukaj sterownika, którego dotyczy problem </li> <li> Kliknij i naciśnij <strong> F2. </strong> </li> <li> Zamień rozszerzenie nazwy pliku na <strong> .stary </strong> . </li> <li> Naciśnij Enter i uruchom ponownie komputer. </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. Użyj SFC i DISM do naprawy plików systemowych </h2> <p> SFC i DISM to dwa potężne narzędzia dostępne dla każdego użytkownika Windows. W połączeniu mogą znaleźć i naprawić prawie wszystkie błędy związane z systemem. Są również dość proste do wykonania. </p> <p> </p> <p> Pamiętaj, aby utworzyć punkt przywracania systemu, ponieważ te polecenia zmieniają pliki systemowe. </p> <h3 id=\"how-to-use-dism\"> Jak korzystać z DISM </h3> <ol> <li> Biegać <strong> Wiersz polecenia </strong> jako Administrator </li> <li> W konsoli wpisz <strong> DISM / Online / Cleanup-Image / ScanHealth </strong> i naciśnij Enter. </li> <li> Poczekaj, aż system Windows zakończy skanowanie. Następnie wpisz <strong> DISM /Online /Cleanup-image /RestoreHealth </strong> </li> <li> System Windows naprawi wszystkie problemy wykryte podczas skanowania. </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> Jak korzystać z SFC </h3> <ol> <li> W pasku wyszukiwania menu Start wpisz, <strong> cmd </strong> następnie kliknij prawym przyciskiem myszy <strong> Wiersz polecenia </strong> i uruchom go jako administrator. </li> <li> W konsoli wpisz <strong> sfc /skanuj </strong> </li> <li> Zachowaj cierpliwość, ponieważ skanowanie i zastępowanie uszkodzonych plików systemowych przez system Windows zajmie trochę czasu. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. Użyj funkcji przywracania systemu, aby przywrócić komputer </h2> <p> Jeśli problem nadal pozostaje nierozwiązany, będziesz musiał użyć Przywracania systemu w ostateczności. Przywracanie systemu to funkcja, która przywraca system Windows do wcześniejszego stanu. Te punkty przywracania są tworzone okresowo i podczas instalowania nowego oprogramowania. Alternatywnie możesz ustawić <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows do codziennego tworzenia punktu przywracania </a> </p> <h3 id=\"how-to-use-system-restore\"> Jak korzystać z przywracania systemu </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> W pasku wyszukiwania menu Start wpisz, <strong> Panel sterowania </strong> i kliknij otwórz. </li> <li> W pasku wyszukiwania Panelu sterowania wpisz <strong> Poprawa </strong> i otwórz go z wyników. </li> <li> Kliknij <strong> Otwórz przywracanie systemu </strong> . </li> <li> Kliknij <strong> Kolejny </strong> i wybierz z listy punkt przywracania. </li> <li> Kliknij <strong> Koniec. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> Obsługiwane wyjątki </h2> <p> Wymienione powyżej wskazówki zapewniają łatwą naprawę uciążliwości, jaką powodują BSOD, takie jak system_thread_exception_not_handled. Najlepsze jest to, że większość wskazówek można również wykorzystać do zdiagnozowania wielu innych typowych błędów niebieskiego ekranu śmierci (BSOD) w systemie Windows. </p>"}