{"title":"Jak wykorzystać czas na spacer z Apple Fitness+","content":"<p> Apple Fitness+ oferuje szeroką gamę różnych treningów wideo, które wykorzystują moc zegarka Apple Watch, aby zapewnić świetny sposób na dopasowanie. Ale funkcja Czas na spacer jest nieco inna. </p> <p> Zamiast stać przed ekranem, ta funkcja zachęca do spacerów i słuchania historii podczas oglądania znaczących zdjęć wpływowych i wyjątkowych gwiazd. Poniżej przedstawimy więcej informacji na temat tej funkcji i tego, czego potrzebujesz, aby rozpocząć. </p> <h2 id=\"what-is-time-to-walk\"> Jaki jest czas na spacer? </h2> <p> <img alt=\"Draymond Green Time to walk\" src=\"images/draymond-green-time-to-walk-1-269.jpg\" loading=\"lazy\"> </p> <p> Pomyśl o Time to Walk jako o wyjątkowym, podobnym do podcastu doświadczeniu z celebrytami i innymi wpływowymi nazwiskami. Niektóre z odcinków to legenda muzyki country Dolly Parton, gwiazda NBA Draymond Green, muzyk Sean Mendes i zdobywca nagrody Emmy Uzo Aduba. </p> <p> W odcinkach trwających od 25 do 40 minut gość opowie o swoich osobistych, kształtujących życie momentach. Na ekranie zegarka Apple Watch możesz także zobaczyć zdjęcia, które pomogą opowiedzieć historię. Na końcu opowieści usłyszysz listę odtwarzania zawierającą znaczące utwory wybrane przez gościa. </p> <p> </p> <p> </p> <h2 id=\"getting-started-with-time-to-walk\"> Pierwsze kroki z czasem na spacer </h2> <p> Aby uzyskać dostęp do Time to Walk, musisz mieć subskrypcję Apple Fitness+. Potrzebujesz także zegarka Apple Watch Series 3 lub nowszego oraz słuchawek Bluetooth, takich jak AirPods firmy Apple. </p> <p> Wspaniałą wiadomością jest to, że nie musisz nic robić, aby pobrać odcinek Czas na spacer. Dopóki zegarek Apple Watch ładuje się i jest połączony z Wi-Fi, pięć najnowszych odcinków zostanie automatycznie pobranych na zegarek. </p> <p> Pamiętaj, że ilość wolnego miejsca na zegarku może mieć wpływ na liczbę dostępnych odcinków. Po wysłuchaniu odcinka zegarek automatycznie go usuwa. Wtedy jego miejsce zajmie nowy odcinek. </p> <p> Możesz także pobrać określony odcinek Time to Walk za pomocą iPhone&#39;a. Udaj się do <strong> Zdatność </strong> aplikację i wybierz <strong> Fitness+ </strong> patka. w <strong> Czas na spacer </strong> sekcja, wybierz <strong> Pokaż wszystko </strong> . Tutaj możesz zobaczyć wszystkie dostępne odcinki. </p> <p> Stuknij odcinek, aby zobaczyć więcej informacji o tym, czego się spodziewać, oraz o utworach z listy odtwarzania. Na tej stronie użyj <strong> Dodaj </strong> przycisk, aby pobrać odcinek na zegarek. Jeśli odcinek został już pobrany na zegarek, pojawi się komunikat <strong> Pobrano </strong> i pokaż znacznik wyboru. </p> <p> <strong class=\"gallery__section-title\"> Galeria obrazów (3 obrazy) </strong> <img alt=\"Apple Activity App\" src=\"images/apple-activity-app-625.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"Apple Fitness+ Time to Walk\" src=\"images/apple-fitness-time-to-walk-841.jpg\" loading=\"lazy\"> Rozszerzać <img alt=\"Time to Walk Episode\" src=\"images/time-to-walk-episode-915.jpg\" loading=\"lazy\"> Rozszerzać </p> <p> Blisko </p> <p> Jeśli masz zegarek Apple Watch z obsługą sieci komórkowych, nie musisz się martwić o pobieranie odcinka, ponieważ nadal możesz przesyłać strumieniowo odcinki bez konieczności korzystania z iPhone&#39;a w pobliżu. </p> <p> </p> <p> Gdy będziesz gotowy na spacer, otwórz zegarek Apple Watch <strong> Trening </strong> aplikacja. Stuknij w <strong> Czas na spacer </strong> odcinek do rozpoczęcia. Jeśli ruch zostanie wykryty za pomocą GPS zegarka Apple Watch, trening zostanie zarejestrowany jako spacer na świeżym powietrzu. Jeśli nie, trening będzie liczony jako spacer w pomieszczeniu. </p> <p> <img alt=\"Apple Watch Time to Walk \" src=\"images/apple-watch-time-to-walk-217.jpg\" loading=\"lazy\"> </p> <p> Podczas spaceru przesuń palcem w lewo, aby zablokować ekran zegarka, wstrzymać trening lub zakończyć trening. Przesunięcie w prawo spowoduje wyświetlenie elementów sterujących multimediami i umożliwi wstrzymanie dźwięku, przeskoczenie do przodu lub do tyłu w odcinku lub przechodzenie między utworami z listy odtwarzania. </p> <p> Jeśli chcesz ręcznie usunąć odcinek Czas na spacer, otwórz aplikację Trening na zegarku Apple Watch i dotknij <strong> ja </strong> ikona obok nazwiska celebryty. Przewiń w dół, a następnie wybierz <strong> Usunąć </strong> . </p> <p> </p> <h2 id=\"making-exercise-even-better-with-time-to-walk\"> Ćwiczenia stają się jeszcze lepsze, gdy masz czas na spacer </h2> <p> Chodzenie to jeden z najłatwiejszych i najpopularniejszych sposobów, aby każdy mógł uzyskać dawkę potrzebnych ćwiczeń. Time to Walk to wyjątkowy sposób na zmotywowanie Cię podczas spaceru. </p> <p> Aby mieć pewność, że masz dużo soku na długi spacer, postępuj zgodnie z naszymi wskazówkami, które pomogą wydłużyć czas pracy baterii zegarka Apple Watch. </p>"}