{"title":"Komputerowe RPG kontra klasyczne RPG: co oznacza CRPG w 2021 roku?","content":"<p> Historia komputerowych gier RPG jest tak długa, jak historia samych gier wideo, ewoluujących i rosnących razem na przestrzeni lat. I tak jak ewoluowały CRPG, ulepszając grafikę, dodając lub porzucając mechanikę rozgrywki, tak samo znaczenie i terminologia użyta do ich opisania. </p> <p> Akronim CRPG, który tradycyjnie oznaczał komputerową grę fabularną, z czasem rozszerzył swoje znaczenie o gry RPG na różne platformy. Teraz nabrała nowego znaczenia. Chociaż jego nowe znaczenie nie różni się całkowicie od pierwotnego, teraz opisuje konkretny podgatunek RPG. </p> <h2 id=\"the-history-of-crpgs\"> Historia CRPG </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> Historia gier CRPG rozpoczęła się w latach 70. wraz z wydaniem najwcześniejszej adaptacji gry wideo Dungeons &amp; Dragons, Dungeon. Gra była pierwotnie dostępna na Atari (można w nią grać przez <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, usługa przesyłania strumieniowego gier na Plex </a> ). </p> <p> Chociaż rozgrywka w Dungeon była głównie oparta na tekście, w pełni opisywała ruchy twojej drużyny składającej się z wielu postaci w scenerii fantasy, jednocześnie wdrażając większość podstawowych zasad Dungeons &amp; Dragons. </p> <p> Wtedy nazywaliśmy je komputerowymi grami RPG, aby odróżnić je od ich stołowych odpowiedników, które były wówczas znacznie bardziej popularne, i po prostu znaliśmy je jako RPG. </p> <p> W latach 90. gry CRPG były w pełnym rozkwicie, teraz mogą wyświetlać świat fantasy w pełni, przynajmniej w perspektywie z góry na dół lub w widoku izometrycznym. Tak było w przypadku Ultimy VII, jednej z najbardziej interaktywnych gier CRPG, w jakie grał ten pisarz. </p> <p> Prawie wszystko, co widzisz, możesz poruszać lub wchodzić w interakcje: możesz tworzyć broń, grać na instrumentach, a nawet wynieść zmarłego członka drużyny z lochu do królewskiej sali tronowej, aby wskrzesić ich! </p> <p> Baldur&#39;s Gate był jednym z tych, które najbardziej naśladowały grę RPG na stole. Dostosował zestaw zasad Dungeons &amp; Dragons 2. edycji (AKA Advanced Dungeons &amp; Dragons) do izometryczny <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> Wstrzymane CRPG w czasie rzeczywistym </a> . Tego rodzaju CRPG kładły nacisk na taktykę w bitwie, rozwój postaci, podejmowanie decyzji i zachęcały do ​​eksploracji. </p> <p> </p> <p> Dzisiaj, w świecie, w którym konsole dominują na rynku, gry RPG stały się bardziej popularne niż stołowe RPG. Do tego stopnia, że ​​we współczesnym użyciu, akronim RPG odnosi się bardziej do wersji z gry wideo. Nazwalibyście Dungeon&#39;s &amp; Dragons planszową grą RPG, a nie tylko grą RPG. </p> <p> Wraz z ewolucją grafiki, mechanika rozgrywki CRPG dostosowała się do współczesnych standardów graficznych. Serie CRPG, takie jak The Elder Scrolls, Gothic czy The Witcher, zrewolucjonizowały gatunek, wprowadzając kilka nowych mechanik rozgrywki, a porzucając inne. </p> <p> Te RPG są bardziej zorientowane na akcję i szybkie tempo, umieszczając się nieco, choć nie do końca, w podgatunku hack and slash (ale to wciąż solidne RPG!) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Nowa fala CRPG </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> Jednak wbrew trendowi w dzisiejszym przemyśle gier wideo, który polega na realizmie graficznym, nadeszła świeża fala CRPG. Klasyczne lub klasyczne gry RPG mają duży wpływ na te gry i kładą nacisk na mechanikę rozgrywki i immersję, a nie na grafikę. </p> <p> Są to na ogół gry izometryczne, z możliwością pauzowania w czasie rzeczywistym lub turowymi bitwami taktycznymi. Te CRPG dokładają również wszelkich starań, aby być tak wciągającym, jak to tylko możliwe, zapewniając nieco duże bloki dobrze wykonanej prozy i solidną historię. </p> <p> Większość z nich opiera się na tekście, a nie na głosie w większości dialogów, podobnie jak oldschoolowe CRPG. Niektóre z tych CRPG to Pillars of Eternity, Divinity: Original Sin czy Pathfinder: Kingmaker. </p> <p> Te gry kładą również nacisk na taktykę bitewną, rozwój postaci, podejmowanie decyzji i zachęcają do eksploracji, tak jak robiły to oldschoolowe CRPG. Z tych powodów uważamy je za bardziej zbliżone do klasycznych gier RPG niż do większości współczesnych gier RPG. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> Co oznacza CRPG w 2021 r. </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> Od 2000 roku RPG stało się standardowym terminem odnoszącym się do każdej gry RPG. Ale około 2015 roku wydali Divinity: Original Sin i Pillars of Eternity. </p> <p> Te RPG były odejściem od nowoczesnych gier RPG zorientowanych na akcję, a jednocześnie były bardzo podobne do starszych tytułów zarówno pod względem estetyki, jak i mechaniki rozgrywki. Mniej więcej w tym czasie pojawiła się potrzeba nowego terminu, aby odróżnić te gry RPG od nowoczesnych gier RPG. </p> <p> Chociaż ludzie od lat rzucają w sieci terminy „stara szkoła” i „klasyczne RPG”, aby opisać te gry, ta ostatnia jest tą, która utknęła. Tak jak współczesne gry RPG przyjęły dla siebie akronim RPG, ludzie nazywają teraz oldschoolowe gry RPG „CRPG”. </p>"}