{"title":"Kamera Sony FX3 ujawniona przez wyciek z Twittera","content":"<p> Minęły zaledwie dwa tygodnie, odkąd Sony ogłosiło premierę Sony A1, kamery 8,6K, która może rejestrować obrazy 50 MP z prędkością do 30 klatek na sekundę. Ale czy firma robi coś więcej? </p> <p> Wszystko, co mamy teraz, to tylko spekulacje, ale Sony może dodać nowy elegancki i kompaktowy aparat do swojej serii FX. </p> <h2 id=\"a-preview-of-the-sony-fx3\"> Podgląd Sony FX3 </h2> <p> W środę Nokishita opublikowała na Twitterze zdjęcie Sony FX3, aparatu, który może rzucić wyzwanie Canonowi EOS C70 i Blackmagic Design Pocket Cinema 6K. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> ソニーFX3の画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> #噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> — (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> 10 lutego 2021 </a></blockquote>  <p> Nokishita to japoński blog technologiczny, który słynie z wczesnych, dokładnych przecieków nadchodzącego sprzętu fotograficznego i wideo. Pomimo tego, że nie jest to oficjalne źródło dla jakichkolwiek firm produkujących produkty optyczne, niektórzy ludzie posuwają się aż do stwierdzenia, że ​​informacje udostępniane przez Nokishitę mogą równie dobrze zostać potwierdzone. </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> TechRadar </a> kiedyś nazywał Nokishitę „Świętym Mikołajem plotek o aparatach”. W odpowiedzi na powyższy tweet, użytkownik Twittera @miemelaar zapytał „[czy] to prawda, czy koncepcja?” a @rauuru_san odpowiedział: „Jeśli Nokishita to opublikuje, to prawdziwa okazja”. </p> <p> Ale nawet gdybyśmy założyli, że przeciek był prawdziwy, ile informacji nam to pozostawia? </p> <p> Moglibyśmy założyć, że FX3 jest częścią linii FX ze względu na swoją nazwę, ale na aparacie widnieje symbol, który wprawia wielu spekulantów w zakłopotanie. Jeśli ten biały znak alfa (α) na przedniej ściance aparatu wygląda znajomo, to dlatego, że możesz znaleźć ten sam znak w bezlusterkowych aparatach Sony. </p> <p> Czy FX3 jest więc aparatem filmowym, aparatem bezlusterkowym, czy może hybrydą w stylu lustrzanki cyfrowej? Na więcej szczegółów będziemy musieli poczekać. Do tego czasu rozważ przeczytanie naszego artykułu na temat <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> kluczowe różnice między aparatami bezlusterkowymi, lustrzankami cyfrowymi i kamerami </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> Co przyniesie Sony FX3? </h2> <p> Odkąd pojawił się tweet Nokishity, rzekome specyfikacje produktu aparatu krążyły po sieci. Jednak na razie nic z jakichkolwiek źródeł równie renomowanych. </p> <p> Na szczęście w nadchodzących tygodniach powinniśmy dowiedzieć się więcej o Sony FX3. Największa impreza fotograficzna w Japonii, CP+ 2021, odbędzie się w dniach 25-28 lutego. </p>"}