{"title":"Kolejna nieoficjalna marka płyt czołowych PS5 jest na scenie","content":"<p> Firma dbrand, która produkuje skórki, ekrany i obudowy dla różnych urządzeń, dołączyła do Sony-baitingu i wypuściła swój własny nieoficjalny panel przedni PS5. </p> <h2 id=\"dbrand-releases-darkplates\"> dbrand wydaje Darkplates </h2> <p> Jeśli chcesz dostosować swoje PS5, to dbrand jest najnowszą firmą, która oferuje nieoficjalne panele czołowe dla konsoli nowej generacji. Nazywają je ciemnymi płytami, ponieważ są czarnymi płytami czołowymi. </p> <p> Możesz sprawdzić talerze na <a href=\"https://dbrand.com/shop/special-edition/ps5\" target=\"_blank\" rel=\"nofollow noopener\"> sklep dbrand </a> , gdzie można kupić czarne matowe panele czołowe za 49,00 USD (w momencie pisania). </p> <p> Możesz także wybrać to, co dbrand nazywa „środkiem skóry”, czyli winylową naklejkę, która znajduje się na błyszczącym, czarnym panelu centralnym PS5. Kosztuje to dodatkowe 11,95 USD i jest dostępny w wielu kolorach i wzorach. </p> <p> <img alt=\"dbrand shell texture detail\" src=\"images/dbrand-shell-texture-detail-544.png\" loading=\"lazy\"> </p> <p> Zauważysz również, że szczyci się teksturą płyty czołowej. To jest podobne do <a href=\"https://www.makeuseof.com/sony-how-ps5-controller-textured-playstation-symbols/\" target=\"_blank\" rel=\"nofollow noopener\"> małe symbole PlayStation, które znajdziesz na DualSense </a> , inne oficjalne akcesoria PS5 oraz nakładki firmowe, które są dołączane do konsoli przy zakupie. Podobne, ale czy są tak imponujące? </p> <p> </p> <h2 id=\"will-dbrand-last\"> Czy dbrand przetrwa? </h2> <p> Bez wątpienia widziałeś nasze <a href=\"https://www.makeuseof.com/cmp-shells-ps5-faceplate-colors/\" target=\"_blank\" rel=\"nofollow noopener\"> Pokrycie przednią stronę w odniesieniu do pocisków CMP </a> , co spowodowało, że sam zwycięski powrót po zakazie Sony. Niektórzy mogliby powiedzieć, że jego powrót był arogancki, ponieważ zadeklarował, że nowe nakładki są prawnie nietykalne. Zobaczymy. </p> <p> </p> <p> To sprawia, że ​​zastanawiasz się, dlaczego dbrand w ogóle się tym przejął. Sony kategorycznie <strong> nie </strong> uprzejmie zajmij się CMP Shells, po pierwsze dlatego, że jego poprzednia nazwa marki była zbyt podobna do PlayStation (PlateStation). </p> <p> Następnie Sony zakwestionowało, ponieważ uznało, że panele czołowe są częścią projektu konsoli, a zatem kopiowanie ich stanowiło naruszenie własności intelektualnej. Sygnał uderzenia młotkiem zakazu. Pociski CMP zakończyły produkcję, anulując wszystkie zamówienia przed ponownym pojawieniem się w nowej formie. </p> <p> dbrand jest już na czwartą falę przedsprzedaży potencjalnie niezaspokojonych klientów, więc musisz być szybki, jeśli chcesz skorzystać z jednego z niestandardowych paneli czołowych. To, czy płyty rzeczywiście trafią do produkcji, to inna sprawa. Sony może ponownie opuścić młotek. </p> <p> </p> <h2 id=\"should-you-buy-a-dbrand-faceplate\"> Czy powinieneś kupić dbrand Faceplate? </h2> <p> Podobnie jak w przypadku sagi CMP Shells, radzimy zachować ostrożność każdemu, kto jest zainteresowany dostosowaniem swoich paneli przednich PS5. Są to produkty firm trzecich, więc nie masz możliwości potwierdzenia ich jakości inaczej niż to, co mówi Ci marka. </p> <p> Ponadto, biorąc pod uwagę naleganie Sony, że PlateStation (obecnie CMP Shells) musi zaprzestać produkcji, nie będzie zaskoczeniem, jeśli nie zadzwoni do swoich prawników, aby również zająć się sprawą dbranda. </p> <p> Krótko mówiąc, bądź ostrożny, jeśli chcesz dostosować swoje panele przednie. CMP Shells zwróciło wszystkim swoim klientom za pierwszym razem. Ale to nie znaczy, że zrobi to inna marka. </p> <p> </p> <h2 id=\"do-you-really-need-to-customize-your-ps5\"> Czy naprawdę musisz dostosować swoje PS5? </h2> <p> <img alt=\"ps5\" src=\"images/ps5-183.jpg\" loading=\"lazy\"> </p> <p> Jeśli nie jesteś zadowolony z wyglądu swojego PS5, zawsze możesz go zmodyfikować na inne (znacznie tańsze) sposoby. Zawsze możesz dodać winylową skórkę do konsoli, jeśli chcesz, aby wyglądała inaczej. </p> <p> PS5 wystartował dopiero w listopadzie 2020 r. Być może spróbuj zagrać na nim w kilka gier, zanim poczujesz nieodpartą potrzebę zmiany kosmetycznego wyglądu swojej konsoli. </p>"}