{"title":"Kontroler PS4 nie działa? Jak naprawić najczęstsze problemy?","content":"<p> Przez większość czasu twój kontroler PlayStation 4 prawdopodobnie działa dobrze. Ale kiedy Twój DualShock 4 przestaje się łączyć lub rozłącza losowo, jest to frustrujące. </p> <p> Przyjrzyjmy się poprawkom, gdy kontroler PS4 nie działa, abyś mógł wrócić do gry. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> Kontroler PS4 nie chce się sparować ani połączyć </h2> <p> Zwykle po naciśnięciu przycisku <strong> Przycisk PS </strong> na kontrolerze powinien się włączyć i połączyć z systemem. Jednak gdy się nie łączy, zamiast tego zobaczysz, że pasek świetlny na kontrolerze miga przez chwilę, a następnie wyłącza się. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Zwykle dzieje się tak, jeśli używałeś DualShock 4 z innym urządzeniem. Na przykład, jeśli <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> sparuj kontroler PS4 z komputerem </a> lub konsolę znajomego, zapamięta to urządzenie. </p> <p> W takich przypadkach konieczne będzie ponowne sparowanie DualShock 4 z własnym PS4. Aby to zrobić, podłącz kontroler do PS4 za pomocą kabla micro-USB. Upewnij się, że używasz wysokiej jakości kabla, o którym wiesz, że działa prawidłowo. </p> <p> </p> <p> wciśnij <strong> Przycisk PS </strong> na kontrolerze przez chwilę, a dioda powinna krótko zamigać, zanim zmieni kolor na niebieski. Oznacza to, że kontroler został pomyślnie sparowany i połączony. </p> <p> Jeśli masz DualShock 4 sparowany z innym pobliskim urządzeniem, takim jak telefon lub PlayStation 5, prawdopodobnie spowoduje to włączenie i podłączenie kontrolera do tego urządzenia. W związku z tym należy najpierw wyłączyć i odłączyć urządzenie, do którego podłączony jest DualShock 4. </p> <p> Po ponownym sparowaniu kontrolera możesz odłączyć kabel USB i normalnie korzystać z kontrolera bezprzewodowo. Twój PS4 zapamięta go, dopóki w przyszłości nie sparujesz kontrolera z innym urządzeniem. </p> <p> Pamiętaj, że maksymalna liczba kontrolerów DualShock 4, które możesz jednocześnie podłączyć do PS4, to cztery. Jeśli masz już podłączone cztery kontrolery, musisz odłączyć jeden, aby zrobić miejsce na więcej. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> Kontroler PS4 ciągle się rozłącza </h2> <p> Jeśli Twój DualShock 4 rozłączy się losowo podczas gry, możesz wypróbować kilka sposobów. </p> <p> Najpierw upewnij się, że bateria kontrolera jest naładowana. Brzmi prosto, ale jeśli bateria w kontrolerze jest prawie wyczerpana, może się rozłączyć. Aby sprawdzić żywotność baterii kontrolera, przytrzymaj przycisk <strong> Przycisk PS </strong> aby wyświetlić Szybkie menu po lewej stronie ekranu. Zobaczysz ikonę kontrolera z wyświetlaczem baterii na dole. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Podłącz kontroler do PS4 i ponownie odwiedź Szybkie menu, aby upewnić się, że widzisz animację ładowania baterii. Po pewnym czasie ładowania kontrolera spróbuj używać go jak zwykle. </p> <p> Jeśli bateria nie była Twoim problemem, upewnij się, że nie próbujesz używać kontrolera zbyt daleko od systemu. Typowy zasięg Bluetooth wynosi około 30 stóp; w zależności od konfiguracji możesz mieć możliwość dalszego używania kontrolera lub ograniczenia do bliższego korzystania z niego. </p> <p> Mówiąc o tym, powinieneś spróbować zminimalizować zakłócenia między kontrolerem a konsolą. Usuń wszelkie metalowe przedmioty między nimi, takie jak półki lub laptopy, które mogą blokować sygnał. Powinieneś także wyjąć PS4 z zamkniętej przestrzeni, w której się znajduje, aby uzyskać lepszą transmisję i odbiór sygnału. </p> <p> Na koniec pamiętaj, że PS4 ma ustawienie, które wyłącza kontrolery po pewnym czasie bezczynności. Jeśli nie chcesz, aby kontroler PS4 wyłączał się podczas oglądania aplikacji multimedialnych, takich jak YouTube, przejdź do <strong> Ustawienia &gt; Ustawienia oszczędzania energii &gt; Ustaw czas do wyłączenia kontrolerów </strong> i wybierz <strong> Nigdy </strong> . Pamiętaj, że spowoduje to zużycie baterii nawet podczas bezczynności. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> Ogólne wskazówki dotyczące naprawy kontrolera PlayStation 4 </h2> <p> Przyjrzeliśmy się konkretnym poprawkom kilku typowych problemów z DualShock 4 powyżej. Następnie spójrzmy na bardziej ogólne rozwiązania problemów z kontrolerami PS4. Przejrzyj je, jeśli potrzebujesz dodatkowej pomocy. </p> <h3 id=\"restart-your-console\"> 1. Uruchom ponownie konsolę </h3> <p> Chociaż większość problemów z kontrolerem wynika z samego kontrolera, istnieje szansa, że ​​problem dotyczy PS4. Aby to wykluczyć, zrestartuj konsolę przed dalszym rozwiązywaniem problemów. </p> <p> Jeśli kontroler działa wystarczająco, aby uzyskać dostęp do menu, przytrzymaj hold <strong> Przycisk PS </strong> aby otworzyć Szybkie menu, a następnie przejdź do <strong> Zasilanie &gt; Uruchom ponownie PS4 </strong> aby ponownie uruchomić system. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> Jeśli kontroler nie współpracuje, naciśnij i przytrzymaj <strong> Moc </strong> na konsoli PS4, aż usłyszysz dwa sygnały dźwiękowe. Spowoduje to całkowite wyłączenie (brak świateł z przodu) — po wyłączeniu naciśnij przycisk <strong> Moc </strong> ponownie, aby go ponownie włączyć. </p> <p> Spróbuj ponownie użyć kontrolera po ponownym uruchomieniu i sprawdź, czy to pomoże. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. Zapomnij i ponownie sparuj kontroler PS4 </h3> <p> Jeśli masz drugi kontroler PS4 (lub kontroler PS Move), możesz go użyć, aby uzyskać dostęp do menu, które pozwala usunąć problem z kontrolerem. Zmierzać do <strong> Ustawienia &gt; Urządzenia &gt; Urządzenia Bluetooth </strong> i wybierz <strong> DualShock 4 </strong> wpis — to ten, który nie ma obok niego zielonego światła. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> W wyświetlonym menu naciśnij <strong> Opcje </strong> przycisk na kontrolerze i wybierz <strong> Zapomnij o urządzeniu </strong> . Spowoduje to, że twój PS4 usunie go z pamięci, więc musisz go ponownie sparować. </p> <p> To dobry moment, aby wypróbować nieco inną metodę parowania: ponowne sparowanie przy starcie. Aby to zrobić, wyłącz PS4 (jak wyjaśniono wcześniej). Po wyłączeniu podłącz problematyczny kontroler do konsoli za pomocą kabla USB. Uderz w <strong> Przycisk PS </strong> miejmy nadzieję, że włączysz i sparujesz kontroler w jednym procesie. </p> <p> Jeśli to nie zadziała, włącz ponownie PS4 i spróbuj sparować go w normalny sposób, jak powyżej. </p> <h3 id=\"hard-reset-your-controller\"> 3. Twardy reset kontrolera </h3> <p> Jeśli usunięcie i ponowne sparowanie kontrolera nie zadziałało, możesz następnie wypróbować procedurę pełnego resetowania dla DualShock 4. Aby to zrobić, potrzebujesz małego spiczastego przedmiotu, takiego jak wygięty spinacz do papieru lub narzędzie do wyjmowania karty SIM . </p> <p> Wyłącz PS4, a następnie odwróć kontroler. Zobaczysz mały otwór obok śruby przy przycisku L2 (po prawej stronie kontrolera po odwróceniu). Użyj spiczastego narzędzia, aby nacisnąć i przytrzymać przycisk wewnątrz tego otworu przez około pięć sekund. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> Gdy to zrobisz, ponownie podłącz kontroler do PS4 za pomocą kabla USB i sprawdź, czy udało się go sparować. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Wypróbuj kontroler gdzie indziej </h3> <p> W tym momencie, jeśli jeszcze tego nie zrobiłeś, spróbuj użyć kontrolera, który ma problemy z innym urządzeniem. Jeśli masz podobne problemy na PS4 lub komputerze znajomego, prawdopodobnie Twój kontroler jest uszkodzony. </p> <p> Jeśli to możliwe, dobrym pomysłem jest również wypróbowanie innego kontrolera PS4 z konsolą. Jeśli pożyczysz DualShock 4 znajomego, o którym wiesz, że działa poprawnie, i stwierdzisz, że ma problemy z twoim systemem, prawdopodobnie coś jest nie tak z łącznością bezprzewodową twojego PS4. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Użyj kontrolera w trybie przewodowym </h3> <p> Zanim zrezygnujesz z kontrolera, powinieneś spróbować pobawić się z nim na stałe podłączonym kablem USB. Pamiętaj jednak, że działa to tylko w przypadku poprawionego modelu kontrolerów PS4. Będziesz wiedział, że masz ten model, jeśli w panelu dotykowym z przodu kontrolera znajduje się pasek świetlny. Jeśli nie, nie możesz wymusić komunikacji przewodowej. </p> <p> Jeśli jeszcze go nie masz, kup długi kabel, aby nadal cieszyć się graniem z kanapy. <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Trójpak Ailun </a> 10-metrowych kabli micro-USB to dobra, opłacalna opcja. </p> <p> Aby zmusić PS4 do podłączenia kontrolerów przez USB, przejdź do <strong> Ustawienia &gt; Urządzenia &gt; Kontrolery &gt; Metoda komunikacji </strong> i wybierz <strong> Użyj kabla USB </strong> . Uniemożliwi to DualShock 4 korzystanie z Bluetooth, nawet po podłączeniu przez USB. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> Opcje naprawy sprzętu DualShock 4 </h2> <p> Podobnie jak większość sprzętu, kontrolery DualShock 4 mają roczną gwarancję. Jeśli kupiłeś kontroler PS4 w ciągu ostatniego roku i nie możesz go naprawić wszystkimi powyższymi wskazówkami, powinieneś odwiedzić <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> Strona Napraw i zamień na PlayStation </a> złożyć wniosek o naprawę kontrolera. </p> <p> W przeciwnym razie możesz samodzielnie wypróbować poprawki sprzętowe, otwierając kontroler. Ale w zależności od konkretnego problemu może to być trudne lub niemożliwe. Zalecamy rozmowę z lokalnym technikiem naprawczym, jeśli nie czujesz się komfortowo, robiąc to samemu. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> Problemy z kontrolerem PS4, poprawione </h2> <p> Teraz wiesz, jak rozwiązać najczęstsze problemy z kontrolerem PS4. Bardziej szczegółowe problemy, takie jak przycisk, który przestaje działać, niestety podlegają wyżej wymienionym rozwiązaniom naprawczym. </p> <p> Mamy nadzieję, że Twój problem był łatwy do naprawienia. Ale jeśli nie, a musisz wybrać nowy kontroler PS4, masz wiele świetnych opcji. </p> <p> <small> Źródło: Joeri Mostmans/ <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}