{"title":"LastPass ograniczy Cię do jednego typu urządzenia, chyba że zapłacisz","content":"<p> LastPass, popularny menedżer haseł, przechodzi wielką zmianę. Wkrótce ci, którzy korzystają z usługi za darmo, będą mogli to robić tylko na komputerach lub telefonach komórkowych, ale nie na obu, chyba że zapłacą. </p> <p> Oznacza to, że LastPass nie jest już atrakcyjnym wyborem jako darmowy menedżer haseł. W świecie, w którym nieustannie przełączamy się między komputerami a telefonami komórkowymi, posiadanie menedżera haseł, który działa tylko dla jednego typu urządzenia, jest bezużyteczne. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> Co się zmienia w LastPass za darmo? </h2> <p> Jak ogłoszono na <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog LastPass </a> , nadchodzą zmiany w bezpłatnej wersji menedżera haseł. </p> <p> Obecnie LastPass Free umożliwia korzystanie z usługi na wszystkich urządzeniach. Nie ma znaczenia, czy używasz LastPass na komputerze, tablecie czy telefonie komórkowym. Wszystko to jest bezpłatne. Ma to ulec zmianie 16 marca 2021 r. </p> <p> Od tego czasu LastPass Free będzie zawierał nieograniczoną liczbę urządzeń jednego typu: komputerów lub telefonów komórkowych. </p> <p> W przypadku LastPass komputery są klasyfikowane jako komputery stacjonarne lub laptopy, podczas gdy telefony komórkowe to telefony komórkowe, tablety i smartwatche. </p> <p> Kiedy po raz pierwszy zalogujesz się do LastPass 16 marca, będziesz musiał ustawić aktywny typ urządzenia. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> Na przykład, jeśli wybierzesz komputery jako typ urządzenia, będziesz mógł używać LastPass na swoich komputerach stacjonarnych i laptopach. Jeśli jednak chcesz korzystać z LastPass na dowolnym urządzeniu mobilnym, musisz uaktualnić do LastPass Premium. </p> <p> W pewnym sensie jest to powrót do dawnego LastPass. Możliwość bezpłatnego korzystania z LastPass na komputerach i urządzeniach mobilnych stała się dostępna dopiero w 2015 roku. Wcześniej trzeba było zapłacić za wsparcie mobilne. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> Obsługa LastPass również się zmienia </h2> <p> LastPass zmienia również sposób, w jaki zapewnia wsparcie. Od 17 maja 2021 r. pomoc przez e-mail będzie dostępna tylko dla klientów Premium i Family. </p> <p> Bezpłatni użytkownicy utkną z artykułami pomocy dostępnymi na stronie wsparcia LastPass lub mogą poprosić o pomoc w społeczności LastPass. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> Każdy powinien używać menedżera haseł </a> . Są szanse, że musisz go używać na komputerach stacjonarnych i mobilnych. LastPass wie o tym i stawia na użytkowników przechodzących na płatną usługę, która jest obecnie 25% taniej za 27 USD rocznie. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> Czy czas zmienić menedżera haseł? </h2> <p> Jeśli korzystasz z LastPass Free, prawdopodobnie skłoniło to Cię do zmiany. Jeśli tak, istnieje wiele innych świetnych menedżerów haseł, których możesz używać na wszystkich swoich urządzeniach za darmo. </p> <p> Z drugiej strony, może uważasz, że to sprawiedliwe, że płacisz niewielką kwotę na LastPass w celu wsparcia świadczonych przez nią usług. </p>"}