{"title":"Możesz dostać nowe Microsoft Teams Pro za darmo","content":"<p> Jakiś czas temu omówiliśmy planowaną usługę subskrypcji Microsoft Teams o nazwie „Teams Pro”, która odblokuje dodatkowe funkcje oprogramowania. Jednak Microsoft poinformował, że niektórzy ludzie otrzymają Teams Pro bez dodatkowych opłat w stosunku do swoich obecnych planów. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Oświadczenie Microsoft dotyczące subskrypcji Free Teams Pro </h2> <p> Jeśli potrzebujesz przypomnienia, wcześniej omówiliśmy ten temat w naszym artykule na <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro dodaje webinary do usługi </a> . </p> <p> Teraz artykuł autorstwa <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> na ten sam temat od tego czasu otrzymał oświadczenie od firmy Microsoft. Oświadczenie to dobra wiadomość dla osób, które martwią się o dodatkowe opłaty za webinary: </p> <blockquote> <p> 9 lutego opublikowaliśmy post MC dotyczący nowego planu usług Teams Pro. Aby wyjaśnić, nie ma zmian w istniejących licencjach produktów po dodaniu nowego planu usług. Zamiast tego plan usług zostanie automatycznie dodany do licencji Microsoft 365 i Office 365 E5/E3/A5/A3 oraz Microsoft 365 Business Standard/Business Premium i umożliwi użytkownikom, którzy mają licencje na te jednostki SKU, automatyczne otrzymywanie funkcji wdrażanych do Zespoły w najbliższej przyszłości. </p> </blockquote> <p> Microsoft dalej stwierdza, że ​​administratorzy nie muszą nic robić, aby aktywować te nowe funkcje. Ponadto każdy, kto ma zgodną licencję, jak wymieniono powyżej, otrzyma te nowe, błyszczące funkcje bez dodatkowych opłat. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Uzyskaj więcej za to samo dzięki Microsoft Teams </h2> <p> Microsoft wprowadza nowy plan subskrypcji Teams Pro, który odblokowuje webinary i nie tylko, ale nie wszyscy będą musieli za to dodatkowo płacić. Jeśli posiadasz subskrypcję jednej z powyższych licencji, możesz oczekiwać, że wszystkie funkcje aplikacji Teams Pro będą dostępne bez dodatkowych opłat. </p> <p> Nie oznacza to, że ludzie bez Teams Pro pozostaną w cieniu. Na przykład wszyscy wkrótce będą mieli dostęp do przydatnej funkcji podsumowania w Microsoft Teams. </p> <p> <small> Źródło obrazu: Studio postmodernistyczne / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}