{"title":"Microsoft wypuszcza nową aplikację biurową na iPada","content":"<p> Firma Microsoft wydała zunifikowaną aplikację Office na tablet Apple. Dzięki niemu programy Word, Excel i PowerPoint są teraz dostępne do pojedynczego pobrania na iPhone&#39;a i iPada w <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> Sklep z aplikacjami </a> . Firma Microsoft nadal udostępnia te aplikacje na iPada jako samodzielne pliki do pobrania. </p> <h2 id=\"better-late-than-never\"> Lepiej późno niż wcale </h2> <p> „Łączymy znane Ci aplikacje Word, Excel i PowerPoint w jedną, zoptymalizowaną dla iPadOS aplikację” — napisał Microsoft w informacjach o wersji dołączonych do pobrania. To świetna wiadomość, jeśli korzystasz z pakietu Office i chcesz pracować w podróży. Dla tych, którzy chcą <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> zamień swojego iPada w zamiennik laptopa </a> , to ważne wydanie. </p> <p> Aplikacje są dostępne bezpłatnie, ale edycja i inne zaawansowane funkcje wymagają subskrypcji Office 365. Dla tych, którzy się zastanawiają, Microsoft oferuje różne opcje subskrypcji w aplikacji od 6,99 USD miesięcznie. </p> <p> Jeśli potrzebujesz tylko edytora tekstu na iPadzie, lepszym pomysłem może być rozważenie alternatyw w <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> Zestawienie najlepszych aplikacji do edycji tekstu MUO na iPada </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> Ujednolicone środowisko mobilnego biura </h2> <p> Aby było jasne, jest to aktualizacja istniejącego pakietu Office dla systemu iOS, a nie zupełnie nowa wersja. <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> kompleksowa aplikacja Office zadebiutowała na iPhonie </a> i Androida w lutym 2020 r. Nie jest jasne, co zajęło Microsoftowi cały rok, aby dodać do tego zoptymalizowane dla iPada wersje programów Word, Excel i PowerPoint, ale lepiej późno niż wcale. </p> <p> </p> <p> Wcześniej aplikacje zwiększające produktywność zawarte w pakiecie zapewniały gorsze wrażenia na iPadzie, ponieważ działały w trybie okienkowym. Jednak dzięki najnowszej dostępnej aktualizacji klienci Apple mogą teraz korzystać z natywnego środowiska pakietu Office na swoim iPhonie, iPadzie lub iPodzie touch, niezależnie od rozmiaru ekranu. </p> <p> </p> <h2 id=\"ipad-specific-features\"> Funkcje specyficzne dla iPada </h2> <p> Firma Microsoft regularnie dodaje nowe, zoptymalizowane pod kątem tabletów funkcje do swojej oferty mobilnego pakietu Office. Na przykład mobilne wersje programów Word, Excel i PowerPoint niedawno wdrożyły obsługę gestów myszy i gładzika. Aplikacje obsługują również funkcję wielozadaniowości w systemie iOS „Split View side-by-side”. </p> <p> Chociaż mobilne i komputerowe wersje pakietu Office nie mają wszystkich tych samych funkcji, nowy pakiet Office dla systemu iOS zawiera kilka nowych funkcji. Pozwalają one na takie rzeczy, jak podpisywanie dokumentów za pomocą Apple Pencil lub palca, szybkie tworzenie plików PDF z dokumentów, konwertowanie obrazów na tekst i tabele i tak dalej. </p> <p> </p> <p> Ponadto możesz teraz łatwo wstawiać datę, kształt, obraz i notatki w plikach PDF. Zaawansowani użytkownicy mogą teraz uzyskać dostęp do działań opartych na obrazach pakietu Office (takich jak Utwórz PPT, Utwórz PDF i inne) za pośrednictwem wielofunkcyjnego menu udostępniania systemu iOS. „Ponadto, jeśli po otwarciu aplikacji Office są jakieś ostatnie zrzuty ekranu, są one wyświetlane jako sugestia konwersji do formatu PDF lub PPT” – zauważa firma. </p> <p> Microsoft wprowadzi również pewne zmiany w swoim pakiecie Office dla komputerów Mac i Windows. Według producenta systemu Windows, nadchodzące aktualizacje pakietu Office dla komputerów stacjonarnych w 2021 r. będą zawierać licencje wieczyste, oprócz innych ulepszeń. . </p>"}