{"title":"Microsoft próbował kupić Pinterest, ale umowa jest wyłączona... na razie","content":"<p> Microsoft zwrócił się niedawno do Pinteresta w sprawie potencjalnej transakcji przejęcia, która byłaby jednym z największych przejęć w historii Redmond. Obecnie rozmowy nie są aktywne, ale skala proponowanej fuzji dodatkowo wyznacza plany rozwoju Microsoftu. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft chce kupić Pinterest </h2> <p> Jak donosi <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Czasy finansowe </a> Microsoft próbował kupić Pinterest, największą na świecie tablicę do przypinania dla hobbystów. </p> <p> Pinterest jest obecnie wyceniany na około 51 miliardów dolarów, a jego wartość rynkowa wzrosła o ponad 600 procent podczas pandemii COVID-19, ponieważ ludzie przechodzą do Internetu podczas blokad. Wiadomość o potencjalnym przejęciu spowodowała, że ​​akcje Pinteresta wzrosły o 7 procent przed otwarciem rynków w czwartek 11 lutego. </p> <p> Ten ruch spowodowałby, że Pinterest znalazłby się w stale rosnącej stajni głównych przejęć technologicznych Microsoftu. W 2016 roku Microsoft nabył LinkedIn za 26 miliardów dolarów, a następnie kupił Github za 7,5 miliarda dolarów w 2018 roku. </p> <p> Nie wspominając o tym, że Microsoft jest właścicielem Minecrafta, który kupił 2,5 miliarda dolarów w 2014 roku, oraz trwającym przejęciu dużego holdingu gier, ZeniMax, za 7,5 miliarda dolarów. ZeniMax jest spółką-matką takich studiów gier jak Bethesda Softworks, id Software, Alpha Dog Games, Tango Gameworks. </p> <p> Co więcej, doszło do <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> nieudana próba zakupu TikTok </a> Aktywa w Ameryce Północnej, Australii i Nowej Zelandii w połowie 2020 r. Transakcja ostatecznie upadła, ale została wyceniona na 20-30 miliardów dolarów i pojawiła się po byłym prezydencie <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Trump zagroził zakazem </a> sieć społecznościowa do udostępniania wideo z USA. </p> <p> Jeśli transakcja na Pintereście doszła do skutku, a nawet jeśli zostanie sfinalizowana w późniejszym terminie, stanie się największym przejęciem Microsoftu do tej pory. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> Dlaczego Microsoft kupuje tak wiele firm technologicznych? </h2> <p> Microsoftowi nie brakuje gotówki i chce rozbudowywać swoje imperium. Jej własne akcje wzrosły o około 80 procent od początku pandemii COVID-19, a ostatnio ujawniły rekordowe zyski. </p> <p> </p> <p> Przejęcie kolejnej platformy, takiej jak Pinterest, jest przepustką do danych dla innych usług Microsoftu. Sama ilość danych generowanych przez platformy takie jak LinkedIn jest idealnym narzędziem do szkolenia technologii AI. Co więcej, przejęcie ogromnej usługi online, takiej jak Pinterest, i zarządzanie nią, służy również jako reklama platformy Azure. </p> <p> Jak wspomina raport Financial Times, rozmowa o tak ogromnej fuzji dwóch firm technologicznych wystawiłaby również na próbę administrację prezydenta Bidena. Czy nowa administracja chętnie pozwala gigantom technologicznym, takim jak Microsoft, Google i Facebook, wykupić konkurencję? Tylko czas powie. </p>"}