{"title":"Microsoft wystrzeliwuje Azure w kosmos z komputerem Spaceborne firmy HPE-2","content":"<p> Microsoft wychodzi poza granice naszej planety, aby świadczyć usługi pozaziemskie. . Firma będzie współpracować z Hewlett Packard Enterprises, aby połączyć się z komputerem PC na Międzynarodowej Stacji Kosmicznej (ISS) za pośrednictwem platformy Azure. </p> <p> Spaceborne Computer-2 połączy się z Azure za pośrednictwem stacji naziemnych NASA i HPE, dostarczając stacji kosmicznej bardzo dużą moc przetwarzania danych. </p> <h2 id=\"azure-heads-into-space\"> Azure leci w kosmos </h2> <p> Jak informowaliśmy w dniu <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> na blogu Microsoft Azure . </a> , Spaceborne Computer-2 (SBC-2) zapewni astronautom ISS technologie bardziej zbliżone do ich ziemskich odpowiedników. </p> <p> Istnieje nadzieja, że ​​drastycznie skróci to czas potrzebny na przesyłanie danych między ISS a Ziemią, a także zmniejszy przepustowość wymaganą do przetwarzania i analizy. </p> <blockquote> <p> Astronauci i odkrywcy kosmosu zasługują na dostęp do najlepszych technologii przetwarzania w chmurze i zaawansowanego przetwarzania na najwyższym poziomie. Czasami analiza musi być wykonana natychmiast na krawędzi, gdzie liczy się każdy upływający moment, a innym razem analiza jest tak bardzo złożona, że ​​można ją przeprowadzić tylko przy użyciu chmury hiperskalowej. </p> </blockquote> <p> Spaceborne Computer-2 wykorzystuje system Edgeline Converged Edge firmy Hewlett Packard Enterprises, który jest „celowo zaprojektowany do pracy w trudnych środowiskach brzegowych” i wniesie do ISS mnóstwo funkcji Azure. </p> <p> Gdy połączenie zostanie uruchomione, SBC-2 umożliwi badania w takich dziedzinach, jak modelowanie pogody dla przyszłych misji na Marsa, analiza roślin i hydroponiczna w celu wsparcia wzrostu żywności i upraw w kosmosie oraz obrazowanie medyczne na samej ISS ​​(w celu wsparcia opieki zdrowotnej astronautów ). </p> <p> Dr Mark Fernandez, architekt rozwiązań Converged Edge Systems w HPE i główny badacz ds. Spaceborne Computer-2, powiedział: </p> <blockquote> <p> Łącząc HPE Spaceborne Computer-2, który jest oparty na systemie HPE Edgeline Converged Edge do zaawansowanych obliczeń brzegowych i możliwości sztucznej inteligencji, z Microsoft Azure w celu połączenia z chmurą, umożliwiamy odkrywcom kosmosu bezproblemowe przesyłanie dużych zestawów danych do i z Ziemia i korzystaj z doświadczenia od krawędzi do chmury </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> Kolejna faza inicjatywy Microsoft Azure Space </h2> <p> Zapowiedź Microsoftu to kolejny krok naprzód dla jego firmy <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Przestrzeń Microsoft Azure </a> inicjatywę, którą uruchomiła w październiku 2020 r. </p> <p> Inicjatywa Azure Space jest wysiłkiem Microsoftu, aby zrobić „kolejny wielki skok w chmurze obliczeniowej”, przenosząc platformę Azure Cloud Computing w kosmos. </p> <p> </p> <p> Azure Space współpracowało wcześniej z projektem SpaceX Starlink w celu dostarczenia satelitarnej łączności szerokopasmowej do swojego Azure Modular Datacenter (MDC) i kontynuuje prace nad projektem Azure Orbital, który rozszerzy łączność między centrami danych w chmurze za pomocą technologii satelitarnej. </p>"}