{"title":"Mark Zuckerberg z Facebooka osobiście przejął politykę prywatności firmy Apple","content":"<p> CEO Facebooka, Mark Zuckerberg, podobno powiedział pracownikom Facebooka, że ​​„musimy zadać ból” Apple za tak złe traktowanie giganta mediów społecznościowych, <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> dziennik &quot;Wall Street </a> raporty. </p> <p> Zuckerberg miał skomentować to w 2018 roku po tym, jak szefowie Apple i Facebooka zderzyli się ze skandalem z Cambridge Analytica, w którym do danych osobowych milionów użytkowników Facebooka uzyskano dostęp bez ich zgody na reklamę polityczną. </p> <h2 id=\"apple-vs-facebook\"> Apple kontra Facebook </h2> <p> W tym czasie dyrektor generalny Apple, Tim Cook, został zapytany w wywiadzie o to, jak zareagowałby, gdyby znalazł się w sytuacji Zuckerberga w obliczu kryzysu. „Nie byłbym w takiej sytuacji” – powiedział Cook. </p> <p> The Wall Street Journal twierdzi, że chociaż Zuckerberg skomentował, że słowa Cooka były „niezwykle trafne” i „wcale nie zgadzały się z prawdą”, za kulisami był znacznie ostrzejszy w swojej ocenie. </p> <p> Od tego czasu relacje między dwiema firmami technologicznymi nie uległy poprawie. Apple podwoiło swoją postawę zorientowaną na prywatność, a Cook ogłosił, że prywatność jest jednym z <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> najbardziej palące problemy na świecie </a> . iOS 14 zawiera wiele funkcji związanych z prywatnością, z którymi Facebook miał problem, twierdząc, że mogą one zaszkodzić małym firmom. </p> <p> Podczas ostatniej kwartalnej rozmowy inwestorów na Facebooku Zuckerberg nazwał Apple „ <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> jeden z największych konkurentów [Facebooka] </a> ” w wyniku tych nowych środków ochrony prywatności. „Apple może powiedzieć, że robi to, aby pomóc ludziom, ale ruchy wyraźnie podążają za ich konkurencyjnymi interesami” – powiedział Zuckerberg. </p> <p> </p> <p> Facebook podobno przygotowuje sprawę antymonopolową przeciwko Apple, która zamieni snajper pomiędzy dwoma tytanami z Doliny Krzemowej w pełnoprawną bitwę. Raport Wall Street Journal zauważa, że ​​„potencjalne uregulowania prawne i decyzje prawne prawdopodobnie wpłyną na setki milionów telefonów konsumentów w nadchodzących latach”. </p> <p> </p> <h2 id=\"different-approaches\"> Różne podejścia </h2> <p> Rzecznik Facebooka, Dani Lever, powiedział Wall Street Journal, że „Apple twierdzi, że chodzi o prywatność, ale chodzi o zysk, a my dołączamy do innych, aby zwrócić uwagę na ich preferencyjne, antykonkurencyjne zachowanie”. Powiedziała, że ​​Facebook „celowo sprzeciwia się Apple” w imieniu mniejszych firm i programistów, którzy są poszkodowani przez funkcję prywatności aplikacji Apple. </p> <p> Chociaż Lever zaprzeczył, że walka między dwiema firmami jest osobista, zdecydowanie wykracza poza kilka punktów spornych między dwiema dużymi firmami technologicznymi. Model biznesowy finansowany z reklam, na którym działa Facebook, bardzo różni się od modelu opartego na sprzęcie, który napędza Apple. Żadna z tych dwóch firm – ani ich liderzy – prawdopodobnie nie wycofa się ze swoich podstawowych przekonań na temat tego, jak budować przyszłość technologii. </p> <p> Fakt, że dyrektor generalny Apple, Tim Cook, omawia prywatność w kategoriach moralnych, pokazuje, jak bardzo osobiste, z jednej strony, jest to naprawdę. </p> <p> <small> Źródło obrazu: Wikipedia/ <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Anthony Quintano CC </a></small> </p>"}