{"title":"Najnowsza aktualizacja WatchOS chroni przed błędem Apple Watch-Bricking","content":"<p> Najnowsza aktualizacja watchOS firmy Apple, wersja oprogramowania 7.3.1, zawiera bardzo ważną poprawkę — rozwiązanie błędu, który uniemożliwia ładowanie niektórych urządzeń Apple Watch Series 5 i Apple Watch SE po przejściu w tryb rezerwy energii. </p> <p> Firma uruchomiła również nowy bezpłatny program naprawy dla dotkniętych urządzeń, które są uwięzione w tym trybie niskiego zużycia energii i nie mogą się z niego wydostać. Ten błąd zasadniczo „unieruchamia” ich Apple Watch, przez co nie jest już funkcjonalny. </p> <h2 id=\"the-power-reserve-mode-bug\"> Błąd trybu rezerwy mocy </h2> <p> Tryb rezerwy energii jest inicjowany, gdy bateria zegarka Apple Watch jest słaba. Uniemożliwia komunikowanie się zegarka Apple Watch z iPhonem. Uniemożliwia również użytkownikom dostęp do innych funkcji zegarka Apple Watch. Aby wyjść z trybu rezerwy energii, użytkownicy muszą naładować zegarek Apple Watch. </p> <p> Na <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> strona pomocy o błędach i programie naprawczym </a> , z dnia 15 lutego, Apple rozpoczyna od odnotowania: </p> <blockquote> <p> Bardzo niewielka liczba klientów korzystających z modeli Apple Watch Series 5 lub Apple Watch SE z systemem watchOS 7.2 lub 7.3 napotkała problem z tym, że ich zegarek nie ładuje się po przejściu do rezerwy chodu. </p> </blockquote> <p> Aby dowiedzieć się, czy masz model zegarka Apple Watch, którego dotyczy problem, Apple zaleca umieszczenie zegarka na ładowarce i odczekanie co najmniej 30 minut. Jeśli opłata nie zostanie naliczona, skontaktuj się ze Wsparciem Apple, które zorganizuje bezpłatną naprawę wysyłkową. </p> <p> Zegarki zostaną sprawdzone w celu sprawdzenia, czy kwalifikują się, a jeśli tak, naprawa zostanie przeprowadzona bezpłatnie, a naprawiony zegarek zwrócony właścicielowi. </p> <p> Nie jest jasne, ile zegarków Apple poważnie dotyczy tego błędu. Wydaje się jednak, że problem dotyczy tylko podzbioru modeli Apple Watch Series 5 lub Apple Watch SE, a nie innych modeli. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> Jak uaktualnić do WatchOS 7.3.1? </h2> <p> Dla tych, którzy nie doświadczyli błędu, nadal warto uaktualnić do najnowszej wersji watchOS, aby uchronić się przed potencjalnym wystąpieniem. </p> <p> O znaczeniu poprawki błędu świadczy fakt, że Apple natychmiast udostępnił system watchOS 7.3.1 wszystkim użytkownikom. Jest to sprzeczne ze sposobem, w jaki zwykle wydaje aktualizacje oprogramowania, udostępniając je początkowo programistom do testów beta. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple wypuścił system watchOS 7.3 </a> pod koniec stycznia. </p> <p> Użytkownicy mogą pobrać watchOS 7.3.1 za pomocą aplikacji Apple Watch na iPhone&#39;a. Aby to zrobić, muszą udać się do <strong> Ogólne &gt; Aktualizacja oprogramowania </strong> . Aby przeprowadzić aktualizację, zegarek Apple Watch musi mieć co najmniej 50 procent baterii. Musi również znajdować się w pobliżu Twojego iPhone&#39;a. </p>"}