{"title":"Nowe badanie mówi, że użytkownicy Androida są lepszymi partnerami niż użytkownicy iPhone&#39;a","content":"<p> Toczy się niekończąca się bitwa między użytkownikami iPhone&#39;a i smartfonów z Androidem. Nawet ci, którzy nie biorą udziału w bitwie, wybrali strony tylko wybierając smartfon. </p> <p> W bitwie pojawiła się nowa zmarszczka, jak <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> PorównajMyMobile </a> przeprowadził niedawne badanie dotyczące tego, czy użytkownicy iPhone&#39;a lub Androida są lepszymi partnerami w relacjach. Jak się okazuje, użytkownicy iPhone&#39;a mają zwykle bardziej irytujące nawyki związane z telefonem niż użytkownicy Androida, co prowadzi do wniosku, że użytkownicy Androida są lepszymi partnerami. </p> <p> Oczywiście w danych jest coś więcej niż prosty wniosek, więc zanurkujmy trochę głębiej i przyjrzyjmy się. </p> <h2 id=\"iphone-and-android-relationship-study\"> Badanie relacji z iPhonem i Androidem </h2> <p> Ogólny wniosek z badania jest taki, że użytkownicy Androida są lepszymi partnerami niż użytkownicy iPhone&#39;a, ale wyniki idą znacznie głębiej niż ten powierzchowny wniosek. W sumie badanie objęło ponad 2000 użytkowników, więc oferuje dość dużą próbę. </p> <p> Analizując najbardziej irytujące nawyki dotyczące smartfonów, badanie wykazało, że użytkownicy iPhone&#39;ów byli o 12% bardziej narażeni na popełnienie przestępstwa niż ich odpowiednicy z Androidem. W rzeczywistości użytkownicy iPhone&#39;a popełnili więcej okrucieństw związanych z używaniem telefonu niż użytkownicy Androida w każdej kategorii ankiety. </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> Niektóre przykłady irytujących wykroczeń obejmują pozostawianie partnera do czytania, korzystanie z telefonu podczas filmu, a nawet korzystanie z telefonu podczas jazdy (co jest nie tylko irytujące, ale także niezwykle niebezpieczne). Użytkownicy iPhone&#39;a są jeszcze bardziej skłonni do upuszczania i łamania swoich telefonów niż użytkownicy Androida, co jest naprawdę zaskakującą statystyką. </p> <p> Niektóre inne irytujące nawyki to <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> skradanie się na cudzych profilach w mediach społecznościowych </a> , nadużywanie filtrów na zdjęciach, wysyłanie wielu jednowierszowych wiadomości (wiem, że robię to za dużo) i używanie telefonu podczas rozmowy. </p> <p> Co ciekawe, badanie wykazało również, że mężczyźni częściej niż kobiety wykonują większość irytujących (a w niektórych przypadkach wręcz niebezpiecznych) nawyków. </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> Ale użytkownicy Apple otrzymują więcej dat </h2> <p> Według innego badania opublikowanego przez CompareMyMobile użytkownicy iPhone&#39;ów częściej trafiają na randki w internetowych aplikacjach randkowych. Badanie, które obejmowało ponad 50 000 przeciągnięć, wykazało, że użytkownicy iPhone&#39;a są o 76 procent bardziej skłonni do umawiania się na randkę niż osoby z telefonem z Androidem podczas rozmowy przez aplikację randkową. </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> Jeśli wierzyć pierwszemu badaniu, związek może się nie udać, ponieważ użytkownik iPhone&#39;a skrada się na inne profile w mediach społecznościowych i wysyła wiadomości tekstowe podczas jazdy. Mimo to jest bardziej prawdopodobne, że znajdą następnego partnera, gdy poprzedni związek nie wypali. </p> <p> W końcu randkowanie nigdy nie jest łatwe. Więc postaraj się, aby Twój telefon nie stał się urządzeniem, które zabija dobre rzeczy! </p>"}