{"title":"Ogromna aktualizacja Microsoft Edge zmierza w twoją stronę","content":"<p> Microsoft bardzo ciężko pracuje nad tym, aby jego przeglądarka internetowa Edge była absolutnie najlepszą, jaką może być. Teraz firma wprowadza do niego trzy ważne funkcje, a przyszłość Edge&#39;a wygląda różowo. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Co Microsoft zaplanował dla Edge&#39;a? </h2> <p> Duża aktualizacja zderzaka została złapana przez <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Najnowsze Windows </a> . Trzy funkcje mają pojawić się w jednej dużej aktualizacji, więc warto mieć oko na Edge&#39;a w najbliższej przyszłości. </p> <p> Po pierwsze, Microsoft Edge otrzymuje obsługę widżetów internetowych. Te widżety to wygodny sposób na szybkie zapoznanie się z ważnymi informacjami w ciągu dnia. Gigant oprogramowania chce eksperymentować z widżetami o różnych kształtach i rozmiarach, ale postanowił zacząć od widżetu wiadomości, aby rozpocząć. </p> <p> Następnie Microsoft Edge otrzymuje funkcję wyszukiwania kart. Jeśli brzmi to znajomo, to prawdopodobnie dlatego, że przeczytałeś <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> wstępne spekulacje, że Edge otrzyma narzędzie do wyszukiwania zakładek </a> . Na szczęście ta spekulacja stała się rzeczywistością, a Microsoft planuje wprowadzić funkcję Chrome do Edge. </p> <p> Wreszcie będziesz mógł zarządzać wszystkimi rozszerzeniami Edge z jednego menu. Pojawi się jako element układanki na pasku zadań przeglądarki, a kiedy go klikniesz, pokaże Ci każde zainstalowane rozszerzenie wraz z szybkim sposobem włączania i wyłączania każdego z nich. </p> <p> Nie jest pewne, kiedy dokładnie ta aktualizacja zostanie wydana, ale system Windows Latest przypiął ją do „następnej dużej aktualizacji”. W związku z tym Microsoft Edge stanie się atrakcyjnym wyborem dla osób szukających czegoś nowego już niedługo. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: kolejna wielka rzecz? </h2> <p> Przez bardzo długi czas przeglądarki Microsoftu były uważane za zaawansowane menedżery pobierania do instalacji Chrome lub Firefox. Jednak odkąd Microsoft przyjął bazę kodu Chromium dla swojej przeglądarki, nie jest już pośmiewiskiem świata przeglądarek. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCounter </a> wymienia Microsoft Edge jako drugą najczęściej używaną przeglądarkę Windows w USA w momencie pisania. Wiedzieliśmy już, że Edge zostawił Firefoksa w kurzu, ale od tego czasu przepaść tylko się pogłębiła. </p> <p> Teraz Edge ma 5,25 procent udziału w rynku amerykańskim, w porównaniu do 3,35 procent, które posiada Firefox. Oba są dalekie od 45,83 procent w Chrome, ale to dopiero początek. </p> <p> W związku z tym, jeśli wcześniej kręciłeś nosem na przeglądarkę Microsoftu, teraz jest dobry moment, aby dać jej drugą szansę. Kto wie, być może przekona Cię najlepsza przeglądarka Microsoftu w historii! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Przesuwanie przeglądarki do krawędzi </h2> <p> Jeśli w przeszłości nie byłeś fanem przeglądarek Microsoftu, to dobry moment, aby wskoczyć i zobaczyć, o co tyle zamieszania. Trwają prace nad dużą aktualizacją i odtąd będzie tylko lepiej. </p> <p> Microsoft wie, że to zwycięska formuła. W rzeczywistości firma niedawno poinformowała, że ​​600 milionów ludzi na całym świecie korzysta z Edge&#39;a do przeglądania sieci. </p> <p> <small> Źródło: DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}