{"title":"Przeglądarka Edge firmy Microsoft była gospodarzem tajnych emulatorów gier Nintendo","content":"<p> Microsoft usunął serię nielegalnych emulatorów gier ukrywających się w swoim sklepie z rozszerzeniami przeglądarki Microsoft Edge. Sklep z rozszerzeniami Microsoft Edge zawierał dziesiątki emulatorów, które umożliwiały użytkownikom granie w kilka kultowych gier, z których żadna nie została legalnie opublikowana w sklepie. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft usuwa nielegalne emulatory rozszerzeń krawędzi </h2> <p> W sklepie z rozszerzeniami Microsoft Edge czaiły się jedne z najbardziej kultowych gier wszechczasów, w tym Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2, a nawet Minecraft. Każda gra uruchamiana w przeglądarce w oknie emulatora i pozwalała użytkownikom na pełne zagranie w każdy tytuł. </p> <p> Jednak żaden z klasycznych tytułów nie wymieniał oficjalnych twórców gier, takich jak Nintendo, Sega, Atari i tak — nawet Microsoft. Wymienione nazwy programistów obejmowały Gamelands, Kday i StayReal, z których wszystkie są całkowicie fikcyjne i nie mają linków do oryginalnych programistów. </p> <p> O dziwo, oficjalne konto Microsoft Edge Development na Twitterze, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , opublikowanej o emulatorach, która wydaje się promować gry dostępne w sklepie z rozszerzeniami przeglądarki. Nie złapaliśmy oryginalnego tweeta promującego emulatory, ale kopia jest dostępna przez <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Resetowanie </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> Czy emulatory są nielegalne? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Emulatory pozwalają na uruchamianie różnych programów </a> w Twoim komputerze. Możesz także użyć emulatora do grania w stare gry. </p> <p> Chociaż same emulatory nie są nielegalne, pobieranie treści chronionych prawem autorskim do odtwarzania na emulatorze jest. Tweet z oficjalnego konta Microsoft Edge Development był dziwnym posunięciem, ponieważ emulatory pobrały nową kopię ROM-u gry, aby użytkownik mógł grać. </p> <p> Temat porzucania oprogramowania też jest nieco szarą strefą. Gry Abandonware nie są już publikowane i nie są już dostępne w sprzedaży online lub w sklepie. Jednak w wielu przypadkach prawa autorskie do tych gier nie wygasły, ale właściciel praw autorskich nie egzekwuje swoich praw. </p> <p> </p> <p> W wielu przypadkach porzucone oprogramowanie jest nielegalne. Mimo to nie ma żadnych spraw sądowych związanych z porzucaniem oprogramowania, a przynajmniej nie ma żadnego związku z twórcą starych gier, który ścigał kogoś za pobranie tytułu porzuconego oprogramowania. </p> <p> W tym dokładnym przykładzie emulacja tych starych gier w przeglądarce internetowej jest nielegalna. Ponadto Nintendo jest znane z usuwania wszelkich witryn lub usług, które próbują powielać lub rozpowszechniać jej własność intelektualną. </p> <p> Obecnie gry zostały usunięte ze sklepu rozszerzeń Microsoft Edge. Co więcej, nie wiadomo jeszcze, w jaki sposób emulowane gry trafiły do ​​sklepu z rozszerzeniami ani kto je tam umieścił. Nie trzeba dodawać, że raczej nie wrócą. </p>"}