{"title":"Parler wraca do sieci po miesięcznym wyłączeniu","content":"<p> Po odrzuceniu przez Big Tech, Parler w końcu pojawił się w sieci. Platforma „wolności słowa” jest teraz dostępna dla obecnych użytkowników i wkrótce zacznie akceptować nowe rejestracje użytkowników w nadchodzących tygodniach. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler pojawia się ponownie po przerwie związanej z Big Tech </h2> <p> Parler powrócił po długiej przerwie w dostawie prądu. Alternatywna sieć społecznościowa zyskuje na popularności wśród konserwatystów politycznych i została <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> uruchomione przez Amazon Web Services (AWS), Google i Apple </a> po zamieszkach na Kapitolu. Parler został oskarżony o to, że nie robi wystarczająco dużo, aby moderować treści zawierające przemoc, co doprowadziło do ich usunięcia ze sklepów z aplikacjami i internetu. </p> <p> Zamiast AWS Parler używa teraz hosta o nazwie SkySilk. Witryna zarejestrowała również swoją nazwę domeny w Epik, rejestratorze obsługującym inne rodzaje sieci „wolności słowa”, takie jak Gab. </p> <p> Nowy host i rejestrator domen to nie jedyne zmiany wprowadzone przez Parler — Parler pojawił się nawet ponownie z nowym tymczasowym dyrektorem generalnym. To przychodzi później <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> zespół Parlera rzekomo zwolnił współzałożyciela Johna Matze </a> . </p> <p> Mark Meckler tymczasowo zastąpi Matze na stanowisku dyrektora generalnego, a wcześniej współtworzył prawicową grupę Tea Party Patriots. W oświadczeniu uzyskanym przez <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> Wzgórze </a> , Meckler ogłosił długo oczekiwany powrót Parlera, mówiąc: </p> <blockquote> <p> Kiedy w styczniu Parler został wyłączony przez tych, którzy pragną uciszyć dziesiątki milionów Amerykanów, nasz zespół zebrał się razem, zdeterminowany, aby dotrzymać obietnicy danej naszej wysoce zaangażowanej społeczności, że wrócimy silniejsi niż kiedykolwiek. Z radością witamy wszystkich z powrotem. </p> </blockquote> <p> Meckler kontynuował, zauważając, że Parler pozostanie oddany „wolności słowa, prywatności i dialogowi obywatelskiemu”. Zapewnił również użytkowników, że „Parler jest prowadzony przez doświadczony zespół i zostanie z nami”. </p> <p> Chociaż kopie zapasowe starszych kont na platformie są tworzone, starsze posty (lub „parleys”) nie zostały przywrócone. Jeśli masz już konto w Parler, możesz nadal korzystać z serwisu. W przeciwnym razie będziesz musiał poczekać około tygodnia, aż będziesz mógł się zarejestrować. </p> <p> Ale nawet jeśli masz już konto Parler, możesz napotkać pewne problemy techniczne podczas korzystania z platformy. Wygląda na to, że usługa nie została jeszcze w pełni przywrócona. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> Aplikacja Parler wciąż pozostaje w stanie zawieszenia </h2> <p> Parler jest nadal zablokowany w Google Play Store i Apple App Store, co może poważnie zaszkodzić jego bazie użytkowników. W obecnej sytuacji platforma może pozostać niedostępna na urządzeniach mobilnych przez nieznany czas. </p> <p> Prawdopodobnie nie będzie mógł wrócić do Sklepu Play lub App Store, chyba że zmieni swoje zasady moderowania, czego Parler prawdopodobnie odmówi. </p>"}