{"title":"Pokarm dla mózgu wielkości kęsa: 5 stron do nauki nowych rzeczy w krótkich i zabawnych sposobach","content":"<p> Dokumenty trwające mniej niż minutę. Odcinki podcastów trwające zaledwie 60 sekund. Animowane infografiki wyjaśniające złożone tematy. Tutaj możesz dowiedzieć się więcej o świecie w szybkich kapsułkach wciągającej wiedzy. </p> <p> W erze krótkiej koncentracji uwagi i 280 aktualizacji postaci, nawet nauka musi odbywać się w małych dawkach. Dlatego istnieją twórcy treści, którzy specjalizują się w tworzeniu materiałów informacyjnych i rozrywkowych, które w naszym zabieganym życiu prawie nie zabierają czasu. Od mini-dokumentów o fascynujących ludziach i tematach po przewodniki w mediach społecznościowych na popularne tematy — podaruj swojemu umysłowi trochę kęsowego pokarmu dla mózgu do przeżuwania. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 60 sekund dokumentów </a> (Sieć): Profile interesujących osób i tematów w 60 sekund </h2> <p> </p> <p> Masz minutę? 60 Second Docs ma fajną historię do opowiedzenia o interesującej osobie, a co za tym idzie, fajny temat. Każdy dokument trwa tylko 60 sekund, ale zawiera najlepsze rzeczy, które musisz wiedzieć na dany temat. </p> <p> Najfajniejsze jest to, że 60 Second Docs skupia się na profilach prawdziwych ludzi, a nie na koncepcjach czy trendach. Zwykle ta osoba robi coś wyjątkowego, niezależnie od tego, czy rozpoczyna nowy trend, odkrywa nowy temat, czy w jakiś sposób przesuwa granice. Robiąc to o osobie, nie tylko zyskujesz lepszy wgląd w ludzki aspekt unikalnego tematu, ale także czujesz się bardziej realny i emocjonalny. </p> <p> Wszystkie 60 Second Docs są dostępne na ich kanale YouTube lub w mediach społecznościowych. Dobrym pomysłem jest śledzenie ich w dowolnej sieci społecznościowej, którą często odwiedzasz, oglądając każdy nowy film w całości za każdym razem, gdy publikują aktualizację. </p> <p> Jeśli lubisz dłuższe filmy dokumentalne, sprawdź <strong> Oficjalny wybór </strong> w witrynie 60 Second Docs. Tutaj redaktorzy wybierają 10-20 minutowe filmy dokumentalne, które inni nakręcili, na tematy, które ich zdaniem powinieneś obejrzeć. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Więc chcesz o tym porozmawiać </a> (Instagram): Miniprzewodniki po tematach politycznych i społecznych </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> Kto wiedział, że w świecie wpływowych selfie i promowanych przez markę hashtagów Instagram zapewni platformę do edukacji? So You Want To Talk About (Sywtta) wykorzystuje formaty postów z wieloma obrazami na Instagramie do tworzenia mini-przewodników na tematy polityczne i społeczne. </p> <p> Tematy, które wybiera Sywtta, zwykle dotyczą popularnych tematów, takich jak anulowanie pożyczek studenckich, prawa i historia czarnych, błędy logiczne, szczepionki przeciw COVID-19 i wiele innych. Każdy slajd wykorzystuje pięknie sformatowaną typografię, aby pouczyć Cię na dany temat, a ponadto każdy slajd jest sam w sobie jak mini-lekcja. Każdy przewodnik staje się szybkim i pouczającym kursem przyspieszonym, bez zbytniego obciążania danymi. </p> <p> W czasie, gdy musisz być czujny <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> stronnicze lub fałszywe wiadomości </a> , ważne jest również, aby zwrócić uwagę na filozofię tego, co czytasz. W polityce Sywtta propaguje poglądy polityki postępowej i lewicowej. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> 60-sekundowa nauka </a> (Podcast): Krótkie objaśnienia audio dotyczące nauki, zdrowia i technologii </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Jeśli wolisz słuchać swoich informacji niż czytać lub oglądać, sprawdź podcast 60-Second Science. Ten codzienny podcast, stworzony przez zespół Scientific American, porusza tematy związane z nauką, medycyną i technologią i w krótkim czasie wyjaśnia jeden temat. Chociaż nie ogranicza się już do minutowego limitu czasu, każdy odcinek trwa poniżej pięciu minut. </p> <p> Każdy podcast ma różnych gospodarzy z zespołu Scientific American, obejmujących tematy takie jak COVID, zwierzęta i ptaki, DNA i medycyna, nauka o środowisku itp. Cieszą się one wysoką wartością produkcji, zawierają dźwięki ze świata rzeczywistego dotyczące punktu dyskusji i często dodają klipy głosowe od ekspertów. </p> <p> Aby przeglądać archiwa poprzednich odcinków, wejdź na oficjalną stronę 60-Second Science. Tutaj możesz filtrować odcinki według tematu (zdrowie, umysł, zrównoważony rozwój, technologia, nauki ścisłe). Jeśli nie chcesz otrzymywać informacji w krótkich seriach, wypróbuj pełny podcast Science Talk. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Animagrafy </a> (Sieć): Wysokiej jakości animowane infografiki wyjaśniające różne rzeczy </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> Jak działa kryptowaluta? Jakie są tajniki ubezpieczenia samochodu? Jak robisz moonwalk? Projektant i animator Jacob O&#39;Neal dzieli złożone tematy na proste wyjaśnienia i rysuje wysokiej jakości animowane infografiki, aby je zilustrować. </p> <p> Animagraffs to zbiór krótkich wyjaśnień za pomocą przewodników wizualnych, wykorzystujących animowane pliki GIF. Jacob używa różnych technik projektowania, takich jak widoki przekrojów, aby zilustrować każdą część instrumentu, lub duże obrazy z ruchomymi częściami, które można powiększać i pomniejszać, tak jak Mapy Google. Każdy styl pasuje do przedmiotu, którego się uczysz. </p> <p> Tematy mają również szeroki zakres, w tym jak biega gepard, jak działają samochody elektryczne, jak głośnik wydaje dźwięk i tak dalej. Warto też zajrzeć do sekcji „Praca z klientem”, gdzie Jacob prezentuje płatne zlecenia dla marek. Nie martw się, mimo że są to reklamy, są jednak pouczające i zabawne. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Świetna wielka historia </a> (YouTube): Fascynujące i interesujące prawdziwe krótkie filmy dokumentalne </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story zakończył działalność pod koniec 2020 roku, ale nie wcześniej niż pozostawił pięć lat wspaniałych krótkich filmów dokumentalnych. Zanurz się w archiwach, aby znaleźć około 5-minutowe filmy na wiele interesujących tematów i fascynujących ludzi z całego świata. </p> <p> Od filmu wyświetlanego w indyjskim kinie przez 24 lata po niesamowite tureckie lody, które się nie topią, każdy krótki film to wysokiej jakości i dobrze zbadane spojrzenie na temat. W odróżnieniu od większości innych tego typu filmów, twórcy filmów Great Big Story często podróżują po świecie, aby znaleźć się w samym środku historii. Sortuj według najpopularniejszych lub korzystaj z różnych niestandardowych list odtwarzania polecanych przez twórców. </p> <p> Na kanale znajdziesz też dłuższe filmy, trwające od 10 do 15 minut. Są to zazwyczaj listy i kompilacje, które zawierają kilka klipów z krótszych filmów. Jeśli masz czas, aby dowiedzieć się więcej o otaczającym nas świecie, nie możesz się z tym pomylić. Nawet po opuszczeniu okiennic, Great Big Story jest jedną z najbardziej <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> fascynujące i edukacyjne kanały na YouTube </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Korzystaj z nauki kroplowej, aby podbijać duże przedmioty </h2> <p> Te strony internetowe i podcasty skupiają się na przekształcaniu każdego nowego tematu w kompaktowy i zabawny pakiet informacji. To dobry sposób na naukę nowych rzeczy małymi kęsami. Ale możesz również zastosować tę samą filozofię do nauki o bardziej złożonych i większych przedmiotach. </p> <p> Coraz częściej drip learning lub microlearning jest popularnym sposobem zdobywania wykształcenia. Otrzymując <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> lekcje na krótki kęs każdego dnia . </a> , możesz zająć się takimi tematami, jak programowanie, projektowanie, tworzenie aplikacji, zarządzanie produktami i nie tylko. Szybkie wyszukiwanie w Internecie powinno pomóc Ci znaleźć wersję do nauki kropli tego, w czym chcesz się edukować. </p>"}