{"title":"Rząd USA chce wiedzieć o dokładności etykiet prywatności aplikacji","content":"<p> Dzięki etykietom prywatności aplikacji iOS 14 w App Store, Apple daje użytkownikom nowy sposób na zwiększenie możliwości dzięki większej wiedzy o aplikacjach, z których korzystają – i o tym, jak te aplikacje mogą je śledzić. </p> <p> Wygląda jednak na to, że potencjalnie otworzył dla siebie puszkę robaków, ponieważ Apple jest teraz zmuszany do ręczenia za dokładność tych etykiet, które programiści zaczęli przesyłać do Apple w grudniu. </p> <h2 id=\"concerns-over-accuracy\"> Obawy dotyczące dokładności </h2> <p> Jak zauważył <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacPlotki </a> , Apple otrzymało <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> list </a> od amerykańskiej Komisji ds. Energii i Handlu, prosząc o wyjaśnienie informacji na temat dostarczonych przez programistów dokładności etykiet prywatności aplikacji. </p> <p> Etykiety te są niecierpliwie oczekiwaną w niektórych kwartałach, budzącą strach w innych cechą systemu iOS 14, która zmusi programistów do większej otwartości w zakresie interakcji ich aplikacji z danymi użytkownika. Oznacza to, że użytkownicy będą mogli podjąć bardziej świadomą decyzję, jeśli chodzi o korzyści i wady korzystania z niektórych aplikacji. </p> <p> </p> <p> W swoim piśmie Komisja ds. Energii i Handlu Izby Reprezentantów USA pyta Apple o raporty sugerujące, że niektóre etykiety prywatności aplikacji mogą dostarczać użytkownikom „mylące i fałszywe” informacje. Jest to oparte na raporcie opublikowanym w zeszłym miesiącu, w którym twierdzi się, że wiele aplikacji, które otrzymały czysty rachunek zdrowia, może nie być tak niewinne, jak sugerują. </p> <p> Potencjalnym problemem z funkcją iOS 14 jest to, że opiera się ona na uczciwości programistów, aby powiedzieć, w jaki sposób są gromadzone dane, a także potwierdzić, że te informacje są dokładne. Sam Apple zauważa, że ​​informacje „nie zostały zweryfikowane przez Apple”. </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Żądanie odpowiedzi od Apple </h2> <p> Chociaż wydaje się prawdopodobne, że większość programistów będzie grać uczciwie i przestrzegać systemu honoru, nie jest to coś, co można brać za pewnik. Apple będzie rutynowo kontrolować wysyłane informacje. Jednak ogromna liczba aplikacji w App Store uniemożliwia Apple osobistą weryfikację każdego wpisu. </p> <p> List Amerykańskiej Komisji ds. Energii i Handlu kontynuuje, że: </p> <blockquote> <p> „Wzywamy Apple do poprawy ważności etykiet prywatności aplikacji, aby zapewnić konsumentom istotne informacje na temat praktyk dotyczących danych ich aplikacji oraz aby konsumenci nie zostali poszkodowani przez te potencjalnie oszukańcze praktyki”. </p> </blockquote> <p> Komisja zwróciła się do Apple o podanie bardziej szczegółowych informacji na temat procesu audytu, tego, czy etykiety prywatności aplikacji zostaną poprawione, jeśli okażą się nieprawdziwe, szczegółów dotyczących tego, co się stanie, gdy programiści podadzą niedokładne informacje i nie tylko. </p> <p> Proszą Apple o udzielenie żądanych informacji do 23 lutego. </p> <p> <small> Źródło: Jason Dent/ <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Odblokuj CC </a></small> </p>"}