{"title":"Roku chce, aby Twoje myśli były na swoim pilocie z możliwością ładowania","content":"<p> Roku rekrutuje kilka osób, które dołączą do programu wczesnego dostępu, aby przetestować nowy pilot (zwany Roku Voice Remote Pro), który jest wyposażony w akumulator. </p> <p> Jest to oferta ograniczona czasowo do wyczerpania zapasów, ale nadal musisz zapłacić za pilota. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> Co to jest Roku Voice Remote Pro? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> Wreszcie pilot z akumulatorem </a> z <a href=\"https://www.reddit.com/r/Roku/\"> Roku </a> </blockquote>  <p> Jako pierwszy zauważony przez użytkownika Kingtut206 w dniu <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , Roku rekrutuje ludzi do swojego programu wczesnego dostępu w celu przetestowania nowego pilota o nazwie Roku Voice Remote Pro. </p> <p> Nowy pilot jest wyposażony w akumulator, zgubiony pilot (na przykład możesz powiedzieć „Hej Roku, znajdź mój pilot”), zestaw głośnomówiący i przyciski skrótów osobistych obok standardowych przycisków markowych. </p> <p> Zgodnie z raportem <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> Pogranicze </a> , pilot ładuje się przez micro-USB, a nie przez znacznie lepszy USB-C. Być może opinie zebrane w ramach programu wczesnego dostępu potwierdzą to. </p> <p> Uczestnictwo w programie odbywa się wyłącznie za zaproszeniem, choć nie wiadomo, co kwalifikuje Cię do udziału w programie. </p> <p> Pilot kosztuje 29,99 USD i ma zostać dostarczony 19 lutego 2021 r. </p> <p> Sprzedanych zostanie tylko 2000 sztuk, a Roku zbierze informacje zwrotne na temat twoich doświadczeń z pilotem. Po tym czasie możemy założyć, że pilot zostanie dopracowany przed potencjalnym wprowadzeniem do powszechnej sprzedaży. </p>"}