{"title":"Raport: Android 12 będzie wyposażony w tryb jednoręczny","content":"<p> Oficjalnie osiągnęliśmy fazę cyklu życia Androida 11, w której plotki o Androidzie 12 zaczynają wychodzić z pełną mocą. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> Programiści XDA </a> poinformował, że Google pracuje nad trybem jednoręcznym dla Androida 12, który znacznie ułatwi nawigację po telefonie jedną ręką. Niezależnie od tego, czy masz duże, czy małe dłonie, może to otworzyć zupełnie nowy sposób interakcji z urządzeniem z Androidem. </p> <p> Oczywiście wielu producentów urządzeń i <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> twórcy oprogramowania wprowadzili rozwiązania poprawiające jednoręczną użyteczność </a> . Mimo to korzystanie z niego będzie znacznie przyjemniejsze, gdy zostanie zintegrowane bezpośrednio z systemem operacyjnym. </p> <h2 id=\"android-12-s-one-handed-mode\"> Tryb jednoręczny Androida 12 </h2> <p> Według raportu Google planuje dodać funkcję obsługi jedną ręką do AOSP, który jest wersją Androida o otwartym kodzie źródłowym, z której mogą korzystać wszyscy twórcy oprogramowania na swoich urządzeniach. Oznacza to również, że producenci OEM, którzy jeszcze nie opracowali własnego trybu jednoręcznego, będą mieli łatwy sposób na zaimplementowanie tej funkcji na swoich urządzeniach. </p> <p> Raport nie wskazywał, czy Google wymagałoby od producentów telefonów korzystania z funkcji jednoręcznej Androida 12, czy byłoby to opcjonalne. </p> <p> Ponieważ jest jeszcze niesamowicie wcześnie, nie wiemy dokładnie, jak będzie działał tryb jednoręczny Androida 12. Jeśli wcześniejsza zdolność Google do dodawania funkcji do systemu operacyjnego jest jakąkolwiek wskazówką, oczekujemy, że firma wykona dobrą robotę przy wdrażaniu. Google może zmniejszyć cały ekran do rogu urządzenia, aby był do niego łatwy dostęp. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> Raport wskazuje również, że tryb jednoręczny Androida 12 będzie mógł go uruchomić za pomocą tradycyjnego trybu z trzema przyciskami wraz z nowszym trybem nawigacji gestami. </p> <p> Jak wspomniano, wielu producentów smartfonów już wdrożyło tę funkcję we własnej zmodyfikowanej wersji Androida. Na przykład Huawei faktycznie próbował przesłać swoją wersję funkcji do AOSP, ale Google ją odrzucił. Być może Google odrzucił to, ponieważ firma wiedziała, że ​​zamierza wprowadzić własną wersję samej funkcji. </p> <p> Ponieważ ten wyciek jest tak wczesny, żadne zdjęcia nie pokazują jeszcze tej funkcji, więc będziemy musieli poczekać, aż Android 12 zbliży się do premiery. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Kiedy zostanie wydany Android 12? </h2> <p> Niestety nie wiemy dokładnie, kiedy Android 12 pojawi się publicznie (choć nie będzie to przez jakiś czas). Nie wiemy też dokładnie, kiedy ta funkcja zostanie udostępniona programistom lub w wersji beta lub stabilnej wersji Androida. </p> <p> Jak zawsze w przypadku nowych funkcji Androida, będziemy musieli poczekać i zobaczyć, czy w ogóle chodzi o system operacyjny. </p>"}