{"title":"Spotify testuje teksty na żywo w USA","content":"<p> Czy lubisz śpiewać do ulubionych utworów Spotify, ale zawsze musisz sprawdzić tekst, aby upewnić się, że Twoje karaoke jest dokładne? Masz szczęście. Spotify testuje teraz funkcję tekstów na żywo dla niektórych osób w USA. </p> <h2 id=\"spotify-rolls-out-real-time-lyrics\"> Spotify wypuszcza teksty w czasie rzeczywistym </h2> <p> Jeśli mieszkasz w Stanach Zjednoczonych, możesz zobaczyć nową funkcję Spotify, która umożliwia wyświetlanie w czasie rzeczywistym tekstów piosenek z odtwarzaną muzyką. Teksty są dostarczane przez firmę muzyczną Musixmatch. </p> <p> „Moc” jest tam kluczowym słowem, ponieważ jest to wciąż w fazie testowej. Oznacza to, że tylko grupa użytkowników zobaczy tę funkcję, podczas gdy Spotify mierzy jej wpływ. Nie wiadomo, ilu użytkowników tworzy grupę testową. </p> <p> Teksty były od dawna poszukiwaną funkcją Spotify, więc byłoby zaskakujące, gdyby ta funkcja nie została w końcu udostępniona wszystkim, ale nic nie jest pewne. </p> <p> W e-mailu do <a href=\"https://www.engadget.com/spotify-live-lyrics-united-states-test-ios-android-140045159.html\" target=\"_blank\" rel=\"nofollow noopener\"> Engadżet </a> , rzecznik Spotify powiedział: </p> <blockquote> <p> Możemy potwierdzić, że obecnie testujemy naszą funkcję tekstów dla wybranej liczby użytkowników w Stanach Zjednoczonych. W Spotify rutynowo przeprowadzamy szereg testów, aby poprawić komfort użytkowania. Niektóre z tych testów torują drogę dla naszego szerszego doświadczenia użytkownika, a inne służą jedynie jako ważna nauka. W tej chwili nie mamy żadnych dalszych wiadomości do udostępnienia. </p> </blockquote> <p> </p> <h2 id=\"are-lyrics-new-for-spotify\"> Czy teksty piosenek są nowe w Spotify? </h2> <p> Ściśle mówiąc, teksty w czasie rzeczywistym nie są nową funkcją. To dlatego, że jest dostępny w krajach takich jak Brazylia, Meksyk, Indie i Singapur od czerwca 2020 roku. </p> <p> W rzeczywistości, na długo wcześniej Spotify miał funkcję tekstów na żywo na całym świecie. Było to również wynikiem partnerstwa z Musixmatch, choć funkcja została bezceremonialnie usunięta, gdy umowa między obiema firmami dobiegła końca. </p> <p> Następnie Spotify zastąpił go integracją z Genius, w funkcji o nazwie „Behind the Lyrics”, która wyświetla informacje i zabawne fakty dotyczące niektórych utworów. Jest to również coś, co jest dostępne w Apple Music, która sama obsługuje również teksty na żywo. </p> <p> Engadget informuje, że „Behind the Lyrics” zostanie usunięte z Spotify, jeśli funkcja tekstów na żywo zostanie udostępniona szerzej. Prawdopodobnie nie zostanie to pominięte przez wielu. </p> <p> Dla osób w regionach, które nie mają jeszcze tekstów na żywo, istnieje możliwość: <a href=\"https://www.makeuseof.com/tag/lyrics-currently-playing-songs-spotify/\" target=\"_blank\" rel=\"nofollow noopener\"> użyj innych aplikacji, aby wyświetlić teksty w Spotify </a> . </p> <p> Oczywiście możesz również skorzystać z jednej z wielu witryn z tekstami w Internecie, ale nie będą one wyświetlane w czasie odtwarzania muzyki Spotify. </p>"}