{"title":"Twitter oznacza konta osobiste urzędników państwowych","content":"<p> Twitter wkrótce zacznie umieszczać etykiety na kontach osobistych urzędników państwowych. Etykiety mają pomóc użytkownikom łatwo zidentyfikować osoby związane z rządem. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Więcej urzędników państwowych otrzyma etykietę na Twitterze </h2> <p> Według postu na <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> blog na Twitterze </a> , platforma zacznie oznaczać konta osobiste „głowy państw” 17 lutego 2021 r. Etykiety zostaną również umieszczone na kontach związanych z mediami państwowymi. </p> <p> Twitter rozszerza również zasięg swoich etykiet, aby objąć urzędników państwowych w większej liczbie krajów. Te lokalizacje to Kanada, Kuba, Ekwador, Egipt, Niemcy, Honduras, Indonezja, Iran, Włochy, Japonia, Arabia Saudyjska, Serbia, Hiszpania, Tajlandia, Turcja i Zjednoczone Emiraty Arabskie. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Źródło obrazu: Twitter </p> <p> Platforma ma nadzieję, że etykiety te pomogą użytkownikom „być bardziej świadomym doświadczeniem na Twitterze”, a także planuje ulepszyć tekst etykiety, aby „dodać więcej szczegółów” poprzez „rozróżnienie między osobami i instytucjami”. </p> <p> Pierwsza fala etykiet Twittera dla kont powiązanych z rządem została wprowadzona w sierpniu 2020 r. Początkowo etykiety te dotyczyły tylko urzędników związanych z pięcioma krajami w Radzie Bezpieczeństwa ONZ i nie obejmowały osobistych kont tych urzędników. </p> <p> To powiedziawszy, te etykiety nie są <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> rażące ukłucie w dezinformację </a> , ale nadal pomogą użytkownikom uzyskać więcej kontekstu na temat tego, co czytają i od kogo to pochodzą. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter będzie tylko dalej rozwijał swoje etykiety </h2> <p> Pod koniec swojego wpisu na blogu Twitter zauważył, że ma nadzieję rozszerzyć swoje etykiety na „dodatkowe kraje z biegiem czasu”. Etykieta pojawia się jako jasnoszara flaga na profilu użytkownika na Twitterze i prawdopodobnie w nadchodzących tygodniach będziesz się z nią częściej spotykać. </p>"}