{"title":"Volkswagen użyje Microsoft Azure w samochodach autonomicznych","content":"<p> Microsoft chce wejść na rynek samochodów autonomicznych, ale nie ma żadnego doświadczenia w projektowaniu i budowie samochodu. Może jednak dostarczyć mózgi inteligentnego samochodu, a Volkswagen jest zainteresowany wykorzystaniem usług Microsoftu dla własnych pojazdów. </p> <h2 id=\"microsoft-and-volkswagen-s-partnership-for-automatic-cars\"> Partnerstwo Microsoftu i Volkswagena na rzecz samochodów automatycznych </h2> <p> Wiadomość o tym partnerstwie rozeszła się dalej . <a href=\"https://www.reuters.com/article/us-microsoft-volkswagen/volkswagen-taps-microsofts-cloud-to-develop-self-driving-software-idUSKBN2AB0SZ\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> . Volkswagen prosi Microsoft, aby pomógł mu wkroczyć w świat autonomicznych samochodów. . </p> <p> Volkswagen posiada kilka różnych firm samochodowych, takich jak Audi, Porshe i Lamborghini. Problem polegał na tym, że inżynierowie w każdej firmie podążali własną drogą w kierunku zaprojektowania autonomicznego samochodu, zamiast wymieniać się informacjami. </p> <p> Aby rozwiązać ten problem, Volkswagen umieścił wszystkich swoich inżynierów zajmujących się samochodami autonomicznymi w jednej dużej grupie o nazwie Car.Software. Pomysł polegał na tym, aby grupa mogła się zjednoczyć i stworzyć jedną platformę inteligentnych samochodów, z której Volkswagen mógłby korzystać we wszystkich swoich samochodach. </p> <p> Jednak, jak się okazało, różni inżynierowie w Car.Software nadal używali różnych platform do tworzenia swojego kodu. W związku z tym Volkswagen zwrócił się do Microsoftu o pomoc w zapewnieniu każdemu podstawowej platformy do pracy. </p> <p> Nie oznacza to, że samochody Volkswagena korzystają z systemu Windows 10. Microsoft ma inną platformę o nazwie Azure, która jest przeznaczona do łączenia urządzeń Internetu rzeczy (IoT). </p> <p> Jeśli brzmi to znajomo, to dlatego, że jest to ta sama usługa, która <a href=\"https://www.makeuseof.com/microsoft-powered-self-driving-car/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft zaoferował Cruise&#39;owi autonomiczne samochody </a> . Teraz jest jasne, że umowa z rejsem nie była jednorazową umową; Firma Microsoft poważnie podchodzi do kwestii uruchamiania samochodów na platformie Azure. . </p> <p> Biorąc pod uwagę, jak dobrze Azure działa dla Microsoftu, nic dziwnego, że gigant oprogramowania chce uderzać, gdy żelazko jest gorące. Połączenie usług Microsoft Azure i Xbox ma <a href=\"https://www.makeuseof.com/microsoft-reveals-record-profits/\" target=\"_blank\" rel=\"nofollow noopener\"> przyniosła firmie porządny zysk podczas pandemii </a> . </p> <p> W związku z tym istnieje ogromna zachęta do wprowadzenia platformy Azure do autonomicznych samochodów, aby jeszcze bardziej zaistnieć w świecie inteligentnych urządzeń. To, czy Azure stanie się głównym graczem w świecie inteligentnych samochodów, dopiero się okaże. </p> <p> </p> <h2 id=\"starting-the-engine-for-microsoft-azure\"> Uruchamianie silnika dla Microsoft Azure </h2> <p> Microsoft Azure już teraz generuje ogromne pieniądze dla giganta technologicznego, co oznacza, że ​​firma jest w doskonałej pozycji do rozgałęziania się na nowe terytoria. Autonomiczne samochody Cruise i Volkswagena będą wykorzystywać Microsoft Azure jako podstawę, która może potencjalnie stać się znaczącym graczem w przyszłości samochodów. </p> <p> Dziwnym zrządzeniem losu stara rywalizacja między Microsoftem a Apple przenosi się do świata inteligentnych samochodów. Zamiast dostarczać producentom samochodów tylko „inteligentną” część, Apple zamierza produkować kompletne „Apple Cars” do 2024 roku. </p> <p> <small> Źródło zdjęcia: Andrey Suslov / <a href=\"https://www.shutterstock.com/image-vector/autonomous-smart-car-scans-road-operates-635238704\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}