{"title":"VW twierdzi, że Apple nie będzie miał łatwej jazdy w przemyśle samochodowym","content":"<p> Herbert Diess, dyrektor generalny Volkswagen Group, bagatelizował jakikolwiek potencjalny wpływ samochodu Apple na przemysł motoryzacyjny, mówiąc, że VW „nie boi się” Project Titan. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW „Nie boi się” Apple Car </h2> <p> Chociaż Diess przyznaje, że samochód marki Apple może rzeczywiście mieć sens, nie sądzi, by Apple mogło zdominować rynek motoryzacyjny „z dnia na dzień” z powodu intensywnej konkurencji. Zasugerował, że cięcie stali i sprzedaż samochodów wybrednym konsumentom to trudny biznes, dodając, że nie jest to dziedzina, którą każda firma może „przejąć za jednym zamachem”. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> przekazuje to, co Diess powiedział Frankfurter Allgemeine Sonntagszeitung w wywiadzie: </p> <blockquote> <p> Przemysł samochodowy nie jest typowym sektorem technologicznym, który można by przejąć za jednym zamachem. Apple nie poradzi sobie z tym z dnia na dzień. Mimo to nie boimy się. </p> </blockquote> <p> Mimo to pojazd marki Apple miałby sens, biorąc pod uwagę kompetencje Apple w zakresie baterii, oprogramowania, wzornictwa przemysłowego i jego pozornie nieskończonych zasobów, dodał dyrektor. Apple nie oferuje żadnych produktów związanych z samochodami oprócz <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Oprogramowanie deski rozdzielczej CarPlay </a> który pozwala radio samochodowemu lub jednostce głównej działać jako wyświetlacz i kontroler dla iPhone&#39;a. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> Najgorzej strzeżony sekret w branży </h2> <p> Plany dotyczące Projektu Tytan (wewnętrzna nazwa kodowa samochodu Apple) nadal nie są upublicznione pomimo lawiny ostatnich plotek <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple chciał nawiązać współpracę z Hyundai/Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Mówi się, że Apple rozmawiał z innymi firmami motoryzacyjnymi </a> oraz producentów kontraktowych – w tym Magna, Nissan i Foxconn – o zbudowaniu autonomicznego pojazdu. Źródła podają, że w samochodzie Apple Car może brakować kierownicy, ponieważ może początkowo <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> skupić się na dostawach żywności i operacjach robotaxi </a> przed sprzedażą konsumentom. </p> <p> </p> <p> Największym wnioskiem płynącym z komentarza Herberta jest to, że przemysł motoryzacyjny przywiązuje dużą wagę do Projektu Tytan. Najwyraźniej sama myśl o wejściu Apple do tego sektora denerwuje niektórych czołowych menedżerów. To powiedziawszy, historia jest pełna ludzi, którzy powinni byli wiedzieć lepiej niż wyśmiewać Apple za wejście do nowej kategorii produktów. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Jak dyrektor generalny Palm wyśmiewał iPhone&#39;a </h2> <p> Najlepszym tego przykładem jest były dyrektor generalny Palm, Ed Colligan. Zaledwie kilka tygodni przed wprowadzeniem oryginalnego iPhone&#39;a w 2007 roku, Colligan wyśmiał pomysł, że firma znana z projektowania ładnych komputerów może zdobyć klientów w konkurencyjnym sektorze smartfonów, mówiąc: </p> <blockquote> <p> Nauczyliśmy się i walczyliśmy przez kilka lat, zastanawiając się, jak zrobić przyzwoity telefon. Faceci od komputerów nie zamierzają tego po prostu rozgryźć. Nie wejdą po prostu. </p> </blockquote> <p> Podobnie do tego, jak Colligan określił Apple jako „człowieka od komputerów PC”, szef Volkswagena próbuje zbagatelizować pogląd, że firma technologiczna może pozyskać klientów w branży motoryzacyjnej. Historia pokaże, czy komentarz Herberta zestarzeje się lepiej niż Colligana. </p>"}