{"title":"Wejdź w trzeci wymiar: praca z przepływami pracy 3D w Adobe After Effects","content":"<p> Jeśli chcesz ulepszyć przepływ pracy Adobe After Effects, w końcu będziesz musiał zająć się osią Z, która pozwoli Ci manipulować głębią 3D obiektu. </p> <p> To otwiera szereg nowych wizualizacji i stylów, z którymi możesz pracować, ale także tworzy własne zestawy ograniczeń i rozważań. </p> <p> W tym artykule omówimy, jak włączyć i pracować z warstwami 3D, a także jak dodawać i animować kamery 3D w celu tworzenia dynamicznych ruchów. Zbadany zostanie również scenariusz, w którym animujemy i przenosimy tekst w przestrzeni 3D. </p> <p> Wskakujmy! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> Jak włączyć i animować warstwy 3D </h2> <p> W swojej kompozycji możesz przełączać warstwy na osi czasu, aby włączyć je jako 3D. </p> <p> To bardzo prosty proces. Po prostu znajdź <strong> Sześcian </strong> ikonę warstw na osi czasu i kliknij pole pod nią, aby włączyć 3D dla tej warstwy. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> Gdy to zrobisz, prawdopodobnie nie zobaczysz żadnych natychmiastowych zmian. Jeśli jednak przejdziesz do parametrów pozycji, skali i obrotu w swojej warstwie, zobaczysz, że pojawił się trzeci zestaw regulowanych liczb. </p> <p> Te nowe liczby dyktują teraz obrót, pozycję i skalę na osi Z w przestrzeni 3D. Podobnie jak w przypadku innych parametrów, mogą one być klatkami kluczowymi umożliwiającymi animację i manipulację. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> Jako przykład utwórzmy kompozycję i warstwę tekstową z kilkoma słowami. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Gdy to zrobisz, włącz warstwę 3D. Pamiętaj, że jeśli planujesz użyć <strong> Wyrównać </strong> narzędzie, aby zapewnić idealne wyśrodkowanie warstwy, musisz to zrobić przed włączeniem 3D. Dzieje się tak, ponieważ <strong> Wyrównać </strong> narzędzie działa tylko na warstwach 2D. </p> <p> Teraz, gdy nasza warstwa tekstowa jest warstwą 3D, możemy przesuwać ją w przestrzeni 3D wzdłuż osi Z. Niech więc tekst przesunie się „w stronę ekranu”. </p> <p> Najpierw ustawimy nasz parametr osi Z. Domyślnie jest ustawiony na zero. Ustawmy to na <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Teraz przejdziemy dwie sekundy w dół naszej osi czasu i ustawimy wartość osi Z na <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> Po tej zmianie powinniśmy teraz zobaczyć, jak tekst przesuwa się „w kierunku” ekranu. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> Czym są kamery 3D? </h2> <p> Z powodzeniem animowaliśmy obiekt w przestrzeni 3D w After Effects. Ale co, jeśli masz wiele obiektów i chcesz stworzyć wrażenie widza zbliżającego się do nich lub oddalającego się od nich? </p> <p> Mógłbyś po prostu animować każdy pojedynczy element, aby zbliżał się do Ciebie, ale byłoby to bardzo czasochłonne i niezbyt wydajne. Tutaj użyjesz kamery 3D. </p> <p> </p> <p> Jeśli korzystasz z oprogramowania 3D, takiego jak Cinema 4D lub Blender, prawdopodobnie używałeś wcześniej kamer 3D. Jeśli kiedykolwiek grałeś w grę komputerową, zetknąłeś się również z kamerą 3D, która przesuwa Twój widok w świecie 3D. </p> <p> Na pierwszy rzut oka to wszystko może wydawać się skomplikowane, ale kamery 3D działają tak samo, jak prawdziwe kamery. Dają pole widzenia, które można manipulować i przesuwać w przestrzeni 3D. </p> <p> Popracujmy nad przykładem. </p> <h3 id=\"setting-up-a-3d-camera\"> Konfigurowanie kamery 3D </h3> <p> Aby rozpocząć, utwórz kilka warstw tekstu 3D i umieść je kolejno wzdłuż osi Z. </p> <p> W tym przykładzie luka <strong> 3000 pikseli </strong> między każdą warstwą został użyty. Pierwsza warstwa to zero, następna 3000, następna 6000 i tak dalej. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Teraz nadszedł czas, aby stworzyć kamerę 3D, klikając <strong> Warstwa </strong> &gt; <strong> Nowy </strong> &gt; <strong> Aparat fotograficzny </strong> , na którym zobaczysz okno, w którym możesz dostosować ustawienia nowej warstwy kamery. Występują w dwóch rodzajach: <strong> Jeden węzeł </strong> i <strong> Dwa węzły </strong> . </p> <p> <strong> Jeden węzeł </strong> Kamera została zaprojektowana tak, aby jak najdokładniej obsługiwać i emulować kamerę ze świata rzeczywistego, a punkt ostrości jest wyznaczany ręcznie przez ruch kamery. </p> <p> ZA <strong> Dwuwęzłowy </strong> Kamera została zaprojektowana do śledzenia pojedynczego punktu zainteresowania, dzięki czemu idealnie nadaje się do orbitowania lub śledzenia obiektu w ruchu. </p> <p> W tym scenariuszu <strong> Jeden węzeł </strong> zostanie użyty aparat. W oknie zauważysz szereg dodatkowych ustawień, takich jak <strong> Powiększenie </strong> , <strong> Kąt widzenia </strong> , <strong> Włącz głębię ostrości </strong> , i <strong> Długość ogniskowa </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Mają one odzwierciedlać rzeczywiste ustawienia aparatu. Jeśli znasz się na tym, jak one działają, możesz się nimi pobawić. Jeśli nie, możesz wybrać serię ustawień wstępnych w prawym górnym rogu. </p> <p> Zamierzamy wybrać <strong> 35mm </strong> na razie gotowe. Teraz, gdy nasza warstwa kamery jest skonfigurowana i znajduje się w scenie, na początku nie zobaczysz dużej różnicy. </p> <h3 id=\"using-3d-camera-navigation\"> Korzystanie z nawigacji kamery 3D </h3> <p> Istnieją dwie metody dostosowywania i animowania widoku kamery. Najdokładniejsze jest wprowadzenie różnych <strong> Pozycja </strong> wartości w <strong> Przekształcać </strong> ustawienia warstwy kamery. Następnie możesz utworzyć klatkę kluczową tak, jak podczas animowania dowolnej innej warstwy. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> Gdy poruszasz kamerą, zauważysz, że wszystkie inne obiekty 3D na twojej scenie poruszają się w stosunku do niej. Pamiętaj, że aparat będzie <strong> nie wpływa na warstwy 2D </strong> . </p> <p> Ustawmy więc naszą kamerę tak, aby poruszała się na osi Z od zera do 9000 w odstępie czterech sekund i wykadrujmy nasz ruch. </p> <p> Masz to! Jeśli masz to poprawnie skonfigurowane, słowa powinny pchać „do ciebie”, „przez” pole widzenia i „za” widza. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> Inne sposoby poruszania kamerą 3D </h3> <p> Jeśli wolisz trochę bardziej eksperymentować i mniej operować liczbami przy użyciu aparatu, możesz skorzystać z innych sposobów poruszania się, nawigacji i dostosowywania. <strong> Orbita </strong> , <strong> Patelnia </strong> , i <strong> Laleczka </strong> narzędzia u góry paska narzędzi pozwalają to zrobić. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> Za ich pomocą możesz klikać i przeciągać, aby poruszać się z boku na bok ( <strong> Patelnia) </strong> , obróć się ( <strong> Orbita </strong> ) oraz powiększać i pomniejszać ( <strong> Laleczka </strong> ). Te elementy sterujące są mniej dokładne niż wprowadzanie liczb, ale świetnie nadają się do planowania ruchów kamery i animacji. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> Praktyka prowadzi do perfekcji </h2> <p> Powinieneś teraz być w stanie tworzyć i animować warstwy 3D wzdłuż osi Z, a także pracować z kamerami 3D, aby nawigować z wieloma obiektami 3D. </p> <p> Jeśli lubisz pracować w przestrzeni 3D, możesz zapoznać się z bardziej zaawansowanymi możliwościami, jakie oferuje bardziej dedykowane oprogramowanie 3D, takie jak Blender. </p>"}