{"title":"Współzałożyciel Netflix krytykuje strategię wideo Apple TV+","content":"<p> Były szef Netflix, Marc Randolph, uderzył w strategię wideo Apple, mówiąc, że Apple TV+ pozostaje w tyle za konkurencją ze względu na bezpłatne oferty firmy i brak atrakcyjnych treści. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple nie przesyła strumieniowo „obu nogami” </h2> <p> Jeśli zapytasz byłego dyrektora generalnego i współzałożyciela Netflix, Marca Randolpha, Apple TV boryka się z problemem freeloadera, który przyczynił się do anemicznego wzrostu usługi w porównaniu z Netflix, Disney+ i innymi odnoszącymi sukcesy serwisami streamingowymi. </p> <p> Mówię do <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Finanse yahoo </a> powiedział, że Apple TV+ marnuje energię na promocje i bezpłatne oferty, podczas gdy powinno koncentrować się na dodawaniu większej ilości treści wysokiej jakości, aby zwiększyć wartość. </p> <blockquote> <p> Gdyby Apple poświęciło jedną czwartą więcej czasu na treści, niż na prezenty, naprawdę mogliby grać. Nie mają usprawiedliwienia [i] nadal nie są w tym obiema stopami. Naprawdę muszą robić rzeczy przedsiębiorcze, podejść do krawędzi urwiska i skoczyć. </p> </blockquote> <p> Zeskoczenie z krawędzi urwiska może być łatwiejsze do powiedzenia niż do zrobienia, ponieważ Apple TV+ nie ma siły rynkowej Disneya i rozpoznawalności marki Netflix. Teraz wszystko o to chodzi <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney+ kontra Netflix </a> i która usługa przesyłania strumieniowego oferuje potencjalnym klientom najlepszy stosunek jakości do ceny. </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV+ ma najwyższy wskaźnik rezygnacji </h2> <p> Randolph sprzeciwia się prezentom i promocjom na rynku streamingowym, sugerując, że Apple TV+‌ ma „najwyższy wskaźnik rezygnacji” wśród głównych usług. </p> <blockquote> <p> Nie możesz ciągle zastępować ludzi. Musisz dać im powód, żeby zostali. </p> </blockquote> <p> Firma MoffettNathanson-HarrisX stwierdziła, że ​​29 procent osób, które zarejestrowały się za pośrednictwem bezpłatnego okresu próbnego, nie planuje ponownej subskrypcji po wygaśnięciu bezpłatnego okresu próbnego, jak donosi <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> Różnorodność </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> Darmowe oferty Apple TV+ </h2> <p> Apple oferuje 12 miesięcy bezpłatnej usługi Apple TV+ wszystkim, którzy kupią od firmy kwalifikujące się nowe urządzenie, takie jak nowy iPhone. W międzyczasie, <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple przedłużyło bezpłatne roczne subskrypcje </a> dwa razy dla tych, którzy zapisali się w 2019 roku. </p> <p> </p> <p> To wyraźny sygnał, że sam Apple nie wierzy, że usługa zapewnia wystarczającą ilość treści, aby uzasadnić cenę wywoławczą 5 USD miesięcznie. Spójrz na to z innej strony: gdyby Apple TV+ przekroczył wewnętrzne prognozy, Apple już by się chwalił liczbą abonentów. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney+ i Netflix zapewniają poważną konkurencję </h2> <p> Dopiero 15 miesięcy temu Apple TV+ zadebiutowało w listopadzie 2019 r. Wkrótce potem pojawił się Disney+. Apple nie ujawnia, ilu płatnych subskrybentów ma Apple TV+, ale Disney właśnie przekroczył 94 miliony subskrybentów, znacznie przekraczając nawet własne oczekiwania. </p> <p> Dla porównania, Netflix na koniec 2020 roku liczył 204 miliony płacących klientów. Disney ma nadzieję, że dorówna Netflixowi pod względem liczby subskrybentów w ciągu zaledwie 12 miesięcy. </p> <p> </p> <p> Randolph mówi, że Disney+ „wywalczył sobie naprawdę silną pozycję” dzięki zawartości. „To naprawdę wojna o to, kto jest przygotowany do tworzenia treści” – dodał. </p> <blockquote> <p> Widzimy rozwój nowych zasad gry. To nie jest tylko ogłoszenie, to nie tylko promocja – musisz wykazać, że masz treść, treść, treść. </p> </blockquote> <p> Rzeczywiście, gra dotyczy treści. Na przykład, jak opisano w <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> jego plany na 2021 </a> , Netflix co tydzień będzie wypuszczać nowy oryginalny film przez cały rok. Z kolei Apple TV+ zawiera kilka filmów, takich jak dramat Greyhound z II wojny światowej z udziałem Toma Hanksa (oparty na prawdziwych wydarzeniach), oryginalny dramat Palmer z Justinem Timberlake&#39;em w roli głównej i On The Rocks Sofii Coppoli, żeby wymienić tylko kilka. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> Podejście Apple do powolnego spalania </h2> <p> Randolph nie przyznaje, że Netflix i Disney+ miały ogromne ilości treści od pierwszego dnia, podczas gdy Apple TV+ buduje swoją bibliotekę treści od zera. </p> <p> Apple oczywiście zdecydowało się na powolne podejście, o czym świadczy niedobór programów w stosunku do Disney+ i Netflix. Bez względu na to, jak na to spojrzysz, jego strategia z Apple TV+ wydaje się wymagać przyciągania ludzi bezpłatnymi ofertami w nadziei, że usługa zgromadzi wystarczająco wysokiej jakości treści, aby przekształcić bezpłatnych klientów w płatnych subskrybentów. </p>"}