{"title":"Wkrótce będziesz grać w gry z postaciami MetaHuman firmy Epic","content":"<p> Jeśli uważasz, że gry wyglądają teraz realistycznie, poczekaj, aż złapiesz mnóstwo tego, co Epic Games ma w pracy dzięki Unreal Engine. Przygotuj się na szok. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games przedstawia nowego MetaHumans </h2> <p> Pewnie zastanawiasz się, o jakiej ziemi mówimy. MetaHuman Creator to najnowsza funkcja, którą Epic Games dodał do Unreal Engine; środowisko programistyczne, którego twórcy gier mogą używać do tworzenia swoich tytułów. </p> <p> Według an <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Post na blogu Unreal Engine </a> zapowiedź nowego, ekscytującego narzędzia programistycznego: </p> <blockquote> <p> MetaHuman Creator to aplikacja przesyłana strumieniowo w chmurze, zaprojektowana tak, aby trwać w czasie rzeczywistym cyfrową ludzką twórczość od tygodni lub miesięcy do mniej niż godziny, bez uszczerbku dla jakości. </p> </blockquote> <p> Jest to więc zasadniczo sposób, w jaki twórcy gier mogą tworzyć niewiarygodnie realistyczne ludzkie faksy. Szybki. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> Co oznacza MetaHuman Creator dla programistów? </h2> <p> </p> <p> Konsekwencje, jakie to ma dla rozwoju oprogramowania, zmieniają grę (gra słów zamierzona). Wyobraź sobie, jak szybko programiści zaludnią swoje światy gier postaciami niezależnymi, korzystając z MetaHuman Creator. Nie tylko to, ale także cyfrowi ludzie wyglądają niesamowicie. </p> <p> To oczywiście oznacza, że ​​programiści mogą szybciej kończyć tytuły, więc nie musisz czekać na niezliczone opóźnienia. MetaHuman Creator pozwala twórcom szybko zbudować populację NPC, pozostawiając czas na inne, bardziej pilne sprawy. </p> <p> Ale dlaczego potrzeba tego narzędzia? Epic Games wyjaśnia: </p> <blockquote> <p> Stworzenie jednego wysokiej jakości cyfrowego człowieka jest trudne i czasochłonne. Skalowanie tego wysiłku, aby stworzyć wielu różnych cyfrowych ludzi o jakości wymaganej przez platformy nowej generacji i wysokiej klasy wirtualną produkcję, jest naprawdę ogromnym zadaniem. </p> </blockquote> <p> Tak więc, jak powiedzieliśmy; narzędzie oszczędza czas i poprawia przepływ pracy, umożliwiając programistom dostarczanie konsolom nowej generacji gier, na które zasługują. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> Jak MetaHuman Creator wpłynie na gry? </h2> <p> Cóż, dzięki MetaHuman Creator, na początek gry mogą pojawić się znacznie szybciej. Dysponując potężnymi narzędziami, takimi jak to, programiści mogą doskonalić mechanikę gry lub spędzać więcej czasu na naprawie błędów, zanim wydadzą zepsutą grę... </p> <p> W każdym razie, pomijając gorycz, narzędzie programistyczne Epic wydaje się być czymś, co sprawi, że gry również będą wyglądać lepiej. Wystarczy spojrzeć na rendery, aby zobaczyć, jak zapierają dech w piersiach cyfrowi ludzie. Jednak gdy widzimy je w grach, dzieje się prawdziwa magia. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> Kiedy zobaczymy MetaHumans w grach? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> Trudno powiedzieć. Obecnie firma Epic powiązała oprogramowanie Creator do testowania wczesnego dostępu w ciągu „następnych kilku miesięcy”. Więc w najbliższym czasie nie zobaczysz żadnych MetaHumans. </p> <p> Jeśli masz ochotę na stworzenie własnego cyfrowego człowieka, musisz poczekać, jeśli chcesz użyć MetaHuman Creator firmy Unreal Engine. Zawsze możesz spróbować połączyć je w inny program, ale z pewnością nie zajmie to mniej niż godziny! </p>"}