{"title":"Wykrywająca mowę nienawiści sztuczna inteligencja Facebooka się opłaca","content":"<p> Facebook poprawia swoją skuteczność w rozpoznawaniu i usuwaniu nienawistnych treści. Platforma <a href=\"https://transparency.facebook.com/community-standards-enforcement\" target=\"_blank\" rel=\"nofollow noopener\"> Raport dotyczący egzekwowania standardów wspólnotowych </a> pokazuje znaczne zmniejszenie rozpowszechnienia mowy nienawiści w ostatnim kwartale 2020 r. </p> <h2 id=\"hate-speech-on-facebook-has-dipped\"> Mowa nienawiści na Facebooku spadła </h2> <p> W Raporcie dotyczącym egzekwowania standardów społeczności Facebooka za okres od października do grudnia 2020 r. platforma ujawniła znaczne ulepszenia w sposobie, w jaki Facebook radzi sobie z mową nienawiści. Guy Rosen, wiceprezes ds. uczciwości na Facebooku, opublikował post <a href=\"https://about.fb.com/news/2021/02/community-standards-enforcement-report-q4-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> blog O Facebooku </a> aby podkreślić jego sukces. </p> <p> Na każde 10 000 wyświetleń treści na Facebooku tylko siedem do ośmiu to wyświetlenia treści nienawistnych. Facebook podjął również działania w sprawie 6,3 miliona postów dotyczących zastraszania i nękania, co stanowi wzrost z 2,5 miliona postów w trzecim kwartale. </p> <p> Platforma była również w stanie wychwycić 6,4 miliona elementów zorganizowanych treści szerzących nienawiść, co stanowi ogromną poprawę w porównaniu z czterema milionami elementów treści, które Facebook usunął w poprzednim kwartale. </p> <p> Raport dotyczący egzekwowania standardów społeczności wykazał podobne ulepszenia na Instagramie. Z Instagrama usunięto pięć milionów postów dotyczących nękania i zastraszania, 6,6 miliona elementów treści zawierających mowę nienawiści i 308 000 elementów zorganizowanych treści szerzących nienawiść. Wszystkie te liczby przewyższają statystyki odnotowane w trzecim kwartale. </p> <p> Proaktywny wskaźnik Facebooka, inaczej określany jako ilość treści usuwanych przez Facebooka, zanim użytkownik to zgłosi, również uległ poprawie. W przypadku zastraszania i nękania proaktywny wskaźnik platformy wzrósł z 26 do 49 procent na Facebooku i z 55 do 80 procent na Instagramie. </p> <p> <img alt=\"Facebook graph for bullying\" src=\"images/facebook-content-takedowns-q4-715.png\" loading=\"lazy\"> Źródło obrazu: Facebook </p> <p> <a href=\"https://www.makeuseof.com/facebooks-ai-tackles-hateful-content/\" target=\"_blank\" rel=\"nofollow noopener\"> Wykrywająca nienawiść sztuczna inteligencja Facebooka </a> odegrała ważną rolę w zwiększeniu reakcji na mowę nienawiści. Rosen zauważa, że ​​platforma poprawiła swoją sztuczną inteligencję, „gdzie istotne są niuanse i kontekst, takie jak mowa nienawiści lub zastraszanie i nękanie”, co ostatecznie pomogło zmniejszyć ilość nienawistnych treści na Facebooku. </p> <p> Mike Schroepfer, dyrektor ds. technologii Facebooka, opublikował osobny post na <a href=\"https://about.fb.com/news/2021/02/update-on-our-progress-on-ai-and-hate-speech-detection/\" target=\"_blank\" rel=\"nofollow noopener\"> blog O Facebooku </a> aby uczcić osiągnięcia stale ulepszanej sztucznej inteligencji Facebooka. Pomimo ostatnich osiągnięć Schroepfer ma nadzieję, że sztuczna inteligencja Facebooka może poprawić „oglądanie treści w kontekście w różnych językach, kulturach i regionach”. </p> <p> </p> <h2 id=\"facebook-s-ai-is-getting-smarter\"> Sztuczna inteligencja Facebooka staje się inteligentniejsza </h2> <p> Facebook zaczął w większym stopniu polegać na swoim systemie sztucznej inteligencji, aby pomóc w ocenie nienawistnych treści z powodu trwającej pandemii COVID-19. Rosen zauważył, że zespół Facebooka prawdopodobnie nadal będzie dotknięty pandemią „dopóki szczepionka nie będzie powszechnie dostępna”. </p> <p> Mimo że moderatorzy Facebooka pewnego dnia powrócą do normalnej pracy, nie wydaje się, by sztuczna inteligencja platformy nigdzie się nie wybierała. Facebook sprawił, że sztuczna inteligencja stała się inteligentniejsza i wydajniejsza, i nie wydaje się, żeby Facebook w najbliższym czasie przestał się rozwijać. </p>"}