{"title":"10 coisas que você não sabia que o Google Docs poderia fazer","content":"<p> O Google Doc pode parecer básico na superfície, mas a ferramenta de produtividade em nuvem tem muitos recursos esquecidos que podem ajudá-lo a fazer mais no trabalho. </p> <p> Neste artigo, veremos vários recursos do Google Doc que você provavelmente não conhecia e como pode usá-los para economizar tempo na criação de conteúdo. </p> <p> Observe que esses recursos podem ser acessados ​​principalmente na versão desktop da ferramenta Google Docs. Aqueles que também podem ser usados ​​na versão mobile serão indicados. </p> <h2 id=\"voice-typing\"> 1. Digitação por voz </h2> <p> Para usar o recurso de digitação por voz, abra um documento e clique em <strong> Ferramentas </strong> na barra de menu no topo da página. Selecione <strong> Digitação por Voz </strong> no menu suspenso. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> Um microfone aparecerá na tela, com um menu de idiomas onde você pode selecionar o seu idioma preferido. Quando estiver pronto para falar seu texto, clique no microfone ou pressione <strong> Cmd + Shift + S </strong> (se você estiver usando um Mac) ou <strong> Ctrl + Shift + S </strong> (se você estiver usando um PC com Windows) para iniciar a gravação. </p> <p> Para adicionar pontuação entre o texto, diga o nome do sinal de pontuação que deseja adicionar, como &quot;ponto final&quot;, &quot;vírgula&quot; ou &quot;ponto de interrogação&quot;. Você pode dar instruções de formatação como ‘nova linha’ ou ‘novo parágrafo’ ou ‘parar de ouvir’ se quiser fazer uma pausa na digitação por voz e ‘retomar’ quando estiver pronto para continuar. </p> <p> Procure os comandos de edição avançados deste <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> lista de comandos </a> na página de suporte do Google. </p> <p> Você também pode usar esse recurso para transcrever qualquer áudio. Basta reproduzir o áudio (do seu telefone ou qualquer outro dispositivo) para a voz para texto e ele deve digitá-lo para você. Você pode precisar fazer algumas edições, mas terá economizado muito tempo. </p> <p> </p> <p> O recurso de digitação por voz está disponível apenas na área de trabalho, mas funciona apenas no navegador Chrome. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Edição offline </h2> <p> Muitas pessoas gostam do Google Docs para seu instantâneas recurso save-to-cloud, mas pode ser inconveniente se você não tiver acesso à internet por um tempo. A boa notícia é que você ainda pode acessar e editar seus arquivos off-line. </p> <p> Este recurso está disponível apenas no Google Chrome, e você precisa instalar e ativar o <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Extensão do Google Docs off-line para o Chrome </a> . Além disso, certifique-se de não estar navegando no modo privado. </p> <p> Esse recurso precisa ser implementado quando você estiver on-line, mas quando estiver pronto, você pode escrever e editar o texto off-line e, em seguida, eles serão salvos na nuvem quando você tiver acesso à internet. Veja como. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> Para tornar possível <strong> abrir e salvar arquivos do Google Docs off-line </strong> , Segue <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> essas instruções </a> . Este recurso está disponível em PCs, iOS e Android. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Rastrear / restaurar o histórico da versão do documento </h2> <p> Se você estiver trabalhando em um documento sozinho ou com outras pessoas, poderá rastrear as alterações no documento usando o recurso Histórico de versões. </p> <p> Você também pode restaurar o documento para uma versão anterior temporária ou permanentemente; um recurso que pode ser um salva-vidas se você acidentalmente excluir partes do seu documento e não puder usar o <strong> Desfazer </strong> botão para restaurá-los. </p> <p> Para usar o recurso de histórico de versão, clique em <strong> Arquivo </strong> na barra de menu e selecione <strong> Histórico da Versão </strong> no menu suspenso. Você verá que também pode nomear uma versão, para que possa usar isso para controlar as alterações contínuas no documento, especialmente se outros usuários estiverem fazendo edições no mesmo documento. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Este recurso está disponível apenas na área de trabalho. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Modo de sugestão e revisão </h2> <p> Embora seja ótimo colaborar com outras pessoas e editar um documento em conjunto, pode ser difícil (e confuso) controlar as alterações que cada pessoa fez. </p> <p> O recurso de sugestão permite que você simplesmente sugira edições se não quiser alterar o documento completamente. Suas sugestões aparecerão no editor como comentários na barra lateral, e o editor pode fazer alterações instantâneas aceitando a sugestão. Você também pode continuar conversando com <strong> Responder </strong> , para que você possa dar e receber feedback direto na página do documento, sem ter que enviar e-mails para frente e para trás. </p> <p> Para sugerir edições, clique no ícone de lápis do modo de edição no canto superior direito do documento aberto e selecione <strong> Sugerindo </strong> . </p> <p> Para visualizar o documento sem as sugestões, clique em <strong> Vendo </strong> . Você poderá ler sem os tachados e os pop-ups de comentários. </p> <p> Para economizar tempo, você pode aceitar ou rejeitar todas as sugestões de uma vez. Clique <strong> Ferramentas </strong> , então selecione <strong> Rever edições sugeridas </strong> . Clique <strong> Aceitar tudo </strong> ou <strong> Rejeitar tudo </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Este recurso está disponível apenas na área de trabalho. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Adicionar fontes </h2> <p> Se você quiser <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> estilize seu texto </a> para se adequar à sua mensagem, você também pode fazer isso com o Google Docs. Além das 24 fontes padrão que já estão programadas na ferramenta Google Docs, você pode adicionar várias fontes interessantes de sua escolha para aumentar seu texto visualmente. </p> <p> Para adicionar fontes, basta clicar em <strong> Fontes </strong> na barra de menu e selecione <strong> Mais fontes </strong> . Selecione quantas fontes desejar da coleção fornecida. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Este recurso está disponível apenas na área de trabalho. </p> <p> </p> <h2 id=\"compare-documents\"> 6. Comparar documentos </h2> <p> Esse é outro recurso que você pode usar para controlar as alterações feitas em um documento por você ou um colaborador. É especialmente útil para documentos grandes e, como o nome sugere, você pode comparar dois documentos para ver as diferenças entre eles. </p> <p> Para usar este recurso, abra o documento base para o qual deseja fazer uma comparação e clique no <strong> Ferramentas </strong> e selecione <strong> Comparar documentos </strong> . </p> <p> Na caixa de diálogo que aparece, selecione o documento com o qual deseja compará-lo em seu Drive e clique em <strong> Comparar </strong> . No <strong> Atribua diferenças para </strong> campo, digite o nome do colaborador que será o autor das edições sugeridas no documento final. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> As diferenças serão mostradas da mesma forma que no <strong> Sugerindo </strong> modo que discutimos acima, e você também pode aceitar ou rejeitar edições. </p> <p> Este recurso está disponível apenas na área de trabalho. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Encontre e substitua </h2> <p> Se você precisar substituir várias ocorrências de um erro em seu texto, o Google Docs torna mais fácil fazer isso com o recurso Localizar e substituir. </p> <p> Para usuários que estão familiarizados com o recurso Localizar e Substituir do Microsoft Word, isso funciona da mesma forma. </p> <p> Para encontrar uma palavra ou frase específica em seu documento, use o atalho <strong> Ctrl + F </strong> em um PC com Windows ou <strong> Command + F </strong> em um Mac. Digite a palavra no campo &quot;Localizar no documento&quot;. </p> <p> Para substituir o texto encontrado, clique nos três pontos à direita e selecione <strong> Encontrar e substituir </strong> . </p> <p> Em seguida, insira o texto no <strong> Achar </strong> campo, e o texto de substituição no <strong> Substituir com </strong> campo. Percorra as instâncias de texto com o cursor para cima e para baixo e clique <strong> Substituir </strong> para trocá-los individualmente. Ou clique <strong> Substitua tudo </strong> para substituir todo o texto selecionado de uma vez. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Use um Dicionário </h2> <p> Para ajudá-lo a se concentrar e evitar a necessidade de alternar entre as guias ao procurar o significado de uma palavra, o Google Docs tem um dicionário no aplicativo. </p> <p> Quando você estiver digitando e precisar procurar uma palavra, realce a palavra, clique com o botão direito e selecione <strong> Definir </strong> no menu. A ferramenta Dicionário buscará a definição da palavra na internet, e ela aparecerá no lado direito da tela. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Adicionar acentos de idioma </h2> <p> Diga adeus à memorização de atalhos do teclado ou copie / cole letras acentuadas de outros documentos. </p> <p> Para usar letras acentuadas, você teria que fazer o download <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> o complemento “Easy Accents&quot; </a> . Ele permite inserir acentos para 20 idiomas diferentes diretamente de uma barra lateral em seu documento. </p> <p> Baixe o complemento do Google Doc abrindo o <strong> Ferramentas </strong> menu e clique em <strong> Add-Ons </strong> e <strong> Obtenha complementos </strong> . Na caixa do Google Marketplace que aparece, pesquise por <strong> Acentos fáceis </strong> e clique no botão azul de instalação para adicioná-lo à coleção de complementos do Google Docs. </p> <p> Após a instalação, clique no <strong> Add-Ons </strong> para selecionar o complemento Easy Accents e começar a adicionar acentos corretos em todas as suas palavras estrangeiras. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Este complemento está disponível apenas no desktop, mas os teclados móveis geralmente suportam acentos de idioma, então você será capaz de escrever texto com marcas de acento em seu telefone sem o complemento. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Crie atalhos personalizados </h2> <p> A maioria das pessoas está familiarizada com <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Atalhos do Microsoft Word </a> , mas você também pode criar seus próprios atalhos no Google Docs. Para criar atalhos personalizados, clique em <strong> Ferramentas&gt; Preferências&gt; Substituição. </strong> Você descobrirá que já existem algumas frações e atalhos de símbolos (como alterar 3/4 para ¾), mas sinta-se à vontade para adicionar alguns dos seus próprios. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Este recurso está disponível apenas na área de trabalho. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Faça mais com o Google Docs </h2> <p> Agora que você aprendeu essas ferramentas do Google Docs, pode colocá-las em uso ao criar seu próximo documento. Felizmente, eles tornam as coisas mais fáceis para você! </p>"}