{"title":"5 coisas que podem fazer com que você seja banido permanentemente do Facebook","content":"<p> O Facebook não é tão conhecido quanto o Twitter para remover contas. No entanto, existem algumas ofensas baníveis às quais o Facebook responde com mais do que apenas um rótulo de aviso. </p> <p> Aqui, exploramos os termos e condições do Facebook e onde a empresa traça os limites, olhando para exemplos históricos de usuários que o Facebook &quot;desplanatou&quot; por seu comportamento. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> Posição do Facebook sobre banimentos permanentes </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> Ao contrário de outros sites de mídia social, o Facebook não lista muitas ofensas que resultam em um banimento permanente. Em vez disso, ele cita as ofensas repetidas em vez da gravidade das ofensas como o fator principal. Como resultado, em teoria, qualquer violação do Facebook repetida com frequência suficiente pode resultar em um bloqueio de perfil. </p> <p> No entanto, poucas atividades resultam em uma proibição completa e o Facebook é surpreendentemente frouxo com algumas atividades ilegais reconhecidas. Por exemplo, a venda de &quot;bens regulamentados&quot; como armas e maconha não é permitida no Marketplace do Facebook, mas o Facebook não lista isso como um crime que pode ser banido. </p> <p> O Facebook prefere sinalizar ou remover conteúdo post-a-post em vez de retirar perfis. No entanto, existem exceções. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Uso indevido de ferramentas e dados </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> Os Termos de Serviço do Facebook estabelecem três ofensas proibidas. O primeiro é uma coleção de ações, que o restante deste artigo examina com mais detalhes. O segundo e o terceiro são mais específicos e têm a ver com o uso indevido das ferramentas e dados do Facebook. </p> <p> Este termo de serviço comum proíbe o acesso e uso de partes do site que deveriam ser reservadas para desenvolvedores. Também proíbe o uso de ferramentas de sites públicos de forma deliberadamente maliciosa, como usar o Facebook para espalhar vírus e malware. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Ameaças à segurança pública </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Um dos únicos casos em que o Facebook diz que desativa contas é o de &quot;risco genuíno de danos físicos ou ameaças diretas à segurança pública&quot;. O Facebook também remove perfis que &quot;proclamam uma missão violenta ou estão envolvidos na violência&quot;. </p> <p> Esse foi o motivo para banir indefinidamente o então presidente Donald Trump após um tumulto no Capitólio dos Estados Unidos em janeiro de 2021. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Associação com grupos violentos </h2> <p> O Facebook tomou sua posição sobre conteúdo prejudicial e ameaçador ao nível associativo em outubro de 2020, quando removeu perfis associados à conspiração QAnon, mesmo que os perfis individuais não tivessem conteúdo violento. O grupo de conspiração levou a episódios violentos desde 2016. </p> <p> </p> <p> O Facebook também baniu o grupo musical Trapt por postar referências ao grupo de ódio Proud Boys. A organização política extremista está envolvida na violência nas ruas nos Estados Unidos e Canadá desde 2016. </p> <p> A empresa também se reserva o direito de desativar contas se essas contas representam um risco legal para o Facebook. Além disso, o Facebook é mais inflexível do que outras plataformas de mídia social sobre como trabalhar com a aplicação da lei e organizações de divulgação ao encontrar esse tipo de conteúdo. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Comprometendo a segurança de outras contas </h2> <p> Outra das raras ofensas que podem ser banidas das listas do Facebook é &quot;comprometer a segurança de outras contas e de nossos serviços&quot;. Comprometer a segurança dos serviços do Facebook parece muito com o malware e o uso indevido mencionados nos termos de serviço. No entanto, a ideia de comprometer a segurança de outras contas aponta para doxxing. </p> <p> </p> <p> Doxxing é a liberação de informações confidenciais do mundo real de um usuário de mídia social, potencialmente incluindo seu endereço residencial ou comercial, número de telefone privado ou localização física em tempo real. Essa prática geralmente é feita com a intenção de causar danos a essa pessoa. </p> <p> </p> <h2 id=\"misinformation\"> 5. Desinformação </h2> <p> </p> <p> As diretrizes oficiais do Facebook dizem que o Facebook não remove a desinformação, optando por rotulá-la para que possa contribuir com diálogos sem enganar os outros. No entanto, vários titulares de contas suspensas dizem que sua remoção resultou do que o Facebook chama de &quot;Notícias Falsas&quot;. </p> <p> Existem vários motivos para isso acontecer. Em alguns casos, o Facebook determina que a notícia falsa também é prejudicial à saúde pessoal ou pública. </p> <p> Este foi <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> Explicação do Facebook para remover o teórico da conspiração David Icke </a> por alegar, entre outras coisas, que a Internet 5G causa a Covid-19. O Facebook também disse que Icke havia &quot;violado repetidamente&quot; as políticas. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Políticas do Facebook e sua conta </h2> <p> Na maior parte do tempo, o Facebook não se preocupa com você, desde que você não use a plataforma de forma indevida para causar danos a outras pessoas. No entanto, existem certos problemas em que a empresa traça um limite na areia. </p> <p> Se você não infringir esses termos de serviço, deve evitar um banimento permanente do Facebook. </p>"}