{"title":"8 maneiras pelas quais as mídias sociais podem ajudá-lo a aprender um novo idioma","content":"<p> Você ainda tem pesadelos com os livros didáticos de espanhol e as aulas de francês mal ensinadas que recebeu na escola? Não temas. Graças à Internet, aprender um novo idioma hoje em dia pode ser divertido e acessível. </p> <p> A mídia social, em particular, ajudou a conectar milhões de alunos de línguas em todo o mundo. Esteja você aprendendo algo popular como alemão ou mais obscuro como feroês, você encontrará uma ampla variedade de recursos para ajudá-lo em sua jornada. </p> <p> Aqui estão algumas maneiras de usar a mídia social para aprender seu próximo idioma estrangeiro. </p> <h2 id=\"join-facebook-groups\"> 1. Junte-se a grupos do Facebook </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> No Facebook, você encontrará grupos para quase todos os idiomas imagináveis. Você encontrará comunidades de expatriados recém-transferidos que procuram melhorar suas habilidades, bem como grupos para alunos em todo o mundo. Para obter o máximo de sua experiência, você deve ingressar em ambos. </p> <p> Para encontrar os grupos certos do Facebook, você pode fazer uma simples pesquisa online. Como alternativa, você pode encontrar o que procura no Facebook. Para fazer isso, vá para Grupos e pesquise seu idioma. Você obterá então uma lista de comunidades que atendem a essas necessidades. </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> Se você estuda em uma escola de idiomas local, também pode criar seu próprio grupo para se conectar com seus colegas. Para fazer isso, <strong> Vá para Grupos&gt; Criar Novo Grupo </strong> . Você pode então editar as configurações e começar a convidar membros. </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2. Faça uso do Reddit </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit é um fórum online popular que é uma mina de ouro para alunos de idiomas. Você encontrará subreddits para idiomas específicos e para o aprendizado geral de idiomas. </p> <p> Ao entrar em um subreddit, você descobrirá muitas dicas e sugestões úteis de outros alunos que seguiram o seu caminho. Você também encontrará muitos memes com os quais, sem dúvida, se identificará. </p> <p> Para encontrar um subreddit, vá até a barra de pesquisa na parte superior e digite em seu idioma. Depois que os resultados forem carregados, vale a pena juntar grupos específicos de aprendizagem e grupos culturais para aprender mais sobre os costumes locais. </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. Conecte-se com alto-falantes nativos </h2> <p> A melhor maneira de aprender um idioma rapidamente é conversando com pessoas que já o falam. E a mídia social pode ser um ótimo lugar para encontrar esses palestrantes. Você pode precisar estender a mão para algumas pessoas, mas eventualmente, você encontrará alguém disposto a reservar algum tempo para ajudá-lo. </p> <p> Ao se conectar com falantes nativos nas redes sociais, concentre-se primeiro em construir uma amizade. Se você estiver na mesma cidade que eles, ofereça-se para conhecê-los e pague por um café. Para aqueles que estão mais longe, ofereça-se para ajudá-los a aprender um dos idiomas que você já fala. </p> <p> As etapas para isso são semelhantes em cada plataforma de mídia social. No Instagram ou Twitter, siga-os e envie uma mensagem (se suas configurações de privacidade permitirem). Você pode adotar uma abordagem semelhante no Facebook, embora algumas pessoas possam estar menos dispostas a aceitar pedidos de amizade de pessoas que não conhecem. </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. Crie seu próprio conteúdo de mídia social </h2> <p> Você não precisa apenas consumir nas redes sociais para se ajudar a aprender um idioma. Tente criar suas próprias postagens também. Fazer isso não apenas o ajudará a praticar sua fala e escrita; você também pode descobrir novos usuários para praticar. </p> <p> Você tem muitas opções quando se trata de criar conteúdo. No Twitter, você pode participar de conversas ou escrever alguns de seus tweets em seu idioma de destino. Com o Instagram, você pode escrever legendas, criar gráficos e gravar sua fala. </p> <p> Ao criar seu próprio conteúdo de mídia social, você também receberá feedback de falantes nativos. Além disso, você também pode aumentar seu portfólio e aprender algumas novas habilidades úteis. </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. Defina seus aplicativos para o idioma que você está aprendendo </h2> <p> Alterar as configurações do telefone é uma maneira fácil de começar a pensar em seu idioma de destino e se sentir confortável ao lê-lo. Você também adicionará dezenas de novas palavras ao seu vocabulário. </p> <p> </p> <p> Todas as grandes redes de mídia social têm configurações no aplicativo onde você pode alterar o idioma. No Instagram, por exemplo, vá para <strong> Conta&gt; Idioma </strong> . Você verá uma lista suspensa de todos os idiomas que pode usar. </p> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (2 imagens) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> Expandir <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> Você também pode alterar todos os idiomas de seus aplicativos de uma vez usando as configurações do telefone. Vamos para <strong> Definições </strong> &gt; <strong> Geral&gt; Idioma e região </strong> . A partir daí, você verá uma lista de todos os idiomas disponíveis. Observe que, para idiomas menores, você pode não conseguir otimizar sua conta. </p> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (2 imagens) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> Expandir <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. Aproveite ao máximo as hashtags </h2> <p> Usar e pesquisar com hashtags é uma maneira poderosa de encontrar mais usuários no idioma que você está aprendendo. Usando uma variedade, você pode se conectar e consumir o conteúdo de falantes nativos e de outros alunos. </p> <p> Para encontrar o tipo de conteúdo que você está procurando, pense no que outros alunos usarão. Você também pode encontrar conteúdo de falantes nativos pesquisando tópicos existentes em qualquer país. Freqüentemente, você pode encontrá-los em postagens e artigos de tendência. </p> <p> Para pesquisar hashtags, use a função de pesquisa em qualquer aplicativo de mídia social que estiver usando. Você também pode clicar nos posts que os utilizam e encontrar os resultados todos dispostos. </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. Siga as contas em seu idioma de destino </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> Cada relato interessante que você segue em inglês provavelmente também tem um equivalente em seu idioma de destino. Podem ser publicações massivas ou podem ser falantes do dia-a-dia que se sentem mais confortáveis ​​criando trabalhos em sua língua materna. </p> <p> </p> <p> Você também deve verificar se suas revistas, times esportivos e artistas musicais favoritos têm contas em seu idioma de destino. Muitos dos maiores clubes esportivos do mundo, por exemplo, têm contas em inglês, espanhol e muito mais. </p> <p> Ao seguir relatos no idioma que deseja aprender, uma boa regra é apenas segui-los se você achar o conteúdo em inglês igualmente interessante. Caso contrário, você acabará ignorando e deixando de segui-los novamente mais tarde. </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. Siga aplicativos de aprendizagem de línguas nas mídias sociais </h2> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (2 imagens) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> Expandir <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> Os aplicativos de aprendizagem de línguas também costumam ter perfis de mídia social ativos. Eles são ótimos para aprender dicas gerais e relacionar as lutas comuns que todos enfrentam - estejam aprendendo norueguês ou japonês. </p> <p> Algumas contas que valem a pena seguir são Babbel, Busuu e Duolingo. </p> <p> Você não precisa apenas usar esses aplicativos para consumo, no entanto. Sinta-se à vontade para adicionar suas opiniões nos comentários. Você pode até fazer novos amigos, mesmo que eles estejam aprendendo um idioma completamente diferente de você. </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> Torne o aprendizado de um idioma divertido com as mídias sociais </h2> <p> Então, aí está. Agora você tem mais ideia de como usar a mídia social para ajudar a tornar sua jornada de aprendizado de idiomas divertida. Embora o trabalho com livros didáticos ainda seja importante, não deve ser sua única opção. </p> <p> Mesmo que você não consiga otimizar o aplicativo para o seu idioma de destino, ainda encontrará muitos falantes nativos e outros alunos para se conectar. </p> <p> A chave para aprender um idioma com as redes sociais é envolver e consumir. Ao fazer isso, você descobrirá que sua experiência foi mais gratificante e aprenderá palavras que os livros nunca lhe ensinaram. </p>"}