{"title":"AirTags há muito esperados podem finalmente estrear em março","content":"<p> Há rumores de que os AirTags da Apple, um rastreador de localização em miniatura para chaves e outros pequenos objetos, estão chegando desde 2019. No entanto, seis semanas em 2021, eles ainda não foram anunciados pela Apple - quanto mais para começar a ser despachados para clientes. </p> <p> Isso pode mudar no mês que vem, de acordo com o perene informante da Apple, Jon Prosser. Em um tweet enviado na sexta-feira, 12 de fevereiro, Prosser afirmou que, &quot;AirTags ainda estão no ar para março. Não soube de mais atrasos desta vez.&quot; </p> <h2 id=\"what-to-expect-from-airtags\"> O que esperar das AirTags </h2> <p> Prosser está se referindo a um atraso anterior que relatou no ano passado, antes do evento de mídia da Apple em 13 de outubro. Na época, Prosser anotou sobre <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800\" target=\"_blank\" rel=\"nofollow noopener\"> Twitter </a> que ele tinha ouvido de suas fontes (aparentemente bem situadas) que, &quot;A Apple adiou o anúncio e o lançamento de AirTags para março de 2021.&quot; Meio ano depois, parece que nenhum outro atraso vai atrasar o lançamento dos AirTags. Seria de esperar, pelo menos. </p> <p> AirTags supostamente usará a tecnologia de banda ultralarga da Apple para permitir que os iPhones determinem sua localização precisa com um alto grau de precisão. Eles supostamente usarão pistas de áudio e um marcador virtual aumentado para mostrar exatamente onde o objeto, anexado aos AirTags, está situado. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> AirTags ainda estão ativados para março. <br><br> Não ouvi falar de mais atrasos desta vez. 🤞 </p> - Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1360265330296250377?ref_src=twsrc%5Etfw\"> 12 de fevereiro de 2021 </a></blockquote>  <p> Encontrar as AirTags individuais será <a href=\"https://www.makeuseof.com/apple-find-my-items-hidden-tab/\" target=\"_blank\" rel=\"nofollow noopener\"> feito através do aplicativo iOS &quot;Find My&quot; </a> , que também permite aos usuários rastrear seus iPhones, iPads, Macs e outros dispositivos Apple. Os AirTags serão os rivais da Apple para os populares produtos de rastreamento Bluetooth de empresas como a Tile. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Então, sobre AirTags. <br><br> Este dói meu coração ... <br><br> Estou sendo informado de que a Apple adiou o anúncio e o lançamento das AirTags para março de 2021. 😳 <a href=\"https://t.co/xtUvCAFmoE\"> https://t.co/xtUvCAFmoE </a> <a href=\"https://t.co/DIUlcp01Xy\"> pic.twitter.com/DIUlcp01Xy </a></p> - Jon Prosser (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800?ref_src=twsrc%5Etfw\"> 9 de outubro de 2020 </a></blockquote>  <p> A Apple ainda não anunciou um evento especial de março, no qual as AirTags poderiam ser anunciadas. No entanto, se hospedar algum, isso será compatível com os anos recentes. Por seis dos últimos 10 anos, a Apple sediou um evento em março no qual exibiu novos produtos. </p> <p> No ano passado, houve muitos rumores de um evento, mas não ocorreu, provavelmente devido ao início da pandemia COVID-19 nos EUA e em outros lugares. Agora que a Apple mudou para eventos virtuais, no entanto, isso não a impediria de organizar outro evento no próximo mês. Alternativamente, a Apple pode anunciar os AirTags por meio de um comunicado à imprensa. </p> <p> </p> <h2 id=\"expect-a-new-ipad-pro-as-well\"> Espere um novo iPad Pro também </h2> <p> Este pode não ser o único produto novo da Apple no próximo mês. Prosser também respondeu a uma pergunta sobre o próximo iPad Pro da Apple, dizendo que &quot;também está [marcado para] março, pelo que eu sei&quot;. </p> <p> Embora Prosser já tenha se enganado antes, ele tem um recorde geral impressionante quando se trata de anúncios precisos da Apple. Os AirTags e o iPad Pro de última geração estarão entre eles? Não vamos esperar muito até descobrirmos. </p> <p> <small> Crédito da imagem: iphonedigital / <a href=\"https://www.flickr.com/photos/137872055@N03/22522566994/\" target=\"_blank\" rel=\"nofollow noopener\"> Flickr </a></small> </p>"}