{"title":"A VW afirma que a Apple não terá um passeio fácil na indústria automobilística","content":"<p> Herbert Diess, o presidente-executivo do Grupo Volkswagen, minimizou qualquer impacto potencial de um carro da Apple na indústria automotiva, dizendo que a VW &quot;não tem medo&quot; do Projeto Titan. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW &quot;Não tem medo&quot; de um carro da Apple </h2> <p> Embora Diess reconheça que um automóvel da marca Apple pode de fato fazer sentido, ele não acha que a Apple poderia dominar o cenário da fabricação de automóveis &quot;da noite para o dia&quot; devido à intensa competição. Cortar aço e vender carros para consumidores exigentes é um negócio difícil, ele insinuou, acrescentando que este não é um campo que qualquer empresa possa simplesmente &quot;assumir com um único golpe&quot;. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> retransmite o que Diess disse a Frankfurter Allgemeine Sonntagszeitung em uma entrevista: </p> <blockquote> <p> A indústria automobilística não é um setor de tecnologia típico que você poderia assumir de uma só vez. A Apple não vai administrar isso da noite para o dia. Ainda assim, não temos medo. </p> </blockquote> <p> Ainda assim, um veículo da marca Apple faria sentido, dadas as competências da Apple em baterias, software, design industrial e seus recursos aparentemente infinitos, acrescentou o executivo. A Apple não oferece nenhum produto relacionado ao carro além do <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Software de painel CarPlay </a> que permite que um rádio de carro ou unidade principal atue como uma tela e um controlador para um iPhone. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> O pior segredo guardado da indústria </h2> <p> Os planos para o Projeto Titan (o codinome interno de um carro da Apple) ainda não são públicos, apesar de uma enxurrada de rumores recentes dizendo <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> A Apple estava procurando uma parceria com a Hyundai / Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Diz-se que a Apple conversou com outras empresas automotivas </a> e fabricantes contratados - incluindo Magna, Nissan e Foxconn - sobre a construção de seu veículo com direção autônoma. Fontes dizem que um carro da Apple pode não ter volante porque pode inicialmente <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> foco na entrega de comida e operações robotaxi </a> antes de serem vendidos aos consumidores. </p> <p> </p> <p> A maior conclusão do comentário de Herbert seria que a indústria automobilística tem prestado muita atenção ao Projeto Titan. Claramente, a simples ideia de a Apple entrar neste setor está deixando alguns dos principais executivos nervosos. Dito isso, a história está cheia de pessoas que deveriam saber melhor do que ridicularizar a Apple por entrar em uma nova categoria de produtos. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Como o CEO da Palm riu do iPhone </h2> <p> O melhor exemplo disso é o ex-CEO da Palm, Ed Colligan. Apenas algumas semanas antes do lançamento original do iPhone em 2007, Colligan riu da ideia de que uma empresa conhecida por projetar computadores bonitos poderia conquistar clientes no competitivo setor de smartphones, dizendo: </p> <blockquote> <p> Nós aprendemos e lutamos por alguns anos aqui para descobrir como fazer um telefone decente. Os caras do PC não vão apenas descobrir isso. Eles não vão apenas entrar. </p> </blockquote> <p> Semelhante a como Colligan descreveu a Apple como &quot;caras do PC&quot;, o chefe da Volkswagen está tentando minimizar a noção de que uma empresa de tecnologia poderia conquistar clientes no negócio de fabricação de carros. A história mostrará se o comentário de Herbert envelhecerá melhor do que o de Colligan. </p>"}