{"title":"A IA de detecção de discurso de ódio do Facebook está valendo a pena","content":"<p> O Facebook está melhorando sua eficiência no reconhecimento e remoção de conteúdo odioso. Da plataforma <a href=\"https://transparency.facebook.com/community-standards-enforcement\" target=\"_blank\" rel=\"nofollow noopener\"> Relatório de aplicação de padrões da comunidade </a> mostra uma redução significativa na prevalência de discurso de ódio no último trimestre de 2020. </p> <h2 id=\"hate-speech-on-facebook-has-dipped\"> O discurso de ódio no Facebook diminuiu </h2> <p> No Relatório de aplicação dos padrões da comunidade do Facebook de outubro a dezembro de 2020, a plataforma revelou grandes melhorias na maneira como o Facebook está lidando com o discurso de ódio. Guy Rosen, vice-presidente de integridade do Facebook, postou em <a href=\"https://about.fb.com/news/2021/02/community-standards-enforcement-report-q4-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> o blog Sobre o Facebook </a> para destacar seu sucesso. </p> <p> Para cada 10.000 visualizações de conteúdo do Facebook, apenas sete a oito eram visualizações de conteúdo odioso. O Facebook também tomou medidas em 6,3 milhões de postagens de bullying e assédio, um aumento de 2,5 milhões de postagens no terceiro trimestre. </p> <p> A plataforma também foi capaz de capturar 6,4 milhões de peças de conteúdo odioso organizado, o que é uma grande melhoria em comparação com os quatro milhões de peças de conteúdo que o Facebook removeu no trimestre anterior. </p> <p> O Relatório de aplicação dos padrões da comunidade mostrou melhorias semelhantes no Instagram. Cinco milhões de postagens relacionadas a assédio e intimidação foram removidas do Instagram, junto com 6,6 milhões de peças de conteúdo contendo discurso de ódio e 308 mil peças de conteúdo de ódio organizado. Todos esses números superam as estatísticas registradas no terceiro trimestre. </p> <p> A taxa proativa do Facebook, também conhecida como a quantidade de conteúdo que o Facebook remove antes que um usuário denuncie, também melhorou. Para intimidação e assédio, a taxa proativa da plataforma aumentou de 26% para 49% no Facebook e de 55% para 80% no Instagram. </p> <p> <img alt=\"Facebook graph for bullying\" src=\"images/facebook-content-takedowns-q4-715.png\" loading=\"lazy\"> Crédito da imagem: Facebook </p> <p> <a href=\"https://www.makeuseof.com/facebooks-ai-tackles-hateful-content/\" target=\"_blank\" rel=\"nofollow noopener\"> IA de detecção de ódio do Facebook </a> desempenhou um papel importante no aumento da sua resposta ao discurso de ódio. Rosen observa que a plataforma fez melhorias em sua IA &quot;onde nuance e contexto são essenciais, como discurso de ódio ou intimidação e assédio&quot;, o que acabou ajudando a reduzir a quantidade de conteúdo odioso no Facebook. </p> <p> Mike Schroepfer, diretor de tecnologia do Facebook, fez uma postagem separada em <a href=\"https://about.fb.com/news/2021/02/update-on-our-progress-on-ai-and-hate-speech-detection/\" target=\"_blank\" rel=\"nofollow noopener\"> o blog Sobre o Facebook </a> para celebrar as conquistas da IA ​​cada vez melhor do Facebook. Apesar de suas conquistas recentes, Schroepfer espera que a IA do Facebook possa melhorar &quot;na visualização de conteúdo em contexto em vários idiomas, culturas e geografias&quot;. </p> <p> </p> <h2 id=\"facebook-s-ai-is-getting-smarter\"> A IA do Facebook está ficando mais inteligente </h2> <p> O Facebook começou a confiar mais em seu sistema de IA para ajudar a avaliar o conteúdo de ódio devido à pandemia de COVID-19 em andamento. Rosen observou que a equipe do Facebook provavelmente ainda será afetada pela pandemia &quot;até que uma vacina esteja amplamente disponível&quot;. </p> <p> Mesmo que os moderadores do Facebook um dia retornem ao trabalho normalmente, não parece que a IA da plataforma vai a lugar nenhum. O Facebook apenas tornou sua IA mais inteligente e eficiente, e não parece que o Facebook planeja parar de progredir tão cedo. </p>"}