{"title":"A Microsoft tentou comprar o Pinterest, mas o negócio foi fechado ... por enquanto","content":"<p> A Microsoft abordou recentemente o Pinterest com relação a um possível acordo de aquisição que equivaleria a uma das maiores aquisições de Redmond. Atualmente, as negociações não estão ativas, mas a escala da fusão proposta marca ainda mais os planos de crescimento da Microsoft. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft quer comprar o Pinterest </h2> <p> Conforme relatado por <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Financial Times </a> , A Microsoft tentou comprar o Pinterest, o maior quadro de avisos amador do mundo. </p> <p> O Pinterest está avaliado atualmente em cerca de US $ 51 bilhões e seu valor de mercado aumentou mais de 600% durante a pandemia COVID-19, à medida que as pessoas se conectam durante os bloqueios. A notícia da possível aquisição impulsionou as ações do Pinterest até 7 por cento antes da abertura dos mercados na quinta-feira, 11 de fevereiro. </p> <p> A mudança teria trazido o Pinterest para o grupo cada vez maior de grandes aquisições de tecnologia da Microsoft. Em 2016, a Microsoft adquiriu o LinkedIn em um negócio de US $ 26 bilhões, seguido pela compra do Github por US $ 7,5 bilhões em 2018. </p> <p> Isso sem mencionar que a Microsoft é dona do Minecraft, comprou US $ 2,5 bilhões em 2014, e a aquisição em curso da grande holding de jogos, ZeniMax, por US $ 7,5 bilhões. ZeniMax é a empresa-mãe de estúdios de jogos como Bethesda Softworks, id Software, Alpha Dog Games e Tango Gameworks. </p> <p> Além disso, havia um <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> tentativa fracassada de comprar TikTok&#39;s </a> Ativos da América do Norte, Austrália e Nova Zelândia em meados de 2020. O negócio acabou fracassando, mas foi avaliado entre US $ 20-30 bilhões e veio após o ex-presidente <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Trump ameaçou banir </a> a rede social de compartilhamento de vídeo dos EUA inteiramente. </p> <p> Se o negócio com o Pinterest tivesse ocorrido, ou mesmo, se fosse finalizado em uma data posterior, se tornaria a maior aquisição da Microsoft até o momento. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> Por que a Microsoft está comprando tantas empresas de tecnologia? </h2> <p> A Microsoft não tem falta de dinheiro e quer expandir seu império. Suas próprias ações subiram cerca de 80 por cento desde o início da pandemia COVID-19 e recentemente revelou seus lucros recordes. </p> <p> </p> <p> A aquisição de outra plataforma, como o Pinterest, é uma passagem de dados para outros serviços da Microsoft. O grande volume de dados gerados por plataformas como o LinkedIn é a ferramenta perfeita para treinar suas tecnologias de IA. Além disso, assumir e gerenciar um enorme serviço online como o Pinterest também serve como um anúncio para sua plataforma Azure. </p> <p> Como o relatório do Financial Times também alude, a conversa sobre uma fusão tão enorme entre duas empresas de tecnologia também colocaria a administração do presidente Biden à prova. A nova administração está feliz em permitir que gigantes da tecnologia como Microsoft, Google e Facebook comprem a concorrência? Só o tempo irá dizer. </p>"}