{"title":"A última atualização do WatchOS protege contra o bug do Apple Watch-Bricking","content":"<p> A atualização mais recente do watchOS da Apple, versão de software 7.3.1, inclui uma correção muito importante --- resolver um bug que impede que alguns dispositivos Apple Watch Series 5 e Apple Watch SE carreguem quando entram no modo de reserva de energia. </p> <p> A empresa também lançou um novo programa de reparo gratuito para dispositivos afetados que estão presos neste modo de baixo consumo de energia e incapazes de sair dele. Este bug essencialmente &quot;tijolos&quot; seu Apple Watch, tornando-o não mais funcional. </p> <h2 id=\"the-power-reserve-mode-bug\"> O bug do modo de reserva de energia </h2> <p> O modo de reserva de energia é iniciado quando um Apple Watch está com pouca bateria. Ele interrompe a comunicação do Apple Watch com o iPhone. Ele também impede que os usuários acessem outros recursos do Apple Watch. Para sair do modo de reserva de energia, os usuários precisam carregar seu Apple Watch. </p> <p> Com um <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> página de suporte sobre o programa de reparo e bug </a> , datado de 15 de fevereiro, a Apple começa observando: </p> <blockquote> <p> Um número muito pequeno de clientes com modelos Apple Watch Series 5 ou Apple Watch SE executando watchOS 7.2 ou 7.3 tiveram um problema com o relógio não carregando depois de entrar na reserva de energia. </p> </blockquote> <p> Para descobrir se você tem um modelo de Apple Watch afetado, a Apple recomenda colocar o relógio em um carregador e esperar pelo menos 30 minutos. Se não houver cobrança, entre em contato com o Suporte da Apple e eles providenciarão um reparo gratuito pelo correio. </p> <p> Os relógios serão examinados para verificar se são elegíveis e, desde que o sejam, a reparação será efectuada gratuitamente e o relógio reparado devolvido ao seu proprietário. </p> <p> Não está claro exatamente quantos Apple Watches são seriamente afetados pelo bug. No entanto, parece que o problema afeta apenas um subconjunto dos modelos Apple Watch Series 5 ou Apple Watch SE, e nenhum outro modelo. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> Como fazer upgrade para o WatchOS 7.3.1 </h2> <p> Para aqueles que não experimentaram o bug, ainda vale a pena atualizar para a versão mais recente do watchOS apenas para se proteger contra isso potencialmente acontecer. </p> <p> A importância da correção do bug é indicada pelo fato de que a Apple imediatamente distribuiu o watchOS 7.3.1 para todos os usuários. Isso contrasta com a maneira como ele normalmente emite atualizações de software, disponibilizando-as inicialmente aos desenvolvedores para testes beta. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> A Apple lançou o watchOS 7.3 </a> no final de janeiro. </p> <p> Os usuários podem baixar o watchOS 7.3.1 usando o aplicativo Apple Watch no iPhone. Para fazer isso, eles devem ir para <strong> Geral&gt; Atualização de software </strong> . Seu Apple Watch precisa ter pelo menos 50% de bateria para ser atualizado. Ele também deve estar próximo ao seu iPhone. </p>"}