{"title":"Apple corrige um bug do instalador do macOS Big Sur que pode resultar em perda de dados","content":"<p> A Apple corrigiu um bug crítico no instalador do macOS Big Sur que costumava lançar uma mensagem de erro ao tentar atualizar um Mac sem o espaço de armazenamento necessário disponível. </p> <p> Uma atualização revisada do macOS Big Sur 11.2.1, agora disponível no <a href=\"https://apps.apple.com/app/macos-big-sur/id1526878132?mt=12\" target=\"_blank\" rel=\"nofollow noopener\"> Mac App Store </a> , Verifica corretamente se você tem espaço livre suficiente antes de iniciar a instalação, disse o Sr. Macintosh em <a href=\"https://twitter.com/ClassicII_MrMac/status/1361428354306633728\" target=\"_blank\" rel=\"nofollow noopener\"> Twitter </a> . </p> <p> O macOS Big Sur requer 35 gigabytes de espaço de armazenamento livre no disco de inicialização do computador, exceto o próprio instalador de 13 gigabytes. </p> <p> Isso não poderia ter acontecido antes, pois uma das consequências do instalador quebrado é a potencial perda de dados. Para pessoas que não desenvolveram o hábito de <a href=\"https://www.makeuseof.com/how-to-back-up-mac/\" target=\"_blank\" rel=\"nofollow noopener\"> fazendo backup de seu Mac com o Time Machine </a> , esse bug bastante básico pode ter consequências terríveis. </p> <h2 id=\"how-to-install-the-new-update\"> Como instalar a nova atualização </h2> <p> A nova atualização está disponível através de <strong> Preferências do sistema&gt; Atualização de software </strong> no seu Mac. Se houver alguma atualização disponível, clique no botão &quot;Atualizar agora&quot; para instalá-la. Você pode ser solicitado a inserir sua senha de administrador. </p> <p> Você não verá a atualização se a versão revisada do macOS Big Sur 11.2.1 já estiver instalada em seu computador. O instalador revisado carrega um número de compilação de &quot;20D75&quot;. Para ver o número da compilação do software macOS Big Sur instalado no seu Mac, clique no menu Apple e escolha a opção &quot;Sobre este Mac&quot;. </p> <p> </p> <p> Com a janela Sobre este Mac aberta, clique na guia &quot;Visão geral&quot;. Você verá o nome do software do sistema operacional macOS no seu computador, seguido pelo número da versão. Para revelar também o número da compilação, basta clicar no número da versão. </p> <p> Você pode ver qual versão do macOS é a mais recente em um documento de suporte em <a href=\"https://support.apple.com/HT201260\" target=\"_blank\" rel=\"nofollow noopener\"> Site da Apple </a> . </p> <p> </p> <h2 id=\"big-sur-s-broken-free-space-check\"> Verificação de espaço livre quebrado de Big Sur </h2> <p> O problema veio à tona recentemente graças ao Sr. Macintosh, que originalmente relatou o problema. A publicação descobriu que a atualização do Big Sur seria baixada sem problemas, mas se recusava a iniciar porque &quot;Ocorreu um erro ao preparar a atualização do software.&quot; </p> <p> O problema foi atribuído a um erro na verificação de espaço livre de Big Sur. Macintosh diz que as pessoas reclamam disso desde que a primeira versão pública do macOS Big Sur foi lançada em novembro de 2020. Depois que a publicação alertou a Apple sobre o problema, a empresa agiu rapidamente para eliminar o bug desagradável. </p> <p> </p> <p> &quot;A atualização começará mesmo se você tiver apenas 1% de espaço livre restante e falhará,&quot; <a href=\"https://mrmacintosh.com/big-sur-upgrade-not-enough-hd-space-serious-issue-possible-data-loss/\" target=\"_blank\" rel=\"nofollow noopener\"> o post </a> explica. E com a unidade de inicialização quase 100% cheia, o instalador ficava preso em um loop de inicialização sem fim tentando concluir o procedimento de instalação. </p> <p> &quot;Isso o impede de acessar seus dados&quot;, advertiu o Sr. Macintosh. </p> <p> A única maneira de consertar isso exigia apagar e reinstalar o software macOS. Mas com a atualização revisada agora disponível na Mac App Store, os proprietários de Mac podem continuar suas vidas diárias sem se preocupar se a atualização para o Big Sur pode limpar seu disco de inicialização. </p>"}