{"title":"A Canon lança um aplicativo de seleção de fotos que encontra suas melhores fotos","content":"<p> Atrás de quase todas as fotos perfeitas há um rolo de câmera cheio de outras fotos que se parecem quase exatamente com ele. Não é incomum que os fotógrafos quase sempre mantenham o botão do obturador pressionado, com medo de perder um momento fugaz. </p> <p> Examinar dezenas ou talvez centenas de fotos para escolher suas favoritas e liberar espaço de armazenamento pode ser um processo longo e irritante. Felizmente, a Canon lançou um novo aplicativo que faz isso automaticamente para você. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> Faça uma rolagem de fotos com facilidade e reduza-as às melhores </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon USA </a> lançou um aplicativo de seleção de fotos no <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> Loja de aplicativos </a> que permite que você encontre suas melhores fotos de forma rápida e fácil. O aplicativo em si é gratuito, mas para usá-lo, você terá que fazer uma assinatura por $ 14,99 / ano ou $ 2,99 / mês. Ambas as opções de assinatura têm uma avaliação de três dias. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> O vice-presidente executivo da Canon USA, Tatsuro &quot;Tony&quot; Kano, explica: </p> <blockquote> <p> No mundo atual em constante mudança e opressor, onde milhares de fotos são capturadas e armazenadas no smartphone de uma pessoa, os consumidores precisam de uma ferramenta fotográfica especializada, confiável e intuitiva para ajudá-los a decidir as melhores fotos com base em anos de conhecimento e tecnologia confiáveis. </p> </blockquote> <p> O aplicativo da Canon, simplesmente chamado de Photo Culling, opera em uma IA chamada Photography Intelligence Learning ou PHIL, para abreviar. PHIL sugere quais fotos você deve manter e quais excluir com base em qual das duas opções de seleção de fotos você seleciona. </p> <p> A primeira opção, <strong> Abate Inteiro </strong> , é ótimo para <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> melhor fotografia de retrato </a> . Quando esta opção é selecionada, PHIL determinará suas melhores fotos pontuando-as com base em quatro fatores: nitidez, ruído, emoções e se os olhos do objeto estão fechados (se aplicável). </p> <p> Enquanto isso, o <strong> Eliminação semelhante </strong> opção escolhe suas melhores fotos, comparando as pontuações entre fotos semelhantes. Por exemplo, digamos que você tirou um monte de fotos das nuvens e, em seguida, um monte de fotos de algumas flores. O aplicativo separaria as fotos da nuvem e as fotos das flores em grupos separados. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Qualquer que seja a opção de seleção escolhida, se a pontuação de uma foto ultrapassar a pontuação desejada, a foto será considerada um goleiro. PHIL irá então sugerir a exclusão das fotos restantes que não obtiveram pontuação alta o suficiente. Caso você não concorde com PHIL, não se preocupe. Você ainda tem controle total sobre todos os seus tiros. </p> <p> </p> <p> Outros recursos do aplicativo incluem contagem de fotos e informações de exibição de espaço de armazenamento, álbuns de fotos, configurações de parâmetros para pontuações de fotos e a opção de usar o modo escuro. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> Você fará o download do aplicativo Photo Culling da Canon? </h2> <p> Parece que o aplicativo de seleção de fotos da Canon tem tudo que você precisa para tornar o processo de escolha de suas melhores fotos menos tedioso. No entanto, no final do dia, cabe a você decidir se odeia o abate de fotos o suficiente para justificar o pagamento por algo que você mesmo poderia fazer (embora provavelmente muito devagar e entediado). </p> <p> No momento em que este artigo foi escrito, o aplicativo não estava disponível para Android, mas talvez a Canon tenha isso nos cartões para o futuro. </p>"}