{"title":"A Microsoft lança o Azure no espaço com o HPE &amp; # 039; s Spaceborne Computer-2","content":"<p> A Microsoft está indo além do planeta para fornecer serviços extraterrestres. A empresa trabalhará com a Hewlett Packard Enterprises para se conectar a um PC na Estação Espacial Internacional (ISS) por meio de sua plataforma Azure. </p> <p> O Spaceborne Computer-2 se conectará ao Azure por meio de estações terrestres da NASA e HPE, fornecendo grande poder de processamento de dados à estação espacial. </p> <h2 id=\"azure-heads-into-space\"> Azure dirige-se ao espaço </h2> <p> Conforme relatado em <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> o Blog do Microsoft Azure </a> , o Spaceborne Computer-2 (SBC-2) fornecerá aos astronautas da ISS tecnologias mais semelhantes às de seus equivalentes terrestres. </p> <p> A esperança é que reduza drasticamente a quantidade de tempo que leva para transferir dados entre a ISS e a Terra, bem como reduza a quantidade de largura de banda necessária para processamento e análise. </p> <blockquote> <p> Astronautas e exploradores espaciais merecem acesso às melhores tecnologias de computação em nuvem e processamento avançado de última geração. Às vezes, a análise precisa ser feita imediatamente no limite, onde cada momento que passa conta, e outras vezes a análise é tão complexa que só pode ser realizada com o poder da nuvem em hiperescala. </p> </blockquote> <p> O Spaceborne Computer-2 usa o sistema de Borda Convergente Edgeline da Hewlett Packard Enterprises, que é &quot;projetado propositadamente para os ambientes de borda adversa&quot; e trará muitos recursos do Azure para a ISS. </p> <p> Quando a conexão estiver instalada e funcionando, o SBC-2 permitirá a pesquisa em áreas, incluindo modelagem climática para futuras missões a Marte, análise de plantas e hidroponia para apoiar o crescimento de alimentos e safras no espaço e imagens médicas na própria ISS (para apoiar a saúde do astronauta ) </p> <p> O Dr. Mark Fernandez, arquiteto de soluções de sistemas de borda convergente da HPE e investigador principal da Spaceborne Computer-2, disse: </p> <blockquote> <p> Ao reunir o Spaceborne Computer-2 da HPE, que se baseia no sistema HPE Edgeline Converged Edge para computação de ponta avançada e recursos de IA, com o Microsoft Azure para se conectar à nuvem, estamos permitindo que os exploradores do espaço transmitam facilmente grandes conjuntos de dados de e para Earth e beneficie-se de uma experiência de ponta a ponta </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> A próxima fase da iniciativa Espaço Azure da Microsoft </h2> <p> O anúncio da Microsoft é mais um passo em frente para seu <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Espaço Microsoft Azure </a> iniciativa, que lançou em outubro de 2020. </p> <p> A iniciativa Azure Space é o esforço da Microsoft para dar &quot;o próximo salto gigante na computação em nuvem&quot;, trazendo sua plataforma de computação em nuvem Azure para o espaço. </p> <p> </p> <p> Azure Space já trabalhou com o projeto SpaceX Starlink para fornecer banda larga via satélite para seu Azure Modular Datacenter (MDC) e continua seu trabalho no projeto Azure Orbital, que estenderá a conectividade entre seus datacenters em nuvem usando tecnologia de satélite. </p>"}