{"title":"Bite-Sized Brain Food: 5 sites para aprender coisas novas de maneiras curtas e divertidas","content":"<p> Documentários com duração inferior a um minuto. Episódios de podcast de apenas 60 segundos. Infográficos animados para explicar assuntos complexos. É aqui que você pode aprender mais sobre o mundo em cápsulas rápidas de conhecimento envolvente. </p> <p> Em uma era de períodos curtos de atenção e atualizações de 280 personagens, até mesmo o aprendizado precisa ser feito em pequenas doses. É por isso que existem criadores de conteúdo que se especializam em fazer peças informativas e divertidas que quase não levam tempo em nossas vidas ocupadas. De minidocumentários de pessoas e assuntos fascinantes a guias de mídia social sobre tópicos de tendência, dê à sua mente um pouco de alimento cerebral para mastigar. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1 <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 60 segundos documentos </a> (Web): Perfis de pessoas interessantes e tópicos em 60 segundos </h2> <p> </p> <p> Tem um minuto? 60 Second Docs tem uma história legal para contar a você sobre uma pessoa interessante e, por sua vez, um assunto legal. Cada documentário tem apenas 60 segundos de duração, mas cobre o melhor que você precisa saber sobre o assunto. </p> <p> O mais legal é que o 60 Second Docs foca em perfis de pessoas reais, ao invés de conceitos ou tendências. Normalmente, essa pessoa está fazendo algo único, seja começando uma nova tendência, explorando um novo tópico ou ultrapassando os limites de alguma forma. Ao falar sobre a pessoa, você não apenas obtém mais insights sobre o aspecto humano do assunto único, mas também parece mais real e emocional. </p> <p> Todos os 60 Second Docs estão disponíveis em seu canal no YouTube ou canais de mídia social. É uma boa ideia segui-los em qualquer rede social que você frequente, assistindo a cada novo vídeo na íntegra sempre que eles postarem uma atualização. </p> <p> Se você gosta de documentários mais longos, verifique o <strong> Seleção Oficial </strong> página no site 60 Second Docs. Aqui, os editores escolhem documentários de 10-20 minutos que outros filmaram, sobre assuntos que eles acham que você deveria assistir. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2 <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Então você quer falar sobre </a> (Instagram): Mini guias de tópicos políticos e sociais </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> Quem diria que em um mundo de selfies de influenciadores e hashtags promovidas por marcas, o Instagram forneceria uma plataforma para educar? So You Want To Talk About (Sywtta) usa os formatos de postagem de várias imagens do Instagram para criar mini-guias sobre tópicos políticos e sociais. </p> <p> Os assuntos que Sywtta escolhe geralmente lidam com tópicos de tendência, como cancelamento de empréstimos estudantis, direitos negros e história, falácias lógicas, vacinas COVID-19 e muito mais. Cada slide usa uma tipografia lindamente formatada para educar você sobre o assunto e, além disso, cada slide é como uma minilição em si. Cada guia se torna um curso intensivo rápido e informativo, sem ser muito pesado com dados. </p> <p> Em um momento em que você precisa estar atento sobre <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> notícias tendenciosas ou falsas </a> , também é importante observar as filosofias do que você está lendo. Quando se trata de política, Sywtta propaga as visões de políticas progressistas e de esquerda. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3 <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> Ciência de 60 segundos </a> (Podcast): Explicações curtas em áudio sobre ciência, saúde e tecnologia </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Se você preferir ouvir suas informações do que ler ou assistir, confira o podcast de 60 segundos de ciência. Feito pela equipe da Scientific American, este podcast diário aborda tópicos de ciência, medicina e tecnologia e explica um tópico rapidamente. Embora não se restrinja mais ao limite de tempo de um minuto, cada episódio ainda tem menos de cinco minutos. </p> <p> Cada podcast tem diferentes hosts da equipe da Scientific American, cobrindo tópicos como COVID, animais e pássaros, DNA e medicina, ciência ambiental, etc. Eles desfrutam de altos valores de produção, incorporando sons do mundo real sobre o ponto de discussão e frequentemente adicionando clipes de voz de especialistas. </p> <p> Para navegar pelos arquivos de episódios anteriores, visite o site oficial da 60-Second Science. Aqui, você pode filtrar os episódios por tópico (saúde, mente, sustentabilidade, tecnologia, ciências). Se você não quiser informações em intervalos curtos, experimente o podcast completo do Science Talk. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4 <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Animagraffs </a> (Web): Infográficos animados de alta qualidade para explicar as coisas </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> Como funciona a criptomoeda? Quais são os prós e contras do seguro automóvel? Como você faz um moonwalk? O designer e animador Jacob O&#39;Neal divide tópicos complexos em explicações simples e desenha infográficos animados de alta qualidade para ilustrá-los. </p> <p> Animagraffs é uma coleção de breves explicações por meio de guias visuais, usando GIFs animados. Jacob usa uma variedade de técnicas de design, como visualizações em corte transversal para ilustrar cada parte de um instrumento ou imagens grandes com partes móveis onde você pode aumentar e diminuir o zoom como o Google Maps. Cada estilo se adapta ao assunto que você está aprendendo. </p> <p> Os assuntos também são muito abrangentes, incluindo como funciona uma chita, como funcionam os carros elétricos, como um alto-falante emite som e assim por diante. Você também deve verificar a seção &quot;Trabalho do cliente&quot;, onde Jacob mostra trabalhos pagos para marcas. Não se preocupe, embora sejam anúncios, eles são informativos e divertidos. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5 <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Grande História </a> (YouTube): Documentários curtos verdadeiros fascinantes e interessantes </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story encerrou as operações no final de 2020, mas não antes de deixar cinco anos de documentários curtos deliciosos. Mergulhe nos arquivos para encontrar vídeos de aproximadamente 5 minutos sobre uma variedade de tópicos interessantes e pessoas fascinantes de todo o mundo. </p> <p> De um filme em exibição em um teatro indiano por 24 anos ao incrível sorvete turco que não derrete, cada vídeo curto é um olhar de alta qualidade e bem pesquisado sobre o assunto. Diferentemente da maioria dos outros vídeos, os criadores de vídeos do Great Big Story costumam viajar pelo mundo para se colocar no meio da história. Classifique pelos mais populares ou use as várias listas de reprodução personalizadas recomendadas pelos criadores. </p> <p> No canal, você também encontrará alguns vídeos mais longos, com cerca de 10 a 15 minutos de duração. Geralmente são listas e compilações, que incluem alguns clipes dos vídeos mais curtos. Se você tiver tempo para descobrir mais sobre o mundo ao nosso redor, você não pode errar com isso. Mesmo depois de fechar as venezianas, a Great Big Story é uma das mais <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> canais fascinantes e educacionais no YouTube </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Use o aprendizado por gotejamento para conquistar grandes assuntos </h2> <p> Esses sites e podcasts se concentram em transformar cada novo assunto em um pacote de informações compacto e divertido. É uma ótima maneira de aprender coisas novas em pequenas mordidas. Mas você também pode aplicar a mesma filosofia para aprender sobre assuntos mais complexos e maiores. </p> <p> Cada vez mais, o aprendizado por gotejamento ou microlearning é uma forma popular de obter educação. Recebendo <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> Aulas pequenas todos os dias </a> , você pode abordar tópicos como programação, design, desenvolvimento de aplicativos, gerenciamento de produtos e muito mais. Uma rápida pesquisa na web deve ajudá-lo a encontrar uma versão de aprendizagem direta de tudo o que você está procurando para se educar. </p>"}