{"title":"BitPay traz Bitcoin para Apple Pay","content":"<p> Os usuários do BitPay nos EUA agora podem adicionar seus cartões pré-pagos de bitcoin ao aplicativo Wallet da Apple <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> use-o para pagar coisas com o Apple Pay </a> . Clientes que não são da Apple em breve poderão adicionar seus cartões BitPay da marca MasterCard ao Google Pay e Samsung Pay. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> Como adicionar seu cartão BitPay à carteira da Apple </h2> <p> Para adicionar seu cartão BitPay a um dispositivo Apple, abra o aplicativo Wallet em seu iPhone e toque em &quot;+&quot; no canto superior direito e siga as instruções na tela para terminar de adicionar o cartão. </p> <p> Com seu BitPay no aplicativo Wallet, você pode adicionar o cartão ao Apple Pay acessando <strong> Configurações&gt; Wallet e Apple Pay </strong> e toque na opção &quot;Adicionar cartão&quot;. Para se tornar um usuário BitPay e solicitar seu cartão pré-pago, baixe o aplicativo BitPay Wallet do <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> Loja de aplicativos </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Uma nova maneira de gastar com a Apple Pay </h2> <p> Uma postagem no <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog do BitPay </a> afirma que adicionar um cartão BitPay ao Apple Pay é uma maneira conveniente de gastar criptomoedas em mais lugares do que antes. &quot;Temos milhares de clientes do aplicativo BitPay Wallet usando o cartão BitPay que estão sempre procurando novos lugares e maneiras de gastar sua criptografia&quot;, disse Stephen Pair, CEO da BitPay <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> Comunicado de imprensa </a> . </p> <p> </p> <p> Com o Apple Pay, os titulares de cartões BitPay podem fazer compras seguras sem contato em lojas físicas, aplicativos que suportam Apple Pay e na web. A empresa observa que os clientes que aguardam a entrega de um cartão de plástico podem adicionar sua contraparte virtual à Apple Wallet através do aplicativo oficial BitPay Wallet. Isso permitirá que você comece a gastar imediatamente. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> O que é o cartão BitPay? </h2> <p> Um cartão pré-pago que usa a rede Mastercard, o cartão BitPay torna mais fácil fazer pagamentos sem contato e pagamentos com PIN, bem como retirar dinheiro de qualquer caixa eletrônico compatível. Com o aplicativo, os clientes podem fazer coisas como visualizar seu saldo, solicitar um novo PIN, recarregar instantaneamente, bem como converter criptomoeda em moeda fiduciária (que é carregada no cartão, pronta para ser gasta em qualquer lugar que o débito Mastercard seja aceito globalmente). </p> <blockquote> <p> Para usuários de power blockchain, o aplicativo BitPay Wallet suporta uma variedade de opções para comprar e armazenar criptografia e fazer pagamentos online. Os usuários podem comprar cartões-presente instantaneamente de centenas dos principais varejistas na loja e online. </p> </blockquote> <p> O cartão possui um chip EMV e pode ser bloqueado em caso de emergência com o aplicativo. </p> <p> De acordo com a empresa, o suporte para Google Pay e Samsung Pay está planejado &quot;para o final deste trimestre&quot;. Quanto ao aplicativo BitPay, ele atualmente suporta Bitcoin, Bitcoin Cash e Ether, bem como quatro stablecoins indexados ao dólar, criptomoedas USDC, GUSD, PAX e BUSD. </p>"}