{"title":"Cartão de saúde inteligente vs. passaporte de vacinação digital: Qual é a grande diferença?","content":"<p> A pandemia COVID-19 deixou os sistemas de saúde cambaleantes. Agora, a perspectiva de passaportes de saúde digitais e cartões de saúde inteligentes estão ganhando ritmo à medida que governos e empresas tentam retornar à normalidade. </p> <p> Então, o que é um cartão de saúde inteligente e é o mesmo que um passaporte de saúde? </p> <h2 id=\"what-is-a-smart-health-card\"> O que é um cartão de saúde inteligente? </h2> <p> Um cartão de saúde inteligente é um plástico fino com um chip de circuito integrado embutido que contém dados criptografados. </p> <p> O que o torna inteligente é o chip que atua como um supercomputador. O chip pode ser programado para realizar diferentes ações com inúmeras aplicações, enquanto os leitores conectados a um sistema de computador podem acessar ou atualizar os dados do chip. </p> <p> Pode parecer um cartão de crédito, mas funciona de maneira diferente. Usado em muitos países da Europa e do mundo, um cartão inteligente de saúde armazena informações de saúde, cobertura de seguro e outros dados médicos vitais. </p> <p> </p> <h2 id=\"advantages-of-using-a-smart-health-card\"> Vantagens de usar um cartão de saúde inteligente </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Saúde na França: o que é uma &amp; # 39; Carte Vitale &quot;? <a href=\"https://t.co/5VVcTjZyxh\"> https://t.co/5VVcTjZyxh </a> <a href=\"https://t.co/6I0TCy70wg\"> pic.twitter.com/6I0TCy70wg </a></p> - FrenchEntrée (@FrenchEntree) <a href=\"https://twitter.com/FrenchEntree/status/738646709308379136?ref_src=twsrc%5Etfw\"> 3 de junho de 2016 </a></blockquote>  <p> Entre muitas outras vantagens de usar este sistema, a mais crucial é melhorar o atendimento crítico ou de emergência. Os cartões de saúde inteligentes fornecem acesso imediato aos dados de saúde do paciente ou registros médicos em emergências. </p> <p> Por exemplo, um socorrista com um leitor de cartão portátil terá informações imediatas sobre o paciente enquanto estiver na ambulância a caminho do hospital. Isso é ainda mais importante quando o paciente está inconsciente, sem resposta ou simplesmente incapaz de fornecer ao atendente suas informações de saúde. </p> <p> Imagine um socorrista que possa encaminhar dados críticos do paciente para a equipe de emergência antes da chegada da ambulância. Isso ajudará a equipe do pronto-socorro a preparar o que é necessário para tratar o paciente antes mesmo da chegada. </p> <p> A transferência rápida e eficiente de dados do paciente durante o tratamento intensivo pode melhorar muito o tempo de resposta, salvando vidas. </p> <h3 id=\"seamless-transfer-of-data\"> Transferência perfeita de dados </h3> <p> O uso desse sistema também fornece uma transferência mais precisa e fluida de informações do paciente da equipe da sala de emergência para os prestadores de cuidados de saúde no atendimento ao paciente. </p> <p> Os médicos não terão que confiar na memória do paciente para <a href=\"https://www.makeuseof.com/tag/google-store-medical-data-cloud/\" target=\"_blank\" rel=\"nofollow noopener\"> recuperar dados médicos críticos </a> , o que reduz as chances de erro. Além disso, um sistema de cartão de saúde inteligente oferece uma troca perfeita de informações do paciente entre médicos. </p> <p> Isso diminui as chances de vazamento de dados críticos do paciente (que podem ser usados ​​para <a href=\"https://www.makeuseof.com/tag/the-10-pieces-of-information-identity-thieves-are-looking-for/\" target=\"_blank\" rel=\"nofollow noopener\"> roubo de identidade </a> ) Isso geralmente acontece quando as informações do paciente são compartilhadas por fax, telefone ou e-mail. </p> <h3 id=\"easier-storage-and-retrieval-of-medical-records\"> Armazenamento e recuperação mais fáceis de registros médicos </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"it\" dir=\"ltr\"> Tessera sanitaria: come richiederne un duplicato <a href=\"https://t.co/2GrFWpanC2\"> https://t.co/2GrFWpanC2 </a> <a href=\"https://t.co/JKR6ampnXq\"> pic.twitter.com/JKR6ampnXq </a></p> - CataniaToday (@CataniaToday) <a href=\"https://twitter.com/CataniaToday/status/1359189830937300995?ref_src=twsrc%5Etfw\"> 9 de fevereiro de 2021 </a></blockquote>  <p> O sistema fornece aos pacientes uma maneira conveniente e descomplicada de transportar resultados de exames laboratoriais ou notas médicas. </p> <p> É como ter um banco de dados de informações de saúde - exames anteriores, tratamentos e arquivos para cobertura de seguro - em um pequeno cartão na carteira do paciente Não há mais necessidade de arrastar pedaços de papel para uma consulta médica. </p> <h3 id=\"reduces-medical-errors-and-duplicate-testing\"> Reduz erros médicos e testes duplicados </h3> <p> O sistema de saúde do país pode até mesmo se beneficiar disso, uma vez que erros médicos e testes duplicados podem ser evitados. Erros médicos que vêm com entrada inadequada de dados, barreiras de idioma ou falha de comunicação podem ser minimizados por meio deste sistema. </p> <p> O erro humano às vezes pode causar uma incompatibilidade de pacientes e registros. Ter um cartão inteligente de saúde permite que os profissionais de saúde combinem facilmente o paciente com os registros de saúde corretos. Isso diminui as chances de ter registros duplicados ou vários testes redundantes, o que pode custar muito dinheiro. Isso poderia economizar despesas desnecessárias do sistema de saúde. </p> <h3 id=\"more-accurate-verification-of-insurance-coverage\"> Verificação mais precisa da cobertura de seguro </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Passeio pela cidade? Viagem de trabalho? Feriados? Para sua tranquilidade, leve sempre consigo o seu Cartão Europeu de Seguro de Doença! <a href=\"https://t.co/31zoREZAEy\"> https://t.co/31zoREZAEy </a> <a href=\"https://twitter.com/hashtag/EHIC?src=hash&ref_src=twsrc%5Etfw\"> #EHIC </a> <a href=\"https://t.co/o05Jx8aIwq\"> pic.twitter.com/o05Jx8aIwq </a></p> - Comissão Europeia 🇪🇺 (@EU_Commission) <a href=\"https://twitter.com/EU_Commission/status/893485278114992128?ref_src=twsrc%5Etfw\"> 4 de agosto de 2017 </a></blockquote>  <p> O roubo de identidade médica se tornou um problema sério nos últimos anos. O crime envolve o uso fraudulento de informações de seguro saúde para acessar serviços de saúde ou receber reembolso. Simplificando, uma pessoa que não está coberta por uma apólice pode roubar as informações do seguro saúde de outra pessoa para obter benefícios. </p> <p> As violações do sistema de assistência médica ou seguro-saúde geralmente deixam vazar informações de identificação pessoal (PII) que os hackers podem vender na dark web. As PII podem incluir informações de seguro saúde. </p> <p> Isso é o que os ladrões usam para acessar serviços de saúde aos quais eles não deveriam ter acesso. Eles podem comprar medicamentos controlados ou registrar reivindicações de seguro fraudulentas para procedimentos que nunca foram realizados. </p> <p> Um sistema de cartão de saúde inteligente pode evitar tudo isso, já que a maioria usa protocolos de autenticação e segurança. Alguns podem usar autenticação de 2 fatores (2FA) ou autenticação multifator (MFA), enquanto outros têm um recurso biométrico que verifica as impressões digitais do paciente para verificar sua identidade. </p> <p> </p> <h2 id=\"disadvantages-of-using-a-smart-health-card-system\"> Desvantagens de usar um sistema de cartão de saúde inteligente </h2> <p> As questões de privacidade continuam sendo a maior preocupação que impede os usuários de adaptar a tecnologia para fins médicos. Muitos manifestaram a preocupação de fornecer às pessoas acesso fácil a uma infinidade de dados confidenciais, como tratamentos, registros de doenças e medicamentos. E com as notícias de sistemas de saúde e seguros se tornando vítimas de violações de dados, essas preocupações não são exatamente infundadas. </p> <p> Ter todos os registros em um só lugar pode ser conveniente, mas um único <a href=\"https://www.makeuseof.com/tag/healthcare-new-attack-vector-scammers-id-thieves/\" target=\"_blank\" rel=\"nofollow noopener\"> violação de dados </a> pode colocar dados altamente confidenciais nas mãos erradas. </p> <h3 id=\"creating-digital-divide\"> Criando divisão digital </h3> <p> Depois, há a questão de criar uma divisão digital. Muitos argumentam que os cartões inteligentes de saúde só podem ser usados ​​por hospitais e comunidades com acesso ao sistema. Para tirar vantagem dessa tecnologia, a máquina de um hospital deve oferecer suporte ao mesmo software, interface de leitor de cartão inteligente e deve ser capaz de oferecer suporte ao hardware necessário. </p> <p> Por falar em hardware, há também a questão dos custos adicionais. O hardware do sistema, o software do leitor e a rede com o banco de dados podem custar milhões e custar ainda mais para manter. Até os próprios cartões de plástico custam dinheiro para serem produzidos. </p> <p> Quem fará o investimento inicial? Além disso, quanto tempo antes que esse investimento inicial traga benefícios para o governo e seus cidadãos? </p> <h3 id=\"bugs-and-power-failures\"> Erros e falhas de energia </h3> <p> Claro, esse tipo de tecnologia não é imune a bugs e falhas ou ataques cibernéticos que podem causar vazamentos de dados. Um único dispositivo não corrigido no sistema pode se tornar um gateway para malware que pode causar danos à rede e ao banco de dados. </p> <p> Também existem preocupações sobre quedas de energia. Como isso pode ser sustentado em comunidades com energia limitada ou problemas de infraestrutura de energia? Mesmo os sistemas de energia mais sofisticados podem falhar em grandes desastres. Imagine não ter acesso a dados médicos durante um desastre. </p> <p> </p> <h2 id=\"smart-healthcare-vs-digital-vaccination-passport\"> Smart Healthcare vs. Passaporte digital de vacinação </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Grandes nomes em tecnologia e saúde, incluindo Mayo Clinic, Cigna&#39;s Evernorth e Microsoft estão se unindo para criar um passaporte digital de vacinação COVID-19. <a href=\"https://t.co/KgTVjq9lUe\"> https://t.co/KgTVjq9lUe </a> <a href=\"https://t.co/ZiJIE8xoTY\"> pic.twitter.com/ZiJIE8xoTY </a></p> - Mast Health (@MastAnalytics) <a href=\"https://twitter.com/MastAnalytics/status/1351683116990164993?ref_src=twsrc%5Etfw\"> 20 de janeiro de 2021 </a></blockquote>  <p> Tem havido conversas sobre um passaporte digital de vacinação para viagens e acesso a shows ou reuniões pós-Covid. Embora um passaporte digital de saúde possa parecer semelhante aos cartões inteligentes de saúde usados ​​em países como Alemanha, França e Áustria, existem diferenças importantes. </p> <p> </p> <p> Primeiro, o passaporte digital da vacina COVID-19 virá na forma de um certificado digital baixado para o telefone de uma pessoa. O certificado digital ou passaporte de vacina da Covid é um passe com o nome do paciente e os detalhes da vacina da Covid (data de administração, fabricante da vacina, local da vacinação). É um documento digital de uma página com um código de barras ou código QR que pode ser digitalizado nos pontos de entrada. </p> <p> Ao contrário do cartão inteligente de saúde, o passaporte digital de saúde não se destina a ser um cartão de plástico físico. </p> <p> Ele terá apenas informações relacionadas aos testes COVID-19 da pessoa, registros de vacinação e unidades de saúde onde essas vacinações e testes foram realizados. Não terá todo o histórico médico do paciente. </p> <p> Esses passaportes de saúde digitais darão às pessoas acesso a reuniões como shows e locais de trabalho, onde entrarão em contato com muitas pessoas ou darão a elas acesso a países assim que a viagem adquirir algum senso de normalidade. Pessoas sem smartphone podem imprimir seus códigos, lidos no ponto de entrada. </p> <h3 id=\"breach-of-privacy-and-curtailment-of-human-rights\"> Violação de privacidade e restrição dos direitos humanos </h3> <p> Enquanto muitos estão ansiosos para receber o jab, baixar um passaporte digital de vacinação e voltar ao normal, alguns estão alertando sobre as possíveis repercussões da introdução dessa tecnologia. Especialistas e defensores dos direitos humanos estão alertando os desenvolvedores para abordar questões potenciais de privacidade de dados e direitos humanos que um passaporte de vacinação pode trazer. </p> <p> Pesquisa publicada pela <a href=\"https://socialsciences.exeter.ac.uk/media/universityofexeter/collegeofsocialsciencesandinternationalstudies/lawimages/research/Policy_brief_-_Digital_Health_Passports_COVID-19_-_Beduschi.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Faculdade de Direito da Universidade de Exeter </a> adverte como este passaporte pode restringir direitos humanos fundamentais, incluindo o direito à privacidade, liberdade de movimento e reunião pacífica. </p> <p> De acordo com o relatório, o problema vem do uso do passaporte de informações pessoais de saúde confidenciais (como isso será armazenado, quem terá acesso a elas?) E como isso pode criar uma nova divisão entre as pessoas com base em seu estado de saúde. </p> <p> O passaporte também pode determinar ou limitar potencialmente o grau em que uma pessoa goza de direitos e liberdades. O uso de passaportes de saúde digitais, alertam os especialistas, pode aprofundar as desigualdades entre as comunidades que têm acesso imediato a vacinas ou passaportes de saúde e aquelas que não têm. </p> <p> </p> <h2 id=\"future-of-healthcare\"> Futuro da Saúde </h2> <p> Países como a França usam cartões de saúde inteligentes desde os anos 90, com outros países fazendo o mesmo no início dos anos 2000. </p> <p> A adoção dessa tecnologia tem sido bastante lenta em países como os Estados Unidos, apontando as questões de privacidade como a principal preocupação. Embora haja muitas vantagens em adotar este sistema, também existem várias desvantagens que merecem uma consideração cuidadosa. </p>"}