{"title":"Como os principais serviços de mensagens instantâneas usam criptografia de ponta a ponta","content":"<p> Os dados pessoais são mais importantes do que nunca. Governos, empresas e cibercriminosos anseiam por dados pessoais das pessoas para servir a seus interesses. Diferentes plataformas online tornaram mais fácil o fornecimento de dados pessoais sem o nosso conhecimento. </p> <p> Por esse motivo, é importante ter um bom entendimento de como as plataformas que você usa online protegem sua privacidade. Um dos principais fatores a serem observados ao considerar as medidas de proteção dos aplicativos de mensagens é a criptografia de ponta a ponta. </p> <p> Reconhecendo a necessidade de priorizar a privacidade dos dados, mais aplicativos de mensagens tomaram medidas significativas para implementar a criptografia ponta a ponta. </p> <h2 id=\"what-is-end-to-end-encryption\"> O que é criptografia de ponta a ponta? </h2> <p> </p> <p> A criptografia de ponta a ponta é <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> um método de criptografar comunicações </a> para que terceiros não sejam capazes de acessar informações compartilhadas entre pessoas que trocam mensagens. </p> <p> Com a criptografia de ponta a ponta, um código secreto, em vez de texto simples, é usado para ocultar o conteúdo das mensagens. Isso significa que apenas aqueles que se comunicam em uma plataforma criptografada de ponta a ponta podem ler as mensagens enviadas entre si. </p> <p> Vejamos como três serviços populares de mensagens seguras, Signal, WhatsApp e Telegram, usam criptografia de ponta a ponta. </p> <p> </p> <h2 id=\"signal\"> Sinal </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> O Signal é considerado um dos aplicativos de mensagens mais seguros. Todas as comunicações na plataforma são criptografadas de ponta a ponta por padrão. </p> <p> O Signal não faz backup de mensagens na nuvem, o que reduz os riscos de malfeitores usando métodos alternativos para adquirir informações. Ele também criptografa os metadados das mensagens para que o local e a hora das atividades de mensagens não sejam rastreados. </p> <p> Com um mecanismo de criptografia de código aberto, o público se beneficia de níveis mais altos de transparência na tecnologia por trás de suas atividades de mensagens. Os usuários podem olhar mais de perto os detalhes técnicos para entender melhor os métodos usados ​​para proteger sua privacidade. </p> <p> As plataformas de código aberto podem tornar o software muito mais fácil e seguro de usar a longo prazo. As pessoas não apenas podem entender melhor como o software funciona, mas também podem tentar configurar sua própria versão do aplicativo, que pode ser mais adequada para suas necessidades de segurança exclusivas. </p> <p> O Signal usa uma combinação de OTR, conhecida como Multi-Party Off-the-Record Messaging, que torna possível criptografar de ponta a ponta mensagens em bate-papos em grupo. Os riscos de violações de dados podem aumentar à medida que o número de participantes em uma rede aumenta. Com o bate-papo em grupo criptografado de ponta a ponta, esses riscos são reduzidos significativamente. </p> <p> </p> <h2 id=\"whatsapp\"> Whatsapp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> O WhatsApp foi um dos primeiros aplicativos de mensagens populares a permitir a criptografia de ponta a ponta. Ele usa criptografia de ponta a ponta para mensagens e chamadas. </p> <p> O WhatsApp usa o protocolo de criptografia ponta a ponta desenvolvido pela Open Whisper Systems, a equipe por trás do Signal Messenger. Esta é uma grande vantagem para o aplicativo, considerando o quão seguro é o protocolo de criptografia do Signal. </p> <p> </p> <p> O uso de sua própria implantação proprietária pelo WhatsApp significa que ele pode não ser examinado com tanta frequência por uma ampla gama de pesquisadores de segurança quanto o software de código aberto Signal. </p> <p> Apesar da criptografia de mensagens, outras maneiras podem ser usadas para saber mais sobre as mensagens enviadas no WhatsApp, já que as mensagens podem ser copiadas na nuvem e os metadados no aplicativo não são criptografados. Isso facilita saber a hora e a localização das mensagens. Além disso, surgiram relatórios de bate-papos em grupo do WhatsApp indexados na pesquisa do Google, colocando em questão a segurança de seus bate-papos em grupo. </p> <p> </p> <h2 id=\"telegram\"> Telegrama </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> O Telegram é amado por seu uso de criptografia e suas mensagens autodestrutivas. Infelizmente, existem vários problemas de criptografia de ponta a ponta com o Telegram que podem não parecer tão óbvios para muitos usuários. </p> <p> No Telegram, a criptografia ponta a ponta não é habilitada por padrão. Só é oferecido quando os usuários mudam para bate-papos secretos. Para usuários que não são tecnicamente inclinados, isso apresenta riscos de segurança dos quais eles podem nem estar cientes. </p> <p> O Telegram pode acessar mensagens armazenadas em seus servidores que são copiados em sua nuvem. Alguns acreditam que isso representa vetores adicionais de ataque que podem levar a violações de dados pessoais nos casos em que os cibercriminosos tentam roubar dados de mensagens do aplicativo. </p> <p> Dito isso, todos os bate-papos secretos no Telegram são específicos do dispositivo, o que significa que as mensagens enviadas por meio de bate-papos secretos só podem ser acessadas no dispositivo de onde foram enviadas. </p> <p> Enquanto os bate-papos secretos do Telegram são criptografados de ponta a ponta, os bate-papos em grupo não são. Isso significa que os usuários podem usar vários dispositivos para o mesmo bate-papo em grupo. Os logs de bate-papo podem ser baixados em vários dispositivos pelos usuários. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Bate-papos secretos em <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #Telegrama </a> significa que suas mensagens são protegidas por criptografia de ponta a ponta e são excluídas após um determinado período de tempo. <br><br> Veja como você pode ativar esse recurso. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> - Kaspersky (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 31 de janeiro de 2021 </a></blockquote>  <p> O Telegram cria visualizações de links em seus servidores remotos de bate-papos normais e secretos. Quando um usuário digita um link pela primeira vez em um bate-papo secreto, o aplicativo avisa que os links serão enviados para servidores remotos. Isso é considerado um ponto fraco de segurança, pois o envio de links compartilhados em um chat privado para um servidor remoto vai contra o propósito da criptografia ponta a ponta. </p> <p> O protocolo de criptografia do Telegram, MTProto, foi projetado para acessar uma API de servidor a partir de aplicativos no celular. É proprietário e apenas parcialmente de código aberto. Isso coloca em questão quanto controle e compreensão o público tem sobre os métodos de criptografia usados ​​para proteger suas mensagens. </p> <p> Felizmente, o aplicativo de mensagens não enfrentou reivindicações sérias sobre violações de dados, mas é preocupante saber que é possível que seus operadores acessem suas mensagens. </p> <p> Apesar das preocupações, muitos podem ficar tranquilos com os vários obstáculos jurídicos que precisariam ser superados para acessar as mensagens. O Telegram deixou claro no passado como é difícil para as pessoas acessarem mensagens em sua plataforma. As chaves precisariam ser acessadas de jurisdições diferentes, o que frustraria muitas pessoas. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> Escolhendo o aplicativo de mensagens mais seguro </h2> <p> Embora o Signal possa não ser tão popular quanto o WhatsApp, seu protocolo tem servido como um fator contribuinte significativo para o sucesso do WhatsApp com criptografia ponta a ponta. Embora seus métodos de criptografia de ponta a ponta sejam semelhantes ao WhatsApp, ele é considerado melhor do que o WhatsApp para criptografia de ponta a ponta. Ele se distingue por tomar medidas extras para proteger os usuários. </p> <p> A decisão do Telegram de não priorizar a criptografia ponta a ponta foi atribuída à sua preferência por conveniência. Onde falta criptografia, ele compensa, com seus métodos indiretos de proteção de usuários com criptografia em nuvem e armazenamento de chaves em diferentes jurisdições legais. </p>"}