{"title":"Como usar o aplicativo de treino Apple Watch","content":"<p> Compreender melhor o seu progresso físico está a apenas um toque de distância com o Apple Watch. </p> <p> Estamos dando uma olhada em tudo o que o aplicativo Apple Watch Workout tem a oferecer, incluindo como o aplicativo funciona, quais tipos de exercícios ele pode rastrear e como visualizar todas as informações que coleta. </p> <h2 id=\"getting-started-with-the-workout-app\"> Primeiros passos com o aplicativo de treino </h2> <p> Você pode abrir o aplicativo Workout em um Apple Watch de várias maneiras. Primeiro, basta clicar uma vez no <strong> Coroa digital </strong> para abrir a lista de aplicativos em seu relógio. Então selecione <strong> Treino </strong> . </p> <p> Uma maneira ainda mais rápida é usar o Siri, pressionando longamente o <strong> Coroa digital </strong> ou levando o relógio à boca. Em seguida, basta dizer &quot;Abra o aplicativo Workout&quot;. </p> <p> Depois de abrir o aplicativo, você verá uma grande variedade de tipos de exercícios - de arco e flecha a ioga e tudo mais. </p> <p> A tela principal de seleção de exercícios é destacada pelas opções mais populares. Role até o final da lista e selecione <strong> Adicionar treino </strong> para ver uma lista de outros tipos de exercícios. Se por algum motivo você não vir seu tipo de treino, você também pode selecionar <strong> Outro </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> Você pode selecionar o <strong> três pontos </strong> ( <strong> ... </strong> ) em cada tipo de exercício para definir uma meta específica de distância, calorias queimadas ou tempo. Se alguma dessas metas não lhe interessar, basta tocar no nome do treino para começar imediatamente. </p> <p> Haverá uma contagem regressiva de três segundos na tela antes que o rastreamento comece. </p> <p> Todos os recursos do aplicativo Workout estão disponíveis sem um iPhone por perto ou usando apenas um Apple Watch conectado a um Wi-Fi ou sinal de celular. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Entenda o aplicativo de treino </h2> <p> Existem três telas principais no aplicativo. Você pode alternar entre eles deslizando para a esquerda ou para a direita. </p> <p> A tela principal mostrará todo o seu progresso no tipo de exercício selecionado. Você verá o tempo de treino, as calorias ativas, o total de calorias e a frequência cardíaca atual. Dependendo do tipo de treino, você também pode ver a distância percorrida. </p> <p> Se você tiver um Apple Watch Series 5 ou posterior e tiver a tela sempre ligada ativada, poderá sempre ver as estatísticas do seu treino. Qualquer pessoa com um modelo mais antigo precisará levantar ou tocar na tela para ver essas informações. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Quando você está correndo ou caminhando, o Apple Watch dá um toque suave a cada milha ou quilômetro e mostra uma atualização com informações sobre o ritmo. Uma recapitulação e toque de bicicleta ocorrerão a cada cinco milhas ou quilômetros. </p> <p> Se você estiver fazendo um treino Apple Fitness +, poderá ver os dados no aplicativo Workout e na tela do iPhone, iPad ou Apple Watch. </p> <p> </p> <p> Deslizar para a direita na tela principal irá mostrar quatro opções diferentes— <strong> Trancar </strong> , <strong> Novo </strong> , <strong> Fim </strong> , e <strong> Pausa </strong> . </p> <p> Selecionando <strong> Trancar </strong> irá bloquear a tela para evitar toques acidentais. Você pode girar a coroa digital para desbloquear a tela. Apenas para observar, esta opção será ativada automaticamente durante qualquer tipo de treino de natação para evitar torneiras acidentais de gotas de água. </p> <p> Como você provavelmente pode imaginar, <strong> Novo </strong> termina o treino atual e permite que você escolha um novo tipo de exercício para começar novamente. Selecionando <strong> Fim </strong> irá terminar o treino atual. </p> <p> Se você for interrompido, você pode selecionar o <strong> Pausa </strong> botão. Pressioná-lo novamente iniciará o rastreamento do exercício. Você também pode fazer isso pressionando a coroa digital e o botão lateral simultaneamente. </p> <p> Deslizar para a esquerda na tela principal do exercício mostra os controles de reprodução de mídia. Essa é uma maneira fácil de acessar sua música ou qualquer outra coisa que você esteja ouvindo enquanto se exercita. Você pode pular faixas, reproduzir, pausar e aumentar ou diminuir o volume. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Lembretes automáticos de treino </h2> <p> Não há necessidade de se preocupar se você se esquecer de começar um treino. Contanto que você tenha o watchOS 5 ou posterior, um Apple Watch pode reconhecer automaticamente quando você está treinando. Ele vai tocar em seu pulso e perguntar se você deseja gravar um treino, permitindo que você altere o tipo de treino, silencie essas notificações durante o dia ou apenas ignore esta notificação. </p> <p> Embora possa demorar alguns minutos para que a notificação apareça, todo o crédito do treino ainda é salvo. </p> <p> Você pode receber lembretes de exercícios para os seguintes tipos de exercícios: caminhada interna, caminhada externa, corrida interna, corrida externa, elíptica, remador, natação na piscina e natação em águas abertas. </p> <p> Para ativar ou desativar o recurso, vá para <strong> Configurações&gt; Treino&gt; Lembrete de início de treino </strong> no seu Apple Watch. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> O Apple Watch também pode detectar quando um treino é concluído. Após um toque, você verá uma notificação na tela com opções para encerrar ou pausar o treino. Você também pode descartar completamente a notificação e continuar o treino. </p> <p> Alterne o recurso indo para o seu Apple Watch e indo para <strong> Configurações&gt; Treino&gt; Lembrete de fim de treino </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Personalize os dados mostrados no aplicativo de treino </h2> <p> No modo de exibição de treino do Apple Watch, você pode personalizar as informações mostradas na tela para muitos tipos diferentes de treino. </p> <p> Para começar, abra o aplicativo complementar Watch no seu iPhone. No <strong> Meu relógio </strong> selecionar guia <strong> Treino </strong> . Então escolha <strong> Vista de treino </strong> . Na parte superior da página, você pode selecionar se deseja mostrar uma ou várias métricas na tela durante um treino. Se você selecionar <strong> Métrica Única </strong> , basta rolar a coroa digital para ver mais dados no seu Apple Watch. </p> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (3 imagens) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Expandir <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Expandir <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> Abaixo disso, você também pode ver vários tipos de exercícios diferentes, onde pode editar as informações mostradas na tela. Selecione um tipo de treino e depois escolha <strong> Editar </strong> no canto superior direito da tela para personalizar o que é mostrado na tela e em que ordem. </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Visualizando dados de treino no aplicativo de condicionamento físico </h2> <p> Depois de terminar o treino, todos os dados estão a apenas alguns toques de distância no seu iPhone. </p> <p> Para ver, abra o <strong> Ginástica </strong> aplicativo. </p> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (2 imagens) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> Debaixo de <strong> Resumo </strong> guia, selecione <strong> Treinos </strong> . Você verá informações sobre todos os seus treinos. Os dados também estão disponíveis no <strong> Saúde </strong> aplicativo. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Comece a suar com o aplicativo de treino Apple Watch </h2> <p> Como você pode ver, o aplicativo Apple Watch Workout é uma ótima maneira de ajudar a manter o controle de todas as suas diferentes métricas de condicionamento físico enquanto faz tudo, desde natação, dança e muito mais. </p> <p> E quando você estiver pronto para encerrar a noite e ir para a cama, o Apple Watch ainda pode ser uma grande ajuda com o recurso de rastreamento de sono integrado. </p>"}