{"title":"Câmera Sony FX3 revelada por vazamento no Twitter","content":"<p> Faz apenas duas semanas desde que a Sony anunciou o lançamento da Sony A1, uma câmera de 8.6K que pode capturar imagens de 50MP a até 30fps. Mas a empresa está agitando um pouco mais? </p> <p> Tudo o que temos agora são mera especulação, mas a Sony poderia estar adicionando uma nova câmera compacta e elegante à sua série FX. </p> <h2 id=\"a-preview-of-the-sony-fx3\"> Uma prévia do Sony FX3 </h2> <p> Na quarta-feira, Nokishita tweetou uma imagem da Sony FX3, uma câmera que pode estar procurando desafiar a Canon EOS C70 e a Blackmagic Design Pocket Cinema 6K. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> ソ ニ ー FX3 の 画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> # 噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> - 軒 下 デ ジ カ メ 情報 局 (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> 10 de fevereiro de 2021 </a></blockquote>  <p> Nokishita é um blog de tecnologia japonês famoso por vazamentos precoces de equipamentos de foto e vídeo que virão. Apesar de não ser fonte oficial de nenhuma empresa de produtos ópticos, algumas pessoas chegam a dizer que as informações compartilhadas por Nokishita também podem ser confirmadas. </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> TechRadar </a> outrora chamado Nokishita de &quot;Papai Noel dos rumores das câmeras&quot;. Em resposta ao tweet acima, o usuário do Twitter @miemelaar perguntou &quot;[é] real ou um conceito?&quot; e @rauuru_san respondeu com &quot;se Nokishita publicar, é real.&quot; </p> <p> Mas mesmo que presumíssemos que o vazamento era verdadeiro, quanta informação isso nos deixaria, realmente? </p> <p> Podemos assumir que o FX3 faz parte da linha FX por causa de seu nome, mas a câmera traz um símbolo que está deixando muitos especuladores confusos. Se aquela marca Alfa branca (α) na frente da câmera lhe parece familiar, é porque você pode encontrar a mesma nas câmeras sem espelho da Sony. </p> <p> Então o FX3 é uma câmera de cinema, uma câmera sem espelho ou algum tipo de híbrido no estilo DSLR? Teremos que esperar que mais detalhes sejam divulgados. Até então, considere ler nosso artigo sobre o <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> principais diferenças entre câmeras sem espelho, DSLRs e filmadoras </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> O que o Sony FX3 trará para a mesa? </h2> <p> Desde que o tweet de Nokishita caiu, as supostas especificações do produto da câmera estão voando pela web. Porém, nada ainda de quaisquer fontes igualmente confiáveis. </p> <p> Felizmente, devemos descobrir mais sobre o Sony FX3 nas próximas semanas. O maior evento de fotografia do Japão, o CP + 2021, acontecerá de 25 a 28 de fevereiro. </p>"}