{"title":"Como acessar as estatísticas de jogo do PS4 e PS5 para 2020","content":"<p> A Sony lançou o PlayStation Wrap-Up, que permite que você reflita sobre sua jornada no PlayStation no ano passado. </p> <p> Vamos explicar como acessar essa experiência e informá-lo sobre alguns requisitos. </p> <h2 id=\"what-is-playstation-wrap-up\"> O que é o PlayStation Wrap-Up? </h2> <p> Como relatamos, <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation Wrap-Up é o resumo do seu último ano de jogo </a> . </p> <p> É uma página personalizada que detalha seus hábitos de jogo no PS4 e PS5, incluindo quantos jogos você jogou, quanto tempo passou jogando e quantos troféus ganhou ao longo do caminho. </p> <p> Você também pode obter um tema dinâmico gratuito com formas de PlayStation. Surpreendentemente, isso só está disponível para o PS4 e não para o PS5 recém-lançado. </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> Como acessar o PlayStation Wrap-Up </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> Para ver o seu relatório, vá para o <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> Site de finalização do PlayStation </a> . Você precisará fazer login em sua conta Sony, caso ainda não o tenha feito. Quando estiver na página, você pode rolar para baixo para ver suas estatísticas e resgatar o tema PS4. </p> <p> A experiência de encerramento estará disponível apenas até 2 de março de 2021. Portanto, não demore para participar. </p> <p> Existem condições que você deve cumprir para usar o PlayStation Wrap-Up: </p> <ul> <li> Tenha uma conta PSN registrada em sua região. </li> <li> Ter 18 anos ou mais. </li> <li> Ter jogado por pelo menos 10 horas em um console PS4 entre 1º de janeiro de 2020 e 31 de dezembro de 2020. </li> </ul> <p> Além disso, os usuários na Europa, Oriente Médio, África, Austrália, Índia e Rússia devem ter habilitado a coleta de <strong> Dados Adicionais </strong> . Você pode habilitar isso no PS4 via <strong> Definições </strong> &gt; <strong> Dados do dispositivo / saúde e segurança </strong> &gt; <strong> Dados do dispositivo </strong> . </p> <p> Finalmente, você pode receber um e-mail contendo seu PlayStation Wrap-Up. No entanto, você deve ter optado por receber e-mails de marketing, o que pode ser feito por meio do <strong> Configurações de notificações </strong> em sua conta PSN. </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> Haverá um encerramento de 2021? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> Este é o segundo ano consecutivo em que a Sony oferece a experiência Wrap-Up. Uma vez que está apenas analisando dados de 2020, ele tem mais foco no PS4. </p> <p> Esperançosamente, a Sony fará isso novamente no próximo ano, quando o PS5 estará no mercado por mais tempo e terá mais jogos lançados. </p>"}