{"title":"Como corrigir o VIDEO_TDR_FAILURE BSOD no Windows 10","content":"<p> O erro VIDEO_TDR_FAILURE significa que sua placa gráfica está com defeito ou os drivers de vídeo podem estar desatualizados / com defeito. Mas pode haver outros motivos, como componentes de superaquecimento ou arquivos de sistema corrompidos. TDR é a abreviatura de <strong> Tempo limite, detecção e recuperação </strong> , um método usado pelo Windows para identificar e corrigir componentes de software com defeito. </p> <p> Se você estiver encontrando esse erro, não se preocupe, pois os métodos a seguir corrigirão o erro VIDEO_TDR_FAILURE mais rápido do que você esperava. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Atualize e reinstale os drivers de vídeo </h2> <p> Conforme mencionado acima, o erro geralmente é o resultado de drivers de vídeo com defeito ou desatualizados. Portanto, você deve atualizar os drivers da placa gráfica. Se isso não resolver o problema, reinstale-os. Dependendo da sua placa gráfica, você pode encontrar nomes de arquivo diferentes relacionados ao erro. </p> <ol> <li> Para usuários da Nvidia, é <strong> nvlddmkm.sys </strong> . Se você for um usuário Nvidia, aqui estão <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 maneiras fáceis de corrigir o erro. </a> </li> <li> Para usuários AMD, o erro aparece como <strong> atikmpag.sys </strong> . </li> <li> Para usuários de Intel HD, o erro é <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> Como atualizar os drivers de vídeo </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> Aperte <strong> Tecla Windows + R </strong> para abrir o comando Executar. Digitar <strong> devmgmt.msc </strong> e pressione Enter. </li> <li> No <strong> Gerenciador de Dispositivos </strong> janela, navegue para <strong> Adaptadores de vídeo </strong> e expandi-lo. </li> <li> Clique com o botão direito no adaptador de vídeo e selecione <strong> Atualizar driver </strong> . </li> <li> Selecione <strong> Pesquise automaticamente por software de driver atualizado </strong> . </li> <li> O Windows irá pesquisar automaticamente na web e baixar os drivers necessários. Certifique-se de ter uma conexão de Internet ativa ao fazer isso. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> Como reinstalar os drivers de vídeo </h3> <p> Se o BSOD da falha do tdr de vídeo persistir após a atualização dos drivers de vídeo, é melhor reinstalar esses drivers. É aconselhável fazer isso enquanto o Windows é inicializado no modo de segurança. Mas antes de fazer isso, você deve acessar o site do fabricante da placa gráfica e baixar a versão mais recente dos drivers gráficos. </p> <p> Os fabricantes mais comuns são <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> , e <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intel </a> . </p> <p> Para inicializar no modo de segurança, siga estas etapas: </p> <ol> <li> Aperte <strong> Tecla Windows + R, </strong> e na caixa de diálogo Executar, digite <strong> msconfig, </strong> e pressione Enter. </li> <li> No <strong> Configuração do sistema </strong> janela, clique no <strong> Bota </strong> aba. </li> <li> Agora marque o <strong> Modo de segurança </strong> caixa de seleção localizada na parte inferior. </li> <li> Aplique as configurações e reinicie o computador. </li> </ol> <p> Depois de inicializar no modo de segurança, é hora de reinstalar os drivers de vídeo. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> Na barra de pesquisa do menu Iniciar, digite <strong> Gerenciador de Dispositivos </strong> e abri-lo. </li> <li> Olhe para <strong> Adaptadores de vídeo </strong> e expanda o menu. </li> <li> Clique com o botão direito em sua GPU e clique em <strong> Desinstalar dispositivo </strong> . </li> <li> No assistente de desinstalação, certifique-se de verificar o <strong> Exclua o software do driver para este dispositivo </strong> caixa. </li> <li> Aguarde até que o Windows desinstale o dispositivo e reinicie o computador. </li> <li> Agora, reinstale os drivers gráficos que você baixou anteriormente. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Use SFC para digitalizar e corrigir arquivos do sistema </h2> <p> SFC é um utilitário integrado do Windows que pode ser usado para verificar e corrigir arquivos de sistema corrompidos. No caso de um BSOD, é altamente provável que alguns arquivos do sistema estejam corrompidos, portanto, executar este utilitário é obrigatório. É apenas um dos <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> vários utilitários úteis disponíveis </a> à disposição do usuário do Windows. </p> <p> Para executar o SFC, basta seguir estas etapas: </p> <ol> <li> Na barra de pesquisa do menu Iniciar, digite <strong> cmd </strong> . </li> <li> Clique com o botão direito em <strong> Prompt de comando </strong> e selecione <strong> Executar como administrador </strong> . </li> <li> No console, digite <strong> sfc / scannow </strong> e pressione Enter. </li> <li> Após a conclusão do processo de verificação e reparo, reinicie o computador. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Execute o reparo de inicialização </h2> <p> Para usuários que obtêm o erro assim que inicializam o Windows 10 ou logo após o login, o reparo de inicialização é uma dádiva de Deus. Este recurso do Windows verifica se há anomalias durante a inicialização e as corrige imediatamente. </p> <p> Como esta seção é destinada a usuários cujos computadores foram inutilizados devido ao erro, ou seja, eles não podem abrir <strong> Definições </strong> , eles terão que reinicializar para entrar no Ambiente de Recuperação do Windows (winRE). </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Siga estas etapas para inicializar no Ambiente de Recuperação do Windows: </p> <ol> <li> Pressione e segure o botão Liga / Desliga até que o PC desligue. </li> <li> Pressione o botão Liga / desliga novamente para inicializar o PC. </li> <li> Repita a primeira e a segunda etapas até o PC inicializar no modo de recuperação. Será uma tela azul. </li> <li> Na tela de recuperação, clique em <strong> Consulte as opções avançadas de reparação </strong> . </li> <li> Na próxima tela, clique em <strong> Solucionar problemas </strong> </li> <li> Clique em <strong> Opções avançadas </strong> </li> <li> Clique em <strong> Reparo de inicialização </strong> e insira suas credenciais quando solicitado. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Altere as configurações de gerenciamento de energia </h2> <p> As configurações de gerenciamento de energia do Windows geralmente são bem otimizadas, mas às vezes podem interferir na maneira como o computador lida com os gráficos. Isso é especialmente verdadeiro quando o computador possui uma GPU discreta. As configurações ideais para evitar a obtenção do VIDEO_TDR_FAILURE BSOD são fornecidas abaixo: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> Na barra de pesquisa do menu Iniciar, digite <strong> Painel de controle </strong> e abri-lo. </li> <li> Na barra de pesquisa do Painel de Controle, digite &quot;opções de energia&quot; e pressione Enter. </li> <li> Clique em <strong> Opções de energia, </strong> e ao lado do plano de energia que você está usando, clique em <strong> Altere as configurações do plano. </strong> </li> <li> Clique em <strong> Altere as configurações avançadas de energia. </strong> </li> <li> Olhe para <strong> PCI E </strong><strong> xpress </strong> e expandi-lo. </li> <li> Vire o <strong> Gerenciamento de energia do estado do link </strong> configuração para <strong> Fora </strong> . </li> <li> Salve as alterações e reinicie o computador. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Limpe o seu computador </h2> <p> Superaquecimento nunca é uma coisa boa e, geralmente, a razão por trás disso é o acúmulo de poeira. É recomendado que os usuários limpem qualquer poeira dos componentes do PC todos os meses. Mas tenha cuidado. Deve ser feito com cuidado. </p> <p> Certifique-se de limpar a parte superior da placa gráfica, ventilador da CPU, fonte de alimentação e ventiladores do gabinete. Em suma, certifique-se de evitar <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> erros de manutenção que podem danificar os componentes caros. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Verifique os componentes de hardware </h2> <p> Se o erro ainda aparecer após tentar tudo listado acima, pode haver uma falha no próprio hardware. Os usuários que possuem uma placa gráfica dedicada devem removê-la e inicializar o computador. Se o erro for resolvido, é uma falha de hardware na própria GPU. Você pode tentar entrar em contato com o fabricante e tentar substituir sua unidade. </p> <p> </p> <p> Ao usar gráficos integrados, tente desabilitá-los e inicializar. Para desativá-los, siga estas etapas: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> Aperte <strong> Tecla Windows + R, </strong> modelo <strong> devmgmt.msc </strong> na caixa de texto Executar e pressione Enter. </li> <li> Dentro <strong> Gerenciador de Dispositivos </strong> , olhe para <strong> Adaptadores de vídeo </strong> e expanda o menu. </li> <li> Clique com o botão direito em sua GPU integrada e clique em <strong> Desativar dispositivo </strong> . </li> <li> Reinicialize o computador e verifique se o erro foi resolvido. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> Erro &quot;Falha de vídeo TDR&quot; resolvido com sucesso </h2> <p> Para a maioria dos usuários, uma simples atualização ou reinstalação de seus drivers de vídeo resolverá o problema. Mas se o problema piorar, talvez você precise reinicializar o PC ou substituir algum hardware. </p>"}