{"title":"Como manter seus dados pessoais protegidos de empregadores","content":"<p> A tecnologia de vigilância é crescente dentro e fora do escritório. Muitos empregadores utilizam produtos de gerenciamento móvel para dispositivos fornecidos pela empresa, como telefones, laptops e tablets. Eles contêm programas projetados para proteger as empresas contra roubo, espionagem corporativa ou intenção maliciosa. </p> <p> No entanto, embora tudo isso seja ótimo para proteger sua empresa, eles não são exatamente a melhor coisa para você. Não é mais uma questão de <strong> E se </strong> sua empresa está rastreando você; a próxima pergunta que você precisa é: quantos dados as empresas podem realmente encontrar? Surpreendentemente, muito. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> O que os empregadores podem ver nos dispositivos remotos e Wi-Fi da empresa? </h2> <p> A maioria das pessoas não percebe até que ponto as empresas têm acesso aos seus dados ou quanto deles assinam ao usar os dispositivos da empresa. Aqui estão alguns exemplos. </p> <h3 id=\"location\"> Localização </h3> <p> Muitos funcionários pensam que usar uma rede privada virtual (VPN) é suficiente para fazer seus empregadores acreditarem que eles estão onde deveriam estar. </p> <p> Embora existam maneiras de ocultar sua localização real em um dispositivo pessoal, não é totalmente à prova de falhas, especialmente quando conectado a qualquer aplicativo ou site com um endereço de e-mail ou número de celular fornecido pela empresa. </p> <p> </p> <p> Pode ser quase impossível ocultar sua localização real ao usar dispositivos fornecidos pela empresa. Por exemplo, as empresas de telecomunicações podem detectar quando você se conectou a qualquer um de seus parceiros de roaming. </p> <p> Além disso, as VPNs corporativas são diferentes das VPNs comerciais com gateways monitorados por equipes de TI internas. </p> <h3 id=\"notes-documents-and-emails\"> Notas, documentos e e-mails </h3> <p> Se você acha que ninguém sabe que você está usando o Wi-Fi da empresa para encontrar seu próximo emprego, está enganado. Mesmo se você não estiver usando um endereço de e-mail da empresa, muitas empresas têm programas pré-instalados nos laptops da empresa que incluem registros de atividades em tempo real, atualizações do histórico de navegação e capturas de tela cronometradas de documentos abertos e e-mails. </p> <p> Com a premissa de proteção contra possíveis violações de dados, muitas empresas também os usam como mecanismos de relatório ou rastreadores de produtividade. </p> <p> </p> <h3 id=\"online-messaging-history\"> Histórico de mensagens online </h3> <p> Apesar do aumento das plataformas criptografadas, a realidade é que suas mensagens não são totalmente privadas em dispositivos corporativos. Ao usar plataformas de mensagens, as empresas podem não ser capazes de ver os detalhes exatos de suas trocas, mas provavelmente ainda serão capazes de reconhecer metadados como tamanho e tipo de arquivo. </p> <p> Com isso, se você decidir enviar PDFs de tamanhos grandes por meio de um aplicativo como o WhatsApp, o sistema de detecção de intrusão da sua empresa provavelmente irá sinalizar você por comportamento suspeito. De acordo com as diretrizes corporativas, eles podem pedir que você prove que suas ações não foram maliciosas e podem precisar solicitar a aprovação da liderança para liberação. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> Como evitar o compartilhamento de dados pessoais com seu empregador </h2> <p> Não há uma maneira absoluta de manter suas informações pessoais, conversas e atividades completamente fora de alcance o tempo todo. No entanto, existem várias maneiras de mitigar os riscos. </p> <p> Não apoiamos a ocultação de dados de seus empregadores; na verdade, eles têm o direito de coletar informações sobre seus funcionários - mesmo sendo <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> capaz de rastreá-lo legalmente </a> . Mas você precisa saber quando é apropriado manter as coisas para você, e isso depende de cada empresa. </p> <h3 id=\"read-company-policies\"> Leia as políticas da empresa </h3> <p> Antes de discutir sobre transparência de dados, você também deve compreender o tipo de informação que está conscientemente dando ao seu empregador ao trabalhar para ele. Somente quando você sabe o que é esperado, pode estabelecer os limites profissionais adequados. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Procure entender as políticas e procedimentos de coleta de dados da empresa antes de serem coletados. A partir daí, você pode efetivamente fazer um plano para cancelar o fornecimento de mais informações do que o necessário. </p> <h3 id=\"use-personal-gadgets\"> Use gadgets pessoais </h3> <p> Embora seja sempre tentador usar os dispositivos da empresa para economizar dinheiro, a realidade é que nada é realmente grátis. Invista em laptops, telefones celulares e tablets para uso pessoal. </p> <p> Ter dispositivos pessoais separados também é uma ótima maneira de estabelecer limites, especialmente ao trabalhar remotamente. </p> <p> Usar seu próprio dispositivo permite estabelecer e gerenciar as várias práticas de segurança necessárias para manter seus dados protegidos de olhos curiosos. Pode parecer um gasto desnecessário, mas ajuda muito para preservar sua paz de espírito. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Use perfis de convidados em dispositivos pessoais </h3> <p> Conectar-se a qualquer rede que não seja a sua é sempre um risco de segurança, mesmo que seja nas instalações de trabalho. O acesso ao Wi-Fi de uma empresa dá ao seu empregador permissão para acessar tudo, desde os metadados das suas mensagens até os registros do histórico de navegação. </p> <p> Se você realmente precisa usar seu laptop pessoal nas redes da empresa, pode optar por usar um perfil de convidado para reduzir a quantidade de dados que eles podem acessar remotamente. Alternativamente, você pode se conectar com o plano de dados do seu telefone celular pessoal ou dispositivo Wi-Fi portátil. </p> <h3 id=\"keep-your-passwords-safe\"> Mantenha suas senhas seguras </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Criação de senhas fortes </a> não é suficiente. Você precisa se certificar de que suas senhas não sejam salvas nos dispositivos da empresa. Salvar senhas pessoais para contas bancárias online, e-mails pessoais ou sites do governo em gadgets que você não possui coloca seus dados em risco imediato se o banco de dados de sua empresa for comprometido. </p> <p> Use apenas seu telefone celular ou laptop pessoal para acessar contas importantes, especialmente aquelas que envolvem dinheiro. Sempre que possível, ative a autenticação de dois fatores. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> Separe seu trabalho e sua vida pessoal </h2> <p> Os empregadores têm o direito de acessar remotamente o dispositivo fornecido pela empresa se suspeitarem que você está participando de qualquer forma de atividade ilegal, colocando as informações da empresa em risco ou solicitadas pelas autoridades policiais para investigação. </p> <p> No entanto, isso é diferente para dispositivos pessoais. </p> <p> Sua segurança é tão forte quanto as pessoas com quem você está em contato - isso inclui seu empregador. Manter seus dispositivos pessoais e de trabalho separados é apenas um passo para descentralizar seus dados. Ao praticar fortes medidas de segurança, você pode limitar o número de pontos de acesso que os hackers têm para documentos, e-mails e redes. </p> <p> A descentralização de dados pessoais é necessária porque protege você, como indivíduo, e sua empresa contra roubo, fraude e outras formas de cibercrime. </p>"}