{"title":"Como redefinir suas recomendações de músicas da Apple","content":"<p> O Apple Music costumava possuir uma maneira facilmente acessível de refazer a curadoria de suas recomendações musicais, selecionando novamente seus artistas e gêneros musicais favoritos. Infelizmente, durante uma atualização de aplicativo, a Apple removeu esse método de atualizar sua curadoria de música. </p> <p> Não tema, aqui está um guia sobre métodos alternativos para interromper ou redefinir suas sugestões automáticas do Apple Music. </p> <h2 id=\"apple-music-recommendations-explained\"> Explicação das recomendações da Apple Music </h2> <p> Quando você inicia sua conta do Apple Music pela primeira vez, ele pede que você selecione seus favoritos em uma ampla lista de gêneros musicais e artistas. Esta curadoria é como a Apple Music irá sugerir listas de reprodução, álbuns, artistas e músicas no futuro. </p> <p> Por exemplo, se você selecionasse Classic Rock, New Rock e Foo Fighters como algumas de suas escolhas musicais favoritas, o Apple Music provavelmente sugeriria estações de escuta muito semelhantes e promoveria o rock lançado recentemente. </p> <p> Mudanças no aplicativo significam que agora você só pode organizar suas preferências musicais durante a criação inicial da conta, não pode redefini-las posteriormente - embora o Apple Music continue a modificar suas sugestões com base em seus hábitos de escuta. </p> <p> Este é apenas um dos vários úteis <a href=\"https://www.makeuseof.com/tag/apple-music-features-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Recursos do Apple Music para usar </a> . </p> <p> Não se preocupe, ainda existem algumas maneiras de redefinir sua curadoria do Apple Music desativando suas preferências de ID da Apple ou excluindo e recriando sua conta do Apple Music. </p> <p> Ambas as opções têm vantagens e desvantagens, então vamos descobrir qual é a melhor opção para você. </p> <p> </p> <h2 id=\"turn-off-personalized-recommendations\"> Desative as recomendações personalizadas </h2> <p> Desativar as recomendações personalizadas para o seu ID Apple é uma boa maneira de parar de ver novas sugestões no futuro. </p> <p> Desativar esta opção não removerá seus dados de curadoria existentes, o que significa que o aplicativo continuará a construir sugestões com base em seu uso. Você simplesmente não os verá mais. Desligar as recomendações personalizadas também afetará suas recomendações em outros aplicativos de serviço da Apple, como o Apple Books. </p> <p> Veja como desativar as recomendações personalizadas em um iPhone: </p> <ol> <li> Abra o <strong> Apple Music </strong> aplicativo. </li> <li> Vou ao <b> Ouça agora </b> aba. </li> <li> Abra seu perfil do Apple Music selecionando o ícone circular com a silhueta de uma pessoa no canto superior direito da tela. Se você já tiver feito upload de uma imagem como foto de perfil pessoal, ela aparecerá no lugar da silhueta. </li> <li> Selecione <b> Ver ID da Apple </b> que pode ser localizado rolando até a parte inferior do <b> Conta </b> página. </li> <li> Desligar <b> Recomendações Personalizadas </b> . </li> <li> Selecione <b> Feito </b> no canto superior direito e você terminou. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (3 imagens) </strong> <img alt=\"Apple Music Lisen Now featuring Halle x Chloe\" src=\"images/apple-music-listen-now-page-713.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple Music Account Options Screenshot\" src=\"images/apple-music-account-page-914.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple ID Options Screenshot\" src=\"images/apple-id-account-page-817.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> Depois de fazer isso, quaisquer novas pesquisas, downloads ou reproduções de músicas no Apple Music não afetarão mais suas sugestões automáticas. Isso não excluirá automaticamente suas pesquisas anteriores, o que significa que pode demorar um pouco para notar os efeitos desse método. </p> <p> </p> <h2 id=\"delete-your-apple-music-profile\"> Exclua seu perfil do Apple Music </h2> <p> Se você precisa de uma reforma completa do Apple Music com novas sugestões de músicas, a melhor opção é excluir e recriar seu perfil do Apple Music. </p> <p> É importante observar que a exclusão de seu perfil removerá completamente sua biblioteca de música atual. Criar um novo perfil permitirá que você selecione novas preferências de música e gênero, mas também removerá completamente qualquer histórico anterior do Apple Music. </p> <p> </p> <p> Se você estiver interessado em um novo perfil do Apple Music com favoritos recém-selecionados, siga estas etapas para criar um: </p> <ol> <li> De <strong> Ouça agora </strong> guia, vá para o seu Apple Music <strong> Conta </strong> e selecione <b> Ver perfil </b> . </li> <li> Selecione <b> Editar </b> no centro da tela, abaixo do seu nome. </li> <li> Role até a parte inferior da tela e selecione <b> Apagar o Perfil </b> . Esteja avisado, esta é uma exclusão permanente que exigirá uma redefinição de conta. </li> <li> Configure um novo perfil do Apple Music para você que agora está livre de suas seleções anteriores. Se você desativou as recomendações personalizadas conforme descrito na seção acima, não terá mais sugestões de músicas personalizadas. Deixando <strong> Recomendações Personalizadas </strong> on resultará na Apple Music sugerindo música com base em seus novos hábitos de escuta. </li> <li> Navegue livremente e desfrute de uma ampla gama de opções de áudio recém-selecionadas. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (2 imagens) </strong> <img alt=\"Apple Music Profile feat Halle x Chloe\" src=\"images/apple-music-profile-page-771.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple Music Profile Options Screenshot\" src=\"images/apple-music-edit-profile-page-450.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> </p> <h2 id=\"spotify-s-recommendations-might-be-better\"> As recomendações do Spotify podem ser melhores </h2> <p> Se você ainda está insatisfeito com as recomendações do Apple Music, mesmo depois de criar um novo perfil, pode ser hora de trocar de plataforma de streaming de música. O Apple Music e o Spotify têm muitos recursos muito semelhantes, mas muitas pessoas acham que o Spotify é muito superior em sugerir novas músicas. </p> <p> Claro, existem muitos outros fatores a serem considerados ao escolher entre o Apple Music e o Spotify também. </p>"}