{"title":"Como gerenciar grupos de usuários com Groupadd no Linux","content":"<p> O gerenciamento de usuários é bastante simples se você estiver executando o Linux em seu computador pessoal. Mas, para quem tem um servidor com milhares de usuários, o gerenciamento se torna um problema sério que deve ser cuidado. </p> <p> Felizmente, os sistemas operacionais baseados em Linux fornecem uma maneira de controlar e gerenciar usuários em seu sistema. Você pode criar grupos e adicionar usuários a eles. Então, em vez de atribuir permissões a todos os usuários do sistema, você pode autorizar facilmente grupos de usuários, fornecendo-lhes privilégios associados ao fluxo de trabalho do sistema. </p> <h2 id=\"create-user-groups-on-linux\"> Criar grupos de usuários no Linux </h2> <p> O Linux vem com um comando padrão para a criação de grupos de usuários. Você pode usar o <strong> groupadd </strong> comando para adicionar novos grupos ao seu sistema. A sintaxe básica do comando é: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> Para criar um novo grupo de usuários &#39;escritores&#39;: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> Executar o comando mencionado acima adicionará uma nova entrada ao <strong> / etc / group </strong> e <strong> / etc / gshadow </strong> arquivos em seu sistema. Você pode verificar a nova entrada de grupo nos arquivos digitando <strong> cat / etc / group </strong> e <strong> cat / etc / gshadow </strong> em seu terminal. </p> <p> Observe que apenas usuários com permissões administrativas podem criar grupos de usuários. Não se esqueça de mudar para superusuário antes de executar o comando groupadd. </p> <p> Se você tentar criar um grupo com um nome que já existe, verá um erro que afirma: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> No entanto, você pode descartar o erro usando o <strong> -f </strong> ou <strong> --força </strong> sinalizar com o comando. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Crie grupos de usuários com GID exclusivo </h3> <p> Quando você cria um novo grupo de usuários, o sistema automaticamente atribui a ele um ID de grupo ou GID. Se quiser que seu grupo tenha um ID de grupo específico, você pode fazer isso usando o <strong> -g </strong> ou <strong> --gid </strong> bandeira. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Se você tentar atribuir um ID de grupo que já foi usado, o seguinte erro ocorrerá. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Embora não seja recomendado, mas você pode adicionar o <strong> -o </strong> ou <strong> --não único </strong> sinalizador para atribuir à força o ID do grupo. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Criar grupos de usuários com uma senha </h3> <p> Embora você possa adicionar uma senha aos seus grupos, eles não são úteis para o usuário. O <strong> -p </strong> sinalizador permite que você especifique uma senha para seu grupo de usuários. </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Criar grupos de sistema no Linux </h3> <p> Há uma pequena diferença entre grupos de sistemas e grupos regulares. Os grupos de sistemas são grupos especiais que incluem os usuários responsáveis ​​pela execução de operações do sistema, como backup e manutenção. </p> <p> Use o <strong> -r </strong> ou <strong> --sistema </strong> sinalize para criar um grupo de sistema no Linux: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Obter lista de membros em um grupo de usuários </h3> <p> Para saber quantos membros fazem parte de um grupo específico, você pode usar o <strong> getent </strong> comando do seu terminal. O seguinte comando exibirá uma lista de todos os membros presentes no grupo de &#39;escritores&#39;: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Adicionar usuários a grupos </h2> <p> Agora que você criou um grupo de usuários em seu sistema, é hora de adicionar alguns usuários a ele. Usermod é um utilitário de linha de comando poderoso, pois contém várias opções associadas ao gerenciamento e moderação de usuários. Ele também permite que você adicione usuários ao seu grupo facilmente. A sintaxe básica do comando é: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Adicionar um usuário existente a grupos </h3> <p> Se você deseja adicionar um usuário existente ao seu grupo, o <strong> -uma </strong> e <strong> -G </strong> sinalizadores são o que você precisa. O <strong> -G </strong> bandeira significa grupos, enquanto o <strong> -uma </strong> significa anexar, adicionar ou adicionar. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> Você também pode adicionar um usuário a vários grupos. Tudo que você precisa fazer é inserir os nomes dos grupos separados por vírgula. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Adicionar um novo usuário a um grupo </h3> <p> Você pode usar o <strong> useradd </strong> comandar quando quiser <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> adicionar um novo usuário ao seu sistema Linux </a> . Useradd fornece uma maneira de atribuir um grupo ao usuário no momento de sua criação. O <strong> -G </strong> flag permite que você especifique um grupo para o usuário. </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> Adicionar um usuário a vários grupos também é fácil. Basta passar os nomes dos grupos separados por vírgula no comando padrão. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Remover usuários de um grupo </h2> <p> Você também pode remover usuários de um grupo usando <strong> usermod </strong> . Lembre-se de que, em um sistema Linux, vários grupos podem ser atribuídos a um usuário. Um desses grupos é declarado como o grupo Primário, enquanto outros são denominados grupos secundários. </p> <p> Se você estiver tentando remover um usuário de um grupo, certifique-se de que ele tenha pelo menos um grupo primário após a remoção. Por exemplo, o usuário &#39;aleatório&#39; faz parte dos grupos admin, writer e editors; onde admin é o grupo primário e o resto são grupos secundários. </p> <p> Você só pode remover o usuário dos escritores e editores do grupo. E para fazer isso, você deve passar o nome do grupo do qual deseja que o usuário permaneça membro. Isso significa que, para remover o usuário &#39;aleatório&#39; dos editores do grupo, o seguinte comando é usado: </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> Observe que tudo que você precisava fazer era retirar o <strong> anexar sinalizador (-a) </strong> do comando que você usa para adicionar um usuário a um grupo. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Excluir grupos no Linux </h2> <p> Quando você não quiser mais manter um grupo de usuários em seu sistema, você pode deletar o grupo usando o <strong> groupdel </strong> comando. A sintaxe do comando é: </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> Para excluir o grupo de usuários &#39;escritores&#39;: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Se você tentar remover um grupo que não existe, receberá um erro informando: </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Gerenciando grupos de usuários no Linux </h2> <p> O gerenciamento de usuários pode ser difícil se você não conhece os comandos do Linux que precisa usar. Torna-se muito fácil quando você conhece os comandos de entrada e saída relacionados à moderação e gerenciamento. </p> <p> Os administradores de servidor devem tentar usar distribuições Linux adequadas às suas necessidades. Dessa forma, eles obterão todas as ferramentas e utilitários necessários para o gerenciamento do servidor imediatamente. </p>"}