{"title":"Como transformar seu PS5 da vertical para a horizontal (ou vice-versa)","content":"<p> O PlayStation 5 funciona em uma configuração vertical ou horizontal. Se você mudar de ideia sobre sua orientação preferida, é muito fácil mover seu PS5 da vertical para a horizontal (ou vice-versa). </p> <p> Vejamos como mover com segurança seu PS5 de uma orientação vertical para horizontalmente de lado e vice-versa. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> Primeiro: Desligue e desconecte o PS5 </h2> <p> Antes de fazer qualquer trabalho de movimentação física do PlayStation 5, é importante desligá-lo e desconectar tudo. Isso evitará danos ao sistema que podem ocorrer se você movê-lo enquanto estiver ligado. </p> <p> Você deve desligar totalmente o PS5. Para fazer isso, pressione o <strong> Botão PS </strong> no controlador para abrir o menu rápido na parte inferior da tela. Selecione <strong> Poder </strong> à direita e escolha <strong> Desligue PS5 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Aguarde até que as luzes do console se apaguem e, em seguida, desconecte o cabo de alimentação, o cabo HDMI e tudo o que você conectou ao sistema. Agora você está pronto para mudar a orientação do seu PS5. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Remova o parafuso do suporte </h2> <p> Quando você configurou seu PS5 verticalmente, você teve que tirar um parafuso incluído de um compartimento na base e usá-lo para prender a base ao console quando ela se posicionar verticalmente. Como resultado, remover esse parafuso é a primeira etapa para alterar a orientação do console. </p> <p> Vire suavemente o PS5 de lado para que você possa acessar o suporte na parte inferior. Use uma chave de fenda, moeda ou similar para remover o único parafuso prateado que prende a base ao sistema. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Assim que o parafuso estiver solto, a base se soltará. Há um pequeno compartimento na base onde você pode guardar o parafuso. Encaixe-o no lugar e deslize-o para dentro do pequeno orifício para mantê-lo preso. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> Também neste compartimento, você encontrará uma pequena tampa preta (desde que você a tenha colocado lá durante a configuração inicial). Remova esta tampa e use-a para tampar o orifício na parte inferior do PS5 de onde você acabou de tirar o parafuso. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Gire a Base </h2> <p> Agora, você vai querer girar a base para que ela se encaixe no console em sua orientação horizontal. Isso também fecha o pequeno compartimento onde você colocou o parafuso, protegendo-o ainda mais. </p> <p> Você deve girar a base quando olhar para ela de cima (do lado oposto de onde você acabou de guardar o parafuso). Se você tratar a parte elevada do suporte como &quot;norte&quot;, será necessário girar a parte externa do suporte para &quot;noroeste&quot;, conforme mostrado abaixo. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Esta é a orientação correta para usar o suporte horizontalmente. Ele irá clicar e parar suavemente quando estiver no lugar certo. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Anexe o suporte na posição horizontal </h2> <p> Agora, você pode conectar o suporte ao PS5 enquanto ele está posicionado horizontalmente. Certifique-se de que o sistema está instalado corretamente --- o logotipo do PS deve estar voltado para cima. </p> <p> Na parte de trás do seu sistema, por baixo e perto das duas portas USB, você verá alguns símbolos de controle do PlayStation impressos no console. Deslize os braços externos da base (que você acabou de girar) no sistema em torno de onde esse padrão termina em cada lado. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Empurre os clipes para prendê-los, mas esteja ciente de que, nesta posição, o suporte não está totalmente travado no lugar (como acontece com o parafuso quando colocado verticalmente). Seja gentil ao colocar o sistema e esteja ciente de que o suporte pode escorregar se você puxá-lo. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Agora você está pronto para usar seu PS5 na orientação horizontal. Conecte todos os cabos de volta e ligue-o para voltar a jogar. Se você tiver o PS5 padrão, os discos serão inseridos com a face para cima nesta orientação. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> Como mudar seu PS5 de horizontal para vertical </h2> <p> Deseja voltar para a orientação vertical de seu PS5, ou talvez você configurou inicialmente seu PS5 na forma horizontal e deseja ir vertical agora? De qualquer maneira, é fácil percorrer o processo acima na ordem inversa. Certifique-se de desligar e desconectar o PS5 primeiro, se ele estiver ligado ou no modo de descanso. </p> <p> </p> <p> Para mudar para uma orientação vertical, primeiro levante o PS5 e puxe cuidadosamente o suporte para fora do sistema para removê-lo. Em seguida, você deve girar o braço externo da base. Ao olhar de cima para baixo, o braço deve estar &quot;norte&quot;, alinhado com a parte elevada. Certifique-se de sentir o clique suave para saber que está no lugar certo. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> Posicione seu PS5 para que você possa acessar a parte inferior e, em seguida, remova a tampa preta do orifício no meio - ela está localizada aproximadamente no meio das aberturas. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Coloque esta tampa preta dentro do pequeno orifício no compartimento na parte inferior da base. A rolha deve encaixar bem no lugar. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> Em seguida, remova o parafuso do mesmo compartimento na base. Agora, você precisará prender o suporte em sua posição adequada. Para fazer isso, levante seu PS5 de forma que a parte de trás do console fique voltada para cima, conforme mostrado abaixo. </p> <p> Pegue o suporte e posicione-o de forma que o orifício do parafuso fique alinhado com o orifício do parafuso do qual você acabou de remover a rolha. Posicione os clipes no braço da base na parte traseira do sistema abaixo do conector de alimentação. O suporte deve se alinhar facilmente. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Agora, use uma chave de fenda ou similar para apertar o parafuso. Assim que terminar e sentir que o suporte está firmemente preso, você está pronto para usar o PS5 verticalmente. Conecte todos os cabos de volta para concluir o trabalho. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> Você deve colocar seu PS5 verticalmente ou horizontalmente? </h2> <p> A Sony suporta o uso de seu PS5 vertical e horizontalmente, então não há maneira certa ou errada de fazer isso, contanto que seu sistema tenha fluxo de ar suficiente. A orientação que você deve usar depende de suas necessidades. </p> <p> </p> <p> Se você tem muito espaço e não se importa com o PS5 ocupando muito espaço horizontal, a aparência horizontal é elegante. Para quem tem o modelo padrão PS5, também facilita um pouco o processo de inserção dos discos, pois a etiqueta deve ficar sempre voltada para cima. Isso é um pouco mais difícil de lembrar com a orientação vertical, onde o rótulo do disco deve ficar voltado para a esquerda. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> No entanto, você pode não ter espaço dentro do seu sistema de entretenimento para acomodar a configuração horizontal. Nesses casos, ir na vertical é sua melhor aposta. O PS5 é um console enorme de qualquer maneira, mas quando colocado verticalmente, ele se encaixa perfeitamente ao lado de sua TV ou similar. Esta é a configuração que utilizo, conforme mostrado na imagem abaixo. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> Qualquer que seja a orientação que você escolher para seu PS5, certifique-se de usar o suporte. Ele mantém o sistema fora do solo, o que melhora o fluxo de ar. O suporte também protege o PS5, tornando-o mais difícil de derrubar e potencialmente danificá-lo. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> Configure seu PS5 e comece a jogar </h2> <p> Agora você sabe como mudar seu PS5 de vertical para horizontal e vice-versa em apenas alguns minutos. Assim que o seu sistema estiver configurado, ligue-o e curta alguns dos melhores títulos do PS5. </p> <p> Não se esqueça de que quase toda a biblioteca do PS4 funciona no PS5 também, dando a você muito mais para se divertir. </p> <p> <small> Crédito da imagem: Alex Van Aken / <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}