{"title":"Como melhorar suas habilidades de edição do Lightroom: 10 maneiras fáceis","content":"<p> Adobe Lightroom é uma das plataformas de edição de fotos mais conhecidas do mercado. Esta solução é popular não só porque tem muitos recursos úteis, mas também por sua facilidade de uso. </p> <p> Quando os fotógrafos procuram levar seu ofício um pouco mais a sério, a primeira coisa que farão é comprar um software de edição. Mas mesmo se você for apenas um fotógrafo casual, o Lightroom oferece muitas maneiras de impressionar seus amigos. </p> <p> Neste guia, você descobrirá várias maneiras fáceis de aprimorar suas fotos no Lightroom. Essas dicas funcionam tanto para o Lightroom Classic quanto para o Lightroom Creative Cloud. </p> <h2 id=\"use-masking\"> 1. Use Mascaramento </h2> <p> Se você aumentar a nitidez de sua foto por padrão, adicionará detalhes a toda a imagem - até mesmo as áreas que não deseja. Isso pode deixá-lo com muitos grãos em lugares indesejáveis, como no céu e na água. </p> <p> Você também corre o risco de fazer com que sua foto pareça mais um desenho do que algo que você tirou com a câmera. Felizmente, existe uma solução fácil. </p> <p> No aplicativo Lightroom, role para baixo até <strong> Detalhe </strong> . Quando você estiver lá, vá para <strong> Nitidez </strong> &gt; <strong> Mascaramento </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Role o controle deslizante até que as partes da imagem que deseja tornar mais nítidas sejam selecionadas. Para ver o que você está mascarando, pressione o <strong> Alt </strong> no teclado ao mesmo tempo. </p> <p> Depois de mascarar a área desejada, role o controle deslizante de nitidez o quanto for necessário. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Use perfis de câmera em vez dos Adobe padrão </h2> <p> Se você carregar uma imagem em RAW, a Adobe adicionará um de seus perfis de programa por padrão. E embora isso possa fazer sua foto parecer melhor em alguns casos, é melhor você escolher uma câmera específica. </p> <p> Quando você usa um perfil de câmera, a imagem se torna mais fácil de editar com base no que você tirou com seu dispositivo. </p> <p> Para alterar o perfil da sua foto, vá para <strong> Perfis </strong> &gt; <strong> Combinação de câmeras </strong> . Você pode então escolher <strong> Padrão </strong> , <strong> Neutro </strong> , <strong> Panorama </strong> , e outros looks. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Lembrar: </strong> você não pode alterar o perfil da imagem com tanta profundidade se apenas tirar JPEGs. Então, antes de sair para tirar algumas fotos, configure sua câmera para <strong> CRU </strong> ou <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Pincele sobre partes de sua imagem </h2> <p> Você já aumentou a clareza, a saturação ou os detalhes de toda a sua imagem, esperando uma obra-prima, mas em vez disso obteve uma imagem que parece ter sido tirada em um microondas? Nesse caso, você pode se beneficiar ajustando apenas partes de sua imagem. </p> <p> No Lightroom, você pode acessar um recurso chamado <strong> Escovar </strong> . Você pode usar isso para &quot;pincelar&quot; partes da imagem enquanto deixa o resto sozinho. </p> <p> Para usar esta ferramenta, vá para o <strong> Escovar </strong> ícone no lado direito da tela. Você pode aumentar ou diminuir o pincel, dependendo de quanto da imagem deseja editar. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Antes de começar a escovar, altere as características da imagem que deseja ajustar. Por exemplo, você pode aumentar o controle deslizante de clareza se quiser tornar uma parte da imagem mais clara. </p> <p> Depois de alterar esses recursos, passe o pincel sobre as áreas que deseja editar. Aperte <strong> O </strong> no teclado para ver onde você fez o pincel. </p> <p> Se você passou muito em uma área específica, segure o <strong> Menos </strong> ( <strong> - </strong> ) E passe o pincel sobre essas partes para apagar suas edições. Saber <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> atalhos de teclado para Adobe Lightroom </a> é útil para essas situações, então não se esqueça de revisá-las! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Retire suas fotos </h2> <p> Às vezes, sua câmera tira fotos onde as bordas têm cores não naturais. Você notará isso especialmente ao tirar fotos sob a luz solar forte. Eles vêm principalmente em tons de verde e roxo. </p> <p> Para delinear suas fotos, role para baixo até <strong> Defringir </strong> . Você pode optar por se livrar das franjas roxas ou verdes. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> Usar <strong> Resultar </strong> para decidir quanto de defringe você gostaria de adicionar. Deslize a barra de cores até ficar satisfeito com os resultados. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Use a geometria para endireitar suas fotos </h2> <p> Não importa o quanto você tente, segurar uma câmera reta é difícil, a menos que você tenha um tripé. Mas, graças à magia do software de edição, endireitar suas fotos é fácil. </p> <p> No Lightroom, você pode corrigir automaticamente suas fotos acessando o <strong> Colheita </strong> seção. No entanto, existe uma maneira mais precisa de obter o mesmo resultado. </p> <p> Na guia à direita, escolha a opção superior. Em seguida, role para baixo até <strong> Geometria </strong> . Quando você estiver aqui, vá para <strong> Direito </strong> &gt; <strong> Nível </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> Você também pode desenhar ao longo de linhas retas para tornar a foto o mais reta possível. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Ajuste o tamanho da área de nitidez </h2> <p> Agora você conhece o mascaramento, mas sabia que também pode aumentar a nitidez de áreas específicas da foto? </p> <p> Para escolher a área dentro da foto mascarada que você deseja tornar mais nítida, vá para <strong> Nitidez </strong> , segure o <strong> Alt </strong> chave, e vá para <strong> Raio </strong> . Ajustar este controle deslizante permite aumentar ou diminuir a área de nitidez. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> Depois disso, vá até o <strong> Nitidez </strong> bar. Da mesma forma, segure o <strong> Alt </strong> e mova o controle deslizante para a direita. Isso tornará mais fácil aumentar a nitidez de uma área específica da foto, em vez da imagem inteira. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Use as curvas de pontos de cor </h2> <p> Se a cor da sua imagem não parece correta mesmo depois de ajustar o equilíbrio de branco, você pode querer verificar as curvas de pontos de cor no Lightroom. Você pode usá-los para ajustar certas cores em sua imagem. </p> <p> Você encontrará três painéis de curvas de cores diferentes no aplicativo: vermelho, azul e verde. </p> <p> Para obter essas curvas de cores, role para baixo até <strong> Curva de Ponto </strong> . Em seguida, clique na cor que deseja alterar. Você pode então brincar com as cores da mesma forma que faria no padrão <strong> Curva de Ponto </strong> aba. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Digite um número para cada controle deslizante e ajuste de acordo </h2> <p> Freqüentemente, os novos fotógrafos ficam entusiasmados com o número de opções de edição disponíveis. Quando eles abrem o Lightroom, eles deslizam cada barra longe demais em qualquer direção. Mas, em vez de melhorar sua imagem, eles acabam com uma bagunça supereditada. </p> <p> Ao editar suas fotos, a chave é fazer pequenas alterações. Provavelmente, você já é um bom fotógrafo e a foto que tirou só precisa de alguns ajustes de pós-produção. </p> <p> </p> <p> Em vez de mover cada controle deslizante livremente, tente alterar o número nas áreas que deseja alterar <strong> +10 </strong> ou <strong> -10 </strong> . Se você acha que é necessário mais trabalho, repita o processo. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Quando você sentir que está perto, mova lentamente cada controle deslizante para a esquerda ou direita até que você esteja feliz. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Corte suas fotos </h2> <p> Cortar pode parecer óbvio, mas muitos fotógrafos ainda subutilizam o recurso. Também é importante cortar suas imagens dependendo de onde você vai usá-las. Caso contrário, eles ficarão distorcidos. </p> <p> Para cortar suas fotos, vá para o <strong> Colheita </strong> ícone. Este é o segundo mais alto a partir do topo. Vamos para <strong> Proporção da tela </strong> para alterar o tamanho e arraste os cantos para se livrar de todos os objetos indesejados. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> Depois de terminar de cortar, clique no <strong> Entrar </strong> no seu computador, e as alterações entrarão em vigor. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Use o histograma </h2> <p> O histograma do Lightroom é fácil de ignorar, mas essencial para saber. Este pequeno gráfico mostrará onde as cores e a iluminação são desiguais em sua imagem, permitindo que você crie uma edição mais limpa. </p> <p> Como regra geral, uma foto bem editada terá poucos picos no histograma. Às vezes, isso é inevitável. Mas, em geral, você deve tentar tornar o gráfico o mais uniforme possível. </p> <p> Dependendo da versão do Lightroom que você usa, você pode manipular o histograma mais ou menos diretamente. No Lightroom Classic, você pode clicar no histograma e até mesmo coisas deslizando em certas seções. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> Na Creative Cloud, o histograma é igualmente visível no canto superior direito - mas você deve alterar os controles deslizantes para que o histograma se mova. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> Em ambas as versões da plataforma, o histograma está disponível na parte superior da tela acima das funções de edição. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> Uma ótima edição não é apenas para os profissionais </h2> <p> O Lightroom é um excelente software de edição para quem quer levar sua fotografia para o próximo nível. E mesmo que você nunca tenha usado a plataforma antes, não precisa se preocupar, pois é fácil de aprender. </p> <p> Ao editar suas fotos no Lightroom, lembre-se de que menos é geralmente mais. Além de considerar essas dicas, é uma boa ideia voltar depois de editar e voltar mais tarde para ver se eles estão tão bem editados quanto você pensava. </p>"}