{"title":"Como impedir que o Windows 10 bloqueie seus arquivos baixados","content":"<p> Quando você tenta abrir um arquivo, o Windows 10 pode impedi-lo de abri-lo diretamente. Ele mostrará um aviso de segurança de que o arquivo se originou de uma fonte desconhecida e pode ser inseguro. Isso acontece quando um recurso do Windows 10 chamado Gerenciador de Anexos bloqueia arquivos que considera não seguros para o seu PC. </p> <p> Embora você possa desbloquear manualmente cada arquivo, isso pode ser um processo cansativo - especialmente se você tiver que fazer isso para quase todos os arquivos baixados. Neste artigo, mostraremos como você pode impedir que o Windows 10 bloqueie seus arquivos baixados. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> O que é o Gerenciador de anexos no Windows 10? </h2> <p> No Windows 10, há um recurso de segurança chamado Gerenciador de Anexos que impede você de abrir arquivos não seguros. Podem ser arquivos que você baixou ou <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> arquivos que o Windows identifica como anexos de e-mail inseguros </a> . Se o Gerenciador de anexos considerar um arquivo inseguro, ele impede o Windows 10 de abri-lo e exibe uma mensagem de aviso. O Attachment Manager classifica os arquivos baixados com base no tipo de arquivo e na extensão do nome do arquivo. </p> <p> O Gerenciador de anexos do Windows usa a interface de programação de aplicativo (API) IAttachmentExecute para localizar o tipo de arquivo, a associação do arquivo e determinar a ação mais apropriada a ser executada. Quando você baixa arquivos e os salva no disco, o Windows adiciona metadados específicos a esses arquivos. Esses metadados são considerados anexos. Quando o Windows adiciona metadados aos arquivos de download como um anexo, isso é conhecido como Informações de zona. </p> <p> Agora o <strong> Informação de zona </strong> é onde está a raiz da questão. Quando o File Explorer abre um arquivo, ele lê as informações da Zona anexadas armazenadas no mesmo local e verifica se o arquivo veio de uma fonte desconhecida ou não. Se o Windows descobrir que o arquivo não é reconhecido ou é proveniente de fontes desconhecidas, ele impede que você o abra. </p> <p> Um aviso do Windows SmartScreen aparecerá informando: </p> <blockquote> <p> O Windows SmartScreen impediu a inicialização de um aplicativo não reconhecido. Executar este aplicativo pode colocar seu PC em risco. </p> </blockquote> <p> Se você deseja abrir manualmente um arquivo bloqueado, clique com o botão direito no arquivo baixado e selecione <strong> Propriedades </strong> . Na guia Geral, clique em <strong> Desbloquear </strong> , clique <strong> Aplicar </strong> e então clique <strong> OK </strong> . </p> <p> Mas imagine que você tenha que fazer isso sempre que baixar um arquivo - isso pode ser irritante e demorado. Se você costuma baixar arquivos da Internet ou recebe arquivos como anexos de e-mail, pode querer impedir completamente o seu PC de bloquear seus arquivos. </p> <p> Para impedir que o Windows 10 bloqueie a abertura de seus arquivos, você precisa impedi-lo de adicionar informações de zona aos arquivos baixados. Você pode fazer isso configurando o Gerenciador de Anexos manualmente usando o Editor de Diretiva de Grupo Local ou o Editor do Registro. </p> <p> Forneceremos etapas sobre como você pode fazer isso. Você deve estar conectado como administrador ou <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> solicitar direitos de administrador </a> para impedir que os arquivos baixados sejam bloqueados. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Configure o gerenciador de anexos usando o Editor de registro </h2> <p> aperte o <strong> Tecla Windows + R </strong> para abrir o Editor do Registro. A partir daí, digite &quot;Regedit&quot; e clique em <strong> Entrar </strong> . Um prompt de controle de conta de usuário aparecerá. Quando este prompt aparecer, clique no <strong> sim </strong> botão para continuar. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Navegue até a chave de anexos no Editor de registro: <strong> HKEY_CURRENT_USER&gt; Software&gt; Microsoft&gt; Windows&gt; CurrentVersion&gt; Políticas&gt; Anexos </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> Se a chave Attachments estiver ausente na chave Policies, você terá que criá-la. Para fazer isso, clique com o botão direito no <strong> Políticas </strong> chave, clique <strong> Novo </strong> , clique <strong> Chave </strong> . Isso criará uma nova chave, que você deve chamar de &quot;Anexos&quot;. Se você achar que a chave de anexos já está presente, você pode pular para a próxima etapa. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> Clique com o botão direito no <strong> Anexos </strong> chave, clique <strong> Novo </strong> e então selecione <strong> Valor DWORD (32 bits) </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Você será solicitado a nomear esse valor DWORD recém-criado. Nomeie como &quot;SaveZoneInformation&quot; e clique em <strong> Entrar </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> Finalmente, para desabilitar o Gerenciador de Anexos no Windows 10, clique duas vezes no recém-criado <strong> SaveZoneInformation </strong> valor e altere seus dados de valor para 1. Clique <strong> OK </strong> terminar. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Ao concluir essas etapas, feche o Editor do Registro e reinicie o computador para aplicar as alterações. Daqui em diante, qualquer arquivo baixado não anexará mais informações de zona ao fluxo de dados alternativo do arquivo. Isso permitirá que você abra seus arquivos sem dificuldades. </p> <p> Se desejar voltar e ativar o Gerenciador de anexos, você pode fazer isso navegando até a chave de anexos no Editor de registro: <strong> HKEY_CURRENT_USER&gt; Software&gt; Microsoft&gt; Windows&gt; CurrentVersion&gt; Políticas&gt; Anexos </strong> . A partir daqui, do lado direito, clique duas vezes no <strong> SaveZoneInformation </strong> valor e altere seus dados de valor para 3. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Configurar o gerenciador de anexos usando o editor de política de grupo local </h2> <p> O Editor de Política de Grupo Local está disponível apenas nas edições Windows 10 Enterprise, Education e Pro. Como resultado, este método não é aplicável se você possui a edição do Windows 10 Home. Se o seu PC roda na edição Windows 10 Home, você precisará configurar o Attachment Manager por meio do Editor do Registro. </p> <p> Se você estiver usando uma edição do Windows 10 com o Editor de Política de Grupo Local, poderá configurar o Gerenciador de Anexos seguindo as etapas indicadas aqui. </p> <p> Para começar, pressione <strong> Tecla Windows + R </strong> , digite &quot;gpedit.msc&quot; e clique em <strong> Entrar </strong> para abrir o Editor de Política de Grupo Local. </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Navegue até o Gerenciador de anexos: <strong> Configuração do usuário&gt; Modelos administrativos&gt; Componentes do Windows&gt; Gerenciador de anexos </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> No painel direito do Attachment Manager, clique duas vezes no <strong> Não preserve as informações da zona em anexos de arquivo </strong> política para editar as configurações de informações da zona. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> Uma janela aparecerá onde você pode escolher se o Attachment Manager deve ou não preservar as informações da zona </p> <p> Clique <strong> Habilitado </strong> para permitir que o Gerenciador de anexos não preserve as informações da zona. Isso garantirá que o Windows não bloqueie seus arquivos sempre que você abri-los. Clique no <strong> Aplicar </strong> botão para salvar as alterações e clique em <strong> OK </strong> . </p> <p> Ao terminar, feche o Editor de Política de Grupo Local e reinicie o PC para salvar as alterações. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> O Windows não bloqueará seus arquivos mais </h2> <p> Se você teve que desbloquear manualmente a maioria dos arquivos baixados, deve ter percebido como esse processo pode ser cansativo. Depois de aplicar essas dicas, você terá a liberdade de abrir todos os seus arquivos com facilidade. </p> <p> Se você baixar arquivos e de alguma forma duvidar de sua credibilidade, você sempre pode abri-los em ambientes isolados e seguros para garantir que seu PC e dados estejam seguros. </p>"}