{"title":"Como encaminhar um texto no Android","content":"<p> Se você deseja encaminhar um texto para alguém a partir de seu dispositivo Android, não é necessário digitá-lo ou copiar e colar. Em vez disso, você pode usar a função de encaminhamento. </p> <p> O processo é ligeiramente diferente dependendo de qual aplicativo de mensagens você usa. Dito isso, as etapas são simples e praticamente as mesmas. </p> <p> Vamos mostrar como encaminhar uma mensagem de texto SMS no aplicativo Android Mensagens padrão e no equivalente da Samsung. </p> <h2 id=\"how-to-forward-a-text-on-android-stock\"> Como encaminhar um texto no Android (estoque) </h2> <ol> <li> No aplicativo de mensagens Android padrão, abra a conversa de texto que contém a mensagem que você deseja encaminhar. </li> <li> <strong> pressione e segure </strong> na mensagem. </li> <li> Toque em <strong> três pontos verticais </strong> no canto superior direito. </li> <li> Na lista, escolha para quem você deseja encaminhar a mensagem. Como alternativa, para enviá-lo a alguém que não está na lista, toque <strong> Nova mensagem </strong> . </li> <li> A mensagem encaminhada aparecerá no campo da mensagem. Você pode adicionar ou alterar esta mensagem, se necessário. Quando estiver pronto, toque no <strong> Botão enviar </strong> (seta para a direita) para encaminhar a mensagem. </li> </ol> <p> </p> <h2 id=\"how-to-forward-a-text-on-samsung-phones\"> Como encaminhar uma mensagem de texto em telefones Samsung </h2> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (3 imagens) </strong> <img alt=\"forward message android\" src=\"images/forward-message-android-497.jpg\" loading=\"lazy\"> Expandir <img alt=\"forward message android searching names\" src=\"images/forward-message-android-searching-names-240.jpg\" loading=\"lazy\"> Expandir <img alt=\"forward message android multiple names selected\" src=\"images/forward-message-android-multiple-names-selected-924.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <ol> <li> Abra a conversa de texto que contém a mensagem que você deseja encaminhar. </li> <li> <strong> pressione e segure </strong> na mensagem. </li> <li> Tocar <strong> Avançar </strong> . </li> <li> Encontre o destinatário por meio do <strong> Conversas </strong> ou <strong> Contatos </strong> aba. Toque no nome deles. Você pode selecionar vários destinatários, se desejar. </li> <li> Tocar <strong> Feito </strong> . </li> <li> A mensagem encaminhada aparecerá no campo da mensagem. Você pode adicionar ou alterar esta mensagem, se necessário. Quando estiver pronto, toque no <strong> Botão enviar </strong> (seta para a direita) para encaminhar a mensagem. </li> </ol> <p> </p> <p> </p> <h2 id=\"why-can-t-i-forward-a-text-on-android\"> Por que não consigo encaminhar uma mensagem no Android? </h2> <p> Se você não consegue ver uma opção de encaminhamento, provavelmente é porque você selecionou toda a conversa ou vários textos. Ao contrário de alguns dos <a href=\"https://www.makeuseof.com/tag/messaging-apps-phone-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> melhores aplicativos de mensagens </a> como o WhatsApp, a maioria dos aplicativos de SMS não permite que você encaminhe vários textos de uma vez. Se você encontrar esse problema, certifique-se de selecionar um texto. </p> <p> </p> <h2 id=\"forward-your-calls-on-android\"> Encaminhe suas chamadas no Android </h2> <p> Você sabia que mensagens de texto não são a única coisa que você pode encaminhar no Android? Você também pode configurar o encaminhamento de chamadas para que possa direcionar suas chamadas para outro número. </p>"}