{"title":"Como enviar e receber mensagens de texto em seu iPad","content":"<p> Você está cansado de ter que manter seu iPhone ao seu lado para garantir que não perca nenhuma mensagem de texto importante? Felizmente, há uma maneira simples de configurar seu iPad para enviar e receber mensagens de texto. </p> <p> Usando o iCloud, a Apple oferece uma opção fácil de sincronizar seus textos do seu iPhone para o seu iPad, permitindo que você envie e receba mensagens de qualquer um dos dispositivos. As etapas a seguir irão configurá-lo para fazer isso em nenhum momento. </p> <h2 id=\"before-you-begin\"> Antes de você começar </h2> <p> Você precisa se certificar de que tem acesso a ambos os dispositivos, pois precisará ajustar as configurações para <a href=\"https://www.makeuseof.com/tag/how-to-sync-iphone-and-ipad/\" target=\"_blank\" rel=\"nofollow noopener\"> sincronize seu iPhone e iPad juntos </a> . </p> <p> Além disso, seu iPhone precisará estar ligado e conectado a uma rede Wi-Fi ou celular. Isso ocorre porque os textos que você envia do seu iPad são roteados pelo iPhone. </p> <p> Você também precisa se certificar de que está conectado ao iMessage com o mesmo ID Apple em ambos os dispositivos. Faça isso com as seguintes etapas: </p> <ol> <li> Abra o <strong> Definições </strong> aplicativo. </li> <li> Tocar <strong> Faça login em seu [dispositivo] </strong> . </li> <li> Digite seu nome de usuário e senha Apple ID. </li> <li> Se solicitado, digite o <strong> código de verificação de seis dígitos </strong> enviado para seu dispositivo ou número de telefone confiável e faça o login completo. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (3 imagens) </strong> <img alt=\"Opening Settings on iPhone\" src=\"images/settings-icon-1-698.jpg\" loading=\"lazy\"> Expandir <img alt=\"Signing into iCloud Account on iPhone\" src=\"images/sign-into-icloud-account-1-448.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple ID Verification Code\" src=\"images/icloud-verification-code-400.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> Agora que você tem seus dispositivos e está conectado com o mesmo ID Apple, está pronto para começar. </p> <p> </p> <p> </p> <h2 id=\"step-1-set-up-your-iphone\"> Etapa 1. Configure o seu iPhone </h2> <p> Você deve primeiro garantir que seu iPhone esteja configurado para permitir o encaminhamento de mensagens. Veja como: </p> <ol> <li> Abrir <strong> Definições </strong> no seu iPhone. </li> <li> Selecione <strong> Mensagens </strong> . </li> <li> Ligar <strong> iMessage </strong> com o botão de alternância, se ainda não estiver ativado. </li> <li> Próximo selecione <strong> Encaminhamento de mensagens de texto </strong> . </li> <li> Escolha qual <strong> dispositivos </strong> pode enviar e receber mensagens de texto do seu iPhone. </li> <li> Se você não estiver usando a autenticação de dois fatores para o seu ID Apple, um <strong> Código de verificação </strong> aparece em cada um dos seus outros dispositivos: insira esse código no seu iPhone. Se você estiver usando a autenticação de dois fatores, pode pular esta etapa. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (3 imagens) </strong> <img alt=\"Turn on Text Message Forwarding on iPhone\" src=\"images/iphone-imessage-to-icloud-1-438.jpg\" loading=\"lazy\"> Expandir <img alt=\"Text Message Forwarding from an iPhone\" src=\"images/text-message-forwarding-from-iphone-234.jpg\" loading=\"lazy\"> Expandir <img alt=\"Apple ID Verification Code\" src=\"images/icloud-verification-code-439.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> </p> <h2 id=\"step-2-set-up-your-ipad\"> Etapa 2. Configure seu iPad </h2> <p> Cada mensagem que você envia e recebe no seu iPad é salva no iCloud. Você deve garantir que o Mensagens para iCloud esteja ativado no seu iPad. Aqui está como fazer isso: </p> <ol> <li> Abrir <strong> Definições </strong> no seu iPad. </li> <li> Selecione seu <strong> identificação da Apple </strong> nome da conta. </li> <li> Selecione <strong> iCloud </strong> . </li> <li> Ligar <strong> Mensagens </strong> . </li> </ol> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (2 imagens) </strong> <img alt=\"Opening iCloud Settings on iPad\" src=\"images/opening-apple-id-settings-on-ipad-295.jpg\" loading=\"lazy\"> Expandir <img alt=\"Turn on Messages on iPad\" src=\"images/turn-on-messages-on-ipad-637.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> </p> <h2 id=\"texting-from-your-iphone-or-your-ipad-made-easy\"> Enviar mensagens de texto do seu iPhone ou iPad com facilidade </h2> <p> Agora que você tem tudo configurado, tudo que você precisa fazer é abrir o aplicativo Mensagens no seu iPad para ver todas as suas conversas ou iniciar uma nova como faria normalmente no iPhone. </p> <p> Chega de carregar todos os seus dispositivos para garantir que você não perca nenhuma mensagem de texto importante, desde que seu iPhone esteja ligado e conectado a uma rede Wi-Fi ou celular. </p>"}