{"title":"Como fazer um loop de um vídeo do YouTube","content":"<p> Você quer fazer um loop de um vídeo do YouTube? Quer seja sua música favorita ou uma compilação engraçada, você não precisa recarregar a página se quiser repetir um vídeo do YouTube. </p> <p> Vamos mostrar como fazer um loop de um vídeo do YouTube no desktop e no celular. </p> <h2 id=\"how-to-loop-a-youtube-video-on-desktop\"> Como fazer um loop de um vídeo do YouTube no desktop </h2> <ol> <li> Vá para o vídeo que deseja repetir. </li> <li> <strong> Clique com o botão direito </strong> o vídeo (não em torno dele). O menu de contexto do YouTube será aberto. </li> <li> Clique <strong> Laço </strong> . <p> <img alt=\"youtube video loop desktop\" src=\"images/youtube-video-loop-desktop-114.jpg\" loading=\"lazy\"> </p> </li> </ol> <p> Quando o vídeo chegar ao final, ele entrará em loop automaticamente. Para confirmar se está habilitado, <strong> clique com o botão direito </strong> o vídeo e você verá uma marca ao lado de <strong> Laço </strong> (que você pode clicar novamente para desativar). </p> <p> </p> <p> </p> <h2 id=\"how-to-loop-a-youtube-video-on-mobile\"> Como fazer um loop de um vídeo do YouTube no celular </h2> <p> Infelizmente, repetir um vídeo do YouTube no aplicativo móvel não é tão simples quanto no desktop. Em vez disso, você precisa colocar o vídeo em uma lista de reprodução. Veja como fazer isso: </p> <ol> <li> Vá para o vídeo que deseja repetir. </li> <li> Abaixo do vídeo, mantenha pressionado o <strong> Salve  </strong> botão. </li> <li> Tocar <strong> Nova Playlist </strong> . </li> <li> Insira um nome para a lista de reprodução, escolha um <strong> Privacidade </strong> configuração e toque <strong> Crio </strong> . </li> <li> Tocar <strong> Veja a lista </strong> para ir para a nova lista de reprodução (ou vá para a tela inicial do aplicativo, toque <strong> Biblioteca </strong> no menu inferior e insira sua lista de reprodução). </li> <li> Toque em <strong> Shuffle </strong> ícone (duas setas entrelaçadas). <p> <strong class=\"gallery__section-title\"> Galeria de imagens (3 imagens) </strong> <img alt=\"youtube android save\" src=\"images/youtube-android-save-686.jpg\" loading=\"lazy\"> Expandir <img alt=\"youtube android new playlist\" src=\"images/youtube-android-new-playlist-719.jpg\" loading=\"lazy\"> Expandir <img alt=\"youtube android repeat playlist\" src=\"images/youtube-android-repeat-playlist-472.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> </li> <li> Reproduza o vídeo e toque na seta no canto inferior direito do vídeo. A partir daí, toque no <strong> Laço </strong> ícone (duas setas formando um retângulo). </li> </ol> <p> Quando o vídeo chegar ao final, ele entrará em loop automaticamente. Claro, você também pode adicionar vários vídeos a esta lista de reprodução. </p> <p> </p> <h2 id=\"how-to-use-an-external-service-to-loop-a-youtube-video\"> Como usar um serviço externo para repetir um vídeo do YouTube </h2> <p> Se você não quiser usar os métodos nativos acima por qualquer motivo, você também pode usar um serviço externo chamado <a href=\"https://www.youtuberepeater.com\" target=\"_blank\" rel=\"nofollow noopener\"> Repetidor YouTube </a> . </p> <p> Para usar isso facilmente, vá para o vídeo do YouTube que deseja repetir. Na barra de URL, substitua <strong> youtube.com </strong> com <strong> youtuberepeater.com </strong> e vá para este novo URL. </p> <p> Por exemplo, se você quiser fazer um loop <strong> youtube.com/watch?v=n9xhJrPXop4 </strong> , você mudaria para <strong> youtuberepeater.com/watch?v=n9xhJrPXop4 </strong> . </p> <p> Isso não funcionará em vídeos em que o uploader não permitiu que o vídeo fosse incorporado fora do YouTube. Como tal, usar um dos dois métodos acima é a escolha ideal. </p>"}