{"title":"Como criar e vender predefinições do Lightroom: o guia definitivo","content":"<p> Hoje em dia, editar fotos é tão importante quanto a foto que você tira. E uma das plataformas mais populares para realizar a pós-produção é o Adobe Lightroom. </p> <p> Muitos fotógrafos economizam horas no processamento de fotos criando predefinições. Mas além de permitir que você edite fotos mais rapidamente, você também pode compartilhar suas predefinições com outras pessoas - e potencialmente ser pago para fazer isso! </p> <p> Neste artigo, você aprenderá como criar predefinições com o Lightroom e vendê-las online. Você também descobrirá as melhores dicas para divulgar sua arte. </p> <h2 id=\"what-is-a-lightroom-preset\"> O que é uma predefinição do Lightroom? </h2> <p> Uma predefinição do Lightroom é uma máscara que altera a aparência da sua foto sem a necessidade de ajustar todos os diferentes botões do aplicativo. Leva segundos para adicionar a uma foto e é ótimo quando você está procurando uma aparência específica. </p> <p> A Adobe possui uma variedade de predefinições prontas nos aplicativos Lightroom Classic e Creative Cloud. Alguns funcionam muito bem para fotos, mas você descobrirá que muitos não são adequados ao seu estilo único. </p> <p> Para resolver esse problema, a Adobe também permite que os usuários criem suas próprias predefinições. Você pode adicionar isso a todas as suas fotos futuras para criar um clima semelhante ou um tema consistente. </p> <p> </p> <h2 id=\"how-to-create-a-lightroom-preset\"> Como criar uma predefinição do Lightroom </h2> <p> Criar uma predefinição do Lightroom é fácil. Abaixo está uma explicação passo a passo sobre como fazer isso: </p> <ol> <li> Abra o aplicativo Lightroom Classic ou Creative Cloud, dependendo de sua preferência. </li> <li> Importe suas fotos para o Lightroom e faça as edições que achar necessárias. </li> <li> Vou ao <strong> Presets </strong> guia na parte inferior da tela. </li> <li> Clique nos três pontos no canto superior direito. Então, toque em <strong> Criar Predefinição </strong> . </li> <li> Dê um nome à sua predefinição e pressione <strong> Salve  </strong> . </li> </ol> <p> <img alt=\"save a preset in adobe lightroom\" src=\"images/save-preset-screenshot-132.png\" loading=\"lazy\"> </p> <p> Ao editar suas fotos, é essencial garantir que sua pós-produção não seja descuidada. </p> <p> </p> <h2 id=\"how-to-export-a-preset-in-lightroom\"> Como exportar uma predefinição no Lightroom </h2> <p> Depois de salvar sua predefinição no Lightroom, é hora de exportá-la para o seu computador ou unidade de disco. Para fazer isso, siga estas etapas: </p> <ol> <li> Clique com o botão direito na predefinição salva e selecione <strong> Exportar </strong> . <p> <img alt=\"Export Screenshot MUO\" src=\"images/muo-export-screenshot-114.png\" loading=\"lazy\"> </p> </li> <li> Escolha para onde deseja exportar a predefinição. </li> <li> Confirme sua escolha clicando em <strong> Exportar </strong> novamente. <p> <img alt=\"export lightroom preset to desktop\" src=\"images/export-preset-lightroom-746.png\" loading=\"lazy\"> </p> </li> </ol> <p> </p> <h2 id=\"where-can-you-sell-your-lightroom-presets\"> Onde você pode vender suas predefinições do Lightroom? </h2> <p> Antes de vender suas predefinições, é uma boa ideia pesquisar suas opções e escolher a que melhor se adapta a você. Aqui está uma lista de alguns locais populares para vender predefinições do Lightroom, bem como as vantagens e desvantagens de usá-las. </p> <h3 id=\"your-own-website\"> Seu Próprio Site </h3> <p> Se você planeja <a href=\"https://www.makeuseof.com/tag/best-website-builders-create-clean-online-portfolio/\" target=\"_blank\" rel=\"nofollow noopener\"> criar um site </a> ou já possuir um, você pode vender suas predefinições do Lightroom lá e ficar com a maior parte do dinheiro. </p> <p> Para vender suas predefinições em seu site, você precisará criar uma lista e descobrir como entregará o produto. A maneira mais fácil de fazer isso é enviando um arquivo ou link para download sempre que for feita uma compra. </p> <p> <strong> Os prós de ter seu próprio site: </strong> </p> <ul> <li> As pessoas vêm especificamente para você, o que significa que você não precisa competir com os outros no mercado. </li> <li> Você não precisa pagar taxas de mercado, o que pode causar um impacto notável em seus lucros ao longo do tempo. </li> <li> Você parecerá mais profissional. </li> <li> Os usuários provavelmente confiarão mais em você em seu próprio site do que na vitrine de um mercado online. </li> </ul> <p> <strong> Os contras de ter seu próprio site: </strong> </p> <ul> <li> Se você ainda não tem um grande público online, pode ter dificuldade para atrair clientes pagantes. </li> <li> Configurar sua loja vai levar tempo e dinheiro </li> <li> Você precisará aprender uma série de outras habilidades, como SEO e marketing digital. </li> </ul> <p> <strong> Você deve considerar a venda de predefinições em seu site se: </strong> </p> <ul> <li> Tenha uma presença online de tamanho decente. </li> <li> Estão dispostos a aprender SEO e construção de sites. </li> </ul> <p> Mesmo se você ainda não tiver uma grande presença online, ainda é uma boa ideia enviar suas predefinições para sua loja online de qualquer maneira. Então, conforme você atrai mais seguidores, eles podem comprar seus produtos sem que você precise fazer todo o trabalho de configuração posteriormente. </p> <h3 id=\"online-creative-marketplaces\"> Mercados Criativos Online </h3> <p> Se não quiser vender suas predefinições em seu site, você pode escolher entre vários mercados online. </p> <p> Alguns dos mercados online mais populares para criativos são: </p> <ul> <li> <a href=\"https://creativemarket.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Mercado Criativo </a> </li> <li> <a href=\"https://www.etsy.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Etsy </a> </li> <li> <a href=\"https://exchange.adobe.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Exchange </a> </li> <li> <a href=\"https://sellfy.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Sellfy </a> </li> </ul> <p> <strong> Os profissionais dos mercados online: </strong> </p> <ul> <li> Você não precisa se preocupar com SEO, construção de um público ou enormes custos de configuração. </li> <li> Com o tempo, seus ganhos serão compostos se você for um vendedor de sucesso. </li> </ul> <p> <strong> Os contras dos mercados online: </strong> </p> <ul> <li> Esses sites consomem uma parte considerável de seus ganhos. Portanto, você precisa vender mais do que se usasse seu próprio site. </li> <li> Você não é a única pessoa nesse site. Se o seu estilo não for único o suficiente, você não se destacará e ninguém comprará seus produtos. </li> </ul> <p> <strong> Os mercados online são bons para: </strong> </p> <ul> <li> Usuários sem experiência em vendas online, mas querem entender como funciona o comércio eletrônico. </li> <li> Fotógrafos sem muito tempo para montar sua própria loja online. </li> <li> Usuários sem um grande público online. </li> </ul> <p> </p> <h2 id=\"how-to-promote-your-presets\"> Como promover suas predefinições </h2> <p> Depois de criar e enviar suas predefinições, é hora de deixar o mundo saber sobre seu trabalho. Existem várias maneiras de promover suas predefinições. Aqui estão algumas opções que você pode tentar. </p> <h3 id=\"1-youtube\"> 1 <a href=\"https://www.youtube.com/\" target=\"_blank\" rel=\"nofollow noopener\"> YouTube </a></h3> <p> Embora a construção de um canal no YouTube leve tempo, a plataforma é excelente para divulgar sua mensagem como criativo. O público já está lá, o que significa que tudo que você precisa fazer é descobrir como atraí-lo. </p> <p> </p> <p> Para promover suas predefinições no YouTube, você precisa primeiro criar um conteúdo valioso. Documente suas experiências fotográficas e ofereça dicas úteis para outras pessoas que desejam tirar fotos melhores. Você também pode falar sobre como fez sua predefinição e fornecer tutoriais e dicas sobre como as pessoas podem criar as suas próprias. </p> <h3 id=\"2-instagram\"> 2 <a href=\"https://www.instagram.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Instagram </a></h3> <p> <img alt=\"adobe lightroom presets instagram\" src=\"images/lightroom-instagram-598.jpg\" loading=\"lazy\"> </p> <p> Como você pode esperar de uma plataforma visual, o Instagram é outro bom lugar para promover suas predefinições do Lightroom. O aplicativo também mudou mais para o comércio online nos últimos anos, resultando em mais criadores vendendo seus produtos nele. </p> <p> Como no YouTube, você precisará criar um conteúdo útil antes de vender suas predefinições. Ao enviar fotos, fale sobre como você as editou e talvez até dê dicas de fotografia. Você também pode discutir o que aprendeu e incentivar outras pessoas a participarem da conversa. </p> <p> </p> <p> Além das postagens padrão, pense em como você pode usar as Histórias e os Momentos do Instagram para seu benefício também. </p> <h3 id=\"telling-your-friends-and-family\"> 3. Contando para seus amigos e família </h3> <p> <img alt=\"promote lightroom presets\" src=\"images/promote-presets-to-friends-343.jpg\" loading=\"lazy\"> </p> <p> Você tem amigos e familiares que sempre se perguntam como suas fotos ficam tão boas? Bem, eles saberão assim que comprarem suas predefinições. </p> <p> Ao vender predefinições e outros itens online, seu círculo imediato é um ótimo lugar para começar. Mesmo que eles não estejam muito interessados ​​em fotografia, eles ainda vão querer apoiá-lo. Ou então, eles podem conhecer alguém que gosta de tirar fotos e irá encaminhá-lo para eles. </p> <p> </p> <h2 id=\"share-your-art-with-the-world\"> Compartilhe sua arte com o mundo </h2> <p> As predefinições do Lightroom são uma ótima maneira de otimizar seu fluxo de trabalho fotográfico, mas você também pode usar suas edições para ajudar outras pessoas. Existem muitos lugares para vender predefinições do Lightroom online, cada um com vantagens e desvantagens exclusivas. </p> <p> Para vender suas predefinições online com sucesso, certifique-se de que seu estilo seja único o suficiente para que outras pessoas prestem atenção. E antes de começar a enviar suas predefinições, lembre-se de fornecer muito conteúdo gratuito. Então, as pessoas estarão mais dispostas a comprar seus produtos. </p>"}