{"title":"Como fazer uma captura de tela em um tablet Surface Pro","content":"<p> Tirar uma captura de tela é uma habilidade simples, mas essencial em qualquer dispositivo. No Surface Pro Tablet, você pode fazer capturas de tela usando os atalhos do teclado, a ferramenta de recorte ou até mesmo a Barra de Jogo Xbox. Mostraremos como utilizar todos esses métodos para fazer uma captura de tela ou até mesmo uma gravação de tela em seu dispositivo Surface. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Captura de tela usando combinações de botões </h2> <p> Na linha de dispositivos Surface Pro, tirar uma captura de tela usando combinações de botões é rápido e fácil. Para fazer uma captura de tela, mantenha pressionado <strong> Poder </strong> e <strong> Aumentar o volume </strong> chave ao mesmo tempo. A tela deve piscar e a captura de tela deve ser salva na pasta de capturas de tela em Imagens do seu dispositivo. </p> <p> Este método funciona para a linha de dispositivos Surface Pro mais recente (ou seja, Surface Pro 7+, Pro X), The Surface Go, Surface Go 2 e a linha de dispositivos Surface Book. </p> <p> Se o seu Surface for um modelo mais antigo (Surface 3 ou mais antigo), a combinação de botões é um pouco diferente. Você tem que pressionar o <strong> Botão Windows </strong> (não a tecla Windows em seu teclado) e a <strong> Volume baixo </strong> botão ao mesmo tempo. O dispositivo salvará sua captura de tela na pasta Capturas de tela em Fotos. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> Da mesma forma, para fazer uma captura de tela no Surface Duo, mantenha pressionado o <strong> Poder </strong> botão e o <strong> Volume baixo </strong> chave. A captura de tela deve ser salva na galeria do seu dispositivo em Capturas de tela. Alternativamente, você pode simplesmente manter pressionado o <strong> Poder </strong> chave e clique no <strong> Captura de tela </strong> botão na tela. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> Como fazer uma captura de tela do Surface Pro usando atalhos de teclado </h2> <p> Os atalhos do teclado são outra maneira de capturar o que está na tela. </p> <p> Esses atalhos de teclado funcionam em todos os dispositivos Windows, então verifique <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> outros métodos de captura de tela no Windows 10 </a> . Os atalhos de teclado funcionam melhor na linha de dispositivos Surface Laptop e Surface Book, mas é claro, se você tiver o teclado anexado para o dispositivo Surface Pro ou Go, esses atalhos também funcionarão. </p> <h3 id=\"print-screen-methods\"> Métodos de tela de impressão </h3> <p> Para fazer uma captura de tela usando o método Print Screen, basta pressionar o <strong> PrtScn </strong> botão no teclado. Isso fará uma captura de tela de toda a sua área de trabalho. Observe que isso não salvará a captura de tela no Surface, mas a adicionará à área de transferência. Você deve usar um programa como o Microsoft Paint para colar a captura de tela. </p> <p> Pressionando <strong> Alt + PrtScn </strong> fará uma captura de tela apenas da janela atual e, da mesma forma, a adicionará à área de transferência. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Recorte e esboço </h3> <p> Este é de longe o método mais fácil de fazer uma captura de tela no seu dispositivo Surface. </p> <p> Para abrir Snip e Sketch, pressione o <strong> Tecla Windows + Shift + S, </strong> e uma sobreposição deve aparecer na tela. Para fazer uma captura de tela completa, pressione o botão Tela inteira na parte superior da sobreposição. Para fazer uma captura de tela apenas da janela atual, pressione o botão Recorte da janela próximo ao botão Tela inteira. </p> <p> Você também pode fazer uma captura de tela de uma área específica da tela. Por padrão, Snip e Sketch têm o Recorte retangular. Basta arrastar sobre a parte da qual deseja fazer a captura de tela usando a tela sensível ao toque ou o trackpad. </p> <p> Snip and Sketch lhe dará uma notificação em seu painel de notificação para dizer que sua captura de tela foi copiada para sua área de transferência. Se você clicar nele, poderá desenhar e esboçar sobre uma captura de tela, se desejar. </p> <p> Para salvá-lo em seus arquivos, use <strong> Ctrl + S </strong> ou o botão Salvar no canto superior direito para salvar sua captura de tela em uma pasta específica. </p> <h3 id=\"xbox-game-bar\"> Barra de jogos Xbox </h3> <p> Para fazer uma captura de tela usando a Barra de Jogo Xbox, pressione o botão <strong> Tecla Windows + G </strong> para abri-lo. </p> <p> A partir daí, você pode clicar na guia Capturas e clicar no botão Câmera. Este método também permitirá que você faça uma captura de vídeo de sua tela com áudio. Suas capturas salvas aparecerão na pasta Vídeos e na subpasta Capturas. Em um Xbox, você pode da mesma forma <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> capturar capturas de tela e gravações </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Tirar uma captura de tela do Surface Pro usando a caneta Surface </h2> <p> Para fazer uma captura de tela usando a Caneta de superfície, basta clicar duas vezes na borracha e seu dispositivo deve exibir Recorte e Esboço de toda a janela. A partir daqui, você pode esboçar e exportar sua captura de tela. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> Você também pode acessá-lo procurando por Windows Ink Workspace em seu dock. A partir daqui, selecione Recorte em tela inteira. Você pode alterar o que os atalhos de botão da Caneta Surface fazem pesquisando por Configurações do Windows Ink Workspace e rolando para baixo até o Windows Ink Workspace. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Fazendo uma captura de tela na superfície, de forma simples </h2> <p> Agora você conhece todos os vários métodos de captura de tela ou gravação de tela em seu dispositivo Surface. As combinações de botões são a melhor maneira tátil de fazer uma captura de tela se você estiver usando o Surface Pro ou Surface Go, mas os atalhos do teclado também são fáceis. </p>"}