{"title":"Como corrigir o código de parada BSOD &quot;SYSTEM THREAD EXCEPTION NOT HANDLED&quot; no Windows 10","content":"<p> O &quot;SYSTEM THREAD EXCEPTION NOT HANDLED&quot; é um erro comum do Windows 10 que ocorre principalmente devido a um driver desatualizado ou incompatível. </p> <p> O que o torna mais difícil de corrigir do que outros BSODs é que vários drivers podem causar o problema e, às vezes, seu computador pode não detectá-los todos. É por isso que a primeira etapa que os usuários devem tomar ao lidar com esse erro é encontrar o driver exato que está causando o problema. </p> <p> Veja como corrigir o erro de exceção de thread do sistema não tratado no Windows 10. </p> <h2 id=\"boot-into-safe-mode\"> 1. Inicialize no modo de segurança </h2> <p> A primeira etapa que os usuários devem realizar antes de tentar corrigir esse problema é inicializar o computador no modo de segurança. Dependendo de suas preferências e se você consegue inicializar seu computador na tela de login, há várias maneiras de fazer isso: </p> <h3 id=\"boot-into-safe-mode-via-settings\"> Inicialize no modo de segurança por meio das configurações </h3> <ol> <li> Clique no <strong> Começar </strong> botão e selecione <strong> Definições </strong> . </li> <li> Navegar para <strong> Atualização e segurança </strong> então clique em <strong> Recuperação </strong> . </li> <li> Sob <strong> Inicialização avançada, </strong> Clique em <strong> Reinicie agora. </strong> </li> <li> Quando o seu PC reiniciar o <strong> Escolha uma opção </strong> deve aparecer a tela. </li> <li> Daqui vá para <strong> Solucionar problemas&gt; Opções avançadas&gt; Configurações de inicialização </strong> . Então clique em <strong> Reiniciar </strong> </li> <li> Quando o seu PC reiniciar, pressione <strong> F5 </strong> para inicializar seu computador em <strong> Modo de segurança com rede </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> Na tela de login </h3> <ol> <li> Simplesmente segure <strong> Mudança </strong> e selecione o <strong> Poder </strong> botão seguido por <strong> Reiniciar </strong> . </li> <li> Siga as etapas 4, 5 e 6 da seção acima. </li> </ol> <h3 id=\"from-a-blank-screen\"> De uma tela em branco </h3> <ol> <li> Se você não conseguir acessar a tela de login, siga estas etapas. </li> <li> Mantenha pressionado o botão liga / desliga do dispositivo por 10 segundos para desligá-lo. </li> <li> Pressione o botão liga / desliga novamente para inicializá-lo. </li> <li> Assim que o seu PC iniciar, ou seja, o logotipo do fabricante aparecer, pressione o botão liga / desliga novamente por 10 segundos. </li> <li> Pressione o botão liga / desliga para iniciar o dispositivo. </li> <li> Se feito corretamente, seu computador irá inicializar no <strong> Ambiente de recuperação do Windows </strong> . </li> <li> Siga as etapas 4, 5 e 6 da primeira seção. </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. Descobrir qual motorista é responsável </h2> <p> Como o erro provavelmente está sendo causado por um driver com defeito, você pode usar o registro do Windows para descobrir qual deles. </p> <p> Para fazer isso, basta seguir estas etapas: </p> <ol> <li> Aperte <strong> Tecla Windows + R </strong> E no <strong> Corre </strong> caixa de diálogo, digite <strong> eventvwr. </strong> </li> <li> Navegue até o <strong> Logs do Windows </strong> menu e expanda-o, em seguida, selecione <strong> Sistema. </strong> </li> <li> Procure um registro com o nome <strong> system_thread_exception_not_handled </strong> e clique nele para descobrir qual driver está causando o problema. </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> Normalmente, o driver associado será um driver de vídeo ou de rede, já que são conhecidos por causar esse BSOD. Se o arquivo associado for <strong> nvlddmkm.sys </strong> , você pode dar uma olhada em <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> algumas maneiras fáceis de consertar. </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. Reverter ou atualizar os drivers </h2> <p> Dependendo de qual driver é responsável pelo erro de exceção de thread do sistema não tratado, pode ser necessário atualizar ou reinstalar os drivers associados. </p> <p> Se o driver não tiver sido atualizado por um longo tempo, a atualização provavelmente resolverá o problema. Se o driver foi atualizado recentemente, pode ser melhor reverter o driver ou reinstalar as atualizações. </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> Como atualizar drivers no Windows 10 </h3> <ol> <li> Aperte <strong> Tecla Windows + R </strong> e digite <strong> devmgmt.msc </strong> para abrir o <strong> Gerenciador de Dispositivos </strong> . </li> <li> Navegue até o dispositivo associado e expanda o menu. Por exemplo, se o erro foi causado por um driver de vídeo, você teria que expandir o <strong> Adaptadores de vídeo </strong> opção. </li> <li> Clique com o botão direito no driver e clique em <strong> Atualizar driver </strong> . </li> <li> Na caixa de diálogo que se abre, clique em <strong> Pesquise automaticamente por software de driver atualizado </strong> . </li> <li> O Windows irá então pesquisar automaticamente na web os drivers mais recentes e instalá-los. </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> Como reverter drivers no Windows 10 </h3> <ol> <li> Abrir <strong> Gerenciador de Dispositivos </strong> e navegue até o driver em questão. </li> <li> Expanda o menu e clique com o botão direito do mouse no driver. </li> <li> Clique em <strong> Propriedades </strong> . </li> <li> Debaixo de <strong> Motorista </strong> guia, clique em <strong> Motorista de reversão </strong> . </li> <li> O Windows reverterá automaticamente para a última versão disponível do driver. </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. Renomeie o arquivo defeituoso </h2> <p> Ao recuperar o nome do arquivo associado ao erro de exceção de thread do sistema não tratado, os usuários devem renomear o arquivo. Isso fará com que o Windows crie uma nova cópia e a reinstale. Os arquivos do driver estão localizados em <strong> C: \\ Windows \\ System32 \\ drivers </strong> </p> <p> Siga estas etapas para renomear o arquivo: </p> <ol> <li> Abrir <strong> Explorador de arquivos </strong> e vai para <strong> C: \\ Windows \\ System32 \\ drivers </strong> </li> <li> Procure o driver afetado </li> <li> Clique nele e pressione <strong> F2. </strong> </li> <li> Substitua a extensão do nome do arquivo por <strong> .velho </strong> . </li> <li> Pressione Enter e reinicie o computador. </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. Use SFC e DISM para reparar arquivos do sistema </h2> <p> SFC e DISM são duas ferramentas poderosas à disposição de todos os usuários do Windows. Em combinação, eles podem localizar e corrigir quase todos os erros relacionados ao sistema. Eles também são bastante simples de executar. </p> <p> </p> <p> Certifique-se de criar um ponto de restauração do sistema, pois esses comandos alteram os arquivos do sistema. </p> <h3 id=\"how-to-use-dism\"> Como usar o DISM </h3> <ol> <li> Corre <strong> Prompt de comando </strong> como administrador </li> <li> No console, digite <strong> DISM / Online / Cleanup-Image / ScanHealth </strong> e pressione Enter. </li> <li> Aguarde até que o Windows conclua a digitalização. Então digite <strong> DISM / Online / Cleanup-image / RestoreHealth </strong> </li> <li> O Windows irá reparar todos os problemas encontrados durante a verificação. </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> Como usar SFC </h3> <ol> <li> Na barra de pesquisa do menu Iniciar, digite <strong> cmd </strong> em seguida, clique com o botão direito em <strong> Prompt de comando </strong> e execute-o como administrador. </li> <li> No console, digite <strong> sfc / scannow </strong> </li> <li> Seja paciente, pois o Windows levará algum tempo para verificar e substituir arquivos de sistema corrompidos. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. Use a Restauração do sistema para restaurar seu PC </h2> <p> Se o problema persistir, você terá que usar a Restauração do sistema como último recurso. A Restauração do sistema é um recurso que restaura o Windows a um estado anterior. Esses pontos de restauração são criados periodicamente e durante a instalação de um novo software. Alternativamente, você pode definir <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows para criar um ponto de restauração diariamente </a> </p> <h3 id=\"how-to-use-system-restore\"> Como usar a restauração do sistema </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> Na barra de pesquisa do menu Iniciar, digite <strong> Painel de controle </strong> e clique em abri-lo. </li> <li> Na barra de pesquisa do Painel de Controle, digite <strong> Recuperação </strong> e abri-lo a partir dos resultados. </li> <li> Clique em <strong> Abrir Restauração do Sistema </strong> . </li> <li> Clique em <strong> Próximo </strong> e selecione um ponto de restauração da lista. </li> <li> Clique em <strong> Terminar. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> Exceção tratada </h2> <p> As dicas listadas acima fornecem uma solução fácil para o incômodo que BSODs como system_thread_exception_not_handled causam. A melhor parte é que a maioria das dicas pode ser usada para diagnosticar muitos outros erros comuns da Tela Azul da Morte (BSOD) no Windows. </p>"}