{"title":"Como ver as estatísticas do seu tempo de reprodução no PS5","content":"<p> Se você gosta de ver quanto tempo passou jogando, o PS5 tem um recurso oculto, mas útil para você. Ele mantém o controle de quanto tempo você gastou jogando no sistema. </p> <p> Veja como verificar quanto tempo você passou jogando jogos do PlayStation 5. O que pode encorajá-lo a <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> desligue seu PS5 </a> mais frequentemente. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> Como verificar as estatísticas do seu tempo de jogo no PlayStation 5 </h2> <p> Na tela inicial do PS5, selecione o ícone do seu perfil no canto superior direito. Você pode pressionar <strong> Triângulo </strong> para mover a seleção para essa área da tela rapidamente. Depois de abrir esse menu, escolha <strong> Perfil </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Agora, mude para o <strong> Jogos </strong> aba. Aqui você verá todos os jogos que jogou em sua conta PlayStation. Cada um mostra a última vez que você jogou o jogo, bem como o total de horas de jogo. Não é preciso ao minuto, no entanto. Você verá o tempo de jogo arredondado para uma hora. </p> <p> Você também verá o tempo de jogo para seus títulos PS4 aqui, mesmo se não os tiver jogado no PS5. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> Até onde sabemos, esse tempo de jogo inclui todo o tempo em que o jogo estava em execução - não apenas quando você estava jogando ativamente. Isso significa que se você deixou o jogo no menu de pausa enquanto atendia uma ligação ou estava comendo algo, esse tempo seria incluído no total. Portanto, pode não ser muito preciso, mas pelo menos dará uma ideia de quanto tempo você jogou cada título. </p> <p> </p> <p> Se estiver curioso, você também pode ver as estatísticas de tempo de jogo para seus amigos. Selecione os <strong> Amigos </strong> na mesma tela e escolha o amigo sobre o qual deseja aprender mais. Isso mostrará quanto tempo eles passaram em seus jogos em um menu idêntico. </p> <p> Se você não quiser que suas informações de tempo de jogo fiquem visíveis para outros jogadores, vá para a direita e escolha <strong> Configurações de privacidade </strong> . Nesse menu, sob o <strong> Sua atividade </strong> seção, altere a opção para <strong> Quem pode ver seu histórico de jogo </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Alguns jogos também controlam seu próprio tempo de jogo </h2> <p> Se você estiver interessado em dados como este, certifique-se de abrir seus jogos favoritos e ver se eles controlam quanto tempo você passou jogando. Um bom número de títulos inclui o tempo total de reprodução em seu arquivo salvo, dentro do menu de pausa ou similar. </p> <p> Embora isso não seja consistente em todos os jogos e possa ou não incluir o tempo gasto durante a pausa, pode fornecer mais informações sobre um jogo sobre o qual deseja saber mais. Alguns jogos online, como Overwatch, até mesmo rastreiam o tempo gasto com cada herói nos modos. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Veja quanto você realmente joga </h2> <p> O PS5 torna mais fácil ver quanto tempo você passou jogando. É um recurso pequeno, mas muito apreciado, já que o PS4 não tornou esses dados facilmente acessíveis. </p> <p> Enquanto isso, existem outras maneiras de gerenciar seu jogo fora do próprio console. </p> <p> <small> Crédito da imagem: LightField Studios / <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}