{"title":"Como criptografar e descriptografar facilmente arquivos e diretórios no Linux","content":"<p> Você sempre quis criptografar arquivos no Linux de forma rápida e fácil sem ter que instalar e aprender novos pacotes de software? Esta é uma maneira excelente e fácil de criptografar facilmente arquivos ou diretórios via AES256 protegido por senha, ajudando a manter seus arquivos longe de olhares curiosos. </p> <h2 id=\"the-basics-of-encryption-with-openssl\"> Noções básicas de criptografia com OpenSSL </h2> <p> É importante observar que a criptografia é muito mais do que isso. </p> <p> Pode ser prudente de sua parte ler o <a href=\"https://www.openssl.org/docs/\" target=\"_blank\" rel=\"nofollow noopener\"> Documentação OpenSSL </a> antes de confiar seus dados a esse método. No entanto, supondo que você não esteja tentando fugir da NSA ou do exército russo, esse método deve funcionar perfeitamente para manter seus arquivos e diretórios seguros e inacessíveis a outras pessoas. </p> <p> </p> <h2 id=\"install-openssl\"> Instale OpenSSL </h2> <p> Você precisa do popular pacote OpenSSL instalado, então primeiro verifique se ele já está instalado com o <a href=\"https://www.makeuseof.com/basic-commands-linux/\" target=\"_blank\" rel=\"nofollow noopener\"> Comando Linux </a> : </p> <pre><code class=\"hljs\">openssl version</code></pre> <p> Se ele imprimir o número da versão atual, você está pronto para a próxima seção. Caso contrário, se receber um erro &quot;command not found&quot;, você pode instalar facilmente o OpenSSL via apt-get: </p> <pre><code class=\"hljs perl\">sudo apt-get -y install openssl</code></pre> <p> </p> <h2 id=\"encrypt-and-decrypt-files\"> Criptografar e descriptografar arquivos </h2> <p> Por exemplo, se você quiser criptografar um arquivo chamado data.tar.gz, execute o comando: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -a -salt -iter 5 -in data.tar.gz -out data.enc</code></pre> <p> Será solicitado que você insira uma senha criptografada duas vezes, que pode ser qualquer coisa que você desejar. Este comando resultará em um novo arquivo data.enc como o arquivo criptografado recentemente. Observe que isso deixará o arquivo data.tar.gz original em seu lugar, portanto, certifique-se de excluí-lo, se necessário. </p> <p> Quando desejar, você pode descriptografar o arquivo data.enc com o comando: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -d -a -iter 5 -in data.enc -out data_decrypted.tar.gz</code></pre> <p> O comando acima solicitará a senha criptografada e, em seguida, resultará em um arquivo data_decrypted.tar.gz contendo a versão descriptografada do seu arquivo. </p> <p> </p> <h2 id=\"encrypt-and-decrypt-directories\"> Criptografar e descriptografar diretórios </h2> <p> Os comandos na seção acima funcionam muito bem para arquivos individuais, mas o que acontece se você deseja criptografar um diretório inteiro? Não há suporte embutido no OpenSSL para isso, mas graças à magia do Linux, isso não é problema. Por exemplo, se você quiser criptografar um diretório chamado &quot;documentos&quot;, poderá usar o comando: </p> <pre><code class=\"hljs\">tar -cf tmpdata.tar documents && gzip tmpdata.tar && openssl aes-256-cbc -a -salt -iter 5 -in tmpdata.tar.gz -out documents.enc && rm -f tmpdata.tar.gz</code></pre> <p> Um pouco demais, mas os únicos dois lugares no comando acima que você precisa modificar são &quot;documentos&quot; no primeiro segmento, que é o diretório a ser criptografado, e &quot;documentos.enc&quot; no terceiro segmento, que é o arquivo criptografado resultante. Este comando irá arquivar o diretório, criptografá-lo e, em seguida, excluir o arquivo temporário criado, deixando um único arquivo documents.enc criptografado em seu lugar. </p> <p> Descriptografar o arquivo documents.enc recém-criado é tão fácil com o comando: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -d -a -iter 5 -in documents.enc -out tmpdata.tar.gz && tar -xzf tmpdata.tar.gz && rm -f tmpdata.tar.gz</code></pre> <p> A única parte do comando acima que você precisa modificar é &quot;documents.enc&quot; no primeiro segmento, que é o nome do arquivo criptografado. Este comando solicitará a senha de criptografia, prossiga para descriptografar e descompactar o arquivo e, em seguida, excluir o arquivo temporário deixando o diretório descriptografado como resultado. </p> <p> </p> <h2 id=\"protect-your-data\"> Proteja seus dados </h2> <p> Agora que você sabe como é fácil criptografar e descriptografar rapidamente seus dados, coloque seu conhecimento em uso e mantenha seus dados privados seguros e evite <a href=\"https://www.makeuseof.com/worst-data-breaches/\" target=\"_blank\" rel=\"nofollow noopener\"> violações de dados </a> . Mais uma vez, para reiterar, há muito mais criptografia do que o apresentado aqui e o que foi dito acima não tem como objetivo iludir a aplicação da lei ou hackers altamente qualificados e determinados. </p> <p> No entanto, se você simplesmente deseja proteger seus dados de olhares indiscretos, como os de seu cunhado ou do técnico de manutenção de computadores, os métodos acima devem resolver o problema perfeitamente. </p>"}