{"title":"Como ver quem segue você no Facebook","content":"<p> Se você se preocupa em obter mais seguidores no Facebook tanto quanto gosta de aumentar seus amigos no Facebook, então você pode querer ver quem segue você no Facebook. Você pode facilmente fazer isso em computadores e dispositivos móveis. </p> <p> Veja como descobrir quantos seguidores você tem no Facebook. </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-desktop\"> Como ver quem segue você no Facebook (desktop) </h2> <p> No desktop, você pode ver quem está seguindo você no Facebook, mas não o número de seguidores. No entanto, o aplicativo móvel do Facebook permite que você veja quem o segue e o número de seus seguidores. </p> <p> <img alt=\"Facebook profile interface with friends\" src=\"images/click-more-and-select-followers-786.jpg\" loading=\"lazy\"> </p> <p> Primeiro, faça login em seu <a href=\"https://web.facebook.com\" target=\"_blank\" rel=\"nofollow noopener\"> conta do Facebook </a> através do seu navegador e use as seguintes instruções para ver seus seguidores no Facebook: </p> <ol> <li> Uma vez logado, clique no <strong> ícone de imagem pequena </strong> ao lado do seu nome na barra lateral. </li> <li> No menu Perfil, clique em <strong> Amigos </strong> . </li> <li> No menu Amigos, clique no <strong> Mais </strong> menu suspenso à direita. </li> <li> Na lista suspensa, selecione <strong> Seguidores </strong> para ver todos os seus seguidores no Facebook. </li> </ol> <p> </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-mobile\"> Como ver quem segue você no Facebook (celular) </h2> <p> Como dissemos anteriormente, o aplicativo móvel do Facebook permite que você acesse a lista e o número de pessoas que o seguem no Facebook. </p> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (3 imagens) </strong> <img alt=\"Facebook profile about info menu\" src=\"images/tap-see-your-about-info-732.png\" loading=\"lazy\"> Expandir <img alt=\"Mobile Facebook interface displaying Facebook followers\" src=\"images/tap-see-all-to-load-a-list-of-your-followers-895.png\" loading=\"lazy\"> Expandir <img alt=\"Mobile Facebook page displaying a list of followers and their numbers\" src=\"images/look-to-the-upper-right-corner-to-see-the-number-of-followers-677.png\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> Faça login em sua conta do Facebook através do aplicativo móvel. Em seguida, siga estas instruções: </p> <ol> <li> Na página inicial do aplicativo móvel, toque no ícone redondo da imagem ao lado do <strong> O que está em sua mente? </strong> barra de pesquisa para carregar seu perfil. </li> <li> No menu do perfil, toque em <strong> Veja suas informações sobre </strong> . </li> <li> Role até o final da página. Então sob <strong> Seguidores </strong> , tocar <strong> Ver tudo </strong> para carregar uma lista de todos os seus seguidores no Facebook. </li> <li> Olhe para o canto superior direito da página (oposto <strong> Seguidores </strong> ) para ver o número de pessoas que seguem você no Facebook. </li> </ol> <p> Você não terá a opção de verificar seus seguidores no Facebook se não tiver nenhum. Como resultado, seguir as etapas acima não permitirá que você verifique seus seguidores, pois não há nenhum. </p> <p> Você também pode não obter essa opção se sua conta do Facebook for nova, pois provavelmente você ainda não tem nenhum seguidor. Ou você pode precisar <a href=\"https://www.makeuseof.com/tag/quickly-switch-facebook-profiles/\" target=\"_blank\" rel=\"nofollow noopener\"> mudar para uma conta do Facebook diferente </a> . Como alternativa, sua conta pode não estar configurada para permitir que as pessoas sigam você no Facebook - explicaremos como alterar isso abaixo. </p> <p> </p> <p> </p> <h2 id=\"how-to-give-the-public-access-to-follow-you-on-facebook\"> Como dar ao público acesso para segui-lo no Facebook </h2> <p> Às vezes, se você não permitiu que o público o seguisse, isso limita as chances de conseguir mais seguidores no Facebook. </p> <p> Isso porque as pessoas que não estão na sua lista de amigos não podem segui-lo no Facebook se você não permitir. No entanto, você pode definir sua preferência de seguimento como &quot;Público&quot; para que qualquer pessoa possa segui-lo, e não apenas seus amigos. </p> <p> <strong> Para fazer isso no desktop: </strong> </p> <p> <img alt=\"Facebook privacy settings page\" src=\"images/click-on-public-post-and-change-who-can-follow-you-to-public-880.jpg\" loading=\"lazy\"> </p> <ol> <li> Vá para o seu perfil. </li> <li> Clique no <strong> ícone redondo suspenso </strong> no canto superior direito da barra de menu. </li> <li> Na lista, selecione <strong> Configurações e privacidade </strong> . </li> <li> Clique <strong> Definições </strong> . </li> <li> Na barra lateral do menu Configurações, clique em <strong> Postagens Públicas </strong> . </li> <li> Olhe para a direita do <strong> Quem pode me seguir </strong> opção e clique no <strong> Amigos </strong> suspenso. </li> <li> Selecione <strong> Público </strong> para dar acesso de seguimento a qualquer pessoa, incluindo aqueles que não são seus amigos no Facebook. </li> </ol> <p> <strong> Para fazer isso no aplicativo móvel do Facebook: </strong> </p> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (3 imagens) </strong> <img alt=\"Facebook menu list\" src=\"images/tap-the-three-menu-bars-and-go-to-settings-170.png\" loading=\"lazy\"> Expandir <img alt=\"Facebook settings list\" src=\"images/scroll-down-and-select-public-posts-754.png\" loading=\"lazy\"> Expandir <img alt=\"Facebook followers settings page\" src=\"images/tick-the-public-option-under-who-can-follow-728.png\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <ol> <li> Abra o aplicativo móvel do Facebook e toque no <strong> três barras de menu horizontais </strong> à direita da página inicial. </li> <li> Role para baixo e selecione <strong> Definições </strong> . </li> <li> Tocar <strong> Postagens Públicas </strong> . </li> <li> Sob <strong> Quem pode me seguir </strong> , marcação <strong> Público </strong> . </li> </ol> <p> </p> <h2 id=\"keep-control-over-your-facebook-followers\"> Mantenha o controle sobre seus seguidores no Facebook </h2> <p> Se você usa o Facebook para promover sua marca ou empresa, é necessário manter o controle de seus seguidores. É uma boa maneira de moderar o que as pessoas podem ver sobre você. </p> <p> Se você deseja ter mais controle sobre seus amigos e seguidores do Facebook, deve pensar em ocultá-los de seu feed. </p>"}