{"title":"Como instalar um controlador inteligente de porta de garagem","content":"<p> Quer controlar a porta da sua garagem com o seu smartphone ou tablet? Um controlador inteligente é uma ótima opção se você já tem um controle remoto de porta de garagem instalado em sua casa. </p> <p> Mostraremos como instalar um controlador inteligente de porta de garagem. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Diferenças entre um abridor e um controlador </h2> <p> Existem duas diferenças principais entre um abridor de porta de garagem inteligente e um controlador. O primeiro é o tamanho. </p> <p> A maioria dos abridores é grande e montada no teto da garagem. Eles usam uma trilha mecânica para abrir e fechar a porta. Um controlador de porta de garagem, por outro lado, é uma pequena unidade eletrônica que permite controlar o abridor por meio de um aplicativo em um dispositivo inteligente. </p> <p> A segunda distinção entre esses dois produtos é o preço. Os abridores de portas de garagem podem custar cerca de US $ 300. A instalação desses abridores geralmente requer a ajuda de um instalador profissional. </p> <p> Um controlador, no entanto, geralmente não precisa de instalação profissional. Em vez disso, o controlador funciona como um complemento ao seu abridor existente. </p> <p> Isso significa que por uma fração do preço de um novo abridor, você pode obter a mesma funcionalidade apenas usando um controlador. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> Quais são as vantagens de uma porta de garagem inteligente? </h2> <p> Existem três vantagens principais em ter uma porta de garagem inteligente. </p> <ul> <li> <strong> Segurança </strong> —Uma porta de garagem inteligente permite que você abra e feche a porta de quase qualquer lugar. </li> <li> <strong> Segurança </strong> —A maioria dos controladores e abridores de porta de garagem inteligentes alertam você quando sua garagem estiver aberta por um determinado período de tempo. </li> <li> <strong> Conveniência </strong> —Se você já teve que voltar para casa para fechar a porta da garagem, ter um aplicativo inteligente de porta de garagem economiza tempo. Em vez de dirigir para casa, basta pegar o telefone. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> Como instalar um controlador inteligente de porta de garagem </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Se você decidiu que um controlador inteligente de porta de garagem é o certo para você, este guia mostrará como instalá-lo. Nesta demonstração, um <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meross MSG100 </a> é usado, mas esse processo é semelhante ao usar outra marca. Consulte a documentação do seu controlador para obter detalhes. </p> <h3 id=\"what-you-ll-need\"> O que você precisará </h3> <ul> <li> Um controlador de garagem inteligente </li> <li> Pistola de grampos ou suportes de arame </li> <li> Porta da garagem com abridor automático instalado </li> <li> Philips e chaves de fenda </li> <li> Escada </li> </ul> <h3 id=\"plan-the-installation\"> 1. Planeje a instalação </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Antes de instalar seu controlador, você precisará explorar alguns locais em sua garagem. O primeiro é uma fonte de alimentação para o controlador. O segundo é o caminho do fio do controlador ao sensor montado na porta incluído em seu kit. E o terceiro é a localização do sensor magnético. </p> <p> Este sensor magnético permite que o controlador saiba quando a porta é aberta ou fechada. </p> <p> A maioria dos controladores usa um longo fio para se conectar ao sensor da porta. Você precisará passar esse fio pelo teto ou descer uma parede para mantê-lo fora do caminho. </p> <p> Depois de planejar sua instalação, teste o ajuste do fio do sensor do controlador ao local do sensor. Este ajuste de teste garante que o fio do sensor chegue ao controlador. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Desligue a energia do seu abridor de porta de garagem </h3> <p> A maioria das portas de garagem é conectada à energia em algum lugar do teto. Para esses abridores, você vai querer ter certeza de que eles estão desconectados antes de continuar. </p> <p> Se o seu abridor não tiver um plugue e, em vez disso, estiver conectado à fiação que sai do teto, você precisará encontrar sua caixa de disjuntor e desligar a energia do abridor. </p> <p> <strong> Observação: </strong> A corrente doméstica de 120 volts pode causar ferimentos graves. Se você não se sentir confortável trabalhando com eletricidade, pare agora e consulte um instalador profissional de portas de garagem e / ou eletricista. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Conecte os fios incluídos ao controlador </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> Na unidade Meross, há um conjunto de fios azuis e marrons que devem ser instalados no controlador para conectar ao controle remoto da porta da garagem. Abra a tampa de plástico do controlador e você verá dois terminais de parafuso. </p> <p> Usando uma pequena chave de fenda, afrouxe os parafusos de cada terminal. Insira seus fios e aperte os parafusos. Não importa qual fio vai para onde. </p> <p> Dê um puxão suave nos fios para se certificar de que estão seguros. Em seguida, recoloque a tampa do controlador. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Monte o controlador da porta da garagem </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Como você planejou seus locais, agora é a hora de montar seu controlador. Certifique-se de que o controlador esteja em um local onde possa acessar a energia de que precisa sem sobrecarregar a fiação. </p> <p> Em seguida, remova o revestimento adesivo do controlador e pressione-o no lugar. Se você tiver um controlador com montagem de parafuso, use a chave de fenda para prendê-lo na posição. </p> <h3 id=\"mount-the-sensor\"> 5. Monte o sensor </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> Em seguida, você precisará montar o sensor para a porta. Recomenda-se que este sensor seja colocado onde não obstrua o caminho da porta. </p> <p> Além disso, você pode ficar tentado a montar o sensor próximo ao solo. Isso não é recomendado, já que respingos de água repetidamente diretamente no sensor podem causar danos. Depois de posicionar o sensor, use a fita dupla-face ou os parafusos fornecidos para prendê-lo. </p> <p> Na foto acima, o sensor preto foi montado ao lado da porta da garagem com a parte do ímã montada na própria porta. Este sensor usa fita dupla-face para montagem. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Conecte os fios do sensor </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Agora é hora de conectar os fios ao sensor e ao controlador. Usando o plano que você fez na primeira etapa, direcione os fios e use a pistola de grampos para prendê-los na parede ou no teto. </p> <p> Certifique-se de não prender ou torcer os fios, pois isso pode danificá-los. Quando eles forem roteados, conecte o conector vermelho fêmea no controlador ao conector vermelho macho na extremidade do fio do sensor. </p> <p> Em seguida, você precisará abrir a tampa do controle remoto da porta da garagem. Deve haver quatro fios presentes, dois de controle de alimentação e comuns à unidade e dois de controle do botão na parede. </p> <p> </p> <p> Normalmente, esses fios se originam do teto e devem ter terminais de espadas crimpados que os prendem à unidade do controle remoto da garagem. Se você não puder determinar quais fios são quais, pare e consulte o manual do proprietário do abridor de porta de garagem ou consulte um eletricista certificado. </p> <p> Se você encontrou os fios, conecte os fios marrom e azul do controlador aos terminais do abridor que estão conectados ao botão de parede. Na foto acima, os fios do controlador foram inseridos nos dois terminais mais à esquerda. </p> <p> Ao terminar, deve haver dois fios conectados a cada terminal de botão de parede. Fixe novamente a tampa do controle remoto da garagem, conecte o controlador e o controle remoto e a instalação deve ser concluída. </p> <p> Na próxima etapa, você conectará o controlador a uma rede sem fio. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Conecte o controlador ao Wi-Fi </h3> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (3 imagens) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Expandir <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Expandir <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> Para configurar a conectividade Wi-Fi, usamos o aplicativo Meross. Está disponível para <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> e <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . Esse processo quase sempre consiste em abrir o aplicativo, identificar seu produto, conectar o aplicativo ao seu Wi-Fi, abrir a tela Configurações e permitir que o controlador acesse sua rede. </p> <p> Aqui, abra o aplicativo e toque em <strong> Abridor de porta de garagem inteligente </strong> e depois <strong> Começar </strong> . Selecione o fabricante e o modelo do abridor de porta de garagem que você está usando com o controlador. Certifique-se de seguir as instruções específicas para seu aplicativo. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Defina o intervalo de tempo de abertura / fechamento </h3> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (3 imagens) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Expandir <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Expandir <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> Uma coisa que é importante definir antes de testar seu novo controlador é o tempo de abertura da porta da garagem. No aplicativo Meross, você pode selecionar entre 10 segundos e 40 segundos em intervalos de cinco segundos ou pode adicionar uma configuração personalizada para portas que levam um número par de segundos para fechar. </p> <p> Definir o tempo para sua porta é fácil, mas você deve acertar. Um intervalo muito curto deixará a porta parcialmente aberta e uma configuração muito longa pode causar estresse indevido no motor do abridor de porta de garagem. </p> <p> Para definir o intervalo, você precisará de um relógio com ponteiro dos segundos ou cronômetro. Você também pode usar o cronômetro interno do telefone. Prepare o cronômetro e fique perto do botão do controle da porta da garagem. Em seguida, aperte o botão ao mesmo tempo em que pressiona start no cronômetro ou anote a hora no ponteiro dos segundos. </p> <p> Espere até que a porta de sua garagem pare de se mover e registre a hora. Este é o seu intervalo. Transfira essas informações para o aplicativo e a configuração do intervalo estará concluída. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Teste o controlador da porta da garagem </h3> <p> Usando seu aplicativo, abra e feche a porta algumas vezes apenas para ter certeza de que tudo está funcionando. Agora você deve conseguir usar o botão de parede ou o aplicativo para abrir a porta da garagem. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Desfrute do seu controlador inteligente de porta de garagem </h2> <p> Trazer sua tecnologia de casa inteligente para a porta de uma garagem não precisa custar uma fortuna. </p> <p> A instalação de um novo controlador de porta de garagem inteligente fornece a você e sua família mais flexibilidade, segurança e conveniência para sua casa. Também proporciona a tranquilidade de saber que o portão da sua garagem pode ser controlado de quase qualquer lugar. </p>"}