{"title":"Como executar uma inicialização limpa no Windows 10","content":"<p> Você provavelmente tem vários aplicativos de terceiros instalados em seu computador Windows. Não se preocupe, a maioria das pessoas se preocupa. </p> <p> Desde a realização de tarefas básicas, como navegação na web, até a distribuição de linhas de código complexas, as pessoas preferem usar aplicativos alternativos daqueles embutidos no Windows. Embora esses aplicativos facilitem nossas vidas, às vezes eles interferem nas funções do sistema. Isso pode variar de pequenos percalços a erros críticos e BSODs. </p> <p> É aqui que a inicialização limpa entra em cena. </p> <h2 id=\"what-is-a-windows-clean-boot-anyway\"> Afinal, o que é uma inicialização limpa do Windows? </h2> <p> Uma inicialização limpa do Windows 10 permite que os usuários excluam aplicativos de terceiros como a causa de um erro. Isso é feito simplesmente inicializando o dispositivo com todos os aplicativos de terceiros desabilitados. E embora o nome pareça ser um recurso integrado do Windows, não é. Você tem que limpar manualmente o boot do seu computador. </p> <p> Os benefícios de uma inicialização limpa não se limitam apenas ao diagnóstico de erros. Sabe-se que ajuda quando <a href=\"https://www.makeuseof.com/tag/fix-windows-update-error-0x80070057/\" target=\"_blank\" rel=\"nofollow noopener\"> As atualizações do Windows não são instaladas corretamente </a> . Também é especialmente útil quando seu sistema operacional parece lento e você deseja verificar o que pode estar causando o problema. </p> <p> </p> <p> </p> <h2 id=\"how-to-clean-boot-and-fix-errors\"> Como limpar a inicialização e corrigir erros </h2> <p> A inicialização limpa é um processo relativamente simples, uma vez que os usuários tentam algumas vezes. </p> <p> Antes de listar as etapas, os usuários devem saber que algumas ações requerem privilégios de administrador. Seu computador também pode não funcionar da maneira que você está acostumado, mas não há necessidade de se preocupar com isso. Isso acontece porque às vezes os usuários nem estão cientes de que algumas tarefas servis estão sendo realizadas por software de terceiros. </p> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-128.png\" loading=\"lazy\"> </p> <p> Aqui estão as etapas sobre como limpar a inicialização do Windows 10: </p> <ol> <li> Na barra de pesquisa do menu Iniciar, digite <strong> sysconfig </strong> e clique em <strong> Configuração do sistema </strong> . </li> <li> No <strong> Configuração do sistema </strong> janela, vá para o <strong> Serviços </strong> aba. </li> <li> Verifica a <strong> Ocultar todos os serviços Microsoft </strong> caixa. </li> <li> Verifique todos os serviços da lista e clique em <strong> Desativar tudo </strong> localizado no canto inferior direito, salve e saia. </li> <li> Agora, abra o <strong> Gerenciador de tarefas </strong> . Você pode fazer isso clicando com o botão direito na barra de tarefas e selecionando <strong> Gerenciador de tarefas </strong> ou usando <strong> Ctrl + Alt + Delete </strong> . </li> <li> No <strong> Gerenciador de tarefas </strong> janela, navegue até o <strong> Comece </strong> aba. </li> <li> Selecione todos os serviços um por um e clique <strong> Desabilitar </strong> . </li> <li> Saída <strong> Gerenciador de tarefas </strong> e <strong> Reiniciar </strong> seu computador. </li> </ol> <p> <img alt=\"Startup tab in the task manager\" src=\"images/startup-tab-task-manager-383.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"fixing-errors-with-clean-boot\"> Corrigindo erros com inicialização limpa </h2> <p> Depois de seguir as etapas listadas acima, seu <a href=\"https://www.makeuseof.com/tag/clean-computer-original-state-reinstalling-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> O PC será inicializado em um estado limpo. </a> A primeira coisa que os usuários devem fazer é esperar e verificar se o mesmo erro aparece novamente. Às vezes, a origem do erro pode ser os arquivos de sistema do Windows; nesse caso, o erro aparecerá, mas pode demorar mais do que durante uma inicialização normal. </p> <p> Se o erro não estiver aparecendo, é hora de restringir os suspeitos. Esta é uma tarefa um tanto tediosa, mas, infelizmente, também a melhor maneira de fazê-la. Para restringir a lista, faça o seguinte: </p> <ol> <li> Enquanto estiver em um estado de inicialização limpa, abra <strong> Configuração do sistema </strong> . </li> <li> Debaixo de <strong> Serviços </strong> guia, selecione a metade superior da lista e clique em <strong> Habilitar </strong> . Certifique-se de que o <strong> Ocultar todos os serviços Microsoft </strong> caixa está marcada. </li> <li> Agora abra <strong> Gerenciador de tarefas </strong> e vá para o <strong> Comece </strong> aba. </li> <li> Da mesma forma, habilite a metade superior dos serviços e reinicie o computador. </li> </ol> <p> Após a reinicialização, se o erro não aparecer, você pode descartar o software e serviços selecionados da lista de culpados. Você terá que repetir essas etapas até encontrar o programa ou serviço responsável e desinstalá-lo. </p> <p> </p> <h2 id=\"clean-boot-windows-10-to-isolate-errors\"> Limpe a inicialização do Windows 10 para isolar erros </h2> <p> Agora é hora de reiniciar o Windows 10 como padrão. Apenas abra <strong> Configuração do sistema </strong> e <strong> Gerenciador de tarefas </strong> e habilitar todos os serviços e programas. É recomendado que os usuários executem uma inicialização limpa antes de recorrer a correções mais avançadas quando o Windows travar ou exibir um BSOD. </p>"}