{"title":"Como criar ou editar um padrão no Adobe Illustrator","content":"<p> Crie um padrão no Adobe Illustrator e você pode aplicá-lo rapidamente a formas, traços e até mesmo texto. Você pode fazer algo simples, como um padrão de pontos, ou fazer algo mais complexo. Você pode até usar uma parte de um gráfico vetorial existente e transformá-lo em um padrão também. </p> <p> Os padrões são ótimos para fundos, texturas e muito mais. Veja como usar as ferramentas de padrão do Illustrator e como criar e editar seus próprios padrões. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Usando os padrões padrão no Adobe Illustrator </h2> <p> O Illustrator vem com vários padrões integrados a ele. Além de serem úteis por si só, eles também são uma boa maneira de ver como os padrões funcionam. Esses padrões também darão uma ideia sobre como usar seus próprios padrões depois de criá-los. </p> <p> </p> <p> Você pode encontrar padrões na janela Amostras. Se ainda não estiver aberto, vá para <strong> Janela&gt; Amostras </strong> no menu superior. Além das cores sólidas, pode já haver alguns padrões na janela Amostras - mas esses não são os únicos padrões que o Illustrator possui. </p> <p> Clique no <strong> Biblioteca de amostra </strong> ícone no canto inferior esquerdo da janela Swatch. Pairar sobre <strong> Padrão </strong> e, em seguida, escolha uma das bibliotecas de amostras de padrões. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Agora você pode aplicar essas amostras como faria com cores sólidas. Aqui, você pode ver os padrões do <strong> Nature_Foliage </strong> biblioteca aplicada como preenchimentos e traços, bem como para texto. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> Como fazer um padrão repetitivo básico no Illustrator </h2> <p> Você pode transformar qualquer vetor em um padrão, seja algo que você já projetou ou algo que você cria com essa intenção específica em mente. Você pode fazer isso com um gráfico vetorial inteiro, uma única camada ou qualquer coisa intermediária. </p> <p> Tudo que você precisa fazer é selecionar o que deseja transformar em um padrão e, em seguida, arrastá-lo para a janela Amostras. Por exemplo, você pode arrastar este olho de gato para suas amostras. Isso criaria uma amostra de padrão, que você poderia usar para preencher um retângulo ou qualquer outra forma. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> Alternativamente, você pode fazer a mesma coisa com o vetor inteiro. Em qualquer caso, o Illustrator fará um padrão com tudo o que você arrastar para a janela Amostras. Você pode simplesmente aplicar a amostra como faria com qualquer amostra de cor normal. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Se você clicar duas vezes em sua amostra de padrão na janela Amostras, ela abrirá o <strong> Opções de padrão </strong> janela. Você também pode abrir isso diretamente de <strong> Windows&gt; Opções de padrão </strong> no menu superior. </p> <p> Aqui, você pode editar ainda mais seu padrão, incluindo como ele se repete e o tamanho das lacunas entre cada iteração de sua imagem. Você também edita o design do seu padrão diretamente aqui. A versão da imagem que não está escurecida pode ser editada normalmente. Você pode alterar cores, mover camadas e assim por diante. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> Existem várias coisas que você pode fazer com a janela Opções de padrão. Você pode, por exemplo, repetir sua imagem em um layout de tijolo escalonado e reduzir a lacuna entre cada parte do padrão. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> Traga as partes do seu padrão suficientemente próximas umas das outras e você pode fazer com que elas se sobreponham. Fazendo isso, você pode criar um tipo de padrão lado a lado como o mostrado abaixo. Experimente todas as diferentes configurações de sobreposição em Opções de padrão para encontrar algo que funcione para você. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> Como criar um padrão uniforme no Adobe Illustrator </h2> <p> Se você deseja criar um padrão geométrico uniforme, você precisa ter certeza de que há simetria em seu design. Por exemplo, uma linha que começa 10px acima no lado esquerdo do seu padrão tem que terminar 10px acima no lado direito. Quando ele se repetir, esses pontos precisarão ser somados. </p> <p> Para fazer isso, crie um novo documento com dimensões quadradas. Habilite a sobreposição da grade pressionando <strong> Ctrl + &quot; </strong> ( <strong> Cmd + &quot; </strong> no Mac). Guias inteligentes também são úteis - habilite-os com <strong> Ctrl + U </strong> ( <strong> Cmd + U </strong> no Mac). Se suas réguas não estiverem visíveis, pressione <strong> Ctrl + R </strong> ( <strong> Cmd + R </strong> no Mac) para ativá-los. </p> <p> Você também pode encontrar essas configurações em <strong> Visualizar </strong> no menu superior, mas recomendamos usar <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Teclas de atalho do Illustrator </a> onde você pode economizar tempo. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Esquematize seu projeto na praça. Todas as partes que ultrapassarem as bordas precisarão ser alinhadas do outro lado. O <strong> Alinhar </strong> ferramenta ( <strong> Janela&gt; Alinhar </strong> ) pode ajudá-lo a alinhar as coisas de maneira adequada. Clique e arraste a partir das réguas para criar seus próprios guias onde precisar. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> É importante ter uma cor de fundo também, mesmo que seja branco. Certifique-se de que ele se ajuste perfeitamente às bordas da prancheta, pois você precisa dele para aparar o material supérfluo. </p> <p> Selecione tudo com <strong> Ctrl + A </strong> ( <strong> Cmd + A </strong> no Mac) e pressione <strong> Shift + M </strong> para ativar o <strong> Construtor de formas </strong> ferramenta. Isso também pode ser encontrado na caixa de ferramentas. Calma <strong> Alt </strong> ( <strong> Opção </strong> no Mac). Isso coloca o <strong> Construtor de formas </strong> ferramenta no modo de subtração. </p> <p> Conforme você passa o mouse sobre partes do seu design com esta ferramenta, você deve vê-las mudar ligeiramente de cor. Clique nas áreas que você não deseja e o Illustrator removerá essas partes, deixando apenas as partes que se sobrepõem ao quadrado do fundo. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> Feito isso, selecione tudo e arraste-o para suas amostras para transformá-lo em um padrão. Para usar seu padrão em um novo documento, você pode salvá-lo em uma biblioteca de amostras ou usar a Adobe Cloud Library. </p> <p> Como alternativa, você também pode simplesmente copiá-lo desta janela Swatch e colá-lo em outra janela Swatch em um documento diferente. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Agora você pode aplicar esse padrão como faria com qualquer outro. Se você fez certo, tudo deve estar alinhado sem lacunas. Faça ajustes em seu documento padrão, se necessário. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> Quando você deve usar padrões no Adobe Illustrator? </h2> <p> O uso mais óbvio para padrões é criar blocos repetíveis para fundos, mas você pode usá-los para preencher formas e dar textura também. Texto preenchido com padrões é outro bom uso e pode fazer sua tipografia realmente se destacar. </p> <p> Se quiser, você pode até criar seus próprios padrões manualmente, copiando e colando a mesma imagem repetidamente. Pode haver ocasiões em que você queira fazer isso, mas na maioria das vezes, a capacidade do Illustrator de automatizar a criação de padrões será o caminho a percorrer. </p> <p> É apenas uma das muitas maneiras pelas quais o Illustrator pode tornar sua vida mais fácil, dando a você mais tempo para trabalhar em seus designs. </p>"}