{"title":"Como fazer seu próprio jogo de tabuleiro no simulador de mesa","content":"<p> Já pensou em criar um jogo para jogar com seus amigos no Tabletop Simulator (TTS)? Ou talvez você seja um desenvolvedor de jogos de mesa em busca de protótipos de jogos e testá-los online. </p> <p> Nunca houve melhor altura para tirar partido do versátil ambiente de jogo da TTS. Hoje, vamos ensinar a você como fazer exatamente isso. </p> <h2 id=\"what-is-tabletop-simulator\"> O que é o Tabletop Simulator? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Para quem não sabe, o Tabletop Simulator (TTS) oferece um ambiente 3D para jogos de mesa, tanto localmente quanto online. Tornou-se uma ótima maneira de <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> jogar jogos de tabuleiro online com amigos </a> . </p> <p> Os jogos jogáveis ​​no TTS incluem tudo, desde pôquer, damas, Dungeons &amp; Dragons, minigolfe e até os jogos de tabuleiro mais recentes. Qualquer jogo que você queira jogar normalmente está disponível como DLC ou no workshop da comunidade. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> Por que usar o Tabletop Simulator? </h2> <p> Se você já tentou criar um jogo de mesa físico, sabe como pode ser demorado, não apenas para construir elementos do jogo, mas também para modificá-los ou substituí-los quando decidir ajustar ou revisar o jogo. </p> <p> No TTS, tudo, desde a cor ao peso de um objeto, pode ser alterado com o clique de um mouse, tornando o processo de revisão suave e indolor. </p> <p> Além disso, é fácil transmitir seu jogo ao vivo e exibi-lo em mídias sociais e plataformas de streaming. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> O que você precisa para começar </h2> <p> Antes de começar, você precisará do seguinte: </p> <ul> <li> Uma conta de usuário Steam </li> <li> Simulador de mesa instalado em seu PC </li> <li> Imagens JPG de seus designs de placa e cartão </li> </ul> <p> <strong> Download: </strong> Simulador de mesa ligado <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> Vapor </a> ($ 19,99) </p> <p> A melhor maneira de projetar elementos de jogo é ilustrar software ou digitalizar imagens de cartas físicas que você já fez. Apenas certifique-se de que eles tenham extensões JPG e sejam salvos individualmente. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Criação de tabuleiros e tapetes de jogador </h2> <p> Ao projetar suas placas e outros objetos 2D, certifique-se de que a resolução seja alta o suficiente para que você possa dimensioná-la corretamente sem perder a qualidade. O TTS o dimensionará automaticamente quando você importá-lo e você poderá redimensioná-lo exatamente como desejar. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Criando cartões </h2> <p> As cartas no TTS têm três aspectos: a face da carta, o verso da carta e a carta oculta (como a carta parecerá para os outros na mão de um jogador). Você precisará ter designs para cada um deles, embora tenha a opção de simplesmente transformar o cartão oculto no verso do cartão. </p> <h3 id=\"create-and-arrange-card-faces\"> Criar e organizar faces de cartão </h3> <p> Em vez de importar cada cartão um por um, é melhor importar todos ou a maioria dos seus cartões como um único baralho. </p> <p> Para criar um baralho, copie e cole cada desenho em uma folha de cartão 7x10. Usar um modelo como o abaixo o ajudará a começar. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> O modelo delineia slots para cada carta em seu baralho, permitindo que você importe até 69 cartas por vez. Se você não precisa de tantos, pode deixar os slots sem uso e, se tiver mais, pode combinar baralhos ou cartas duplicadas após a importação. </p> <p> No entanto, você não precisa usar este modelo. Uma folha de cartão pode, de fato, ter qualquer tamanho, e o TTS a dividirá automaticamente em uma grade 7x10. </p> <p> Para sua conveniência, o modelo acima e um modelo de cartão quadrado estão disponíveis em seu diretório de arquivo local TTS. </p> <p> Se você não tiver certeza de onde seus arquivos locais estão, você pode encontrá-los por meio de sua biblioteca Steam abrindo o <strong> Propriedades </strong> menu para TTS. Selecione os <strong> Ficheiros locais </strong> guia e clique <strong> Navegar </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Verso de cartão </h3> <p> Se você deseja apenas um design para todo o deck, então tudo o que você precisa é de uma única imagem JPG do design; nenhuma folha de cartão será necessária. </p> <p> Se o seu baralho vai ter várias costas exclusivas, você precisará criar uma folha de cartão adicional com designs de verso correspondentes aos designs de faces em sua primeira folha de cartão. Para o desenho da face na ranhura um, coloque a parte traseira designada na ranhura um da folha traseira. Para a face dois, coloque-a de volta no slot dois e assim por diante. </p> <h3 id=\"hidden-cards\"> Cartas escondidas </h3> <p> No slot 70 da folha de cartas, rotulado &quot;Carta Oculta para Outros Jogadores&quot; no modelo, coloque qualquer desenho que você deseja que fique visível para os oponentes quando as cartas deste baralho estiverem na mão de um jogador. Tradicionalmente, é preto ou branco sólido ou apresenta o design da parte de trás do deck. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Importando Elementos </h2> <p> Agora que você criou suas placas e decks, está pronto para começar a importar. </p> <p> Antes de hospedar um servidor com seu jogo, é útil iniciar um jogo para um único jogador e importar os elementos antecipadamente. Você pode então salvar a configuração e estar pronto para começar imediatamente quando os jogadores chegarem. </p> <p> Inicie o TTS e clique em <strong> Crio </strong> e, em seguida, selecione <strong> Singleplayer </strong> para criar o ambiente. Exclua todos os elementos gerados pelo TTS e selecione a mesa em que deseja que seu jogo seja jogado. </p> <p> Com o ambiente pronto, clique no <strong> Objetos </strong> botão no menu superior e, em seguida, selecione o <strong> Personalizado </strong> categoria. </p> <h3 id=\"boards-and-player-mats\"> Tabuleiros e tapetes de jogador </h3> <p> Selecione <strong> Borda </strong> de <strong> Personalizado </strong> menu e clique em qualquer lugar da mesa em que deseja que o quadro apareça. Clique com o botão direito em qualquer lugar para abrir a caixa de diálogo de importação de cartão. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Navegue até a imagem do tabuleiro e o TTS perguntará se você deseja fazer o upload para sua conta Steam Cloud ou manter um arquivo local. Carregue os arquivos para a nuvem se você planeja jogar seu jogo online ou em um dispositivo diferente. </p> <p> Você pode opcionalmente carregar suas imagens em outro host, como Dropbox, Photobucket ou Imgur, e colar o URL aqui. Hosts externos são menos confiáveis, entretanto, e não recomendados. </p> <p> Quando você faz o upload para sua nuvem Steam, o TTS pede que você dê um nome de arquivo. Assim que o upload for concluído, clique em <strong> Importar </strong> . </p> <p> Com a placa importada, agora você pode reduzi-la ou ampliá-la com o <strong> - </strong> e <strong> + </strong> teclas do seu teclado. Para travá-lo no lugar de modo que não seja acidentalmente movido durante o jogo, clique com o botão direito do mouse no tabuleiro e em <strong> Alterna </strong> , clique <strong> Trancar </strong> . </p> <h3 id=\"card-decks\"> Baralhos de cartas </h3> <p> No <strong> Objeto Personalizado </strong> menu, clique <strong> Área coberta </strong> . Clique em qualquer lugar da mesa em que deseja que o baralho apareça e, a seguir, clique com o botão direito para iniciar a importação. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Ajuste as configurações da seguinte forma: </p> <ul> <li> <strong> Modelo: </strong> Altere isso se você tiver uma forma específica em mente que não seja um cartão retangular de canto arredondado regular. </li> <li> <strong> Cara: </strong> Clique no <strong> Procurar arquivos locais </strong> botão e encontre sua folha de cartão de rosto. Mais uma vez, recomendamos a opção Steam Cloud em vez de arquivos locais ou hosts externos. </li> <li> <strong> Costas exclusivas: </strong> Marque esta opção se o seu deck tiver vários designs de verso e, em seguida, carregue sua folha de cartão no <strong> Voltar </strong> caixa. Se você estiver usando um único design para todo o deck, basta fazer o upload do design do verso. </li> <li> <strong> Largura e altura: </strong> Ajuste se você usou uma proporção diferente do cartão retangular padrão, 10x7. </li> <li> <strong> Número: </strong> Certifique-se de que corresponde ao número de cartões que você está importando. </li> <li> <strong> Lateralmente: </strong> Isso muda a orientação para o <strong> Alt Zoom </strong> função em TTS. Deixe-o desmarcado, a menos que você queira que o cartão apareça de lado. </li> <li> <strong> As costas estão escondidas: </strong> Marque esta opção se quiser que a visão oculta de seus cartões seja simplesmente o verso deles. </li> </ul> <p> Quando suas configurações estiverem corretas, clique em <strong> Importar </strong> . Seu deck aparecerá na mesa e você poderá começar a embaralhar e distribuir. </p> <p> Se você quiser que seus cartões tenham nomes para ajudar na classificação, clique com o botão direito em um único cartão e clique em <strong> Nome </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Importando outros elementos do jogo </h2> <p> A importação de outros objetos 2D é semelhante ao processo de importação de placas. Não se esqueça de que o TTS tem muitos elementos de jogo comuns, como dados e estatuetas, prontos para uso no <strong> Objetos </strong> cardápio. </p> <p> Se você tiver elementos 3D personalizados que deseja usar, siga <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> Guia do TTS para importar modelos 3D </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Salvando um jogo completo </h2> <p> Depois de organizar os componentes em um estado de configuração inicial, clique no <strong> Jogos </strong> botão no menu superior. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Selecione <strong> Salvar e carregar </strong> e clique no <strong> Salvar jogo </strong> botão. Dê um nome e clique <strong> Salve  </strong> . Agora, sempre que você hospedar jogos, poderá recarregá-lo com a configuração perfeita acessando o <strong> Salvar e carregar </strong> cardápio. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Aproveitando ao máximo os jogos de mesa personalizados </h2> <p> Projetar e jogar jogos personalizados é simples no Tabletop Simulator, uma vez que você saiba como fazê-lo. Convide seus amigos ou procure playtesters prontos e dispostos em <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> a comunidade TTS </a> . Agora, você pode mostrar seu jogo personalizado para outras pessoas! </p>"}