{"title":"Como alterar sua foto de perfil do Netflix","content":"<p> Cada um dos seus perfis Netflix pode ser representado por uma imagem diferente. Se você nunca mudou sua foto de perfil do Netflix, por que não experimenta agora? </p> <p> Neste artigo, mostramos como você pode escolher uma imagem de seu programa favorito. Também mostramos como escolher imagens de perfil ocultas que estavam disponíveis no passado, mas que a Netflix removeu da exibição pública. </p> <h2 id=\"how-to-set-a-netflix-profile-picture\"> Como definir uma imagem de perfil do Netflix </h2> <p> O processo de escolha de uma imagem de perfil do Netflix é semelhante em todos os dispositivos, com pequenas diferenças. Abordaremos como fazer isso no desktop e em uma smart TV. </p> <h3 id=\"how-to-change-your-netflix-profile-picture-desktop\"> Como alterar sua imagem de perfil Netflix (área de trabalho) </h3> <p> <img alt=\"netflix choose profile icon desktop\" src=\"images/netflix-choose-profile-icon-desktop-266.png\" loading=\"lazy\"> </p> <ol> <li> Logar em <a href=\"https://www.netflix.com\" target=\"_blank\" rel=\"nofollow noopener\"> Netflix.com </a> . </li> <li> Passe o mouse sobre o seu <strong> ícone de perfil </strong> no canto superior direito e clique em <strong> Gerenciar Perfis </strong> . </li> <li> Clique no <strong> ícone de lápis </strong> no perfil que você deseja editar. </li> <li> Mais uma vez, na foto do seu perfil, clique no botão <strong> ícone de lápis </strong> . </li> <li> Clique em uma foto de perfil da lista para escolhê-la. </li> <li> Você será perguntado se deseja alterar sua foto de perfil. Clique <strong> Vamos fazer isso </strong> . </li> <li> Clique <strong> Salve  </strong> . </li> </ol> <h3 id=\"how-to-change-your-netflix-profile-picture-smart-tv\"> Como alterar sua imagem de perfil do Netflix (Smart TV) </h3> <ol> <li> Vá para a tela inicial do Netflix. </li> <li> aperte o <strong> botão esquerdo </strong> para abrir o menu. </li> <li> aperte o <strong> botão para cima </strong> até que o nome do seu perfil seja destacado e pressione o botão <strong> botão de confirmação </strong> . </li> <li> Use os botões de seta para destacar o perfil que deseja editar. Em seguida, pressione o <strong> botão para baixo </strong> para destacar o <strong> ícone de lápis </strong> e pressione o <strong> botão de confirmação </strong> . </li> <li> Na tela Editar Perfil, pressione o botão <strong> botão para baixo </strong> para realçar <strong> Ícone </strong> , em seguida, pressione o <strong> botão de confirmação </strong> . </li> <li> Usando o <strong> botões de seta </strong> para navegar, selecione uma foto de perfil da lista com o <strong> botão de confirmação </strong> . </li> <li> Você será perguntado se deseja alterar sua foto de perfil. aperte o <strong> botão de confirmação </strong> selecionar <strong> Vamos fazer isso </strong> . </li> </ol> <p> </p> <h2 id=\"how-to-use-hidden-netflix-profile-pictures\"> Como usar imagens de perfil ocultas da Netflix </h2> <p> <img alt=\"netflix manage profiles\" src=\"images/netflix-manage-profiles-358.png\" loading=\"lazy\"> </p> <p> Embora haja uma ampla seleção de fotos de perfil da Netflix para escolher, representando uma variedade de <a href=\"https://www.makeuseof.com/tag/netflix-shows-binge-watch/\" target=\"_blank\" rel=\"nofollow noopener\"> os grandes originais da Netflix </a> , alguns deles são removidos após um determinado período de tempo. </p> <p> Embora você mantenha a foto do perfil se isso acontecer com o seu, você não poderá recuperá-la se alterá-la. </p> <p> Pelo menos, você não poderá usar a interface padrão do Netflix para fazer isso. No entanto, com um pouco de trabalho, você pode ressuscitar imagens de perfil ocultas da Netflix, mesmo que nunca as tenha usado antes. </p> <p> Primeiro, você precisa saber o ID da foto do perfil que deseja. Você só pode obter o ID se você ou alguém que você conhece estiver usando a foto de perfil oculta. Como alternativa, alguém pode ter postado o ID de que você precisa online. </p> <h3 id=\"how-to-find-a-netflix-profile-picture-id\"> Como encontrar um ID de foto de perfil do Netflix </h3> <p> Para obter o ID da foto do perfil para sua foto atual, siga estas instruções no Google Chrome para desktop: </p> <ol> <li> Vou ao <a href=\"https://www.netflix.com/profiles/manage\" target=\"_blank\" rel=\"nofollow noopener\"> Página Gerenciar Perfis </a> . </li> <li> <strong> Clique com o botão direito </strong> na página e clique <strong> Inspecionar </strong> . </li> <li> Aperte <strong> Ctrl + F </strong> para abrir a caixa de pesquisa e pesquisar por <strong> avatarName </strong> . </li> <li> Isso encontrará uma seção de código semelhante a esta: </li> </ol> <pre><code class=\"hljs ruby\">\"avatarName\":\"AVATAR\\x7C2b58f9e0-154c-11e9-b321-0abbc59f77ba\\x7Cen\\x7CGB\\x7C70300800\",\"profileName\":\"Joe\"</code></pre> <p> Esta linha aparecerá para cada perfil Netflix que você tiver. No exemplo acima, sei que o ID do avatar para o perfil &quot;Joe&quot; é &quot;AVATAR \\ x7C2b58f9e0-154c-11e9-b321-0abbc59f77ba \\ x7Cen \\ x7CGB \\ x7C70300800&quot;. </p> <p> Se o seu amigo tem uma imagem de perfil oculta que você deseja, peça a ele para seguir as etapas acima e fornecer o ID do avatar. </p> <h3 id=\"how-to-set-a-hidden-profile-picture\"> Como definir uma imagem de perfil oculta </h3> <p> <img alt=\"netflix edit profile id\" src=\"images/netflix-edit-profile-id-124.png\" loading=\"lazy\"> </p> <p> Agora que você tem o ID da foto do perfil, siga estas etapas no Google Chrome. Primeiro, instale o <a href=\"https://chrome.google.com/webstore/detail/react-developer-tools/fmkadmapgofadopljbjfkapdkoienihi\" target=\"_blank\" rel=\"nofollow noopener\"> Extensão React Developer Tools </a> . Então: </p> <ol> <li> Vou ao <a href=\"https://www.netflix.com/ManageProfiles\" target=\"_blank\" rel=\"nofollow noopener\"> Página Gerenciar Perfis </a> . </li> <li> Clique no <strong> ícone de lápis </strong> no perfil que você deseja editar. </li> <li> Novamente, no ícone do seu perfil, clique no <strong> ícone de lápis </strong> . </li> <li> <strong> Clique com o botão direito </strong> na página e clique <strong> Inspecionar </strong> . </li> <li> Na parte superior das ferramentas do desenvolvedor, clique em <strong> Componentes </strong> . </li> <li> Na guia Componentes, procure a primeira linha de código que diz <strong> LolopiIcon </strong> e clique nele. </li> <li> No painel direito, clique no <strong> flecha </strong> próximo ao <strong> ícone </strong> linha para expandi-lo. </li> <li> Procure o <strong> eu ia </strong> fila. Clique no valor dessa linha e substitua-o pelo ID completo da imagem de perfil desejada. </li> <li> Na página da Netflix, clique na primeira foto do perfil na primeira linha. Embora não se pareça com a imagem desejada, agora você alterou sua identificação nos bastidores. </li> <li> Você será perguntado se deseja alterar sua foto de perfil. Clique <strong> Vamos fazer isso </strong> . Ainda não mostra a imagem certa. </li> <li> Clique <strong> Salve  </strong> . Novamente, não mostrará a imagem certa. </li> <li> Você vai voltar para o <strong> Gerenciar Perfis </strong> página, onde agora você tem a nova foto de perfil oculta. </li> </ol> <p> </p> <h2 id=\"secret-netflix-codes-to-find-movies-and-tv-shows\"> Códigos secretos da Netflix para encontrar filmes e programas de TV </h2> <p> Agora você sabe como alterar sua imagem de perfil, seja a partir da seleção disponível ou desbloquear algumas outras ocultas mais antigas. </p> <p> IDs de foto de perfil não são os únicos códigos secretos que você pode usar no Netflix. Existem também códigos que podem ajudá-lo a navegar por gêneros de nicho e descobrir novos conteúdos. </p>"}