{"title":"Disney + está perto de 100 milhões de assinantes","content":"<p> Nunca subestime a Disney. Embora Disney + tenha sido lançado apenas nos EUA em novembro de 2019, o serviço de streaming agora possui quase 100 milhões de assinantes. É um crescimento que nem a empresa esperava. </p> <h2 id=\"how-many-customers-does-disney-have\"> Quantos clientes Disney + tem? </h2> <p> Conforme anunciado no <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Relatório de ganhos da Disney Q1 2021 </a> , Disney + tem 94,9 milhões de assinantes globalmente, em 2 de janeiro de 2021. </p> <p> Isso significa que o número não leva em consideração os assinantes ganhos com o lançamento bem-sucedido de WandaVision. Não seria injusto presumir que a Disney + agora tem mais de 100 milhões de assinantes. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Os últimos números foram divulgados em dezembro de 2020, quando a Disney anunciou que conquistou 86 milhões de assinantes para seu serviço titular de streaming. O salto desde então provavelmente pode ser atribuído a um forte conteúdo exclusivo, como a segunda temporada de The Mandalorian e o longa-metragem da Pixar Soul. </p> <p> A receita média mensal por assinante caiu de US $ 5,56 há um ano para US $ 4,04 hoje, o que pode ser explicado principalmente pelo custo mais barato do serviço na Índia e na Indonésia. </p> <p> Hulu e ESPN +, serviços de streaming também pertencentes à Disney, também tiveram um forte crescimento. O primeiro cresceu 30% ano a ano para 39,4 milhões de assinantes, enquanto o segundo cresceu 83% ano a ano, para um total de 12,1 milhões de assinantes. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney lançou recentemente um pacote combinando todos os seus serviços de streaming </a> , então está claro que a empresa continua apoiando todos os três. </p> <p> Star também deve ser lançado em muitas regiões em breve, o que proporcionará um grande impulso ao número de filmes e programas de TV que a Disney + oferece. </p>"}