{"title":"DeviantArt adiciona uma barra lateral e grupos ao seu aplicativo móvel","content":"<p> Cada artista visual tem seu próprio processo criativo exclusivo, mas é comum - especialmente na era digital de hoje - que a última etapa desse processo seja compartilhar sua peça finalizada online. </p> <p> Já se foi o tempo em que você precisava encontrar museus que levariam suas pinturas ou fotos para as pessoas as verem. Em vez disso, escolha uma plataforma que mais agrada a você e poste! </p> <p> Fundado em 2000, o DeviantArt é uma das comunidades de arte mais antigas da Internet. DeviantArt lançou seu aplicativo móvel em 2017, e sua atualização mais recente é pequena, mas significativa. </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt for Mobile melhora sua navegação </h2> <p> DeviantArt melhorou a interface do usuário de seu aplicativo móvel, adicionando uma barra lateral muito semelhante à do site DeviantArt. A barra lateral oferece acesso rápido à página inicial, desviantes (artistas) que você segue e grupos. </p> <p> <strong class=\"gallery__section-title\"> Galeria de imagens (2 imagens) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> Expandir <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> Expandir </p> <p> Perto </p> <p> O acesso ao último item da lista é particularmente notável porque antes desta atualização, os grupos DeviantArt estavam disponíveis apenas no site. Os grupos DeviantArt funcionam de forma semelhante a <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> Grupos do Facebook </a> - coleções de usuários que se uniram na plataforma com interesses ou objetivos comuns. </p> <p> Na barra lateral, você pode tocar <strong> Meus Grupos </strong> para ver todos os grupos dos quais você faz parte, ou <strong> Grupos Recomendados </strong> para ver os grupos que o DeviantArt acredita serem adequados para você. Você também pode fixar seus grupos favoritos na parte superior da barra lateral para facilitar o acesso. </p> <p> Se você dirige seu próprio grupo, ele pode aparecer na seção recomendada para outros desviantes que possam estar interessados ​​em ingressar. Se não estiver interessado em um grupo, você pode tocar nos três pontos à direita de seu nome para remover a recomendação. </p> <p> Ao visitar um grupo no aplicativo, você verá seus desvios (envios) e postagens. Os administradores de grupo podem publicar atualizações para seu grupo a partir do feed de postagens. </p> <p> <strong> Download: </strong> DeviantArt para <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> (Livre) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> Onde você compartilha suas criações online? </h2> <p> Se você é um artista, designer ou fotógrafo que está na internet há muito tempo, provavelmente você já esteve no DeviantArt em algum momento. A comunidade não parece estar tão animada quanto no início dos anos 2000, mas o volume de trabalhos enviados explodiu nos últimos anos. </p> <p> Com uma base de usuários tão ativa, deve se tornar de extrema importância para o DeviantArt melhorar seu aplicativo móvel. No momento em que este artigo foi escrito, o aplicativo foi classificado como 2.6 / 5.0 na App Store e 3.2 / 5.0 no Google Play. </p>"}