{"title":"Em breve, você jogará jogos com personagens meta-humanos da Epic","content":"<p> Se você acha que os jogos parecem realistas agora, espere até ver o que a Epic Games está trabalhando com seu Unreal Engine. Se prepare para ficar extremamente surpreso. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games revela novos meta-humanos </h2> <p> Você provavelmente está se perguntando de que terra estamos falando. MetaHuman Creator é o recurso mais recente que a Epic Games adicionou ao Unreal Engine; um ambiente de desenvolvimento de software, que os desenvolvedores de jogos podem usar para criar seus títulos. </p> <p> De acordo com um <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Postagem do blog Unreal Engine </a> anunciando a nova ferramenta de desenvolvimento empolgante: </p> <blockquote> <p> MetaHuman Creator é um aplicativo transmitido em nuvem projetado para levar a criação humana digital em tempo real de semanas ou meses a menos de uma hora, sem comprometer a qualidade. </p> </blockquote> <p> Portanto, é essencialmente uma maneira para o desenvolvedor de jogos criar fac-símiles humanos incrivelmente realistas. Rápido. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> O que o MetaHuman Creator significa para os desenvolvedores? </h2> <p> </p> <p> As implicações que isso tem para o desenvolvimento de software mudam o jogo (trocadilho intencional). Imagine a rapidez com que os desenvolvedores preencherão seus mundos de jogo com NPCs, usando o MetaHuman Creator. Não só isso, mas os humanos digitais também parecem incríveis. </p> <p> Isso também significa, obviamente, que os desenvolvedores podem terminar os títulos mais rapidamente, então você não precisa esperar incontáveis ​​atrasos. O MetaHuman Creator permite que os desenvolvedores construam sua população de NPCs rapidamente, deixando tempo para outros assuntos mais urgentes. </p> <p> Mas por que a necessidade dessa ferramenta? A Epic Games explica: </p> <blockquote> <p> Criar um ser humano digital de alta qualidade é difícil e demorado. Escalar esse esforço para criar muitos humanos digitais diversos com a qualidade exigida por plataformas de última geração e produção virtual de ponta é uma tarefa formidável. </p> </blockquote> <p> Então, como dissemos; a ferramenta economiza tempo e melhora o fluxo de trabalho, permitindo que os desenvolvedores dêem aos consoles de nova geração os jogos que eles merecem. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> Como o MetaHuman Creator afetará os jogos? </h2> <p> Bem, graças ao MetaHuman Creator, os jogos podem ser lançados muito mais rápido, para começar. Com ferramentas poderosas como essa à sua disposição, os desenvolvedores podem aprimorar a mecânica do jogo ou gastar mais tempo consertando bugs antes de lançar um jogo quebrado ... </p> <p> De qualquer forma, amargura à parte, a ferramenta de desenvolvimento da Epic parece algo que também fará os jogos parecerem melhores. Você só precisa olhar para as renderizações para ver como os humanos digitais realmente são de tirar o fôlego. Quando os vemos nos jogos, porém, é quando a verdadeira magia acontecerá. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> Quando veremos MetaHumans nos jogos? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> Isso é difícil de dizer. Atualmente, a Epic atrelou o software Creator para teste de acesso antecipado nos &quot;próximos meses&quot;. Portanto, você não verá nenhum Meta-humano tão cedo. </p> <p> Se você deseja tentar criar seu próprio ser humano digital, deve esperar se quiser usar o Criador MetaHuman do Unreal Engine. Você sempre pode tentar montar um em outro programa, mas certamente não levará menos de uma hora! </p>"}