{"title":"Entre na terceira dimensão: trabalhando com fluxos de trabalho 3D no Adobe After Effects","content":"<p> Se você está procurando melhorar seu fluxo de trabalho do Adobe After Effects, eventualmente precisará começar a lidar com o eixo Z, permitindo manipular a profundidade 3D de um objeto. </p> <p> Isso abre uma gama de novos visuais e estilos para você trabalhar, mas também cria seus próprios conjuntos de limitações e considerações. </p> <p> Neste artigo, vamos cobrir como habilitar e trabalhar com camadas 3D, bem como adicionar e animar câmeras 3D para criar movimentos dinâmicos. Um cenário no qual animamos e movemos texto em um espaço 3D também será examinado. </p> <p> Vamos começar! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> Como habilitar e animar camadas 3D </h2> <p> Dentro de sua composição, você pode alternar suas camadas em sua linha do tempo para habilitá-las como 3D. </p> <p> Este é um processo muito simples. Basta encontrar o <strong> Cubo </strong> ícone para suas camadas em sua linha do tempo e clique na caixa abaixo para habilitar 3D para essa camada. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> Depois de fazer isso, você provavelmente não verá nenhuma mudança imediata. No entanto, se você navegar para seus parâmetros de posição, escala e rotação em sua camada, verá que um terceiro conjunto de números ajustáveis ​​apareceu. </p> <p> Esses novos números agora ditam sua rotação, posição e escala no eixo Z no espaço 3D. Assim como com seus outros parâmetros, eles podem ser quadros-chave para permitir animação e manipulação. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> Como exemplo, vamos criar uma composição e uma camada de texto com algumas palavras. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Feito isso, ative a camada 3D. Observe que se você estiver planejando usar o <strong> Alinhar </strong> ferramenta para garantir que sua camada esteja perfeitamente centralizada, você precisará fazer isso antes de ativar o 3D. Isso ocorre porque o <strong> Alinhar </strong> ferramenta só funciona em camadas 2D. </p> <p> Agora que nossa camada de texto é uma camada 3D, podemos movê-la no espaço 3D ao longo do eixo Z. Portanto, vamos mover o texto &quot;em direção à tela&quot;. </p> <p> Primeiro, definiremos nosso parâmetro do eixo Z. Por padrão, é definido como zero. Vamos definir para <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Agora, navegaremos dois segundos abaixo em nossa linha do tempo e definiremos o valor do eixo Z para <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> Com essa alteração, devemos ver agora o movimento do texto &quot;em direção&quot; à tela. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> O que são câmeras 3D? </h2> <p> Nós animamos com sucesso um objeto no espaço 3D no After Effects. Mas e se você tiver vários objetos e quiser criar uma sensação de que o espectador se aproxima ou se afasta deles? </p> <p> Você poderia simplesmente animar cada elemento individual para se mover em sua direção, mas isso consumiria muito tempo e não seria particularmente eficiente. É aqui que você usaria uma câmera 3D. </p> <p> </p> <p> Se você usa um software 3D como Cinema 4D ou Blender, é provável que já tenha usado câmeras 3D antes. Se você já jogou um jogo de computador, também experimentou uma câmera 3D que move sua visão em um mundo 3D. </p> <p> Tudo isso pode parecer complexo à primeira vista, mas as câmeras 3D funcionam exatamente como uma câmera real. Eles fornecem um campo de visão que pode ser manipulado e movido em um espaço 3D. </p> <p> Vamos trabalhar em um exemplo. </p> <h3 id=\"setting-up-a-3d-camera\"> Configurando uma câmera 3D </h3> <p> Para começar, crie várias camadas de texto 3D e posicione-as sequencialmente no eixo Z. </p> <p> Neste exemplo, uma lacuna de <strong> 3.000 pixels </strong> entre cada camada foi usado. A primeira camada fica em zero, a próxima em 3.000, a próxima em 6.000 e assim por diante. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Agora é hora de criar uma câmera 3D clicando em <strong> Camada </strong> &gt; <strong> Novo </strong> &gt; <strong> Câmera </strong> , na qual você verá uma janela para ajustar as configurações para sua nova camada de câmera. Eles vêm em dois tipos: <strong> Um Nó </strong> e <strong> Dois nós </strong> . </p> <p> O <strong> One-Node </strong> A câmera é projetada para operar e emular uma câmera do mundo real o mais próximo possível, e o ponto de foco é designado manualmente pelo movimento da câmera. </p> <p> UMA <strong> De dois nós </strong> A câmera é projetada para seguir um único ponto de interesse, tornando-a ideal para orbitar ou seguir um objeto em movimento. </p> <p> Neste cenário, o <strong> One-Node </strong> câmera será usada. Você notará uma série de configurações adicionais na janela, como <strong> Ampliação </strong> , <strong> Ângulo de visão </strong> , <strong> Habilitar Profundidade de Campo </strong> , e <strong> Comprimento focal </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Eles se destinam a espelhar as configurações da câmera do mundo real. Se você souber como funcionam, fique à vontade para brincar com eles. Caso contrário, você pode escolher uma série de predefinições no canto superior direito. </p> <p> Vamos selecionar o <strong> 35mm </strong> predefinido por agora. Agora que nossa camada de câmera está configurada e na cena, você não verá muita diferença no início. </p> <h3 id=\"using-3d-camera-navigation\"> Usando a navegação de câmera 3D </h3> <p> Existem dois métodos pelos quais você pode ajustar e animar a visualização da câmera. O mais preciso é inserir diferentes <strong> Posição </strong> valores no <strong> Transformar </strong> configurações para a camada da câmera. Você pode então definir o quadro-chave como faria ao animar qualquer outra camada. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> Conforme você move a câmera, você notará que todos os outros objetos 3D em sua cena se moverão em relação a ela. Observe que a câmera irá <strong> não afeta as camadas 2D </strong> . </p> <p> Portanto, vamos definir nossa câmera para se mover no eixo Z de zero a 9.000 em um intervalo de quatro segundos e definir nosso movimento. </p> <p> Aí está! Se você configurou corretamente, as palavras devem empurrar &quot;na sua direção&quot;, através do &quot;campo de visão e&quot; atrás &quot;do visualizador. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> Outras maneiras de mover a câmera 3D </h3> <p> Se você preferir ser um pouco mais experimental e menos baseado em números com sua câmera, existem outros meios de mover, navegar e ajustar. O <strong> Órbita </strong> , <strong> Frigideira </strong> , e <strong> Dolly </strong> ferramentas na parte superior da barra de ferramentas permitem que você faça isso. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> Usando isso, você pode clicar e arrastar para mover de um lado para o outro ( <strong> Frigideira) </strong> , gire ao redor ( <strong> Órbita </strong> ), e aumentar e diminuir o zoom ( <strong> Dolly </strong> ) Esses controles são menos precisos do que inserir números, mas são ótimos para planejar seus movimentos bruscos de câmera e animações. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> A prática leva à perfeição </h2> <p> Agora você deve ser capaz de criar e animar camadas 3D ao longo do eixo Z e também trabalhar com câmeras 3D para navegar com vários objetos 3D. </p> <p> Se você gosta de trabalhar em um espaço 3D, pode querer explorar as possibilidades mais avançadas que um software 3D mais dedicado, como o Blender, pode oferecer. </p>"}