{"title":"Google lança IA experimental que simula sinestesia","content":"<p> Wassily Kandinsky abandonou sua carreira de advogado para estudar pintura na Academia de Belas Artes de Munique. Ele é considerado um dos fundadores da abstração pura na pintura, e isso pode ser devido à forma intrigante como ele percebia as cores e formas. </p> <p> Esta ferramenta de IA permite que você pegue as orelhas de Kandinsky emprestadas. Agora você pode ouvir o que ele fez enquanto pintou (ou pelo menos, a interpretação do Google do que ele descreveu). </p> <h2 id=\"what-if-you-could-hear-color\"> E se você pudesse ouvir cores? </h2> <p> Em colaboração com o Centre Pompidou em Paris, o Google Arts &amp; Culture lançou um projeto experimental chamado <a href=\"https://artsandculture.google.com/experiment/sgF5ivv105ukhA\" target=\"_blank\" rel=\"nofollow noopener\"> Jogue um Kandinsky </a> . </p> <p> Como o nome sugere, a ferramenta interativa permite que você experimente as pinturas abstratas de Wassily Kandinsky em forma musical. Kandinsky era um pintor russo que tinha uma condição neurológica chamada sinestesia. </p> <p> <img alt=\"A screenshot of the second part of Play a Kandinsky\" src=\"images/play-kandinsky-screenshot-2-986.png\" loading=\"lazy\"> </p> <p> A trilha, composta por Antoine Bertin e NSDOS, foi inspirada na música da época de Kandinsky e gerada no Transformer do Google <a href=\"https://www.makeuseof.com/tag/what-are-neural-networks/\" target=\"_blank\" rel=\"nofollow noopener\"> rede neural </a> . </p> <p> Ao clicar <strong> Experimento de lançamento </strong> , a música toca e a IA pede que você clique em um círculo no meio da tela algumas vezes. Cada vez que você fizer isso, as cores do círculo e do fundo atrás dele mudarão, assim como a música. </p> <p> A sinestesia é uma condição que afeta sua percepção - estimular um sentido desencadeia uma experiência automática e involuntária em outro. Por exemplo, um sinesteta (uma pessoa com sinestesia) pode pensar no número &quot;4&quot; e ver o vermelho, ou provar maçãs ao ouvir a palavra &quot;amigo&quot;. </p> <p> Para Kandinsky, ter sinestesia significava que ele via cores quando ouvia música e ouvia música enquanto pintava. &quot;O som das cores é tão definido que seria difícil encontrar alguém que expressasse amarelo brilhante com notas graves ou lago escuro com agudos&quot;, disse ele certa vez. </p> <p> <img alt=\"Yellow-Red-Blue (1925), by Wassily Kandinsky\" src=\"images/yellow-red-blue-kandinsky-947.png\" loading=\"lazy\"> </p> <p> Em 1925, ele criou uma obra-prima que chamou de Amarelo-Vermelho-Azul (foto acima). Foi uma pintura a óleo que o diferencia dos movimentos artísticos influentes da sua época, nomeadamente o construtivismo e o suprematismo. </p> <p> A terceira parte de Play a Kandinsky permite ouvir a pintura em uma sinfonia clássica de sete movimentos. Seu uso generoso de azul e amarelo em forte contraste entre si seguem o <a href=\"https://www.makeuseof.com/how-to-use-color-theory-elevate-your-creative-projects/\" target=\"_blank\" rel=\"nofollow noopener\"> teoria da cor </a> do poeta alemão Johann Wolfgang von Goethe. </p> <p> O Google atribui cores e formas a Kandinsky da mesma forma que você atribui notas e cordas de um instrumento a um músico. &quot;Um artista extraordinariamente talentoso, ele organizou sons coloridos em sinfonias de cores&quot; <a href=\"https://artsandculture.google.com/story/the-sound-of-colours/0ALymHuhPl1jLg\" target=\"_blank\" rel=\"nofollow noopener\"> história </a> lê. </p> <p> </p> <h2 id=\"there-s-more-to-art-than-meets-the-eye\"> A arte é mais do que aparente </h2> <p> Nunca saberemos exatamente o que Kandinsky ouviu enquanto trabalhava, mas são projetos como este que realmente despertam a criatividade e a introspecção. </p> <p> Talvez haja algum tipo de conexão entre arte e música que a maioria de nós não consegue entender completamente. O experimento do Google faz um bom trabalho ao explorar essa possibilidade. </p> <p> <small> Crédito da imagem: Wassily Kandinsky / <a href=\"https://commons.wikimedia.org/wiki/File:Kandinsky_-_Gelb-Rot-Blau,_1925.jpg\" rel=\"nofollow noopener\" target=\"_blank\"> Wikimedia Commons </a></small> </p>"}