{"title":"HBO Max será lançado na América Latina em junho","content":"<p> HBO Max, o serviço de streaming da WarnerMedia, será lançado na América Latina e no Caribe em junho de 2021. É a primeira vez que o serviço estará disponível fora dos Estados Unidos. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> Onde a HBO Max está lançando na América Latina? </h2> <p> No momento, o HBO Max está disponível apenas nos Estados Unidos. No final de junho de 2021, ele estará disponível em muitos países da América Latina e do Caribe. A notícia foi anunciada em um <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> Comunicado de imprensa da WarnerMedia </a> . </p> <p> Especificamente, esses países são: Anguila, Antígua, Argentina, Aruba, Ilhas Virgens Britânicas, Bahamas, Barbados, Belize, Bolívia, Brasil, Ilhas Cayman, Chile, Colômbia, Costa Rica, Curaçao, Dominica, República Dominicana, Equador, El Salvador , Granada, Guatemala, Guiana, Haiti, Honduras, Jamaica, México, Montserrat, Nicarágua, Panamá, Paraguai, Peru, Saint Kitts e Nevis, Santa Lúcia, São Vicente, Suriname, Trinidad e Tobago, Turks e Caicos, Uruguai e Venezuela. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> O que a HBO Max oferecerá na América Latina? </h2> <p> </p> <p> Os assinantes existentes do HBO GO que pagam diretamente ou por meio de &quot;parceiros qualificados&quot; terão acesso instantâneo ao HBO Max. O HBO GO será então eliminado em todas as regiões. </p> <p> Os detalhes dos preços não foram anunciados, embora sejam prometidos nos próximos meses, junto com informações sobre novos conteúdos e ofertas promocionais. </p> <p> Como faz nos Estados Unidos, a HBO Max oferecerá uma variedade de pacotes de assinatura e dispositivos de suporte como smartphones, tablets e outras plataformas inteligentes. </p> <p> </p> <p> Em um trailer anunciando a notícia, clipes de séries como Game of Thrones and Friends podem ser vistos, junto com filmes como Matrix e Casablanca. No entanto, uma pequena mensagem aparece no final para avisar que &quot;nem todos os títulos [estarão] disponíveis no lançamento&quot;. </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> Quando o HBO Max estará disponível globalmente? </h2> <p> No ano passado, a Warner Bros. anunciou, de maneira polêmica, que planeja lançar toda a sua trama teatral de 2021 para a HBO Max. Causou diretor <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Christopher Nolan marca HBO Max como &quot;o pior serviço de streaming&quot; </a> . </p> <p> No entanto, embora alguns na indústria cinematográfica possam estar reclamando, é uma grande jogada pró-escolha para os consumidores. </p> <p> Dessa forma, os da América Latina e do Caribe provavelmente ficarão entusiasmados com o lançamento da HBO Max, na esperança de que o acordo também se aplique a eles. </p> <p> Quanto ao resto do mundo? Nenhuma data definitiva foi definida, mas a WarnerMedia revelou que os países nórdicos, Espanha, Europa Central e Portugal estão programados para serem atualizados para HBO Max ainda este ano. </p> <p> Johannes Larcher, chefe da HBO Max International, disse: </p> <blockquote> <p> Estamos entusiasmados com o lançamento do HBO Max na América Latina e no Caribe, que é o primeiro passo para levar o serviço direto ao consumidor da WarnerMedia para consumidores fora dos Estados Unidos e em todo o mundo. </p> </blockquote>"}