{"title":"JPG vs. JPEG: Qual é a diferença entre esses formatos de arquivo de imagem?","content":"<p> Nem todos os formatos de arquivo de imagem são iguais. Na verdade, muitos deles foram criados para resolver um problema que um formato já existente não poderia resolver. O JPEG, por exemplo, surgiu porque os tamanhos dos arquivos de imagem estavam consumindo muito espaço de armazenamento. </p> <p> Acredite ou não, as extensões de arquivo JIF, JPEG e JPG referem-se mais ou menos à mesma coisa. Para entender por que o formato de arquivo tem tantos nomes, precisamos desvendar um pouco da história complicada. </p> <h2 id=\"what-is-a-jpeg\"> O que é JPEG? </h2> <p> A sigla JPEG significa Joint Photographic Experts Group - o tipo de arquivo foi nomeado após o subcomitê que ajudou a criar o padrão JPEG Interchange Format (JIF). Foi publicado pela primeira vez em 1992 pela Organização Internacional de Normalização (ISO). </p> <p> JPEGs são imagens ainda rasterizadas de 24 bits, com oito bits em cada canal do modelo de cores RGB. Isso não deixa espaço para um canal alfa, o que significa que, embora JPEGs possam suportar mais de 16 milhões de cores, eles não podem suportar transparência. </p> <p> Quando uma imagem é salva como JPEG, alguns de seus dados são descartados em um processo conhecido como perda <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> compressão de arquivo </a> . Por sua vez, a imagem ocupa 50-75 por cento menos espaço de armazenamento (em comparação com formatos mais antigos como BMP) com pouca ou nenhuma perda perceptível na qualidade da imagem. </p> <p> A compressão JPEG é baseada em uma técnica de compressão de imagem com perdas chamada de transformada discreta de cosseno (DCT), que foi proposta pela primeira vez pelo engenheiro elétrico Nasir Ahmed em 1972. </p> <h3 id=\"what-is-a-jif\"> O que é um JIF? </h3> <p> Você pode pensar em um arquivo JIF como um JPEG em sua forma &quot;mais pura&quot;. No entanto, o formato já não é muito utilizado porque apresentava algumas limitações frustrantes. Por exemplo, as definições de cor e aspecto de pixel de um JIF causaram problemas de compatibilidade entre codificadores e decodificadores (visualizadores). </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> Felizmente, esses problemas foram posteriormente tratados por outros padrões &quot;suplementares&quot; que se basearam no JIF. O primeiro deles foi o JPEG File Interchange Format (JFIF) e, posteriormente, o <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Formato de arquivo de imagem intercambiável </a> (Exif) e perfis de cores ICC. </p> <p> JPEG / JFIF é o formato mais popular atualmente para armazenar e transmitir imagens fotográficas na Internet, enquanto JPEG / Exif é para câmeras digitais e outros dispositivos de captura de imagens. A maioria das pessoas não distingue a diferença entre essas variações e simplesmente se referem a ambas como JPEG. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> O que é JPG2 ou JPF? </h3> <p> Em 2000, o grupo JPEG lançou outro formato de arquivo de imagem chamado JPEG 2000 (suas extensões de arquivo são JPG2 e JPF). Era para ser um sucessor do JPEG, mas estava longe de ser tão popular. Mesmo quando seu método de codificação avançado costumava resultar em imagens de melhor qualidade. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Crédito da imagem: Dake / <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> O formato de arquivo JPEG 2000 fracassou por um punhado de razões. Por um lado, era baseado em um código inteiramente novo e, portanto, não era compatível com o JPEG. Além disso, lidar com arquivos JPEG 2000 exigia mais memória para processar, o que era um pouco problemático naquela época. Afinal, o computador médio da época tinha apenas 64 MB de memória. </p> <p> O JPEG 2000 ressurgiu um pouco agora que o hardware do computador, em geral, melhorou muito nos últimos 20 anos, mas o formato de arquivo ainda é muito subutilizado. O único navegador da Internet que oferece suporte para arquivos JPEG 2000 no momento em que este artigo foi escrito é o Safari. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG x JPG </h3> <p> As primeiras versões do Windows (especificamente os sistemas de arquivos MS-DOS 8.3 e FAT-16) tinham um limite máximo de 3 letras quando se tratava do comprimento das extensões de arquivo. JPEG teve que ser reduzido para JPG para não exceder o limite. Os computadores Mac e Linux nunca tiveram tal coisa e, portanto, os usuários continuariam a salvar imagens como JPEG. </p> <p> </p> <p> Programas populares de edição de imagens que funcionavam em diferentes sistemas operacionais, como Photoshop e <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> Gimp </a> - eventualmente definiria sua extensão de arquivo JPEG padrão para JPG em uma tentativa de minimizar a confusão. </p> <p> E foi assim que acabamos com duas extensões de arquivo para o mesmo formato: JPEG e JPG. Ao escolher como salvar sua imagem, não há diferença entre eles. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG vs. PNG: Qual é o melhor? </h2> <p> </p> <p> O JPEG e o PNG foram lançados na mesma década, com cada formato de arquivo resolvendo um problema de imagem digital diferente que o mundo da tecnologia enfrentava naquela época. Você poderia dizer que é natural que eles sejam constantemente comparados ... e são, até hoje. Entre JPEG e PNG, qual formato de arquivo de imagem reina supremo? </p> <p> Honestamente, a resposta depende do tipo de imagem que você está salvando. </p> <p> JPEGs são mais adequados para fotografias porque utilizam compactação com perdas para manter tamanhos de arquivo razoáveis. As fotografias são imagens tão grandes e detalhadas que os artefatos de compressão (distorções sutis de imagem causadas pela compressão) não são muito perceptíveis nelas. </p> <p> Por outro lado, imagens com pontas nítidas, bordas nítidas e com grandes áreas de uma cor (por exemplo, logotipos vetoriais, pixel art, etc.) não parecem muito corretas quando salvas como JPEG. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Crédito da imagem: Axel Grimard / <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> É aqui que o arquivo Portable Network Graphics (PNG) pode entrar. Desenvolvido pelo PNG Development Group quatro anos após o lançamento do JPEG, o PNG oferece suporte à compactação e transparência de dados sem perdas. Assim, os PNGs são freqüentemente usados ​​se a qualidade da imagem precisar ser mantida e o tamanho do arquivo não for um problema. </p> <p> Uma boa regra prática é manter JPEG para fotografias e salvar PNG para imagens com transparência e imagens não fotográficas. Para obter mais informações sobre os diversos tipos de arquivos (não apenas imagens), consulte nosso guia para <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> saber quando usar qual formato de arquivo. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG e JPG têm o mesmo formato de arquivo </h2> <p> Apesar da confusão que o JPEG causou com suas muitas atualizações e variações, a eventual inundação de imagens digitais na internet em meados dos anos 90 foi, sem dúvida, causada principalmente por seu lançamento. </p> <p> Da próxima vez que você estiver pronto para exportar uma foto de um editor de imagens e receber uma longa lista de formatos disponíveis, lembre-se: JPEG e JPG são a mesma coisa. </p>"}