{"title":"LastPass o restringirá a um tipo de dispositivo, a menos que você pague","content":"<p> LastPass, o gerenciador de senhas popular, está passando por uma grande mudança. Em breve, quem usa o serviço gratuitamente só poderá fazê-lo em computadores ou celulares, mas não em ambos - a menos que paguem. </p> <p> Isso significa que o LastPass não é mais uma escolha atraente como gerenciador de senhas gratuito. Em um mundo onde mudamos constantemente entre computadores e celulares, ter um gerenciador de senhas que funciona apenas para um tipo de dispositivo é inútil. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> O que está mudando no LastPass Free? </h2> <p> Conforme anunciado no <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog LastPass </a> , as alterações estão em andamento para a versão gratuita do gerenciador de senhas. </p> <p> Atualmente, o LastPass Free permite que você use o serviço em todos os seus dispositivos. Se você usa o LastPass em seu computador, tablet ou celular, não importa. Tudo isso é grátis. Isso deve ser alterado em 16 de março de 2021. </p> <p> A partir de então, o LastPass Free incluirá apenas dispositivos ilimitados de um tipo: computadores ou celulares. </p> <p> No LastPass, os computadores são classificados como qualquer desktop ou laptop, enquanto os celulares são telefones celulares, tablets e smartwatches. </p> <p> Ao fazer o login no LastPass pela primeira vez em 16 de março, você precisará definir o tipo de dispositivo ativo. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> Por exemplo, se você escolher computadores como seu tipo de dispositivo, poderá usar o LastPass em seus dispositivos de desktop e laptop. No entanto, se você quiser usar o LastPass em qualquer dispositivo móvel, você precisará atualizar para o LastPass Premium. </p> <p> De certa forma, isso está voltando ao LastPass de antigamente. Poder usar o LastPass gratuitamente em desktops e dispositivos móveis só se tornou disponível em 2015. Antes disso, você tinha que pagar pelo suporte móvel. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> O suporte LastPass também está mudando </h2> <p> O LastPass também está mudando a forma como fornece suporte. A partir de 17 de maio de 2021, o suporte por e-mail estará disponível apenas para clientes Premium e Family. </p> <p> Os usuários gratuitos ficarão presos aos artigos de ajuda disponíveis no site de suporte do LastPass ou podem pedir ajuda na comunidade do LastPass. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> Todos deveriam usar um gerenciador de senhas </a> . Provavelmente, você precisa usá-lo em computadores e dispositivos móveis. A LastPass sabe disso e está apostando na atualização dos usuários para o serviço pago, que atualmente tem 25% de desconto por US $ 27 / ano. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> É hora de mudar o gerenciador de senhas? </h2> <p> Se você usa o LastPass Free, é provável que isso o tenha feito considerar a troca. Nesse caso, existem muitos outros gerenciadores de senhas excelentes que você pode usar em todos os seus dispositivos gratuitamente. </p> <p> Então, novamente, talvez você ache justo pagar uma pequena quantia ao LastPass para apoiar o serviço que ele fornece. </p>"}