{"title":"Mark Zuckerberg do Facebook assumiu o impulso de privacidade da Apple pessoalmente","content":"<p> O CEO do Facebook, Mark Zuckerberg, teria dito aos funcionários do Facebook que, &quot;Precisamos infligir dor&quot; à Apple por tratar tão mal o gigante da mídia social, o <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> Wall Street Journal </a> relatórios. </p> <p> Zuckerberg supostamente fez o comentário em 2018, depois que os executivos-chefes da Apple e do Facebook se confrontaram sobre o escândalo Cambridge Analytica, no qual os dados pessoais de milhões de usuários do Facebook foram acessados ​​sem seu consentimento para publicidade política. </p> <h2 id=\"apple-vs-facebook\"> Apple vs. Facebook </h2> <p> Na época, o CEO da Apple, Tim Cook, foi questionado em uma entrevista sobre como ele responderia se estivesse na mesma situação de Zuckerberg, enfrentando a crise. &quot;Eu não estaria nesta situação&quot;, disse Cook. </p> <p> O Wall Street Journal afirma que, enquanto Zuckerberg comentou que as palavras de Cook foram &quot;extremamente loquazes&quot; e &quot;nada alinhadas com a verdade&quot;, nos bastidores ele foi consideravelmente mais severo em sua avaliação. </p> <p> Desde então, o relacionamento entre as duas empresas de tecnologia não melhorou. A Apple dobrou sua postura voltada para a privacidade, com Cook proclamando a privacidade como um dos <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> as preocupações mais urgentes do mundo </a> . O iOS 14 contém vários recursos relacionados à privacidade, que o Facebook questionou, alegando que eles têm o potencial de prejudicar pequenas empresas. </p> <p> Durante a última chamada trimestral de investidores do Facebook, Zuckerberg rotulou Apple &quot; <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> um dos maiores concorrentes [do Facebook] </a> &quot;como resultado dessas novas medidas de proteção à privacidade.&quot; A Apple pode dizer que está fazendo isso para ajudar as pessoas, mas as ações seguem claramente seus interesses competitivos &quot;, disse Zuckerberg. </p> <p> </p> <p> O Facebook está supostamente preparando um processo antitruste contra a Apple que transformaria o tiroteio entre os dois titãs do Vale do Silício em uma batalha legal total. O relatório do Wall Street Journal observa que, &quot;Os potenciais acordos regulatórios e decisões legais provavelmente afetarão centenas de milhões de telefones de consumidores nos próximos anos.&quot; </p> <p> </p> <h2 id=\"different-approaches\"> Abordagens diferentes </h2> <p> O porta-voz do Facebook, Dani Lever, disse ao Wall Street Journal que &quot;a Apple afirma que isso é sobre privacidade, mas é sobre lucro, e estamos nos juntando a outros para apontar seu comportamento anticompetitivo e de preferência pessoal&quot;. Ela disse que o Facebook está &quot;defendendo deliberadamente a Apple&quot; em nome de pequenas empresas e desenvolvedores que são prejudicados pelo recurso App Privacy da Apple. </p> <p> Embora Lever negue que a batalha entre as duas empresas seja pessoal, ela com certeza vai além de alguns pontos de discórdia entre duas grandes empresas de tecnologia. O modelo de negócios financiado por anúncios no qual o Facebook opera é extremamente diferente do modelo financiado por hardware que impulsiona a Apple. Nenhuma das duas empresas - ou seus líderes - provavelmente recuará em suas crenças básicas sobre como construir o futuro da tecnologia. </p> <p> O fato de o CEO da Apple, Tim Cook, discutir privacidade em termos morais mostra o quão pessoal, em um nível, isso realmente é. </p> <p> <small> Crédito de imagem: Wikipedia / <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Anthony Quintano CC </a></small> </p>"}