{"title":"Mais uma marca não oficial de painel frontal PS5 está em cena","content":"<p> A dbrand, que fabrica skins, telas e capas para uma variedade de dispositivos, juntou-se à isca da Sony e lançou seu próprio painel PS5 não oficial. </p> <h2 id=\"dbrand-releases-darkplates\"> dbrand lança placas negras </h2> <p> Se você está procurando personalizar seu PS5, então dbrand é a mais recente empresa a oferecer faceplates de terceiros não oficiais para o console de nova geração. Eles os estão chamando de placas negras, porque são placas faciais pretas. </p> <p> Você pode verificar os pratos no <a href=\"https://dbrand.com/shop/special-edition/ps5\" target=\"_blank\" rel=\"nofollow noopener\"> loja dbrand </a> , onde você pode comprar as placas frontais pretas foscas por US $ 49,00 (no momento da escrita). </p> <p> Você também pode escolher o que dbrand está chamando de &quot;pele do meio&quot;, que é um adesivo de vinil que cobre o painel central preto de alto brilho do PS5. Isso custa US $ 11,95 a mais e está disponível em uma variedade de cores e designs. </p> <p> <img alt=\"dbrand shell texture detail\" src=\"images/dbrand-shell-texture-detail-544.png\" loading=\"lazy\"> </p> <p> Você também notará que ele se orgulha de sua textura de placa frontal. Isso é semelhante a <a href=\"https://www.makeuseof.com/sony-how-ps5-controller-textured-playstation-symbols/\" target=\"_blank\" rel=\"nofollow noopener\"> os minúsculos símbolos do PlayStation que você encontrará no DualSense </a> , outros acessórios PS5 oficiais e os faceplates originais que vêm anexados ao console quando você o compra. Parecidos, mas são tão impressionantes? </p> <p> </p> <h2 id=\"will-dbrand-last\"> O dbrand durará? </h2> <p> Você sem dúvida viu nosso <a href=\"https://www.makeuseof.com/cmp-shells-ps5-faceplate-colors/\" target=\"_blank\" rel=\"nofollow noopener\"> cobertura faceplategate sobre Shells CMP </a> , o que tornou o retorno triunfante após a proibição da Sony. Alguns podem dizer que seu retorno foi arrogante, já que declarou suas novas placas frontais legalmente intocáveis. Veremos. </p> <p> </p> <p> Isso faz você se perguntar por que dbrand se incomodou. Sony categoricamente <strong> nao fiz </strong> aceite CMP Shells, primeiro porque sua marca anterior era muito semelhante a PlayStation (PlateStation). </p> <p> Então, a Sony questionou porque decidiu que as placas frontais eram parte do design do console e, portanto, copiá-las era uma violação da propriedade intelectual. Cue o bater do martelo de proibição. CMP Shells encerrou a produção, cancelando todos os pedidos antes de ressurgir em sua nova forma. </p> <p> dbrand já está em sua quarta onda de pré-vendas de clientes potencialmente insatisfeitos, então você deve ser rápido se quiser pegar um dos painéis frontais personalizados. Se as placas realmente chegarão à produção é outra questão. A Sony poderia muito bem baixar o martelo novamente. </p> <p> </p> <h2 id=\"should-you-buy-a-dbrand-faceplate\"> Você deve comprar um painel frontal dbrand? </h2> <p> Tal como acontece com a saga CMP Shells, aconselhamos qualquer pessoa interessada em personalizar seus frontais PS5 a ter cuidado. Esses são produtos de terceiros e, portanto, você não tem como confirmar sua qualidade a não ser o que a marca indica. </p> <p> Além disso, dada a insistência da Sony de que a PlateStation (agora CMP Shells) teve que interromper a produção, não será uma surpresa se não discar rapidamente para seus advogados para entrar no caso de dbrand também. </p> <p> Em suma, tenha cuidado se quiser personalizar seus painéis frontais. A CMP Shells reembolsou todos os seus clientes na primeira vez. Mas isso não significa que outra marca o fará. </p> <p> </p> <h2 id=\"do-you-really-need-to-customize-your-ps5\"> Você realmente precisa personalizar seu PS5? </h2> <p> <img alt=\"ps5\" src=\"images/ps5-183.jpg\" loading=\"lazy\"> </p> <p> Se você não estiver satisfeito com a aparência do seu PS5, você sempre pode modificá-lo de outras maneiras (significativamente mais baratas). Você sempre pode adicionar uma capa de vinil ao console se quiser que tenha uma aparência diferente. </p> <p> O PS5 foi lançado apenas em novembro de 2020. Talvez tente jogar alguns jogos nele antes de sentir o desejo irresistível de mudar a aparência estética do console. </p>"}