{"title":"Microsoft lança seu novo aplicativo do Office para iPad","content":"<p> A Microsoft lançou seu aplicativo Office unificado para o tablet da Apple. Com ele, Word, Excel e PowerPoint agora estão disponíveis como um único download no iPhone e iPad no <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> Loja de aplicativos </a> . A Microsoft ainda fornece esses aplicativos para iPad como downloads independentes. </p> <h2 id=\"better-late-than-never\"> Antes tarde do que nunca </h2> <p> &quot;Estamos combinando os aplicativos Word, Excel e PowerPoint que você conhece em um único aplicativo otimizado para iPadOS&quot;, escreveu a Microsoft nas notas de lançamento que acompanham o download. Esta é uma ótima notícia se você usa o Office e deseja trabalhar em trânsito. Para quem procura <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> transformar seu iPad em um substituto de laptop </a> , este é um lançamento crucial. </p> <p> Os aplicativos estão disponíveis gratuitamente, mas a edição e outras funcionalidades avançadas exigem uma assinatura do Office 365. Para aqueles que estão se perguntando, a Microsoft oferece várias opções de assinatura no aplicativo a partir de US $ 6,99 por mês. </p> <p> Se você só precisa de um processador de texto em seu iPad, pode ser uma ideia melhor considerar alternativas em <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> Resumo da MUO dos melhores aplicativos de processamento de texto para o iPad </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> Uma experiência unificada de escritório móvel </h2> <p> Para ser claro, esta é uma atualização do Office para iOS existente, não uma versão totalmente nova. O <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> aplicativo multifuncional do Office estreou no iPhone </a> e Android em fevereiro de 2020. Não está claro o que levou a Microsoft um ano inteiro para adicionar versões otimizadas para iPad do Word, Excel e PowerPoint à mistura, mas antes tarde do que nunca. </p> <p> </p> <p> Até hoje, os aplicativos de produtividade incluídos no pacote forneciam uma experiência inferior no iPad porque costumavam ser executados em modo de janela. Mas com a atualização mais recente disponível, os clientes da Apple podem agora ter a experiência nativa do Office em seu iPhone, iPad ou iPod touch, independentemente do tamanho da tela. </p> <p> </p> <h2 id=\"ipad-specific-features\"> Recursos específicos do iPad </h2> <p> A Microsoft tem adicionado novos recursos otimizados para tablet às ofertas do Office para dispositivos móveis regularmente. Como exemplo, as versões móveis do Word, Excel e PowerPoint recentemente adquiriram suporte para gestos do mouse e trackpad. Os aplicativos também suportam o recurso de multitarefa lado a lado do iOS &#39;Split View. </p> <p> Embora as edições para celular e desktop do Office não tenham todos os mesmos recursos, o novo Office para iOS traz alguns novos recursos. Isso permite que você faça coisas como assinar documentos com seu lápis ou dedo da Apple, criar PDFs rapidamente de seus documentos, converter imagens em texto e tabelas e assim por diante. </p> <p> </p> <p> Além disso, agora você pode inserir facilmente data, forma, imagem e notas em PDFs. Quanto aos usuários avançados, eles agora podem acessar as ações baseadas em imagens do Office (como Criar PPT, Criar PDF e muito mais) por meio do menu Compartilhar multifuncional do iOS. “Além disso, se houver capturas de tela recentes ao abrir o aplicativo Office, elas aparecem como uma sugestão de conversão para PDF ou PPT”, observa a empresa. </p> <p> A Microsoft também fará algumas alterações em seu pacote Office para Mac e Windows. De acordo com o fabricante do Windows, as próximas atualizações do Office para desktop em 2021 terão licenças perpétuas, além de outras melhorias. </p>"}