{"title":"Nintendo confirma próximo showcase direto da Nintendo","content":"<p> A Nintendo divulgou detalhes de quando será sua próxima apresentação Nintendo Direct, e você não terá que esperar muito pelas notícias do criador de Mario. </p> <h2 id=\"nintendo-direct-reveals-forthcoming-presentation-date\"> Nintendo Direct revela a próxima data de apresentação </h2> <p> Quer saber o que a Nintendo planejou para o próximo ano? Nesse caso, você precisará sintonizar a próxima vitrine do Nintendo Direct e ouvi-la. </p> <p> O próximo Nintendo Direct acontecerá no dia 17 de fevereiro, conforme confirmado em um tweet da Nintendo of America. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Sintonize 17/02 às 14h PT para um <a href=\"https://twitter.com/hashtag/NintendoDirect?src=hash&ref_src=twsrc%5Etfw\"> #NintendoDirect </a> transmissão ao vivo com cerca de 50 minutos de informações sobre jogos disponíveis, como Super <a href=\"https://twitter.com/hashtag/SmashBrosUltimate?src=hash&ref_src=twsrc%5Etfw\"> #SmashBrosUltimate </a> e jogos chegando a <a href=\"https://twitter.com/hashtag/NintendoSwitch?src=hash&ref_src=twsrc%5Etfw\"> #NintendoSwitch </a> no primeiro semestre de 2021. <a href=\"https://t.co/fbG3hEtD0Q\"> https://t.co/fbG3hEtD0Q </a> <a href=\"https://t.co/w8J6lbdIkQ\"> pic.twitter.com/w8J6lbdIkQ </a></p> - Nintendo of America (@NintendoAmerica) <a href=\"https://twitter.com/NintendoAmerica/status/1361676737730519042?ref_src=twsrc%5Etfw\"> 16 de fevereiro de 2021 </a></blockquote>  <p> Se você quer as últimas notícias da Nintendo, sintonize no <a href=\"https://www.nintendo.com/nintendo-direct/02-17-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> Página do Nintendo Direct em nintendo.com </a> , a partir das 17:00 ET (14:00 PT, 22:00 GMT). </p> <p> </p> <h2 id=\"what-will-nintendo-reveal-at-nintendo-direct\"> O que a Nintendo revelará no Nintendo Direct? </h2> <p> Geralmente é impossível dizer o que a Nintendo tem na manga para um anúncio. É provável que haja notícias de jogos justas, especialmente com a franquia Zelda se aproximando de seu 35º aniversário. </p> <p> Dado que <a href=\"https://www.makeuseof.com/nintendo-switch-bestselling-console-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> o Switch e o Switch Lite são consoles muito populares nos Estados Unidos </a> , as notícias provavelmente se concentrarão nos consoles atuais e nos títulos disponíveis para eles. </p> <p> Se você está esperando por um anúncio sobre o próximo console do Switch, não deve prender a respiração. A Nintendo manteve-se resolutamente cautelosa sobre o futuro do console Switch e se ele tem um novo no horizonte. </p> <p> </p> <h2 id=\"keep-up-to-date-with-nintendo-news\"> Mantenha-se atualizado com as notícias da Nintendo </h2> <p> <img alt=\"Nintendo Switch Family Membership Header\" src=\"images/nintendo-switch-family-header-378.jpg\" loading=\"lazy\"> </p> <p> O Nintendo Direct é a maneira da Nintendo de dar à sua base de fãs leais as notícias mais atualizadas sobre a marca. Portanto, quer você tenha um Switch, Switch Lite ou até mesmo uma coleção inteira de consoles Nintendo, certifique-se de sintonizar. </p>"}