{"title":"Novo estudo afirma que os usuários do Android são melhores parceiros do que os usuários do iPhone","content":"<p> Há uma batalha sem fim entre os usuários de smartphones iPhone e Android. Mesmo aqueles que não participam da batalha escolheram lados apenas escolhendo seu smartphone. </p> <p> Há uma nova ruga na batalha, como <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> CompareMyMobile </a> fez um estudo recente sobre se os usuários do iPhone ou Android são melhores parceiros de relacionamento. Acontece que os usuários do iPhone tendem a ter hábitos de telefone mais irritantes do que os usuários do Android, levando à conclusão de que os usuários do Android são melhores parceiros. </p> <p> Claro, os dados são mais do que uma simples conclusão, então vamos nos aprofundar um pouco mais e dar uma olhada. </p> <h2 id=\"iphone-and-android-relationship-study\"> Estudo de relacionamento com iPhone e Android </h2> <p> A conclusão geral do estudo é que os usuários do Android são melhores parceiros do que os usuários do iPhone, mas os resultados vão muito mais fundo do que essa conclusão superficial. No total, o estudo pesquisou mais de 2.000 usuários, então oferece um tamanho de amostra razoavelmente grande. </p> <p> Ao analisar os hábitos mais irritantes dos smartphones, o estudo descobriu que os usuários do iPhone tinham 12 por cento mais probabilidade de cometer um crime do que seus colegas com Android. Na verdade, os usuários do iPhone cometeram mais atrocidades no uso do telefone do que os usuários do Android em todas as categorias da pesquisa. </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> Alguns exemplos de ofensas irritantes incluem deixar o parceiro na leitura, usar o telefone durante um filme e até mesmo usar o telefone enquanto dirige (o que não é apenas irritante, mas também extremamente perigoso). Os usuários do iPhone são ainda mais propensos a derrubar e quebrar seus telefones do que os usuários do Android, o que é uma estatística verdadeiramente surpreendente. </p> <p> Alguns outros hábitos irritantes incluem <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> rastejando nos perfis de mídia social de outras pessoas </a> , usando filtros excessivos em fotos, enviando várias mensagens de uma linha (eu sei que faço isso demais) e usando o telefone enquanto conversam. </p> <p> Curiosamente, o estudo também descobriu que os homens eram mais propensos a realizar a maioria dos hábitos irritantes (e em alguns casos completamente inseguros) do que as mulheres. </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> Mas os usuários da Apple obtêm mais datas </h2> <p> De acordo com outro estudo publicado pela CompareMyMobile, os usuários do iPhone são mais propensos a obter datas em aplicativos de namoro online. O estudo, que analisou mais de 50.000 swipes, descobriu que os usuários do iPhone têm 76 por cento mais probabilidade de conseguir um encontro do que alguém com um aparelho Android ao falar por um aplicativo de namoro. </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> Se acreditarmos no primeiro estudo, o relacionamento pode não funcionar devido ao usuário do iPhone se infiltrar em outros perfis de mídia social e enviar mensagens de texto enquanto dirige. Ainda assim, é mais provável que encontrem o próximo parceiro quando o relacionamento anterior não der certo. </p> <p> No final das contas, namorar nunca é fácil. Portanto, faça o possível para evitar que seu telefone se torne o dispositivo que mata uma coisa boa! </p>"}