{"title":"O cofundador da Netflix critica a estratégia de Apple TV + Vídeo","content":"<p> O ex-chefe da Netflix, Marc Randolph, criticou a estratégia de vídeo da Apple, dizendo que a Apple TV + está ficando para trás em relação à concorrência devido às ofertas gratuitas da empresa e à falta de conteúdo atraente. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple não faz streaming &quot;com os dois pés&quot; </h2> <p> Se você perguntar ao ex-CEO e cofundador da Netflix, Marc Randolph, a Apple TV tem sido atormentada por um problema de freeloader que contribuiu para o crescimento anêmico do serviço em comparação com Netflix, Disney + e outros serviços de streaming de sucesso. </p> <p> Falando para <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Yahoo Finance </a> , ele disse que a Apple TV + está desperdiçando energia em promoções e ofertas gratuitas, ao passo que deveria se concentrar em adicionar mais conteúdo de qualidade para aumentar o valor. </p> <blockquote> <p> Se a Apple gastasse um quarto do tempo com conteúdo do que com brindes, ela realmente poderia jogar. Eles não têm desculpa [e] ainda não estão nisso com os dois pés. Eles realmente têm que fazer a coisa empreendedora e caminhar até a beira do penhasco e pular. </p> </blockquote> <p> Pular da beira do penhasco pode ser mais fácil de falar do que fazer, porque a Apple TV + não tem o poder de mercado da Disney e o reconhecimento da marca Netflix. Agora, é tudo sobre <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney + vs. Netflix </a> e qual serviço de streaming oferece a melhor relação custo-benefício para clientes em potencial. </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV + tem a maior taxa de rotatividade </h2> <p> Randolph está se posicionando contra brindes e promoções no mercado de streaming, sugerindo que a Apple TV + ‌ tem a &quot;maior taxa de rotatividade&quot; entre os principais serviços. </p> <blockquote> <p> Você não pode continuar substituindo pessoas. Você tem que dar a eles um motivo para ficar. </p> </blockquote> <p> MoffettNathanson-HarrisX descobriu que 29 por cento das pessoas que se inscreveram por meio de um programa gratuito não planejam se inscrever novamente quando a avaliação gratuita expirar, conforme relatado por <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> Variedade </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> Apple TV grátis + ofertas </h2> <p> A Apple oferece 12 meses de serviço gratuito Apple TV + para todos que adquirirem um novo dispositivo elegível da empresa, como um novo iPhone. Enquanto isso, <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> A Apple estendeu as assinaturas gratuitas de um ano </a> duas vezes para aqueles que se inscreveram em 2019. </p> <p> </p> <p> É um sinal claro que a própria Apple não acredita que o serviço forneça conteúdo suficiente para justificar o preço pedido de US $ 5 / mês. Veja as coisas de outra forma: se o Apple TV + tivesse excedido as projeções internas, a Apple já teria se gabado do número de assinantes. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney + e Netflix oferecem competição séria </h2> <p> Faz apenas 15 meses que a Apple TV + fez sua estreia em novembro de 2019. A Disney + veio logo em seguida. A Apple não revela quantos assinantes pagantes a Apple TV + tem, mas a Disney acaba de ultrapassar 94 milhões de assinantes, superando de longe até suas próprias expectativas. </p> <p> Em comparação, a Netflix contava com 204 milhões de clientes pagantes no final de 2020. A Disney espera poder igualar a Netflix em termos de assinantes em apenas 12 meses. </p> <p> </p> <p> Randolph diz que a Disney + &quot;lutou para chegar a uma posição realmente forte&quot; graças ao conteúdo. “É realmente uma guerra de quem está preparado para fazer o conteúdo”, acrescentou. </p> <blockquote> <p> Estamos vendo as novas regras do jogo se desenvolvendo. Isso não é apenas anunciar, não é apenas promover uma promoção - o que você precisa demonstrar é que possui o conteúdo, o conteúdo, o conteúdo. </p> </blockquote> <p> Na verdade, o jogo é sobre o conteúdo. Por exemplo, conforme descrito em <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> seus planos para 2021 </a> , A Netflix lançará um novo filme original todas as semanas ao longo do ano. Em contraste, a Apple TV + apresenta um punhado de filmes como o drama da segunda guerra mundial estrelado por Tom Hanks, Greyhound (baseado em fatos reais), o drama original Palmer estrelado por Justin Timberlake e On The Rocks de Sofia Coppola, para citar apenas alguns. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> Abordagem Slow Burn da Apple </h2> <p> O que Randolph não reconhece é que Netflix e Disney + tiveram grandes quantidades de conteúdo desde o primeiro dia, enquanto a Apple TV + está construindo sua biblioteca de conteúdo do zero. </p> <p> A Apple obviamente optou por uma abordagem de queima lenta, como evidenciado pela escassez de programas em relação ao Disney + e Netflix. Não importa como você olhe para isso, sua estratégia com o Apple TV + parece exigir atrair as pessoas com ofertas gratuitas na esperança de que o serviço acumule conteúdo de qualidade suficiente para converter clientes gratuitos em assinantes pagantes. </p>"}