{"title":"O Surface Duo obtém uma data de lançamento no Reino Unido e uma queda de preço","content":"<p> O Surface Duo da Microsoft não teve uma recepção de lançamento tão fantástica, mas parece que a empresa deseja fazer melhores primeiras impressões fora dos Estados Unidos. A empresa não está apenas reduzindo o preço do Surface Duo, mas também tem uma data de lançamento confirmada para o mercado do Reino Unido. </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> Preparativos finais da Microsoft para o exterior para o Surface Duo </h2> <p> Essa notícia chega até nós de <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . Se você se lembra, quando o Surface Duo foi lançado, <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> não recebeu boas críticas </a> . Um ponto central era o quão problemático o sistema operacional do Duo era, mas outro era seu preço impressionante de $ 1399,99. </p> <p> A Microsoft tem trabalhado arduamente para consertar os principais problemas que os revisores encontraram, mas seu alto preço ainda permaneceu onde estava. No entanto, a Microsoft está planejando dar ao Surface Duo uma queda significativa de preço para US $ 999,99. </p> <p> Essa queda é provavelmente uma preparação para seu lançamento no exterior, enquanto os críticos de todo o mundo se preparam para quebrar o Surface Duo centímetro a centímetro. Com este preço reduzido, mais as recentes correções do sistema operacional do Surface Duo, a maravilha da tela dupla ainda pode causar uma impressão positiva no exterior. </p> <p> A Microsoft também confirmou quando os fãs do Reino Unido podem experimentar o Surface Duo por si próprios. Se você estiver no Reino Unido, fique de olho nos varejistas de eletrônicos em 18 de fevereiro de 2021. </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> Arranhando a superfície dos planos da Microsoft no exterior </h2> <p> Embora o Surface Duo tenha lutado para causar uma boa impressão nos Estados Unidos, ainda pode haver esperança para ele no exterior. Com todas as correções no sistema operacional do Surface Duo combinadas com essa queda de preço, a grama pode ficar mais verde do outro lado. </p> <p> Se você quiser saber que tipo de patch a Microsoft lançou para o Surface Duo, a empresa lançou recentemente algumas atualizações de estabilidade para corrigir os bugs antes da estreia internacional do Duo. </p> <p> <small> Crédito da imagem: Jack Skeens / <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}