{"title":"O iPhone 13 pode ter uma tela &quot;sempre ligada&quot;","content":"<p> A Apple lançou sua tela &quot;sempre ativa&quot; para o Apple Watch Series 5 em 2019. Alguns anos depois, poderia chegar ao iPhone, de acordo com o repórter Max Weinbach, que compartilhou as informações com o canal do YouTube <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> EverythingApplePro </a> . </p> <p> O relatório afirma que o iPhone 13 - se é assim que a Apple realmente decide chamá-lo - terá permanentemente algumas seções da tela iluminadas para mostrar certos detalhes. </p> <h2 id=\"how-always-on-display-will-work\"> Como a tela &quot;Sempre ligada&quot; funcionará </h2> <p> Esses detalhes podem incluir os ícones do relógio e da bateria. Eles permaneceriam visíveis mesmo quando o iPhone estivesse bloqueado, o que significa que não estava sendo usado ativamente pelo usuário. Notificações, como avisos de novas mensagens, seriam iluminados apenas temporariamente. </p> <p> Esta seria a primeira vez que o iPhone viria com a tecnologia de tela &quot;sempre ligada&quot;. No entanto, não seria de forma alguma a primeira vez que uma tecnologia semelhante chegou a um smartphone. A Nokia introduziu um recurso de tela &quot;sempre ligado&quot; já em 2009. Mais recentemente, ele se tornou um recurso amplamente disponível em vários telefones Android - incluindo modelos fabricados pela Huawei, Motorola, Samsung, Google e outros. </p> <p> A grande e óbvia vantagem de &quot;sempre ligado&quot; é que ele não exige que o usuário desperte ou desbloqueie seu telefone para acessar informações, mesmo que seja algo tão secundário quanto verificar a hora. </p> <p> A desvantagem é que ele consome bateria extra, o que já pode ser algo valioso em smartphones. No entanto, os visores AMOLED podem reduzir o impacto da bateria ativando apenas os pixels do visor que são necessários para mostrar as informações. </p> <p> Em outras palavras, essa exibição &quot;sempre ligada&quot; está sempre ligada em um sentido técnico - embora a maior parte da tela esteja desligada e apenas algumas partes permaneçam iluminadas o tempo todo. Isso significa que o efeito na vida útil da bateria não é tão importante quanto poderia ser. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> O que esperar do iPhone 13 </h2> <p> A próxima geração do iPhone provavelmente chegará em setembro de 2021. De acordo com Weinbach, ele terá o mesmo design geral do chassi da série do iPhone 12, embora haja algumas atualizações internas. </p> <p> Isso incluirá ímãs MagSafe mais fortes, um sistema de câmera aprimorado para tirar imagens da lua e das estrelas, lente de câmera ultra grande em toda a linha do iPhone, vídeo em modo retrato (em vez de apenas imagens estáticas), fundo fosco refinado e A- chip da série. Um relatório anterior afirmou que a Apple poderia <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> introduzir Touch ID no display </a> como alternativa ao Face ID. </p> <p> Dado que ainda falta mais de meio ano, muitos detalhes novos podem surgir antes que a Apple exiba seu próximo iPhone no terceiro trimestre. Mesmo assim, parece que o boato já está começando a entrar em ação. Assista esse espaço! </p>"}