{"title":"O governo dos Estados Unidos deseja saber sobre a precisão das etiquetas de privacidade do aplicativo","content":"<p> Com seus rótulos de privacidade de aplicativos iOS 14 na App Store, a Apple está oferecendo aos usuários uma nova maneira de ganhar mais poder, tendo mais conhecimento sobre os aplicativos que usam - e como esses aplicativos podem estar rastreando-os. </p> <p> Mas parece que também é possível abrir uma lata de vermes para si mesma, já que a Apple agora está sendo pressionada a garantir a precisão desses rótulos, que os desenvolvedores começaram a enviar à Apple em dezembro. </p> <h2 id=\"concerns-over-accuracy\"> Preocupações com a precisão </h2> <p> Conforme observado por <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumores </a> , A Apple recebeu um <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> carta </a> do Comitê de Energia e Comércio da Câmara dos Estados Unidos, pedindo esclarecimentos sobre a precisão fornecida pelo desenvolvedor de seus rótulos de privacidade de aplicativos. </p> <p> Esses rótulos são um recurso ansiosamente esperado em alguns trimestres e temido em outros do iOS 14 que forçará os desenvolvedores a serem mais abertos sobre como seus aplicativos interagem com os dados do usuário. Isso significa que os usuários poderão tomar uma decisão mais informada no que diz respeito às vantagens e desvantagens de usar determinados aplicativos. </p> <p> </p> <p> Em sua carta, o Comitê de Energia e Comércio da Câmara dos Estados Unidos pergunta à Apple sobre relatórios que sugerem que certos rótulos de privacidade de aplicativos podem fornecer aos usuários informações &quot;enganosas e falsas&quot;. Isso é baseado em um relatório, publicado no mês passado, alegando que muitos aplicativos que recebem um atestado de saúde podem não ser tão inocentes quanto sugerem. </p> <p> Um problema potencial com o recurso iOS 14 é que ele depende da honestidade do desenvolvedor para dizer como os dados são coletados, bem como para confirmar se essas informações são precisas. A própria Apple observa que a informação &quot;não foi verificada pela Apple&quot;. </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Solicitando uma resposta da Apple </h2> <p> Embora pareça provável que a maioria dos desenvolvedores jogue limpo e siga o sistema de honra, isso não é algo que pode ser dado como certo. A Apple audita rotineiramente as informações que ela envia. No entanto, o enorme número de aplicativos na App Store torna impossível para a Apple verificar pessoalmente cada uma das listagens. </p> <p> A carta do Comitê de Energia e Comércio dos EUA continua que: </p> <blockquote> <p> “Instamos a Apple a melhorar a validade de seus rótulos de privacidade de aplicativos para garantir que os consumidores recebam informações significativas sobre as práticas de dados de seus aplicativos e que os consumidores não sejam prejudicados por essas práticas potencialmente enganosas”. </p> </blockquote> <p> O comitê pediu à Apple que fornecesse mais detalhes sobre seu processo de auditoria, se os rótulos de privacidade de aplicativos serão corrigidos caso sejam falsos, detalhes sobre o que acontece quando os desenvolvedores fornecem informações imprecisas e muito mais. </p> <p> Eles estão pedindo à Apple que responda com as informações solicitadas até 23 de fevereiro. </p> <p> <small> Crédito da imagem: Jason Dent / <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Unsplash CC </a></small> </p>"}