{"title":"O que é um driver de fone de ouvido e como ele afeta o som?","content":"<p> Os fones de ouvido são tecnologias incríveis. </p> <p> Eles são feitos para pessoas comuns que ouvem música na cama ou em seus deslocamentos e profissionais que precisam de um áudio limpo para editar músicas e vídeos. Existem vários tipos de fones de ouvido exatamente por esse motivo. Esteja você trabalhando ou mixando áudio por horas a fio, há um par de fones de ouvido para você. </p> <p> Dentro desses fones de ouvido estão <strong> motoristas </strong> que variam drasticamente em tamanho e são feitos de forma diferente com base em quem são os fones de ouvido. Esses drivers, é claro, afetam o som que está ecoando em seus ouvidos. </p> <h2 id=\"what-is-a-headphone-driver\"> O que é um driver de fone de ouvido? </h2> <p> <img alt=\"Open Back Headphone Driver\" src=\"images/open-back-headphone-driver-548.jpg\" loading=\"lazy\"> </p> <p> Um driver de fone de ouvido é essencialmente um pequeno alto-falante que converte sinais elétricos em sons que podemos ouvir. Esses drivers podem variar muito em tamanho, dependendo do tipo de fone de ouvido e para que são usados. </p> <p> Por exemplo, os fones de ouvido têm drivers muito pequenos que podem ter até 8 mm, com os drivers maiores tendo cerca de 15 mm de diâmetro. Os fones de ouvido variam um pouco mais drasticamente em tamanho, de 20 mm a 70 mm. </p> <p> Os drivers de fone de ouvido são compostos de três componentes: o <strong> magnético </strong> , <b> bobinas de voz </b> , e as <strong> diafragma </strong> . </p> <ul> <li> O <strong> magnético </strong> cria um campo magnético e geralmente é feito de cobalto ou ferrita. </li> <li> <strong> Bobinas de voz </strong> permitem que correntes elétricas passem por eles, movendo o diafragma para então gerar sons que podemos ouvir. Essas bobinas, geralmente compostas de vários tipos de cobre, ajudam a converter os sinais elétricos em som. </li> <li> O <strong> diafragma </strong> vibra, produzindo ondas sonoras com as correntes elétricas que passam pelas bobinas de voz. </li> </ul> <p> </p> <h2 id=\"types-of-headphone-drivers\"> Tipos de drivers de fone de ouvido </h2> <p> Nem todos os drivers funcionam exatamente da mesma forma, com alguns produzindo melhor áudio do que outros, dependendo dos materiais usados ​​e do processo e técnica de engenharia. </p> <h3 id=\"dynamic-drivers\"> Drivers dinâmicos </h3> <p> <img alt=\"Bose Headphones which use a type of Dynamic Driver\" src=\"images/dynamic-driver-415.jpg\" loading=\"lazy\"> </p> <p> O tipo mais comum de driver de fone de ouvido é o <strong> driver dinâmico </strong> . Esses drivers funcionam conforme explicado acima. Quando o diafragma vibra, ele desloca o ar ao seu redor, criando o som que você está ouvindo. Quanto mais deslocamento de ar, maior será o volume produzido. Este deslocamento de ar também ajuda a criar uma resposta de graves realista. </p> <p> Drivers dinâmicos são ótimos na produção de baixas frequências, que em volumes mais altos, podem resultar em distorção harmônica que não soa muito bem aos nossos ouvidos. Esses drivers não são de todo ruins, pois são baratos de produzir, resultando em fones de ouvido mais baratos para o consumidor, além de serem mais fáceis de alimentar. Nem todos os drivers dinâmicos são criados da mesma forma, pois sua qualidade de som pode variar dependendo de seus invólucros e materiais usados. </p> <h3 id=\"balanced-armature-drivers\"> Drivers de armadura balanceada </h3> <p> <img alt=\"Apple wired earbuds, which use a balanced armature driver\" src=\"images/apple-wired-earbuds-which-use-a-balanced-armature-driver-119.jpg\" loading=\"lazy\"> </p> <p> <strong> Drivers de armadura balanceada </strong> são pequenos e são encontrados principalmente em fones de ouvido. Esses drivers consistem em um braço dentro das bobinas com dois ímãs de cada lado. Isso permite que o braço gire em direção a qualquer um dos ímãs, ficando equilibrado e movendo o diafragma para produzir som. Devido à forma como o driver funciona, ele não desloca o ar como o driver dinâmico, resultando em uma falta de graves. </p> <p> Os drivers de armadura balanceada também não têm aberturas de ar adicionais, o que ajuda a isolar melhor o som. Como acontece com todos os drivers, a qualidade do som pode variar com base em como os fones de ouvido são projetados por dentro e por fora. Alguns fabricantes podem até adicionar um driver dinâmico para criar um som mais rico com melhor resposta de graves. </p> <p> </p> <h3 id=\"planar-magnetic-drivers\"> Drivers Magnéticos Planares </h3> <p> <img alt=\"Open Back Headphones using Planar Magnetic Drivers\" src=\"images/open-back-headphones-using-planar-magnetic-drivers-408.jpg\" loading=\"lazy\"> </p> <p> <strong> Drivers magnéticos planares </strong> são normalmente encontrados em fones de ouvido abertos e geralmente custam mais caro do que os drivers dinâmicos. Em vez de usar bobinas de voz, drivers magnéticos planares tentam vibrar uniformemente o diafragma dos ímãs em ambos os lados para produzir som. Como esses drivers usam ímãs maiores ou múltiplos para vibrar uniformemente o diafragma, esses fones de ouvido tendem a ser um pouco mais pesados. </p> <p> Fones de ouvido abertos também têm mais vazamento de som do que um par normal de fones de ouvido fechados que usam drivers dinâmicos, já que os drivers estão completamente abertos e não há nada cobrindo-os. Isso os torna não a melhor escolha para ouvir música em público; no entanto, eles são fantásticos para uso doméstico por esse motivo. </p> <p> Mais vazamento de som ocorre devido ao maior deslocamento de ar, proporcionando um som mais cheio com excelente resposta de graves, tornando-os perfeitos para uso doméstico. </p> <h3 id=\"electrostatic-drivers\"> Chaves eletrostáticas </h3> <p> <img alt=\"Open Back Headphones That Require an Amplifier\" src=\"images/open-back-headphones-that-require-an-amplifier-271.jpg\" loading=\"lazy\"> </p> <p> <strong> Eletrostática </strong><strong> motoristas </strong> são mais incomuns devido ao seu alto preço e utilizações em nichos e são encontrados principalmente em fones de ouvido com a parte traseira aberta. </p> <p> Esses drivers usam eletricidade estática para ajudar a produzir som. O diafragma é puxado para frente e para trás entre duas placas condutoras com cargas opostas, permitindo uma mudança contínua nos sinais elétricos, produzindo um som sem distorção. Semelhante às chaves magnéticas planas, este design também permite maior deslocamento de ar, deixando o ouvinte com um baixo com melhor som. </p> <p> Devido à forma como os drivers eletrostáticos funcionam, eles requerem sinais de alta tensão, exigindo seu uso com um amplificador. Esses sinais são inatingíveis na maioria dos conectores de fone de ouvido do consumidor, bem como até mesmo em alguns amplificadores profissionais. Para usar fones de ouvido com drivers eletrostáticos, você precisará de um amplificador eletrostático, que é muito caro. </p> <p> </p> <p> Embora os drivers eletrostáticos forneçam um excelente estágio de som com pouca distorção, é melhor usar outro par de fones de ouvido abertos que usam drivers magnéticos planares. Eles proporcionarão uma experiência auditiva semelhante aos drivers eletrostáticos, mas custarão menos e serão mais fáceis de trabalhar. </p> <p> </p> <h2 id=\"which-headphone-driver-should-you-get\"> Qual driver de fone de ouvido você deve obter? </h2> <p> <img alt=\"Razer Gaming Headphones\" src=\"images/razer-gaming-headphones-992.jpg\" loading=\"lazy\"> </p> <p> Os fones de ouvido são feitos para muitos tipos diferentes de pessoas. Se você é um músico que usa fones de ouvido em casa apenas para mixar áudio, talvez você deva escolher um par de fones de ouvido abertos com uma chave magnética plana. </p> <p> Se você é um corredor, comprar um grande par de fones de ouvido abertos pode não ser a melhor escolha para você. É aí que os fones de ouvido com drivers de armadura balanceados pequenos, mas de ótimo som, serão úteis. Há um par de fones de ouvido com som brilhante, feitos especialmente para você. Agora é hora de encontrá-los. </p>"}