{"title":"O que é MTA-STS e como ele protege seus e-mails?","content":"<p> O email é o maior culpado por trás da maioria dos ataques cibernéticos. É um ponto de acesso fácil para malware, adware, spam e phishing e oferece oportunidades infinitas para que os agentes de ameaças obtenham suas informações pessoais. </p> <p> Para mitigar essas ameaças, medidas de segurança rigorosas devem ser implementadas para contas de e-mail individuais e empresariais. </p> <h2 id=\"email-security-and-encryption\"> Segurança e criptografia de e-mail </h2> <p> Apesar da popularidade de outros modos de comunicação, as mensagens de e-mail ainda são a maior forma de dados em trânsito para qualquer indivíduo ou organização. Proteger o conteúdo do seu e-mail é uma necessidade vital. </p> <p> A segurança de e-mail envolve a inspeção e criptografia de todo o tráfego de e-mail de entrada e saída. A criptografia desempenha um papel vital em manter intacta a privacidade do conteúdo do e-mail, garantindo conexões SMTP (Simple Mail Transfer Protocol) seguras. </p> <p> Até recentemente, a criptografia era apenas um requisito opcional para SMTP. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> Como funciona a criptografia de e-mail? </h2> <p> A criptografia de e-mail é um processo de adicionar uma cifra ou pedaço de código ao conteúdo da sua mensagem, tornando-a indecifrável. Ao converter dados de e-mail em código, o conteúdo é protegido contra exposição não autorizada. Simplificando, seu e-mail está embaralhado. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> Como segurança adicional, o processo de criptografia utiliza chaves públicas e privadas, onde as chaves criptografadas são trocadas para bloquear e desbloquear os e-mails codificados. O remetente criptografa o e-mail usando criptografia de chave pública e, posteriormente, o destinatário usa uma chave privada para decifrar a mensagem recebida. </p> <p> A criptografia é aplicada a toda a jornada de um e-mail, do início ao fim. Como prática recomendada, todos os emails de entrada e saída devem ser criptografados - não apenas os que contêm informações confidenciais. Isso evita que os atores da ameaça obtenham qualquer ponto de entrada em seu sistema. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> Antecedentes e problemas com SMTP </h2> <p> Quando o protocolo SMTP surgiu em 1982, a criptografia de e-mail não era uma prática comum e, por padrão, os e-mails eram enviados e recebidos em texto simples. Para introduzir segurança no nível de transporte, o comando STARTTLS foi adicionado no final de 1990, que oferecia a opção de criptografia por meio do <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> Protocolo TLS (Transport Layer Security) </a> . </p> <p> Tão promissor quanto a atualização do TLS parecia, ela deixou duas brechas de segurança intactas: </p> <ol> <li> A opção de criptografia era apenas isso: <strong> opcional </strong> . E-mails não seguros ainda eram comuns, causando um aumento nos ataques cibernéticos. </li> <li> Mesmo com o STARTTLS instalado, não havia como autenticar a identidade do servidor do remetente, pois os servidores SMTP não validam certificados. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> A chegada do MTA-STS </h2> <p> Em 2019, o Google finalmente assumiu a responsabilidade e anunciou a adoção do novo padrão MTA-STS (Mail Transfer Agent / Strict Transport Security) ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ) </p> <p> Isso dá aos provedores de serviço de e-mail a capacidade de impor TLS para proteger conexões SMTP e também oferece a opção de negar a entrega de e-mail a hosts MX que não oferecem TLS com um certificado de servidor confiável. </p> <p> O MTA-STS finalmente cuida de todos os problemas anteriores com SMTP, reforçando a criptografia entre os servidores SMTP em comunicação. Mas como isso realmente funciona? Vamos descobrir! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> Como funciona o MTA-STS? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> O MTA-STS começa a funcionar instruindo um servidor SMTP a se comunicar apenas com outro servidor SMTP em duas condições: </p> <ol> <li> O servidor SMTP <strong> devo </strong> ser criptografado. </li> <li> O nome de domínio no certificado do servidor corresponde ao domínio na política e os certificados estão atualizados. </li> </ol> <p> Usando uma combinação de DNS e HTTPS para publicar uma política, o MTA-STS informa à parte remetente como proceder se um canal de comunicação criptografado não puder ser iniciado. </p> <p> É fácil implementar MTA-STS no lado do destinatário, mas para o remetente, um software de servidor de e-mail de suporte, como <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> deve ser usado. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> Que tipo de ataque o MTA-STS atenua? </h2> <p> As ameaças a seguir serão enfrentadas de frente se o MTA-STS for aplicado às suas comunicações por e-mail: </p> <p> <strong> Ataques man-in-the-middle (MITM): </strong> Este ataque é realizado quando um invasor se intercede no meio da comunicação entre duas partes para roubar ou alterar dados. No caso de um e-mail, isso normalmente significa dois servidores SMTP em comunicação. Ao empregar o MTA-STS, esses ataques podem ser facilmente evitados. </p> <p> <strong> Ataques de downgrade: </strong> Um ator de ameaça força um canal de rede a mudar para um modo de transmissão de dados inseguro. Por exemplo, esse ataque pode redirecionar um visitante do site de uma versão HTTPS de um site para uma versão HTTP. O MTA-STS ajuda a combater esses ataques, evitando qualquer acesso não autorizado. </p> <p> <strong> Ataques de falsificação de DNS: </strong> Esses ataques astutos mudam os registros DNS do destino pretendido de um usuário e fazem com que ele acredite que está visitando um site ou domínio legítimo. A implementação do MTA-STS ajuda muito a atenuar esses ataques. </p> <p> </p> <p> Agora que estamos familiarizados com o MTA-STS, é hora de entrar em contato com um novo padrão de relatório para SMTP conhecido como relatório TLS. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> O que é Relatório TLS SMTP (TLS-RPT)? </h2> <p> Assim como o MTA-STS, o TLS-RPT é um padrão de relatório que detecta problemas de conectividade e discrepâncias entre os aplicativos de envio. Uma vez ativado, ele envia relatórios diários sobre quaisquer problemas de conexão enfrentados por servidores externos ao enviar e-mails. </p> <p> Pense nisso como uma ferramenta de solução de problemas em que os relatórios podem ser usados ​​para avaliar e fazer a triagem de problemas em potencial e de configuração. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> Que tipo de problemas o TLS-RPT resolve? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Relatório de diagnóstico: </strong> O relatório TLS oferece relatórios de diagnóstico em formato de arquivo JSON contendo detalhes abrangentes sobre quaisquer e-mails recebidos que enfrentam problemas de entrega. Ele também detecta e-mails que foram devolvidos ou não entregues devido a um ataque de downgrade, por exemplo. </p> <p> <strong> Visibilidade aprimorada: </strong> Ao ativar o TLS-RPT, você pode melhorar a visibilidade em todos os seus canais de e-mail. Isso permite que você fique de olho em todos os dados que estão vindo em sua direção, o que também inclui mensagens com falha. </p> <p> <strong> Reportagens diárias: </strong> Os relatórios de diagnóstico são enviados pelo menos uma vez ao dia para cobrir e observar em profundidade as políticas do MTA-STS. Os relatórios também incluem estatísticas de tráfego, bem como informações detalhadas sobre erros e falhas nas entregas. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Quando tudo mais falha, a criptografia prevalece </h2> <p> Devido à natureza em constante evolução das ameaças cibernéticas, criptografia e medidas de segurança rigorosas são essenciais para a entrega segura de e-mail. </p> <p> Graças aos vários provedores de e-mail que oferecem recursos de criptografia fortes e os padrões MTA-STS, as transferências de e-mail totalmente seguras não são mais uma realidade rebuscada. </p>"}