{"title":"O Google está adicionando suporte para identificação facial ao Chrome para iOS","content":"<p> O Google está testando um novo recurso de segurança no Chrome 89 para iOS que usa a autenticação biométrica do iPhone para proteger suas guias de navegação privada. Atualmente limitado a pessoas no canal beta do Chrome, isso permitirá que você bloqueie suas guias anônimas com Face ID ou Touch ID. </p> <h2 id=\"even-more-private-private-browsing\"> Navegação privada ainda mais privada </h2> <p> Todas as guias anônimas protegidas com Face ou Touch ID são desfocadas no alternador de guias. As guias bloqueadas tornam-se visíveis novamente uma vez confirmadas com a autenticação biométrica do ‌iPhone‌. </p> <p> Esse recurso útil não apenas aumenta sua privacidade, mas também fortalece sua segurança enquanto você executa várias tarefas em aplicativos no seu iPhone ou iPad. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> observa que nem todos os usuários beta podem acessar a nova opção de bloqueio devido a um componente do lado do servidor. </p> <p> </p> <h2 id=\"how-s-this-useful\"> Como isso é útil? </h2> <p> Também é útil quando um amigo pode pedir seu iPhone emprestado para pesquisar algo online rapidamente. Com a proteção do Face ID para o modo de navegação privada do Chrome, eles não poderão ver seus sites anônimos abertos ao alternar entre as guias. </p> <p> </p> <p> &quot;Incognito&quot; é um nome de marketing para o modo de navegação privada do Chrome. Enquanto estiver anônimo, você pode navegar na web sem o Chrome salvar nenhuma informação sobre a sessão. Quando você fecha uma janela anônima, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> todas as informações dessa sessão desaparecem </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> Como ativar o Face ou Touch ID no Chrome </h2> <p> Este próximo recurso novo deve ser ativado manualmente na seção Privacidade das configurações do aplicativo do Chrome. Um bloqueio de privacidade semelhante está presente em outros aplicativos do Google. </p> <p> No aplicativo de pesquisa nativo, por exemplo, a autenticação biométrica do iPhone confirma sua identidade ao retornar a uma sessão anônima após 15 minutos. Uma autenticação opcional de Face ou Touch ID também está disponível no Google Drive para proteger seus arquivos quando você sair do aplicativo. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> Quando o recurso será lançado oficialmente? </h2> <p> Não há nenhuma palavra ainda quando a nova opção de bloqueio pode ser lançada para todos, mas o Chrome 89 deve ser lançado para consumo público no próximo mês. O Google também pode decidir não lançar o recurso, apesar de estar listado nas notas de lançamento oficiais. </p>"}