{"title":"O controlador PS4 não funciona? Como corrigir os problemas mais comuns","content":"<p> Na maioria das vezes, o controlador do PlayStation 4 provavelmente funciona bem. Mas quando seu DualShock 4 para de se conectar ou se desconecta aleatoriamente, é frustrante. </p> <p> Vamos dar uma olhada nas correções para quando o controlador do PS4 não está funcionando, para que você possa voltar a jogar. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> O controlador PS4 não se emparelha nem se conecta </h2> <p> Normalmente, quando você pressiona o <strong> Botão PS </strong> no seu controlador, ele deve ligar e se conectar ao seu sistema. No entanto, quando ele não está se conectando, você verá a barra de luz no seu controlador piscar um pouco e, em seguida, desligar. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Isso geralmente acontece se você usou seu DualShock 4 com outro dispositivo. Por exemplo, se você <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> emparelhe seu controlador PS4 com seu PC </a> ou o console de um amigo, ele se lembrará daquele dispositivo daqui para frente. </p> <p> Você precisará emparelhar novamente seu DualShock 4 com seu próprio PS4 nesses casos. Para fazer isso, conecte o controlador ao PS4 usando um cabo micro USB. Certifique-se de usar um cabo de alta qualidade que funcione corretamente. </p> <p> </p> <p> aperte o <strong> Botão PS </strong> no controlador por um momento, e a luz deve piscar brevemente antes de ficar azul. Isso significa que seu controlador foi emparelhado e conectado com sucesso. </p> <p> Se você tem seu DualShock 4 emparelhado com outro dispositivo próximo, como seu telefone ou um PlayStation 5, isso provavelmente ligará e conectará o controlador a esse dispositivo. Portanto, você deve desligar e desconectar qualquer dispositivo ao qual seu DualShock 4 esteja conectado primeiro. </p> <p> Depois de emparelhar novamente o controlador, você pode desconectar o cabo USB e usar o controlador sem fio normalmente. Seu PS4 se lembrará disso até que você emparelhe o controlador com outro dispositivo no futuro. </p> <p> Lembre-se de que o número máximo de controladores DualShock 4 que você pode conectar ao PS4 de uma vez é quatro. Se você já tiver quatro controladores conectados, será necessário desconectar um para abrir espaço para mais. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> O controlador PS4 continua se desconectando </h2> <p> Se o seu DualShock 4 se desconectar aleatoriamente durante o jogo, há algumas soluções que você pode tentar. </p> <p> Primeiro, certifique-se de que a bateria do controlador esteja carregada. Parece simples, mas se a bateria do controlador estiver quase descarregada, ele pode se desconectar. Para verificar a vida útil da bateria do controlador, segure o <strong> Botão PS </strong> para abrir o Menu rápido no lado esquerdo da tela. Você verá um ícone de controlador com visor de bateria na parte inferior. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Conecte seu controlador em seu PS4 e visite o Menu rápido novamente para ter certeza de ver a animação de carregamento da bateria. Depois que seu controlador carregar por algum tempo, tente usá-lo normalmente. </p> <p> Se a bateria não era o seu problema, certifique-se de não estar tentando usar o controlador muito longe do sistema. O alcance típico do Bluetooth é de cerca de 30 pés; dependendo de sua configuração, você pode conseguir usar seu controlador além disso ou ficar restrito a usá-lo mais perto. </p> <p> Falando nisso, você deve tentar minimizar a interferência entre o controlador e o console. Remova quaisquer objetos de metal entre os dois, como prateleiras ou laptops, que possam estar inibindo o sinal. Você também deve tirar seu PS4 de qualquer espaço fechado em que esteja para melhor transmissão e recepção de sinal. </p> <p> Por fim, lembre-se de que o PS4 tem uma configuração que desliga os controladores depois que eles ficam ociosos por algum tempo. Se você não quiser que o controlador do PS4 desligue quando estiver assistindo a aplicativos de mídia como o YouTube, vá para <strong> Configurações&gt; Configurações de economia de energia&gt; Definir tempo até que os controladores desliguem </strong> e escolher <strong> Nunca </strong> . Observe que isso gastará a bateria mesmo quando você estiver ocioso. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> Dicas gerais para consertar um controlador PlayStation 4 </h2> <p> Vimos correções específicas para alguns problemas comuns do DualShock 4 acima. A seguir, vamos dar uma olhada em soluções mais gerais para problemas com controladores PS4. Percorra-os se precisar de mais ajuda. </p> <h3 id=\"restart-your-console\"> 1. Reinicie seu console </h3> <p> Embora a maioria dos problemas do controlador seja proveniente do próprio controlador, há uma chance de que o PS4 seja a causa do problema. Para descartar isso, você deve reiniciar o console antes de solucionar o problema. </p> <p> Se o seu controlador estiver funcionando o suficiente para acessar os menus, segure o <strong> Botão PS </strong> para abrir o Menu rápido e ir para <strong> Power&gt; Reiniciar PS4 </strong> para reiniciar seu sistema. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> Caso seu controlador não esteja cooperando, pressione e segure o <strong> Poder </strong> botão no console PS4 até ouvir dois bipes. Isso irá desligá-lo totalmente (sem luzes na frente) - assim que estiver desligado, pressione o botão <strong> Poder </strong> botão novamente para ligá-lo novamente. </p> <p> Tente usar seu controlador novamente após uma reinicialização e veja se isso ajuda. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. Esqueça e volte a emparelhar o controlador PS4 </h3> <p> Se você tiver um segundo controlador PS4 (ou um controlador PS Move), poderá usá-lo para acessar um menu que permite remover o controlador com problema. Dirigir a <strong> Configurações&gt; Dispositivos&gt; Dispositivos Bluetooth </strong> e selecione o <strong> DualShock 4 </strong> entrada - é aquele que não tem uma luz verde ao lado dele. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> No menu resultante, pressione o <strong> Opções </strong> botão no seu controlador e escolha <strong> Esqueça o Dispositivo </strong> . Isso fará com que seu PS4 remova-o da memória e você terá que emparelhá-lo novamente. </p> <p> Este é um bom momento para tentar um método de emparelhamento ligeiramente diferente: fazer o emparelhamento novamente na inicialização. Para fazer isso, desligue o PS4 (conforme explicado anteriormente). Depois de desligado, conecte o controlador problemático ao console com um cabo USB. Acerte o <strong> Botão PS </strong> para ligar e emparelhar seu controlador em um único processo. </p> <p> Se isso não funcionar, ligue o PS4 novamente e tente emparelhá-lo da maneira normal, como acima. </p> <h3 id=\"hard-reset-your-controller\"> 3. Reinicialize seu controlador </h3> <p> Se a remoção e o emparelhamento do controlador não funcionou, você pode tentar o procedimento de reinicialização completa para o DualShock 4. Você precisará de um pequeno objeto pontiagudo, como um clipe de papel dobrado ou uma ferramenta de ejeção do cartão SIM, para fazer isso . </p> <p> Desligue o PS4 e vire o controle. Você verá um pequeno orifício próximo ao parafuso do botão L2 (no lado direito do controlador quando virado). Use sua ferramenta pontiaguda para pressionar e segurar o botão dentro deste orifício por cerca de cinco segundos. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> Depois de fazer isso, conecte seu controlador ao PS4 novamente via cabo USB e veja se ele emparelha com sucesso. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Experimente o controlador em outro lugar </h3> <p> Neste ponto, se ainda não o fez, tente usar o controlador que está tendo problemas com outro dispositivo. Se você tiver problemas semelhantes no PS4 de um amigo ou no PC, é provável que o controlador esteja com defeito. </p> <p> Também é uma boa ideia tentar outro controlador PS4 com seu console, se possível. Se você pegar emprestado o DualShock 4 de um amigo que sabe que funciona corretamente e descobrir que ele tem problemas com o seu sistema, provavelmente algo está errado com a conectividade sem fio do PS4. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Use o controlador no modo com fio </h3> <p> Antes de desistir do controle, você deve tentar brincar com ele permanentemente conectado por meio de um cabo USB. No entanto, tenha em mente que isso só funciona para o modelo revisado de controladores PS4. Você saberá que tem este modelo se houver uma barra de luz dentro do touchpad na frente do seu controlador. Do contrário, você não pode forçar a comunicação com fio. </p> <p> Se você ainda não tiver um, compre um cabo longo para poder jogar no sofá. O <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Pacote de três Ailun </a> de cabos micro-USB de 10 pés é uma boa opção econômica. </p> <p> Para forçar seu PS4 a conectar controladores via USB, vá para <strong> Configurações&gt; Dispositivos&gt; Controladores&gt; Método de comunicação </strong> e escolher <strong> Use cabo USB </strong> . Isso impedirá que o DualShock 4 use Bluetooth, mesmo quando conectado via USB. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> Opções de correção de hardware DualShock 4 </h2> <p> Como a maioria dos hardwares, os controladores DualShock 4 têm garantia de um ano. Se você comprou seu controlador PS4 no ano passado e não consegue consertá-lo com todas as dicas acima, você deve visitar <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> Página Fix &amp; Replace do PlayStation </a> para fazer uma solicitação de reparo em seu controlador. </p> <p> Caso contrário, você pode tentar as correções de hardware por conta própria abrindo seu controlador. Mas dependendo do problema específico, isso pode ser difícil ou impossível. Recomendamos falar com um técnico de reparo local se você não se sentir confortável em fazer isso sozinho. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> Problemas do controlador PS4, remendado </h2> <p> Agora você sabe como consertar os problemas mais comuns do controlador PS4. Problemas mais específicos, como um botão que para de funcionar, infelizmente se enquadram nas soluções de correção de hardware mencionadas acima. </p> <p> Esperançosamente, seu problema foi fácil de corrigir. Mas se não, e você precisa adquirir um novo controlador PS4, você tem muitas opções excelentes. </p> <p> <small> Crédito da imagem: Joeri Mostmans / <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}