{"title":"O navegador Edge da Microsoft foi o hospedeiro de emuladores de jogos secretos da Nintendo","content":"<p> A Microsoft retirou uma série de emuladores ilegais de jogos escondidos em sua loja de extensões de navegador Microsoft Edge. A loja de extensões do Microsoft Edge hospedava dezenas de emuladores, que permitiam aos usuários jogar vários jogos icônicos, nenhum dos quais postado na loja legalmente. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft remove emuladores ilegais de extensão de borda </h2> <p> À espreita na loja de extensões do Microsoft Edge estavam alguns dos jogos mais icônicos de todos os tempos, incluindo Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2 e até Minecraft. Cada jogo foi lançado no navegador em uma janela de emulador e permitiu aos usuários jogar cada título na íntegra. </p> <p> No entanto, nenhum dos títulos clássicos listou os desenvolvedores de jogos oficiais, como Nintendo, Sega, Atari e sim - até mesmo a Microsoft. Os nomes dos desenvolvedores listados incluem Gamelands, Kday e StayReal, todos inteiramente fictícios e sem links para os desenvolvedores originais. </p> <p> Estranhamente, a conta oficial do Microsoft Edge Development no Twitter, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , postou sobre os emuladores, parecendo promover os jogos disponíveis na loja de extensões do navegador. Não captamos o tweet original promovendo os emuladores, mas uma cópia está disponível via <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Resetera </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> Os emuladores são ilegais? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Os emuladores permitem que você execute diferentes softwares </a> no seu computador. Você também pode usar um emulador para jogar jogos antigos. </p> <p> Embora os emuladores em si não sejam ilegais, baixar conteúdo protegido por direitos autorais para jogar em um emulador é. O tweet da conta oficial do Microsoft Edge Development foi um movimento estranho, pois os emuladores baixaram uma nova cópia da ROM do jogo para o usuário jogar. </p> <p> O tópico abandonware também é uma área cinzenta. Os jogos Abandonware não estão mais sendo publicados e não estão mais disponíveis para venda online ou em uma loja. No entanto, em muitos casos, os direitos autorais desses jogos não expiraram, mas o detentor dos direitos autorais não está fazendo cumprir ativamente seus direitos. </p> <p> </p> <p> Em muitos casos, abandonware é ilegal. Ainda assim, não há processos judiciais relacionados a abandonware, ou pelo menos nenhum relacionado a um antigo desenvolvedor de jogos processando alguém por baixar um título de abandonware. </p> <p> Neste exemplo exato, a emulação desses jogos antigos em um navegador da web é ilegal. Além disso, a Nintendo é conhecida por retirar do ar quaisquer sites ou serviços que tentem replicar ou redistribuir sua propriedade intelectual. </p> <p> Atualmente, os jogos foram removidos do armazenamento de extensões do Microsoft Edge. Além disso, ainda não se sabe como os jogos emulados foram parar na loja de extensões ou quem os colocou lá. Não é preciso dizer que é improvável que voltem. </p>"}