{"title":"O que é uma exploração de dia zero e como funcionam os ataques?","content":"<p> Pode ser frustrante quando um software fica exigindo atualização com patches de segurança, mas eles são muito importantes para a segurança do seu dispositivo. Quando um programa se mantém atualizado, ele se protege melhor contra o temido ataque de dia zero e mantém você seguro. </p> <p> Com isso dito, o que é um exploit de dia zero e por que é tão importante manter seu software atualizado? </p> <h2 id=\"what-is-a-zero-day-exploit\"> O que é uma exploração de dia zero? </h2> <p> Antes de saltarmos para o que é um exploit de dia zero (ou dia 0), precisamos dar uma olhada no mundo da caça de exploits. É extremamente difícil para um desenvolvedor publicar um software que não contenha nenhum bug; como resultado, isso cria caçadores de exploits que desejam encontrar esses bugs. </p> <p> Um caçador de explorações tentará métodos diferentes para encontrar um buraco nas defesas do software. Isso pode incluir enganar o programa para permitir que o explorador acesse o software remotamente ou forçá-lo a executar um programa malicioso. </p> <p> Depois que o caçador encontra uma façanha, ele pode seguir um de dois caminhos. Isso depende de sua disposição geral e suas razões para façanhas de caça em primeiro lugar. </p> <h3 id=\"fixing-a-zero-day-vulnerability\"> Corrigindo uma vulnerabilidade de dia zero </h3> <p> Se o caçador de insetos for um pesquisador ou um entusiasta, a história provavelmente tomará um bom caminho. Nesse caso, o exploit hunter relatará o bug ao desenvolvedor em segredo para evitar que o exploit caia nas mãos erradas. </p> <p> Uma vez que o desenvolvedor sabe sobre o exploit, ele pode desenvolver e lançar um patch rapidamente antes que alguém descubra sobre o bug. Obviamente, uma correção só é útil se os usuários realmente fizerem o download, e é por isso que alguns softwares automaticamente procuram e baixam patches de segurança. </p> <p> </p> <p> Esse método de patch pode ser irritante para você, pois um software pode começar a exigir um patch todos os dias. No entanto, é importante permitir que essas atualizações sejam executadas, pois pode ser um desenvolvedor corrigindo um exploit de dia zero para defender seus usuários. </p> <h3 id=\"exploiting-a-zero-day-vulnerability\"> Explorando uma vulnerabilidade de dia zero </h3> <p> O outro caminho, entretanto, não tem um final tão feliz. Se o caçador de bugs está procurando exploits que ele pode abusar, ele manterá esse conhecimento longe do desenvolvedor. Em seguida, o caçador de bugs desenvolverá e lançará um programa que explora o bug para ganho pessoal. </p> <p> Este cenário é particularmente desagradável, pois está sendo explorado ativamente sem o conhecimento do desenvolvedor. Eles não podem consertar o que não sabem, o que dá ao cibercriminoso rédea solta sobre as cópias do software de todos até que alguém descubra o bug. </p> <p> Assim que o desenvolvedor toma conhecimento de um bug explorado ativamente, ele se torna uma corrida contra o tempo. Se o desenvolvedor for rápido, eles podem selar o bug antes que qualquer dano seja feito; se não forem, pode colocar em risco a segurança do cliente. </p> <p> Quando um agente malicioso encontra e explora um bug, ele cria um momento crítico na segurança cibernética em que as duas partes correm para corrigir ou capitalizar a vulnerabilidade. Este momento é capturado pelo termo &quot;exploração de dia zero&quot;. Isso ocorre porque um exploit é desenvolvido no mesmo dia em que o bug foi descoberto - é no &quot;dia zero&quot;. </p> <p> </p> <h2 id=\"the-danger-of-zero-day-exploits\"> O perigo das explorações de dia zero </h2> <p> </p> <p> Os exploits de dia zero são perigosos porque têm duas vantagens sobre o mundo da segurança cibernética. Eles não apenas abusam de um bug que ainda não foi corrigido, mas o fazem sem que o desenvolvedor saiba até que seja tarde demais. </p> <p> O Stuxnet é um exemplo particularmente desagradável de ataque de dia zero. Stuxnet abusou de uma exploração descoberta em um centro de enriquecimento de urânio iraniano. O Stuxnet se infiltrou no sistema, forçou as centrífugas a girarem tão rapidamente que se desfizeram, depois fez um falso relatório de diagnóstico para dizer que estava tudo bem. </p> <p> Ele deliberadamente saiu de seu caminho para enganar os usuários do sistema, fazendo-os pensar que tudo estava indo bem. Como tal, ninguém sabia que algo estava errado até que cerca de mil centrífugas se despedaçaram. </p> <p> A natureza de um vírus de dia zero significa que ele pode passar despercebido pelo radar com grande eficiência. Os antivírus não o pegam, porque não sabem o que procurar. O software não pode se defender contra isso, porque, para começar, ele não sabe que tem a falha. </p> <p> Isso torna um ataque de dia zero uma forma desagradável de um hacker causar danos sem que a vítima perceba o que está acontecendo. </p> <p> </p> <h2 id=\"how-to-stay-safe-from-zero-day-vulnerabilities\"> Como se manter protegido contra vulnerabilidades de dia zero </h2> <p> Ameaças de dia zero definitivamente parecem assustadoras e não devem ser subestimadas de forma alguma. No entanto, nem tudo está perdido; Existem maneiras de cuidar de si mesmo e evitar que um dia zero infecte seu PC. </p> <p> A melhor proteção contra um vírus de dia zero é ter um bom senso do que não se deve fazer na Internet. Os desenvolvedores de malware podem explorar todos os problemas de dia zero que desejam, mas ainda precisam colocar a carga útil no PC de alguma forma. Contanto que você negue isso a eles, seu dispositivo estará protegido contra a maioria das ameaças. </p> <p> Dessa forma, você definitivamente deve aprender o máximo <a href=\"https://www.makeuseof.com/tag/online-security-tips/\" target=\"_blank\" rel=\"nofollow noopener\"> sobre segurança online </a> como você puder. Nem todas as dicas serão relevantes para a proteção contra um dia zero, mas você ainda precisa saber como navegar com segurança. </p> <p> Se você já tem o básico, há muito que pode fazer para <a href=\"https://www.makeuseof.com/tag/5-ways-protect-zero-day-exploit/\" target=\"_blank\" rel=\"nofollow noopener\"> proteja-se de uma exploração de dia zero </a> . Esses exploits funcionam melhor em sistemas que não são atualizados regularmente, portanto, baixar um patch de dia zero assim que ele estiver pronto é uma maneira fantástica de permanecer seguro. </p> <p> </p> <h2 id=\"becoming-a-hero-vs-zero-day-threats\"> Tornando-se um herói contra ameaças de dia zero </h2> <p> Uma ameaça de dia zero pode ser um grande problema de segurança cibernética, mas isso não significa que você está totalmente indefeso contra ela. Agora, você sabe o que é uma ameaça de dia zero, por que são tão perigosas e por que é importante manter todos os seus softwares atualizados, não importa o quão irritantes sejam as solicitações de atualização. </p> <p> Garantir que seu PC está protegido contra ataques cibernéticos pode colocar sua cabeça em rodopio. Felizmente, se você seguir algumas regras básicas do que fazer e não fazer, estará protegido contra a maioria das ameaças online. </p>"}