{"title":"Parler volta a ficar online após um mês de paralisação","content":"<p> Depois de ser excluído pela Big Tech, Parler finalmente ressurgiu na web. A plataforma de &quot;liberdade de expressão&quot; agora está acessível aos usuários existentes e em breve começará a aceitar novos registros de usuários nas próximas semanas. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler ressurge após o apagão de Big Tech </h2> <p> Parler está de volta após um longo apagão. A rede social alternativa vem ganhando força entre os conservadores políticos e foi <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> inicializado pela Amazon Web Services (AWS), Google e Apple </a> após os distúrbios do Capitólio. Parler foi acusado de não fazer o suficiente para moderar conteúdo violento, resultando em sua remoção das lojas de aplicativos e da web. </p> <p> No lugar do AWS, Parler agora está usando um host chamado SkySilk. O site também registrou seu nome de domínio com Epik, um registrador que atende a outros tipos de redes de &quot;liberdade de expressão&quot;, como Gab. </p> <p> Um novo host e registrador de domínio não são as únicas mudanças que Parler fez - Parler até ressurgiu com um novo CEO interino. Isso vem depois <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> a equipe Parler supostamente demitiu o cofundador John Matze </a> . </p> <p> Mark Meckler substituirá temporariamente Matze como CEO, e anteriormente foi cofundador do grupo de direita Tea Party Patriots. Em declaração obtida por <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> A colina </a> , Meckler anunciou o retorno tão esperado de Parler, dizendo: </p> <blockquote> <p> Quando Parler foi retirado do ar em janeiro por aqueles que desejam silenciar dezenas de milhões de americanos, nossa equipe se reuniu, determinada a cumprir nossa promessa à nossa comunidade altamente engajada de que voltaríamos mais fortes do que nunca. Estamos entusiasmados em receber todos de volta. </p> </blockquote> <p> Meckler continuou, observando que Parler permanecerá dedicado à &quot;liberdade de expressão, privacidade e diálogo civil&quot;. Ele também garantiu aos usuários que &quot;Parler está sendo administrado por uma equipe experiente e veio para ficar.&quot; </p> <p> Embora contas mais antigas na plataforma estejam de volta ao normal, postagens mais antigas (ou &quot;negociações&quot;) não foram restauradas. Se você já possui uma conta no Parler, pode continuar usando o site. Caso contrário, você terá que esperar cerca de uma semana até poder se inscrever. </p> <p> Mas mesmo se você já tiver uma conta Parler, pode encontrar algumas dificuldades técnicas ao usar a plataforma. Parece que o serviço ainda não foi totalmente restaurado. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> O aplicativo Parler ainda permanece no Limbo </h2> <p> Parler ainda está banido da Google Play Store e da Apple App Store, o que pode prejudicar gravemente sua base de usuários. Do jeito que está, a plataforma pode permanecer indisponível em dispositivos móveis por um período de tempo desconhecido. </p> <p> Provavelmente, ele não poderá retornar à Play Store ou App Store a menos que mude suas políticas de moderação, algo que Parler provavelmente se recusará a fazer. </p>"}