{"title":"Qual é a diferença entre LAN e WAN na rede?","content":"<p> Se você já se intrometeu em redes de computadores, é bem provável que tenha encontrado os termos &quot;LAN&quot; e &quot;WAN&quot;. No entanto, o que cada um significa e quais são as diferenças quando você compara uma LAN com uma WAN? </p> <p> Vamos explorar essas duas tecnologias e saber onde cada uma delas se destaca. </p> <h2 id=\"what-does-lan-stand-for\"> O que significa &quot;LAN&quot;? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> Crédito da imagem: Drug Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Uma LAN é uma &quot;Rede Local&quot;. Este termo descreve uma rede onde todos os dispositivos conectados estão próximos uns dos outros. Eles estão todos em uma &quot;área local&quot;, daí o nome. </p> <p> Quando um computador se conecta a uma LAN, ele obtém um endereço de protocolo de Internet local (IP). Isso funciona de forma semelhante ao endereço IP que você obtém quando fica online. No entanto, um endereço IP local funciona apenas para outros computadores na mesma LAN que você. Você não pode usar um IP local para se conectar ao seu PC pela internet, por exemplo. </p> <p> A fronteira física de sua LAN doméstica provavelmente não sairá de sua casa. Claro, se você levar seu telefone ou laptop para o jardim para tomar um pouco de ar fresco, ele ainda estará na LAN. No entanto, na maioria das vezes, todos os seus dispositivos conectados à rede estão com segurança dentro das quatro paredes de sua casa. </p> <p> Empresas e institutos também fazem LANs. Por exemplo, uma universidade pode conectar todos os PCs de sua biblioteca a uma rede para que todos possam se comunicar. As empresas também gostam de usar LANs porque permitem que os funcionários enviem arquivos e correspondência uns aos outros sem a necessidade de ficar online. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> O que significa &quot;WAN&quot;? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Crédito da imagem: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Por outro lado, temos a Wide Area Network, ou WAN. Se você está lendo este artigo, já está conectado a uma WAN - gostamos de chamá-la de Internet. </p> <p> O &quot;amplo&quot; na rede de longa distância é altamente variável. Se você se conectar a um servidor externo na mesma cidade que você, isso é uma WAN. Também é considerada uma WAN se você se conectar a um servidor em um país do outro lado do planeta. </p> <p> Como tal, uma WAN é normalmente usada para descrever qualquer rede à qual você se conecta que existe além do seu roteador. Não importa se o servidor está a uma milha ou um continente de distância; ainda é &quot;largo&quot;. </p> <p> A internet não é a única WAN que existe. As empresas fazem bom uso das WANs para conectar escritórios que estão em diferentes países. Por exemplo, se uma empresa possui um escritório em Nova York, Tóquio e Sydney, ela pode alugar seu próprio sistema WAN para permitir que eles se comuniquem. </p> <p> Mas espere um minuto; por que as empresas fazem sua própria WAN quando podem simplesmente conectar tudo à internet? O problema com essa solução é que a empresa terá que pagar taxas de ISP e, se algo der errado, eles terão que lutar com o ISP para consertá-lo. </p> <p> Além disso, a Internet foi projetada para conectar muitos PCs ao redor do mundo. Se uma empresa deseja apenas que seus PCs se conectem a outros PCs de escritório, ela pode usar sua própria WAN para se proteger de ameaças online. Isso é chamado de &quot;intranet&quot;. </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> Quando usar uma LAN vs. WAN </h2> <p> Quando quiser se conectar a outro dispositivo de sua propriedade, você pode optar por fazer isso por LAN ou WAN. Mas quais são as vantagens e desvantagens de cada um, e quais você deve usar? </p> <p> Digamos que você tenha um novo disco rígido sem fio que se conecta ao roteador e tenha a opção de permitir conexões da Internet (uma WAN) ou mantê-lo apenas local (LAN). Qual você escolhe depende do que você deseja do disco rígido. </p> <p> Fornecer recursos de WAN ao disco rígido é fantástico por conveniência. Isso o coloca na Internet, o que significa que você pode se conectar a ele de qualquer lugar do mundo. Como tal, você nunca mais ficará sem seus arquivos; eles estarão apenas a uma conexão de internet de distância. </p> <p> No entanto, as conexões WAN também permitem que outras pessoas tenham acesso aos seus dispositivos. Se a segurança do seu disco rígido não for perfeita, os hackers podem usar a mesma rota que você usa para ver todos os seus dados e copiar ou excluir coisas importantes. </p> <p> Colocar o disco rígido no modo somente LAN, por outro lado, o protege de alguns dos caminhos que um hacker pode tomar. Não é impermeável. Por exemplo, alguém pode usar seu PC para obter acesso ao disco rígido. No entanto, é muito mais seguro do que transmitir o disco rígido na WAN todos os dias e todas as noites. </p> <p> Se você realmente deseja aumentar a segurança, pode abrir um espaço de ar no disco rígido. Air gapping significa que ele e todos os PCs na mesma rede não estão conectados a uma WAN - como a Internet, por exemplo. </p> <p> A <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> computador air-gap não é totalmente seguro contra ameaças online </a> , mas reduz drasticamente a chance de um ataque. Os hackers precisam manipular os seres humanos para que façam o que querem para atacar um dispositivo air-gap, usando táticas de engenharia social para conseguir o que querem. </p> <p> Assim, ao escolher entre colocar um dispositivo na Internet ou mantê-lo bloqueado na sua LAN doméstica, você precisa considerar se irá realmente se conectar a ele pela Internet. Se você acha que não, é melhor desligar seus recursos de WAN e manter os hackers afastados. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> A conexão com a Internet transforma uma LAN em uma WAN? </h2> <p> Digamos que você tenha uma LAN configurada onde todos os seus dispositivos estão conectados a um roteador. Você está entediado, então liga o computador e vai para o Netflix. Agora, seu PC está conectado a uma WAN: a internet. </p> <p> No entanto, como seu PC está conectado a uma WAN, isso significa que ele não faz mais parte de uma LAN? Felizmente, um dispositivo pode fazer parte de uma LAN e de uma WAN ao mesmo tempo. </p> <p> Lembra-se de como dissemos que os dispositivos LAN têm seu próprio endereço IP local? Isso não significa que ele também não possa obter um endereço IP da Internet. Na verdade, se você estiver lendo este artigo em um dispositivo conectado a um roteador, ele terá os dois! </p> <p> Se você quiser verificar por si mesmo, nós cobrimos <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> como verificar o seu endereço IP no Windows </a> . Se você estiver no celular, ainda pode <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> encontre seus endereços IP no Android ou iPhone </a> . </p> <p> Depois de ter as estatísticas ativas, você verá dois endereços IP. O primeiro começará com &quot;192.168&quot; - esse é o seu endereço IP local. Você pode usar este se quiser se conectar ao seu dispositivo atual a partir de outro na mesma rede. </p> <p> O segundo terá uma de duas formas, dependendo se você estiver em IPv4 ou IPv6. Se você estiver na v4, deve ser semelhante ao seu endereço IP local, mas não começará com &quot;192.168&quot;. Se for IPv6, deve ser uma confusão de letras e números, divididos em oito blocos por dois-pontos. </p> <p> De qualquer forma, esse endereço é o seu endereço IP de Internet. Isso é usado quando você se conecta a outro servidor na Internet para que ele possa se comunicar com você; por exemplo, para enviar aquele programa de TV que você está assistindo na Netflix. </p> <p> De certa forma, você pode imaginar a Internet como uma enorme rede de LANs. Quando você assiste ao Netflix, seu PC (em sua LAN pessoal) está obtendo dados dos servidores Netflix (que estão em sua própria LAN). Cada LAN é como uma casa em uma cidade, enquanto a conectividade com a Internet é como as estradas e ruas que os conectam. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> Eliminando a confusão de LAN vs. WAN </h2> <p> LANs e WANs geralmente funcionam em conjunto, mas funcionam de maneiras diferentes. Agora você sabe a diferença entre os dois e quando usar cada um. </p> <p> Você sabia que pode configurar um jogo em LAN para que as pessoas na mesma rede possam jogar umas com as outras? É uma ótima maneira de passar o tempo com os amigos sem os problemas de latência que os jogos na Internet às vezes apresentam. </p> <p> <small> Crédito da imagem: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}