{"title":"Qual carregador você precisa para o Samsung Galaxy S21?","content":"<p> No que pode ter sido um choque para os usuários leais da Samsung, o principal fabricante decidiu não incluir um carregador na caixa do Galaxy S21, Galaxy S21 + e Galaxy S21 Ultra. </p> <p> Isso segue a grande jogada da Apple de remover o carregador da série iPhone 12 em diante, forçando os consumidores a usar um carregador pré-adquirido ou comprar um novo. </p> <p> Então agora você provavelmente está se perguntando o que deve estar procurando em um carregador. Listamos o que você precisa saber ao comprar um novo carregador para o seu Samsung Galaxy S21. </p> <h2 id=\"galaxy-s21-charger-how-many-watts-do-you-need\"> Carregador do Galaxy S21: quantos watts você precisa? </h2> <p> Se vocês são <a href=\"https://www.makeuseof.com/samsung-galaxy-s21-worth-upgrading/\" target=\"_blank\" rel=\"nofollow noopener\"> mudar para a série Samsung Galaxy S21 </a> , você encontrará várias atualizações excelentes e um grande downgrade: a exclusão de um carregador como um dos brindes. Em vez disso, a Samsung fornece apenas um cabo USB-C para transferência de dados ou conexão a um carregador existente. </p> <p> O mais importante ao comprar seu carregador, ou reutilizar um antigo, é verificar se ele é totalmente compatível. </p> <ul> <li> A linha do Samsung Galaxy S21 é compatível com carregadores USB-C compatíveis com USB Power Delivery 3.0, <strong> até 25 watts </strong> ou Quick Charge 2.0. </li> <li> Carregadores que fornecem energia <strong> abaixo de 25 watts ainda funcionarão </strong> , mas carregará o telefone muito mais lentamente. </li> </ul> <p> Isso também se aplica se você optar por carregá-lo por meio de seu laptop ou outro dispositivo. Portanto, verifique a capacidade do carregador para habilitar recursos de carregamento super rápido ou rápido em seu dispositivo. </p> <p> Para carregamento de 25 W, uma carga de 30 minutos fornecerá cerca de 50 por cento da vida útil da bateria. </p> <p> </p> <h2 id=\"what-types-of-charger-work-with-the-s21\"> Que tipo de carregador funciona com o S21? </h2> <p> <img alt=\"samsung wireless charging\" src=\"images/wireless-charger-221.jpg\" loading=\"lazy\"> Crédito da imagem: <a href=\"https://www.samsungmobilepress.com/mediaresources/wiresless_charger_trio/images?imgType=lifeStyle\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Samsung </a> </p> <p> Depois de verificar a capacidade de energia adequada ao seu dispositivo Galaxy, agora você pode escolher entre diferentes tipos de carregador que atendem ao seu estilo de vida e conveniência: </p> <ul> <li> <strong> Carregadores de parede: </strong> Os carregadores de parede vêm com um bloco que funciona como um plugue para inserir na tomada da parede com uma porta USB em uma extremidade. Esses carregadores são os mais comuns entre os tipos de carregadores e geralmente podem fornecer a capacidade máxima de carregamento de seu telefone. O Samsung Galaxy S21 suporta carregadores de parede de até 25 W para carregamento rápido. </li> <li> <strong> Bancos de energia: </strong> Os bancos de energia são uma fonte de energia portátil para carregar qualquer item alimentado por bateria, como telefones celulares. Eles normalmente fornecerão bem abaixo dos 25 W necessários para um carregamento rápido, mas são bons como fonte de alimentação de reserva. É melhor olhar os bancos de energia aprovados da Samsung para o seu Galaxy S21. </li> <li> <strong> Carregadores sem fio: </strong> Os carregadores sem fio ou indutivos são cada vez mais populares como plataformas que carregam seu telefone quando você o coloca em cima ou no local indicado pelo carregador <a href=\"https://www.makeuseof.com/wireless-charging-how-it-works-and-everything-else-you-must-know/\" target=\"_blank\" rel=\"nofollow noopener\"> Carregamento sem fio </a> ajuda a não desgastar a tomada do seu smartphone e evita o superaquecimento, pois ele desliga automaticamente quando o dispositivo está totalmente carregado. Ele fornece cerca de 15W de potência. </li> </ul> <p> </p> <h2 id=\"how-to-find-the-right-charger\"> Como encontrar o carregador certo </h2> <p> Um bom carregador não precisa falar por si. Existem fóruns na Internet que fornecem análises confiáveis ​​sobre o produto após alguns testes. </p> <p> <img alt=\"samsung wall charger\" src=\"images/samsung-charger-479.jpg\" loading=\"lazy\"> </p> <p> Alguns dos fatores que definem um bom carregador são sua durabilidade e longevidade, boa regulação da tensão de saída, isolamento acústico e certificação incorporada conforme indicado pelos símbolos CE, MFI e RoHS no bloco ou caixa do carregador. </p> <p> Mesmo se você decidir não ir para um carregador Samsung oficial, ainda vale a pena escolher uma marca conhecida em vez de um dos modelos baratos que você encontrará em lugares como o Ebay. Ou, é claro, você pode usar o carregador de um telefone antigo. </p> <p> </p> <h2 id=\"use-an-old-charger-with-the-s21\"> Use um carregador antigo com o S21 </h2> <p> Embora seja decepcionante não haver carregador na caixa do S21, a Samsung avalia que a maioria dos usuários já terá um (ou mais) de qualquer maneira, e provavelmente estão certos. O S20 tinha um carregador de 25 W e a maioria dos outros telefones dos últimos anos teve carregadores de 15 a 25 W e às vezes até mais. Você pode não precisar comprar um novo carregador. </p> <p> E se você estiver mudando para um dispositivo Samsung pela primeira vez, pode precisar de ajuda para se acostumar com o One UI. Certifique-se de verificar nossas dicas e truques sobre como usar este software para obter o máximo de desempenho. </p>"}