{"title":"Relatório: Android 12 terá um modo de uma mão","content":"<p> Oficialmente, chegamos à fase do ciclo de vida do Android 11 em que os rumores do Android 12 começam a sair com força total. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> Desenvolvedores XDA </a> relatou que o Google está trabalhando em um modo com uma mão para o Android 12 que tornará muito mais fácil navegar pelo telefone com uma única mão. Se você tem mãos grandes ou pequenas, isso pode abrir uma nova maneira de interagir com seu dispositivo Android. </p> <p> Claro, muitos fabricantes de dispositivos e <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> desenvolvedores de software introduziram soluções para melhorar a usabilidade com uma mão </a> . Ainda assim, será muito mais agradável usá-lo quando estiver integrado diretamente ao sistema operacional. </p> <h2 id=\"android-12-s-one-handed-mode\"> Modo de uma mão do Android 12 </h2> <p> De acordo com o relatório, o Google está planejando adicionar o recurso de uma mão ao AOSP, que é a versão de código aberto do Android que qualquer desenvolvedor de software pode usar em seus dispositivos. Isso também significa que os OEMs que ainda não desenvolveram seu próprio modo com uma mão terão uma maneira fácil de implementar o recurso em seus dispositivos. </p> <p> O que o relatório não indicou foi se o Google exigiria que os fabricantes de telefones usassem o recurso de uma mão do Android 12 ou se seria opcional. </p> <p> Como ainda é incrivelmente cedo, não sabemos exatamente como o modo de uma mão do Android 12 funcionará. Se a capacidade anterior do Google de adicionar recursos ao sistema operacional servir de indicação, esperamos que a empresa faça um bom trabalho com a implementação. O Google pode optar por reduzir a tela inteira até um canto do dispositivo para facilitar o acesso. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> O relatório também indica que o modo de uma mão do Android 12 terá uma maneira de acioná-lo usando o modo tradicional de três botões junto com o modo de navegação gestual mais recente. </p> <p> Conforme mencionado, muitos OEMs de smartphones já implementaram o recurso em sua própria versão modificada do Android. Por exemplo, a Huawei realmente tentou enviar sua versão do recurso ao AOSP, mas o Google rejeitou. Talvez o Google tenha recusado porque a empresa sabia que pretendia trazer sua própria versão do recurso. </p> <p> Como esse vazamento é tão precoce, nenhuma foto demonstra o recurso ainda, então teremos que esperar até que o Android 12 se aproxime de seu lançamento. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Quando o Android 12 será lançado? </h2> <p> Infelizmente, não sabemos exatamente quando o Android 12 será lançado ao público (embora não seja por enquanto). Também não sabemos exatamente quando esse recurso será lançado para desenvolvedores ou para as versões Beta ou Estável do Android. </p> <p> Como sempre acontece com os novos recursos do Android, teremos que esperar para ver se se trata do sistema operacional. </p>"}