{"title":"RPGs de computador vs. RPGs clássicos: o que o CRPG significa em 2021?","content":"<p> A história dos RPGs de computador é tão longa quanto a história dos próprios videogames, evoluindo e crescendo juntos ao longo dos anos. E assim como os CRPGs evoluíram, melhorando os gráficos, adicionando ou eliminando a mecânica de jogo, o mesmo aconteceu com o significado e a terminologia usados ​​para descrevê-los. </p> <p> A sigla CRPG, que tradicionalmente significava Computer Role Playing Game, expandiu seu significado ao longo do tempo para incluir RPGs para diferentes plataformas. Agora, ele adotou um novo significado. Embora seu novo significado não seja totalmente diferente do original, agora descreve um subgênero específico de RPG. </p> <h2 id=\"the-history-of-crpgs\"> A História dos CRPGs </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> A história dos CRPGs começou na década de 1970 com o lançamento da primeira adaptação do RPG de mesa Dungeons &amp; Dragons, Dungeon. O jogo estava originalmente disponível no Atari (você pode jogá-lo via <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, um serviço de streaming de jogos no Plex </a> ) </p> <p> Embora a jogabilidade de Dungeon tenha sido principalmente baseada em texto, ele descreveu completamente os movimentos de seu grupo de vários personagens em um cenário de fantasia enquanto implementava a maioria dos princípios básicos de Dungeons &amp; Dragons. </p> <p> Naquela época, nós os rotulamos como RPGs de computador para diferenciá-los de seus equivalentes de mesa, que eram muito mais populares na época, e nós simplesmente os conhecíamos como RPGs. </p> <p> Na década de 1990, os CRPGs estavam em plena floração, agora capazes de exibir um mundo de fantasia por completo, pelo menos em uma perspectiva de cima para baixo, ou visão isométrica. Esse foi o caso de Ultima VII, um dos CRPGs mais interativos que este escritor já jogou. </p> <p> Quase tudo que você pode ver, você pode mover ou interagir: Você pode criar armas, tocar instrumentos e até mesmo carregar seu membro do grupo morto para fora de uma masmorra até a sala do trono do rei para ressuscitá-lo! </p> <p> Baldur&#39;s Gate foi um dos que mais emulou a experiência de RPG de mesa. Ele adaptou o conjunto de regras do Dungeons &amp; Dragons 2ª Edição (também conhecido como Advanced Dungeons &amp; Dragons) em um formato isométrico <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> CRPG pausável em tempo real </a> . Esses tipos de CRPGs enfatizavam táticas na batalha, progressão do personagem, tomada de decisões e encorajavam a exploração. </p> <p> </p> <p> Hoje, em um mundo onde os consoles dominam o mercado, os videogames RPG se tornaram mais populares do que os RPGs de mesa. Na medida em que no uso moderno, a sigla RPG se refere mais à sua versão de videogame. Você chamaria Dungeon&#39;s &amp; Dragons de RPG de mesa, em vez de apenas RPG. </p> <p> Com a evolução dos gráficos, a mecânica de jogo dos CRPGs se adaptou aos padrões gráficos modernos. As séries de CRPGs como The Elder Scrolls, Gothic ou The Witcher revolucionaram o gênero, introduzindo algumas novas mecânicas de jogo e eliminando outras. </p> <p> Esses RPGs são mais orientados para a ação e de ritmo acelerado, colocando-se um pouco, embora não completamente, dentro do subgênero hack and slash (estes ainda são RPGs sólidos!) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Uma nova onda de CRPGs </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> No entanto, indo contra a tendência da indústria de videogames atual de buscar o realismo gráfico, surgiu uma nova onda de CRPGs. RPGs da velha escola, ou clássicos, influenciam fortemente esses jogos e enfatizam a mecânica de jogo e a imersão, ao invés do visual. </p> <p> Eles geralmente são jogos isométricos, com pausas em tempo real ou batalhas táticas baseadas em turnos. Esses CRPGs também fazem o possível para serem o mais imersivos possível, fornecendo a você grandes blocos de prosa bem elaborada e uma história de fundo sólida. </p> <p> A maioria deles depende de texto em vez de dublagem para a maioria dos diálogos, como os CRPGs da velha escola. Alguns desses CRPGs incluem Pilares da Eternidade, Divindade: Pecado Original ou Pathfinder: Kingmaker. </p> <p> Esses jogos também enfatizam as táticas de batalha, a progressão do personagem, a tomada de decisões e encorajam a exploração, assim como os CRPGs da velha guarda. Por essas razões, nós os consideramos mais relacionados aos RPGs Clássicos do que à maioria dos RPGs modernos. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> O que CRPG significa em 2021 </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> Desde os anos 2000, RPG tornou-se o termo padrão para se referir a qualquer videogame RPG. Mas por volta de 2015, eles lançaram Divinity: Original Sin e Pillars of Eternity. </p> <p> Esses RPGs foram uma partida da abordagem orientada para a ação dos RPGs modernos, embora sejam muito semelhantes aos títulos mais antigos tanto na estética quanto na mecânica de jogo. Foi nessa época que surgiu a necessidade de um novo termo para diferenciar esses RPGs dos RPGs modernos. </p> <p> Embora as pessoas tenham usado os termos &quot;velha escola&quot; e &quot;RPG clássico&quot; online por anos para descrever esses jogos, o último é o que pegou. Assim como os videogames modernos de RPG reivindicaram a sigla RPG, as pessoas estão chamando os RPGs da velha escola de &quot;CRPGs&quot; agora. </p>"}