{"title":"Roku quer sua opinião sobre seu controle remoto recarregável","content":"<p> A Roku está recrutando algumas pessoas para participar de seu programa de acesso antecipado, a fim de testar um novo controle remoto (chamado Roku Voice Remote Pro) que possui uma bateria recarregável. </p> <p> É uma oferta por tempo limitado enquanto durarem os estoques, embora você ainda precise pagar pelo controle remoto. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> O que é o Roku Voice Remote Pro? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> Finalmente um controle remoto com bateria recarregável </a> a partir de <a href=\"https://www.reddit.com/r/Roku/\"> Roku </a> </blockquote>  <p> Conforme observado pela primeira vez pelo usuário Kingtut206 em <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , A Roku está recrutando pessoas para seu programa de acesso antecipado a fim de testar um novo controle remoto chamado Roku Voice Remote Pro. </p> <p> O novo controle remoto possui uma bateria recarregável, um localizador remoto perdido (por exemplo, você pode dizer &quot;Ei Roku, encontre meu controle remoto&quot;), voz sem as mãos e botões de atalho pessoal ao lado dos botões de marca padrão. </p> <p> Conforme relatado por <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> The Verge </a> , o remoto carrega via micro-USB, em vez do muito superior USB-C. Talvez o feedback obtido por meio do Programa de Acesso Antecipado reconheça isso. </p> <p> A participação no programa é apenas por convite, embora não se saiba o que o torna qualificado. </p> <p> O controle remoto custa US $ 29,99 e a entrega está prevista para 19 de fevereiro de 2021. </p> <p> Apenas 2.000 unidades serão vendidas e Roku coletará feedback sobre sua experiência com o controle remoto. Após esse tempo, podemos presumir que o controle remoto será refinado antes de ser potencialmente colocado à venda. </p>"}