{"title":"Spotify está testando letras ao vivo nos EUA","content":"<p> Você gosta de cantar junto com suas músicas favoritas do Spotify, mas sempre precisa procurar as letras para garantir que seu karaokê seja preciso? Você está com sorte. O Spotify agora está testando seu recurso de letras ao vivo para algumas pessoas nos Estados Unidos. </p> <h2 id=\"spotify-rolls-out-real-time-lyrics\"> Spotify lança letras em tempo real </h2> <p> Se você estiver nos Estados Unidos, poderá ver um novo recurso do Spotify que permite exibir as letras em tempo real contra a música que você está tocando. As letras são fornecidas pela empresa de dados musicais Musixmatch. </p> <p> &quot;Poder&quot; é a palavra-chave aqui, já que ainda está em fase de teste. Isso significa que apenas um grupo de usuários verá o recurso enquanto o Spotify mede seu impacto. Não se sabe quantos usuários compõem o grupo de teste. </p> <p> As letras são um recurso muito solicitado pelo Spotify, então seria surpreendente se o recurso não fosse lançado para todos, mas nada é certo. </p> <p> Em um e-mail para <a href=\"https://www.engadget.com/spotify-live-lyrics-united-states-test-ios-android-140045159.html\" target=\"_blank\" rel=\"nofollow noopener\"> Engadget </a> , um porta-voz do Spotify disse: </p> <blockquote> <p> Podemos confirmar que estamos testando nosso recurso de letras para um número seleto de usuários nos Estados Unidos. No Spotify, conduzimos rotineiramente uma série de testes em um esforço para melhorar nossa experiência do usuário. Alguns desses testes acabam pavimentando o caminho para nossa experiência de usuário mais ampla e outros servem apenas como um aprendizado importante. Não temos mais novidades para compartilhar no momento. </p> </blockquote> <p> </p> <h2 id=\"are-lyrics-new-for-spotify\"> As letras são novas para o Spotify? </h2> <p> Estritamente falando, as letras em tempo real não são um recurso novo. Isso porque está disponível em países como Brasil, México, Índia e Cingapura desde junho de 2020. </p> <p> Na verdade, muito antes disso, o Spotify tinha letras ao vivo em todo o mundo. Também surgiu como resultado de uma parceria com a Musixmatch, embora o recurso tenha sido removido sem a menor cerimônia quando o acordo entre as duas empresas chegou ao fim. </p> <p> O Spotify então o substituiu por uma integração com o Genius, em um recurso chamado &quot;Behind the Lyrics&quot;, que exibe informações e curiosidades sobre algumas músicas. Isso também está disponível no Apple Music, que também oferece suporte para letras ao vivo. </p> <p> O Engadget relata que &quot;Behind the Lyrics&quot; será removido do Spotify se o recurso de letras ao vivo for ampliado. Provavelmente não fará falta para muitos. </p> <p> Para aquelas pessoas em regiões que ainda não têm letras ao vivo, existe a opção de <a href=\"https://www.makeuseof.com/tag/lyrics-currently-playing-songs-spotify/\" target=\"_blank\" rel=\"nofollow noopener\"> use outros aplicativos para ver as letras no Spotify </a> . </p> <p> Claro, você também pode usar um dos muitos sites de letras da internet, embora eles não sejam exibidos em tempo com a sua música do Spotify. </p>"}