{"title":"Twitter para rotular as contas pessoais de funcionários do governo","content":"<p> O Twitter em breve começará a colocar rótulos nas contas pessoais de funcionários do governo. Os rótulos devem ajudar os usuários a identificar facilmente qualquer pessoa associada ao governo. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Mais funcionários do governo receberão uma etiqueta no Twitter </h2> <p> De acordo com uma postagem em <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> o blog do Twitter </a> , a plataforma começará a rotular as contas pessoais de &quot;chefes de estado&quot; em 17 de fevereiro de 2021. Ela também afixará rótulos nas contas associadas à mídia afiliada ao estado. </p> <p> O Twitter também está expandindo o alcance de suas gravadoras para cobrir funcionários do governo em mais países. Esses locais incluem Canadá, Cuba, Equador, Egito, Alemanha, Honduras, Indonésia, Irã, Itália, Japão, Arábia Saudita, Sérvia, Espanha, Tailândia, Turquia e Emirados Árabes Unidos. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Crédito da imagem: Twitter </p> <p> A plataforma espera que esses rótulos ajudem os usuários a &quot;ter uma experiência mais informada no Twitter&quot; e também planeja ajustar o texto do rótulo para &quot;adicionar mais especificidade&quot; ao &quot;diferenciar indivíduos e instituições&quot;. </p> <p> A primeira onda de rótulos do Twitter para contas afiliadas ao governo foi lançada em agosto de 2020. Inicialmente, esses rótulos se aplicavam apenas aos funcionários associados aos cinco países do Conselho de Segurança das Nações Unidas e não incluíam as contas pessoais desses funcionários. </p> <p> Dito isso, esses rótulos não são um <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> golpe flagrante na desinformação </a> , mas eles ainda ajudarão os usuários a obter mais contexto sobre o que estão lendo e de quem está vindo. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> O Twitter só continuará expandindo seus rótulos </h2> <p> No final de sua postagem no blog, o Twitter observou que espera expandir seus rótulos para &quot;outros países com o tempo&quot;. O rótulo aparece como uma bandeira cinza claro no perfil de uma pessoa no Twitter e é provável que você o encontre com mais frequência nas próximas semanas. </p>"}