{"title":"Uma enorme atualização do Microsoft Edge está a caminho","content":"<p> A Microsoft está trabalhando muito para tornar seu navegador de internet, o Edge, o melhor que pode ser. Agora, a empresa está trazendo três recursos importantes para ele, e as coisas parecem otimistas para o futuro do Edge. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> O que a Microsoft planejou para o Edge </h2> <p> A grande atualização foi pega por <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows Latest </a> . Os três recursos estão programados para vir em uma grande atualização, então vale a pena manter seus olhos no Edge em um futuro próximo. </p> <p> Em primeiro lugar, o Microsoft Edge está obtendo suporte para widgets da web. Esses widgets são uma maneira prática de obter uma visão rápida de informações vitais ao longo do dia. A gigante do software quer experimentar widgets de todas as formas e tamanhos, mas decidiu começar com um widget de notícias para dar o pontapé inicial. </p> <p> Em seguida, o Microsoft Edge está recebendo um recurso de pesquisa de guia. Se isso parece familiar para você, é provável que tenha lido o <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> especulação inicial de Edge obtendo uma ferramenta de pesquisa de guias </a> . Felizmente, essa especulação se tornou realidade, e a Microsoft planeja trazer o recurso do Chrome para o Edge. </p> <p> Finalmente, você será capaz de gerenciar todas as suas extensões do Edge a partir de um único menu. Ele aparecerá como uma peça de quebra-cabeça na barra de tarefas do navegador e, quando você clicar nele, mostrará todas as extensões instaladas juntamente com uma maneira rápida de ativar e desativar cada uma. </p> <p> Não se sabe ao certo quando exatamente essa atualização será lançada, mas o Windows Latest a fixou para &quot;a próxima grande atualização&quot;. Como tal, não demorará muito até que o Microsoft Edge se torne uma escolha atraente para pessoas que procuram algo novo. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: a próxima grande novidade? </h2> <p> Por muito tempo, os navegadores da Microsoft foram considerados gerenciadores de download avançados para a instalação do Chrome ou Firefox. Desde que a Microsoft adotou uma base de código Chromium para seu navegador, no entanto, ele passou a ser motivo de chacota no mundo dos navegadores. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCounter </a> lista o Microsoft Edge como o segundo navegador do Windows mais usado nos Estados Unidos até o momento. Já sabíamos que o Firefox estava sendo deixado para trás pelo Edge, mas desde então, a diferença só aumentou. </p> <p> Agora, o Edge representa 5,25% da participação de mercado dos EUA, em comparação com os 3,35% que o Firefox possui. Ambos estão muito longe dos 45,83% do Chrome, mas é um começo. </p> <p> Portanto, se você já torceu o nariz para o navegador da Microsoft, agora é um bom momento para dar uma segunda chance. Quem sabe, você pode ser conquistado pelo melhor navegador da Microsoft de todos os tempos! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Levando o navegador ao limite </h2> <p> Se você nunca foi um fã dos navegadores da Microsoft, é uma boa hora para entrar e ver do que se trata. Uma grande atualização está em andamento e só vai ficar melhor a partir de agora. </p> <p> A Microsoft sabe que está em uma fórmula vencedora. Na verdade, a empresa informou recentemente que 600 milhões de pessoas em todo o mundo agora usam o Edge para navegar na web. </p> <p> <small> Crédito da imagem: DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}