{"title":"Você pode obter o novo Microsoft Teams Pro gratuitamente","content":"<p> Há pouco tempo, cobrimos um serviço de assinatura planejado para o Microsoft Teams chamado &quot;Teams Pro&quot;, que desbloqueará recursos adicionais para o software. No entanto, a Microsoft declarou oficialmente que algumas pessoas obterão o Teams Pro sem nenhum custo adicional aos seus planos atuais. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Declaração da Microsoft sobre assinaturas do Free Teams Pro </h2> <p> Caso você precise de um lembrete, já cobrimos esse tópico em nosso artigo sobre <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro adicionando webinars ao serviço </a> . </p> <p> Agora, um artigo de <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> sobre o mesmo assunto, desde então, recebeu uma declaração da Microsoft. A declaração é uma boa notícia para as pessoas preocupadas em pagar mais por webinars: </p> <blockquote> <p> Em 9 de fevereiro, publicamos uma postagem de MC sobre um novo plano de serviço do Teams Pro. Para esclarecer, não há alteração nas licenças de produtos existentes com a adição deste novo plano de serviço. Em vez disso, o plano de serviço será adicionado automaticamente às licenças Microsoft 365 e Office 365 E5 / E3 / A5 / A3 e Microsoft 365 Business Standard / Business Premium e permitirá que os usuários licenciados para esses SKUs recebam automaticamente os recursos implementados para Equipes em um futuro próximo. </p> </blockquote> <p> A Microsoft afirma que os administradores não precisam fazer nada para ativar esses novos recursos. Além disso, qualquer pessoa com uma licença compatível, conforme listado acima, obterá esses novos recursos sem custo adicional. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Obtendo mais pelo mesmo com o Microsoft Teams </h2> <p> A Microsoft está lançando um novo plano de assinatura do Teams Pro que desbloqueia webinars e muito mais, mas nem todos terão que pagar a mais por isso. Se você # se inscreveu em uma das licenças acima, pode esperar obter todos os recursos do Teams Pro gratuitamente. </p> <p> Isso não quer dizer que as pessoas sem o Teams Pro serão deixadas na sombra. Por exemplo, em breve todos terão acesso a um recurso útil de recapitulação do Microsoft Teams. </p> <p> <small> Crédito da imagem: Postmodern Studio / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}