{"title":"Verifique a versão do navegador do xCloud da Microsoft","content":"<p> Se você estava esperando ansiosamente por notícias sobre a porta do navegador xCloud, então hoje é o seu dia de sorte, porque você pode dar uma olhada em como ele realmente se parece. </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> Testadores revelam capturas de tela do navegador xCloud </h2> <p> O xCloud está atualmente disponível em uma variedade de dispositivos, mas ainda estamos esperando a Microsoft lançar oficialmente a versão do navegador. </p> <p> Os detalhes são escassos ... até agora. De acordo com um relatório de <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> The Verge </a> , &quot;fontes familiarizadas com os planos da Microsoft para o Xbox&quot; afirmam que &quot;os funcionários agora estão testando uma versão web do xCloud antes de uma visualização pública&quot;. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Aqui está uma primeira olhada no xCloud da Microsoft para a web <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> - The Verge (@verge) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> 15 de fevereiro de 2021 </a></blockquote>  <p> Não se esqueça, essas são apenas imagens de testadores, o que significa que - embora seja improvável - a Microsoft poderia mudar totalmente a aparência da versão do navegador xCloud. </p> <p> Pelas capturas de tela, parece que o xCloud está configurado de forma muito semelhante à versão Android, que está disponível em smartphones e tablets. </p> <p> Você pode ver os jogos adicionados recentemente no topo da imagem, seguido por uma seção &quot;Em breve&quot;. Abaixo disso, você tem várias opções para selecionar um gênero de jogo de sua escolha, com a biblioteca de jogos xCloud completa disponível na parte inferior da página. </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> Como você acessa o xCloud no seu navegador? </h2> <p> Atualmente, você não pode. A versão pública da porta da web do xCloud ainda não está disponível. O que significa que você deve esperar um pouco mais se quiser acessar o xCloud através do seu navegador. Supostamente, a Microsoft tem planos de revelar o serviço publicamente no segundo trimestre de 2021. </p> <p> Até então, você terá que encontrar outros métodos de acesso ao xCloud. Atualmente, você só pode acessar o serviço de jogos em nuvem em dispositivos Android (você precisa da versão do navegador para jogar no iOS, graças a <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> uma briga entre a Apple e a Microsoft </a> ) </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> Você pode acessar os jogos do xCloud de outra maneira? </h2> <p> Bem, sim e não. Você não pode acessar nenhum título no xCloud, por assim dizer. A menos que você use um dispositivo Android e o aplicativo Game Pass oficial para fazer isso. </p> <p> No entanto, os jogos disponíveis no serviço de jogos em nuvem da Microsoft estão todos disponíveis no Game Pass. Na verdade, você obtém acesso ao xCloud como parte de uma assinatura do Game Pass Ultimate. Portanto, você ainda pode acessar esses jogos por meio do Xbox ou de um PC com Windows. </p> <p> Então, em uma palavra, sim. Você pode acessar esses jogos de outra maneira. Só não estou usando o xCloud, a menos que você tenha acesso à versão do Android. </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud: em breve para um dispositivo iOS perto de você </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> Você não deve ter que esperar muito até obter a plataforma de jogos em nuvem da Microsoft. Assim que o xCloud tiver passado pelos testes, a Microsoft fará todas as alterações necessárias antes de permitir que todos nós dêmos uma olhada e, esperançosamente, não muito depois, uma tentativa também. </p>"}