{"title":"Você pode obter o Netflix no Nintendo Switch?","content":"<p> Parece que você pode obter o Netflix em todas as plataformas. Quer seja sua TV, decodificador ou telefone, o serviço de streaming mais popular do mundo está disponível onde você quiser. Ou é? </p> <p> Se você possui o Nintendo Switch, deve estar se perguntando se pode assistir ao Netflix nele. Vamos descobrir... </p> <h2 id=\"can-you-watch-netflix-on-the-nintendo-switch\"> Você consegue assistir ao Netflix no Nintendo Switch? </h2> <p> <a href=\"https://www.makeuseof.com/nintendo-switch-streaming-services/\" target=\"_blank\" rel=\"nofollow noopener\"> O Nintendo Switch suporta alguns serviços de streaming </a> mas o Netflix não é um deles. Pelo menos oficialmente. </p> <p> Isso significa que você não pode entrar no eShop e baixar um aplicativo Netflix. Na verdade, no momento em que este artigo foi escrito, os serviços de streaming que o Nintendo Switch oferece por meio do eShop estavam limitados a Hulu, YouTube e Funimation. </p> <p> Você também não pode usar o navegador da web do console para assistir ao Netflix. Não vai funcionar. </p> <p> No entanto, você pode instalar o Android em seu Nintendo Switch, e o Netflix está disponível no Android. Este é um processo complicado que não é suportado pela Nintendo. Isso anulará sua garantia e só deve ser realizado por usuários que entendem o processo e as consequências. </p> <p> Para a maioria das pessoas, é melhor manter a esperança de que a Netflix oferecerá suporte oficial ao Nintendo Switch no futuro. </p> <p> Em uma entrevista de 2017 com <a href=\"https://www.washingtonpost.com/news/the-switch/wp/2017/03/08/nintendos-u-s-ceo-responds-to-our-biggest-gripes-with-the-switch/\" target=\"_blank\" rel=\"nofollow noopener\"> The Washington Post </a> , O então presidente da Nintendo of America, Reggie Fils-Aime, disse que a Nintendo estava conversando com a Netflix - claro, muito tempo se passou desde então e nada deu certo. </p> <p> </p> <h2 id=\"can-you-watch-netflix-on-other-nintendo-consoles\"> Você pode assistir Netflix em outros consoles Nintendo? </h2> <p> Tanto o Nintendo Wii quanto o Nintendo Wii U tinham aplicativos Netflix dedicados no passado. </p> <p> No entanto, a partir de 31 de dezembro de 2020, o aplicativo Netflix não estava mais disponível para download de novos usuários na eShop. </p> <p> Em 30 de junho de 2021, o aplicativo Netflix será fechado completamente para os usuários existentes. Nesse ponto, nenhum console Nintendo oferecerá suporte ao Netflix. </p> <p> Por enquanto, você só terá que aproveitar as opções limitadas de streaming de vídeo que o Switch suporta e assistir ao Netflix em outro dispositivo. </p>"}