{"title":"10 lucruri pe care nu le știați că Google Docs ar putea face","content":"<p> Google Doc poate părea de bază la suprafață, dar instrumentul de productivitate în cloud are multe funcții trecute cu vederea care vă pot ajuta să faceți mai mult la locul de muncă. </p> <p> În acest articol, vom analiza mai multe funcții Google Doc despre care probabil nu știați și cum le puteți utiliza pentru a economisi timp la crearea de conținut. </p> <p> Vă rugăm să rețineți că aceste caracteristici sunt în mare parte accesibile pe versiunea desktop a instrumentului Google Docs. Vor fi indicate cele care pot fi utilizate și pe versiunea mobilă. </p> <h2 id=\"voice-typing\"> 1. Tastare vocală </h2> <p> Pentru a utiliza funcția de tastare vocală, deschideți un document și faceți clic pe <strong> Instrumente </strong> din bara de meniu din partea de sus a paginii. Selectați <strong> Tastarea vocală </strong> din meniul derulant. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> Pe ecran va apărea un microfon, cu un meniu de limbă în care puteți selecta limba preferată de vorbire. Când sunteți gata să rostiți textul, faceți clic pe microfon sau apăsați <strong> Cmd + Shift + S </strong> (dacă utilizați un Mac) sau <strong> Ctrl + Shift + S </strong> (dacă utilizați un computer Windows) pentru a începe înregistrarea. </p> <p> Pentru a adăuga punctuația între text, spuneți numele semnului de punctuație pe care doriți să îl adăugați, cum ar fi „punct”, „virgulă” sau „semn de întrebare”. Puteți oferi instrucțiuni de formatare precum „linie nouă” sau „paragraf nou” sau „opriți ascultarea” dacă doriți să faceți o pauză de la tastarea vocală și puteți „relua” când sunteți gata să continuați. </p> <p> Căutați comenzile avansate de editare din aceasta <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> lista de comenzi </a> pe pagina de asistență Google. </p> <p> De asemenea, puteți utiliza această caracteristică pentru transcrierea oricărui sunet. Pur și simplu redați sunetul (de pe telefonul dvs. sau de pe orice alt dispozitiv) în textul vocal și ar trebui să îl scrieți pentru dvs. Este posibil să trebuiască să faceți câteva modificări, dar ați fi economisit mult timp. </p> <p> </p> <p> Funcția de tastare vocală este disponibilă numai pe desktop, dar funcționează numai pe browserul Chrome. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Editare offline </h2> <p> Mulți oameni adoră Google Docs pentru funcția de salvare instantanee în cloud, dar poate fi incomod dacă nu aveți acces la internet pentru o vreme. Vestea bună este că puteți accesa și edita fișierele dvs. offline. </p> <p> Această funcție este disponibilă numai pe Google Chrome și ar trebui să instalați și să activați <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Extensie Chrome Google Docs Offline </a> . De asemenea, asigurați-vă că nu navigați în modul privat. </p> <p> Această caracteristică trebuie să fie pusă în funcțiune când sunteți online, dar odată ce ați terminat, puteți scrie și edita text offline, iar apoi vor fi salvate în cloud atunci când veți avea acces la internet. Iată cum. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> Pentru a face posibil să <strong> deschideți și salvați fișierele Google Docs offline </strong> , urma <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> aceste instrucțiuni </a> . Această funcție este disponibilă pe PC-uri, iOS și Android. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Urmăriți / restaurați istoricul versiunilor documentului </h2> <p> Dacă lucrați la un document singur sau cu alții, puteți urmări modificările aduse documentului utilizând funcția Istoric versiuni. </p> <p> De asemenea, puteți restabili documentul la o versiune anterioară temporar sau permanent; o caracteristică care poate fi un instrument de salvare dacă ștergeți accidental părți din documentul dvs. și nu puteți utiliza fișierul <strong> Anula </strong> pentru a le restabili. </p> <p> Pentru a utiliza caracteristica istoric versiuni, faceți clic pe <strong> Fişier </strong> din bara de meniu și selectați <strong> Versiunea istorică </strong> din meniul derulant. Veți vedea că puteți numi și o versiune, astfel încât să o puteți utiliza pentru a urmări modificările continue din document, mai ales dacă alți utilizatori fac modificări la același document. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Această caracteristică este disponibilă numai pe desktop. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Mod de sugerare și revizuire </h2> <p> Deși este minunat să colaborezi cu alții și să editezi un document împreună, poate fi dificil (și dezordonat) să țineți evidența modificărilor pe care le-a făcut fiecare persoană. </p> <p> Funcția de sugestie vă permite să sugerați modificări pur și simplu dacă nu doriți să modificați documentul cu totul. Sugestiile dvs. vor apărea la editor ca comentarii pe bara laterală, iar editorul poate face modificări instantanee acceptând sugestia. De asemenea, puteți continua subiecte de conversație cu <strong> Răspuns </strong> , astfel încât să puteți da și primi feedback direct pe pagina documentului fără a fi nevoie să trimiteți e-mailuri înainte și înapoi. </p> <p> Pentru a sugera modificări, faceți clic pe pictograma creion pentru modul Editare din colțul din dreapta sus al documentului deschis, apoi selectați <strong> Sugerând </strong> . </p> <p> Pentru a vizualiza documentul fără sugestii, faceți clic pe <strong> Vizualizare </strong> . Veți putea citi fără ferestre și să comentați ferestre pop-up. </p> <p> Pentru a economisi timp, puteți accepta sau respinge toate sugestiile simultan. Clic <strong> Instrumente </strong> , apoi selectați <strong> Examinați modificările sugerate </strong> . Clic <strong> Accepta toate </strong> sau <strong> Respingeți toate </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Această caracteristică este disponibilă numai pe desktop. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Adăugați fonturi </h2> <p> Dacă vreți vreodată <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> stilizează-ți textul </a> pentru a vă potrivi mesajului, puteți face acest lucru și cu Google Docs. În afară de cele 24 de fonturi implicite care sunt deja programate în instrumentul Google Docs, puteți adăuga mai multe fonturi interesante la alegere pentru a vă amplifica vizual textul. </p> <p> Pentru a adăuga fonturi, faceți clic pe <strong> Fonturi </strong> din bara de meniu și selectați <strong> Mai multe fonturi </strong> . Selectați câte fonturi doriți din colecția furnizată. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Această caracteristică este disponibilă numai pe desktop. </p> <p> </p> <h2 id=\"compare-documents\"> 6. Comparați documentele </h2> <p> Aceasta este o altă caracteristică pe care o puteți utiliza pentru a urmări modificările aduse unui document de către dvs. sau de către un colaborator. Este util în special pentru documentele mari și, după cum sugerează și numele, puteți compara două documente pentru a vedea diferențele dintre ele. </p> <p> Pentru a utiliza această caracteristică, deschideți documentul de bază pentru care doriți să faceți o comparație, apoi faceți clic pe <strong> Instrumente </strong> și selectați <strong> Comparați documente </strong> . </p> <p> În caseta de dialog care apare, selectați documentul cu care doriți să îl comparați din Drive și faceți clic <strong> Comparaţie </strong> . În <strong> Atribuiți diferențele pentru </strong> câmp, introduceți numele colaboratorului care va fi autorul modificărilor sugerate în documentul final. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> Diferențele se vor arăta la fel ca în <strong> Sugerând </strong> modul pe care l-am discutat mai sus și puteți accepta sau respinge modificările. </p> <p> Această caracteristică este disponibilă numai pe desktop. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Găsiți și înlocuiți </h2> <p> Dacă vreodată trebuie să înlocuiți mai multe instanțe ale unei erori în textul dvs., Google Docs vă face mai ușor să o faceți cu funcția Găsiți și înlocuiți. </p> <p> Pentru utilizatorii care sunt familiarizați cu funcția Găsiți și înlocuiți din Microsoft Word, aceasta funcționează la fel. </p> <p> Pentru a găsi un anumit cuvânt sau frază în documentul dvs., utilizați comanda rapidă <strong> Ctrl + F </strong> pe un PC Windows sau <strong> Comandă + F </strong> pe un Mac. Introduceți cuvântul în câmpul „Găsiți în document”. </p> <p> Pentru a înlocui textul găsit, faceți clic pe cele trei puncte din partea dreaptă și selectați <strong> Găsiți și înlocuiți </strong> . </p> <p> Apoi, introduceți textul în <strong> Găsi </strong> și textul de înlocuire din <strong> Înlocui cu </strong> camp. Parcurgeți instanțele de text cu cursorul în sus și în jos și faceți clic <strong> A inlocui </strong> pentru a le schimba individual. Sau faceți clic <strong> Înlocuiește-le pe toate </strong> pentru a înlocui tot textul selectat simultan. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Folosiți un dicționar </h2> <p> Pentru a vă ajuta să vă concentrați și să evitați să comutați între file atunci când căutați sensul unui cuvânt, Google Docs are un dicționar în aplicație. </p> <p> Când tastați și trebuie să căutați un cuvânt, evidențiați cuvântul, apoi faceți clic dreapta și selectați <strong> Defini </strong> din meniu. Instrumentul Dicționar va căuta definiția cuvântului pe internet și va apărea în partea dreaptă a ecranului. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Adăugați accente lingvistice </h2> <p> Spuneți adio memorării comenzilor rapide de la tastatură sau copiați / lipiți litere accentuate din alte documente. </p> <p> Pentru a utiliza litere accentuate, va trebui să descărcați <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> programul de completare „Accente ușoare” </a> . Vă permite să inserați accente pentru 20 de limbi diferite direct dintr-o bară laterală din document. </p> <p> Descărcați programul de completare Google Doc deschizând fișierul <strong> Instrumente </strong> meniu, apoi faceți clic pe <strong> Suplimente </strong> și <strong> Obțineți suplimente </strong> . În caseta Google Marketplace care apare, căutați <strong> Accente ușoare </strong> și faceți clic pe butonul albastru de instalare pentru al adăuga la colecția dvs. de programe Google Docs. </p> <p> După instalare, faceți clic pe <strong> Suplimente </strong> meniul pentru a selecta suplimentul Easy Accents și a începe să adăugați accente corecte pentru toate cuvintele străine. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Acest supliment este disponibil numai pe desktop, dar tastaturile mobile acceptă de obicei accentele lingvistice, astfel încât veți putea scrie text cu semne de accent pe telefonul dvs. fără supliment. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Creați comenzi rapide personalizate </h2> <p> Majoritatea oamenilor sunt familiarizați cu <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Comenzi rapide Microsoft Word </a> , dar puteți crea propriile comenzi rapide în Google Docs. Pentru a crea comenzi rapide personalizate, faceți clic pe <strong> Instrumente&gt; Preferințe&gt; Înlocuire. </strong> Veți descoperi că există deja câteva fracțiuni și comenzi rapide pentru simboluri (cum ar fi schimbarea 3/4 în ¾), dar nu ezitați să adăugați unele dintre ale dvs. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Această caracteristică este disponibilă numai pe desktop. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Faceți mai multe cu Google Docs </h2> <p> Acum că ați învățat aceste instrumente Google Docs, le puteți folosi în timp ce creați următorul document. Sperăm că vă ușurează lucrurile! </p>"}