{"title":"5 lucruri care te pot interzice permanent de pe Facebook","content":"<p> Facebook nu este la fel de cunoscut ca Twitter pentru eliminarea conturilor. Cu toate acestea, există câteva infracțiuni interzise la care Facebook răspunde cu mai mult decât o etichetă de avertizare. </p> <p> Aici, explorăm termenii și condițiile Facebook și unde compania trasează linia, uitându-ne la exemple istorice de utilizatori pe care Facebook le-a „decalat” pentru comportamentul lor. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> Poziția Facebook asupra interdicțiilor permanente </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> Spre deosebire de alte site-uri de socializare, Facebook nu listează multe infracțiuni care au ca rezultat o interdicție permanentă. În schimb, citează infracțiunile repetate, mai degrabă decât gravitatea infracțiunilor ca factor principal. Ca rezultat, în teorie, orice încălcare Facebook repetată suficient de des poate duce la blocarea profilului. </p> <p> Cu toate acestea, puține activități au ca rezultat o interdicție completă și Facebook este surprinzător de lax cu unele activități ilegale recunoscute. De exemplu, vânzarea „bunurilor reglementate”, cum ar fi armele și marijuana, nu este permisă pe piața Facebook, dar Facebook nu o listează ca o infracțiune interzisă. </p> <p> Facebook preferă să semnaleze sau să elimine conținutul post-cu-post, spre deosebire de eliminarea profilurilor. Cu toate acestea, există excepții. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Utilizarea greșită a instrumentelor și a datelor </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> Termenii și condițiile Facebook prevăd trei infracțiuni interzise. Prima este o colecție de acțiuni, pe care restul acestui articol le analizează mai detaliat. Al doilea și al treilea sunt mai specifice și au legătură cu utilizarea abuzivă a instrumentelor și datelor Facebook. </p> <p> Acest termen comun de serviciu interzice accesarea și utilizarea unor părți ale site-ului care ar trebui rezervate dezvoltatorilor. De asemenea, interzice utilizarea instrumentelor de site-uri publice într-un mod deliberat rău intenționat, cum ar fi utilizarea Facebook pentru a răspândi viruși și programe malware. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Amenințări la adresa siguranței publice </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Unul dintre singurele cazuri în care Facebook spune că dezactivează conturile este cel al „riscului real de vătămare fizică sau amenințări directe la adresa siguranței publice”. Facebook elimină, de asemenea, profilurile care „proclamă o misiune violentă sau sunt implicate în violență”. </p> <p> Acesta a fost motivul pentru interzicerea pe termen nelimitat a președintelui de atunci, Donald Trump, după o revoltă la Capitolul SUA în ianuarie 2021. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Asocierea cu grupuri violente </h2> <p> Facebook și-a luat poziția asupra conținutului dăunător și amenințător la nivel asociativ în octombrie 2020, când a eliminat profilurile asociate conspirației QAnon, chiar dacă profilurile individuale nu aveau conținut violent. Grupul conspirativ a condus la episoade violente din 2016. </p> <p> </p> <p> Facebook a interzis, de asemenea, grupul muzical Trapt pentru postările care fac referire la grupul de ură Proud Boys. Organizația politică extremistă a fost implicată în violența la nivel de stradă din SUA și Canada din 2016. </p> <p> De asemenea, compania își rezervă dreptul de a dezactiva conturile dacă aceste conturi prezintă un risc legal pentru Facebook. În plus, Facebook este mai ferm decât alte platforme de socializare cu privire la lucrul cu organizațiile de aplicare a legii și de sensibilizare atunci când întâmpină acest tip de conținut. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Compromiterea securității altor conturi </h2> <p> O altă dintre rarele infracțiuni interzise pe listele Facebook este „compromiterea securității altor conturi și a serviciilor noastre”. Compromiterea securității serviciilor Facebook seamănă mult cu malware-ul și abuzul menționate în condițiile de furnizare a serviciilor. Cu toate acestea, ideea de a compromite securitatea altor conturi indică spre doxxing. </p> <p> </p> <p> Doxxing este lansarea informațiilor sensibile din lumea reală ale unui utilizator de rețele sociale, inclusiv adresa de acasă sau de la serviciu, numărul de telefon privat sau locația fizică în timp real. Această practică se face adesea cu intenția de a provoca rău acelei persoane. </p> <p> </p> <h2 id=\"misinformation\"> 5. Dezinformare </h2> <p> </p> <p> Ghidurile oficiale ale Facebook spun că Facebook nu elimină dezinformarea, alegând în schimb să o eticheteze astfel încât să poată contribui la dialoguri fără a induce în eroare pe alții. Cu toate acestea, un număr de deținători de cont suspendate spun că eliminarea lor a rezultat din ceea ce Facebook numește „Știri false”. </p> <p> Există o serie de motive pentru care acest lucru se întâmplă. În unele cazuri, Facebook stabilește că știrile false sunt dăunătoare și sănătății personale sau publice. </p> <p> Acesta a fost <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> Explicația Facebook pentru eliminarea teoreticianului conspirației David Icke </a> pentru a susține, printre altele, că internetul 5G provoacă Covid-19. Facebook a mai spus că Icke a „încălcat în mod repetat” politicile. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Politicile Facebook și contul dvs. </h2> <p> În cea mai mare parte, Facebook nu are probleme cu dvs. atâta timp cât nu folosiți greșit platforma pentru a provoca daune altora. Cu toate acestea, există anumite probleme în care compania trasează o linie în nisip. </p> <p> Dacă nu respectați acești termeni și condiții, ar trebui să vă feriți de o interdicție permanentă pe Facebook. </p>"}