{"title":"8 moduri în care rețelele sociale vă pot ajuta să învățați o limbă nouă","content":"<p> Mai aveți coșmaruri cu manualele spaniole și cursuri de franceză slab predate pe care le-ați primit la școală? Nu te teme. Datorită internetului, învățarea unei noi limbi în aceste zile poate fi atât distractivă, cât și accesibilă. </p> <p> Rețelele sociale, în special, au ajutat la conectarea a milioane de cursanți de limbi străine din întreaga lume. Indiferent dacă învățați ceva popular, cum ar fi limba germană sau mai obscur, cum ar fi feroezul, veți găsi o gamă largă de resurse pentru a vă ajuta în călătorie. </p> <p> Iată câteva modalități prin care puteți utiliza rețelele sociale pentru a vă alege următoarea limbă străină. </p> <h2 id=\"join-facebook-groups\"> 1. Alăturați-vă grupurilor Facebook </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> Pe Facebook, veți găsi grupuri pentru aproape toate limbile imaginabile. Veți găsi comunități de expatriți nou-mutați care doresc să îmbunătățească abilitățile, precum și grupuri pentru cursanți din întreaga lume. Pentru a profita la maximum de experiența dvs., ar trebui să vă alăturați ambelor. </p> <p> Pentru a găsi grupurile Facebook potrivite, puteți face o căutare online simplă. Alternativ, puteți găsi ceea ce căutați de pe Facebook. Pentru aceasta, accesați Grupuri și căutați limba dvs. Veți obține apoi o listă a comunităților care corespund acestor nevoi. </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> Dacă înveți la o școală de limbă locală, îți poți crea propriul grup pentru a te conecta cu colegii tăi. Pentru a face acest lucru, <strong> Accesați Grupuri&gt; Creați un grup nou </strong> . Apoi puteți edita setările și puteți începe să invitați membri. </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2. Folosiți Reddit </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit este un popular forum online, care este o mină de aur pentru cursanții de limbi străine. Veți găsi subreditări atât pentru limbi specifice, cât și pentru învățarea generală a limbilor străine. </p> <p> Când vă alăturați unui subredit, veți descoperi o mulțime de sfaturi și sugestii utile de la alți cursanți care v-au parcurs calea. Veți găsi, de asemenea, o mulțime de meme cu care vă veți lega fără îndoială. </p> <p> Pentru a găsi un subredit, accesați bara de căutare din partea de sus și tastați în limba dvs. După ce rezultatele s-au încărcat, merită să vă alăturați atât grupurilor specifice învățării, cât și celor culturale, pentru a afla mai multe despre obiceiurile locale. </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. Conectați-vă cu difuzoare native </h2> <p> Cel mai bun mod de a învăța rapid o limbă este vorbind cu oameni care o vorbesc deja. Și rețelele sociale pot fi un loc minunat pentru a găsi aceste difuzoare. S-ar putea să fie nevoie să contactați câțiva oameni, dar în cele din urmă, veți găsi pe cineva dispus să aloce ceva timp pentru a vă ajuta. </p> <p> Când vă conectați cu vorbitori nativi pe social media, concentrați-vă mai întâi pe construirea unei prietenii. Dacă vă aflați în același oraș cu ei, oferiți-vă să vă întâlniți și să plătiți pentru o cafea. Pentru cei aflați mai departe, oferiți-i să-i ajutați să învețe una dintre limbile pe care le vorbiți deja. </p> <p> Pașii pentru aceștia sunt similari pe fiecare platformă de socializare. Pe Instagram sau Twitter, urmați-le și trimiteți un mesaj (dacă setările lor de confidențialitate permit acest lucru). Puteți adopta o abordare similară pe Facebook, deși unele persoane pot fi mai puțin dispuse să accepte cererile de prietenie de la cei pe care nu-i cunosc. </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. Creați-vă propriul conținut social media </h2> <p> Nu trebuie doar să consumi pe rețelele sociale pentru a te ajuta să înveți o limbă. Încercați să creați și propriile dvs. postări. A face acest lucru nu numai că vă va ajuta să vă exersați vorbirea și scrierea; s-ar putea să descoperiți și noi utilizatori cu care să vă exersați. </p> <p> Aveți o mulțime de opțiuni atunci când vine vorba de crearea de conținut. Pe Twitter, puteți participa la conversații sau puteți scrie unele dintre tweet-urile dvs. în limba dvs. țintă. Cu Instagram, puteți scrie subtitrări, puteți crea grafică și vă puteți înregistra vorbind. </p> <p> Când vă creați propriul conținut social media, veți primi și feedback de la vorbitori nativi. În afară de aceasta, vă puteți dezvolta portofoliul și puteți învăța câteva noi abilități utile. </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. Setați aplicațiile la limba pe care o învățați </h2> <p> Schimbarea setărilor telefonului este o modalitate ușoară de a vă face să gândiți în limba dvs. țintă și să o citiți confortabil. De asemenea, veți adăuga zeci de cuvinte noi în vocabular. </p> <p> </p> <p> Toate marile rețele de socializare au setări în aplicație, unde vă puteți schimba limba. Pe Instagram, de exemplu, accesați <strong> Cont&gt; Limbă </strong> . Veți vedea apoi o listă derulantă a tuturor limbilor pe care le puteți utiliza. </p> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (2 imagini) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> Extinde <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> De asemenea, puteți modifica toate limbile aplicațiilor dvs. simultan folosind setările telefonului. Mergi la <strong> Setări </strong> &gt; <strong> General&gt; Limbă și regiune </strong> . De acolo, veți vedea o listă cu fiecare limbă disponibilă. Rețineți că pentru limbile mai mici, este posibil să nu vă puteți optimiza contul. </p> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (2 imagini) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> Extinde <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. Profitați la maximum de Hashtag-uri </h2> <p> Utilizarea și căutarea cu hashtag-uri este un mod puternic de a găsi mai mulți utilizatori în limba pe care o înveți. Utilizând o varietate, puteți să vă conectați și să consumați conținutul vorbitorilor nativi și al altor cursanți. </p> <p> Pentru a găsi tipul de conținut pe care îl căutați, gândiți-vă la ce vor folosi ceilalți cursanți. De asemenea, puteți găsi conținutul vorbitorilor nativi căutând subiecte existente în orice țară. Adesea, le puteți găsi în postări și articole în tendințe. </p> <p> Pentru a căuta hashtaguri, utilizați funcția de căutare pe oricare dintre aplicațiile de socializare pe care le utilizați. De asemenea, puteți să faceți clic pe postările care le utilizează și să găsiți toate rezultatele prezentate. </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. Urmați conturile în limba dvs. țintă </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> Fiecare cont interesant pe care îl urmăriți în limba engleză are, de asemenea, un echivalent în limba dvs. țintă. Acestea ar putea fi publicații masive sau ar putea fi vorbitori de zi cu zi, care se simt mai confortabil creând muncă în limba lor de origine. </p> <p> </p> <p> De asemenea, ar trebui să vedeți dacă revistele dvs. preferate, echipele sportive și artiștii muzicali au conturi în limba dvs. țintă. Multe dintre cele mai mari cluburi sportive din lume, de exemplu, au conturi în engleză, spaniolă și multe altele. </p> <p> Când urmăriți conturile în limba pe care doriți să o învățați, o regulă bună este să le urmați doar dacă găsiți conținutul lor în limba engleză la fel de interesant. În caz contrar, veți ajunge să le ignorați și să le urmăriți din nou mai târziu. </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. Urmați aplicațiile de învățare a limbilor străine pe rețelele sociale </h2> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (2 imagini) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> Extinde <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> Aplicațiile de învățare a limbilor străine au deseori și profiluri active de social media. Acestea sunt minunate pentru a alege sfaturi generale și pentru a se referi la luptele comune cu care se confruntă toată lumea - indiferent dacă învață norvegiană sau japoneză. </p> <p> Unele conturi demne de urmat sunt Babbel, Busuu și Duolingo. </p> <p> Totuși, nu trebuie doar să utilizați aceste aplicații pentru consum. Simțiți-vă liber să adăugați gândurile în comentarii. S-ar putea chiar să-ți faci prieteni noi, chiar dacă învață o limbă complet diferită de tine. </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> Faceți din învățare o limbă distractivă cu rețelele sociale </h2> <p> Deci, iată-l. Acum aveți mai multă idee despre utilizarea rețelelor sociale pentru a vă face distractivă călătoria de învățare a limbilor străine. Deși munca manuală este încă importantă, nu ar trebui să fie singura dvs. opțiune. </p> <p> Chiar dacă nu puteți optimiza aplicația în limba dvs. țintă, veți găsi totuși o mulțime de vorbitori nativi și colegi de învățătură cu care să vă conectați. </p> <p> Cheia învățării unei limbi prin intermediul rețelelor de socializare este atât implicarea, cât și consumarea. Când o veți face, veți găsi experiența dvs. mai satisfăcătoare și veți primi cuvinte pe care manualele nu v-au învățat-o niciodată. </p>"}