{"title":"Apple remediază o eroare de instalare macOS Big Sur care ar putea duce la pierderea datelor","content":"<p> Apple a remediat o eroare critică în programul de instalare macOS Big Sur, care obișnuia să lanseze un mesaj de eroare atunci când încerca să actualizeze un Mac fără spațiul de stocare necesar disponibil. </p> <p> O actualizare macOS Big Sur 11.2.1 revizuită, disponibilă acum în <a href=\"https://apps.apple.com/app/macos-big-sur/id1526878132?mt=12\" target=\"_blank\" rel=\"nofollow noopener\"> Mac App Store </a> , Verifică corect dacă aveți suficient spațiu liber înainte de începerea instalării, a spus dl Macintosh <a href=\"https://twitter.com/ClassicII_MrMac/status/1361428354306633728\" target=\"_blank\" rel=\"nofollow noopener\"> Stare de nervozitate </a> . </p> <p> macOS Big Sur necesită 35 gigaocteți de spațiu de stocare liber pe discul de pornire al computerului, cu excepția instalatorului de 13 gigaocteți în sine. </p> <p> Acest lucru nu ar fi putut veni mai devreme, deoarece una dintre consecințele instalatorului defect este pierderea potențială a datelor. Pentru persoanele care nu și-au dezvoltat un obicei obișnuit <a href=\"https://www.makeuseof.com/how-to-back-up-mac/\" target=\"_blank\" rel=\"nofollow noopener\"> făcând backup pentru Mac-ul lor cu Time Machine </a> , acest bug destul de simplu ar putea avea consecințe teribile. </p> <h2 id=\"how-to-install-the-new-update\"> Cum se instalează noua actualizare </h2> <p> Noua actualizare este disponibilă prin <strong> Preferințe sistem&gt; Actualizare software </strong> pe Mac. Dacă sunt disponibile actualizări, apăsând butonul „Actualizați acum” le veți instala. Este posibil să vi se solicite să introduceți parola de administrator. </p> <p> Nu veți vedea actualizarea dacă versiunea revizuită de macOS Big Sur 11.2.1 este deja instalată pe computer. Programul de instalare revizuit poartă un număr de versiune &quot;20D75&quot;. Pentru a vedea numărul de compilare al software-ului macOS Big Sur instalat pe Mac, faceți clic pe meniul Apple și alegeți opțiunea etichetată „Despre acest Mac”. </p> <p> </p> <p> Cu fereastra Despre acest Mac deschisă, faceți clic pe fila „Prezentare generală”. Veți vedea numele software-ului sistemului de operare macOS pe computerul dvs., urmat de numărul versiunii sale. Pentru a dezvălui și numărul de compilare, faceți clic pe numărul versiunii. </p> <p> Puteți vedea care versiune de macOS este cea mai recentă într-un document de asistență <a href=\"https://support.apple.com/HT201260\" target=\"_blank\" rel=\"nofollow noopener\"> Site-ul Apple </a> . </p> <p> </p> <h2 id=\"big-sur-s-broken-free-space-check\"> Verificarea spațiului liber a lui Big Sur </h2> <p> Problema a ieșit la iveală recent datorită domnului Macintosh, care inițial a raportat problema. Publicația a descoperit că actualizarea Big Sur va fi descărcată fără sughiț, dar va refuza să înceapă deoarece „A apărut o eroare la pregătirea actualizării software-ului”. </p> <p> Problema a fost rezolvată până la o eroare în verificarea spațiului liber a lui Big Sur. Domnul Macintosh spune că oamenii s-au plâns de acest lucru de când a apărut prima versiune publică a macOS Big Sur în noiembrie 2020. După ce publicația a alertat Apple de această problemă, compania s-a mutat rapid pentru a înăbușa bug-ul urât. </p> <p> </p> <p> „Actualizarea va începe chiar dacă mai aveți doar 1% din spațiul liber și va eșua,” <a href=\"https://mrmacintosh.com/big-sur-upgrade-not-enough-hd-space-serious-issue-possible-data-loss/\" target=\"_blank\" rel=\"nofollow noopener\"> bara </a> explică. Și cu unitatea de pornire aproape 100% plină, programul de instalare ar rămâne blocat într-o buclă de boot nesfârșită care încearcă să termine procedura de instalare. </p> <p> „Acest lucru nu vă permite să vă accesați datele”, a avertizat domnul Macintosh. </p> <p> Singura modalitate de remediere a necesității ștergerea și reinstalarea software-ului macOS. Însă, odată cu actualizarea revizuită live în Mac App Store, proprietarii de Mac-uri își pot desfășura viața de zi cu zi fără să se îngrijoreze dacă actualizarea la Big Sur ar putea șterge discul de pornire curat. </p>"}