{"title":"Browserul Edge Microsoft a fost gazda emulatoarelor secrete de jocuri Nintendo","content":"<p> Microsoft a eliminat o serie de emulatoare de jocuri ilegale care se ascundeau în magazinul său de extensii de browser Microsoft Edge. Magazinul de extensii Microsoft Edge găzduia zeci de emulatoare, care le-au permis utilizatorilor să joace mai multe jocuri iconice, dintre care niciunul nu a fost postat legal în magazin. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft elimină emulatoarele ilegale de extensii Edge </h2> <p> Urmărind pe magazinul de extensii Microsoft Edge au fost unele dintre cele mai iconice jocuri din toate timpurile, inclusiv Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2 și chiar Minecraft. Fiecare joc a fost lansat în browser într-o fereastră de emulator și le-a permis utilizatorilor să joace integral fiecare titlu. </p> <p> Cu toate acestea, niciunul dintre titlurile clasice nu enumera dezvoltatorii oficiali de jocuri, cum ar fi Nintendo, Sega, Atari și da - chiar și Microsoft. Numele dezvoltatorilor enumerați includeau Gamelands, Kday și StayReal, toate fiind complet fictive și nu au legături cu dezvoltatorii originali. </p> <p> În mod ciudat, contul oficial de Twitter Microsoft Edge Development, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , postat despre emulatoare, apărând pentru a promova jocurile disponibile în magazinul de extensii de browser. Nu am prins tweet-ul original care promovează emulatoarele, dar o copie este disponibilă prin intermediul <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Resetera </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> Emulatorii sunt ilegali? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Emulatoarele vă permit să rulați diferite programe </a> pe calculatorul tau. De asemenea, puteți utiliza un emulator pentru a juca jocuri vechi. </p> <p> În timp ce emulatoarele în sine nu sunt ilegale, descărcarea conținutului drepturilor de autor pentru a fi redat pe un emulator este. Tweetul din contul oficial Microsoft Edge Development a fost o mișcare ciudată, deoarece emulatorii au descărcat o copie nouă a ROM-ului jocului pentru ca utilizatorul să o poată juca. </p> <p> Subiectul abandonware este oarecum o zonă gri. Jocurile Abandonware nu mai sunt publicate și nu mai sunt disponibile pentru vânzare online sau într-un magazin. Cu toate acestea, în multe cazuri, drepturile de autor asupra acestor jocuri nu au expirat, dar deținătorul drepturilor de autor nu își impune în mod activ drepturile. </p> <p> </p> <p> În multe cazuri, abandonware-ul este ilegal. Cu toate acestea, nu există cazuri în instanță legate de abandonware sau cel puțin niciunul referitor la un vechi dezvoltator de jocuri care urmează în judecată pe cineva pentru descărcarea unui titlu abandonware. </p> <p> În acest exemplu exact, emularea acestor jocuri vechi într-un browser web este ilegală. De asemenea, Nintendo este renumit pentru eliminarea oricăror site-uri sau servicii care încearcă să replice sau să redistribuie proprietatea sa intelectuală. </p> <p> În prezent, jocurile au fost eliminate din magazinul de extensii Microsoft Edge. Mai mult, nu se știe încă cum au ajuns jocurile emulate pe magazinul de extensii sau cine le-a pus acolo. Inutil să spun că este puțin probabil să se întoarcă. </p>"}