{"title":"BitPay aduce Bitcoin către Apple Pay","content":"<p> Utilizatorii BitPay din SUA își pot adăuga acum cardurile bitcoin preplătite în aplicația Apple Wallet și <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> folosiți-l pentru a plăti lucruri cu Apple Pay </a> . Clienții care nu sunt Apple vor putea în curând să își adauge cardurile BitPay cu marca MasterCard în Google Pay și Samsung Pay. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> Cum să adăugați cardul dvs. BitPay la Apple Wallet </h2> <p> Pentru a adăuga cardul BitPay pe un dispozitiv Apple, deschideți aplicația Wallet pe iPhone și atingeți „+” în colțul din dreapta sus, apoi urmați instrucțiunile de pe ecran pentru a termina adăugarea cardului. </p> <p> Cu BitPay în aplicația Wallet, puteți adăuga cardul la Apple Pay accesând <strong> Setări&gt; Portofel și Apple Pay </strong> , apoi atingeți opțiunea etichetată „Adăugați un card”. Pentru a deveni utilizator BitPay și a comanda cardul dvs. preplătit, descărcați aplicația BitPay Wallet din <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> Magazin de aplicații </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> O nouă modalitate de a cheltui cu Apple Pay </h2> <p> O postare pe <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog BitPay </a> spune că adăugarea unui card BitPay la Apple Pay este o modalitate convenabilă de a cheltui criptomonede în mai multe locuri decât înainte. „Avem mii de clienți ai aplicației BitPay Wallet care utilizează cardul BitPay, care caută mereu noi locuri și modalități de a-și petrece cripta”, a declarat Stephen Pair, CEO al BitPay <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> comunicat de presa </a> . </p> <p> </p> <p> Cu Apple Pay, deținătorii de carduri BitPay pot face achiziții securizate fără contact în magazinele fizice, aplicații care acceptă Apple Pay și pe web. Compania notează că clienții care așteaptă livrarea unui card de plastic își pot adăuga omologul virtual la Apple Wallet prin intermediul aplicației oficiale BitPay Wallet. Acest lucru vă va permite să începeți să cheltuiți imediat. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> Ce este cardul BitPay? </h2> <p> Un card preplătit care utilizează rețeaua Mastercard, cardul BitPay facilitează efectuarea atât a plăților fără contact, cât și a plăților PIN, precum și retragerea numerarului de la orice bancomat compatibil. Cu aplicația, clienții pot face lucruri precum să-și vadă soldul, să solicite un nou PIN, să reîncarce instantaneu, precum și să convertească criptomoneda în monedă fiat (care este apoi încărcată pe card, gata să fie cheltuită oriunde se acceptă debitul Mastercard la nivel global) </p> <blockquote> <p> Pentru utilizatorii de blockchain de putere, aplicația BitPay Wallet acceptă o serie de opțiuni pentru a cumpăra și stoca cripto și a efectua plăți online. Utilizatorii pot cumpăra instantaneu carduri cadou de la sute de retaileri de top din magazin și online. </p> </blockquote> <p> Cardul are un cip EMV și poate fi blocat în caz de urgență cu aplicația. </p> <p> Potrivit companiei, asistența pentru Google Pay și Samsung Pay este planificată „mai târziu în acest trimestru”. În ceea ce privește aplicația BitPay, acesta acceptă în prezent Bitcoin, Bitcoin Cash și Ether, precum și patru criptomonede stabilite în USD, USDC, GUSD, PAX și BUSD </p>"}