{"title":"Cum să vă vedeți statisticile de timp de redare pe PS5","content":"<p> Dacă vă place să vedeți cât timp ați petrecut jocuri, PS5 are o caracteristică ascunsă, dar utilă pentru dvs. Ține evidența timpului petrecut jucând jocuri pe sistem. </p> <p> Iată cum puteți verifica cât timp ați petrecut jucând jocuri PlayStation 5. Ceea ce te poate încuraja <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> opriți-vă PS5 </a> mai des. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> Cum să vă verificați statisticile de timp de redare pe PlayStation 5 </h2> <p> Pe ecranul de pornire al PS5, selectați pictograma de profil din partea dreaptă sus. Puteți apăsa <strong> Triunghi </strong> pentru a muta rapid selecția în acea zonă a ecranului. După ce deschideți meniul respectiv, alegeți <strong> Profil </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Acum, treceți la <strong> Jocuri </strong> filă. Aici veți vedea toate jocurile pe care le-ați jucat pe contul dvs. PlayStation. Fiecare arată ultima dată când ați jucat jocul, precum și numărul total de ore de joc. Cu toate acestea, nu este exact la minut. Veți vedea timpul de joc rotunjit la oră. </p> <p> Veți vedea și timpul de redare pentru titlurile dvs. PS4, chiar dacă nu le-ați jucat pe PS5. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> Din câte știm, acest timp de joc include tot timpul în care jocul rulase - nu doar când jucați activ. Aceasta înseamnă că, dacă ați lăsat jocul în meniul de pauză în timp ce ați preluat un telefon sau ați luat ceva de mâncare, timpul respectiv va fi inclus în total. Așadar, s-ar putea să nu fie foarte precis, dar cel puțin vă va oferi o idee despre cât ați jucat fiecare titlu. </p> <p> </p> <p> Dacă sunteți curioși, puteți vedea și statisticile timpului de joc pentru prietenii dvs. Selectează <strong> Prieteni </strong> din același ecran și alegeți prietenul despre care doriți să aflați mai multe. Acest lucru vă va arăta cât timp au petrecut în jocurile lor într-un meniu identic. </p> <p> Dacă nu doriți ca informațiile dvs. de timp să fie vizibile pentru alți jucători, derulați spre dreapta și alegeți <strong> Setările de confidențialitate </strong> . În meniul respectiv, sub <strong> Activitatea ta </strong> , modificați opțiunea pentru <strong> Cine vă poate vedea istoricul jocurilor </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Unele jocuri își urmăresc și timpul de joc </h2> <p> Dacă sunteți interesat de astfel de date, asigurați-vă că vă deschideți jocurile preferate și vedeți dacă acestea țin cont de cât timp ați petrecut jucând. Un număr bun de titluri includ timpul total de redare în fișierul salvat, în meniul de pauză sau similar. </p> <p> Deși acest lucru nu este consecvent între jocuri și poate include sau nu timpul petrecut în timpul pauzei, vă poate oferi mai multe informații despre un joc despre care doriți să aflați mai multe. Unele jocuri online, cum ar fi Overwatch, îți urmăresc chiar timpul petrecut cu fiecare erou în mai multe moduri. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Vedeți cât de mult jocuri cu adevărat </h2> <p> PS5 vă permite să vedeți cu ușurință cât timp ați petrecut jucând jocuri. Este o caracteristică mică, dar mult apreciată, deoarece PS4 nu a făcut aceste date ușor accesibile. </p> <p> Între timp, există mai multe modalități de a vă gestiona jocul și în afara consolei. </p> <p> <small> Credit de imagine: LightField Studios / <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}