{"title":"Canon lansează o aplicație Photo Culling care găsește cele mai bune fotografii","content":"<p> În spatele aproape fiecărei fotografii perfecte pentru imagini se află o rolă plină cu alte fotografii care arată aproape exact ca ea. Nu este neobișnuit ca fotografii să țină aproape întotdeauna butonul declanșator apăsat, temându-se că le-ar putea lipsi un moment trecător. </p> <p> Parcurgerea a zeci sau poate chiar a sute de fotografii pentru a-ți alege preferatele și spațiul liber de stocare poate fi un proces lung, enervant. Din fericire, Canon a lansat o nouă aplicație care face acest lucru automat pentru dvs. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> Faceți cu ușurință o listă de fotografii până la cele mai bune câteva </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon SUA </a> a lansat o aplicație de fotografiere pe <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> Magazin de aplicații </a> care vă permite să găsiți rapid și ușor cele mai bune fotografii. Aplicația în sine este gratuită, dar pentru a o utiliza, va trebui să obțineți un abonament pentru 14,99 USD / an sau 2,99 USD / lună. Ambele opțiuni de abonament au o perioadă de încercare de trei zile. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> Vicepreședintele executiv Canon SUA, Tatsuro &quot;Tony&quot; Kano, explică: </p> <blockquote> <p> În lumea actuală în continuă schimbare și copleșitoare, în care mii de fotografii sunt capturate și stocate în smartphone-ul unei persoane, consumatorii au nevoie de un instrument foto expert, fiabil și intuitiv care să îi ajute să decidă cele mai bune fotografii pe baza unor ani de cunoștințe și tehnologie de încredere. </p> </blockquote> <p> Aplicația Canon, numită pur și simplu Photo Culling, funcționează pe un AI numit Photography Intelligence Learning sau PHIL pe scurt. PHIL vă sugerează ce fotografii trebuie să păstrați și pe care să le ștergeți în funcție de care dintre cele două opțiuni de recoltare a fotografiilor selectați. </p> <p> Prima opțiune, <strong> Culling întreg </strong> , este minunat pentru <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> fotografie de portret mai bună </a> . Când este selectată această opțiune, PHIL vă va determina cele mai bune fotografii marcându-le pe baza a patru factori: claritate, zgomot, emoții și dacă ochii subiectului dvs. sunt închise (dacă este cazul). </p> <p> Între timp, <strong> Culling similar </strong> opțiunea alege cele mai bune fotografii comparând scorurile între fotografii similare. De exemplu, să presupunem că ați făcut o grămadă de fotografii ale norilor și apoi o grămadă de fotografii ale unor flori. Aplicația ar separa fotografiile cloud și fotografiile florilor în grupuri separate. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Indiferent de opțiunea de eliminare pe care o alegeți, dacă scorul unei fotografii depășește scorul țintă pe care l-ați setat, atunci fotografia este considerată un păstrător. PHIL va sugera apoi ștergerea celorlalte fotografii care nu au obținut un scor suficient de mare. În cazul în care nu sunteți de acord cu PHIL, nu vă faceți griji. Aveți în continuare control total asupra tuturor fotografiilor. </p> <p> </p> <p> Alte caracteristici ale aplicației includ numărul de fotografii și informații despre afișarea spațiului de stocare, albume foto, setările parametrilor pentru scorurile foto și opțiunea de a utiliza modul întunecat. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> Descărcați aplicația Canon Photo Culling? </h2> <p> S-ar părea că aplicația Canon de reducere a fotografiilor are tot ce ai nevoie pentru a face procesul de alegere a celor mai bune fotografii mai puțin obositor. Cu toate acestea, la sfârșitul zilei, depinde de dvs. să decideți dacă urăști suficient fotografierea pentru a justifica plata pentru ceva ce ai putea face singur (deși probabil foarte încet și plictisit din mintea ta). </p> <p> La momentul scrierii, aplicația nu este disponibilă pentru Android, dar poate că Canon are acest lucru pe carduri pentru viitor. </p>"}