{"title":"Cum se instalează un controler inteligent pentru ușa de garaj","content":"<p> Doriți să vă controlați ușa garajului cu smartphone-ul sau tableta? Un controler inteligent este o opțiune excelentă dacă aveți deja un deschizător de ușă de garaj instalat în casa dvs. </p> <p> Vă vom arăta cum să instalați un controler inteligent pentru ușa de garaj. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Diferențele dintre un deschizător și un controler </h2> <p> Există două diferențe principale între un deschizător inteligent de ușă de garaj și un controler. Primul este dimensiunea. </p> <p> Majoritatea deschizătorilor sunt mari și se montează pe tavanul garajului. Folosesc o pistă mecanică pentru a deschide și închide ușa. Un controler al ușii de garaj, pe de altă parte, este o mică unitate electronică care vă permite să controlați deschizătorul folosind o aplicație pe un dispozitiv inteligent. </p> <p> A doua distincție între aceste două produse este prețul. Deschizătoarele ușilor de garaj pot costa în jur de 300 USD. Instalarea acestor deschizătoare necesită de obicei ajutorul unui instalator profesionist. </p> <p> Cu toate acestea, un controler nu are nevoie de instalare profesională. În schimb, controlerul funcționează ca un supliment la deschizătorul dvs. existent. </p> <p> Aceasta înseamnă că pentru o fracțiune din prețul unui nou deschizător, puteți obține aceeași funcționalitate doar folosind un controler. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> Care sunt beneficiile unei uși inteligente de garaj? </h2> <p> Există trei avantaje principale ale unei uși inteligente de garaj. </p> <ul> <li> <strong> Siguranță </strong> —Ușa inteligentă de garaj vă permite să deschideți și să închideți ușa de aproape oriunde. </li> <li> <strong> Securitate </strong> —Cele mai multe deschizătoare și controlere inteligente ale ușilor de garaj vă avertizează când garajul dvs. a fost deschis pentru o anumită perioadă de timp. </li> <li> <strong> Confort </strong> —Dacă ați trebuit vreodată să vă întoarceți acasă pentru a vă închide ușa garajului, atunci dacă aveți o aplicație inteligentă pentru ușa garajului, economisiți timp. În loc să mergeți acasă, scoateți telefonul. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> Cum se instalează un controler inteligent pentru ușa de garaj </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Dacă ați decis că un controler inteligent pentru ușa de garaj este potrivit pentru dvs., atunci acest ghid vă va arăta cum să instalați unul. În această demonstrație, a <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meross MSG100 </a> este utilizat, dar acest proces este similar dacă se utilizează o altă marcă. Consultați documentația controlorului pentru detalii. </p> <h3 id=\"what-you-ll-need\"> De ce veți avea nevoie </h3> <ul> <li> Un controler inteligent de garaj </li> <li> Suporturi pentru capse sau sârmă </li> <li> Ușă de garaj cu deschizător auto instalat </li> <li> Philips și șurubelnițe cu fante </li> <li> Scară </li> </ul> <h3 id=\"plan-the-installation\"> 1. Planificați instalarea </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Înainte de a instala controlerul, va trebui să identificați câteva locuri din garaj. Prima este o sursă de alimentare pentru controler. Al doilea este calea firului de la controler la senzorul montat pe ușă inclus în kit. Iar al treilea este locația senzorului magnetic. </p> <p> Acest senzor magnetic permite controlerului să știe când ușa este deschisă sau închisă. </p> <p> Majoritatea controlerelor utilizează o lungime mare de sârmă pentru a se conecta la senzorul ușii. Va trebui fie să direcționați acest fir peste tavan, fie pe un perete, pentru a menține firul departe de drum. </p> <p> După ce ați planificat instalarea, testați cablul senzorului de la controler la locația senzorului. Această potrivire de test asigură că firul senzorului ajunge la controler. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Opriți alimentarea cu deschizătorul ușii de garaj </h3> <p> Majoritatea ușilor de garaj sunt conectate la curent undeva în tavan. Pentru aceste deschizătoare, veți dori să vă asigurați că sunt deconectate înainte de a continua. </p> <p> Dacă deschizătorul dvs. nu are o priză și, în schimb, este atașat la cablurile care ies din tavan, atunci va trebui să vă găsiți cutia de întrerupere și să opriți alimentarea deschizătorului acolo. </p> <p> <strong> Notă: </strong> Curentul electric de 120 volți poate provoca răniri grave. Dacă nu vă simțiți confortabil să lucrați cu electricitate, opriți-vă acum și consultați un instalator profesionist de ușă de garaj și / sau electrician. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Conectați firele incluse la controler </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> Pe unitatea Meross, există un set de fire albastre și maro care trebuie instalate în controler pentru conectarea la deschizătorul ușii de garaj. Deschideți capacul de plastic de pe controler și ar trebui să vedeți două borne cu șurub. </p> <p> Folosind o șurubelniță cu fante mici, slăbiți șuruburile de pe fiecare terminal. Introduceți firele și strângeți șuruburile. Nu contează ce fir merge unde. </p> <p> Dați firelor o remorcare ușoară pentru a vă asigura că sunt sigure. Apoi înlocuiți capacul controlerului. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Montați controlerul ușii de garaj </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Din moment ce v-ați planificat locațiile, este momentul să vă montați controlerul. Asigurați-vă că controlerul se află într-un loc unde poate accesa puterea de care are nevoie fără a pune stres pe cabluri. </p> <p> Apoi, scoateți suportul lipicios al controlerului și apăsați-l în poziție. Dacă aveți un controler cu un șurub, utilizați șurubelnița pentru a fixa controlerul în poziție. </p> <h3 id=\"mount-the-sensor\"> 5. Montați senzorul </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> Apoi, va trebui să montați senzorul pentru ușă. Este recomandat ca acest senzor să fie plasat acolo unde nu obstrucționează calea ușii. </p> <p> De asemenea, s-ar putea să fiți tentați să montați senzorul lângă pământ. Acest lucru nu este recomandat, deoarece apa stropind în mod repetat direct pe senzor poate provoca daune. Odată ce ați poziționat senzorul, utilizați banda dublă sau șuruburile furnizate pentru a-l fixa. </p> <p> În fotografia de mai sus, senzorul negru a fost montat lângă ușa garajului, cu porțiunea de magnet montată pe ușă. Acest senzor folosește bandă dublă pentru montare. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Conectați firele senzorului </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Acum este timpul să conectați firele la senzor și controler. Folosind planul pe care l-ați făcut în primul pas, direcționați-vă firele și folosiți pistolul de fixare pentru a fixa firele de perete sau tavan. </p> <p> Asigurați-vă că nu strângeți sau încovoiați firele, deoarece acestea le pot deteriora. Când sunt direcționate, conectați conectorul roșu de sex feminin de pe controler la conectorul roșu de sex masculin de la capătul firului senzorului. </p> <p> Apoi, va trebui să deschideți capacul deschizătorului ușii de garaj. Ar trebui să existe patru fire prezente, două puteri de control și comune pentru unitate și două să controleze butonul de pe perete. </p> <p> </p> <p> De obicei, aceste fire provin din tavan și ar trebui să aibă terminale de pică sertizate care să le fixeze pe unitatea de deschidere a ușii de garaj. Dacă nu puteți stabili ce fire sunt, opriți și consultați manualul proprietarului pentru deschizătorul ușii de garaj sau consultați un electrician autorizat. </p> <p> Dacă ați găsit firele, conectați firele maro și albastru de la controler la terminalele de pe deschizător care sunt conectate la butonul de perete. În fotografia de mai sus, firele controlerului au fost introduse în cele două terminale din stânga. </p> <p> Când ați terminat, ar trebui să existe două fire atașate la fiecare terminal de buton de perete. Asigurați-vă din nou capacul deschizătorului ușii de garaj, conectați controlerul și deschizătorul, iar instalarea ar trebui să fie finalizată. </p> <p> În pasul următor, veți conecta controlerul la o rețea fără fir. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Conectați controlerul la Wi-Fi </h3> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (3 imagini) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Extinde <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Extinde <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> Pentru a configura conectivitatea Wi-Fi, am folosit aplicația Meross. Este disponibil pentru <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> și <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . Acest proces constă aproape întotdeauna în deschiderea aplicației, identificarea produsului dvs., conectarea aplicației la Wi-Fi, deschiderea ecranului Setări și permiterea controlerului să vă acceseze rețeaua. </p> <p> Aici, deschideți aplicația, apoi atingeți <strong> Deschizător ușă de garaj inteligent </strong> și apoi <strong> start </strong> . Selectați producătorul și modelul deschizătorului de ușă de garaj pe care îl utilizați împreună cu controlerul. Asigurați-vă că urmați instrucțiunile specifice aplicației dvs. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Setați intervalul de sincronizare Deschidere / Închidere </h3> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (3 imagini) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Extinde <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Extinde <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> Un lucru important care trebuie setat înainte de a testa noul controler este momentul deschiderii ușii de garaj. În aplicația Meross, puteți selecta între 10 secunde și 40 de secunde la intervale de cinci secunde sau puteți adăuga o setare personalizată pentru ușile care necesită un număr par de secunde până la închidere. </p> <p> Setarea calendarului pentru ușa dvs. este ușoară, dar trebuie să o faceți corect. Un interval prea scurt va lăsa ușa parțial deschisă, iar o setare prea lungă poate provoca stres nejustificat pe motorul deschizătorului de ușă al garajului. </p> <p> Pentru a seta intervalul, veți avea nevoie de un ceas cu mâna a doua sau cu o funcție de cronometru. De asemenea, puteți utiliza temporizatorul încorporat al telefonului. Pregătiți temporizatorul și stați lângă butonul deschizătorului de ușă al garajului. Apoi apăsați butonul în același timp când apăsați Start pe cronometru sau notați ora cu mâna a doua. </p> <p> Așteptați până când ușa garajului nu se mai mișcă și înregistrați ora. Acesta este intervalul tău. Transferați aceste informații în aplicație și setarea intervalului este completă. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Testați controlerul ușii de garaj </h3> <p> Folosind aplicația, deschideți și închideți ușa de câteva ori doar pentru a vă asigura că totul funcționează. Acum ar trebui să puteți utiliza butonul de perete sau aplicația pentru a vă deschide ușa garajului. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Bucurați-vă de controlerul inteligent al ușii de garaj </h2> <p> Aducerea tehnologiei dvs. inteligente de casă la o ușă de garaj nu trebuie să coste o avere. </p> <p> Instalarea unui nou controler inteligent de ușă de garaj vă oferă familiei și dvs. mai multă flexibilitate, siguranță, securitate și confort pentru casa dvs. De asemenea, oferă liniștea sufletească care vine odată cu faptul că ușa de garaj poate fi controlată de aproape oriunde. </p>"}