{"title":"Cum se remediază utilizarea utilizării mari a procesorului Antimalware Service executabil pe Windows 10","content":"<p> Dacă computerul dvs. se simte lent sau nu răspunde, cel mai bine este să verificați dacă un proces intră în memorie și în procesor. Este probabil ca procesul să poată fi executabil pentru serviciul Antimalware. Această problemă obișnuită apare atunci când Windows Defender nu a fost configurat corect sau există malware pe sistemul dvs. care interferează cu funcționarea acestuia. </p> <p> Iată cum remediați eroarea de utilizare mare a procesorului executabil al serviciului Antimalware pe Windows 10. </p> <h2 id=\"optimize-windows-defender-scheduling-options\"> 1. Optimizați opțiunile de programare Windows Defender </h2> <p> Executabilul serviciului Antimalware are ca rezultat o utilizare ridicată a procesorului atunci când este programat să ruleze o scanare completă a sistemului dvs. la intervale regulate. Cel mai bine este să reprogramați aceste scanări într-un moment în care este mai puțin probabil să încercați sarcini cu procesor intensiv sau chiar să utilizați computerul. </p> <p> Iată cum puteți schimba programarea Windows Defender: </p> <ol> <li> În bara de căutare a meniului Start, tastați „task scheduler” și faceți clic pe <strong> Planificator de sarcini </strong> . </li> <li> În panoul de navigare din stânga, accesați <strong> Bibliotecă Planificator activități&gt; Microsoft&gt; Windows&gt; Windows Defender </strong> . Puteți face acest lucru extinzând fiecare dintre bibliotecile menționate anterior. </li> <li> În <strong> Windows Defender </strong> bibliotecă, faceți dublu clic pe <strong> Scanare programată Windows Defender </strong> în panoul din mijloc. </li> <li> Sub <strong> Condiții </strong> , debifați toate opțiunile și faceți clic pe OK. Aceasta elimină toate scanările programate. </li> </ol> <p> <img alt=\"Windows Defender Scheduled scan entry in Task Scheduler\" src=\"images/windows-defender-scheduled-scans-807.jpg\" loading=\"lazy\"> </p> <h3 id=\"create-new-scheduled-scans\"> Creați scanări noi programate </h3> <p> Utilizatorii ar trebui să creeze noi scanări programate, astfel încât computerul lor să rămână protejat. Cel mai bine este să îl personalizați în funcție de nevoile dvs. Le-ați putea programa în momente în care știți că nu veți face sarcini grele pentru CPU. Dar frecvența ar trebui să fie cel puțin o dată pe săptămână. </p> <p> Pentru a crea un nou program Windows Defender, urmați acești pași: </p> <ol> <li> Deschis <strong> Planificator de sarcini </strong> și navigați încă o dată la <strong> Bibliotecă Planificator activități&gt; Microsoft&gt; Windows&gt; Windows Defender </strong> </li> <li> Dublu click <strong> Programat Windows Defender </strong><strong> Scanează </strong> . </li> <li> Sub <strong> Declanșatoare </strong> fila, faceți clic pe <strong> Nou </strong> . </li> <li> Aici puteți alege cât de frecvent va rula scanarea. </li> <li> Aplicați setările și ieșiți. </li> </ol> <p> <img alt=\"Adding a new trigger toWindows Defender Scheduled scan using Task Scheduler\" src=\"images/new-trigger-defender-513.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-windows-defender-to-its-own-exclusion-list\"> 2. Adăugați Windows Defender la propria listă de excluderi </h2> <p> Când efectuați o scanare completă a sistemului, Windows Defender trece prin fiecare fișier din sistemul dvs. Aceasta se include, ceea ce poate duce la unele probleme - cel mai frecvent performanța lentă a sistemului. Utilizatorii pot preveni acest lucru adăugând Antimalware Service Executable în lista de excluderi a Windows Defender. </p> <p> Acest lucru se poate face urmând acești pași: </p> <ol> <li> presa <strong> CTRL + Shift + ESC </strong> pentru a lansa <strong> Gestionar de sarcini </strong> . </li> <li> Sub <strong> Procese </strong> filă caută <strong> Serviciu antimalware executabil. </strong> Faceți clic dreapta pe el și selectați <strong> Deschide locația fișierului </strong> . </li> <li> În bara de adrese situată în partea de sus a Windows Explorer, copiați calea fișierului (CTRL + C). </li> <li> În bara de căutare a meniului Start, introduceți „Securitate Windows” și deschideți aplicația. Are o pictogramă de scut albastru. </li> <li> Click pe <strong> Protecție împotriva virușilor și amenințărilor </strong> și apoi faceți clic pe <b> Gestionați setările </b> . </li> <li> Derulați în jos până găsiți <strong> Excluderi </strong> și apoi faceți clic pe <strong> Adăugați sau eliminați excluderi </strong> . </li> <li> Click pe <strong> Adăugați o excludere </strong> apoi faceți clic pe Fișier. </li> <li> În bara de adrese a ferestrei File Explorer, lipiți calea pe care ați copiat-o anterior (CTRL + V). </li> <li> Cauta <strong> MsMpEng.exe </strong> și faceți clic pe Deschidere. </li> <li> Fișierul va fi acum exclus din toate scanările viitoare Windows Defender. </li> </ol> <p> <img alt=\"Adding an entry to windows defender exclusion list\" src=\"images/windows-defender-exclusion-add-843.jpg\" loading=\"lazy\"> </p> <p> </p> <p> </p> <h2 id=\"repair-corrupt-windows-defender-files-using-sfc\"> 3. Reparați fișierele Windows Defender corupte utilizând SFC </h2> <p> SFC este un utilitar Windows încorporat care scanează și remediază automat orice fișier de sistem deteriorat. Acesta este ceea ce va ajuta la repararea fișierelor corupte Windows Defender. </p> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-224.jpg\" loading=\"lazy\"> </p> <p> Pentru a utiliza acest lucru, faceți următoarele: </p> <ol> <li> În bara de căutare a meniului Start, tastați <strong> cmd </strong> și deschis <strong> Prompt de comandă </strong> . </li> <li> În consolă, tastați <strong> sfc / scannow </strong> și apăsați Enter. </li> <li> Windows va dura ceva timp pentru a scana și repara fișierele de sistem corupte, inclusiv cele ale Windows Defender. </li> </ol> <p> </p> <h2 id=\"disable-windows-defender\"> 4. Dezactivați Windows Defender </h2> <p> Când toate celelalte nu reușesc, este timpul să dezactivați complet Windows Defender. Înainte de a face acest lucru, asigurați-vă că <a href=\"https://www.makeuseof.com/tag/best-antivirus-for-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> descărcați și instalați software antivirus terță parte </a> pentru a vă păstra computerul în siguranță. </p> <p> Pentru a dezactiva Windows Defender, urmați acești pași: </p> <ol> <li> În bara de căutare a meniului Start, tastați Windows Security și deschideți-l. </li> <li> Pe tabloul de bord, faceți clic pe <strong> Protecție împotriva virușilor și amenințărilor </strong> și apoi faceți clic pe <strong> Gestionați setările </strong> . </li> <li> Intrerupator <strong> Protectie in timp real </strong> la Off. </li> <li> Ieșiți și reporniți computerul. </li> </ol> <p> <img alt=\"Disable Windows Defender Protection Temporarily\" src=\"images/disable-windows-defender-protection-temporarily-744.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-clean-boot-to-check-whether-a-third-party-app-may-be-responsible\"> 5. Utilizați un boot curat pentru a verifica dacă o aplicație terță parte poate fi responsabilă </h2> <p> Uneori, aplicațiile terțe pot interfera cu procesele de sistem. De asemenea, este posibil ca software-ul terț să fie interpretat greșit ca malware. Pentru a exclude aplicațiile terțe ca motiv al problemei, utilizatorii ar trebui să efectueze o pornire curată. </p> <p> Iată pașii pentru a face acest lucru: </p> <ol> <li> presa <strong> Tasta Windows + R </strong> pentru a deschide comanda Run. Tip <strong> msconfig </strong> și apăsați Enter. </li> <li> În <strong> Configurarea sistemului </strong> fereastră, du-te la <strong> </strong><strong> Servicii </strong> . </li> <li> Verifică <strong> Ascunde toate serviciile Microsoft </strong> opțiune. Apoi continuați să verificați toate serviciile din listă. </li> <li> Click pe <strong> Dezactivați toate </strong> . </li> <li> Salvează și ieși. </li> <li> Acum deschis <strong> Gestionar de sarcini </strong> prin apăsarea <strong> CTRL + Shift + ESC </strong> . </li> <li> Sub <strong> Lansare </strong> , faceți clic pe fiecare serviciu unul câte unul și faceți clic pe <strong> Dezactivează </strong> . </li> <li> Ieșiți și reporniți computerul. </li> </ol> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-853.png\" loading=\"lazy\"> </p> <p> Computerul va porni acum cu toate aplicațiile terță parte dezactivate. Utilizatorii ar trebui să verifice dacă încă mai au problema și dacă nu au, atunci este mai bine să dezinstalați orice aplicație instalată recent, deoarece aceștia sunt vinovații. </p> <p> </p> <h2 id=\"check-for-malware-using-third-party-antivirus\"> 6. Verificați dacă există programe malware folosind terți antivirus </h2> <p> Există viruși care afectează direct Windows Defender și pot fie să-i perturbe funcționarea, fie să-l dezactiveze complet. În astfel de cazuri, singura soluție este scanarea computerului utilizând software antivirus terță parte. </p> <p> Dar mai întâi, pentru a vă asigura că Windows Defender a fost într-adevăr infectat, verificați și verificați dacă protecția în timp real este dezactivată automat. Amintiți-vă, ar trebui să vă asigurați întotdeauna că <a href=\"https://www.makeuseof.com/easy-ways-boost-security-microsoft-defender-and-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows Defender funcționează la maximum. </a> </p> <p> În unele cazuri, utilizatorii au raportat că nu pot elimina fișierele infectate (detectate chiar de Windows Defender) utilizând Windows Defender. </p> <p> <img alt=\"Windows Defender dashboard displaying current threats\" src=\"images/current-threats-windows-defender-707.jpg\" loading=\"lazy\"> </p> <p> Pentru a verifica această problemă, urmați acești pași: </p> <ol> <li> În bara de căutare a meniului Start, tastați <strong> Securitate Windows </strong> și lansați aplicația. </li> <li> Pe tabloul de bord, faceți clic pe <strong> Protecție împotriva virușilor și amenințărilor </strong> . </li> <li> Sub <strong> Amenințări actuale, </strong> Click pe <strong> Protecţie </strong><strong> istorie </strong> . </li> <li> Sub <strong> Amenințări în carantină </strong> , Click pe <strong> Vedeți istoria completă </strong> . </li> <li> Acum faceți clic pe orice amenințare din listă și selectați <strong> Elimina </strong> . </li> <li> Dacă Windows Defender elimină fișierul, atunci totul funcționează bine, dar dacă nu poate elimina fișierul sau există o animație de așteptare infinită, atunci Windows Defender a fost infectat. </li> </ol> <p> </p> <p> </p> <h2 id=\"fixing-the-antimalware-service-executable-high-cpu-usage-bug\"> Remedierea erorii de utilizare a procesorului ridicat executabil al serviciului Antimalware </h2> <p> Utilizarea sfaturilor de mai sus va îmbunătăți performanța computerului, precum și capacitatea de reacție. Asigurați-vă că computerul dvs. nu este lăsat niciodată neprotejat de malware. Este recomandat să descărcați alte programe antivirus înainte de a dezactiva Windows Defender. </p>"}