{"title":"Cum să buclați un videoclip YouTube","content":"<p> Doriți să conectați un videoclip YouTube? Indiferent dacă este melodia ta preferată sau o compilație amuzantă, nu trebuie să reîncarci pagina dacă vrei să repete un videoclip YouTube. </p> <p> Vă vom arăta cum să buclați un videoclip YouTube pe desktop și mobil. </p> <h2 id=\"how-to-loop-a-youtube-video-on-desktop\"> Cum să buclați un videoclip YouTube pe desktop </h2> <ol> <li> Accesați videoclipul pe care doriți să îl buclați. </li> <li> <strong> Click dreapta </strong> videoclipul (nu în jurul lui). Se va deschide meniul contextual YouTube. </li> <li> Clic <strong> Buclă </strong> . <p> <img alt=\"youtube video loop desktop\" src=\"images/youtube-video-loop-desktop-114.jpg\" loading=\"lazy\"> </p> </li> </ol> <p> Când videoclipul ajunge la sfârșit, se va bucla automat. Pentru a confirma că este activat, <strong> Click dreapta </strong> video și veți vedea un cec lângă <strong> Buclă </strong> (pe care puteți face clic din nou pentru a dezactiva). </p> <p> </p> <p> </p> <h2 id=\"how-to-loop-a-youtube-video-on-mobile\"> Cum să buclați un videoclip YouTube pe mobil </h2> <p> Din păcate, buclarea unui videoclip YouTube pe aplicația mobilă nu este la fel de simplă ca și pe desktop. În schimb, trebuie să puneți videoclipul într-o listă de redare. Iată cum puteți face acest lucru: </p> <ol> <li> Accesați videoclipul pe care doriți să îl buclați. </li> <li> Sub videoclip, țineți apăsat pe <strong> Salvați </strong> buton. </li> <li> Atingeți <strong> Nouă listă de redare </strong> . </li> <li> Introduceți un nume pentru lista de redare, alegeți un <strong> Confidențialitate </strong> setare și atingeți <strong> Crea </strong> . </li> <li> Atingeți <strong> Vezi Lista </strong> pentru a accesa noua listă de redare (sau accesați ecranul de pornire al aplicației, atingeți <strong> Bibliotecă </strong> din meniul de jos și introduceți lista de redare). </li> <li> Apasă pe <strong> Amesteca </strong> pictogramă (două săgeți împletite). <p> <strong class=\"gallery__section-title\"> Galerie de imagini (3 imagini) </strong> <img alt=\"youtube android save\" src=\"images/youtube-android-save-686.jpg\" loading=\"lazy\"> Extinde <img alt=\"youtube android new playlist\" src=\"images/youtube-android-new-playlist-719.jpg\" loading=\"lazy\"> Extinde <img alt=\"youtube android repeat playlist\" src=\"images/youtube-android-repeat-playlist-472.jpg\" loading=\"lazy\"> Extinde </p> <p> Închide </p> </li> <li> Redați videoclipul și atingeți săgeata din colțul din dreapta jos al videoclipului. De acolo, atingeți <strong> Buclă </strong> pictogramă (două săgeți care formează un dreptunghi). </li> </ol> <p> Când videoclipul ajunge la sfârșit, se va bucla automat. Desigur, puteți adăuga mai multe videoclipuri la această listă de redare. </p> <p> </p> <h2 id=\"how-to-use-an-external-service-to-loop-a-youtube-video\"> Cum se folosește un serviciu extern pentru a bucla un videoclip YouTube </h2> <p> Dacă nu doriți să utilizați metodele native de mai sus din orice motiv, puteți utiliza și un serviciu extern numit <a href=\"https://www.youtuberepeater.com\" target=\"_blank\" rel=\"nofollow noopener\"> Repetator YouTube </a> . </p> <p> Pentru a utiliza acest lucru cu ușurință, accesați videoclipul YouTube pe care doriți să îl buclați. În bara URL, înlocuiți <strong> youtube.com </strong> cu <strong> youtuberepeater.com </strong> , apoi accesați această nouă adresă URL. </p> <p> De exemplu, dacă doriți să faceți o buclă <strong> youtube.com/watch?v=n9xhJrPXop4 </strong> , l-ai schimba în <strong> youtuberepeater.com/watch?v=n9xhJrPXop4 </strong> . </p> <p> Acest lucru nu va funcționa la videoclipurile în care încărcătorul nu a permis încorporarea videoclipului în afara YouTube. Ca atare, utilizarea uneia dintre cele două metode de mai sus este alegerea ideală. </p>"}