{"title":"Care este diferența dintre LAN și WAN în rețea?","content":"<p> Dacă v-ați băgat nasul în rețeaua de calculatoare, există mari șanse să întâlniți termenii „LAN” și „WAN”. Cu toate acestea, ce înseamnă fiecare și care sunt diferențele atunci când comparați o rețea LAN cu o rețea WAN? </p> <p> Să explorăm ambele tehnologii și unde strălucește fiecare. </p> <h2 id=\"what-does-lan-stand-for\"> Ce înseamnă „LAN”? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> Credit de imagine: Drug Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> O rețea LAN este o „rețea locală”. Acest termen descrie o rețea în care toate dispozitivele conectate sunt apropiate unele de altele. Toți se află într-o „zonă locală”, de unde și numele. </p> <p> Când un computer se conectează la o rețea LAN, primește o adresă de protocol de internet local (IP). Acest lucru funcționează similar cu adresa IP pe care o primiți atunci când intrați online. Cu toate acestea, o adresă IP locală funcționează numai pentru alte computere de pe aceeași rețea LAN ca tine. De exemplu, nu puteți utiliza un IP local pentru a vă conecta la computerul dvs. prin internet. </p> <p> Este posibil ca granița fizică a rețelei LAN de acasă să nu iasă din casă. Desigur, dacă vă scoateți telefonul sau laptopul în grădină pentru a beneficia de aer curat, acesta este încă pe rețeaua LAN. Cu toate acestea, de cele mai multe ori, toate dispozitivele conectate la rețea se află în siguranță în cei patru pereți ai casei dvs. </p> <p> Companiile și institutele produc și ele rețele LAN. De exemplu, o universitate poate conecta toate computerele din biblioteca sa la o rețea, astfel încât să poată vorbi cu toții. Întreprinderilor le place și utilizarea rețelelor LAN, deoarece le permite lucrătorilor să-și trimită fișiere și corespondență reciproc fără a fi nevoie să se conecteze. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> Ce înseamnă „WAN”? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Credit de imagine: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Pe de altă parte, avem Wide Area Network sau WAN. Dacă citiți acest articol, sunteți deja conectat la o rețea WAN - ne place să o numim internet. </p> <p> „Largul” din rețeaua extinsă este foarte variabil. Dacă vă conectați la un server extern din același oraș ca dvs., aceasta este o rețea WAN. De asemenea, este considerat o rețea WAN dacă vă conectați la un server dintr-o țară de cealaltă parte a planetei. </p> <p> Ca atare, o rețea WAN este de obicei utilizată pentru a descrie orice rețea la care vă conectați și care există pe lângă router. Nu contează dacă serverul este la o milă distanță sau un continent; este încă „larg”. </p> <p> Internetul nu este singurul WAN de acolo. Companiile folosesc bine WAN-urile pentru a conecta birouri din diferite țări. De exemplu, dacă o companie are un birou în New York, Tokyo și Sydney, își poate angaja propriul sistem WAN pentru a le permite să vorbească între ei. </p> <p> Dar așteaptă un minut; de ce își fac companiile propria WAN atunci când pot conecta pur și simplu totul la internet? Problema cu această soluție este că compania va trebui să plătească taxe ISP și, dacă ceva nu merge bine, trebuie să se lupte cu ISP-ul menționat pentru a-l repara. </p> <p> Nu numai atât, dar internetul este conceput pentru conectarea la multe computere din întreaga lume. Dacă o companie dorește ca PC-urile sale să se conecteze la alte PC-uri de birou, își pot folosi propria WAN pentru a se proteja de amenințările online. Aceasta se numește „intranet”. </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> Când se folosește o rețea LAN vs. WAN </h2> <p> Când doriți să vă conectați la un alt dispozitiv pe care îl dețineți, puteți alege să faceți acest lucru prin LAN sau WAN. Dar care sunt beneficiile și dezavantajele fiecăruia și care ar trebui să le folosiți? </p> <p> Să presupunem că aveți un nou hard disk wireless care se conectează la router și aveți posibilitatea de a permite conexiuni de pe internet (o rețea WAN) sau păstrarea acestuia numai locală (LAN). Care dintre ele alegeți depinde de ceea ce doriți de pe hard disk. </p> <p> Oferirea de capacități WAN pe hard disk este fantastic pentru confort. Acest lucru îl plasează pe internet, ceea ce înseamnă că vă puteți conecta la acesta de oriunde din lume. Ca atare, nu veți mai fi blocat niciodată fără fișierele dvs.; vor fi doar o conexiune la internet. </p> <p> Cu toate acestea, conexiunile WAN permit și altor persoane să aibă acces la dispozitivele dvs. Dacă securitatea hard disk-ului dvs. nu este la înălțime, hackerii pot folosi același traseu pe care îl faceți pentru a vă vedea toate datele și a copia sau șterge lucruri importante. </p> <p> Pe de altă parte, punerea hard disk-ului în modul LAN numai, îl protejează de unele dintre căile pe care le poate lua un hacker. Nu este impermeabil. De exemplu, cineva ar putea folosi computerul pentru a obține acces la hard disk. Cu toate acestea, este mult mai sigur decât difuzarea hard disk-ului pe WAN în fiecare zi și noapte. </p> <p> Dacă doriți, cu adevărat, să strângeți securitatea, ați putea distanța pe hard disk. Air-gapping înseamnă că acesta și fiecare computer din aceeași rețea de pe acesta nu sunt conectate la o rețea WAN - cum ar fi internetul, de exemplu. </p> <p> Un <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> computerul cu aer decalat nu este complet sigur de amenințările online </a> , dar reduce drastic șansa unui atac. Hackerii trebuie să manipuleze ființele umane pentru a-și îndeplini cererea de a ataca un dispozitiv cu aer decalat, folosind tactici de inginerie socială pentru a-și face drum. </p> <p> Ca atare, atunci când alegeți între a pune un dispozitiv pe internet sau a-l ține blocat pe rețeaua LAN de acasă, trebuie să vă gândiți dacă vă veți conecta efectiv la acesta prin internet. Dacă nu credeți că o veți face, este mai bine să opriți capacitățile WAN și să țineți hackerii la distanță. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> Conectarea la Internet transformă o rețea LAN într-o rețea WAN? </h2> <p> Să presupunem că aveți o rețea LAN configurată unde toate dispozitivele dvs. sunt conectate la un router. Te-ai plictisit, așa că te urci pe computer și te duci la Netflix. Acum, computerul dvs. este conectat la o rețea WAN: internetul. </p> <p> Cu toate acestea, deoarece computerul dvs. este conectat la o rețea WAN, înseamnă că nu mai face parte dintr-o rețea LAN? Din fericire, un dispozitiv poate face parte atât dintr-o rețea LAN, cât și dintr-o rețea WAN în același timp. </p> <p> Vă amintiți cum am spus că dispozitivele LAN au propria adresă IP locală? Acest lucru nu înseamnă că nu poate obține și o adresă IP de internet. De fapt, dacă citiți acest articol pe un dispozitiv conectat la un router, va avea ambele! </p> <p> Dacă vrei să verifici singur, am acoperit <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> cum să vă verificați adresa IP pe Windows </a> . Dacă sunteți pe mobil, puteți totuși <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> găsiți adresele IP pe Android sau iPhone </a> . </p> <p> Odată ce ai statisticile sus, ar trebui să vezi două adrese IP. Primul va începe cu „192.168” - aceea este adresa dvs. IP locală. O utilizați dacă doriți să vă conectați la dispozitivul dvs. curent de la altul din aceeași rețea. </p> <p> Al doilea va arăta una din cele două moduri, în funcție de dacă sunteți pe IPv4 sau IPv6. Dacă sunteți pe v4, ar trebui să arate ca adresa IP locală, dar nu va începe cu „192.168”. Dacă este IPv6, ar trebui să fie o mizerie de litere și cifre, împărțite în opt blocuri de două puncte. </p> <p> Oricum ar fi, adresa respectivă este adresa dvs. IP de internet. Aceasta este utilizată atunci când vă conectați la un alt server de pe internet, astfel încât acesta să vă poată vorbi; de exemplu, pentru a vă trimite emisiunea TV pe care o urmăriți pe Netflix. </p> <p> Într-un fel, vă puteți imagina internetul ca o rețea imensă de rețele LAN. Când vizionați Netflix, computerul dvs. (pe rețeaua LAN personală) primește date de pe serverele Netflix (care se află pe propria rețea LAN). Fiecare rețea LAN este ca o casă într-un oraș, în timp ce conectivitatea la internet este ca drumurile și străzile care le conectează pe toate. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> Ștergerea confuziei LAN vs. WAN </h2> <p> LAN-urile și WAN-urile funcționează adesea în tandem, dar funcționează în moduri diferite. Acum știi diferența dintre cele două și când să le folosești pe fiecare. </p> <p> Știați că puteți configura un joc LAN, astfel încât oamenii din aceeași rețea să se poată juca unul cu altul? Este o modalitate excelentă de a petrece timpul cu prietenii fără problemele de latență pe care le are uneori jocurile pe internet. </p> <p> <small> Credit de imagine: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}