{"title":"Cum să vă păstrați datele personale în siguranță de angajatori","content":"<p> Tehnologia de supraveghere este extinsă în interiorul și în afara biroului. Mulți angajatori utilizează produse de gestionare a dispozitivelor mobile pentru dispozitive emise de companie, cum ar fi telefoane, laptopuri și tablete. Acestea conțin programe concepute pentru a proteja companiile de furturi, spionaj corporativ sau intenții rău intenționate. </p> <p> Cu toate acestea, deși toate acestea sunt excelente pentru a vă proteja compania, acestea nu sunt tocmai cel mai bun lucru pentru dvs. Nu mai este vorba de <strong> dacă </strong> compania dvs. vă urmărește; următorul lucru pe care trebuie să-l întrebi este, cât de multe date pot găsi de fapt companiile? Surprinzător, multe. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> Ce pot vedea angajatorii despre Wi-Fi și dispozitive la distanță ale companiei? </h2> <p> Majoritatea oamenilor nu își dau seama în ce măsură companiile au acces la datele lor sau cât de mult semnează atunci când utilizează dispozitivele companiei. Aici sunt cateva exemple. </p> <h3 id=\"location\"> Locație </h3> <p> Mulți angajați consideră că utilizarea unei rețele private virtuale (VPN) este suficientă pentru a-i face pe angajatori să creadă că sunt acolo unde ar trebui să fie. </p> <p> Deși există modalități de a vă ascunde locația reală pe un dispozitiv personal, aceasta nu este întru totul nebunie, mai ales atunci când sunteți conectat la orice aplicație sau site web cu o adresă de e-mail sau un număr de telefon mobil emis de companie. </p> <p> </p> <p> Poate fi aproape imposibil să vă ascundeți locația reală atunci când utilizați dispozitive emise de companie. De exemplu, companiile de telecomunicații pot detecta când v-ați conectat la oricare dintre partenerii lor de roaming. </p> <p> În plus, VPN-urile corporative sunt diferite de VPN-urile comerciale cu gateway-uri monitorizate de echipe IT interne. </p> <h3 id=\"notes-documents-and-emails\"> Note, documente și e-mailuri </h3> <p> Dacă credeți că nimeni nu știe că ați folosit Wi-Fi de companie pentru a vă găsi următorul loc de muncă, vă înșelați. Chiar dacă nu utilizați o adresă de e-mail a companiei, multe companii au programe preinstalate în laptopurile companiei care includ jurnale de activități în timp real, actualizări ale istoricului de navigare și capturi de ecran temporizate ale documentelor și e-mailurilor deschise. </p> <p> Pe premisa de a proteja împotriva posibilelor încălcări de date, multe companii le folosesc și ca mecanisme de raportare sau de urmărire a productivității. </p> <p> </p> <h3 id=\"online-messaging-history\"> Istoricul mesajelor online </h3> <p> În ciuda creșterii platformelor criptate, realitatea este că mesajele dvs. nu sunt în totalitate private pe dispozitivele corporative. Atunci când utilizează platforme de mesagerie, este posibil ca companiile să nu poată vedea detaliile exacte ale schimburilor dvs., dar probabil vor putea recunoaște metadatele, precum dimensiunea și tipul fișierului. </p> <p> Cu aceasta, dacă decideți să trimiteți fișiere PDF de dimensiuni mari printr-o aplicație precum WhatsApp, sistemul dvs. de detectare a intruziunilor companiei vă va semnala probabil pentru comportament suspect. În conformitate cu liniile directoare corporative, aceștia vă pot cere să demonstrați că acțiunile dvs. nu au fost rău intenționate și ar putea fi necesar să solicitați semnături de la conducere pentru autorizare. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> Cum să evitați partajarea datelor personale cu angajatorul dvs. </h2> <p> Nu există nicio modalitate absolută de a vă menține informațiile personale, conversațiile și activitățile complet la îndemână în orice moment. Cu toate acestea, există mai multe modalități prin care puteți reduce riscurile. </p> <p> Nu susținem ascunderea datelor de la angajatorii dvs.; de fapt, ei au dreptul de a colecta informații despre angajații lor - chiar și despre ființă <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> capabil să te urmărească legal </a> . Dar trebuie să știți când este potrivit să păstrați lucrurile pentru dvs. și asta depinde de companii individuale. </p> <h3 id=\"read-company-policies\"> Citiți politicile companiei </h3> <p> Înainte de a putea argumenta despre transparența datelor, trebuie să înțelegeți și tipul de informații pe care le oferiți cu bună știință angajatorului dvs. lucrând pentru ei. Doar atunci când știi ce este de așteptat poți stabili granițele profesionale adecvate. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Încercați să înțelegeți politicile și procedurile de colectare a datelor companiei înainte de a fi colectate. De acolo, puteți face în mod eficient un plan de renunțare la furnizarea mai multor informații decât este necesar. </p> <h3 id=\"use-personal-gadgets\"> Folosiți obiecte personale </h3> <p> Deși este întotdeauna tentant să folosiți dispozitivele companiei pentru a economisi bani, realitatea este că nimic nu este niciodată gratuit. Investiți în laptopuri, telefoane mobile și tablete pentru uz personal. </p> <p> A avea dispozitive personale separate este, de asemenea, o modalitate excelentă de a stabili limite, mai ales atunci când lucrați de la distanță. </p> <p> Utilizarea propriului dispozitiv vă oferă posibilitatea de a stabili și gestiona diferitele practici de securitate necesare pentru a vă păstra datele în siguranță de ochii curioși. Poate părea o cheltuială inutilă, dar parcurge un drum lung pentru a vă păstra liniștea sufletească. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Utilizați profiluri de oaspeți pe dispozitive personale </h3> <p> Conectarea la orice rețea care nu vă aparține este întotdeauna un risc de securitate, chiar dacă se află la locul de muncă. Conectarea la o companie Wi-Fi oferă angajatorului permisiunea de a accesa totul, de la metadatele mesajelor dvs. până la istoricele de navigare. </p> <p> Dacă aveți absolut nevoie să vă utilizați laptopul personal în rețelele companiei, puteți opta pentru a utiliza un profil de invitat pentru a reduce cantitatea de date pe care o pot accesa de la distanță. Alternativ, vă puteți conecta la planul de date al telefonului dvs. mobil sau la dispozitivul Wi-Fi portabil. </p> <h3 id=\"keep-your-passwords-safe\"> Păstrați parolele în siguranță </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Crearea parolelor puternice </a> nu este suficient. Trebuie să vă asigurați că parolele dvs. nu sunt salvate pe dispozitivele companiei. Salvarea parolelor personale pentru conturi bancare online, e-mailuri personale sau site-uri web guvernamentale pe gadgeturi pe care nu le dețineți pune datele dvs. în pericol imediat dacă baza de date a companiei dvs. este compromisă. </p> <p> Utilizați numai telefonul mobil personal sau laptopul pentru a accesa conturi importante, în special cele în care sunt implicați bani. Ori de câte ori este posibil, activați autentificarea cu doi factori. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> Separați-vă munca și viața personală </h2> <p> Angajatorii au dreptul de a accesa dispozitivul emis de compania dvs. de la distanță, în cazul în care suspectează că participați la orice formă de activitate ilegală, punând în pericol informațiile companiei sau solicitate de către organele de ordine pentru investigare. </p> <p> Cu toate acestea, acest lucru este diferit de dispozitivele personale. </p> <p> Securitatea dvs. este la fel de puternică ca și persoanele cu care sunteți în contact - inclusiv angajatorul dumneavoastră. Păstrarea separată a dispozitivelor personale și de lucru este doar un pas către descentralizarea datelor. Practicând măsuri de securitate puternice, puteți limita numărul de puncte de acces pe care hackerii le au la documente, e-mailuri și rețele. </p> <p> Descentralizarea datelor cu caracter personal este necesară, deoarece vă protejează, ca persoană fizică, și compania dvs. de furturi, fraude și alte forme de criminalitate informatică. </p>"}