{"title":"Cofondatorul Netflix critică strategia Apple TV + Video","content":"<p> Fostul șef Netflix, Marc Randolph, a criticat strategia video Apple, spunând că Apple TV + rămâne în urmă față de concurență din cauza ofertelor gratuite ale companiei și a lipsei de conținut convingător. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple nu este în flux „Cu ambele picioare” </h2> <p> Dacă îl întrebați pe fostul CEO și cofondator al Netflix, Marc Randolph, Apple TV a fost afectat de o problemă freeloader care a contribuit la creșterea anemică a serviciului în comparație cu Netflix, Disney + și alte servicii de streaming de succes. </p> <p> Vorbind cu <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Yahoo Finance </a> , a spus el că Apple TV + risipește energie în promoții și oferte gratuite, în timp ce ar trebui să se concentreze pe adăugarea mai multor conținuturi de calitate pentru a crește valoarea. </p> <blockquote> <p> Dacă Apple ar petrece un sfert la fel de mult timp pe conținut ca în cadouri, ar putea chiar să se joace. Nu au nicio scuză [și] încă nu sunt în ea cu ambele picioare. Chiar trebuie să facă treaba antreprenorială și să meargă până la marginea stâncii și să sară. </p> </blockquote> <p> Saltul de pe marginea stâncii poate fi mai ușor de spus decât de făcut, deoarece Apple TV + nu are puterea de piață Disney și recunoașterea mărcii Netflix. Chiar acum este vorba <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney + vs. Netflix </a> și ce serviciu de streaming oferă cea mai bună valoare pentru bani potențialilor clienți. </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV + are cea mai mare rată de churn </h2> <p> Randolph ia atitudine împotriva promoțiilor și promoțiilor de pe piața de streaming, sugerând că Apple TV + ‌ are „cea mai mare rată de churn” printre serviciile majore. </p> <blockquote> <p> Nu poți continua să înlocuiești oamenii. Trebuie să le dai un motiv să rămână. </p> </blockquote> <p> MoffettNathanson-HarrisX a constatat că 29% dintre cei care s-au înscris prin intermediul unui program gratuit nu intenționează să se aboneze din nou după expirarea perioadei de încercare gratuită, așa cum a raportat <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> varietate </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> Oferte gratuite Apple TV + </h2> <p> Apple oferă 12 luni de servicii gratuite Apple TV + tuturor celor care achiziționează un dispozitiv nou eligibil de la companie, cum ar fi un iPhone nou. Între timp, <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple a extins abonamentele gratuite pe tot parcursul anului </a> de două ori pentru cei care s-au înscris în 2019. </p> <p> </p> <p> Este un semnal clar, însăși Apple nu crede că serviciul oferă suficient conținut pentru a justifica prețul cerut de 5 USD / lună. Uită-te la asta într-un alt mod: dacă Apple TV + ar fi depășit proiecțiile interne, Apple s-ar fi lăudat deja cu numărul de abonați. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney + și Netflix oferă o concurență serioasă </h2> <p> Abia acum 15 luni, Apple TV + a debutat în noiembrie 2019. Disney + a urmat la scurt timp. Apple nu dezvăluie câți abonați plătitori are Apple TV +, dar Disney tocmai a trecut de 94 de milioane de abonați, depășind cu mult chiar propriile așteptări. </p> <p> Prin comparație, Netflix a numărat 204 milioane de clienți plătitori la sfârșitul anului 2020. Disney speră că s-ar putea potrivi cu Netflix din punct de vedere al abonaților în doar 12 luni. </p> <p> </p> <p> Randolph spune că Disney + „s-a luptat până la o poziție foarte puternică” datorită conținutului. &quot;Este într-adevăr un război al cine este pregătit să facă conținutul&quot;, a adăugat el. </p> <blockquote> <p> Vedem noi reguli ale jocului în curs de dezvoltare. Acest lucru nu este doar anunț, nu este doar să ai o promoție --- ceea ce trebuie să demonstrezi este că ai conținut, conținut, conținut. </p> </blockquote> <p> Într-adevăr, jocul este despre conținut. De exemplu, după cum este subliniat în <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> planurile sale pentru 2021 </a> , Netflix va lansa un nou film original în fiecare săptămână pe tot parcursul anului. În schimb, Apple TV + prezintă o mână de filme precum drama Greyhound, interpretată de Tom Hanks (bazată pe evenimente adevărate), drama originală Palmer cu Justin Timberlake și On The Rocks, de Sofia Coppola, pentru a numi doar câteva. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> Abordarea Apple cu încetinire </h2> <p> Ceea ce Randolph nu recunoaște este că Netflix și Disney + au avut cantități masive de conținut din prima zi, în timp ce Apple TV + își construiește biblioteca de conținut de la zero. </p> <p> În mod evident, Apple a optat pentru o abordare cu ardere lentă, dovadă fiind lipsa de emisiuni în raport cu Disney + și Netflix. Indiferent de modul în care îl priviți, strategia sa cu Apple TV + pare să atragă oamenii cu oferte gratuite în speranța că serviciul adună conținut de calitate suficientă pentru a transforma clienții gratuiți în abonați cu plată. </p>"}