{"title":"Cum se creează sau se editează un model în Adobe Illustrator","content":"<p> Creați un model în Adobe Illustrator și îl puteți aplica rapid la forme, linii și chiar text. Puteți face ceva simplu, cum ar fi un model de puncte, sau puteți face ceva mai complex. Puteți utiliza chiar și o parte dintr-o grafică vectorială existentă și o puteți transforma și într-un model. </p> <p> Modelele sunt excelente pentru fundaluri, texturi și multe altele. Iată cum să utilizați instrumentele de modele Illustrator și cum să creați și să editați propriile dvs. modele. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Utilizarea modelelor implicite în Adobe Illustrator </h2> <p> Illustrator vine cu mai multe modele încorporate chiar în el. Pe lângă faptul că sunt utile în sine, sunt și un mod bun de a vedea cum funcționează tiparele. Aceste modele vă vor oferi, de asemenea, o idee despre cum să vă utilizați propriile modele după ce le-ați creat. </p> <p> </p> <p> Puteți găsi modele în fereastra Swatches. Dacă nu este deja deschis, accesați <strong> Window&gt; Swatches </strong> din meniul de sus. În plus față de culorile solide, este posibil să existe deja câteva modele în fereastra Swatches - dar acestea nu sunt singurele modele pe care Illustrator le are. </p> <p> Apasă pe <strong> Biblioteca Swatch </strong> pictogramă din partea stângă jos a ferestrei Swatch. Pune deasupra <strong> Model </strong> , apoi alegeți una dintre bibliotecile de mostre de tipare. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Acum puteți aplica aceste mostre așa cum ați face cu culori solide. Aici puteți vedea modele din <strong> Nature_Foliage </strong> bibliotecă aplicată ca umpluturi și linii, precum și textului. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> Cum se face un model de bază de repetare în Illustrator </h2> <p> Puteți transforma orice vector într-un model, indiferent dacă este ceva ce ați proiectat deja sau ceva ce creați având în vedere această intenție specifică. O puteți face cu o întreagă grafică vectorială, un singur strat sau orice altceva între ele. </p> <p> Tot ce trebuie să faceți este să selectați ceea ce doriți să transformați într-un model și apoi să îl trageți în fereastra Swatches. De exemplu, ați putea trage ochiul acestei pisici în Swatches. Acest lucru ar crea un model de model, pe care îl puteți utiliza pentru a umple un dreptunghi sau orice altă formă. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> Alternativ, ați putea face același lucru cu întregul vector. În ambele cazuri, Illustrator va crea un model din orice trageți în fereastra Swatches. Puteți aplica pur și simplu specimenul așa cum ați face cu orice specimen normal de culoare. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Dacă faceți dublu clic pe specimenul de model din fereastra Specimene, acesta va deschide fișierul <strong> Opțiuni de model </strong> fereastră. Puteți deschide acest lucru direct de la <strong> Windows&gt; Opțiuni model </strong> în meniul de sus. </p> <p> Aici, puteți modifica în continuare modelul dvs., inclusiv modul în care se repetă și cât de mari sunt diferențele dintre fiecare iterație a imaginii. De asemenea, modificați designul modelului direct aici. Versiunea imaginii care nu este estompată poate fi editată în mod normal. Puteți schimba culorile, muta straturile și așa mai departe. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> Puteți face diverse lucruri cu fereastra Opțiuni model. Puteți, de exemplu, să vă repetați imaginea într-un aspect eșalonat din cărămidă și să reduceți decalajul dintre fiecare parte a modelului. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> Aduceți părțile modelului suficient de aproape și le puteți face să se suprapună. Procedând astfel, puteți crea un fel de model cu plăci ca cel prezentat mai jos. Încercați toate setările diferite de suprapunere din Opțiunile modelului pentru a găsi ceva care funcționează pentru dvs. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> Cum să creați un model fără sudură în Adobe Illustrator </h2> <p> Dacă doriți să creați un model geometric fără sudură, trebuie să vă asigurați că există simetrie în design. De exemplu, o linie care începe cu 10 px în sus pe partea stângă a modelului dvs. trebuie să se încheie cu 10 px în sus pe partea dreaptă. Când se repetă, aceste puncte vor trebui să se unească. </p> <p> Pentru aceasta, creați un nou document cu dimensiuni pătrate. Activați suprapunerea grilei apăsând <strong> Ctrl + &quot; </strong> ( <strong> Cmd + &quot; </strong> pe Mac). Ghidurile inteligente sunt de asemenea utile - activați-le cu <strong> Ctrl + U </strong> ( <strong> Cmd + U </strong> pe Mac). Dacă conducătorii dvs. nu sunt vizibili, apăsați <strong> Ctrl + R </strong> ( <strong> Cmd + R </strong> pe Mac) pentru a le activa. </p> <p> Puteți găsi, de asemenea, aceste setări în <strong> Vedere </strong> în meniul de sus, dar vă recomandăm să utilizați <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Taste rapide de la Illustrator </a> unde puteți pentru a economisi timp. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Așezați-vă designul în pătrat. Orice piese care trec peste margini vor trebui aliniate pe cealaltă parte. <strong> Alinia </strong> instrument ( <strong> Fereastră&gt; Aliniați </strong> ) vă poate ajuta să faceți lucrurile aliniate corect. Faceți clic și trageți de la rigle pentru a vă crea propriile ghiduri acolo unde aveți nevoie de ele. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> Este important să aveți și o culoare de fundal, chiar dacă este albă. Asigurați-vă că acest lucru se potrivește perfect cu marginile planșei, deoarece aveți nevoie de el pentru a tăia materialul superflu. </p> <p> Selectați totul cu <strong> Ctrl + A </strong> ( <strong> Cmd + A </strong> pe Mac), apoi apăsați <strong> Shift + M </strong> pentru a activa <strong> Constructor de forme </strong> instrument. Acest lucru poate fi găsit și în caseta de instrumente. Țineți apăsat <strong> Alt </strong> ( <strong> Opțiune </strong> pe Mac). Aceasta pune <strong> Constructor de forme </strong> instrument în modul de scădere. </p> <p> Pe măsură ce treceți cu mouse-ul peste părțile designului dvs. cu acest instrument, ar trebui să le vedeți schimbându-și ușor culoarea. Faceți clic pe zonele pe care nu le doriți, iar Illustrator va elimina acele părți, lăsând doar biții care se suprapun cu pătratul de fundal. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> După ce ați terminat, selectați totul și trageți-l în mostre pentru a-l transforma într-un model. Pentru a utiliza modelul într-un document nou, îl puteți salva într-o bibliotecă de probe sau puteți utiliza biblioteca dvs. Adobe Cloud. </p> <p> Alternativ, îl puteți copia doar din această fereastră Swatch și îl puteți lipi într-o altă fereastră Swatch pe un alt document. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Acum puteți aplica acest model așa cum ați face cu oricare altul. Dacă ați făcut-o corect, totul ar trebui să se alinieze fără goluri. Efectuați ajustări în documentul dvs. de model, dacă este necesar. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> Când ar trebui să utilizați modele în Adobe Illustrator? </h2> <p> Cea mai evidentă utilizare pentru modele este de a crea plăci repetabile pentru fundaluri, dar le puteți folosi pentru a completa forme pentru a le oferi și textură. Textul plin de modele este o altă utilizare bună și poate face ca tipografia dvs. să iasă în evidență. </p> <p> Dacă doriți, puteți chiar să vă creați manual propriile modele, copiind și lipind aceeași imagine din nou și din nou. S-ar putea să apară ocazii când veți dori să faceți acest lucru, dar de cele mai multe ori, abilitatea Illustrator de a automatiza crearea modelelor va fi calea de urmat. </p> <p> Este doar una dintre multele modalități prin care Illustrator vă poate ușura viața, oferindu-vă mai mult timp pentru a lucra la design-urile dvs. </p>"}