{"title":"Cum se remediază BSOD VIDEO_TDR_FAILURE în Windows 10","content":"<p> Eroarea VIDEO_TDR_FAILURE înseamnă că placa grafică este defectă sau că driverele de afișaj pot fi depășite / funcționează defectuos. Dar ar putea exista și alte motive, cum ar fi supraîncălzirea componentelor sau fișierele de sistem corupte. TDR este prescurtarea <strong> Expirare, detectare și recuperare </strong> , o metodă utilizată de Windows pentru identificarea și remedierea componentelor software care funcționează defectuos. </p> <p> Dacă întâmpinați această eroare, nu vă temeți, deoarece următoarele metode vor remedia eroarea VIDEO_TDR_FAILURE mai repede decât v-ați aștepta. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Actualizați și reinstalați driverele de afișare </h2> <p> După cum s-a menționat mai sus, eroarea este de obicei rezultatul unor disfuncționalități sau a unor drivere de afișare învechite. Astfel, ar trebui să vă actualizați driverele pentru plăci grafice. Dacă asta nu o remediază, reinstalați-le. În funcție de placa grafică, este posibil să întâlniți diferite nume de fișiere legate de eroare. </p> <ol> <li> Pentru utilizatorii Nvidia, este <strong> nvlddmkm.sys </strong> . Dacă se întâmplă să fii utilizator Nvidia, iată-le <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 moduri simple de a remedia eroarea. </a> </li> <li> Pentru utilizatorii AMD, eroarea apare ca <strong> atikmpag.sys </strong> . </li> <li> Pentru utilizatorii Intel HD, eroarea este <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> Cum se actualizează driverele de afișare </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> presa <strong> Tasta Windows + R </strong> pentru a deschide comanda Run. Introduceți <strong> devmgmt.msc </strong> și apăsați Enter. </li> <li> În <strong> Manager de dispozitiv </strong> fereastră, navigați la <strong> Adaptoare de afișaj </strong> și extindeți-l. </li> <li> Faceți clic dreapta pe adaptorul de afișaj, apoi selectați <strong> Actualizați driver-ul </strong> . </li> <li> Selectați <strong> Căutați automat software-ul actualizat al driverului </strong> . </li> <li> Windows va căuta automat pe web și va descărca driverele necesare. Vă rugăm să vă asigurați că aveți o conexiune activă la internet în timp ce faceți acest lucru. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> Cum se reinstalează driverele de afișare </h3> <p> Dacă BSOD-ul video tdr persistă după actualizarea driverelor de afișare, cel mai bine este să reinstalați acești drivere. Este recomandabil să faceți acest lucru în timp ce Windows este pornit în modul sigur. Dar înainte de a face acest lucru, ar trebui să vă îndreptați către site-ul web al producătorului plăcii grafice și să descărcați cea mai recentă versiune a driverelor grafice. </p> <p> Cele mai comune produse sunt <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> , și <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intel </a> . </p> <p> Pentru a porni în modul sigur, urmați acești pași: </p> <ol> <li> presa <strong> Tasta Windows + R, </strong> și în caseta de dialog Executare, tastați <strong> msconfig, </strong> și apăsați Enter. </li> <li> În <strong> Configurarea sistemului </strong> fereastra, faceți clic pe <strong> Cizmă </strong> filă. </li> <li> Acum bifați <strong> Mod sigur </strong> caseta de selectare situată în partea de jos. </li> <li> Aplicați setările și reporniți computerul. </li> </ol> <p> După pornirea în modul sigur, este timpul să reinstalați driverele de afișare. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> În bara de căutare a meniului Start, tastați <strong> Manager de dispozitiv </strong> și deschide-l. </li> <li> Cauta <strong> Adaptoare de afișaj </strong> și extindeți meniul. </li> <li> Faceți clic dreapta pe GPU și faceți clic pe <strong> Dezinstalați dispozitivul </strong> . </li> <li> În expertul de dezinstalare, asigurați-vă că verificați <strong> Ștergeți software-ul driverului pentru acest dispozitiv </strong> cutie. </li> <li> Așteptați ca Windows să dezinstaleze dispozitivul și să repornească computerul. </li> <li> Acum, reinstalați driverele grafice pe care le-ați descărcat anterior. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Utilizați SFC pentru a scana și remedia fișierele de sistem </h2> <p> SFC este un utilitar Windows încorporat care poate fi utilizat pentru scanarea și remedierea fișierelor de sistem corupte. În cazul unui BSOD, este foarte probabil ca unele fișiere de sistem să fie corupte, astfel încât rularea acestui utilitar este imperativă. Este doar unul dintre <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> mai multe utilitare utile disponibile </a> la dispoziția unui utilizator Windows. </p> <p> Pentru a rula SFC, urmați acești pași: </p> <ol> <li> În bara de căutare a meniului Start, tastați <strong> cmd </strong> . </li> <li> Faceți clic dreapta pe <strong> Prompt de comandă </strong> și selectați <strong> Rulat ca administrator </strong> . </li> <li> În consolă, tastați <strong> sfc / scannow </strong> și apăsați Enter. </li> <li> După finalizarea procesului de scanare și reparare, reporniți computerul. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Rulați Repararea la pornire </h2> <p> Pentru utilizatorii care primesc eroarea imediat ce pornesc Windows 10 sau la scurt timp după ce s-au conectat, reparația la pornire este o bunătate. Această caracteristică Windows verifică anomaliile în timpul pornirii și le remediază imediat. </p> <p> Deoarece această secțiune se adresează utilizatorilor ale căror computere au devenit inutilizabile din cauza erorii, adică nu se pot deschide <strong> Setări </strong> , vor trebui să repornească din greu pentru a intra în Windows Recovery Environment (winRE). </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Urmați acești pași pentru a porni în mediul de recuperare Windows: </p> <ol> <li> Țineți apăsat butonul de alimentare până când computerul se oprește. </li> <li> Apăsați din nou butonul de pornire pentru a porni computerul. </li> <li> Repetați primul și al doilea pas până când computerul pornește în modul Recuperare. Va fi un ecran albastru. </li> <li> În ecranul de recuperare, faceți clic pe <strong> Consultați opțiunile avansate de reparații </strong> . </li> <li> În ecranul următor, faceți clic pe <strong> Depanare </strong> </li> <li> Click pe <strong> Opțiuni avansate </strong> </li> <li> Click pe <strong> Reparare la pornire </strong> și introduceți acreditările când vi se solicită. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Schimbați setările de gestionare a energiei </h2> <p> Setările de gestionare a energiei Windows sunt de obicei bine optimizate, dar uneori pot interfera cu modul în care computerul dvs. gestionează grafica. Acest lucru este valabil mai ales atunci când computerul are un GPU discret. Setările optime pentru a evita obținerea BSOD VIDEO_TDR_FAILURE sunt prezentate mai jos: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> În bara de căutare a meniului Start, tastați <strong> Panou de control </strong> și deschide-l. </li> <li> În bara de căutare a panoului de control, introduceți „opțiuni de alimentare” și apăsați Enter. </li> <li> Click pe <strong> Opțiuni de putere, </strong> și lângă planul de alimentare pe care îl utilizați, faceți clic pe <strong> Schimbați setările planului. </strong> </li> <li> Click pe <strong> Modificați setările avansate de alimentare. </strong> </li> <li> Cauta <strong> PCI E </strong><strong> xpress </strong> și extindeți-l. </li> <li> Întoarceți <strong> Gestionarea energiei de stat a legăturii </strong> setarea la <strong> Off </strong> . </li> <li> Salvați modificările și reporniți computerul. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Curățați computerul </h2> <p> Supraîncălzirea nu este niciodată un lucru bun și, de obicei, motivul din spatele acesteia este acumularea de praf. Este recomandat ca utilizatorii să își curețe componentele PC-ului de orice praf în fiecare lună. Dar fii atent. Ar trebui făcut cu blândețe. </p> <p> Asigurați-vă că ați curățat partea superioară a plăcii grafice, a ventilatorului CPU, a sursei de alimentare și a ventilatoarelor din dulap. Una peste alta, asigurați-vă că evitați <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> greșeli de întreținere care ar putea deteriora componentele scumpe. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Verificați componentele hardware </h2> <p> Dacă eroarea apare în continuare după ce ați încercat toate cele enumerate mai sus, este posibil să existe o eroare în hardware-ul în sine. Utilizatorii care au o placă grafică dedicată ar trebui să o scoată și să pornească computerul. Dacă eroarea este rezolvată, atunci este o eroare hardware în GPU-ul în sine. Puteți încerca să contactați producătorul și să încercați să înlocuiți unitatea. </p> <p> </p> <p> Când utilizați grafică la bord, încercați să le dezactivați și să porniți. Pentru a le dezactiva, urmați acești pași: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> presa <strong> Tasta Windows + R, </strong> tip <strong> devmgmt.msc </strong> în caseta de text Executare și apăsați Enter. </li> <li> În <strong> Manager de dispozitiv </strong> , cauta <strong> Adaptoare de afișaj </strong> și extindeți meniul. </li> <li> Faceți clic dreapta pe GPU-ul integrat și faceți clic pe <strong> Dezactivați dispozitivul </strong> . </li> <li> Reporniți computerul și verificați dacă eroarea este rezolvată. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> Eroarea „Eroare TDR video” a fost rezolvată cu succes </h2> <p> Pentru majoritatea utilizatorilor, o simplă actualizare sau reinstalare a driverelor de afișare va rezolva problema. Dar dacă răul se înrăutățește, poate fi necesar să vă resetați computerul sau să înlocuiți unele componente hardware. </p>"}