{"title":"Cum să efectuați o pornire curată în Windows 10","content":"<p> Probabil aveți o multitudine de aplicații terțe instalate pe computerul dvs. Windows. Nu vă faceți griji, majoritatea oamenilor. </p> <p> De la îndeplinirea sarcinilor de bază, cum ar fi navigarea pe web, până la eliminarea liniilor complexe de cod, oamenii preferă să utilizeze aplicații alternative din cele încorporate în Windows. În timp ce aceste aplicații ne ușurează viața, uneori interferează cu funcțiile sistemului. Acestea pot varia de la accidentele minore la erori critice și BSOD-uri. </p> <p> Aici intră în imagine bootul curat. </p> <h2 id=\"what-is-a-windows-clean-boot-anyway\"> Ce este o pornire Windows Clean, oricum? </h2> <p> O pornire Windows 10 curată permite utilizatorilor să excludă aplicațiile terțe ca fiind cauza unei erori. Se face prin simpla pornire a dispozitivului cu toate aplicațiile terță parte dezactivate. Și, chiar dacă numele pare să fie o caracteristică Windows încorporată, nu este. Trebuie să curățați manual pornirea computerului. </p> <p> Avantajele unui boot curat nu se limitează doar la diagnosticarea erorilor. Se știe că ajută când <a href=\"https://www.makeuseof.com/tag/fix-windows-update-error-0x80070057/\" target=\"_blank\" rel=\"nofollow noopener\"> Actualizările Windows nu se instalează corect </a> . Este, de asemenea, util în special atunci când sistemul dvs. de operare se simte lent și doriți să verificați ceea ce poate cauza problema. </p> <p> </p> <p> </p> <h2 id=\"how-to-clean-boot-and-fix-errors\"> Cum se curăță erorile de pornire și de remediere </h2> <p> Pornirea curată este un proces relativ simplu odată ce utilizatorii au încercat-o de câteva ori. </p> <p> Înainte de a enumera pașii, utilizatorii ar trebui să știe că unele acțiuni necesită privilegii de administrator. De asemenea, este posibil ca computerul dvs. să nu funcționeze așa cum sunteți obișnuiți, dar nu este nevoie să îl transpirați. Acest lucru se întâmplă deoarece uneori utilizatorii nici măcar nu sunt conștienți de faptul că unele sarcini minore sunt preluate de software-ul terț. </p> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-128.png\" loading=\"lazy\"> </p> <p> Iată pașii privind modul de curățare a pornirii Windows 10: </p> <ol> <li> În bara de căutare a meniului Start, tastați <strong> sysconfig </strong> și faceți clic pe <strong> Configurarea sistemului </strong> . </li> <li> În <strong> Configurarea sistemului </strong> fereastră, du-te la <strong> Servicii </strong> filă. </li> <li> Verifică <strong> Ascunde toate serviciile Microsoft </strong> cutie. </li> <li> Verificați toate serviciile din listă și faceți clic pe <strong> Dezactivați toate </strong> situat spre dreapta jos, apoi salvați și ieșiți. </li> <li> Acum, deschideți fișierul <strong> Gestionar de sarcini </strong> . Puteți face acest lucru făcând clic dreapta pe bara de activități și selectând <strong> Gestionar de sarcini </strong> sau folosind <strong> Ctrl + Alt + Șterge </strong> . </li> <li> În <strong> Gestionar de sarcini </strong> fereastră, navigați la <strong> Lansare </strong> filă. </li> <li> Selectați toate serviciile unul câte unul și faceți clic <strong> Dezactivează </strong> . </li> <li> Ieșire <strong> Gestionar de sarcini </strong> și <strong> Repornire </strong> computerul tau. </li> </ol> <p> <img alt=\"Startup tab in the task manager\" src=\"images/startup-tab-task-manager-383.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"fixing-errors-with-clean-boot\"> Rezolvarea erorilor cu boot curat </h2> <p> După ce urmați pașii enumerați mai sus, <a href=\"https://www.makeuseof.com/tag/clean-computer-original-state-reinstalling-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> PC-ul va porni într-o stare curată. </a> Primul lucru pe care trebuie să îl facă utilizatorii este să aștepte și să verifice dacă aceeași eroare apare din nou. Uneori, sursa erorii ar putea fi fișiere de sistem Windows, caz în care eroarea va apărea, dar ar putea dura mai mult decât o face în timpul unui boot normal. </p> <p> Dacă eroarea nu apare, atunci este timpul să restrângeți suspecții. Aceasta este o sarcină oarecum plictisitoare, dar, din păcate, este și cea mai bună modalitate de a face asta. Pentru a restrânge lista, procedați în felul următor: </p> <ol> <li> În timp ce este într-o stare de încărcare curată, deschideți <strong> Configurarea sistemului </strong> . </li> <li> Sub <strong> Servicii </strong> , selectați jumătatea superioară a listei și faceți clic pe <strong> Permite </strong> . Asigurați-vă că <strong> Ascunde toate serviciile Microsoft </strong> caseta este bifată. </li> <li> Acum deschis <strong> Gestionar de sarcini </strong> și du-te la <strong> Lansare </strong> filă. </li> <li> În mod similar, activați jumătatea superioară a serviciilor și reporniți computerul. </li> </ol> <p> După repornire, dacă eroarea nu apare, puteți exclude software-ul și serviciile selectate din lista de vinovați. Va trebui să repetați acești pași până când veți găsi programul sau serviciul responsabil și îl veți dezinstala. </p> <p> </p> <h2 id=\"clean-boot-windows-10-to-isolate-errors\"> Curățați Windows 10 pentru a izola erorile </h2> <p> Acum este timpul să reporniți Windows 10 ca standard. Doar deschide <strong> Configurarea sistemului </strong> și <strong> Gestionar de sarcini </strong> și să activeze toate serviciile și programele. Este recomandat ca utilizatorii să efectueze o pornire curată înainte de a recurge la remedieri mai avansate atunci când Windows se blochează sau afișează un BSOD. </p>"}