{"title":"Ce este timpul Unix și când a fost epoca Unix?","content":"<p> De ce Unix are propriul său concept de timp? Care este epoca și care este problema Y2038? </p> <p> Ora Unix este un mijloc de a reprezenta o dată și o oră specifice, utilizate de Linux, macOS și multe alte sisteme interoperabile. Este atât de răspândit, încât probabil îl folosești fără să fii conștient de el. Odată ce înțelegeți timpul Unix, îl veți vedea în multe contexte. Mai multe instrumente vă pot ajuta să lucrați cu Unix time. </p> <h2 id=\"what-is-the-purpose-of-unix-time\"> Care este scopul Unix Time? </h2> <p> Ora Unix este un număr de secunde totale de la o dată și o oră fixe. Este un format de dată / oră (sau marcaj de timp) care arată diferit de datele și orele citite de om cu care suntem obișnuiți. Acest lucru este doar din motive de eficiență. Este nevoie de mult mai puțin spațiu pentru a stoca un singur număr reprezentând secunde decât pentru a stoca valori separate pentru an, lună, oră etc. </p> <p> Desigur, în termeni moderni, diferența de spațiu nu este deloc atât de mare. Dar luați în considerare faptul că Unix a apărut la sfârșitul anilor 1960, când stocarea disponibilă era mult mai mică. Ștampilele de timp sunt, de asemenea, folosite foarte mult, astfel încât stocarea lor se adaugă. De exemplu, fiecare fișier are trei marcaje de timp asociate. </p> <p> Formatul este aproape imposibil de tradus în cap, dacă nu ești un geniu matematic. Dar are încă unele avantaje față de alternative mai lizibile, cum ar fi <strong> Miercuri, 21 octombrie 2015 07:28:00 GMT </strong> . Puteți comanda două marcaje de timp Unix foarte ușor, dintr-o privire. De asemenea, este de obicei mai rapid să stabilim diferența dintre două timestampuri. Acest lucru este valabil mai ales pentru datele apropiate, cum ar fi în zilele adiacente. </p> <p> <img alt=\"A screenshot from the Epoch Converter site showing Unix Time\" src=\"images/epoch-converter-110.png\" loading=\"lazy\"> </p> <h3 id=\"about-the-epoch\"> Despre Epocă </h3> <p> Deci, timpul Unix este un număr total de secunde de la un anumit moment în timp. Dar care este acel moment în timp? Este <strong> 00:00:00 UTC </strong> pe <strong> 1 ianuarie 1970 </strong> . Aceasta este adesea denumită Epoca Unix. Programatorii au ales această dată pentru epocă din comoditate, deoarece a fost cea mai apropiată dată rotundă când au inventat ora Unix. </p> <p> Este posibil să fi văzut bine această dată când ceva nu a mers bine. Este în mod clar o eroare, dar care pare foarte ciudată atunci când rezultă o întâlnire dinaintea timpului în care s-au născut mulți dintre noi! Totuși, este complet de înțeles când știi despre timpul Unix. Dacă vreun sistem încearcă să afișeze un timestamp care nu are nicio valoare, acesta se va traduce adesea la 0 și va duce la data exactă a epocii. </p> <p> </p> <h2 id=\"the-unix-time-data-format\"> Formatul de date Unix Time </h2> <p> Strict vorbind, nu există una. Tipul de date original era un număr întreg de 32 de biți, iar acest lucru rămâne adesea cazul, chiar și în sisteme mult mai puternice. </p> <p> Acest tip de date permite ca valoarea să stocheze în total 2 ^ 32 de secunde, adică puțin peste 136 de ani. Această valoare este de obicei semnată, ceea ce înseamnă că poate fi negativă sau pozitivă. Deci, reprezintă de obicei 68 de ani de ambele părți ale epocii, adică 1902-2038. </p> <p> Desigur, este încă o perioadă limitată. Dar utilizarea principală a formatului timestamp a fost pentru concepte precum modificarea fișierelor. Nevoia era foarte mult să reprezinte timpul apropiat de prezent, mai degrabă decât istoria antică sau departe în viitor. Chiar și pentru aplicații precum calendarele, rareori este nevoie să se reprezinte date mai mult de câteva decenii în viitor. </p> <p> Dar asta nu înseamnă că acest interval de timp limitat este fără probleme ... </p> <h3 id=\"the-year-2038-problem\"> Problema Anului 2038 </h3> <p> Bugul Y2K ( <a href=\"https://www.makeuseof.com/tag/worst-programming-mistakes-in-history/\" target=\"_blank\" rel=\"nofollow noopener\"> una dintre cele mai grave greșeli de programare din istorie </a> ) a afectat sistemele informatice care au stocat ani ca valori din două cifre. Când a venit anul 2000, astfel de sisteme l-au tratat ca și când ar fi fost 1900. În acest caz, acest lucru nu a fost atât de catastrofal pe cât se temea, în principal pentru că mulți oameni au petrecut mult timp și efort în avans, pregătindu-se pentru el. </p> <p> Dacă ați fi atent în secțiunea anterioară, este posibil să fi observat o problemă similară care ar putea afecta timpul Unix. Ei bine, timpul Unix are o problemă proprie de date: problema Y2k38. (Este adesea denumită o problemă, nu o eroare; poate că am devenit mai optimiști începând cu anul 2000!) Când timpul Unix expiră literalmente în 2038, sistemele vor trata noi date fie ca 1902 sau 1970. Sau, probabil, ele Voi eșua cu totul. </p> <p> Cel puțin această problemă nu ne va atinge la miezul nopții de Revelion. Ultima secundă a timpului Unix pe 32 de biți va cădea pe 19 martie. În eventualitate, probabil că vom actualiza majoritatea sistemelor până în 2038 sau oricum vor fi învechite până atunci. </p> <p> </p> <h2 id=\"some-useful-timestamp-resources\"> Unele resurse utile de marcare a timpului </h2> <p> <a href=\"https://www.epochconverter.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Convertor de epocă </a> site-ul este probabil cel mai cuprinzător convertor de timestamp disponibil. Începe prin afișarea timpului actual Unix - în timp real - și adaugă aproape toate caracteristicile imaginabile pe deasupra. Utilizarea sa principală este pentru conversia între marcajele de timp și datele citite de om, în ambele direcții. </p> <p> Dan’s Tools este o colecție uriașă de aplicații web utile, dintre care una este <a href=\"https://www.unixtimestamp.com/index.php\" target=\"_blank\" rel=\"nofollow noopener\"> convertor timestamp </a> . Este mai simplu, dar are o prezentare foarte curată și este ușor de utilizat. </p> <p> <a href=\"https://time.is/Unix_time_now\" target=\"_blank\" rel=\"nofollow noopener\"> Timpul este </a> prezintă un alt aspect, chiar mai minimalist. Afișează timpul în mai multe formate, inclusiv ora Unix. Acesta include ora curentă în titlul paginii sale, care este util. </p> <p> <img alt=\"A screenshot of the Time.is websites showing Unix Time\" src=\"images/time-is-177.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"using-unix-time-with-command-line-tools\"> Utilizarea Unix Time cu instrumentele pentru linia de comandă </h2> <p> Pe Linux și MacOS, <strong> Data </strong> programul este utilitarul principal pentru tratarea datei / orei, inclusiv a marcajelor de timp Unix. Apelat fără niciun argument, returnează data / ora curentă într-un format lizibil de către om: </p> <pre><code class=\"hljs ruby\">$ date<br>Wed Feb 10 12:28:30 GMT 2021</code></pre> <p> Dacă aveți nevoie de data / ora curentă în ora Unix, utilizați <strong> +% s </strong> argument: </p> <pre><code class=\"hljs ruby\">$ date +%s<br>1612960114</code></pre> <p> Puteți converti dintr-o dată citibilă de om într-o marcă de timp folosind <strong> -d </strong> semnalizați dacă versiunea dvs. de <strong> Data </strong> îl susține. Majoritatea versiunilor Linux ar trebui, în mod implicit: </p> <pre><code class=\"hljs ruby\">$ date -d \"Jan 2 1970\" +%s<br>82800</code></pre> <p> Pe macOS, <strong> Data </strong> este un program diferit, care necesită un set diferit de steaguri: </p> <pre><code class=\"hljs perl\">$ date -j -f \"%b %d %Y %T\" \"Jan 02 1970 00:00:00\" \"+%s\"<br>82800</code></pre> <p> Mergând în cealaltă direcție, puteți converti dintr-un timestamp Unix folosind <strong> -r </strong> steag: </p> <pre><code class=\"hljs ruby\">$ date -r 1600000000<br>Sun 13 Sep 2020 13:26:40 BST</code></pre> <p> Unele alte programe folosesc <strong> % s </strong> format pentru a face față timpului Unix. De exemplu, dacă doriți să afișați data modificării unui fișier în timpul Unix, cu <a href=\"https://www.makeuseof.com/ls-command-linux/\" target=\"_blank\" rel=\"nofollow noopener\"> Versiunea Linux a <strong> eu sunt </strong></a> , puteți utiliza următoarele: </p> <pre><code class=\"hljs perl\">$ ls -l --time-style=+%s index.tmp.html<br>-rw-r--r-- 1 ubuntu ubuntu 17862 1521649818 index.tmp.html</code></pre> <p> </p> <h2 id=\"how-to-use-unix-time-in-programming-languages\"> Cum se utilizează Unix Time în limbaje de programare </h2> <p> PHP are <strong> timp() </strong> funcție care returnează marcajul de timp actual Unix. Este <strong> Data() </strong> funcția ia un timestamp ca al doilea argument: </p> <pre><code class=\"hljs ruby\">$ php -r 'echo date(\"Y-m-d\", time());'<br>2021-02-11</code></pre> <p> JavaScript abordează lucrurile într-un mod interesant. Are o <strong> Date.now () </strong> metoda pentru a obține numărul de milisecunde de la epoca Unix. Desigur, puteți împărți acest lucru la 1.000 și rotunji rezultatul pentru a da timpul Unix echivalent în secunde: </p> <pre><code class=\"hljs perl\">> Math.floor(Date.now() / 1000)<br>1613083012</code></pre> <p> </p> <h2 id=\"understanding-unix-time\"> Înțelegerea Unix Time </h2> <p> Unix time este un concept simplu care apare în multe locuri. După ce îl înțelegeți, s-ar putea să-l găsiți destul de util atunci când calculați diferențele de timp, de exemplu. De asemenea, puteți recunoaște când poate fi cauza anumitor bug-uri. </p> <p> Concepte precum epoca și marcajele de timp sunt o parte importantă a începutului cu Linux. Pentru a afla mai multe despre elementele esențiale precum <strong> eu sunt </strong> , consultați ghidul nostru pentru comenzile Linux de bază. </p>"}