{"title":"Cum să gestionați grupurile de utilizatori cu Groupadd pe Linux","content":"<p> Gestionarea utilizatorilor este destul de simplă dacă rulați Linux pe computerul personal. Dar, pentru cei care au un server cu mii de utilizatori, managementul devine o problemă serioasă de care ar trebui să avem grijă. </p> <p> Din fericire, sistemele de operare bazate pe Linux vă oferă o modalitate de a controla și gestiona utilizatorii din sistemul dvs. Puteți crea grupuri și adăuga utilizatori la acestea. Apoi, în loc să atribuiți permisiuni fiecărui utilizator din sistem, puteți autoriza cu ușurință grupurile de utilizatori oferindu-le privilegii asociate fluxului de lucru al sistemului. </p> <h2 id=\"create-user-groups-on-linux\"> Creați grupuri de utilizatori pe Linux </h2> <p> Linux vine cu o comandă implicită pentru crearea grupurilor de utilizatori. Puteți utiliza <strong> groupadd </strong> pentru a adăuga noi grupuri la sistemul dvs. Sintaxa de bază a comenzii este: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> Pentru a crea un nou grup de „scriitori” de utilizatori: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> Rularea comenzii menționate mai sus va adăuga o nouă intrare la <strong> / etc / group </strong> și <strong> / etc / gshadow </strong> fișierele din sistemul dvs. Puteți verifica noua intrare de grup din fișiere tastând <strong> pisică / etc / grup </strong> și <strong> pisica / etc / gshadow </strong> în terminalul tău. </p> <p> Rețineți că numai utilizatorii cu permisiuni administrative pot crea grupuri de utilizatori. Nu uitați să treceți la superutilizator înainte de a executa comanda groupadd. </p> <p> Dacă încercați să creați un grup cu un nume care există deja, veți vedea o eroare care afirmă: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> Cu toate acestea, puteți respinge eroarea utilizând fișierul <strong> -f </strong> sau <strong> --forta </strong> steag cu comanda. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Creați grupuri de utilizatori cu GID unic </h3> <p> Când creați un nou grup de utilizatori, sistemul îi atribuie automat un ID de grup sau un GID. Dacă doriți ca grupul dvs. să aibă un ID de grup specific, puteți face acest lucru folosind <strong> -g </strong> sau <strong> --gid </strong> steag. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Dacă încercați să atribuiți un ID de grup care a fost deja luat, va apărea următoarea eroare. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Deși nu este recomandat, dar puteți adăuga fișierul <strong> -o </strong> sau <strong> --non-unic </strong> semn pentru a atribui forțat ID-ul grupului. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Creați grupuri de utilizatori cu o parolă </h3> <p> Deși puteți adăuga o parolă grupurilor dvs., acestea nu sunt de niciun folos practic pentru un utilizator. <strong> -p </strong> flag vă permite să specificați o parolă pentru grupul dvs. de utilizatori. </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Creați grupuri de sistem în Linux </h3> <p> Există o ușoară diferență între grupurile de sistem și grupurile obișnuite. Grupurile de sistem sunt grupuri speciale care includ utilizatorii care sunt responsabili de efectuarea operațiunilor de sistem, cum ar fi backup și întreținere. </p> <p> Folosește <strong> -r </strong> sau <strong> --sistem </strong> semnalizați pentru a crea un grup de sistem pe Linux: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Obțineți lista membrilor într-un grup de utilizatori </h3> <p> Pentru a afla câți membri fac parte dintr-un anumit grup, puteți utiliza <strong> getent </strong> comandă de la terminalul dvs. Următoarea comandă va afișa o listă cu toți membrii prezenți în grupul „scriitori”: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Adăugați utilizatori la grupuri </h2> <p> Acum că ați creat un grup de utilizatori pe sistemul dvs., este timpul să adăugați câțiva utilizatori la acesta. Usermod este un utilitar puternic din linia de comandă, deoarece conține diverse opțiuni asociate cu gestionarea și moderarea utilizatorilor. De asemenea, vă permite să adăugați cu ușurință utilizatori la grupul dvs. Sintaxa de bază a comenzii este: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Adăugați un utilizator existent în grupuri </h3> <p> Dacă doriți să adăugați un utilizator existent în grupul dvs., fișierul <strong> -A </strong> și <strong> -G </strong> steagurile sunt ceea ce aveți nevoie. <strong> -G </strong> steagul reprezintă grupuri, în timp ce <strong> -A </strong> înseamnă adăugare, adăugare sau adăugare. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> De asemenea, puteți adăuga un utilizator la mai multe grupuri. Tot ce trebuie să faceți este să introduceți numele grupurilor separate prin virgulă. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Adăugați un utilizator nou la un grup </h3> <p> Puteți utiliza <strong> useradd </strong> comanda când vrei <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> adăugați un utilizator nou la sistemul dvs. Linux </a> . Useradd vă oferă o modalitate de a atribui un grup utilizatorului în momentul creării acestuia. <strong> -G </strong> flag vă permite să specificați un grup utilizatorului. </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> Adăugarea unui utilizator la mai multe grupuri este de asemenea ușoară. Treceți doar numele grupurilor separate prin virgulă în comanda implicită. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Eliminați utilizatorii dintr-un grup </h2> <p> De asemenea, puteți elimina utilizatorii dintr-un grup folosind <strong> usermod </strong> . Rețineți că într-un sistem Linux, pot fi atribuite mai multe grupuri unui utilizator. Unul dintre aceste grupuri este declarat grup primar, în timp ce altele sunt denumite grupuri secundare. </p> <p> Dacă încercați să eliminați un utilizator dintr-un grup, asigurați-vă că acesta are cel puțin un grup principal după eliminare. De exemplu, utilizatorul „aleator” face parte din grupurile de administratori, scriitori și editori; unde admin este grupul principal, iar restul sunt grupuri secundare. </p> <p> Puteți elimina utilizatorul doar din scriitori și editori de grup. Și pentru a face acest lucru, trebuie să treceți numele grupului la care doriți ca utilizatorul să rămână membru. Aceasta înseamnă, pentru a elimina utilizatorul „aleatoriu” din editorii de grup, se folosește următoarea comandă: </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> Observă că tot ce trebuia să faci era să dezbraci <strong> adăugați steagul (-a) </strong> din comanda pe care o utilizați pentru a adăuga un utilizator într-un grup. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Ștergeți grupuri pe Linux </h2> <p> Când nu mai doriți să păstrați un grup de utilizatori pe sistemul dvs., puteți șterge grupul folosind <strong> groupdel </strong> comanda. Sintaxa comenzii este: </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> Pentru ștergerea „scriitorilor” grupului de utilizatori: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Dacă încercați să eliminați un grup care nu există, veți primi o eroare care să precizeze: </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Gestionarea grupurilor de utilizatori pe Linux </h2> <p> Gestionarea utilizatorilor poate fi dificilă dacă nu știți comenzile Linux pe care trebuie să le utilizați. Devine foarte ușor odată ce cunoașteți intrarea și ieșirea din comenzile legate de moderare și gestionare. </p> <p> Administratorii de server ar trebui să încerce să utilizeze distribuții Linux care sunt potrivite pentru nevoile lor. În acest fel, vor primi toate instrumentele și utilitarele necesare pentru gestionarea serverului chiar de pe bat. </p>"}