{"title":"Cum să personalizați promptul zsh în terminalul macOS","content":"<p> De la actualizarea la versiunea 10.15 Catalina, macOS include Z shell (zsh) ca implicit în loc de Bash în aplicația Terminal. Acestea fiind spuse, veți primi în continuare aceeași fereastră neagră cu text alb în terminal. Lucrurile nu trebuie să rămână așa. </p> <p> Puteți promova promptul zsh pentru a-l face minim și pentru a profita la maximum de spațiu. Vă vom arăta cum să personalizați promptul zsh în aplicația Terminal pentru a ieși în evidență pe orice fundal alegeți. </p> <h2 id=\"basics-of-the-zsh-prompt\"> Bazele promptului zsh </h2> <p> Când lansați aplicația Terminal, aceasta afișează câteva informații utile, cum ar fi ultima dvs. conectare și promptul de comandă. Așa arată în mod implicit promptul. </p> <pre><code class=\"hljs ruby\">Last login: Wed Feb 3 22:00:40 on console<br>samir@MacBook-Air ~ %</code></pre> <p> Solicitarea zsh afișează un șir de text format din numele de utilizator și modelul computerului, cum ar fi MacBook Air, MacBook Pro, Mac Mini și așa mai departe. Tilda (~) indică locația promptului în directorul principal. </p> <p> <img alt=\"Default View of zsh prompt\" src=\"images/default-view-of-zsh-prompt-685.jpg\" loading=\"lazy\"> </p> <p> </p> <p> </p> <h2 id=\"create-a-z-shell-profile-to-store-all-settings\"> Creați un profil Z Shell pentru a stoca toate setările </h2> <p> În mod obișnuit, trebuie să vă amestecați cu fișierele de sistem pentru a schimba aspectul implicit. Asta pentru că actualizările macOS resetează toate fișierele de sistem la valorile implicite și veți pierde toate modificările pe care le faceți. </p> <p> Astfel, puteți crea un fișier de setări specific, cunoscut sub numele de fișier dot, pentru ca profilul dvs. zsh să stocheze toate modificările și setările dorite în promptul zsh. </p> <p> Ei bine, nu veți găsi acest fișier dot în mod implicit pe macOS, deci va trebui să creați unul. Se recomandă crearea unui nou profil .zshrc pentru a stoca toate setările, cum ar fi promptul zsh și se comportă. </p> <p> Iată cum să creați profilul zsh (dotfile): </p> <p> 1. Deschideți <strong> Terminal </strong> aplicație. </p> <p> 2. Tastați următoarea comandă și apăsați tasta Return. </p> <pre><code class=\"hljs\">touch ~/.zshrc</code></pre> <p> Acest lucru va crea un profil .zshrc în directorul principal al contului dvs. de utilizator. Îl puteți vedea sub / User // path în Finder dacă ați activat vizualizarea fișierelor de sistem ascunse. </p> <p> După aceea, profilul zsh va fi disponibil pentru login și shell-uri interactive de fiecare dată când lansați Terminal. Cu toate acestea, nu va fi activ în sesiunile SSH. </p> <p> Toate modificările pe care doriți să le faceți la promptul zsh pot fi incluse în acest profil. </p> <p> </p> <h2 id=\"customize-the-zsh-prompt-in-terminal\"> Personalizați promptul zsh în terminal </h2> <p> De obicei, promptul zsh implicit conține informații cum ar fi numele de utilizator, numele mașinii și locația începând din directorul de start al utilizatorului. Aceste detalii sunt stocate în fișierul de sistem al shell-ului zsh la locația / etc / zshrc. </p> <pre><code class=\"hljs perl\">PS1=\"%n@%m %1~ %#\"</code></pre> <p> În acest șir de variabile: </p> <ul> <li> % n este numele de utilizator al contului dvs. </li> <li> % m este numele modelului MacBook. </li> <li> Simbolul% 1 ~ înseamnă calea actuală a directorului de lucru în care ~ decupează locația directorului $ HOME. </li> <li> % # înseamnă că promptul va afișa # dacă shell-ul rulează cu privilegii root (administrator) sau altfel oferă% dacă nu. </li> </ul> <p> Pentru a face orice modificare la promptul zsh implicit, va trebui să adăugați valori relevante pentru ca promptul să apară diferit de cel implicit. </p> <p> Iată cum să faceți acest lucru. Deschis <strong> Terminal </strong> , tastați următoarea comandă și apăsați Enter. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Va fi necompletat dacă îl accesați pentru prima dată. Puteți adăuga o nouă linie cu textul PROMPT = &#39;...&#39; și să includeți valori relevante în elipsele. </p> <p> Pentru o simplă modificare a promptului zsh, puteți introduce aceste valori în profilul .zshrc. </p> <pre><code class=\"hljs ruby\">PROMPT='%n~$'</code></pre> <p> Lovit <strong> Ctrl + O </strong> pentru a confirma efectuarea acestor modificări în fișier, apoi apăsați <strong> Ctrl + X </strong> pentru a ieși din editorul nano. </p> <p> <img alt=\"Use only the username in the zsh prompt\" src=\"images/use-only-the-username-in-the-zsh-prompt-531.jpg\" loading=\"lazy\"> </p> <p> Deschideți un nou <strong> Terminal </strong> pentru a confirma și vizualiza modificările pe care tocmai le-ați făcut. Noua dvs. solicitare zsh va afișa numele de utilizator al mac-ului dvs., directorul principal și simbolul $ la sfârșit. </p> <p> </p> <h2 id=\"add-date-and-time-in-the-zsh-prompt\"> Adăugați Data și Ora în Promptul zsh </h2> <p> În afară de numele dvs. de utilizator, puteți adăuga data sau ora curentă, astfel încât să nu trebuie să vă uitați departe de fereastra activă a Terminalului pentru a verifica acele informații. </p> <p> Lansați Terminalul și deschideți profilul .zshrc. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Pentru a include data în prompt, puteți utiliza% D pentru ca data să apară în format aa-mm-zz sau% W pentru ca aceasta să apară în format mm / zz / aa. Apoi, noua solicitare va apărea ca. </p> <pre><code class=\"hljs ruby\">PROMPT='%n:%W:~$'</code></pre> <p> <img alt=\"How to add date to the zsh prompt\" src=\"images/how-to-add-date-to-the-zsh-prompt-245.jpg\" loading=\"lazy\"> </p> <p> Dacă doriți să includeți ora sistemului în promptul zsh, adăugați% T pentru ora curentă în format de 24 de ore,% t pentru ora care apare în format am / pm sau 12 ore sau utilizați% * pentru a afișa timp în formatul de 24 de ore împreună cu secunde. </p> <pre><code class=\"hljs ruby\">PROMPT='%n:%T:~$'</code></pre> <p> <img alt=\"How to show Time on the zsh prompt\" src=\"images/how-to-show-time-on-the-zsh-prompt-258.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-color-to-text-in-the-zsh-prompt\"> Adăugați culoare la text în promptul zsh </h2> <p> Te-ai plictisit de textul alb al promptului zsh? În afară de <a href=\"https://www.makeuseof.com/tag/customize-mac-terminal/\" target=\"_blank\" rel=\"nofollow noopener\"> modificarea aplicației Terminal </a> cu culori, puteți adăuga o anumită culoare textului, astfel încât să obțineți o pauză vizuală frumoasă. </p> <p> Lansa <strong> Terminal </strong> și deschideți profilul .zshrc. </p> <pre><code class=\"hljs\">nano ~/.zshrc</code></pre> <p> Zsh acceptă culoarea și nuanțele de gri textului prompt, astfel încât să completeze fundalul. Puteți alege o culoare de prim-plan (text) între negru, alb, galben, verde, roșu, albastru, cian și magenta. </p> <p> Iată cum să le utilizați. </p> <pre><code class=\"hljs ruby\">PROMPT='%F{cyan}%n%f:~$'</code></pre> <p> <img alt=\"How to add color the zsh prompt\" src=\"images/how-to-add-color-the-zsh-prompt-993.jpg\" loading=\"lazy\"> </p> <p> Dacă doriți să alegeți o nuanță specifică, puteți alege între 0 și 256 de culori pe 8 biți acceptate de terminal. Iată cum se utilizează valorile numerice ale culorilor. </p> <pre><code class=\"hljs ruby\">PROMPT='%F{51}%n%f:~$'</code></pre> <p> Trebuie să plasați variabilele de culoare implicite% F și% f implicite între textul relevant pe care doriți să îl colorați. </p> <p> </p> <h2 id=\"adding-visual-effects-in-the-zsh-prompt\"> Adăugarea de efecte vizuale în promptul zsh </h2> <p> Dacă nu este suficient să colorați textul promptului, puteți evidenția promptul zsh, astfel încât să iasă în evidență în mijlocul peretelui textului și să îl puteți vedea cu ușurință. Pentru început, puteți îndrăzni promptul zsh. </p> <pre><code class=\"hljs ruby\">PROMPT='%B%F{51}%n%f%b:~$'</code></pre> <p> Adăugarea% B la început și plasarea% b la sfârșit între textul relevant îl vor face îndrăzneț. </p> <p> <img alt=\"How to bold text in the zsh prompt text\" src=\"images/how-to-bold-the-zsh-prompt-text-261.jpg\" loading=\"lazy\"> </p> <p> În mod similar, puteți pune% S la început și% s la sfârșit pentru a evidenția textul. Evidențierea va avea aceeași culoare pe care ați ales-o să apară între variabilele% S și% s. </p> <pre><code class=\"hljs ruby\">PROMPT='%S%F{51}%n%f%s:~$'</code></pre> <p> <img alt=\"How to Highlight the zsh prompt\" src=\"images/how-to-highlight-the-zsh-prompt-422.jpg\" loading=\"lazy\"> </p> <p> De asemenea, puteți sublinia textul promptului zsh. Pentru a adăuga o subliniere la o solicitare, puteți include variabila% U la început și% u la sfârșitul textului relevant. </p> <pre><code class=\"hljs ruby\">PROMPT='%U%F{51}%n%f%u:~$'</code></pre> <p> <img alt=\"How to Underline the zsh prompt\" src=\"images/how-to-underline-the-zsh-prompt-962.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-last-login-details-from-the-zsh-prompt\"> Eliminați ultimele detalii de conectare din promptul zsh </h2> <p> Ascunderea sau dezactivarea liniei de sus care dezvăluie ultima oră de conectare în aplicația Terminal poate oferi promptului dvs. zsh un aspect mai curat. Puteți utiliza următoarea comandă pentru a ascunde aceste informații. </p> <pre><code class=\"hljs\">touch ~/.hushlogin</code></pre> <p> Data viitoare când deschideți terminalul, nu veți vedea nimic deasupra promptului zsh. </p> <p> </p> <h2 id=\"spice-up-the-zsh-prompt-in-terminal\"> Condimentați promptul zsh din terminal </h2> <p> Chiar dacă folosiți ocazional aplicația Terminal pe macOS, puteți modifica modul în care apare promptul zsh acolo. Puteți îndrăzni, sublinia, scurta și chiar include data și ora în ea. </p> <p> Acum, că ați început să personalizați promptul zsh, experimentați puțin și faceți-l al dvs. </p>"}