{"title":"Ce este MTA-STS și cum vă protejează e-mailurile?","content":"<p> E-mailul este cel mai mare vinovat din spatele majorității atacurilor cibernetice. Este un punct de acces ușor pentru malware, adware, spam și phishing și oferă oportunități infinite pentru actorii de amenințare de a obține informațiile dvs. personale. </p> <p> Pentru a atenua aceste amenințări, ar trebui să existe măsuri de securitate stricte atât pentru conturile de e-mail individuale, cât și pentru cele comerciale. </p> <h2 id=\"email-security-and-encryption\"> Securitate și criptare e-mail </h2> <p> În ciuda popularității altor moduri de comunicare, mesageria prin e-mail este în continuare cea mai mare formă de date în tranzit pentru orice persoană sau organizație. Securizarea conținutului dvs. de e-mail este o necesitate vitală. </p> <p> Securitatea e-mailului presupune inspectarea și criptarea tuturor traficului de e-mail de intrare și de ieșire. Criptarea joacă un rol vital în păstrarea intactă a confidențialității conținutului e-mail, asigurând conexiuni sigure SMTP (Simple Mail Transfer Protocol). </p> <p> Până de curând, criptarea era doar o cerință opțională pentru SMTP. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> Cum funcționează criptarea e-mailurilor? </h2> <p> Criptarea e-mailurilor este un proces de adăugare a unui cod sau a unei bucăți de cod la conținutul mesajului dvs., făcându-l indescifrabil. Prin conversia datelor de e-mail în cod, conținutul este protejat împotriva expunerii neautorizate. Pur și simplu, e-mailul dvs. este amestecat. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> Ca o securitate suplimentară, procesul de criptare utilizează chei publice și private în care cheile criptate sunt schimbate pentru a bloca și debloca e-mailurile codate. Expeditorul criptează e-mailul utilizând criptografie cu cheie publică și ulterior, destinatarul folosește o cheie privată pentru a descifra mesajul primit. </p> <p> Criptarea se aplică întregii călătorii a unui e-mail, de la început până la sfârșit. Ca o bună practică, toate e-mailurile de intrare și de ieșire ar trebui să fie criptate - nu doar cele care conțin informații sensibile. Acest lucru împiedică actorii de amenințare să câștige orice punct de intrare în sistemul dvs. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> Un fundal și probleme cu SMTP </h2> <p> Când a apărut protocolul SMTP în 1982, criptarea e-mailurilor nu era o practică obișnuită și, în mod implicit, e-mailurile erau trimise și primite în text simplu. Pentru a introduce securitatea la nivel de transport, comanda STARTTLS a fost adăugată la sfârșitul anilor 1990, care oferea opțiunea de criptare prin intermediul <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> Protocolul TLS (Transport Layer Security) </a> . </p> <p> Oricât de promițător ar părea actualizarea TLS, a lăsat intacte două lacune de securitate: </p> <ol> <li> Opțiunea de criptare a fost doar aceea: <strong> opțional </strong> . E-mailurile nesecurizate erau încă în plină desfășurare, provocând o creștere a atacurilor cibernetice. </li> <li> Chiar și cu STARTTLS la locul lor, nu a existat nicio modalitate de a autentifica identitatea serverului expeditorului, deoarece serverele SMTP nu validează certificatele. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> Sosirea MTA-STS </h2> <p> În 2019, Google a urcat în cele din urmă și a anunțat adoptarea noului standard MTA-STS (Mail Transfer Agent / Strict Transport Security) ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> Acest lucru oferă furnizorilor de servicii de e-mail posibilitatea de a impune TLS pentru securizarea conexiunilor SMTP și oferă, de asemenea, opțiunea de a refuza livrarea de e-mail către gazdele MX care nu oferă TLS cu un certificat de server fiabil. </p> <p> MTA-STS se ocupă în cele din urmă de toate problemele anterioare cu SMTP prin aplicarea criptării între serverele SMTP comunicante. Dar cum funcționează de fapt? Să aflăm! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> Cum funcționează MTA-STS? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS merge la lucru instruind un server SMTP să comunice doar cu un alt server SMTP numai în două condiții: </p> <ol> <li> Serverul SMTP <strong> trebuie sa </strong> să fie criptat. </li> <li> Numele de domeniu de pe certificatul serverului se potrivește cu domeniul din politică, iar certificatele sunt actualizate. </li> </ol> <p> Utilizând o combinație de DNS și HTTPS pentru a publica o politică, MTA-STS informează părțile care trimit cum să procedeze dacă nu poate fi inițiat un canal de comunicare criptat. </p> <p> Este ușor să implementați MTA-STS la capătul destinatarului, dar pentru expeditor, un software de suport pentru mail server, cum ar fi <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> ar trebui folosit. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> Ce tip de atacuri atenuează MTA-STS? </h2> <p> Următoarele amenințări sunt îndeplinite frontal dacă MTA-STS este aplicat comunicărilor dvs. prin e-mail: </p> <p> <strong> Atacuri Man-in-the-Middle (MITM): </strong> Acest atac este efectuat atunci când un atacator intercede în mijlocul comunicării dintre două părți pentru a fura sau modifica datele. În cazul unui e-mail, aceasta ar însemna de obicei două servere SMTP comunicante. Prin utilizarea MTA-STS, aceste atacuri pot fi ușor prevenite. </p> <p> <strong> Atacuri de retrogradare: </strong> Un actor de amenințare forțează un canal de rețea să treacă la un mod nesigur de transmitere a datelor. De exemplu, acest atac ar putea redirecționa un vizitator al site-ului web dintr-o versiune HTTPS a unui site către o versiune HTTP. MTA-STS ajută la combaterea acestor atacuri prevenind orice acces neautorizat. </p> <p> <strong> Atacuri de parodizare DNS: </strong> Aceste atacuri viclene schimbă înregistrările DNS ale destinației intenționate a unui utilizator și îi păcălesc să creadă că vizitează un site sau un domeniu legitim. Implementarea MTA-STS ajută foarte mult la atenuarea acestor atacuri. </p> <p> </p> <p> Acum, că suntem familiarizați cu MTA-STS, este timpul să atingem baza cu un nou standard de raportare pentru SMTP cunoscut sub numele de raportare TLS. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> Ce este raportarea SMTP TLS (TLS-RPT)? </h2> <p> La fel ca MTA-STS, TLS-RPT este un standard de raportare care detectează problemele de conectivitate și discrepanțele dintre trimiterea aplicațiilor. Odată activat, trimite rapoarte zilnice cu privire la orice probleme de conexiune întâmpinate de servere externe în timp ce vă trimiteți e-mailuri. </p> <p> Gândiți-vă la acesta ca la un instrument de depanare în care rapoartele pot fi folosite pentru a evalua și triajele potențiale probleme și probleme de configurare. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> Ce tip de probleme rezolvă TLS-RPT? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Raportarea diagnosticului: </strong> Raportarea TLS oferă rapoarte de diagnostic în format de fișier JSON care conțin detalii cuprinzătoare cu privire la orice e-mailuri primite care se confruntă cu probleme de livrare. De asemenea, detectează e-mailurile care au fost respinse sau nu au fost livrate din cauza unui atac de degradare, de exemplu. </p> <p> <strong> Vizibilitate îmbunătățită: </strong> Activând TLS-RPT, puteți îmbunătăți vizibilitatea pe toate canalele dvs. de e-mail. Acest lucru vă permite să urmăriți toate datele care vă îndreaptă, care includ și mesaje eșuate. </p> <p> <strong> Rapoarte zilnice: </strong> Rapoartele de diagnostic sunt trimise cel puțin o dată pe zi pentru a acoperi și respecta în detaliu politicile MTA-STS. Rapoartele includ, de asemenea, statistici de trafic, precum și informații detaliate despre erori și livrări eșuate. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Când toate celelalte nu reușesc, criptarea prevalează </h2> <p> Datorită naturii în continuă evoluție a amenințărilor cibernetice, măsurile de securitate stricte și criptografia sunt indispensabile pentru livrarea în siguranță a e-mailurilor. </p> <p> Datorită diferiților furnizori de e-mail care oferă capacități puternice de criptare și standardelor MTA-STS, transferurile de e-mail complet sigure nu mai sunt o realitate extrem de mare. </p>"}