{"title":"Cum să faceți o captură de ecran pe o tabletă Surface Pro","content":"<p> Realizarea unei capturi de ecran este o abilitate simplă, dar esențială, pe orice dispozitiv. Pe tableta Surface Pro, puteți face capturi de ecran folosind comenzile rapide de la tastatură, instrumentul de tăiere sau chiar bara de jocuri Xbox. Vă vom arăta cum să utilizați toate aceste metode pentru a face o captură de ecran sau chiar o înregistrare pe ecran pe dispozitivul dvs. Surface. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Realizarea unei capturi de ecran folosind combinații de butoane </h2> <p> Pe linia de dispozitive Surface Pro, realizarea unei capturi de ecran folosind combinații de butoane este rapidă și ușoară. Pentru a face o captură de ecran, țineți apăsat <strong> Putere </strong> și <strong> Creșterea volumului </strong> tasta în același timp. Ecranul ar trebui să clipească, iar captura de ecran ar trebui să fie salvată în folderul capturilor de ecran sub Imagini de pe dispozitivul dvs. </p> <p> Această metodă funcționează pentru cea mai recentă linie de dispozitive Surface Pro (adică, Surface Pro 7+, Pro X), Surface Go, Surface Go 2 și linia de dispozitive Surface Book. </p> <p> Dacă Surface este un model mai vechi (Surface 3 sau mai vechi), combinația de butoane este puțin diferită. Trebuie să apăsați tasta <strong> Butonul Windows </strong> (nu tasta Windows de pe tastatură) și <strong> Volum scăzut </strong> buton în același timp. Dispozitivul vă va salva captura de ecran în dosarul de capturi de ecran din Poze. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> În mod similar, pentru a face o captură de ecran pe Surface Duo, țineți apăsat butonul <strong> Putere </strong> butonul și <strong> Volum scăzut </strong> cheie. Captura de ecran trebuie salvată în galeria dispozitivului dvs. sub Capturi de ecran. Alternativ, puteți ține apăsat pe <strong> Putere </strong> tasta și faceți clic pe <strong> Captură de ecran </strong> butonul de pe ecran. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> Cum să faceți o captură de ecran Surface Pro utilizând comenzile rapide de la tastatură </h2> <p> Comenzile rapide de la tastatură sunt un alt mod prin care puteți captura ceea ce este pe ecran. </p> <p> Aceste comenzi rapide de la tastatură funcționează pe toate dispozitivele Windows, așa că verificați <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> alte metode de captură de ecran pe Windows 10 </a> . Comenzile rapide de la tastatură funcționează cel mai bine pe linia de dispozitive Surface Laptop și Surface Book, dar, desigur, dacă aveți atașamentul de tastatură pentru dispozitivul Surface Pro sau Go, aceste comenzi rapide funcționează și ele. </p> <h3 id=\"print-screen-methods\"> Metode de imprimare a ecranului </h3> <p> Pentru a face o captură de ecran folosind metoda Print Screen, apăsați butonul <strong> PrtScn </strong> butonul de pe tastatură. Aceasta va face o captură de ecran a întregului desktop. Rețineți că acest lucru nu va salva captura de ecran pe Surface, ci o va adăuga în clipboard. Trebuie să utilizați un program precum Microsoft Paint pentru a lipi captura de ecran. </p> <p> Presare <strong> Alt + PrtScn </strong> va face doar o captură de ecran a ferestrei curente și în mod similar va adăuga captura de ecran în clipboard. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Snip și Sketch </h3> <p> Aceasta este de departe cea mai ușoară metodă de a face o captură de ecran pe dispozitivul dvs. Surface. </p> <p> Pentru a deschide Snip și Sketch, apăsați pe <strong> Tasta Windows + Shift + S, </strong> iar pe ecran ar trebui să apară o suprapunere. Pentru a face o captură de ecran completă, apăsați butonul Ecran complet din partea superioară a suprapunerii. Pentru a face o captură de ecran doar a ferestrei dvs. curente, apăsați butonul Decupare fereastră de lângă butonul Ecran complet. </p> <p> De asemenea, puteți face o captură de ecran a unei anumite zone a ecranului. În mod implicit, Snip and Sketch are Snip dreptunghiular. Pur și simplu trageți peste partea pe care doriți să o capturați utilizând ecranul tactil sau trackpad-ul. </p> <p> Snip and Sketch vă va da o notificare în panoul de notificări pentru a spune că captura de ecran este copiată în clipboard. Dacă faceți clic pe el, puteți desena și schița peste o captură de ecran, dacă doriți. </p> <p> Pentru a-l salva în fișierele dvs., utilizați <strong> Ctrl + S </strong> sau butonul Salvare din colțul din dreapta sus pentru a salva captura de ecran într-un anumit folder. </p> <h3 id=\"xbox-game-bar\"> Bara de jocuri Xbox </h3> <p> Pentru a face o captură de ecran folosind Xbox Game Bar, apăsați tasta <strong> Tasta Windows + G </strong> pentru a-l deschide. </p> <p> De acolo, puteți face clic pe fila Capturi și faceți clic pe butonul Cameră foto. Această metodă vă va permite, de asemenea, să realizați o captură video a ecranului cu sunet. Capturile salvate vor apărea sub folderul Videoclipuri și subfolderul Capturi. Pe o Xbox, puteți face în mod similar <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> capturați capturi de ecran și înregistrări </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Realizarea unei capturi de ecran Surface Pro folosind Surface Pen </h2> <p> Pentru a face o captură de ecran folosind Surface Pen, pur și simplu faceți dublu clic pe radieră, iar dispozitivul dvs. ar trebui să afișeze Snip și Sketch pentru întreaga fereastră. De aici, puteți schița și exporta captura de ecran. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> De asemenea, puteți accesa acest lucru căutând Windows Ink Workspace pe doc. De aici, selectați Full-Screen Snip. Puteți modifica ceea ce fac comenzile rapide ale butonului Surface Pen căutând setările Windows Ink Workspace și derulând în jos la Windows Ink Workspace. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Realizarea unei capturi de ecran pe Surface, simplificată </h2> <p> Acum știți toate diferitele metode de a face o captură de ecran sau de a înregistra ecranul pe dispozitivul dvs. Surface. Combinațiile de butoane sunt cel mai bun mod tactil de a face o captură de ecran dacă utilizați Surface Pro sau Surface Go, dar și comenzile rapide de la tastatură sunt ușoare. </p>"}