{"title":"Cum se folosește timpul pentru a merge cu Apple Fitness +","content":"<p> Apple Fitness + oferă o mare varietate de antrenamente video diferite care valorifică puterea Apple Watch pentru a oferi o modalitate excelentă de a te potrivi. Dar funcția Timpul de mers pe jos al serviciului este puțin diferită. </p> <p> În loc să stai în fața unui ecran, această caracteristică te încurajează să mergi la plimbare și să asculți povești în timp ce vizualizezi fotografii semnificative de la stele influente și unice. Vom evidenția mai multe despre caracteristică și despre ce aveți nevoie pentru a începe mai jos. </p> <h2 id=\"what-is-time-to-walk\"> Ce este timpul de mers pe jos? </h2> <p> <img alt=\"Draymond Green Time to walk\" src=\"images/draymond-green-time-to-walk-1-269.jpg\" loading=\"lazy\"> </p> <p> Gândiți-vă la Time to Walk ca la o experiență unică asemănătoare podcast-ului cu vedete și alte nume influente. Unele dintre episoade includ legenda muzicii country Dolly Parton, vedeta NBA Draymond Green, muzicianul Sean Mendes și câștigătorul premiului Emmy Uzo Aduba. </p> <p> În episoadele de 25 până la 40 de minute, oaspeții vor vorbi despre momentele lor personale, care le modelează viața. Pe ecranul Apple Watch, puteți vedea și fotografii care vă ajută să spuneți povestea. La sfârșitul poveștii, veți auzi o listă de redare a poveștilor cu melodii semnificative selectate de invitat. </p> <p> </p> <p> </p> <h2 id=\"getting-started-with-time-to-walk\"> Noțiuni introductive despre timpul de mers pe jos </h2> <p> Trebuie să aveți un abonament la Apple Fitness + pentru a accesa Time to Walk. De asemenea, aveți nevoie de un Apple Watch Series 3 sau o versiune ulterioară și de căști Bluetooth, cum ar fi AirPod-urile Apple. </p> <p> Vestea minunată este că nu trebuie să faceți nimic pentru a descărca un episod Time to Walk. Atâta timp cât Apple Watch se încarcă și este conectat la Wi-Fi, ultimele cinci episoade se vor descărca automat pe ceas. </p> <p> Doar să rețineți, cantitatea de stocare gratuită pe ceas poate afecta numărul de episoade disponibile. După ce ați ascultat un episod, ceasul îl șterge automat. Apoi, va avea loc un nou episod. </p> <p> De asemenea, puteți descărca un anumit episod Time to Walk folosind un iPhone. Mergeți la <strong> Fitness </strong> aplicație și selectați <strong> Fitness + </strong> filă. În <strong> E timpul să mergi </strong> secțiune, alegeți <strong> Arata tot </strong> . Puteți vizualiza toate episoadele disponibile aici. </p> <p> Atingeți un episod pentru a vedea mai multe informații despre ce să vă așteptați și melodiile din lista de redare. Pe pagina respectivă, utilizați <strong> Adăuga </strong> pentru a descărca episodul pe ceas. Dacă episodul este deja descărcat pe ceas, va spune <strong> Descărcat </strong> și afișați o bifă. </p> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (3 imagini) </strong> <img alt=\"Apple Activity App\" src=\"images/apple-activity-app-625.jpg\" loading=\"lazy\"> Extinde <img alt=\"Apple Fitness+ Time to Walk\" src=\"images/apple-fitness-time-to-walk-841.jpg\" loading=\"lazy\"> Extinde <img alt=\"Time to Walk Episode\" src=\"images/time-to-walk-episode-915.jpg\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> Dacă aveți un Apple Watch cu funcție celulară, nu este nevoie să vă faceți griji cu privire la descărcarea unui episod, deoarece puteți transmite în continuare episoade fără a avea nevoie de un iPhone în apropiere. </p> <p> </p> <p> Când sunteți gata pentru o plimbare, deschideți Apple Watch <strong> A face exerciții fizice </strong> aplicație. Apasă pe <strong> E timpul să mergi </strong> episod pentru a începe. Dacă mișcarea este detectată folosind GPS-ul Apple Watch, antrenamentul este înregistrat ca o plimbare în aer liber. Dacă nu, antrenamentul va conta ca o plimbare în interior. </p> <p> <img alt=\"Apple Watch Time to Walk \" src=\"images/apple-watch-time-to-walk-217.jpg\" loading=\"lazy\"> </p> <p> În timpul mersului, glisați spre stânga pentru a bloca ecranul ceasului, întrerupeți antrenamentul sau terminați antrenamentul. O glisare dreaptă va afișa comenzile media și vă va permite să întrerupeți sunetul, să treceți înainte sau înapoi în episod sau să vă deplasați între melodiile listei de redare. </p> <p> Dacă doriți să ștergeți manual un episod Time to Walk, deschideți aplicația de antrenament de pe Apple Watch și atingeți <strong> eu </strong> pictogramă lângă numele celebrității. Derulați în jos până jos și alegeți <strong> Elimina </strong> . </p> <p> </p> <h2 id=\"making-exercise-even-better-with-time-to-walk\"> Efectuarea exercițiilor fizice chiar mai bine cu timpul de mers pe jos </h2> <p> Mersul pe jos este una dintre cele mai ușoare și mai populare modalități prin care oricine poate face o doză de exercițiu necesar. Timpul de mers pe jos oferă un mod unic de a vă motiva în timp ce vă plimbați. </p> <p> Și pentru a vă asigura că aveți mult suc pentru o plimbare lungă, urmați sfaturile noastre pentru a vă ajuta să păstrați durata de viață a bateriei de pe Apple Watch. </p>"}