{"title":"Ce este un exploatare Zero Day și cum funcționează atacurile?","content":"<p> Poate fi frustrant atunci când un software continuă să se actualizeze cu patch-uri de securitate, dar acestea sunt foarte importante pentru siguranța dispozitivului dvs. Când un program se menține actualizat, se protejează mai bine împotriva temutului atac de zero zile și vă menține în siguranță. </p> <p> Acestea fiind spuse, ce este un exploat de zi zero și de ce este atât de important să vă mențineți software-ul actualizat? </p> <h2 id=\"what-is-a-zero-day-exploit\"> Ce este un exploatare Zero-Day? </h2> <p> Înainte de a sări în ceea ce este un exploat de zero zile (sau 0 zi), trebuie să aruncăm o privire asupra lumii vânătorii de exploatări. Este extrem de dificil pentru un dezvoltator să publice software care conține zero erori; ca rezultat, acest lucru creează vânători de exploatare care doresc să găsească aceste bug-uri. </p> <p> Un vânător de exploatare va încerca diferite metode pentru a găsi o gaură în apărarea software-ului. Aceasta poate include înșelarea programului pentru a permite exploatatorului să acceseze software-ul de la distanță sau să-l oblige să ruleze un program rău intenționat. </p> <p> Odată ce vânătorul găsește un exploat, acesta poate lua una din cele două căi. Acest lucru depinde în primul rând de dispoziția lor generală și de motivele lor pentru vânătoare de exploatări. </p> <h3 id=\"fixing-a-zero-day-vulnerability\"> Remedierea unei vulnerabilități Zero-Day </h3> <p> Dacă vânătorul de insecte este un cercetător sau un entuziast, povestea va lua probabil o cale bună. În acest caz, vânătorul de exploatare va raporta eroarea dezvoltatorului în secret pentru a împiedica exploatarea să cadă pe mâini greșite. </p> <p> Odată ce dezvoltatorul știe despre exploatare, acesta poate dezvolta și elibera rapid un patch înainte ca cineva să afle despre eroare. Desigur, o remediere este utilă numai dacă utilizatorii o descarcă de fapt, motiv pentru care unele programe vor verifica automat și vor descărca patch-uri de securitate. </p> <p> </p> <p> Această metodă de corecție poate fi deranjantă pentru dvs., deoarece un software poate începe să solicite un patch în fiecare zi. Cu toate acestea, este important să lăsați aceste actualizări să ruleze, deoarece ar putea fi un dezvoltator care aranjează un exploat de zi zero pentru a-și apăra utilizatorii. </p> <h3 id=\"exploiting-a-zero-day-vulnerability\"> Exploatarea unei vulnerabilități Zero-Day </h3> <p> Cealaltă cale, însă, nu are un final atât de fericit. Dacă vânătorul de erori caută exploatări pe care le poate abuza pentru ei înșiși, vor păstra aceste cunoștințe departe de dezvoltator. Apoi vânătorul de erori va dezvolta și lansa un program care exploatează eroarea pentru câștig personal. </p> <p> Acest scenariu este deosebit de urât, deoarece este exploatat activ fără știrea dezvoltatorului. Nu pot remedia ceea ce nu știu, ceea ce oferă cibercriminalului frâu liber asupra copiilor tuturor software-ului până când altcineva descoperă eroarea. </p> <p> Odată ce dezvoltatorul devine conștient de o eroare exploatată activ, devine o cursă contra timpului. Dacă dezvoltatorul este rapid, poate sigila eroarea înainte de a se face daune; dacă nu sunt, ar putea pune în pericol securitatea clienților. </p> <p> Când un agent rău intenționat găsește și exploatează un bug, acesta creează un moment critic în securitatea cibernetică în care cele două părți se întrec pentru a remedia sau valorifica vulnerabilitatea. Acest moment este surprins de termenul „exploatare de zero zile”. Acest lucru se datorează faptului că un exploit este dezvoltat în aceeași zi în care a fost descoperit eroarea - este în „ziua zero”. </p> <p> </p> <h2 id=\"the-danger-of-zero-day-exploits\"> Pericolul exploatărilor Zero-Day </h2> <p> </p> <p> Exploatările zero-day sunt periculoase, deoarece au două avantaje față de lumea securității cibernetice. Nu numai că abuzează de o eroare care nu a fost încă reparată, dar o fac fără ca dezvoltatorul să știe despre asta până când este prea târziu. </p> <p> Stuxnet este un exemplu deosebit de urât de atac de zero zile. Stuxnet a abuzat de o exploatare descoperită într-un centru iranian de îmbogățire a uraniului. Stuxnet s-a infiltrat în sistem, a forțat centrifugele să se rotească atât de repede încât s-au despărțit, apoi a făcut un raport de diagnostic fals pentru a spune că totul este în regulă. </p> <p> În mod deliberat, s-a făcut tot posibilul să-i păcălească pe utilizatorii sistemului să creadă că totul merge bine Ca atare, nimeni nu știa că nimic nu este în regulă până când aproximativ o mie de centrifuge nu s-au rupt în bucăți. </p> <p> Natura unui virus de zi zero înseamnă că se poate strecura sub radar cu o eficiență mare. Antivirusurile nu îl prind, pentru că nu știu ce să caute. Software-ul nu se poate apăra împotriva acestuia, deoarece nu știe că are eroarea de la început. </p> <p> Acest lucru face ca un atac de zero zile să fie un mod urât pentru un hacker de a face daune fără ca o victimă să-și dea seama chiar ce se întâmplă. </p> <p> </p> <h2 id=\"how-to-stay-safe-from-zero-day-vulnerabilities\"> Cum să vă mențineți în siguranță împotriva vulnerabilităților de zero zile </h2> <p> Amenințările de zi zero sun cu siguranță înfricoșătoare și nu ar trebui subestimate prin niciun mijloc. Cu toate acestea, totul nu este pierdut; există modalități prin care poți să ai grijă de tine și să împiedici infectarea computerului cu o zi zero. </p> <p> Cea mai bună protecție împotriva unui virus de zi zero este un bun simț al a ceea ce nu trebuie făcut pe internet. Dezvoltatorii de programe malware pot exploata toate problemele de zero zile pe care și le doresc, dar totuși trebuie să primească încărcarea utilă pe computerul dvs. într-un fel. Atâta timp cât le refuzați acest lucru, dispozitivul dvs. este ferit de majoritatea amenințărilor. </p> <p> În acest fel, cu siguranță ar trebui să înveți la fel de mult <a href=\"https://www.makeuseof.com/tag/online-security-tips/\" target=\"_blank\" rel=\"nofollow noopener\"> despre securitatea online </a> cât poți. Nu toate sfaturile vor fi relevante pentru a vă proteja împotriva unei zile zero, dar trebuie totuși să știți cum să navigați în siguranță. </p> <p> Dacă aveți deja elementele de bază în jos, puteți face multe <a href=\"https://www.makeuseof.com/tag/5-ways-protect-zero-day-exploit/\" target=\"_blank\" rel=\"nofollow noopener\"> protejează-te de un exploat de zero zile </a> . Aceste exploit-uri funcționează cel mai bine pe sistemele care nu sunt actualizate în mod regulat, astfel încât descărcarea unui patch de zi zero imediat ce este gata este un mod fantastic de a rămâne în siguranță. </p> <p> </p> <h2 id=\"becoming-a-hero-vs-zero-day-threats\"> Devenirea unui erou împotriva amenințărilor Zero-Day </h2> <p> O amenințare de zi zero poate fi o problemă majoră de securitate cibernetică, dar asta nu înseamnă că sunteți complet neajutorat împotriva lor. Acum, știți ce este o amenințare de zi zero, de ce sunt atât de periculoase și de ce este important să vă mențineți toate software-urile la zi, indiferent cât de enervante sunt solicitările de actualizare. </p> <p> Asigurându-vă că PC-ul dvs. este în siguranță împotriva atacurilor cibernetice, vă puteți pune capul într-o rotație. Din fericire, dacă urmați câteva lucruri de bază și nu faceți, veți fi în siguranță de majoritatea amenințărilor online. </p>"}