{"title":"Cum se criptează și decriptează cu ușurință fișiere și directoare în Linux","content":"<p> Ați dorit vreodată să criptați rapid și ușor fișiere în Linux fără a fi nevoie să instalați și să învățați pachete software noi? Iată un mod excelent și ușor de a cripta cu ușurință fișiere sau directoare prin AES256 securizat cu o parolă, ajutându-vă să păstrați fișierele departe de ochii curioși. </p> <h2 id=\"the-basics-of-encryption-with-openssl\"> Bazele criptării cu OpenSSL </h2> <p> Este important să rețineți că criptarea este mult mai mare decât aceasta. </p> <p> Poate fi prudent să citiți <a href=\"https://www.openssl.org/docs/\" target=\"_blank\" rel=\"nofollow noopener\"> Documentație OpenSSL </a> înainte de a avea încredere în această metodă cu datele dvs. Cu toate acestea, presupunând că nu încercați să evitați armata rusă sau NSA, această metodă ar trebui să funcționeze perfect pentru a vă păstra fișierele și directoarele în siguranță și inaccesibile pentru alții. </p> <p> </p> <h2 id=\"install-openssl\"> Instalați OpenSSL </h2> <p> Aveți nevoie de popularul pachet OpenSSL instalat, deci verificați mai întâi dacă este deja instalat cu <a href=\"https://www.makeuseof.com/basic-commands-linux/\" target=\"_blank\" rel=\"nofollow noopener\"> Comandă Linux </a> : </p> <pre><code class=\"hljs\">openssl version</code></pre> <p> Dacă imprimă numărul versiunii actuale, sunteți gata pentru următoarea secțiune. În caz contrar, dacă primiți o eroare „comanda nu a fost găsită”, puteți instala cu ușurință OpenSSL prin apt-get: </p> <pre><code class=\"hljs perl\">sudo apt-get -y install openssl</code></pre> <p> </p> <h2 id=\"encrypt-and-decrypt-files\"> Criptați și decriptați fișierele </h2> <p> De exemplu, dacă doriți să criptați un fișier numit data.tar.gz, ați rula comanda: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -a -salt -iter 5 -in data.tar.gz -out data.enc</code></pre> <p> Vi se va solicita să introduceți o parolă de criptare de două ori, care poate fi orice doriți. Această comandă va avea ca rezultat un nou fișier data.enc ca fișier nou criptat. Vă rugăm să rețineți, acest lucru va lăsa fișierul original data.tar.gz la locul său, deci asigurați-vă că îl ștergeți dacă este necesar. </p> <p> Când doriți, puteți decripta fișierul data.enc cu comanda: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -d -a -iter 5 -in data.enc -out data_decrypted.tar.gz</code></pre> <p> Comanda de mai sus vă va solicita parola de criptare, apoi va rezulta un fișier data_decrypted.tar.gz care conține versiunea decriptată a fișierului dvs. </p> <p> </p> <h2 id=\"encrypt-and-decrypt-directories\"> Criptați și decriptați directoare </h2> <p> Comenzile din secțiunea de mai sus funcționează excelent pentru fișiere individuale, dar ce se întâmplă dacă doriți să criptați un întreg director? Nu există suport încorporat în OpenSSL pentru acest lucru, dar datorită magiei Linux, aceasta nu este nicio problemă. De exemplu, dacă doriți să criptați un director numit „documente”, puteți utiliza comanda: </p> <pre><code class=\"hljs\">tar -cf tmpdata.tar documents && gzip tmpdata.tar && openssl aes-256-cbc -a -salt -iter 5 -in tmpdata.tar.gz -out documents.enc && rm -f tmpdata.tar.gz</code></pre> <p> Un pic de gură, dar singurele două locuri din comanda de mai sus pe care trebuie să le modificați sunt „documente” în primul segment care este directorul de criptat și „documents.enc” în al treilea segment care este fișierul criptat rezultat. Această comandă va arhiva directorul, îl va cripta, apoi va șterge arhiva temporară creată, lăsând un singur fișier criptat documents.enc în locul său. </p> <p> Decriptarea fișierului documents.enc nou creat este la fel de ușoară cu comanda: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -d -a -iter 5 -in documents.enc -out tmpdata.tar.gz && tar -xzf tmpdata.tar.gz && rm -f tmpdata.tar.gz</code></pre> <p> Singura parte a comenzii de mai sus pe care trebuie să o modificați este „documents.enc” din primul segment, care este numele fișierului criptat. Această comandă vă va solicita parola de criptare, veți continua să decriptați și despachetați arhiva, apoi ștergeți arhiva temporară lăsând directorul decriptat ca urmare. </p> <p> </p> <h2 id=\"protect-your-data\"> Protejați-vă datele </h2> <p> Acum, că știți cât de ușor este să vă criptați și să decriptați rapid datele, să vă folosiți cunoștințele și să vă păstrați securitatea datelor private și să evitați <a href=\"https://www.makeuseof.com/worst-data-breaches/\" target=\"_blank\" rel=\"nofollow noopener\"> scurgeri de date </a> . Din nou, pentru a reitera, criptarea este mult mai mare decât cea prezentată aici, iar cele de mai sus nu sunt menite să se sustragă forțelor de ordine sau hackerilor cu înaltă calificare și hotărâre. </p> <p> Cu toate acestea, dacă doriți pur și simplu să vă protejați datele împotriva ochilor curioși, cum ar fi cumnatul sau tehnicianul de reparații de calculatoare, atunci metodele de mai sus ar trebui să facă trucul frumos. </p>"}