{"title":"Cum să vă accesați statisticile de joc PS4 și PS5 pentru 2020","content":"<p> Sony a lansat PlayStation Wrap-Up, care vă permite să reflectați asupra călătoriei dvs. PlayStation din ultimul an. </p> <p> Vă vom spune cum să accesați această experiență și să vă conștientizăm câteva cerințe. </p> <h2 id=\"what-is-playstation-wrap-up\"> Ce este PlayStation Wrap-Up? </h2> <p> După cum am raportat, <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation Wrap-Up este rezumatul ultimului an de jocuri </a> . </p> <p> Este o pagină personalizată care detaliază obiceiurile dvs. de joc PS4 și PS5, inclusiv câte jocuri ați jucat, cât ați petrecut jucându-le și câte trofee ați câștigat pe parcurs. </p> <p> De asemenea, puteți obține o temă dinamică gratuită cu forme PlayStation. În mod confuz, acest lucru este disponibil numai pentru PS4 și nu pentru noul PS5. </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> Cum să accesați PlayStation Wrap-Up </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> Pentru a vizualiza raportul, accesați <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> Site-ul PlayStation Wrap-Up </a> . Va trebui să vă conectați la contul dvs. Sony, dacă nu sunteți deja. Odată ce sunteți pe pagină, puteți derula în jos pentru a vizualiza statisticile și pentru a valorifica tema PS4. </p> <p> Experiența Wrap-Up va fi disponibilă doar până pe 2 martie 2021. Ca atare, nu întârziați dacă doriți să participați. </p> <p> Există condiții pe care trebuie să le îndeplinești pentru a utiliza PlayStation Wrap-Up: </p> <ul> <li> Aveți un cont PSN înregistrat în regiunea dvs. </li> <li> Fii în vârstă de 18 ani sau peste. </li> <li> Ați jucat jocuri timp de cel puțin 10 ore pe o consolă PS4 în perioada 1 ianuarie 2020 - 31 decembrie 2020. </li> </ul> <p> În plus, utilizatorii din Europa, Orientul Mijlociu, Africa, Australia, India și Rusia trebuie să fi activat colectarea <strong> Date adiționale </strong> . Puteți activa acest lucru pe PS4 prin <strong> Setări </strong> &gt; <strong> Date dispozitiv / Sănătate și siguranță </strong> &gt; <strong> Date dispozitiv </strong> . </p> <p> În cele din urmă, puteți primi un e-mail care conține PlayStation Wrap-Up. Cu toate acestea, trebuie să fi ales să primiți e-mailuri de marketing, pe care le puteți face prin intermediul <strong> Setări notificări </strong> în contul dvs. PSN. </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> Va exista o finalizare a anului 2021? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> Acesta este al doilea an consecutiv în care Sony a condus experiența Wrap-Up. Deoarece analizează doar datele din 2020, se concentrează mai mult pe PS4. </p> <p> Sperăm că Sony o va face din nou anul viitor, când PS5 va fi disponibil pentru mai mult timp și va avea mai multe jocuri lansate. </p>"}