{"title":"Cum să-ți faci propriul joc de societate în Simulatorul de masă","content":"<p> V-ați gândit vreodată să creați un joc pentru a vă juca cu prietenii dvs. pe Tabletop Simulator (TTS)? Sau poate sunteți un dezvoltator de jocuri de masă, care doriți să prototipați jocuri și să le testați online. </p> <p> Nu a fost niciodată un moment mai bun pentru a profita de mediul de joc versatil al TTS. Astăzi, vă vom învăța cum să faceți exact asta. </p> <h2 id=\"what-is-tabletop-simulator\"> Ce este Simulatorul de masă? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Pentru cei care nu știu, Tabletop Simulator (TTS) oferă un mediu 3D pentru a juca jocuri de masă, fie local, fie online. A devenit o modalitate excelentă de a <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> joacă jocuri de societate online cu prietenii </a> . </p> <p> Jocurile jucabile pe TTS includ totul, de la poker, dame, Dungeons &amp; Dragons, mini-golf și chiar cele mai noi jocuri de societate. Orice joc pe care doriți să îl jucați este de obicei disponibil fie ca DLC, fie în atelierul comunității. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> De ce să folosiți Simulatorul de masă? </h2> <p> Dacă ați încercat vreodată să creați un joc de masă fizic, știți cât de consumator de timp poate fi, nu doar pentru a construi elemente de joc, ci și pentru a le modifica sau înlocui atunci când decideți să modificați sau să revizuiți jocul. </p> <p> În TTS, totul, de la culoare la greutatea unui obiect, se poate schimba cu un clic de mouse, făcând procesul de revizuire neted și nedureros. </p> <p> În plus, este ușor să transmiteți în direct jocul și să-l arătați pe rețelele de socializare și pe platformele de streaming. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> Ce veți avea nevoie pentru a începe </h2> <p> Înainte de a începe, veți avea nevoie de următoarele: </p> <ul> <li> Un cont de utilizator Steam </li> <li> Simulatorul de masă instalat pe computer </li> <li> Imagini JPG ale planurilor dvs. și a cardurilor </li> </ul> <p> <strong> Descarca: </strong> Simulator de masă activat <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> Aburi </a> (19,99 dolari) </p> <p> Proiectarea elementelor jocului se face cel mai bine prin ilustrarea software-ului sau prin scanarea imaginilor de cărți fizice pe care le-ați făcut deja. Asigurați-vă că au extensii JPG și sunt salvate individual. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Crearea de panouri și covorașe pentru jucători </h2> <p> Când proiectați plăcile și alte obiecte 2D, asigurați-vă că rezoluția este suficient de mare încât să o puteți dimensiona corect fără a pierde calitatea. TTS îl va dimensiona automat când îl importați și îl veți putea redimensiona exact așa cum doriți. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Crearea cărților </h2> <p> Cardurile din TTS au trei aspecte: fața cărții, cartea din spate și cartea ascunsă (cum va arăta cartea celorlalți în mâna unui jucător). Va trebui să aveți modele pentru fiecare dintre acestea, deși aveți opțiunea de a transforma pur și simplu cartea ascunsă în spatele cărții. </p> <h3 id=\"create-and-arrange-card-faces\"> Creați și aranjați fețele cardului </h3> <p> În loc să importați fiecare carte una câte una, cel mai bine este să importați toate sau majoritatea cărților dvs. ca un singur pachet. </p> <p> Pentru a crea un pachet, copiați și lipiți fiecare design pe o foaie de cărți 7x10. Utilizarea unui șablon precum cel de mai jos vă va ajuta să începeți. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> Șablonul delimitează sloturile pentru fiecare carte din pachetul dvs., permițându-vă să importați până la 69 de cărți odată. Dacă nu aveți nevoie de atâtea, puteți lăsa sloturile nefolosite și, dacă aveți mai multe, puteți combina punțile sau dublați cărțile după import. </p> <p> Cu toate acestea, nu trebuie să utilizați acest șablon. De fapt, o foaie de card poate avea orice dimensiune, iar TTS o va tăia automat într-o grilă de 7x10. </p> <p> Pentru confortul dvs., șablonul de mai sus și un șablon de card pătrat sunt disponibile în directorul de fișiere locale TTS. </p> <p> Dacă nu sunteți sigur unde sunt fișierele dvs. locale, le puteți găsi prin biblioteca Steam deschizând <strong> Proprietăți </strong> meniu pentru TTS. Selectează <strong> Fisiere locale </strong> fila și faceți clic pe <strong> Naviga </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Spatele cardului </h3> <p> Dacă doriți doar un design pentru întregul spate al punții, atunci tot ce aveți nevoie este o singură imagine JPG a designului; nu va fi necesară nicio foaie de card. </p> <p> Dacă pachetul dvs. va avea mai multe spate unice, va trebui să creați o foaie de cărți suplimentară cu modele de spate corespunzătoare desenelor feței din prima foaie de cărți. Pentru designul feței în slotul unu, așezați-l pe spate în slotul unu al foii din spate. Pentru fața doi, așezați spatele în slotul doi și așa mai departe. </p> <h3 id=\"hidden-cards\"> Carti ascunse </h3> <p> În slotul 70 al foii de cărți, etichetat „Card ascuns pentru alți jucători” pe șablon, așezați orice design doriți să fie vizibil pentru adversari atunci când cărțile din acest pachet sunt în mâna unui jucător. Acesta este în mod tradițional solid negru sau alb sau are designul spate al punții. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Importarea elementelor </h2> <p> Acum că v-ați creat plăcile și punțile, sunteți gata să începeți importul. </p> <p> Înainte de a găzdui efectiv un server cu jocul dvs., este util să începeți un joc cu un singur jucător și să importați elementele din timp. Apoi puteți salva setarea și puteți fi gata să începeți imediat când sosesc jucătorii. </p> <p> Lansați TTS și faceți clic <strong> Crea </strong> , apoi selectați <strong> Un singur jucator </strong> pentru a crea mediul. Ștergeți orice elemente generate de TTS și selectați masa pe care doriți să fie jucat jocul. </p> <p> Cu mediul gata, faceți clic pe <strong> Obiecte </strong> din meniul de sus, apoi selectați butonul <strong> Personalizat </strong> categorie. </p> <h3 id=\"boards-and-player-mats\"> Panouri și covorașe pentru jucători </h3> <p> Selectați <strong> Bord </strong> de la <strong> Personalizat </strong> din meniu și faceți clic oriunde pe masă doriți să apară placa. Faceți clic dreapta oriunde pentru a deschide dialogul de importare a plăcii. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Navigați la imaginea dvs. a tabloului, iar TTS vă va întreba dacă doriți să o încărcați în contul dvs. Steam Cloud sau să păstrați un fișier local. Încărcați fișierele în cloud dacă intenționați să vă jucați vreodată jocul online sau pe un alt dispozitiv. </p> <p> Opțional, puteți să vă încărcați imaginile pe o altă gazdă, cum ar fi Dropbox, Photobucket sau Imgur, și să inserați adresa URL aici. Cu toate acestea, gazdele externe sunt mai puțin fiabile și nu sunt recomandate. </p> <p> Când îl încărcați pe Steam Cloud, TTS vă va cere să îi dați un nume de fișier. După finalizarea încărcării, faceți clic pe <strong> Import </strong> . </p> <p> Cu placa importată, acum o puteți micșora sau mări cu ajutorul <strong> - </strong> și <strong> + </strong> tastele de pe tastatură. Pentru a-l bloca în poziție, astfel încât să nu fie mutat accidental în timpul jocului, faceți clic dreapta pe tablă și sub <strong> Comută </strong> , faceți clic pe <strong> Lacăt </strong> . </p> <h3 id=\"card-decks\"> Carduri </h3> <p> În <strong> Obiect personalizat </strong> meniu, faceți clic pe <strong> Punte </strong> . Faceți clic oriunde pe masă doriți să apară pachetul, apoi faceți clic dreapta pentru a începe importul. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Reglați setările după cum urmează: </p> <ul> <li> <strong> Tip: </strong> Schimbați acest lucru dacă aveți în minte o formă specifică, în afară de o carte dreptunghiulară obișnuită cu colț rotund. </li> <li> <strong> Față: </strong> Apasă pe <strong> Răsfoiți fișiere locale </strong> apăsați butonul și găsiți foaia de vizită. Din nou, recomandăm opțiunea Steam Cloud peste fișierele locale sau gazdele externe. </li> <li> <strong> Spate unice: </strong> Bifați această opțiune dacă pachetul dvs. va avea mai multe modele din spate, apoi încărcați foaia de cărți din spate în <strong> Înapoi </strong> cutie. Dacă utilizați un singur design pentru întreaga punte, trebuie doar să încărcați designul din spate. </li> <li> <strong> Latime si inaltime: </strong> Ajustați acest lucru dacă ați utilizat un raport diferit de cardul dreptunghiular standard, 10x7. </li> <li> <strong> Număr: </strong> Asigurați-vă că acesta corespunde numărului de carduri pe care le importați. </li> <li> <strong> Lateral: </strong> Aceasta schimbă orientarea pentru <strong> Alt Zoom </strong> funcția în TTS. Lăsați-l bifat, cu excepția cazului în care doriți ca cardul să apară lateral. </li> <li> <strong> Înapoi este ascuns: </strong> Bifați acest lucru dacă doriți ca vizualizarea ascunsă a cărților dvs. să fie pur și simplu partea din spate a cărților. </li> </ul> <p> Când setările dvs. sunt corecte, faceți clic pe <strong> Import </strong> . Pachetul dvs. va apărea pe masă și puteți începe să amestecați și să tratați. </p> <p> Dacă doriți ca cărțile dvs. să aibă nume care să vă ajute la sortare, faceți clic dreapta pe o singură carte și faceți clic <strong> Nume </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Importul altor elemente de joc </h2> <p> Importul altor obiecte 2D este similar cu procesul de importare a plăcilor. Nu uitați că TTS are multe elemente de joc comune, cum ar fi zaruri și figurine, gata de utilizare în <strong> Obiecte </strong> meniul. </p> <p> Dacă aveți elemente 3D personalizate pe care doriți să le utilizați, urmați <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> Ghidul TTS pentru importul de modele 3D </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Salvarea unui joc complet </h2> <p> După aranjarea componentelor într-o stare inițială de configurare, faceți clic pe <strong> Jocuri </strong> din meniul de sus. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Selectați <strong> Salvați și încărcați </strong> și faceți clic pe <strong> Salveaza jocul </strong> buton. Dă-i un nume și dă clic <strong> Salvați </strong> . Acum, ori de câte ori găzduiești jocuri, îl poți reîncărca în configurația perfectă accesând <strong> Salvați și încărcați </strong> meniul. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Profitarea la maximum a jocurilor de masă personalizate </h2> <p> Proiectarea și jocul de jocuri personalizate este simplă în Tabletop Simulator odată ce știi cum să o faci. Invitați-vă prietenii sau căutați testeri de joc gata și dispuși <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> comunitatea TTS </a> . Acum, puteți arăta altora jocul personalizat! </p>"}