{"title":"Cum să vă îmbunătățiți abilitățile de editare Lightroom: 10 moduri ușoare","content":"<p> Adobe Lightroom este una dintre cele mai cunoscute platforme de editare foto de pe piață. Această soluție este populară nu numai pentru că are atât de multe caracteristici utile, ci și datorită ușurinței sale de utilizare. </p> <p> Când fotografii caută să-și ia ambarcațiunile puțin mai în serios, primul lucru pe care îl vor face este să cumpere software de editare. Dar chiar dacă sunteți doar un fotograf casual, Lightroom oferă o mulțime de modalități de a vă uimi prietenii. </p> <p> În acest ghid, veți descoperi câteva modalități ușoare de a vă îmbunătăți fotografiile în Lightroom. Aceste sfaturi funcționează atât pentru Lightroom Classic, cât și pentru Lightroom Creative Cloud. </p> <h2 id=\"use-masking\"> 1. Utilizați Masking </h2> <p> Dacă vă clarificați fotografia în mod implicit, veți adăuga detalii la întreaga imagine - chiar și zonele pe care nu le doriți. Acest lucru vă poate lăsa o mulțime de cereale în locuri nedorite, cum ar fi cerul și apa. </p> <p> De asemenea, riscați ca fotografia dvs. să arate mai mult ca un desen decât ceva pe care l-ați luat cu camera foto. Din fericire, există o soluție ușoară. </p> <p> În aplicația Lightroom, derulați în jos până la <strong> Detaliu </strong> . Când ești acolo, mergi la <strong> Ascuțirea </strong> &gt; <strong> Mascare </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Derulați glisorul până când sunt selectate părțile imaginii pe care doriți să o clarificați. Pentru a vedea ce mascați, apăsați tasta <strong> Alt </strong> tasta de pe tastatură în același timp. </p> <p> După ce ați mascat zona dorită, derulați glisorul de ascuțire la fel de mult sau cât de puțin aveți nevoie. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Utilizați profilurile camerei în locul celor Adobe implicite </h2> <p> Dacă încărcați o imagine în RAW, Adobe va adăuga în mod implicit unul dintre profilurile sale de programe. Și, deși acestea ar putea face ca imaginea dvs. să arate mai bine în unele cazuri, este adesea mai bine să alegeți una specifică camerei. </p> <p> Când utilizați un profil de cameră, imaginea va deveni mai ușor de editat pe baza a ceea ce ați luat cu dispozitivul. </p> <p> Pentru a schimba profilul fotografiei, accesați <strong> Profiluri </strong> &gt; <strong> Potrivirea camerei </strong> . Apoi puteți alege dintre <strong> Standard </strong> , <strong> Neutru </strong> , <strong> Peisaj </strong> , și alte priviri. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Tine minte: </strong> nu puteți schimba profilul de imagine la aceeași adâncime dacă luați doar JPEG-uri. Deci, înainte de a ieși pentru a face niște fotografii, setați camera pe oricare <strong> BRUT </strong> sau <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Treceți peste părți din imaginea dvs. </h2> <p> Ați crescut vreodată claritatea, saturația sau detaliile întregii imagini, așteptând o capodoperă, dar ați obținut în schimb o imagine care arată ca a fost făcută la cuptorul cu microunde? Dacă da, este posibil să beneficiați de modificarea doar a unor părți din imagine. </p> <p> În Lightroom, puteți accesa o caracteristică numită <strong> Perie </strong> . Puteți utiliza acest lucru pentru a „peria” peste părți ale imaginii dvs., lăsând restul în pace. </p> <p> Pentru a utiliza acest instrument, accesați <strong> Perie </strong> pictogramă din partea dreaptă a ecranului. Puteți face peria mai mare sau mai mică, în funcție de cât de mult din imagine doriți să editați. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Înainte de a începe periajul, modificați caracteristicile imaginii pe care doriți să le modificați. De exemplu, puteți ridica glisorul de claritate dacă doriți să clarificați o parte a imaginii. </p> <p> După schimbarea acestor caracteristici, treceți peste zonele pe care doriți să le editați. presa <strong> O </strong> de pe tastatură pentru a vedea unde ați trecut peste. </p> <p> Dacă ați depășit prea mult într-o anumită zonă, țineți apăsat butonul <strong> Minus </strong> ( <strong> - </strong> ) Tastați și treceți peste acele părți pentru a șterge modificările. Știind <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> comenzi rapide de la tastatură pentru Adobe Lightroom </a> vine la îndemână pentru aceste situații, așa că nu uitați să le spălați! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Defringe-ți fotografiile </h2> <p> Uneori, camera dvs. va face fotografii în care marginile au culori nenaturale. Le veți observa mai ales atunci când faceți fotografii în lumina soarelui aspră. Ele vin în principal în nuanțe de verde și violet. </p> <p> Pentru a vă arunca fotografiile, derulați în jos până la <strong> Defringe </strong> . Puteți alege să scăpați de franjuri violete sau verzi. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> Utilizare <strong> Cantitate </strong> pentru a decide cât de mult defringe doriți să adăugați. Glisați bara de culori până când sunteți mulțumit de rezultate. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Folosiți geometria pentru a vă îndrepta fotografiile </h2> <p> Indiferent cât de mult ai încerca, ținerea dreaptă a camerei este dificilă dacă nu ai un trepied. Dar, datorită magiei software-ului de editare, îndreptarea imaginilor este ușoară. </p> <p> În Lightroom, vă puteți îndrepta automat fotografiile mergând la <strong> A decupa </strong> secțiune. Cu toate acestea, există un mod mai precis de a obține același rezultat. </p> <p> În fila din dreapta, alegeți opțiunea de sus. Apoi, derulați în jos până la <strong> Geometrie </strong> . Când sunteți aici, mergeți la <strong> Drept </strong> &gt; <strong> Nivel </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> De asemenea, puteți desena de-a lungul liniilor drepte pentru a face fotografia cât mai dreaptă posibil. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Reglați dimensiunea zonei dvs. de ascuțire </h2> <p> Acum știi despre mascare, dar știai că poți chiar să ascuți anumite zone ale fotografiei? </p> <p> Pentru a alege zona din fotografia mascată pe care doriți să o clarificați, accesați <strong> Ascuțirea </strong> , tine <strong> Alt </strong> cheie și mergeți la <strong> Rază </strong> . Reglarea acestui glisor vă permite să vă faceți zona de ascuțire mai mare sau mai mică. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> După aceasta, du-te la <strong> Ascuțirea </strong> bar. În mod similar, țineți butonul <strong> Alt </strong> tasta și deplasați glisorul spre dreapta. Acest lucru vă va face mai ușor să ascuțiți o anumită zonă a fotografiei, mai degrabă decât întreaga imagine. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Utilizați curbele punctelor de culoare </h2> <p> Dacă culoarea imaginii dvs. nu arată corect chiar și după ajustarea balansului de alb, vă recomandăm să verificați curbele punctelor de culoare din Lightroom. Puteți să le utilizați pentru a regla anumite culori din imagine. </p> <p> Veți găsi trei panouri diferite de curbă de culoare în aplicație: roșu, albastru și verde. </p> <p> Pentru a ajunge la aceste curbe de culoare, derulați în jos până la <strong> Curba punctului </strong> . Apoi, faceți clic pe culoarea pe care doriți să o modificați. Puteți apoi să vă jucați cu culorile la fel ca la standard <strong> Curba punctului </strong> filă. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Tastați un număr pentru fiecare glisor și modificați în consecință </h2> <p> Adesea, noii fotografi vor fi entuziasmați de numărul de opțiuni de editare disponibile. Când deschid Lightroom, vor aluneca fiecare bară mult prea departe în ambele direcții. Dar, în loc să-și îmbunătățească imaginea, ajung să aibă o mizerie supraeditată. </p> <p> Când editați fotografiile, cheia este să faceți mici modificări. Șansele sunt că sunteți deja un fotograf bun, iar fotografia pe care ați făcut-o are nevoie doar de puțină reglare post-producție. </p> <p> </p> <p> În loc să mutați liber fiecare glisor, încercați să schimbați numărul pe zonele pe care doriți să le schimbați <strong> +10 </strong> sau <strong> -10 </strong> . Dacă credeți că este nevoie de mai multă muncă, repetați procesul. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Când simți că ești aproape, mișcă încet fiecare glisor la stânga sau la dreapta până când ești fericit. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Decupați-vă fotografiile </h2> <p> Decuparea ar putea părea evidentă, dar mulți fotografi încă nu folosesc caracteristica. De asemenea, este important să vă decupați imaginile în funcție de locul în care le veți folosi. În caz contrar, vor fi distorsionați. </p> <p> Pentru a decupa fotografiile, accesați <strong> A decupa </strong> pictogramă. Acesta este al doilea cel mai înalt din partea de sus. Mergi la <strong> Raport de aspect </strong> pentru a schimba dimensiunea și trageți colțurile pentru a scăpa de orice obiecte nedorite. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> După ce ați terminat de tăiat, apăsați pe <strong> introduce </strong> tasta de pe computer, iar modificările vor intra în vigoare. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Folosiți histograma </h2> <p> Histograma Lightroom este ușor de ignorat, dar esențială de știut. Acest mic grafic vă va arăta unde culorile și iluminarea sunt inegale în imaginea dvs., permițându-vă să creați o editare mai curată. </p> <p> De regulă, o fotografie bine editată va avea puține vârfuri pe histogramă. Uneori, acest lucru este inevitabil. Dar, în general, ar trebui să căutați să faceți graficul cât mai uniform posibil. </p> <p> În funcție de versiunea de Lightroom pe care o utilizați, puteți manipula histograma mai mult sau mai puțin direct. În Lightroom Classic, puteți face clic pe histogramă și chiar pe lucruri, glisând pe anumite secțiuni. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> În Creative Cloud, histograma este vizibilă în mod similar în colțul din dreapta sus - dar trebuie să schimbați singur glisierele pentru ca histograma să se miște. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> Pe ambele versiuni ale platformei, histograma este disponibilă în partea de sus a ecranului deasupra funcțiilor de editare. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> O mare editare nu este doar pentru profesioniști </h2> <p> Lightroom este un software de editare excelent pentru oricine dorește să-și ducă fotografia la nivelul următor. Și chiar dacă nu ați folosit niciodată platforma până acum, nu trebuie să vă faceți griji, deoarece este ușor de învățat. </p> <p> Când editați fotografiile în Lightroom, nu uitați că mai puțin este adesea mai mult. Împreună cu luarea în considerare a acestor sfaturi, este o idee bună să faceți un pas înapoi după editare și să reveniți mai târziu pentru a vedea dacă sunt la fel de bine editate pe cât credeați că au fost. </p>"}