{"title":"Cum să opriți Windows 10 de la blocarea fișierelor descărcate","content":"<p> Când încercați să deschideți un fișier, Windows 10 vă poate împiedica să îl deschideți direct. Vă va afișa un avertisment de securitate conform căruia fișierul provine dintr-o sursă necunoscută și poate fi nesigur. Acest lucru se întâmplă atunci când o caracteristică Windows 10 numită Attachment Manager blochează fișierele pe care le consideră nesigure pentru computerul dvs. </p> <p> Deși puteți debloca manual fiecare fișier, acesta poate fi un proces obositor - mai ales dacă trebuie să faceți acest lucru pentru aproape fiecare fișier pe care îl descărcați. În acest articol, vă vom arăta cum puteți opri Windows 10 să blocheze fișierele descărcate. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> Ce este Attachment Manager în Windows 10? </h2> <p> În Windows 10, există o caracteristică de securitate numită Attachment Manager care vă împiedică să deschideți fișiere nesigure. Acestea pot fi fișiere pe care le-ați descărcat sau <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> fișiere pe care Windows le identifică ca atașamente de e-mail nesigure </a> . Dacă Attachment Manager consideră un fișier nesigur, acesta împiedică Windows 10 să îl deschidă și afișează un mesaj de avertizare. Managerul de atașamente clasifică fișierele pe care le descărcați pe baza tipului de fișier și a extensiei numelui fișierului. </p> <p> Windows Attachment Manager utilizează interfața de programare a aplicației (API) IAttachmentExecute pentru a găsi tipul de fișier, asocierea fișierelor și pentru a determina cea mai potrivită acțiune de întreprins. Când descărcați fișiere și le salvați pe disc, Windows adaugă metadate specifice acestor fișiere. Aceste metadate sunt considerate atașamente. Când Windows adaugă metadate la fișierele descărcate ca atașament, acestea sunt cunoscute sub numele de Informații despre zonă. </p> <p> Acum <strong> Informații despre zonă </strong> aici se află rădăcina problemei. Când File Explorer deschide un fișier, acesta citește informațiile despre zonă atașate stocate în aceeași locație și verifică dacă fișierul provine sau nu dintr-o sursă necunoscută. Dacă Windows constată că fișierul este nerecunoscut sau provine din surse necunoscute, acesta vă împiedică să îl deschideți. </p> <p> Va apărea o avertizare Windows SmartScreen care să precizeze: </p> <blockquote> <p> Windows SmartScreen a împiedicat pornirea unei aplicații nerecunoscute. Rularea acestei aplicații ar putea pune computerul în pericol. </p> </blockquote> <p> Dacă doriți să deschideți manual un fișier blocat, faceți clic dreapta pe fișierul descărcat și apoi selectați <strong> Proprietăți </strong> . În fila General, faceți clic pe <strong> Deblocați </strong> , faceți clic pe <strong> aplica </strong> și apoi faceți clic pe <strong> O.K </strong> . </p> <p> Dar, imaginați-vă că trebuie să faceți acest lucru de fiecare dată când descărcați un fișier - care poate fi deranjant și consumator de timp. Dacă descărcați adesea fișiere de pe internet sau primiți fișiere ca atașamente de e-mail, vă recomandăm să vă opriți complet computerul din blocarea fișierelor. </p> <p> Pentru a opri Windows 10 să nu vă blocheze deschiderea fișierelor, trebuie să împiedicați adăugarea informațiilor despre zonă la fișierele pe care le descărcați. Puteți face acest lucru configurând manual Attachment Manager folosind Editorul de politici de grup local sau Editorul de registru. </p> <p> Vă vom oferi pași despre cum puteți face acest lucru. Trebuie să vă conectați ca administrator sau ar trebui <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> solicitați drepturi de administrator </a> pentru a putea opri blocarea fișierelor descărcate. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Configurați Managerul de atașamente utilizând Editorul de registry </h2> <p> apasă pe <strong> Tasta Windows + R </strong> pentru a deschide Editorul de registru. De acolo, tastați „Regedit” și faceți clic <strong> introduce </strong> . Va apărea un mesaj de control al contului de utilizator. Când apare această solicitare, faceți clic pe <strong> da </strong> pentru a continua. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Navigați la cheia atașamente din Editorul de registru: <strong> HKEY_CURRENT_USER&gt; Software&gt; Microsoft&gt; Windows&gt; CurrentVersion&gt; Politici&gt; Atașamente </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> Dacă cheia Atașamente este absentă în cheia Politici, va trebui să o creați. Pentru a face acest lucru, faceți clic dreapta pe <strong> Politici </strong> tasta, faceți clic pe <strong> Nou </strong> , faceți clic pe <strong> Cheie </strong> . Aceasta va crea o nouă cheie, pe care ar trebui să o denumiți apoi „Atașamente”. Dacă descoperiți că tasta atașamente este deja prezentă, puteți trece la pasul următor. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> Faceți clic dreapta pe <strong> Atașamente </strong> tasta, faceți clic pe <strong> Nou </strong> și apoi selectați <strong> Valoare DWORD (32 de biți) </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Vi se va solicita să denumiți această valoare DWORD nou creată. Denumiți-l „SaveZoneInformation” și faceți clic pe <strong> introduce </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> În cele din urmă, pentru a dezactiva Managerul de atașamente în Windows 10, faceți dublu clic pe nou-creat <strong> SaveZoneInformation </strong> valorificați și schimbați-i datele de valoare la 1. Faceți clic pe <strong> O.K </strong> a termina. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Când parcurgeți acești pași, închideți Editorul de registry și reporniți computerul pentru a aplica modificările. De aici încolo, orice fișier pe care îl descărcați nu va mai atașa informații de zonă la fluxul de date alternativ al fișierului. Acest lucru vă va permite să vă deschideți fișierele fără dificultăți. </p> <p> Dacă doriți să reveniți și să activați Managerul de atașamente, puteți face acest lucru navigând la cheia Atașamente din Editorul de registru: <strong> HKEY_CURRENT_USER&gt; Software&gt; Microsoft&gt; Windows&gt; CurrentVersion&gt; Politici&gt; Atașamente </strong> . De aici, în partea dreaptă, faceți dublu clic pe <strong> SaveZoneInformation </strong> valorificați și modificați datele valorii sale la 3. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Configurați Managerul de atașamente utilizând Editorul de politici de grup local </h2> <p> Editorul de politici de grup local este disponibil numai în edițiile Windows 10 Enterprise, Education și Pro. Prin urmare, această metodă nu este aplicabilă dacă dețineți ediția Windows 10 Home. Dacă computerul dvs. rulează pe ediția Windows 10 Home, va trebui să configurați Managerul de atașamente prin Editorul de registry. </p> <p> Dacă utilizați o ediție Windows 10 care are Editorul de politici de grup local, puteți configura Managerul de atașamente urmând pașii indicați aici. </p> <p> Pentru a începe, apăsați <strong> Tasta Windows + R </strong> , tastați „gpedit.msc” și faceți clic pe <strong> introduce </strong> pentru a deschide Editorul de politici de grup local. </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Navigați la Managerul de atașamente: <strong> Configurare utilizator&gt; Șabloane administrative&gt; Componente Windows&gt; Manager atașamente </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> În panoul din dreapta al Managerului de atașamente, faceți dublu clic pe <strong> Nu păstrați informațiile despre zonă în fișierele atașate </strong> politica de editare a setărilor Informații despre zonă. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> Va apărea o fereastră în care puteți alege dacă Managerul de atașamente trebuie sau nu să păstreze informațiile despre zonă. </p> <p> Clic <strong> Activat </strong> pentru a permite Managerului de atașamente să nu păstreze informațiile despre zonă. Acest lucru vă va asigura că Windows nu vă blochează fișierele ori de câte ori le deschideți. Apasă pe <strong> aplica </strong> pentru a salva modificările și apoi faceți clic pe <strong> O.K </strong> . </p> <p> Când terminați, închideți Editorul de politici de grup local și reporniți computerul pentru a salva modificările. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows nu va mai bloca fișierele din nou </h2> <p> Dacă anterior a trebuit să deblocați manual majoritatea fișierelor pe care le-ați descărcat, v-ați fi dat seama cât de obositor ar putea fi acest proces. După ce aplicați aceste sfaturi, veți avea libertatea de a vă deschide toate fișierele cu ușurință. </p> <p> Dacă descărcați fișiere și vă îndoiți cumva de credibilitatea lor, le puteți deschide oricând în medii izolate securizate pentru a vă asigura că computerul și datele dvs. sunt în siguranță. </p>"}