{"title":"Camera Sony FX3 a fost dezvăluită prin Twitter Leak","content":"<p> Au trecut doar două săptămâni de când Sony a anunțat lansarea Sony A1, o cameră de 8.6K care poate capta imagini de 50MP la 30 fps. Însă compania stârnește ceva mai mult? </p> <p> Tot ce avem acum este doar speculații, dar Sony ar putea adăuga o nouă cameră elegantă și compactă la seria sa FX. </p> <h2 id=\"a-preview-of-the-sony-fx3\"> O previzualizare a Sony FX3 </h2> <p> Miercuri, Nokishita a postat pe Twitter o imagine a Sony FX3, o cameră care ar putea căuta să provoace EOS C70 de la Canon și Pocket Cinema 6K de la Blackmagic Design. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> ソ ニ ー FX3 の 画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> # 噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> - 軒 下 デ ジ カ メ 情報 局 (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> 10 februarie 2021 </a></blockquote>  <p> Nokishita este un blog de tehnologie japoneză, renumit pentru scurgerile timpurii și precise de echipamente foto și video viitoare. În ciuda faptului că nu este o sursă oficială pentru nicio companie de produse optice, unii oameni merg atât de departe încât spun că informațiile partajate de Nokishita ar putea fi la fel de bine confirmate. </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> TechRadar </a> numit odată Nokishita „Moș Crăciun al zvonurilor aparatului de fotografiat”. Ca răspuns la tweet-ul de mai sus, utilizatorul Twitter @miemelaar a întrebat „[este] real sau un concept?” iar @rauuru_san a răspuns cu „dacă Nokishita îl publică, este adevărata afacere”. </p> <p> Dar chiar dacă ar fi să presupunem că scurgerea este adevărată, cu câtă informație ne lasă asta, într-adevăr? </p> <p> Am putea presupune că FX3 face parte din linia FX datorită numelui său, dar camera poartă un simbol care lasă mulți speculatori confuzi. Dacă acel semn alfa alb (α) de pe fața camerei vi se pare familiar, ar fi pentru că îl puteți găsi pe același aparat de fotografiat Sony fără oglindă. </p> <p> Deci FX3 este o cameră cine, o cameră fără oglindă sau un fel de hibrid în stil DSLR? Va trebui să așteptăm să apară mai multe detalii. Până atunci, luați în considerare citirea articolului nostru despre <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> diferențele cheie între camerele fără oglindă, DSLR-urile și camerele video </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> Ce va aduce Sony FX3 la masă? </h2> <p> De când a scăzut tweet-ul lui Nokishita, pretinsele specificații ale produsului camerei au zburat pe web. Totuși, nimic din surse care să fie la fel de reputați. </p> <p> Din fericire, ar trebui să aflăm mai multe despre Sony FX3 în următoarele săptămâni. Cel mai mare eveniment de fotografie din Japonia, CP + 2021, va avea loc în perioada 25-28 februarie. </p>"}