{"title":"Controlerul PS4 nu funcționează? Cum se remediază cele mai frecvente probleme","content":"<p> De cele mai multe ori, controlerul dvs. PlayStation 4 funcționează probabil bine. Dar când DualShock 4 nu mai conectează sau se deconectează aleatoriu, este frustrant. </p> <p> Să ne uităm la soluții pentru când controlerul PS4 nu funcționează, astfel încât să puteți reveni la joc. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> Controlerul PS4 nu se va asocia sau conecta </h2> <p> În mod normal, când apăsați butonul <strong> Butonul PS </strong> pe controlerul dvs., acesta ar trebui să pornească și să se conecteze la sistemul dvs. Cu toate acestea, atunci când nu se conectează, veți vedea bara de lumină a controlerului dvs. clipind puțin, apoi opriți. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Acest lucru se întâmplă de obicei dacă ați folosit DualShock 4 cu un alt dispozitiv. De exemplu, dacă tu <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> asociați controlerul PS4 cu computerul </a> sau consola unui prieten, își va aminti dispozitivul care va merge mai departe. </p> <p> Va trebui să re-împerecheați DualShock 4 cu propriul dvs. PS4 în aceste cazuri. Pentru a face acest lucru, conectați controlerul la PS4 folosind un cablu micro-USB. Asigurați-vă că utilizați un cablu de înaltă calitate despre care știți că funcționează corect. </p> <p> </p> <p> apasă pe <strong> Butonul PS </strong> pe controler pentru o clipă, iar lumina ar trebui să clipească scurt înainte de a deveni albastră. Aceasta înseamnă că controlerul dvs. s-a împerecheat și s-a conectat cu succes. </p> <p> Dacă aveți DualShock 4 asociat cu un alt dispozitiv din apropiere, cum ar fi telefonul sau o PlayStation 5, acest lucru va porni probabil și va conecta controlerul la acel dispozitiv. Astfel, ar trebui să opriți și să deconectați orice dispozitiv la care este conectat mai întâi DualShock 4. </p> <p> După ce re-împerecheați controlerul, puteți deconecta cablul USB și puteți utiliza controlerul fără fir, în mod normal. PS4 vă va aminti până când veți împerechea controlerul cu un alt dispozitiv în viitor. </p> <p> Rețineți că numărul maxim de controlere DualShock 4 pe care le puteți conecta simultan la PS4 este de patru. Dacă aveți deja patru controlere conectate, va trebui să deconectați unul pentru a face loc pentru mai multe. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> Controlerul PS4 continuă să se deconecteze </h2> <p> Dacă DualShock 4 se deconectează aleatoriu în timpul jocului, există câteva remedii pe care le puteți încerca. </p> <p> Mai întâi, asigurați-vă că bateria controlerului este încărcată. Sună simplu, dar dacă bateria din controler este aproape descărcată, se poate deconecta. Pentru a verifica durata de viață a bateriei controlerului, țineți apăsat butonul <strong> Butonul PS </strong> pentru a afișa meniul rapid din partea stângă a ecranului. Veți vedea o pictogramă a controlerului cu afișajul bateriei în partea de jos. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Conectați controlerul la PS4 și vizitați din nou meniul rapid pentru a vă asigura că vedeți animația de încărcare a bateriei. După ce controlerul dvs. se încarcă pentru o perioadă de timp, încercați să-l utilizați normal. </p> <p> Dacă bateria nu a fost problema dvs., asigurați-vă că nu încercați să utilizați controlerul prea departe de sistem. Gama tipică Bluetooth este de aproximativ 30 de picioare; în funcție de configurare, este posibil să puteți utiliza controlerul mai mult decât acesta sau să fiți restricționat să îl utilizați mai aproape. </p> <p> Apropo de aceasta, ar trebui să încercați să reduceți la minimum interferențele dintre controler și consolă. Îndepărtați orice obiect metalic dintre cele două, cum ar fi rafturi sau laptopuri, care ar putea inhiba semnalul. De asemenea, ar trebui să scoateți PS4 din orice spațiu închis în care se află pentru o mai bună transmisie și recepție a semnalului. </p> <p> În cele din urmă, amintiți-vă că PS4 are o setare care oprește controlerele după ce acestea sunt inactive de ceva timp. Dacă nu doriți ca controlerul PS4 să se oprească atunci când urmăriți aplicații media precum YouTube, accesați <strong> Setări&gt; Setări economisire energie&gt; Setare timp până la oprirea controlerelor </strong> și alegeți <strong> Nu </strong> . Rețineți că acest lucru va consuma bateria chiar și în timp ce sunteți inactiv. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> Sfaturi generale pentru fixarea unui controler PlayStation 4 </h2> <p> Am analizat remedierile specifice pentru câteva probleme comune DualShock 4 de mai sus. În continuare, să analizăm soluții mai generale pentru problemele cu controlerele PS4. Parcurgeți-le dacă aveți nevoie de mai mult ajutor. </p> <h3 id=\"restart-your-console\"> 1. Reporniți consola </h3> <p> În timp ce majoritatea problemelor legate de controler provin din controler în sine, există șansa ca PS4-ul dvs. să aibă problema. Pentru a exclude acest lucru, ar trebui să reporniți consola înainte de soluționarea problemelor. </p> <p> Dacă controlerul dvs. funcționează suficient pentru a accesa meniurile, țineți apăsat butonul <strong> Butonul PS </strong> pentru a deschide meniul rapid, apoi accesați <strong> Putere&gt; Reporniți PS4 </strong> pentru a reporni sistemul. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> În cazul în care controlerul dvs. nu cooperează, apăsați lung pe <strong> Putere </strong> de pe consola PS4 până când auziți două bipuri. Acest lucru îl va opri complet (fără lumini în față) - după ce este oprit, apăsați butonul <strong> Putere </strong> apăsați din nou butonul pentru al porni din nou. </p> <p> Încercați să utilizați din nou controlerul după o repornire și vedeți dacă acest lucru vă ajută. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. Uitați și reasociați controlerul PS4 </h3> <p> Dacă aveți un al doilea controler PS4 (sau un controler PS Move), îl puteți utiliza pentru a accesa un meniu care vă permite să eliminați controlerul care are o problemă. Mergeți spre <strong> Setări&gt; Dispozitive&gt; Dispozitive Bluetooth </strong> și selectați <strong> DualShock 4 </strong> intrare - este cea care nu are lumină verde lângă ea. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> În meniul rezultat, apăsați tasta <strong> Opțiuni </strong> de pe controler și alegeți <strong> Uitați de dispozitiv </strong> . Acest lucru va face ca PS4-ul să îl elimine din memorie, așa că trebuie să-l împerecheați din nou. </p> <p> Acesta este un moment bun pentru a încerca o metodă de împerechere ușor diferită: să o re-împerecheați la pornire. Pentru a face acest lucru, opriți-vă PS4 (așa cum am explicat mai sus). Odată oprit, conectați controlerul problematic la consolă cu un cablu USB. Loveste <strong> Butonul PS </strong> să sperăm că porniți și împerecheați controlerul într-un singur proces. </p> <p> Dacă acest lucru nu funcționează, porniți din nou PS4 și încercați să-l împerecheați în mod normal, ca mai sus. </p> <h3 id=\"hard-reset-your-controller\"> 3. Resetați controlerul </h3> <p> Dacă scoaterea și re-împerecherea controlerului nu au funcționat, puteți încerca următoarea procedură de resetare completă pentru DualShock 4. Veți avea nevoie de un obiect mic cu vârfuri, cum ar fi o agrafă îndoită sau un instrument de evacuare a cartelei SIM, . </p> <p> Opriți PS4, apoi răsturnați controlerul. Veți vedea o gaură mică lângă șurub de butonul L2 (în partea dreaptă a controlerului când este răsturnat). Utilizați instrumentul cu vârfuri pentru a apăsa și ține apăsat butonul din interiorul acestei găuri timp de aproximativ cinci secunde. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> După ce ați făcut acest lucru, conectați din nou controlerul la PS4 prin cablu USB și vedeți dacă se împerechează cu succes. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Încercați controlerul în altă parte </h3> <p> În acest moment, dacă nu ați făcut-o deja, ar trebui să încercați să utilizați controlerul care are probleme cu un alt dispozitiv. Dacă aveți probleme similare pe PS4-ul unui prieten sau pe computerul dvs., controlerul dvs. este probabil defect. </p> <p> Este, de asemenea, o idee bună să încercați un alt controler PS4 cu consola dvs., dacă este posibil. Dacă împrumutați DualShock 4 al unui prieten despre care știți că funcționează corect și constatați că are probleme cu sistemul dvs., probabil că ceva nu este în regulă cu conectivitatea wireless a PS4. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Utilizați controlerul în modul cu fir </h3> <p> Înainte de a renunța la controler, ar trebui să încercați să vă jucați cu acesta conectat permanent printr-un cablu USB. Cu toate acestea, rețineți că acest lucru funcționează numai pentru modelul revizuit al controlerelor PS4. Veți ști că aveți acest model dacă există o bară de lumină în interiorul touchpad-ului din partea frontală a controlerului. Dacă nu, nu puteți forța comunicarea prin cablu. </p> <p> Dacă nu aveți deja unul, achiziționați un cablu lung pentru a vă putea bucura de jocuri de pe canapea. <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Ailun trei pachete </a> de cabluri micro-USB de 10 picioare este o bună opțiune rentabilă. </p> <p> Pentru a forța PS4 să conecteze controlere prin USB, mergeți la <strong> Setări&gt; Dispozitive&gt; Controlere&gt; Metodă de comunicare </strong> și alegeți <strong> Utilizați cablul USB </strong> . Acest lucru va împiedica DualShock 4 să utilizeze Bluetooth, chiar și atunci când este conectat prin USB. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> Opțiuni de remediere hardware DualShock 4 </h2> <p> La fel ca majoritatea componentelor hardware, controlerele DualShock 4 au o garanție de un an. Dacă ați cumpărat controlerul PS4 în ultimul an și nu îl puteți remedia cu toate sfaturile de mai sus, ar trebui să vizitați <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> Pagina de remediere și înlocuire a PlayStation </a> pentru a trimite o cerere de reparații la controlerul dvs. </p> <p> În caz contrar, puteți încerca soluții hardware deschizând controlerul. Dar, în funcție de problema specifică, acest lucru poate fi dificil sau imposibil. Vă recomandăm să discutați cu un tehnician local de reparații dacă nu vă simțiți confortabil să faceți acest lucru singur. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> Probleme cu controlerul PS4, remediate </h2> <p> Acum știți cum să remediați cele mai frecvente probleme ale controlerului PS4. Probleme mai specifice, cum ar fi un buton care nu mai funcționează, se regăsesc, din păcate, în soluțiile de remediere hardware menționate mai sus. </p> <p> Sperăm că problema dvs. a fost ușor de remediat. Dar dacă nu, și trebuie să ridicați un nou controler PS4, aveți o mulțime de opțiuni excelente. </p> <p> <small> Credit de imagine: Joeri Mostmans / <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}