{"title":"Cum să vezi cine te urmărește pe Facebook","content":"<p> Dacă îți pasă să obții mai mulți adepți pe Facebook la fel de mult îți place să crești prieteni pe Facebook, atunci ai vrea să vezi cine te urmărește pe Facebook. Puteți face acest lucru cu ușurință atât pe desktop, cât și pe mobil. </p> <p> Iată cum puteți afla câți adepți aveți pe Facebook. </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-desktop\"> Cum să vezi cine te urmărește pe Facebook (desktop) </h2> <p> Pe desktop, puteți vedea cine vă urmărește pe Facebook, dar nu și numărul de adepți. Cu toate acestea, aplicația mobilă Facebook vă permite să vedeți cine vă urmărește și numărul urmăritorilor dvs. </p> <p> <img alt=\"Facebook profile interface with friends\" src=\"images/click-more-and-select-followers-786.jpg\" loading=\"lazy\"> </p> <p> Mai întâi, conectați-vă la <a href=\"https://web.facebook.com\" target=\"_blank\" rel=\"nofollow noopener\"> cont de Facebook </a> prin intermediul browserului dvs. și utilizați următoarele instrucțiuni pentru a vedea urmăritorii dvs. de pe Facebook: </p> <ol> <li> Odată conectat, faceți clic pe <strong> pictogramă imagine mică </strong> lângă numele dvs. din bara laterală. </li> <li> În meniul Profil, faceți clic pe <strong> Prieteni </strong> . </li> <li> În meniul Prieteni, faceți clic pe <strong> Mai mult </strong> derulant în dreapta. </li> <li> Din lista derulantă, selectați <strong> Urmăritori </strong> pentru a vizualiza toți urmăritorii tăi de pe Facebook. </li> </ol> <p> </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-mobile\"> Cum să vezi cine te urmărește pe Facebook (mobil) </h2> <p> Așa cum am afirmat mai devreme, aplicația mobilă Facebook vă permite să accesați lista și numărul de persoane care vă urmăresc pe Facebook. </p> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (3 imagini) </strong> <img alt=\"Facebook profile about info menu\" src=\"images/tap-see-your-about-info-732.png\" loading=\"lazy\"> Extinde <img alt=\"Mobile Facebook interface displaying Facebook followers\" src=\"images/tap-see-all-to-load-a-list-of-your-followers-895.png\" loading=\"lazy\"> Extinde <img alt=\"Mobile Facebook page displaying a list of followers and their numbers\" src=\"images/look-to-the-upper-right-corner-to-see-the-number-of-followers-677.png\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> Conectați-vă la contul dvs. Facebook prin intermediul aplicației mobile. Apoi urmați aceste instrucțiuni: </p> <ol> <li> Pe pagina de pornire a aplicației mobile, atingeți pictograma imagine rotundă de lângă <strong> Ce este în mintea ta? </strong> bara de căutare pentru a vă încărca profilul. </li> <li> În meniul de profil, atingeți <strong> Consultați informațiile despre Despre dvs. </strong> . </li> <li> Derulați până în partea de jos a paginii. Apoi sub <strong> Urmăritori </strong> , Atingeți <strong> Vezi toate </strong> pentru a încărca o listă cu toți urmăritorii tăi de pe Facebook. </li> <li> Priviți în colțul din dreapta sus al paginii (opus <strong> Urmăritori </strong> ) pentru a vedea numărul de persoane care te urmăresc pe Facebook. </li> </ol> <p> Nu veți primi opțiunea de a vă verifica adepții Facebook dacă nu aveți. Ca urmare, urmarea pașilor de mai sus nu vă va permite să vă verificați adepții, deoarece nu există. </p> <p> De asemenea, este posibil să nu primiți această opțiune dacă contul dvs. Facebook este nou, deoarece probabil că nu aveți încă adepți. Sau s-ar putea să aveți nevoie <a href=\"https://www.makeuseof.com/tag/quickly-switch-facebook-profiles/\" target=\"_blank\" rel=\"nofollow noopener\"> comutați la un alt cont Facebook </a> . Alternativ, este posibil ca contul dvs. să nu fie setat pentru a permite oamenilor să vă urmărească pe Facebook - vom explica cum să schimbați acest lucru mai jos. </p> <p> </p> <p> </p> <h2 id=\"how-to-give-the-public-access-to-follow-you-on-facebook\"> Cum să oferiți accesul publicului pentru a vă urmări pe Facebook </h2> <p> Uneori, dacă ați interzis publicului să vă urmărească, limitează șansele de a obține mai mulți adepți pe Facebook. </p> <p> Asta pentru că persoanele care nu sunt pe lista ta de prieteni nu te pot urmări pe Facebook dacă nu le permiți acest lucru. Cu toate acestea, puteți seta preferința dvs. de urmărire ca „Public”, astfel încât oricine să vă poată urmări, mai degrabă decât prietenii. </p> <p> <strong> Pentru a face acest lucru pe desktop: </strong> </p> <p> <img alt=\"Facebook privacy settings page\" src=\"images/click-on-public-post-and-change-who-can-follow-you-to-public-880.jpg\" loading=\"lazy\"> </p> <ol> <li> Accesați profilul dvs. </li> <li> Apasă pe <strong> pictogramă derulantă rotundă </strong> în colțul din dreapta sus al barei de meniu. </li> <li> Din listă, selectați <strong> Setări și confidențialitate </strong> . </li> <li> Clic <strong> Setări </strong> . </li> <li> Din bara laterală a meniului Setări, faceți clic pe <strong> Postări publice </strong> . </li> <li> Uită-te în dreapta <strong> Cine mă poate urma </strong> și faceți clic pe <strong> Prieteni </strong> scapă jos. </li> <li> Selectați <strong> Public </strong> pentru a oferi acces de urmărire oricui, inclusiv celor care nu sunt prietenii tăi pe Facebook. </li> </ol> <p> <strong> Pentru a face acest lucru în aplicația mobilă Facebook: </strong> </p> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (3 imagini) </strong> <img alt=\"Facebook menu list\" src=\"images/tap-the-three-menu-bars-and-go-to-settings-170.png\" loading=\"lazy\"> Extinde <img alt=\"Facebook settings list\" src=\"images/scroll-down-and-select-public-posts-754.png\" loading=\"lazy\"> Extinde <img alt=\"Facebook followers settings page\" src=\"images/tick-the-public-option-under-who-can-follow-728.png\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <ol> <li> Deschideți aplicația mobilă Facebook și atingeți <strong> trei bare de meniu orizontale </strong> în dreapta paginii de pornire. </li> <li> Derulați în jos și selectați <strong> Setări </strong> . </li> <li> Atingeți <strong> Postări publice </strong> . </li> <li> Sub <strong> Cine mă poate urma </strong> , bifați <strong> Public </strong> . </li> </ol> <p> </p> <h2 id=\"keep-control-over-your-facebook-followers\"> Păstrați controlul asupra urmăritorilor dvs. de pe Facebook </h2> <p> Dacă utilizați Facebook pentru a vă promova marca sau afacerea, este necesar să vă urmăriți adepții. Este un mod bun de a modera ceea ce oamenii pot vedea despre tine. </p> <p> Dacă doriți mai mult control asupra prietenilor și adepților dvs. de pe Facebook, ar trebui să vă gândiți să le ascundeți din feed. </p>"}