{"title":"Cum se folosește aplicația Apple Watch Workout","content":"<p> Înțelegerea mai bună a progresului în fitness este la doar o atingere cu Apple Watch. </p> <p> Ne uităm la tot ce are de oferit aplicația Apple Watch Workout, inclusiv cum funcționează aplicația, ce tipuri de antrenament poate urmări și cum să vizualizăm toate informațiile pe care le colectează. </p> <h2 id=\"getting-started-with-the-workout-app\"> Noțiuni introductive despre aplicația de antrenament </h2> <p> Puteți deschide aplicația de antrenament pe un Apple Watch în mai multe moduri. În primul rând, trebuie doar să faceți clic o dată pe <strong> Coroana digitală </strong> pentru a afișa lista aplicațiilor de pe ceas. Apoi selectați <strong> A face exerciții fizice </strong> . </p> <p> O modalitate și mai rapidă este doar utilizarea Siri, fie prin apăsarea lungă a butonului <strong> Coroana digitală </strong> sau ridicând ceasul la gură. Apoi spuneți „Deschideți aplicația de antrenament”. </p> <p> După deschiderea aplicației, veți vedea o mare varietate de tipuri de antrenament - de la tir cu arcul la yoga și orice altceva între ele. </p> <p> Ecranul principal de selecție a antrenamentului este evidențiat de cele mai populare opțiuni. Derulați până în partea de jos a listei și selectați <strong> Adăugați antrenament </strong> pentru a vedea o listă cu alte tipuri de antrenament. Dacă dintr-un anumit motiv nu vedeți tipul de antrenament, puteți selecta și <strong> Alte </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> Puteți selecta <strong> trei puncte </strong> ( <strong> ... </strong> ) pe fiecare tip de antrenament pentru a seta un anumit obiectiv de distanță, calorii arse sau timp. Dacă vreunul dintre aceste obiective nu vă interesează, atingeți numele antrenamentului pentru a începe imediat. </p> <p> Pe ecran va apărea o numărătoare inversă de trei secunde înainte de începerea urmăririi. </p> <p> Toate funcțiile aplicației de antrenament sunt disponibile fără un iPhone în apropiere sau folosind doar un Apple Watch conectat la un semnal Wi-Fi sau celular. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Înțelegeți aplicația de antrenament </h2> <p> Există trei ecrane principale în aplicație. Puteți comuta între ele glisând la stânga sau la dreapta. </p> <p> Ecranul principal vă va arăta toate progresele în tipul de antrenament selectat. Veți vedea timpul de antrenament, caloriile active, caloriile totale și ritmul cardiac actual. În funcție de tipul de antrenament, este posibil să vedeți și distanța parcursă. </p> <p> Dacă aveți un Apple Watch Series 5 sau o versiune ulterioară și aveți afișajul întotdeauna activat, puteți vedea întotdeauna statisticile de antrenament. Oricine are un model mai vechi va trebui să ridice sau să atingă ecranul pentru a vedea aceste informații. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Când alergați sau mergeți, Apple Watch va oferi o atingere ușoară la fiecare kilometru sau kilometru și va afișa o actualizare cu informații despre ritm. O recapitulare și o atingere a ciclismului vor avea loc la fiecare cinci mile sau kilometri. </p> <p> Dacă faci un antrenament Apple Fitness +, poți vedea date atât în ​​aplicația de antrenament, cât și pe ecranul iPhone, iPad sau Apple Watch. </p> <p> </p> <p> Glisând direct de pe ecranul principal vă vor arăta patru opțiuni diferite— <strong> Lacăt </strong> , <strong> Nou </strong> , <strong> Sfârșit </strong> , și <strong> Pauză </strong> . </p> <p> Selectarea <strong> Lacăt </strong> va bloca ecranul pentru a evita apăsările accidentale. Puteți roti Digital Crown pentru a debloca ecranul. Doar de reținut, această opțiune se va activa automat în timpul oricărui tip de antrenament de înot pentru a preveni robinetele accidentale din picături de apă. </p> <p> După cum probabil ați putea ghici, <strong> Nou </strong> încheie antrenamentul curent și vă permite să alegeți un nou tip de exercițiu pentru a începe din nou. Selectarea <strong> Sfârșit </strong> va termina antrenamentul curent. </p> <p> Dacă sunteți întrerupt vreodată, puteți selecta <strong> Pauză </strong> buton. Apăsând-o din nou va începe urmărirea antrenamentului. Puteți face acest lucru și prin apăsarea simultană a coroanei digitale și a butonului lateral. </p> <p> Glisând la stânga de pe ecranul principal de antrenament sunt afișate comenzile de redare media. Acesta este un mod ușor de a vă accesa muzica sau orice altceva ascultați în timp ce vă antrenați. Puteți sări peste piese, să redați, să întrerupeți și să măriți sau să reduceți volumul. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Memento-uri automate de antrenament </h2> <p> Nu trebuie să vă faceți griji dacă uitați să începeți un antrenament. Atâta timp cât aveți watchOS 5 sau o versiune ulterioară, un Apple Watch poate recunoaște automat când vă antrenați. Vă va atinge pe încheietura mâinii și vă va întreba dacă doriți să înregistrați un antrenament, permițându-vă să schimbați tipul de antrenament, să dezactivați aceste notificări pentru ziua respectivă sau doar să respingeți această notificare. </p> <p> Deși poate dura câteva minute pentru ca notificarea să apară, tot creditul pentru antrenament este totuși salvat. </p> <p> Puteți primi mementouri de antrenament pentru următoarele tipuri de antrenament: plimbare în interior, plimbare în aer liber, alergare în interior, alergare în aer liber, eliptică, vâslitor, înot în piscină și înot în apă deschisă. </p> <p> Pentru a activa sau dezactiva funcția, mergeți la <strong> Setări&gt; Antrenament&gt; Începeți memento antrenament </strong> pe Apple Watch. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> Apple Watch poate simți, de asemenea, când un antrenament este finalizat. După o atingere, veți vedea o notificare pe ecran cu opțiuni pentru a încheia sau a întrerupe antrenamentul. De asemenea, puteți respinge complet notificarea și puteți continua antrenamentul. </p> <p> Comutați caracteristica îndreptându-vă către Apple Watch și accesați <strong> Setări&gt; Antrenament&gt; Finalizare memento antrenament </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Personalizați datele afișate în aplicația de antrenament </h2> <p> În vizualizarea Apple Watch Workout, puteți personaliza informațiile afișate pe ecran pentru mai multe tipuri diferite de antrenament. </p> <p> Pentru a începe, deschideți aplicația Watch companion de pe iPhone. În <strong> Ceasul meu </strong> selectați fila <strong> A face exerciții fizice </strong> . Atunci alege <strong> Vizualizare antrenament </strong> . În partea de sus a paginii, puteți selecta dacă să afișați valori unice sau multiple pe ecran în timpul unui antrenament. Dacă selectați <strong> Metrică unică </strong> , doar derulați Digital Crown pentru a vedea mai multe date pe Apple Watch. </p> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (3 imagini) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Extinde <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Extinde <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> Mai jos, puteți vedea, de asemenea, o serie de tipuri diferite de antrenament în care puteți edita informațiile afișate pe ecran. Selectați un tip de antrenament și apoi alegeți <strong> Editați | × </strong> în partea dreaptă sus a ecranului pentru a personaliza ceea ce este afișat pe ecran și în ce ordine. </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Vizualizarea datelor de antrenament în aplicația Fitness </h2> <p> După ce ați terminat un antrenament, toate datele sunt la doar câteva atingeri de pe iPhone. </p> <p> Pentru a-l vedea, deschideți fișierul <strong> Fitness </strong> aplicație. </p> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (2 imagini) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Extinde <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> Sub <strong> rezumat </strong> fila, selectați <strong> Antrenamente </strong> . Veți vedea informații despre toate antrenamentele. Datele sunt, de asemenea, disponibile în <strong> Sănătate </strong> aplicație. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Puneți o sudoare cu aplicația Apple Watch Workout </h2> <p> După cum puteți vedea, aplicația Apple Watch Workout este o modalitate excelentă de a vă ajuta să țineți evidența tuturor diferitelor valori de fitness în timp ce faceți totul, de la înot la dans și multe altele. </p> <p> Și când sunteți gata să o numiți o noapte și să vă îndreptați spre culcare, Apple Watch vă poate ajuta în continuare cu funcția de urmărire a somnului încorporată. </p>"}