{"title":"Cum să vă transformați PS5 de la vertical la orizontal (sau invers)","content":"<p> PlayStation 5 funcționează într-o configurație verticală sau orizontală. Dacă vă răzgândiți în privința orientării preferate, este destul de ușor să vă deplasați PS5 din verticală în orizontală (sau invers). </p> <p> Să vedem cum să vă deplasați în siguranță PS5 de la o orientare verticală la orizontală pe lateral și înapoi. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> Mai întâi: Opriți și deconectați PS5-ul </h2> <p> Înainte de a face orice lucru în mișcarea fizică a PlayStation 5, este important să îl opriți și să deconectați totul. Acest lucru va preveni deteriorarea sistemului care ar putea apărea dacă îl mișcați în timp ce este pornit. </p> <p> Ar trebui să opriți complet PS5. Pentru a face acest lucru, apăsați tasta <strong> Butonul PS </strong> de pe controler pentru a afișa meniul rapid din partea de jos a ecranului. Selectați <strong> Putere </strong> în dreapta și alegeți <strong> Dezactivați PS5 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Așteptați până când luminile consolei se sting, apoi deconectați cablul de alimentare, cablul HDMI și orice altceva conectat la sistem. Acum sunteți gata să schimbați orientarea PS5. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Scoateți șurubul suportului </h2> <p> Când configurați PS5 pe verticală, a trebuit să scoateți un șurub inclus dintr-un compartiment din bază și să-l utilizați pentru a fixa baza pe consolă atunci când stă pe verticală. Ca urmare, scoaterea acestui șurub este primul dvs. pas în schimbarea orientării consolei. </p> <p> Întoarceți ușor PS5-ul pe lateral, astfel încât să puteți accesa suportul din partea de jos. Folosiți o șurubelniță cu cap plat, monedă sau altele similare pentru a îndepărta șurubul de argint unic care ține baza de sistem. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Odată ce șurubul este slăbit, baza va fi liberă. Există un mic compartiment în bază unde puteți stoca șurubul. Puneți-l în poziție acolo, apoi glisați-l în orificiul mic pentru a-l menține fixat. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> De asemenea, în acest compartiment, veți găsi un mic dop negru (atâta timp cât îl puneți acolo în timpul configurării inițiale). Scoateți acest dop și folosiți-l pentru a conecta orificiul de pe partea de jos a PS5 de unde tocmai ați scos șurubul. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Rotiți baza </h2> <p> Acum, veți dori să rotiți baza, astfel încât să se potrivească pe consolă în orientarea orizontală. Aceasta închide și compartimentul mic în care ați plasat șurubul, asigurându-l în continuare. </p> <p> Ar trebui să rotiți baza atunci când o priviți din partea de sus (opusă locului în care tocmai ați depozitat șurubul). Dacă tratați porțiunea ridicată a standului ca „nord”, va trebui să rotiți partea exterioară a standului spre „nord-vest”, așa cum se arată mai jos. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Aceasta este orientarea corectă pentru utilizarea suportului pe orizontală. Se va face clic și se va opri ușor atunci când îl veți găsi în locul potrivit. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Atașați suportul în poziție orizontală </h2> <p> Acum, puteți atașa suportul la PS5 în timp ce este așezat orizontal. Asigurați-vă că sistemul este așezat corect - sigla PS ar trebui să fie orientată în sus. </p> <p> Pe partea din spate a sistemului dvs., dedesubt și aproape de cele două porturi USB, veți vedea câteva simboluri ale controlerului PlayStation imprimate pe consolă. Glisați brațele exterioare ale bazei (pe care tocmai le-ați rotit) pe sistem în jurul unde se termină acest model de fiecare parte. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Acționați clemele pentru a le fixa, dar rețineți că, în această poziție, suportul nu este complet blocat în poziție (așa cum este cu șurubul atunci când este așezat vertical). Fiți blând atunci când puneți sistemul jos și fiți conștienți de faptul că suportul ar putea aluneca dacă îl trageți. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Acum sunteți gata să utilizați PS5 în orientare orizontală. Conectați din nou toate cablurile și porniți-le pentru a reveni la redare. Dacă aveți PS5 standard, veți introduce discurile cu fața în sus în această orientare. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> Cum să vă schimbați PS5 înapoi de la orizontală la verticală </h2> <p> Doriți să reveniți la o orientare verticală pentru PS5 sau poate ați configurat inițial PS5 în formă orizontală și doriți să mergeți vertical acum? Oricum ar fi, este ușor să parcurgeți procesul de mai sus în ordine inversă. Asigurați-vă că opriți și deconectați mai întâi PS5, dacă este pornit în prezent sau în modul Repaus. </p> <p> </p> <p> Pentru a trece la o orientare verticală, ridicați mai întâi PS5-ul și trageți ușor standul din sistem pentru al scoate. Apoi, ar trebui să rotiți brațul exterior al bazei. Când îl priviți de sus, brațul trebuie să fie „la nord”, în linie cu porțiunea ridicată. Asigurați-vă că simțiți clicul ușor, astfel încât să știți că se află în locul potrivit. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> Poziționați PS5 astfel încât să puteți accesa partea de jos, apoi scoateți dopul negru din orificiul din mijloc - este situat aproximativ în mijlocul orificiilor. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Așezați acest dop negru în gaura mică din compartimentul de pe partea inferioară a bazei. Dopul trebuie să se fixeze chiar în locul său. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> Apoi, scoateți șurubul din același compartiment din bază. Acum, va trebui să atașați suportul în poziția corectă. Pentru a face acest lucru, ridicați PS5 în sus, astfel încât partea din spate a consolei să fie orientată în sus, așa cum se arată mai jos. </p> <p> Luați suportul și așezați-l astfel încât gaura șurubului să fie aliniată cu gaura șurubului din care tocmai ați scos dopul. Poziționați clemele pe brațul bazei din spatele sistemului dvs. sub conectorul de alimentare. Standul ar trebui să se alinieze ușor. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Acum, utilizați o șurubelniță sau similar pentru a strânge șurubul. Odată ce ați terminat și standul se simte ferm atașat, sunteți gata să utilizați PS5 pe verticală. Conectați din nou toate cablurile pentru a finaliza lucrarea. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> Ar trebui să vă ridicați PS5 pe verticală sau pe orizontală? </h2> <p> Sony acceptă utilizarea PS5 atât pe verticală, cât și pe orizontală, deci nu există o modalitate corectă sau greșită de a o face, atâta timp cât sistemul dvs. primește suficient flux de aer. Ce orientare ar trebui să utilizați depinde de nevoile dvs. </p> <p> </p> <p> Dacă aveți mult spațiu și nu vă deranjează că PS5 ocupă mult spațiu orizontal, aspectul orizontal este elegant. Pentru cei cu modelul standard PS5, facilitează și procesul de introducere a discurilor, deoarece eticheta ar trebui să fie întotdeauna cu fața în sus. Acest lucru este puțin mai greu de reținut cu orientarea verticală, unde eticheta discului ar trebui să fie orientată spre stânga. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> Cu toate acestea, este posibil să nu aveți spațiu în interiorul sistemului de divertisment pentru a găzdui configurarea orizontală. În aceste cazuri, mersul pe verticală este cel mai bun pariu. PS5 este o consolă uriașă în ambele sensuri, dar atunci când este așezat vertical, stă frumos lângă suportul TV sau similar. Aceasta este setarea pe care o folosesc, așa cum se arată în imaginea de mai jos. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> Indiferent de orientarea pe care o alegeți pentru PS5, asigurați-vă că utilizați suportul. Păstrează sistemul de la sol, ceea ce îmbunătățește fluxul de aer. Standul asigură, de asemenea, PS5, ceea ce face mai dificilă răsturnarea și potențialul său. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> Configurați-vă PS5 și începeți să jucați </h2> <p> Acum știi cum să îți schimbi PS5-ul din verticală în orizontală și înapoi în doar câteva minute. Odată ce sistemul dvs. este configurat, declanșați-l și bucurați-vă de unele dintre cele mai bune titluri ale PS5. </p> <p> Nu uitați că aproape toată biblioteca PS4 funcționează și pe PS5, oferindu-vă mult mai mult să vă bucurați. </p> <p> <small> Credit de imagine: Alex Van Aken / <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}