{"title":"Cum se remediază codul de oprire BSOD „EXCEPȚIE DE FIȚ DE SISTEM NEMANDRAT” în Windows 10","content":"<p> „EXCEPȚIA DE FIȚ DE SISTEM NEMANDRATĂ” este o eroare comună Windows 10 care apare în principal din cauza unui driver învechit sau incompatibil. </p> <p> Ceea ce face mai dificilă soluționarea decât alte BSOD-uri este că mai multe drivere pot cauza problema și, uneori, computerul dvs. nu le poate detecta pe toate. De aceea, primul pas pe care ar trebui să-l facă utilizatorii atunci când abordează această eroare este acela de a găsi driverul exact care cauzează problema. </p> <p> Iată cum remediați eroarea de excepție a firului de sistem care nu este gestionată pe Windows 10. </p> <h2 id=\"boot-into-safe-mode\"> 1. Porniți în modul sigur </h2> <p> Primul pas pe care ar trebui să-l facă utilizatorii înainte de a încerca să remedieze această problemă este de a porni computerul în modul sigur. În funcție de preferințe și de posibilitatea de a porni computerul în ecranul de conectare, există mai multe modalități de a face acest lucru: </p> <h3 id=\"boot-into-safe-mode-via-settings\"> Porniți în modul sigur prin setări </h3> <ol> <li> Faceți clic pe <strong> start </strong> , apoi selectați <strong> Setări </strong> . </li> <li> Navigheaza catre <strong> Actualizare și securitate </strong> apoi faceți clic pe <strong> Recuperare </strong> . </li> <li> Sub <strong> Pornire avansată, </strong> Click pe <strong> Reporniți acum. </strong> </li> <li> Când computerul repornește <strong> Alege o opțiune </strong> ar trebui să apară ecranul. </li> <li> De aici du-te la <strong> Depanare&gt; Opțiuni avansate&gt; Setări de pornire </strong> . Apoi faceți clic pe <strong> Repornire </strong> </li> <li> Când computerul repornește, apăsați <strong> F5 </strong> pentru a porni computerul <strong> Modul sigur in navigare pe internet </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> Din ecranul de conectare </h3> <ol> <li> Pur și simplu țineți apăsat <strong> Schimb </strong> și selectați <strong> Putere </strong> buton urmat de <strong> Repornire </strong> . </li> <li> Urmați pașii 4, 5 și 6 din secțiunea de mai sus. </li> </ol> <h3 id=\"from-a-blank-screen\"> Dintr-un ecran gol </h3> <ol> <li> Dacă nu puteți accesa ecranul de conectare, urmați acești pași. </li> <li> Țineți apăsat butonul de alimentare de pe dispozitiv timp de 10 secunde pentru a-l opri. </li> <li> Apăsați din nou butonul de pornire pentru al porni. </li> <li> De îndată ce computerul pornește, adică apare sigla producătorului, apăsați din nou butonul de alimentare timp de 10 secunde. </li> <li> Apăsați butonul de pornire pentru a porni dispozitivul. </li> <li> Dacă este făcut corect, computerul va porni în <strong> Windows Recovery Environment </strong> . </li> <li> Urmați pașii 4, 5 și 6 din prima secțiune. </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. Găsirea conducătorului auto care este responsabil </h2> <p> Deoarece eroarea este cel mai probabil cauzată de un driver care nu funcționează corect, puteți utiliza jurnalul Windows pentru a afla care dintre acestea. </p> <p> Pentru a face acest lucru, pur și simplu urmați acești pași: </p> <ol> <li> presa <strong> Tasta Windows + R </strong> și în <strong> Alerga </strong> caseta de dialog, tastați <strong> eventvwr. </strong> </li> <li> Navigați la <strong> Jurnalele Windows </strong> meniul și extindeți-l, apoi selectați <strong> Sistem. </strong> </li> <li> Căutați un jurnal numit <strong> system_thread_exception_not_handled </strong> și faceți clic pe el pentru a afla ce driver provoacă problema. </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> De obicei, driverul asociat va fi un driver de afișare sau un driver de rețea, deoarece acestea sunt cunoscute pentru provocarea acestui BSOD. Dacă fișierul asociat se întâmplă să fie <strong> nvlddmkm.sys </strong> , puteți arunca o privire la <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> câteva modalități ușoare de remediere. </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. Reduceți sau actualizați driverele </h2> <p> În funcție de ce driver este responsabil pentru eroarea de excepție a firului de sistem care nu este tratată, este posibil să fie necesar să actualizați sau să reinstalați driverele asociate. </p> <p> Dacă driverul nu a fost actualizat pentru o perioadă lungă de timp, atunci actualizarea driverului va rezolva cel mai probabil problema. Dacă driverul a fost actualizat recent, atunci poate fi mai bine să reveniți la driver sau să reinstalați actualizările. </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> Cum se actualizează driverele pe Windows 10 </h3> <ol> <li> presa <strong> Tasta Windows + R </strong> și introduceți <strong> devmgmt.msc </strong> pentru a deschide <strong> Manager de dispozitiv </strong> . </li> <li> Navigați la dispozitivul asociat și extindeți meniul. De exemplu, dacă eroarea a fost cauzată de un driver de afișaj, ar trebui să extindeți fișierul <strong> Adaptoare de afișaj </strong> opțiune. </li> <li> Faceți clic dreapta pe driver și faceți clic pe <strong> Actualizați driver-ul </strong> . </li> <li> În caseta de dialog care se deschide, faceți clic pe <strong> Căutați automat software-ul actualizat al driverului </strong> . </li> <li> Windows va căuta automat pe web cele mai recente drivere și le va instala. </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> Cum să reveniți la drivere pe Windows 10 </h3> <ol> <li> Deschis <strong> Manager de dispozitiv </strong> și navigați la șoferul în cauză. </li> <li> Extindeți meniul și faceți clic dreapta pe driver. </li> <li> Click pe <strong> Proprietăți </strong> . </li> <li> Sub <strong> Conducător auto </strong> fila, faceți clic pe <strong> Reveniți pe driver </strong> . </li> <li> Windows va reveni automat la ultima versiune disponibilă a driverului. </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. Redenumiți fișierul defect </h2> <p> După recuperarea numelui fișierului asociat cu eroarea de excepție a firului de sistem care nu a fost gestionată, utilizatorii ar trebui să redenumească fișierul. Dacă faceți acest lucru, Windows va crea o copie nouă și o va reinstala. Fișierele driverului sunt localizate la <strong> C: \\ Windows \\ System32 \\ drivere </strong> </p> <p> Urmați acești pași pentru a redenumi fișierul: </p> <ol> <li> Deschis <strong> Explorator de fișiere </strong> și du-te la <strong> C: \\ Windows \\ System32 \\ drivere </strong> </li> <li> Căutați șoferul afectat </li> <li> Faceți clic pe el și apăsați <strong> F2. </strong> </li> <li> Înlocuiți extensia numelui de fișier cu <strong> .vechi </strong> . </li> <li> Apăsați Enter și reporniți computerul. </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. Utilizați SFC și DISM pentru a repara fișierele de sistem </h2> <p> SFC și DISM sunt două instrumente puternice disponibile la dispoziția fiecărui utilizator Windows. În combinație, pot găsi și remedia aproape orice erori legate de sistem. De asemenea, sunt destul de simple de executat. </p> <p> </p> <p> Vă rugăm să vă asigurați că creați un punct de restaurare a sistemului, deoarece aceste comenzi modifică fișierele de sistem. </p> <h3 id=\"how-to-use-dism\"> Cum se folosește DISM </h3> <ol> <li> Alerga <strong> Prompt de comandă </strong> ca administrator </li> <li> În consolă, tastați <strong> DISM / Online / Cleanup-Image / ScanHealth </strong> și apăsați Enter. </li> <li> Așteptați ca Windows să termine scanarea. Apoi tastați <strong> DISM / Online / Cleanup-image / RestoreHealth </strong> </li> <li> Windows va repara toate problemele care au fost găsite în timpul scanării. </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> Cum se folosește SFC </h3> <ol> <li> În bara de căutare a meniului Start, tastați <strong> cmd </strong> apoi faceți clic dreapta pe <strong> Prompt de comandă </strong> și rulați-l ca administrator. </li> <li> În consolă, introduceți <strong> sfc / scannow </strong> </li> <li> Aveți răbdare, deoarece Windows va lua timp să scaneze și să înlocuiască fișierele de sistem corupte. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. Utilizați System Restore pentru a vă restabili computerul </h2> <p> Dacă problema rămâne nerezolvată, va trebui să utilizați Restaurarea sistemului ca ultimă soluție. Restaurarea sistemului este o caracteristică care restabilește Windows într-o stare anterioară. Aceste puncte de restaurare sunt create periodic și la instalarea unui nou software. Alternativ, puteți seta <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows pentru a crea zilnic un punct de restaurare </a> </p> <h3 id=\"how-to-use-system-restore\"> Cum se folosește Restaurarea sistemului </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> În bara de căutare a meniului Start, tastați <strong> Panou de control </strong> și faceți clic pe deschideți-l. </li> <li> În bara de căutare a panoului de control, introduceți <strong> Recuperare </strong> și deschideți-l din rezultate. </li> <li> Click pe <strong> Deschideți Restaurare sistem </strong> . </li> <li> Click pe <strong> Următorul </strong> și selectați un punct de restaurare din listă. </li> <li> Click pe <strong> Finalizarea. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> Excepție gestionată </h2> <p> Sfaturile enumerate mai sus oferă o soluție ușoară pentru neplăcerile cauzate de BSOD-uri, cum ar fi system_thread_exception_not_handled. Cea mai bună parte este că majoritatea sfaturilor pot fi folosite pentru a diagnostica o mulțime de alte erori frecvente ale ecranului albastru al morții (BSOD) și în Windows. </p>"}