{"title":"Consultați versiunea de browser a xCloud Microsoft","content":"<p> Dacă așteptați cu nerăbdare noutăți pe portul browserului xCloud, atunci astăzi este ziua voastră norocoasă pentru că puteți arunca o privire asupra a ceea ce arată de fapt. </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> Testerii dezvăluie capturi de ecran xCloud Browser </h2> <p> xCloud este disponibil în prezent pe o serie de dispozitive, dar așteptăm în continuare ca Microsoft să lanseze oficial versiunea browserului. </p> <p> Detaliile au fost destul de rare ... până acum. Potrivit unui raport al <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> The Verge </a> „Sursele familiare cu planurile Xbox ale Microsoft” susțin că „angajații testează acum o versiune web a xCloud înainte de o previzualizare publică”. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Iată o primă privire asupra xCloud-ului Microsoft pentru web <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> - The Verge (@verge) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> 15 februarie 2021 </a></blockquote>  <p> Nu uitați, acestea sunt doar imagini de la testere, ceea ce înseamnă că - deși este puțin probabil - Microsoft ar putea schimba în întregime aspectul versiunii browserului xCloud. </p> <p> Din capturi de ecran, se pare că xCloud este configurat la fel ca versiunea Android, care este disponibilă pe smartphone-uri și tablete. </p> <p> Puteți vedea jocuri adăugate recent în partea de sus a capturii de ecran, urmată de o secțiune „În curând”. Mai jos, aveți diverse opțiuni pentru a selecta un gen de joc la alegere, cu biblioteca completă de jocuri xCloud disponibilă în partea de jos a paginii. </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> Cum accesați xCloud în browserul dvs.? </h2> <p> În prezent, nu puteți. Versiunea publică a portului web xCloud nu este încă disponibilă. Ceea ce înseamnă că trebuie să așteptați puțin mai mult dacă doriți să accesați xCloud prin browser. Se presupune că Microsoft intenționează să dezvăluie public serviciul în al doilea trimestru al anului 2021. </p> <p> Până atunci, va trebui să găsiți alte metode de accesare a xCloud. În prezent, puteți accesa serviciul de jocuri cloud numai pe dispozitivele Android (aveți nevoie de versiunea browserului pentru a juca pe iOS, datorită <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> o scuipare între Apple și Microsoft </a> ). </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> Puteți accesa jocurile xCloud în alt mod? </h2> <p> Ei bine, da și nu. Nu puteți accesa niciun titlu pe xCloud, ca să spunem așa. Nu, cu excepția cazului în care utilizați un dispozitiv Android și aplicația oficială Game Pass pentru a face acest lucru. </p> <p> Cu toate acestea, jocurile disponibile pe serviciul de jocuri cloud Microsoft sunt toate disponibile pe Game Pass. De fapt, aveți acces la xCloud ca parte a unui abonament Game Pass Ultimate. Așadar, puteți accesa în continuare acele jocuri prin Xbox sau un computer Windows. </p> <p> Deci, într-un cuvânt, da. Puteți accesa aceste jocuri într-un alt mod. Doar nu folosiți xCloud, cu excepția cazului în care aveți acces la versiunea Android. </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud: În curând pe un dispozitiv iOS din apropiere </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> Nu ar trebui să așteptați mult până când veți putea pune mâna pe platforma de jocuri cloud Microsoft. Odată ce xCloud a trecut prin testare, Microsoft va face toate modificările necesare înainte de a ne lăsa pe toți să aruncăm o privire și, sperăm că nu după mult timp, să jucăm și el. </p>"}