{"title":"Cum să vă resetați recomandările Apple Music","content":"<p> Apple Music obișnuia să aibă un mod ușor accesibil de a vă re-recomanda recomandările muzicale, reselectând artiștii și genurile muzicale preferate. Din păcate, în timpul unei actualizări a aplicației, Apple a eliminat această metodă de reîmprospătare a curajului muzical. </p> <p> Nu vă temeți, iată un ghid despre metodele alternative pentru a opri sau a reseta sugestii automate Apple Music. </p> <h2 id=\"apple-music-recommendations-explained\"> Recomandări Apple Music explicate </h2> <p> Când lansați inițial contul Apple Music pentru prima dată, acesta vă solicită să selectați preferințele dintr-o listă largă de genuri muzicale și artiști. Această curățenie este modul în care Apple Music va sugera liste de redare, albume, artiști și melodii pentru a merge mai departe. </p> <p> De exemplu, dacă ați selecta Classic Rock, New Rock și Foo Fighters ca unele dintre alegerile dvs. preferate de muzică, Apple Music ar sugera probabil posturi de ascultare foarte similare și va promova muzica rock lansată recent. </p> <p> Modificările aduse aplicației înseamnă că acum sunteți capabil să vă pregătiți preferințele muzicale numai în timpul creării contului inițial, nu le puteți reseta la o dată ulterioară - deși Apple Music va continua să-și modifice sugestiile pe baza obiceiurilor dvs. de ascultare. </p> <p> Acesta este doar unul dintre mai multe utile <a href=\"https://www.makeuseof.com/tag/apple-music-features-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Caracteristici Apple Music de utilizat </a> . </p> <p> Nu vă faceți griji, există încă câteva modalități prin care vă puteți reseta programul Apple Music fie dezactivând preferințele dvs. Apple ID, fie ștergând și recreând contul dvs. Apple Music. </p> <p> Ambele opțiuni au avantaje și dezavantaje, așa că haideți să ne dăm seama care este cea mai bună opțiune pentru dvs. </p> <p> </p> <h2 id=\"turn-off-personalized-recommendations\"> Dezactivați recomandările personalizate </h2> <p> Dezactivarea Recomandărilor personalizate pentru ID-ul dvs. Apple este o modalitate bună de a înceta să vedeți orice sugestii noi merg mai departe. </p> <p> Dezactivarea acestei opțiuni nu va elimina datele curatare existente, ceea ce înseamnă că aplicația va continua să creeze sugestii pe baza utilizării dvs. Pur și simplu nu îi vei mai vedea. Închiderea recomandărilor personalizate va afecta și recomandările dvs. în alte aplicații de servicii Apple, cum ar fi Apple Books. </p> <p> Iată cum să dezactivați recomandările personalizate pe un iPhone: </p> <ol> <li> Deschide <strong> Apple Music </strong> aplicație. </li> <li> Du-te la <b> Ascultă acum </b> filă. </li> <li> Deschideți profilul Apple Music selectând pictograma circulară cu silueta unei persoane în colțul din dreapta sus al ecranului. Dacă ați încărcat anterior o imagine ca imagine de profil personală, aceasta va apărea în locul siluetei. </li> <li> Selectați <b> Vezi ID-ul Apple </b> care poate fi localizat derulând în partea de jos a <b> Cont </b> pagină. </li> <li> Opriți <b> Recomandări personalizate </b> . </li> <li> Selectați <b> Terminat </b> în colțul din dreapta sus și ați terminat. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (3 imagini) </strong> <img alt=\"Apple Music Lisen Now featuring Halle x Chloe\" src=\"images/apple-music-listen-now-page-713.jpg\" loading=\"lazy\"> Extinde <img alt=\"Apple Music Account Options Screenshot\" src=\"images/apple-music-account-page-914.jpg\" loading=\"lazy\"> Extinde <img alt=\"Apple ID Options Screenshot\" src=\"images/apple-id-account-page-817.jpg\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> După ce faceți acest lucru, orice căutare, descărcare sau redare de muzică nouă în Apple Music nu va mai afecta sugestiile dvs. automate. Aceasta nu va șterge automat căutările anterioare, ceea ce înseamnă că poate dura puțin timp pentru a observa efectele acestei metode. </p> <p> </p> <h2 id=\"delete-your-apple-music-profile\"> Ștergeți profilul dvs. Apple Music </h2> <p> Dacă aveți nevoie de o renovare completă a Apple Music cu sugestii de muzică proaspătă, cea mai bună opțiune este ștergerea și recreerea profilului dvs. Apple Music. </p> <p> Este important să rețineți că ștergerea profilului dvs. va elimina complet biblioteca de muzică actuală. Crearea unui profil nou vă va permite să selectați toate preferințele de muzică și gen, dar va elimina complet orice istoric anterior Apple Music. </p> <p> </p> <p> Dacă sunteți interesat de un nou profil Apple Music cu favorite selectate recent, urmați acești pași pentru a crea unul: </p> <ol> <li> De la <strong> Ascultă acum </strong> fila, accesați Apple Music <strong> Cont </strong> , și selectați <b> Vezi profil </b> . </li> <li> Selectați <b> Editați | × </b> în centrul ecranului sub numele tău. </li> <li> Derulați până în partea de jos a ecranului și selectați <b> Ștergeți profilul </b> . Fiți avertizat, aceasta este o ștergere permanentă care va necesita o resetare a contului. </li> <li> Configurați un nou profil Apple Music pentru dvs., care este acum liber de vechile selecții. Dacă ați dezactivat Recomandările personalizate așa cum este descris în secțiunea de mai sus, nu veți mai experimenta sugestii de muzică personalizate. Plecând <strong> Recomandări personalizate </strong> pe va avea ca rezultat Apple Music sugerând muzică pe baza noilor obiceiuri de ascultare. </li> <li> Navigați liber și bucurați-vă de o gamă largă de opțiuni audio nou selectate. </li> </ol> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (2 imagini) </strong> <img alt=\"Apple Music Profile feat Halle x Chloe\" src=\"images/apple-music-profile-page-771.jpg\" loading=\"lazy\"> Extinde <img alt=\"Apple Music Profile Options Screenshot\" src=\"images/apple-music-edit-profile-page-450.jpg\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> </p> <h2 id=\"spotify-s-recommendations-might-be-better\"> Recomandările Spotify ar putea fi mai bune </h2> <p> Dacă sunteți încă nemulțumiți de recomandările Apple Music chiar și după crearea unui profil nou, ar putea fi timpul să schimbați platformele de streaming muzical. Apple Music și Spotify au o mulțime de caracteristici foarte asemănătoare, dar o mulțime de oameni consideră că Spotify este mult superior când sugerează muzică nouă. </p> <p> Desigur, există o mulțime de alți factori de luat în considerare și atunci când alegeți între Apple Music și Spotify. </p>"}