{"title":"DeviantArt adaugă o bară laterală și grupuri la aplicația sa mobilă","content":"<p> Fiecare artist vizual are propriul său proces creativ unic, dar este obișnuit - în special în era digitală de astăzi - ca ultimul pas al acestui proces să fie partajarea piesei dvs. finite online. </p> <p> Au trecut vremurile în care trebuie să găsești muzee care să-ți ia tablourile sau fotografiile pentru ca oamenii să le vadă. În schimb, alegeți o platformă care vă atrage cel mai mult și postați-o! </p> <p> Fondată în 2000, DeviantArt este una dintre cele mai vechi comunități de artă de pe internet. DeviantArt și-a lansat aplicația mobilă în 2017, iar cea mai nouă actualizare este mică, dar semnificativă. </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt pentru mobil își îmbunătățește navigarea </h2> <p> DeviantArt a îmbunătățit interfața cu utilizatorul aplicației sale mobile, adăugând o bară laterală foarte similară cu cea de pe site-ul web DeviantArt. Bara laterală vă oferă acces rapid la pagina de pornire, devianți (artiști) pe care îi urmăriți și grupuri. </p> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (2 imagini) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> Extinde <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> Accesul la ultimul articol din această listă este deosebit de notabil, deoarece înainte de această actualizare, grupurile DeviantArt erau disponibile numai pe site. Grupurile DeviantArt funcționează similar cu <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> Grupuri Facebook </a> — Colecții de utilizatori care s-au unit pe platformă cu interese sau obiective comune. </p> <p> În bara laterală, puteți atinge <strong> Grupurile mele </strong> pentru a vizualiza toate grupurile din care faceți parte sau <strong> Grupuri recomandate </strong> pentru a vizualiza grupuri despre care DeviantArt crede că ar fi potrivite pentru dvs. De asemenea, puteți fixa grupurile preferate în partea de sus a barei laterale pentru acces mai ușor. </p> <p> Dacă vă conduceți propriul grup, acesta ar putea apărea în secțiunea recomandată pentru alți devianți care ar putea fi interesați să se alăture. Dacă nu vă interesează un grup, puteți atinge cele trei puncte din dreapta numelui acestuia pentru a elimina recomandarea. </p> <p> Când vizitați un grup în aplicație, veți vedea atât abaterile (trimiterile), cât și postările acestuia. Administratorii grupului pot publica actualizări la grupul lor din feedul de postări. </p> <p> <strong> Descarca: </strong> DeviantArt pentru <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> (Gratuit) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> Unde partajați creațiile dvs. online? </h2> <p> Dacă sunteți un artist, designer sau fotograf care a fost pe internet de mult timp, este posibil să fiți la DeviantArt la un moment dat. Comunitatea nu pare a fi la fel de animată ca la începutul anilor 2000, dar volumul lucrărilor trimise a explodat în ultimii ani. </p> <p> Cu o bază de utilizatori atât de activă, ar trebui să devină extrem de important pentru DeviantArt să-și îmbunătățească aplicația mobilă. La momentul scrierii, aplicația este evaluată cu 2,6 / 5,0 în App Store și 3,2 / 5,0 pe Google Play. </p>"}