{"title":"Disney + este aproape de 100 de milioane de abonați","content":"<p> Nu subestima niciodată Disney. În timp ce Disney + a fost lansat doar în SUA în noiembrie 2019, serviciul de streaming are acum aproape 100 de milioane de abonați. Este o creștere la care nici măcar compania nu se aștepta. </p> <h2 id=\"how-many-customers-does-disney-have\"> Câți clienți are Disney +? </h2> <p> După cum a fost anunțat în <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Raportul câștigurilor Disney Q1 2021 </a> , Disney + are 94,9 milioane de abonați la nivel global, începând cu 2 ianuarie 2021. </p> <p> Înseamnă că cifra nu ia în considerare abonații câștigați prin lansarea cu succes a WandaVision. Nu ar fi nedrept să presupunem că Disney + are acum peste 100 de milioane de abonați. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Ultimele cifre au fost raportate în decembrie 2020, când Disney a anunțat că a achiziționat 86 de milioane de abonați pentru serviciul său de streaming titular. Saltul de atunci poate fi atribuit probabil unui conținut exclusiv puternic, precum sezonul doi al filmului The Mandalorian și al lungmetrajului Pixar Soul. </p> <p> Venitul mediu lunar pe abonat a scăzut de la 5,56 USD în urmă cu un an la 4,04 USD astăzi, ceea ce poate fi contabilizat în cea mai mare parte la costul mai mic al serviciului în India și Indonezia. </p> <p> Hulu și ESPN +, servicii de streaming deținute și de Disney, au cunoscut și o creștere puternică. Primul a crescut cu 30% de la an la an, la 39,4 milioane de abonați, în timp ce cel de-al doilea a crescut cu 83% de la an la an, pentru un total de 12,1 milioane de abonați. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney a lansat recent un pachet care combină toate serviciile sale de streaming </a> , deci este clar că compania continuă să sprijine toate cele trei. </p> <p> Star va fi lansat în curând și în multe regiuni, ceea ce va oferi un impuls uriaș numărului de filme și emisiuni TV pe care le oferă Disney +. </p>"}