{"title":"De ce încărcător aveți nevoie pentru Samsung Galaxy S21?","content":"<p> În ceea ce ar fi putut fi un șoc pentru utilizatorii Samsung loiali, producătorul emblematic a decis să nu includă un încărcător în cutie pentru Galaxy S21, Galaxy S21 + și Galaxy S21 Ultra. </p> <p> Acest lucru urmează marii mișcări a Apple de a scoate încărcătorul din seria iPhone 12 în continuare, obligându-i pe consumatori să folosească un încărcător pre-cumpărat sau să cumpere unul nou. </p> <p> Așadar, probabil că vă întrebați ce ar trebui să căutați într-un încărcător. Am enumerat exact ceea ce trebuie să știți atunci când cumpărați un nou încărcător pentru Samsung Galaxy S21. </p> <h2 id=\"galaxy-s21-charger-how-many-watts-do-you-need\"> Încărcător Galaxy S21: Câți wați aveți nevoie? </h2> <p> Daca esti <a href=\"https://www.makeuseof.com/samsung-galaxy-s21-worth-upgrading/\" target=\"_blank\" rel=\"nofollow noopener\"> trecerea la seria Samsung Galaxy S21 </a> , veți găsi mai multe upgrade-uri grozave și un downgrade mare: excluderea unui încărcător ca unul dintre cadouri gratuite. În schimb, Samsung vă oferă doar un cablu USB-C pentru transferul de date sau conectarea la o cărămidă de încărcător existentă. </p> <p> Cel mai important lucru atunci când vă cumpărați încărcătorul sau reutilizați unul vechi este să vă asigurați că este pe deplin compatibil. </p> <ul> <li> Gama Samsung Galaxy S21 este compatibilă cu încărcătoarele USB-C care acceptă livrarea USB Power 3.0, <strong> până la 25 de wați </strong> sau Quick Charge 2.0. </li> <li> Încărcătoare care furnizează energie <strong> mai mici de 25 de wați vor funcționa în continuare </strong> , dar va încărca telefonul mult mai încet. </li> </ul> <p> Acest lucru se aplică și dacă alegeți să îl încărcați prin laptop sau alt dispozitiv. Deci, verificați capacitatea încărcătorului pentru a activa funcții de încărcare super-rapidă sau rapidă pe dispozitivul dvs. </p> <p> Pentru o încărcare de 25 W, o încărcare de 30 de minute vă va oferi aproximativ 50% autonomie a bateriei. </p> <p> </p> <h2 id=\"what-types-of-charger-work-with-the-s21\"> Ce tipuri de încărcătoare funcționează cu S21? </h2> <p> <img alt=\"samsung wireless charging\" src=\"images/wireless-charger-221.jpg\" loading=\"lazy\"> Credit de imagine: <a href=\"https://www.samsungmobilepress.com/mediaresources/wiresless_charger_trio/images?imgType=lifeStyle\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Samsung </a> </p> <p> După ce vă înregistrați cu capacitatea de alimentare care se potrivește dispozitivului dvs. Galaxy, puteți alege acum între diferite tipuri de încărcătoare care vă susțin stilul de viață și confortul: </p> <ul> <li> <strong> Încărcătoare de perete: </strong> Încărcătoarele de perete sunt livrate cu o cărămidă care acționează ca o priză pentru a introduce în priza de perete cu un port USB la un capăt. Aceste încărcătoare sunt cele mai frecvente dintre tipurile de încărcătoare și, de obicei, vă pot oferi capacitatea maximă de încărcare a telefonului. Samsung Galaxy S21 acceptă încărcătoare de perete de până la 25W pentru încărcare rapidă. </li> <li> <strong> Bănci de energie: </strong> Băncile de alimentare sunt o sursă de energie portabilă pentru a încărca orice articole alimentate cu baterii, cum ar fi telefoanele mobile. De obicei, vor furniza cu mult sub 25W necesari pentru încărcarea rapidă, dar sunt bune ca sursă de alimentare de rezervă. Cel mai bine este să vă uitați la băncile de alimentare aprobate de Samsung pentru Galaxy S21. </li> <li> <strong> Încărcătoare wireless: </strong> Încărcătoarele fără fir sau încărcătoarele inductive sunt din ce în ce mai populare ca platforme care vă încarcă telefonul atunci când îl puneți deasupra sau îl așezați pe locul indicat al încărcătorului. <a href=\"https://www.makeuseof.com/wireless-charging-how-it-works-and-everything-else-you-must-know/\" target=\"_blank\" rel=\"nofollow noopener\"> Încărcare wireless </a> vă ajută să nu uitați priza telefonului smartphone și previne supraîncălzirea, deoarece se oprește automat atunci când dispozitivul este încărcat complet. Oferă aproximativ 15W putere. </li> </ul> <p> </p> <h2 id=\"how-to-find-the-right-charger\"> Cum să găsiți încărcătorul potrivit </h2> <p> Un încărcător bun nu trebuie să vorbească de la sine. Există forumuri pe internet care oferă recenzii fiabile despre produs după un timp de testare. </p> <p> <img alt=\"samsung wall charger\" src=\"images/samsung-charger-479.jpg\" loading=\"lazy\"> </p> <p> Unii dintre factorii definitori ai unui încărcător bun sunt durabilitatea și longevitatea acestuia, o bună reglare a tensiunii de ieșire, izolarea fonică și certificarea încorporată, așa cum se indică prin simbolurile CE, MFI și RoHS pe caramida sau carcasa încărcătorului. </p> <p> Chiar dacă decideți să nu alegeți un încărcător oficial Samsung, tot merită să alegeți un brand cunoscut, mai degrabă decât unul dintre modelele ieftine pe care le veți găsi în locuri precum Ebay. Sau, desigur, puteți utiliza un încărcător de pe un telefon vechi. </p> <p> </p> <h2 id=\"use-an-old-charger-with-the-s21\"> Folosiți un încărcător vechi cu S21 </h2> <p> Deși este dezamăgitor faptul că nu există încărcător în cutia S21, Samsung consideră că majoritatea utilizatorilor vor avea deja unul (sau mai mulți) oricum și probabil au dreptate. S20 avea un încărcător de 25W, iar majoritatea celorlalte telefoane din ultimii ani au avut încărcătoare de 15-25W și, uneori, chiar mai multe. Este posibil să nu fie nevoie să cumpărați deloc un încărcător nou. </p> <p> Și dacă treceți la un dispozitiv Samsung pentru prima dată, este posibil să aveți nevoie de ajutor pentru a vă obișnui cu One UI. Asigurați-vă că consultați sfaturile și trucurile noastre privind utilizarea acestui software pentru a vă pune la curent. </p>"}