{"title":"Google adaugă asistență Face ID pe Chrome pentru iOS","content":"<p> Google testează o nouă funcție de securitate în Chrome 89 pentru iOS care utilizează autentificarea biometrică a iPhone-ului pentru a vă proteja filele de navigare privată. Limitat în prezent la persoanele de pe canalul beta al Chrome, acest lucru vă va permite să vă blocați filele Incognito cu Face ID sau Touch ID. </p> <h2 id=\"even-more-private-private-browsing\"> Navigare privată și mai privată </h2> <p> Orice file Incognito protejate cu Face sau Touch ID sunt neclare în comutatorul de file. Filele blocate devin din nou vizibile odată confirmate cu autentificarea biometrică a ‌iPhone‌. </p> <p> Nu numai că această caracteristică utilă îți mărește confidențialitatea, dar îți întărește și securitatea pe măsură ce faci mai multe sarcini între aplicații de pe iPhone sau iPad. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> constată că nu toți utilizatorii beta pot accesa noua opțiune de blocare datorită unei componente de pe server. </p> <p> </p> <h2 id=\"how-s-this-useful\"> Cum este util acest lucru? </h2> <p> Este, de asemenea, util pentru acele momente în care un prieten ar putea cere să vă împrumute iPhone-ul pentru a căuta rapid ceva online. Cu protecția Face ID pentru modul de navigare privată al Chrome, aceștia nu vor putea vedea site-urile web incognito deschise atunci când comutați filele. </p> <p> </p> <p> „Incognito” este un nume de marketing pentru modul de navigare privată Chrome. În timp ce este incognito, puteți naviga pe web fără ca Chrome să salveze informații despre sesiune. Când închideți o fereastră incognito, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> toate informațiile despre acea sesiune dispar </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> Cum se activează Face sau Touch ID în Chrome </h2> <p> Această nouă funcție viitoare trebuie să fie activată manual în secțiunea de confidențialitate din setările Chrome în aplicație. O blocare de confidențialitate similară este prezentă în alte aplicații Google. </p> <p> În aplicația de căutare nativă, de exemplu, autentificarea biometrică a iPhone-ului vă confirmă identitatea atunci când reveniți la o sesiune Incognito după 15 minute. O autentificare opțională Face sau Touch ID este, de asemenea, disponibilă în Google Drive pentru a vă proteja fișierele la ieșirea din aplicație. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> Când va fi lansată funcția oficial? </h2> <p> Deocamdată nu se știe când noua opțiune de blocare ar putea fi lansată pentru toată lumea, dar se așteaptă ca Chrome 89 să fie lansat pentru consumul public luna viitoare. De asemenea, Google ar putea decide să nu lanseze deloc funcția, în ciuda faptului că este listată în notele oficiale de lansare. </p>"}