{"title":"Guvernul SUA vrea să știe despre acuratețea etichetelor de confidențialitate ale aplicațiilor","content":"<p> Cu etichetele sale de confidențialitate pentru aplicații iOS 14 din App Store, Apple oferă utilizatorilor o nouă modalitate de a fi împuterniciți, având mai multe cunoștințe despre aplicațiile pe care le folosesc --- și modul în care aceste aplicații ar putea să le urmărească. </p> <p> Dar se pare că este, de asemenea, potențial deschis o cutie de viermi pentru sine, deoarece Apple este acum împins să garanteze acuratețea acestor etichete, pe care dezvoltatorii au început să le trimită Apple în decembrie. </p> <h2 id=\"concerns-over-accuracy\"> Preocupări privind precizia </h2> <p> După cum sa menționat de <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumors </a> , Apple a primit un <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> scrisoare </a> de la Comitetul Camerei SUA pentru Energie și Comerț, cerându-i să clarifice informații despre acuratețea furnizată de dezvoltatori a etichetelor sale de confidențialitate a aplicațiilor. </p> <p> Aceste etichete sunt o caracteristică așteptată cu nerăbdare în unele sferturi, temută în altele a iOS 14, care îi va forța pe dezvoltatori să fie mai deschiși cu privire la modul în care aplicațiile lor interacționează cu datele utilizatorilor. Înseamnă că utilizatorii vor putea lua o decizie mai informată atunci când vine vorba de beneficiile și dezavantajele utilizării anumitor aplicații. </p> <p> </p> <p> În scrisoarea sa, Comitetul Camerei SUA pentru Energie și Comerț întreabă Apple despre rapoartele care sugerează că anumite etichete de confidențialitate ale aplicațiilor pot oferi utilizatorilor informații „înșelătoare și false”. Acest lucru se bazează pe un raport, publicat luna trecută, care susține că multe aplicații care au o stare de sănătate curată s-ar putea să nu fie atât de inocente pe cât sugerează. </p> <p> O problemă potențială cu caracteristica iOS 14 este că se bazează pe onestitatea dezvoltatorilor pentru a spune cum sunt colectate datele, precum și pentru a confirma că aceste informații sunt corecte. Apple însăși observă că informațiile „nu au fost verificate de Apple”. </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Solicitarea unui răspuns de la Apple </h2> <p> Deși pare probabil că majoritatea dezvoltatorilor vor juca corect și vor respecta sistemul de onoare, nu este ceva ce poate fi considerat de la sine înțeles. Apple va verifica în mod obișnuit informațiile pe care le trimite. Cu toate acestea, numărul enorm de aplicații din App Store face imposibilă verificarea personală a fiecărei înregistrări de către Apple. </p> <p> Scrisoarea Comitetului Camerei SUA pentru Energie și Comerț continuă că: </p> <blockquote> <p> „Îi îndemnăm pe Apple să îmbunătățească validitatea etichetelor sale de confidențialitate a aplicațiilor, pentru a ne asigura că consumatorii primesc informații semnificative despre practicile de date ale aplicațiilor lor și că consumatorii nu sunt afectați de aceste practici potențial înșelătoare.” </p> </blockquote> <p> Comitetul a cerut companiei Apple să ofere mai multe detalii cu privire la procesul său de audit, dacă etichetele de confidențialitate ale aplicațiilor vor fi corectate dacă se constată că sunt neadevărate, detalii despre ce se întâmplă atunci când dezvoltatorii furnizează informații inexacte și multe altele. </p> <p> Ei cer Apple să răspundă cu informațiile solicitate până pe 23 februarie. </p> <p> <small> Credit de imagine: Jason Dent / <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Unsplash CC </a></small> </p>"}