{"title":"HBO Max va fi lansat în America Latină în iunie","content":"<p> HBO Max, serviciul de streaming de la WarnerMedia, se lansează în America Latină și Caraibe în iunie 2021. Este prima dată când serviciul va fi disponibil în afara SUA. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> Unde se lansează HBO Max în America Latină? </h2> <p> În prezent, HBO Max este disponibil doar în SUA. Vino la sfârșitul lunii iunie 2021, va fi disponibil în multe țări din America Latină și Caraibe. Știrea a fost anunțată într-un <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> Comunicat de presă WarnerMedia </a> . </p> <p> Mai exact, aceste țări sunt: ​​Anguilla, Antigua, Argentina, Aruba, Insulele Virgine Britanice, Bahamas, Barbados, Belize, Bolivia, Brazilia, Insulele Cayman, Chile, Columbia, Costa Rica, Curacao, Dominica, Republica Dominicană, Ecuador, El Salvador , Grenada, Guatemala, Guyana, Haiti, Honduras, Jamaica, Mexic, Montserrat, Nicaragua, Panama, Paraguay, Peru, Sf. Kitts și Nevis, Sf. Lucia, Sf. Vincent, Surinam, Trinidad și Tobago, Turks și Caicos, Uruguay , și Venezuela. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> Ce va oferi HBO Max în America Latină? </h2> <p> </p> <p> Abonații HBO GO existenți care plătesc direct sau prin „parteneri eligibili” vor avea acces instantaneu la HBO Max. HBO GO va fi apoi eliminat treptat în toate regiunile. </p> <p> Detaliile privind prețurile nu au fost anunțate, deși sunt promise în următoarele luni, împreună cu informații despre conținut nou și oferte promoționale. </p> <p> La fel ca în SUA, HBO Max va oferi o varietate de pachete de abonament și dispozitive de asistență, cum ar fi smartphone-uri, tablete și alte platforme inteligente. </p> <p> </p> <p> Într-un trailer care anunță știrile, pot fi văzute clipuri din serii precum Game of Thrones și Friends, alături de filme precum The Matrix și Casablanca. Cu toate acestea, la final apare un mic mesaj pentru a avertiza că „nu toate titlurile [vor fi] disponibile la lansare”. </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> Când va fi disponibil HBO Max la nivel global? </h2> <p> Anul trecut, Warner Bros. a anunțat controversat că intenționează să lanseze întreaga sa listă teatrală din 2021 către HBO Max. A provocat-o pe regizor <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Christopher Nolan va marca HBO Max „cel mai prost serviciu de streaming” </a> . </p> <p> Cu toate acestea, în timp ce unii dintre industria cinematografică ar putea să se lamenteze, este o mișcare excelentă pentru alegere pentru consumatori. </p> <p> Ca atare, cei din America Latină și Caraibe sunt probabil încântați de lansarea HBO Max, în speranța că acordul se va aplica și lor. </p> <p> Cât despre restul lumii? Nu au fost stabilite date ferme, dar WarnerMedia a dezvăluit că programele nordice, Spania, Europa Centrală și Portugalia vor fi actualizate la HBO Max la sfârșitul acestui an. </p> <p> Johannes Larcher, șeful HBO Max International, a declarat: </p> <blockquote> <p> Suntem încântați de lansarea HBO Max în America Latină și Caraibe, care este primul pas în aducerea serviciului WarnerMedia Direct-to-Consumer către consumatorii din afara SUA și din întreaga lume. </p> </blockquote>"}