{"title":"Încă o altă marcă neoficială de față PS5 este pe scenă","content":"<p> dbrand, care produce skin-uri, ecrane și huse pentru o varietate de dispozitive, s-a alăturat cu Sony-Baiting și și-a lansat propria față neoficială PS5. </p> <h2 id=\"dbrand-releases-darkplates\"> dbrand lansează Darkplates </h2> <p> Dacă doriți să vă personalizați PS5, atunci dbrand este cea mai recentă companie care oferă plăci frontale neoficiale ale terților pentru consola de nouă generație. Le numesc Plăci Oscure, pentru că sunt plăci negre. </p> <p> Puteți verifica plăcile pe <a href=\"https://dbrand.com/shop/special-edition/ps5\" target=\"_blank\" rel=\"nofollow noopener\"> magazin dbrand </a> , de unde puteți cumpăra fețele negre mate la prețul de 49,00 USD (în momentul scrierii). </p> <p> Puteți, de asemenea, să ridicați ceea ce dbrand numește „piele de mijloc”, care este un autocolant de vinil care trece peste panoul central negru cu un luciu ridicat de pe PS5. Acesta costă 11,95 USD în plus și este disponibil într-o gamă de culori și modele. </p> <p> <img alt=\"dbrand shell texture detail\" src=\"images/dbrand-shell-texture-detail-544.png\" loading=\"lazy\"> </p> <p> De asemenea, veți observa că se laudă cu textura plăcii sale de față. Acest lucru este similar cu <a href=\"https://www.makeuseof.com/sony-how-ps5-controller-textured-playstation-symbols/\" target=\"_blank\" rel=\"nofollow noopener\"> micile simboluri PlayStation pe care le veți găsi pe DualSense </a> , alte accesorii PS5 oficiale și plăcile frontale primare care sunt atașate la consolă atunci când o cumpărați. Asemănătoare, dar sunt la fel de impresionante? </p> <p> </p> <h2 id=\"will-dbrand-last\"> Va dura dbrand? </h2> <p> Nu ne-ați văzut fără îndoială <a href=\"https://www.makeuseof.com/cmp-shells-ps5-faceplate-colors/\" target=\"_blank\" rel=\"nofollow noopener\"> acoperire faceplategate privind CMP Shells </a> , ceea ce a făcut ca întoarcerea auto-triumfătoare să fie interzisă de Sony. Unii ar putea spune că întoarcerea sa a fost arogantă, întrucât și-a declarat noile plăci frontale de neatins legal. Vom vedea. </p> <p> </p> <p> Acest gen te face să te întrebi de ce dbrand a deranjat chiar. Sony categoric <strong> nu a </strong> luați amabilitate la CMP Shells, mai întâi pentru că fostul său nume de marcă era prea asemănător cu PlayStation (PlateStation). </p> <p> Apoi, Sony s-a pronunțat pentru că a decis că plăcile fac parte din proiectarea consolei și, prin urmare, copierea acestora a constituit o încălcare a proprietății intelectuale. Indică lovitura ciocanului de interdicție. CMP Shells a încheiat producția, anulând toate comenzile înainte de a reapărea în noua sa formă. </p> <p> dbrand se află deja pe cel de-al patrulea val de clienți potențiali neîndepliniți înainte de vânzare, deci trebuie să fiți rapid dacă doriți să luați una dintre fețele personalizate. Dacă plăcile vor ajunge efectiv la producție este o altă problemă. Sony ar putea să dea jos din nou ciocanul. </p> <p> </p> <h2 id=\"should-you-buy-a-dbrand-faceplate\"> Ar trebui să cumperi o placă frontală dbrand? </h2> <p> La fel ca în saga CMP Shells, sfătuim pe oricine este interesat să-și personalizeze plăcile PS5 să fie prudenți. Acestea sunt produse de la terți și, prin urmare, nu aveți altă modalitate de a le confirma calitatea, în afară de ceea ce vă spune marca. </p> <p> De asemenea, având în vedere insistența Sony că PlateStation (acum CMP Shells) a trebuit să înceteze producția, nu va fi o surpriză dacă nu-și va forma rapid avocații pentru a intra și în cazul dbrand. </p> <p> Pe scurt, fii atent dacă vrei să-ți personalizezi fețele. CMP Shells a rambursat toți clienții săi prima dată. Dar asta nu înseamnă că o altă marcă o va face. </p> <p> </p> <h2 id=\"do-you-really-need-to-customize-your-ps5\"> Chiar ai nevoie să îți personalizezi PS5? </h2> <p> <img alt=\"ps5\" src=\"images/ps5-183.jpg\" loading=\"lazy\"> </p> <p> Dacă nu sunteți mulțumit de aspectul PS5, îl puteți modifica oricând în alte moduri (semnificativ mai puțin costisitoare). Puteți adăuga oricând o consolă de vinil la consolă dacă doriți să arate diferit. </p> <p> PS5 a fost lansat abia în noiembrie 2020. Poate că încercați să jucați câteva jocuri pe el înainte de a simți nevoia irezistibilă de a schimba aspectul cosmetic al consolei. </p>"}