{"title":"iPhone 13 s-ar putea lăuda cu afișajul „Always On”","content":"<p> Apple a prezentat afișajul „mereu activ” pentru Apple Watch Series 5 în 2019. Câțiva ani mai târziu, ar putea fi setat să ajungă pe iPhone, potrivit reporterului Max Weinbach, care a împărtășit informațiile canalului YouTube <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> TotulApplePro </a> . </p> <p> Raportul susține că iPhone 13 --- dacă așa decide Apple să îl numească --- va avea permanent iluminate unele secțiuni ale ecranului pentru a afișa anumite detalii. </p> <h2 id=\"how-always-on-display-will-work\"> Cum va funcționa afișajul „Always on” </h2> <p> Aceste detalii ar putea include atât pictogramele ceasului, cât și ale bateriei. Acestea ar rămâne vizibile chiar și atunci când iPhone-ul este blocat, ceea ce înseamnă că nu este utilizat în mod activ de către utilizator. Notificările, cum ar fi notificările de mesaje noi, vor fi iluminate doar temporar. </p> <p> Aceasta ar fi prima dată când iPhone-ul vine cu tehnologia de afișare „mereu pornit”. Cu toate acestea, nu ar fi în niciun caz prima dată când o tehnologie similară își face drum spre un smartphone. Nokia a introdus o funcție de ecran „mereu pe ecran” încă din 2009. Mai recent, a devenit o funcție disponibilă pe scară largă pe diverse telefoane Android --- inclusiv modele fabricate de Huawei, Motorola, Samsung, Google și altele. </p> <p> Marele avantaj evident al „întotdeauna activat” este că nu necesită ca utilizatorul să se trezească sau să-l deblocheze pe telefonul său pentru a accesa informațiile, chiar dacă este ceva la fel de minor ca verificarea timpului. </p> <p> Dezavantajul este că consumă o durată suplimentară de viață a bateriei, care poate fi deja ceva premium pe smartphone-uri. Cu toate acestea, afișajele AMOLED pot reduce acest impact al bateriei activând doar acei pixeli de pe afișaj care sunt necesari pentru a afișa informațiile. </p> <p> Cu alte cuvinte, acest afișaj „întotdeauna activ” este întotdeauna pornit într-un sens tehnic --- deși majoritatea ecranului este oprit și doar câteva părți rămân iluminate tot timpul. Aceasta înseamnă că efectul asupra duratei de viață a bateriei nu este atât de important pe cât ar putea fi altfel. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> Ce să ne așteptăm de la iPhone 13 </h2> <p> IPhone-ul de nouă generație va ajunge probabil în septembrie 2021. Potrivit lui Weinbach, acesta se va lăuda cu același design general al șasiului ca și seria iPhone 12, deși vor exista unele actualizări sub capotă. </p> <p> Acestea vor include magneți MagSafe mai puternici, un sistem de camere îmbunătățit pentru realizarea imaginilor lunii și stelelor, obiectivul ultra-larg al camerei pe întreaga gamă de iPhone, videoclip în mod portret (mai degrabă decât doar imagini statice), spate mat rafinat și A- îmbunătățit cip de serie. Un raport anterior susținea că Apple ar putea <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> introduceți Touch ID în afișaj </a> ca alternativă la Face ID. </p> <p> Având în vedere că este încă la mai mult de jumătate de an distanță, ar putea apărea o mulțime de noi detalii înainte ca Apple să prezinte următorul său iPhone în Q3. Cu toate acestea, se pare că fabrica de zvonuri începe deja să intre în acțiune. Priveste acest spatiu! </p>"}