{"title":"Introduceți cea de-a treia dimensiune: Lucrul cu fluxuri de lucru 3D în Adobe After Effects","content":"<p> Dacă doriți să vă îmbunătățiți fluxul de lucru Adobe After Effects, va trebui în cele din urmă să începeți să vă ocupați de axa Z, permițându-vă să manipulați adâncimea 3D a unui obiect. </p> <p> Acest lucru deschide o serie de noi imagini și stiluri pentru care puteți lucra, dar creează și propriile seturi de limitări și considerații. </p> <p> În acest articol, vom prezenta cum să activați și să lucrați cu straturi 3D, precum și cum să adăugați și să animați camere 3D pentru a crea mișcări dinamice. De asemenea, va fi examinat un scenariu în care animăm și mutăm textul într-un spațiu 3D. </p> <p> Să sărim înăuntru! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> Cum se activează și se animă straturile 3D </h2> <p> În cadrul compoziției dvs., puteți comuta straturile în cronologie pentru a le activa ca 3D. </p> <p> Acesta este un proces foarte simplu. Pur și simplu găsiți <strong> cub </strong> pictogramă pentru straturile dvs. din cronologie și faceți clic pe caseta de sub aceasta pentru a activa 3D pentru acel strat. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> După ce ați făcut acest lucru, probabil că nu veți vedea modificări imediate. Cu toate acestea, dacă navigați la poziția, scara și parametrii de rotație din stratul dvs., veți vedea că a apărut un al treilea set de numere ajustabile. </p> <p> Aceste noi numere îți dictează acum rotația, poziția și scala pe axa Z în spațiul 3D. La fel ca și în cazul celorlalți parametri, pot fi cadre cheie pentru a permite animația și manipularea. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> De exemplu, să creăm o compoziție și un strat de text cu câteva cuvinte. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Odată ce ați terminat, activați stratul 3D. Rețineți că, dacă intenționați să utilizați <strong> Alinia </strong> instrument pentru a vă asigura că stratul dvs. este perfect centrat, va trebui să faceți acest lucru înainte de a activa 3D. Acest lucru se datorează faptului că <strong> Alinia </strong> instrumentul funcționează numai pe straturi 2D. </p> <p> Acum că stratul nostru de text este un strat 3D, îl putem muta în spațiul 3D de-a lungul Axei Z. Deci, să facem ca textul să se deplaseze „spre ecran”. </p> <p> Mai întâi, vom seta parametrul Z-Axis. În mod implicit, este setat la zero. Să-l setăm la <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Acum, vom naviga două secunde în jos cronologia noastră și vom stabili valoarea axei noastre Z la <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> Odată cu această modificare, acum ar trebui să vedem textul deplasându-se „spre” ecran. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> Ce sunt camerele 3D? </h2> <p> Am animat cu succes un obiect în spațiul 3D din After Effects. Dar dacă aveți mai multe obiecte și doriți să creați un sentiment al privitorului care se deplasează spre sau departe de ele? </p> <p> Puteți pur și simplu să animați fiecare element individual pentru a vă deplasa către dvs., dar acest lucru ar necesita mult timp și nu ar fi deosebit de eficient. Aici ați folosi o cameră 3D. </p> <p> </p> <p> Dacă utilizați software 3D, cum ar fi Cinema 4D sau Blender, este posibil să fi folosit anterior camere 3D. Dacă ați jucat vreodată un joc pe computer, ați experimentat și o cameră 3D care vă mișcă vederea într-o lume 3D. </p> <p> Acest lucru poate părea complex la început, dar camerele 3D funcționează la fel ca o cameră reală. Acestea vă oferă un câmp vizual care poate fi manipulat și mutat într-un spațiu 3D. </p> <p> Să lucrăm la un exemplu. </p> <h3 id=\"setting-up-a-3d-camera\"> Configurarea unei camere 3D </h3> <p> Pentru a începe, creați mai multe straturi de text 3D și poziționați-le secvențial în jos pe axa Z. </p> <p> În acest exemplu, un decalaj de <strong> 3.000 pixeli </strong> între fiecare strat a fost folosit. Primul strat se află la zero, următorul la 3.000, următorul la 6.000 și așa mai departe. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Acum, este timpul să creați o cameră 3D făcând clic <strong> Strat </strong> &gt; <strong> Nou </strong> &gt; <strong> aparat foto </strong> , pe care veți vedea o fereastră pentru a regla setările pentru noul strat de cameră. Acestea vin în două tipuri: <strong> Un nod </strong> și <strong> Două noduri </strong> . </p> <p> <strong> One-Node </strong> camera este proiectată pentru a opera și emula o cameră din lumea reală cât mai aproape posibil, iar punctul de focalizare este desemnat manual prin mișcarea camerei. </p> <p> A <strong> Două noduri </strong> camera este proiectată pentru a urmări un singur punct de interes, făcându-l ideal pentru orbitarea sau urmărirea unui obiect în mișcare. </p> <p> În acest scenariu, <strong> One-Node </strong> camera va fi folosită. Veți observa o serie de setări suplimentare în fereastră, cum ar fi <strong> Zoom </strong> , <strong> Unghiul de vedere </strong> , <strong> Activați adâncimea de câmp </strong> , și <strong> Distanta focala </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Acestea sunt destinate să reflecte setările camerei reale. Dacă sunteți pricepuți la modul în care funcționează, nu ezitați să vă jucați cu ei. Dacă nu, puteți alege o serie de presetări în colțul din dreapta sus. </p> <p> Vom selecta <strong> 35mm </strong> presetată pentru moment. Acum că stratul nostru de cameră este configurat și în scenă, la început nu veți vedea prea multe diferențe. </p> <h3 id=\"using-3d-camera-navigation\"> Utilizarea Navigației camerei 3D </h3> <p> Există două metode prin care puteți regla și anima vizualizarea camerei. Cel mai precis este prin introducerea diferitelor <strong> Poziţie </strong> valori în <strong> Transforma </strong> setările pentru stratul camerei. Apoi, puteți face keyframe așa cum ați face atunci când animați orice alt strat. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> Pe măsură ce mișcați camera, veți observa că toate celelalte obiecte 3D din scena dvs. se vor mișca în raport cu aceasta. Rețineți că camera va <strong> nu afectează straturile 2D </strong> . </p> <p> Deci, să setăm camera noastră să se deplaseze pe axa Z de la zero la 9.000 pe un interval de patru secunde și să ne încadrăm mișcarea. </p> <p> Iată-l! Dacă ați configurat-o corect, cuvintele ar trebui să împingă „către„ dvs. ”, prin„ câmpul vizual și „în spatele” vizualizatorului. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> Alte modalități de a muta camera 3D </h3> <p> Dacă preferați să fiți puțin mai experimentali și mai puțini în funcție de cifre cu camera dvs., există alte mijloace de a vă deplasa, naviga și regla. <strong> Orbită </strong> , <strong> Tigaie </strong> , și <strong> Dolly </strong> instrumentele din partea de sus a barei de instrumente vă permit să faceți acest lucru. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> Folosind acestea, puteți face clic și trage pentru a vă deplasa dintr-o parte în alta ( <strong> Tigaie) </strong> , rotiți în jurul ( <strong> Orbită </strong> ), și măriți și micșorați ( <strong> Dolly </strong> ). Aceste controale sunt mai puțin precise decât introducerea numerelor, dar sunt minunate pentru planificarea mișcărilor și animațiilor camerelor. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> Practica duce la perfecțiune </h2> <p> Acum ar trebui să puteți crea și anima straturi 3D de-a lungul axei Z și, de asemenea, să lucrați cu camere 3D pentru a naviga cu mai multe obiecte 3D. </p> <p> Dacă vă place să lucrați într-un spațiu 3D, poate doriți să explorați posibilitățile mai avansate pe care le poate oferi o bucată de software 3D mai dedicată, cum ar fi Blender. </p>"}