{"title":"JPG vs. JPEG: Care este diferența dintre aceste formate de fișiere imagine?","content":"<p> Nu toate formatele de fișiere imagine sunt egale. De fapt, multe dintre ele au fost create pentru a rezolva o problemă pe care un format deja existent nu a putut să o rezolve. JPEG, de exemplu, a apărut deoarece dimensiunile fișierelor de imagine consumau mult prea mult spațiu de stocare. </p> <p> Credeți sau nu, extensiile de fișiere JIF, JPEG și JPG se referă mai mult sau mai puțin la același lucru. Pentru a înțelege de ce formatul de fișier are atât de multe nume, trebuie să dezvăluim un pic de istorie complicată. </p> <h2 id=\"what-is-a-jpeg\"> Ce este un JPEG? </h2> <p> Acronimul JPEG înseamnă Joint Photographic Experts Group - tipul de fișier a fost numit după subcomitetul care a contribuit la crearea standardului JPEG Interchange Format (JIF). A fost lansat pentru prima dată în 1992 de Organizația Internațională pentru Standardizare (ISO). </p> <p> JPEG-urile sunt imagini raster de 24 de biți, cu opt biți în fiecare canal al modelului de culoare RGB. Acest lucru nu lasă loc pentru un canal alfa, ceea ce înseamnă că, deși JPEG-urile pot suporta peste 16 milioane de culori, ele nu pot suporta transparența. </p> <p> Când o imagine este salvată ca JPEG, unele dintre datele sale sunt aruncate într-un proces denumit cu pierderi <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> comprimarea fișierului </a> . La rândul său, imaginea ocupă cu 50-75 la sută mai puțin spațiu de stocare (în comparație cu formatele mai vechi, cum ar fi BMP), cu o pierdere puțin sau deloc perceptibilă a calității imaginii. </p> <p> Compresia JPEG se bazează pe o tehnică de compresie cu imagine cu pierderi numită transformată discretă de cosinus (DCT), care a fost propusă pentru prima dată de inginerul electric Nasir Ahmed în 1972. </p> <h3 id=\"what-is-a-jif\"> Ce este un JIF? </h3> <p> Vă puteți gândi că un fișier JIF este ca un JPEG în forma sa „cea mai pură”. Cu toate acestea, formatul nu mai este folosit prea mult, deoarece prezenta câteva limitări frustrante. De exemplu, definițiile culorilor și aspectelor pixelilor unui JIF au cauzat probleme de compatibilitate între codificatoare și decodificatoare (vizualizatori). </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> Din fericire, aceste probleme au fost ulterior abordate de alte standarde „suplimentare” care s-au bazat pe JIF. Primul dintre acestea a fost JPEG File Interchange Format (JFIF), iar mai târziu <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Format de fișier imagine schimbabil </a> (Exif) și profiluri de culoare ICC. </p> <p> JPEG / JFIF este cel mai popular format în prezent pentru stocarea și transmiterea imaginilor fotografice pe internet, în timp ce JPEG / Exif este cel pentru camerele digitale și alte dispozitive de captare a imaginilor. Majoritatea oamenilor nu disting diferența dintre aceste variații și se referă pur și simplu la ambele ca doar JPEG. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> Ce este un JPG2 sau JPF? </h3> <p> În 2000, grupul JPEG a lansat un alt format de fișier imagine numit JPEG 2000 (extensiile sale de fișiere sunt JPG2 și JPF). Trebuia să fie succesorul JPEG, dar nu era nici pe departe atât de popular. Chiar și atunci când metoda sa avansată de codificare a dus adesea la imagini de calitate mai bună. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Credit de imagine: Dake / <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Formatul de fișier JPEG 2000 a fost întrerupt din câteva motive. În primul rând, se baza pe un cod complet nou și, prin urmare, nu era compatibil înapoi cu JPEG. Mai mult decât atât, manipularea fișierelor JPEG 2000 necesita mai multă memorie pentru a fi procesată, ceea ce era un pic de rupere a tranzacțiilor pe atunci. La urma urmei, computerul mediu de la acea vreme avea doar 64 MB de memorie. </p> <p> JPEG 2000 a cunoscut un pic de reapariție acum, când hardware-ul computerului, în general, s-a îmbunătățit considerabil în ultimii 20 de ani, dar formatul de fișier este încă foarte puțin utilizat. Singurul browser de internet care acceptă fișiere JPEG 2000 în momentul scrierii este Safari. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG vs. JPG </h3> <p> Versiunile anterioare ale Windows (în special sistemele de fișiere MS-DOS 8.3 și FAT-16) aveau o limită maximă de 3 litere în ceea ce privește lungimea extensiilor de fișiere. JPEG trebuia scurtat la JPG pentru a nu depăși limita. Computerele Mac și Linux nu au avut niciodată așa ceva, astfel încât utilizatorii ar continua să salveze imagini ca JPEG. </p> <p> </p> <p> Programe populare de editare a imaginilor care au funcționat pe diferite sisteme de operare - cum ar fi Photoshop și <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> Gimp </a> —În cele din urmă ați seta extensia de fișier JPEG implicită la JPG, pentru a minimiza confuzia. </p> <p> Și așa am ajuns la două extensii de fișiere pentru același format: JPEG și JPG. Atunci când alegeți cum să vă salvați imaginea, nu există nicio diferență între ele. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG vs. PNG: Care este mai bine? </h2> <p> </p> <p> JPEG și PNG au fost lansate în același deceniu, fiecare format de fișier rezolvând o problemă diferită a imaginii digitale cu care se confrunta lumea tehnologiei de atunci. Ați putea spune că este firesc să fie comparate în mod constant ... și sunt, chiar și în zilele noastre. Între JPEG și PNG, ce format de fișier imagine este suprem? </p> <p> Sincer, răspunsul depinde de ce fel de imagine salvați. </p> <p> JPEG-urile sunt mai potrivite pentru fotografii, deoarece utilizează compresie cu pierderi pentru a păstra la dimensiuni de fișier rezonabile. Fotografiile sunt imagini atât de mari și detaliate încât artefactele de compresie (distorsiunile subtile ale imaginii cauzate de compresie) nu sunt foarte vizibile pe ele. </p> <p> Pe de altă parte, imaginile cu vârfuri ascuțite, margini clare și cu zone mari de o singură culoare (de exemplu, sigle vectoriale, pixel art etc.) nu arată destul de bine atunci când sunt salvate ca JPEG. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Credit de imagine: Axel Grimard / <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Aici ar putea intra fișierul Portable Network Graphics (PNG). Dezvoltat de PNG Development Group la patru ani de la lansarea JPEG, PNG acceptă compresia și transparența datelor fără pierderi. PNG-urile sunt astfel utilizate adesea dacă calitatea imaginii trebuie păstrată și dimensiunea fișierului nu este o problemă. </p> <p> O regulă bună este păstrarea JPEG la fotografii și salvarea PNG pentru imagini cu transparență și imagini non-fotografice. Pentru mai multe informații despre numeroasele tipuri de fișiere (nu numai imagini), consultați ghidul nostru pentru <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> știind când să folosesc ce format de fișier. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG și JPG sunt același format de fișier </h2> <p> În ciuda confuziei pe care JPEG a provocat-o cu numeroasele sale actualizări și variații, eventuala inundație de imagini digitale pe internet la mijlocul anilor 90 a fost, fără îndoială, cauzată în primul rând de lansarea sa. </p> <p> Data viitoare când sunteți gata să exportați o fotografie dintr-un editor de imagini și vi se prezintă lista lungă de formate disponibile, nu uitați: JPEG și JPG sunt una și aceeași. </p>"}