{"title":"LastPass vă va restricționa la un singur tip de dispozitiv, cu excepția cazului în care plătiți","content":"<p> LastPass, popularul manager de parole, suferă o mare schimbare. În curând, cei care folosesc serviciul gratuit vor putea face acest lucru doar pe computere sau mobile, dar nu pe ambele - cu excepția cazului în care plătesc. </p> <p> Înseamnă că LastPass nu mai este o alegere atractivă ca manager de parole gratuit. Într-o lume în care trecem în mod constant între computere și telefoane mobile, este inutil să ai un manager de parole care funcționează doar pentru un tip de dispozitiv. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> Ce se schimbă în LastPass Free? </h2> <p> După cum a fost anunțat pe <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> Blogul LastPass </a> , modificările sunt în curs pentru versiunea gratuită a managerului de parole. </p> <p> În prezent, LastPass Free vă permite să utilizați serviciul pe toate dispozitivele dvs. Fie că utilizați LastPass pe computer, tabletă sau mobil, nu contează. Toate acestea sunt gratuite. Aceasta se va schimba pe 16 martie 2021. </p> <p> De atunci, LastPass Free va include doar dispozitive nelimitate de un singur tip: computere sau telefoane mobile. </p> <p> Pentru LastPass, computerele sunt clasificate ca orice desktop sau laptop, în timp ce telefoanele mobile sunt telefoane mobile, tablete și ceasuri inteligente. </p> <p> Când vă conectați pentru prima dată la LastPass pe 16 martie, va trebui să setați tipul de dispozitiv activ. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> De exemplu, dacă alegeți computerele ca tip de dispozitiv, veți putea folosi LastPass pe dispozitivele desktop și laptop. Cu toate acestea, dacă doriți să utilizați LastPass pe orice dispozitiv mobil, va trebui să faceți upgrade la LastPass Premium. </p> <p> Într-un fel, acest lucru revine la LastPass din vechime. Abilitatea de a folosi LastPass gratuit pe desktop și mobil a devenit disponibilă numai în 2015. Înainte de aceasta, trebuia să plătiți pentru asistență mobilă. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> Suportul LastPass se schimbă, de asemenea </h2> <p> LastPass schimbă, de asemenea, modul în care oferă suport. Începând cu 17 mai 2021, asistența prin e-mail va fi disponibilă numai pentru clienții Premium și Family. </p> <p> Utilizatorii gratuiți vor rămâne blocați cu articolele de ajutor disponibile pe site-ul de asistență LastPass sau pot solicita ajutor în cadrul comunității LastPass. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> Toată lumea ar trebui să utilizeze un manager de parole </a> . Șansele sunt, trebuie să îl utilizați pe desktop și mobil. LastPass știe acest lucru și se ocupă de utilizatorii care fac upgrade la serviciul plătit, care este în prezent cu 25% reducere pentru 27 USD / an. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> Este timpul să schimbați Managerul de parole? </h2> <p> Dacă utilizați LastPass Free, este probabil că acest lucru v-a determinat să luați în considerare comutarea. Dacă da, există mulți alți administratori de parole grozavi pe care îi puteți folosi pe toate dispozitivele dvs. gratuit. </p> <p> Din nou, poate credeți că este corect să plătiți o sumă mică către LastPass în sprijinul serviciului pe care îl oferă. </p>"}