{"title":"Microsoft lansează Azure Into Space cu HPE &amp; # 039; Spaceborne Computer-2","content":"<p> Microsoft ajunge dincolo de marginea planetei pentru a oferi servicii extraterestre. Compania va colabora cu Hewlett Packard Enterprises pentru a se conecta la un computer de pe Stația Spațială Internațională (ISS) prin intermediul platformei sale Azure. </p> <p> Computerul Spaceborne-2 se va conecta la Azure prin intermediul stațiilor terestre NASA și HPE, oferind o putere mare de procesare a datelor stației spațiale. </p> <h2 id=\"azure-heads-into-space\"> Azure Heads In Space </h2> <p> După cum sa raportat la <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> blogul Microsoft Azure </a> , Computerul Spaceborne-2 (SBC-2) va oferi astronauților ISS tehnologii mai asemănătoare cu omologii lor terestri. </p> <p> Speranța este că reduce drastic cantitatea de timp necesară pentru a transfera date între ISS și Pământ, precum și reduce cantitatea de lățime de bandă necesară pentru procesare și analiză. </p> <blockquote> <p> Astronauții și exploratorii spațiali merită acces la cele mai bune tehnologii de cloud computing și procesare avansată la ultimul nivel. Uneori, analiza trebuie făcută imediat la marginea în care contează fiecare moment care trece, iar alteori analiza este atât de complexă, încât poate fi efectuată numai cu puterea norului hiperscal. </p> </blockquote> <p> Computerul Spaceborne-2 folosește sistemul Edgeline Converged Edge de la Hewlett Packard Enterprises, care este „proiectat în mod intenționat pentru mediile dure de margine” și va aduce o grămadă de funcționalități Azure către ISS. </p> <p> Când conexiunea este funcțională, SBC-2 va permite cercetarea în domenii, inclusiv modelarea vremii pentru viitoarele misiuni de pe Marte, analiza plantelor și hidroponice pentru a sprijini creșterea alimentelor și a culturilor în spațiu și imagistica medicală pe ISS în sine (pentru a sprijini asistența medicală a astronauților ). </p> <p> Dr. Mark Fernandez, arhitect de soluții al sistemelor convergente Edge la HPE și investigator principal pentru Spaceborne Computer-2, a spus: </p> <blockquote> <p> Prin reunirea computerului Spaceborne-2 HPE, care se bazează pe sistemul HPE Edgeline Converged Edge pentru capabilități avansate de calcul de margine și AI, cu Microsoft Azure pentru conectarea la cloud, le permitem exploratorilor de spațiu să transmită fără probleme seturi mari de date către și de la Pământ și beneficiați de o experiență edge-to-cloud </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> Următoarea fază a inițiativei Microsoft Azure Space </h2> <p> Anunțul Microsoft este un alt pas înainte pentru acesta <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Azure Space </a> lansată în octombrie 2020. </p> <p> Inițiativa Azure Space este efortul Microsoft de a face „următorul salt uriaș în cloud computing”, aducând platforma sa de cloud computing Azure în spațiu. </p> <p> </p> <p> Azure Space a lucrat anterior cu proiectul SpaceX Starlink pentru a furniza bandă largă prin satelit către Azure Modular Datacenter (MDC) și își continuă activitatea pe proiectul Azure Orbital, care va extinde conectivitatea între centrele sale de date cloud folosind tehnologia satelitului. </p>"}