{"title":"Mark Zuckerberg, de la Facebook, a luat personal confidențialitatea Apple","content":"<p> CEO-ul Facebook, Mark Zuckerberg, le-ar fi spus angajaților Facebook că „Trebuie să provocăm durere” Apple pentru că a tratat atât de prost gigantul social media, <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> Wall Street Journal </a> rapoarte. </p> <p> Zuckerberg ar fi făcut comentariul în 2018 după ce șefii Apple și Facebook au dat capul peste scandalul Cambridge Analytica, în care datele personale ale milioanelor de utilizatori Facebook au fost accesate fără acordul lor pentru publicitate politică. </p> <h2 id=\"apple-vs-facebook\"> Apple vs. Facebook </h2> <p> La acea vreme, CEO-ul Apple, Tim Cook, a fost chestionat într-un interviu cu privire la modul în care ar răspunde dacă ar fi în situația lui Zuckerberg, în fața crizei. &quot;Nu aș fi în această situație&quot;, a spus Cook. </p> <p> Wall Street Journal susține că, în timp ce Zuckerberg a comentat că cuvintele lui Cook erau „extrem de clare” și „deloc aliniate cu adevărul”, în culise a fost considerabil mai dur în evaluarea sa. </p> <p> De atunci, relația dintre cele două companii de tehnologie nu s-a îmbunătățit. Apple și-a dublat poziția orientată spre confidențialitate, Cook declarând că confidențialitatea este unul dintre <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> cele mai presante preocupări ale lumii </a> . iOS 14 conține mai multe funcții legate de confidențialitate, pe care Facebook le-a pus în discuție, susținând că au potențialul de a afecta întreprinderile mici. </p> <p> În timpul ultimului apel trimestrial de investitori pe Facebook, Zuckerberg a etichetat Apple „ <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> unul dintre cei mai mari concurenți ai [Facebook] </a> „Ca urmare a acestor noi măsuri de protecție a confidențialității.” Apple ar putea spune că fac acest lucru pentru a ajuta oamenii, dar mișcările urmăresc în mod clar interesele lor competitive ”, a spus Zuckerberg. </p> <p> </p> <p> Se pare că Facebook pregătește un caz antitrust împotriva Apple, care ar transforma sfâșierea dintre cei doi titani din Silicon Valley într-o bătălie juridică completă. Raportul Wall Street Journal menționează că „deciziile legale și deciziile legale potențiale vor afecta probabil sute de milioane de telefoane ale consumatorilor în următorii ani”. </p> <p> </p> <h2 id=\"different-approaches\"> Abordări diferite </h2> <p> Purtătorul de cuvânt al Facebook, Dani Lever, a declarat pentru Wall Street Journal că „Apple susține că este vorba de confidențialitate, dar este vorba de profit și ne alăturăm altora pentru a le arăta comportamentul lor de auto-preferință, anticompetitiv” Ea a spus că Facebook „susține în mod deliberat Apple” în numele companiilor și dezvoltatorilor mai mici, care sunt răniți de funcția Apple de confidențialitate a aplicațiilor. </p> <p> În timp ce Lever a negat că bătălia dintre cele două companii este personală, aceasta depășește absolut doar câteva puncte de dispută între două mari companii tehnologice. Modelul de afaceri pe care operează Facebook este extrem de diferit de modelul finanțat de hardware care alimentează Apple. Niciuna dintre cele două companii - sau liderii lor - nu vor renunța la convingerile lor principale despre cum să construiască viitorul tehnologiei. </p> <p> Faptul că CEO-ul Apple Tim Cook discută confidențialitatea în termeni morali arată cât de personal este, la un nivel, acest lucru cu adevărat. </p> <p> <small> Credit de imagine: Wikipedia / <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Anthony Quintano CC </a></small> </p>"}