{"title":"Microsoft lansează noua sa aplicație Office pentru iPad","content":"<p> Microsoft a lansat aplicația Office unificată pentru tableta Apple. Cu acesta, Word, Excel și PowerPoint sunt acum disponibile ca o singură descărcare pe iPhone și iPad în <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> Magazin de aplicații </a> . Microsoft oferă în continuare aceste aplicații iPad ca descărcări independente. </p> <h2 id=\"better-late-than-never\"> Mai bine mai tarziu decat niciodata </h2> <p> „Combinăm aplicațiile Word, Excel și PowerPoint pe care le cunoașteți într-o singură aplicație optimizată pentru iPadOS”, a scris Microsoft în note de lansare care însoțesc descărcarea. Aceasta este o veste minunată dacă utilizați Office și doriți să lucrați în deplasare. Pentru cei care caută <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> transformă iPad-ul în înlocuitor de laptop </a> , aceasta este o versiune crucială. </p> <p> Aplicațiile sunt disponibile gratuit, dar editarea și alte funcționalități avansate necesită un abonament Office 365. Pentru cei care se întreabă, Microsoft oferă diverse opțiuni de abonament în aplicație începând de la 6,99 USD pe lună. </p> <p> Dacă aveți nevoie doar de un procesor de text pe iPad, ar putea fi o idee mai bună să luați în considerare alternative în <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> Rezumatul de către MUO a celor mai bune aplicații de procesare a textelor pentru iPad </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> O experiență de birou mobil unificat </h2> <p> Pentru a fi clar, aceasta este o actualizare a Office-ului existent pentru iOS, nu o versiune nouă. <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> aplicația multifuncțională Office a debutat pe iPhone </a> și Android în februarie 2020. Nu este clar ce a durat Microsoft un an întreg pentru a adăuga versiuni optimizate de iPad de Word, Excel și PowerPoint la mix, dar mai bine mai târziu decât niciodată. </p> <p> </p> <p> Înainte de astăzi, aplicațiile de productivitate incluse în suită ofereau o experiență sub-par pe iPad, deoarece obișnuiau să ruleze într-un mod cu ferestre. Dar, cu cea mai recentă actualizare disponibilă acum, clienții Apple pot avea acum experiența Office nativă pe iPhone, iPad sau iPod touch, indiferent de dimensiunea ecranului. </p> <p> </p> <h2 id=\"ipad-specific-features\"> Caracteristici specifice iPad-ului </h2> <p> Microsoft a adăugat regulat funcții noi, optimizate pentru tablete, la ofertele sale mobile Office. De exemplu, versiunile mobile ale Word, Excel și PowerPoint au primit recent suport pentru gesturile mouse-ului și trackpad-ului. Aplicațiile acceptă, de asemenea, funcția multitasking side-by-side a iOS Split View. </p> <p> În timp ce edițiile mobile și desktop ale Office nu au toate aceleași caracteristici, noul Office pentru iOS scoate la iveală câteva caracteristici noi. Acestea vă permit să faceți lucruri, cum ar fi să semnați documente cu creionul Apple sau cu degetul, să creați rapid PDF-uri din documente, să convertiți imagini în text și tabele și așa mai departe. </p> <p> </p> <p> De asemenea, acum puteți introduce cu ușurință data, forma, imaginea și notele în fișiere PDF. În ceea ce privește utilizatorii avansați, aceștia pot acum accesa acțiunile bazate pe imagini ale Office (cum ar fi Creați PPT, Creați PDF și multe altele) prin intermediul meniului de partajare multifuncțional iOS. „În plus, dacă există capturi de ecran recente când deschideți aplicația Office, acestea sunt afișate ca o sugestie de conversie în PDF sau PPT”, notează compania. </p> <p> Microsoft va face și unele modificări în suita Office pentru Mac și Windows. Potrivit producătorului Windows, actualizările viitoare ale Office pentru desktop în 2021 vor include licențe perpetue, în afară de alte îmbunătățiri. </p>"}