{"title":"Mâncare pentru creier cu dimensiuni mușcate: 5 site-uri pentru a afla lucruri noi în moduri scurte și distractive","content":"<p> Documentare care durează mai puțin de un minut. Episoade de podcast de doar 60 de secunde. Infografii animate pentru a explica subiecte complexe. Aici puteți afla mai multe despre lume în capsule rapide de cunoștințe interesante. </p> <p> Într-o eră a atenției scurte și a actualizărilor de 280 de caractere, chiar și învățarea trebuie să fie în doze mici. De aceea, există creatori de conținut care se specializează în realizarea unor piese informative și distractive care nu durează aproape nimic în viața noastră aglomerată. De la mini-documentare de persoane și subiecte fascinante la ghiduri de pe rețelele de socializare pe subiecte la modă, oferiți-vă minții niște alimente pentru creier de dimensiuni mușcate, pe care să le mestecați. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 60 Documente secundare </a> (Web): profiluri de persoane interesante și subiecte în 60 de secunde </h2> <p> </p> <p> Ai un minut? 60 Second Docs are o poveste grozavă pentru a vă spune despre o persoană interesantă și, la rândul său, un subiect cool. Fiecare documentar are o lungime de doar 60 de secunde, dar acoperă cele mai bune lucruri pe care trebuie să le știți despre subiect. </p> <p> Cea mai tare parte este că 60 Second Docs se concentrează pe profiluri de oameni reali, în loc de concepte sau tendințe. De obicei, acea persoană face ceva unic, fie că începe o nouă tendință, explorează un subiect nou sau depășește limitele într-un fel. Făcând referire la persoană, nu numai că obțineți o mai bună înțelegere a aspectului uman al subiectului unic, dar se simte și mai real și emoțional. </p> <p> Toate cele 60 de documente secundare sunt disponibile pe canalul lor YouTube sau pe dispozitivele de socializare. Este o idee bună să le urmăriți pe orice rețea socială pe care o frecventați, urmărind fiecare videoclip nou în întregime ori de câte ori postează o actualizare. </p> <p> Dacă vă plac documentarele mai lungi, verificați <strong> Selecția oficială </strong> pagina de pe site-ul 60 Second Docs. Aici, editorii aleg documentare de 10-20 minute pe care alții le-au filmat, pe subiecte pe care cred că ar trebui să le urmăriți. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Deci vrei să vorbești despre </a> (Instagram): Mini ghiduri pentru subiecte politice și sociale </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> Cine știa că într-o lume a selfie-urilor de influențare și a hashtagurilor promovate de marcă, Instagram va oferi o platformă de educare? Deci, vrei să vorbești (Sywtta) folosește formatele de postări cu imagini multiple ale Instagram pentru a crea mini-ghiduri despre subiecte politice și sociale. </p> <p> Subiectele pe care le alege Sywtta tratează de obicei subiecte la modă precum anularea împrumuturilor studențești, drepturile și istoricul negru, erori logice, vaccinuri COVID-19 și multe altele. Fiecare diapozitiv folosește o tipografie frumos formatată pentru a vă informa despre subiect și, în plus, fiecare diapozitiv este ca o mini-lecție în sine. Fiecare ghid devine un curs rapid și informativ, fără a fi prea greu cu datele. </p> <p> Într-un moment în care trebuie să fii vigilent <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> știri părtinitoare sau false </a> , este, de asemenea, important să rețineți filosofiile a ceea ce citiți. Când vine vorba de politică, Sywtta propagă punctele de vedere ale politicilor progresiste și de stânga. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> 60-Second Science </a> (Podcast): scurte explicații audio ale științei, sănătății și tehnologiei </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Dacă preferați să vă ascultați informațiile decât să le citiți sau să le urmăriți, consultați podcastul de 60 de secunde. Realizat de echipa de la Scientific American, acest podcast zilnic atinge subiecte din știință, medicină și tehnologie și explică un subiect într-o scurtă explozie. Deși nu se mai limitează la limita de timp de un minut, fiecare episod este încă sub cinci minute. </p> <p> Fiecare podcast are gazde diferite de la echipa Scientific American, care acoperă subiecte precum COVID, animale și păsări, ADN și medicină, știința mediului etc. Se bucură de valori ridicate de producție, încorporând sunete din lumea reală despre punctul de discuție și adăugând adesea clipuri vocale. de la experți. </p> <p> Pentru a răsfoi arhivele episoadelor trecute, accesați site-ul oficial 60-Second Science. Aici puteți filtra episoadele în funcție de subiect (sănătate, minte, durabilitate, tehnologie, științe). Dacă nu doriți informații în rafale scurte, încercați podcast-ul Science Talk complet. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Animagraffs </a> (Web): Infografii animate de înaltă calitate pentru a explica lucrurile </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> Cum funcționează criptomoneda? Care sunt caracteristicile asigurărilor auto? Cum faci un Moonwalk? Designerul și animatorul Jacob O&#39;Neal împarte subiecte complexe în explicații simple și desenează infografii animate de înaltă calitate pentru a le ilustra. </p> <p> Animagraffs este o colecție de explicații scurte prin ghiduri vizuale, folosind GIF-uri animate. Jacob folosește o varietate de tehnici de proiectare, cum ar fi vederi în secțiune transversală pentru a ilustra fiecare parte a unui instrument sau imagini mari cu piese în mișcare unde puteți mări și micșora, cum ar fi Google Maps. Fiecare stil se potrivește subiectului despre care înveți. </p> <p> Subiecții au și o gamă largă, inclusiv modul în care funcționează un ghepard, modul în care funcționează mașinile electrice, modul în care un difuzor scoate sunetul și așa mai departe. De asemenea, ar trebui să verificați secțiunea „Munca clientului”, unde Jacob prezintă sarcinile plătite pentru mărci. Nu vă faceți griji, deși sunt reclame, sunt totuși informative și distractive. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Marea poveste mare </a> (YouTube): Documentare scurte adevărate fascinante și interesante </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story a încheiat operațiunile la sfârșitul anului 2020, dar nu înainte de a lăsa cinci ani de scurte documentare încântătoare. Scufundați-vă în arhive pentru a găsi videoclipuri de aproximativ 5 minute despre o serie de subiecte interesante și oameni fascinanți din întreaga lume. </p> <p> De la un film jucat într-un teatru indian timp de 24 de ani până la uimitoarea înghețată turcească care nu se topește, fiecare scurt videoclip este o privire de înaltă calitate și bine cercetată asupra subiectului. Într-o schimbare față de majoritatea celorlalte astfel de videoclipuri, creatorii videoclipurilor Great Big Story călătoresc adesea în lume pentru a se pune în mijlocul poveștii. Sortează după cele mai populare sau folosește diferitele playlisturi personalizate recomandate de creatori. </p> <p> Pe canal, veți găsi, de asemenea, câteva videoclipuri mai lungi, cu o durată de aproximativ 10 până la 15 minute. Acestea sunt de obicei liste și compilații, care includ câteva clipuri din videoclipurile mai scurte. Dacă aveți timp să aflați mai multe despre lumea din jurul nostru, nu puteți greși cu acestea. Chiar și după ce și-a dat jos obloanele, Great Big Story este una dintre cele mai multe <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> canale fascinante și educative pe YouTube </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Utilizați învățarea prin picurare pentru a cuceri subiecte mari </h2> <p> Aceste site-uri web și podcast-uri se concentrează pe transformarea fiecărui subiect într-un pachet compact și distractiv de informații. Este o modalitate drăguță de a învăța lucruri noi prin mușcături. Dar puteți aplica aceeași filozofie și învățării despre subiecte mai complexe și mai mari. </p> <p> Din ce în ce mai mult, învățarea prin picurare sau microlearning este un mod popular de a obține o educație. Prin primire <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> lecții de mușcătură în fiecare zi </a> , puteți aborda subiecte precum programarea, proiectarea, dezvoltarea aplicațiilor, gestionarea produselor și multe altele. O căutare rapidă pe web ar trebui să vă ajute să găsiți o versiune de învățare prin picurare a a ceea ce doriți să vă educați. </p>"}