{"title":"Microsoft a încercat să cumpere Pinterest, dar afacerea este dezactivată ... Deocamdată","content":"<p> Microsoft a abordat recent Pinterest în legătură cu o potențială afacere de preluare care s-ar fi ridicat la una dintre cele mai mari achiziții realizate vreodată de Redmond. În prezent, discuțiile nu sunt active, dar amploarea fuziunii propuse marchează în continuare planurile de creștere ale Microsoft. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft vrea să cumpere Pinterest </h2> <p> După cum a raportat <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Timpuri financiare </a> , Microsoft a încercat să cumpere Pinterest, cel mai mare panou de amatori din lume. </p> <p> Pinterest este în prezent evaluat la aproximativ 51 de miliarde de dolari, iar valoarea sa de piață a crescut cu peste 600 la sută în întreaga pandemie COVID-19, pe măsură ce oamenii se îndreaptă online în timpul blocărilor. Știrile potențiale privind tranzacția au preluat acțiunile Pinterest cu 7% înainte ca piețele să se deschidă joi, 11 februarie. </p> <p> Măsura ar fi adus Pinterest în stabilul în continuă creștere al Microsoft de achiziții tehnologice majore. În 2016, Microsoft a achiziționat LinkedIn într-o afacere de 26 miliarde USD, urmată de achiziționarea Github pentru 7,5 miliarde USD în 2018. </p> <p> Asta fără a menționa că Microsoft deține Minecraft, a cumpărat 2,5 miliarde de dolari în 2014 și achiziția în curs de desfășurare a holdingului major de jocuri, ZeniMax, pentru 7,5 miliarde de dolari. ZeniMax este compania mamă a unor studiouri de jocuri precum Bethesda Softworks, id Software, Alpha Dog Games și Tango Gameworks. </p> <p> Mai mult, a existat un <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> încercare nereușită de a cumpăra TikTok </a> Activele din America de Nord, Australia și Noua Zeelandă la mijlocul anului 2020. Acordul sa încheiat în cele din urmă, dar a fost evaluat între 20-30 miliarde de dolari și a venit după fostul președinte <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Trump a amenințat că va interzice </a> rețeaua socială de partajare video din SUA în întregime. </p> <p> Dacă tranzacția Pinterest a continuat sau, într-adevăr, dacă va fi finalizată la o dată ulterioară, va deveni cea mai mare achiziție a Microsoft până în prezent. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> De ce Microsoft cumpără atât de multe companii de tehnologie? </h2> <p> Microsoft nu are lipsă de bani și vrea să-și extindă imperiul. Stocul propriu a crescut cu aproximativ 80% de la începutul pandemiei COVID-19 și a dezvăluit recent profiturile sale record. </p> <p> </p> <p> Achiziționarea unei alte platforme, cum ar fi Pinterest, este un bilet la date pentru celelalte servicii ale Microsoft. Volumul mare de date generate de platforme precum LinkedIn este instrumentul perfect pentru instruirea tehnologiilor sale AI. În plus, preluarea și gestionarea unui enorm serviciu online precum Pinterest servește și ca reclamă pentru platforma sa Azure. </p> <p> Așa cum face referire și raportul Financial Times, discuția despre o astfel de fuziune enormă între două companii de tehnologie ar pune și administrația președintelui Biden la încercare. Noua administrație este fericită să permită giganților tehnologici precum Microsoft, Google și Facebook să cumpere concurența? Numai timpul va spune. </p>"}