{"title":"Modul în care serviciile de mesagerie instantanee de top folosesc criptarea end-to-end","content":"<p> Datele personale sunt mai importante ca oricând. Guvernele, companiile și criminalii cibernetici doresc ca datele personale ale oamenilor să le servească interesele. Diferite platforme online au facilitat transmiterea datelor cu caracter personal fără știrea noastră. </p> <p> Din acest motiv, este important să înțelegeți bine modul în care platformele pe care le utilizați online vă protejează confidențialitatea. Unul dintre factorii cheie de care trebuie să țineți cont atunci când luați în considerare măsurile de protecție a aplicațiilor de mesagerie este criptarea end-to-end. </p> <p> Recunoscând necesitatea de a acorda prioritate confidențialității datelor, mai multe aplicații de mesagerie au făcut pași semnificativi pentru implementarea criptării end-to-end. </p> <h2 id=\"what-is-end-to-end-encryption\"> Ce este criptarea end-to-end? </h2> <p> </p> <p> Criptarea end-to-end este <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> o metodă de criptare a comunicațiilor </a> astfel încât părțile terțe să nu poată accesa informațiile partajate între oamenii care își trimit mesaje reciproce. </p> <p> Cu criptarea end-to-end, un cod secret, mai degrabă decât textul simplu, este folosit pentru a ascunde conținutul mesajelor. Aceasta înseamnă că numai cei care comunică pe o platformă criptată end-to-end pot citi mesajele trimise între ei. </p> <p> Să ne uităm la modul în care trei servicii populare de mesagerie securizată, Signal, WhatsApp și Telegram, folosesc criptarea end-to-end. </p> <p> </p> <h2 id=\"signal\"> Semnal </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Semnalul este considerat a fi una dintre cele mai sigure aplicații de mesagerie. Toate comunicațiile de pe platformă sunt criptate end-to-end în mod implicit. </p> <p> Signal nu face backup pentru mesaje pe cloud, ceea ce reduce riscurile actorilor răi folosind metode alternative pentru a obține informații. De asemenea, criptează metadatele mesajelor, astfel încât locația și ora activităților de mesagerie să nu fie urmărite. </p> <p> Cu un motor de criptare open-source, publicul beneficiază de niveluri mai ridicate de transparență a tehnologiei din spatele activităților lor de mesagerie. Utilizatorii pot privi mai atent detaliile tehnice pentru a înțelege mai bine metodele utilizate pentru a-și proteja confidențialitatea. </p> <p> Platformele open source pot face software-ul mult mai ușor și mai sigur de utilizat pe termen lung. Nu numai că oamenii pot înțelege mai bine cum funcționează software-ul, dar pot încerca, de asemenea, să își configureze propria versiune a aplicației, care ar putea fi mai potrivită pentru nevoile lor unice de securitate. </p> <p> Signal folosește o combinație de OTR, denumită mesaje multi-party off-the-record, care face posibilă criptarea de la cap la cap a mesajelor în chat-urile de grup. Riscurile de încălcare a datelor pot crește odată cu creșterea numărului de participanți la o rețea. Cu chat-ul de grup criptat de la un capăt la altul, astfel de riscuri sunt reduse semnificativ. </p> <p> </p> <h2 id=\"whatsapp\"> WhatsApp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp a fost una dintre primele aplicații populare de mesagerie care permit criptarea end-to-end. Folosește criptarea end-to-end pentru mesaje și apeluri. </p> <p> WhatsApp folosește protocolul de criptare end-to-end dezvoltat de Open Whisper Systems, echipa din spatele Signal Messenger. Acesta este un plus major pentru aplicație, având în vedere cât de sigur este protocolul de criptare al Signal. </p> <p> </p> <p> Utilizarea de către WhatsApp a propriei implementări proprietare înseamnă că este posibil să nu fie examinată la fel de frecvent de o gamă largă de cercetători în domeniul securității, precum software-ul complet open-source al Signal. </p> <p> În ciuda criptării mesajelor, ar putea fi folosite alte modalități pentru a afla mai multe despre mesajele trimise pe WhatsApp, deoarece mesajele pot fi salvate în cloud și metadatele din aplicație nu sunt criptate. Acest lucru face mai ușor să cunoașteți timpul și locația mesajelor. În plus, au apărut rapoarte despre chat-urile de grup WhatsApp indexate în căutarea Google, punând în discuție securitatea chat-urilor sale de grup. </p> <p> </p> <h2 id=\"telegram\"> Telegramă </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegram este iubit pentru utilizarea criptării și a mesajelor sale de autodistrugere. Din păcate, există mai multe probleme de criptare end-to-end cu Telegram, care poate să nu pară atât de evidente pentru mulți utilizatori. </p> <p> Pe Telegram, criptarea end-to-end nu este activată în mod implicit. Este oferit numai atunci când utilizatorii trec la chat-uri secrete. Pentru utilizatorii care nu sunt înclinați din punct de vedere tehnic, acest lucru prezintă riscuri de securitate de care nici măcar nu sunt conștienți. </p> <p> Telegram poate accesa mesajele stocate pe serverele sale, care sunt copiate în cloud. Unii cred că acest lucru prezintă vectori suplimentari de atac care ar putea duce la încălcarea datelor cu caracter personal în cazurile în care infractorii cibernetici încearcă să fure date de mesagerie din aplicație. </p> <p> Acestea fiind spuse, toate chat-urile secrete din Telegram sunt specifice dispozitivului, ceea ce înseamnă că mesajele pe care le trimiteți prin chat-uri secrete pot fi accesate numai de pe dispozitivul de la care a fost trimis. </p> <p> În timp ce chaturile secrete ale Telegramului sunt criptate de la un capăt la altul, chaturile de grup nu. Aceasta înseamnă că utilizatorii pot utiliza mai multe dispozitive pentru același chat de grup. Jurnalele de chat pot fi descărcate de pe utilizatori pe mai multe dispozitive. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Conversații secrete pe <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #Telegramă </a> înseamnă că mesajele dvs. sunt protejate prin criptare end-to-end și sunt șterse după o perioadă de timp stabilită. <br><br> Iată cum puteți activa această funcție. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> - Kaspersky (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 31 ianuarie 2021 </a></blockquote>  <p> Telegram creează previzualizări de linkuri pe serverele sale la distanță, atât din chat-urile normale, cât și din cele secrete. Când un utilizator tastează un link pentru prima dată într-un chat secret, aplicația îi avertizează că linkurile vor fi trimise către servere la distanță. Aceasta este considerată o slăbiciune de securitate, deoarece trimiterea de linkuri partajate într-un chat privat către un server de la distanță este contrară scopului criptării end-to-end. </p> <p> Protocolul de criptare Telegram, MTProto este conceput pentru accesul la un server API din aplicații de pe mobil. Este proprietar și este parțial open source. Acest lucru pune la îndoială cât de mult control și înțelegere are publicul asupra metodelor de criptare utilizate pentru a-și proteja mesajele. </p> <p> Din fericire, aplicația de mesagerie nu s-a confruntat cu afirmații serioase cu privire la încălcarea datelor, dar este îngrijorător să știm că este posibil ca operatorii săi să vă acceseze mesajele. </p> <p> În ciuda îngrijorărilor, mulți pot fi liniștiți de diferitele cercuri legale care ar trebui să fie trecute pentru a accesa mesajele. Telegram a arătat clar în trecut cât de dificil este pentru oameni să acceseze mesajele de pe platforma sa. Cheile ar trebui accesate din diferite jurisdicții, ceea ce ar frustra mulți oameni. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> Alegerea celei mai sigure aplicații de mesagerie </h2> <p> Deși Signal poate să nu fie la fel de popular ca WhatsApp, protocolul său a servit ca un factor semnificativ care contribuie la succesul WhatsApp cu criptarea end-to-end. În timp ce metodele sale de criptare end-to-end sunt similare cu WhatsApp, este considerat a fi mai bun decât WhatsApp pentru criptarea end-to-end. Se distinge prin luarea de măsuri suplimentare pentru protejarea utilizatorilor. </p> <p> Decizia Telegram de a nu acorda prioritate criptării end-to-end a fost atribuită preferinței sale pentru comoditate. Acolo unde lipsește criptarea, compensează, cu metodele sale indirecte de protejare a utilizatorilor cu criptare în cloud și stocare a cheilor în diferite jurisdicții legale. </p>"}