{"title":"Noul studiu spune că utilizatorii Android fac parteneri mai buni decât utilizatorii iPhone","content":"<p> Există o luptă nesfârșită între utilizatorii de smartphone-uri iPhone și Android. Chiar și cei care nu participă la luptă au ales părțile doar alegându-și smartphone-ul. </p> <p> Există un nou rid în luptă, așa cum <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> CompareMyMobile </a> a făcut un studiu recent cu privire la faptul dacă utilizatorii de iPhone sau Android fac parteneri mai buni. După cum se dovedește, utilizatorii iPhone tind să aibă obiceiuri telefonice mai enervante decât utilizatorii Android, ceea ce duce la concluzia că utilizatorii Android își fac parteneri mai buni. </p> <p> Desigur, există mai multe date decât acea simplă concluzie, așa că hai să ne scufundăm puțin mai adânc și să aruncăm o privire. </p> <h2 id=\"iphone-and-android-relationship-study\"> Studiu de relații iPhone și Android </h2> <p> Concluzia generală a studiului este că utilizatorii Android fac parteneri mai buni decât utilizatorii iPhone, dar rezultatele merg mult mai adânc decât acea concluzie superficială. În total, studiul a studiat mai mult de 2.000 de utilizatori, deci oferă o dimensiune a eșantionului destul de mare. </p> <p> Analizând cele mai enervante obiceiuri ale smartphone-urilor, studiul a constatat că utilizatorii iPhone au fost cu 12% mai predispuși să comită o infracțiune decât omologii lor care dețin Android. De fapt, utilizatorii de iPhone au comis mai multe atrocități de utilizare a telefonului decât utilizatorii de Android din fiecare categorie a sondajului. </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> Câteva exemple de infracțiuni enervante includ lăsarea partenerului pe citit, utilizarea telefonului în timpul unui film și chiar utilizarea telefonului în timpul conducerii (ceea ce nu este doar enervant, ci și incredibil de periculos). Utilizatorii de iPhone sunt chiar mai predispuși să-și lase și să-și rupă telefoanele decât utilizatorii de Android, ceea ce este o statistică cu adevărat surprinzătoare. </p> <p> Unele alte obiceiuri enervante includ <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> strecurându-se pe profilurile social media ale altor persoane </a> , folosind filtre excesive pe fotografii, trimitând mai multe mesaje pe o singură linie (știu că fac acest lucru prea mult) și folosind telefonul lor în timp ce purtăm o conversație. </p> <p> În mod interesant, studiul a constatat, de asemenea, că bărbații au mai multe șanse să îndeplinească cele mai multe obiceiuri enervante (și, în unele cazuri, de-a dreptul nesigure) decât femeile. </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> Dar utilizatorii Apple primesc mai multe date </h2> <p> Potrivit unui alt studiu publicat de CompareMyMobile, utilizatorii de iPhone sunt mai predispuși să obțină date în aplicațiile de întâlniri online. Studiul, care a analizat peste 50.000 de goluri, a constatat că utilizatorii de iPhone sunt cu 76% mai predispuși să obțină o întâlnire decât cineva cu un telefon Android atunci când vorbesc printr-o aplicație de întâlniri. </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> Dacă se crede primul studiu, relația s-ar putea să nu funcționeze din cauza faptului că utilizatorul iPhone se târăște pe alte profiluri de social media și trimite mesaje text în timp ce conduce. Totuși, este mai probabil să-și găsească următorul partener atunci când relația anterioară nu funcționează. </p> <p> În cele din urmă, întâlnirile nu sunt niciodată ușoare. Deci, faceți tot posibilul pentru a împiedica telefonul să devină dispozitivul care ucide un lucru bun! </p>"}