{"title":"O uriașă actualizare Microsoft Edge este îndreptată spre dvs.","content":"<p> Microsoft lucrează foarte mult pentru ca browserul său de internet, Edge, să fie cel mai bun lucru pe care îl poate avea. Acum, compania îi aduce trei caracteristici semnificative, iar lucrurile par roz pentru viitorul Edge. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Ce a planificat Microsoft pentru Edge </h2> <p> Actualizarea mare a barei de protecție a fost surprinsă de <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows Latest </a> . Cele trei caracteristici sunt programate să vină într-o mare actualizare, așa că merită să vă uitați la Edge în viitorul apropiat. </p> <p> În primul rând, Microsoft Edge primește asistență pentru widgeturi web. Aceste widget-uri sunt o modalitate la îndemână de a obține o scurtă privire asupra informațiilor vitale pe tot parcursul zilei. Gigantul software vrea să experimenteze widget-uri de toate formele și dimensiunile, dar a decis să înceapă cu un widget de știri pentru a da startul lucrurilor. </p> <p> În continuare, Microsoft Edge primește o funcție de căutare a filelor. Dacă acest lucru vi se pare familiar, este probabil pentru că ați citit <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> speculații inițiale privind obținerea de către Edge a unui instrument de căutare a filelor </a> . Din fericire, această speculație a devenit o realitate, iar Microsoft intenționează să aducă funcția Chrome în Edge. </p> <p> În cele din urmă, veți putea gestiona toate extensiile Edge dintr-un singur meniu. Va apărea ca o piesă de puzzle pe bara de activități a browserului dvs. și, când faceți clic pe ea, vă va arăta fiecare extensie pe care ați instalat-o împreună cu o modalitate rapidă de a activa și dezactiva fiecare. </p> <p> Nu este sigur când va fi lansată exact această actualizare, dar Windows Latest o are fixată pentru „următoarea actualizare mare”. Ca atare, nu va trece prea mult până când Microsoft Edge va deveni o alegere atrăgătoare pentru persoanele care caută ceva nou. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: Următorul lucru mare? </h2> <p> Pentru o perioadă foarte lungă de timp, browserele Microsoft au fost considerate ca manageri avansați de descărcare pentru instalarea Chrome sau Firefox. De când Microsoft a adoptat o bază de cod Chromium pentru browserul său, totuși, a trecut în trecut, fiind râsul lumii browserului. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCounter </a> listează Microsoft Edge ca al doilea cel mai utilizat browser Windows din SUA la momentul scrierii. Știam deja că Firefox a fost lăsat în praf de Edge, dar de atunci, decalajul a devenit tot mai mare. </p> <p> Acum, Edge reprezintă 5,25% din cota de piață din SUA, comparativ cu 3,35% pe care îl deține Firefox. Ambele sunt departe de cele 45,83% din Chrome, dar este un început. </p> <p> Ca atare, dacă v-ați ridicat anterior nasul în browserul Microsoft, acum este momentul potrivit pentru a-i oferi oa doua șansă. Cine știe, s-ar putea să fii cucerit de cel mai bun browser Microsoft vreodată! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Împingând browserul la margine </h2> <p> Dacă nu ați fost un fan al browserelor Microsoft în trecut, este un moment bun să vă întoarceți și să vedeți despre ce e vorba. O mare actualizare este în lucru și va deveni mai bună doar de aici. </p> <p> Microsoft știe că se bazează pe o formulă câștigătoare. De fapt, compania a raportat recent că 600 de milioane de oameni din întreaga lume au folosit acum Edge pentru a naviga pe web. </p> <p> <small> Credit de imagine: DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}