{"title":"Parler revine online după o oprire de o lună","content":"<p> După ce a fost închis de Big Tech, Parler a reapărut în sfârșit pe web. Platforma „exprimare liberă” este acum accesibilă utilizatorilor existenți și în curând va începe să accepte înregistrări de utilizatori noi în următoarele săptămâni. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler reapare după Big Tech Blackout </h2> <p> Parler a revenit după o lungă întrerupere. Rețeaua socială alternativă a câștigat aderență în rândul conservatorilor politici și a fost <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> pornit de Amazon Web Services (AWS), Google și Apple </a> în urma revoltelor din Capitol. Parler a fost acuzat că nu a făcut suficient pentru a modera conținutul violent, rezultând în eliminarea acestuia din magazinele de aplicații și de pe web. </p> <p> În locul AWS, Parler folosește acum o gazdă numită SkySilk. Site-ul și-a înregistrat, de asemenea, numele de domeniu la Epik, un registrator care se adresează altor tipuri de rețele de „liberă exprimare”, cum ar fi Gab. </p> <p> O nouă gazdă și un registrator de domeniu nu sunt singurele modificări pe care le-a făcut Parler - Parler a reapărut chiar cu un nou CEO interimar. Aceasta vine după <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> echipa Parler ar fi concediat cofondatorul John Matze </a> . </p> <p> Mark Meckler îl va înlocui temporar pe Matze în funcția de CEO și anterior a co-fondat grupul de dreapta Tea Party Patriots. Într-o declarație obținută de <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> Dealul </a> , Meckler a anunțat revenirea mult așteptată a lui Parler, spunând: </p> <blockquote> <p> Când Parler a fost dezactivat în ianuarie de cei care doresc să reducă la tăcere zeci de milioane de americani, echipa noastră s-a reunit, hotărâți să ne respecte promisiunea față de comunitatea noastră foarte angajată că ne vom întoarce mai puternici ca niciodată. Suntem încântați să le întâmpinăm pe toți înapoi. </p> </blockquote> <p> Meckler a continuat, menționând că Parler va rămâne dedicat „exprimării libere, intimității și dialogului civil”. De asemenea, el i-a asigurat pe utilizatori că „Parler este condus de o echipă experimentată și este aici să rămână”. </p> <p> Deși conturile mai vechi de pe platformă sunt de rezervă, postările mai vechi (sau „parleys”) nu au fost restaurate. Dacă aveți deja un cont pe Parler, puteți continua să utilizați site-ul. În caz contrar, va trebui să așteptați aproximativ o săptămână până vă puteți înscrie. </p> <p> Dar chiar dacă aveți deja un cont Parler, este posibil să întâmpinați unele dificultăți tehnice în timpul utilizării platformei. Se pare că serviciul nu a fost încă complet restaurat. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> Aplicația Parler rămâne în Limbo </h2> <p> Parler este încă interzis din Google Play Store și Apple App Store, ceea ce i-ar putea afecta grav baza de utilizatori. În starea actuală, platforma ar putea rămâne indisponibilă pe dispozitivele mobile pentru o perioadă necunoscută de timp. </p> <p> Probabil că nu va putea reveni la Play Store sau App Store decât dacă își modifică politicile de moderare, ceea ce Parler va refuza să facă. </p>"}