{"title":"Pro și contra Android","content":"<p> Android este cel mai popular sistem de operare mobil din întreaga lume. S-a schimbat dincolo de recunoaștere de la lansarea sa în 2008 și acum alimentează unele dintre cele mai bune telefoane realizate vreodată. </p> <p> Dar ce îl face atât de popular și ce probleme mai trebuie rezolvate? Ne uităm la avantajele și dezavantajele Android. </p> <h2 id=\"top-5-advantages-of-an-android-smartphone\"> Top 5 avantaje ale unui smartphone Android </h2> <p> Avantajele utilizării unui smartphone Android sunt în mare parte subiective nevoilor individuale, dar cele generale sunt următoarele. </p> <h3 id=\"you-can-sideload-apps-from-outside-the-play-store\"> 1. Puteți descărca aplicații din afara magazinului Play </h3> <p> Dacă nu găsiți aplicația pe care o căutați în Magazinul Google Play, o puteți ocoli cu doar câteva atingeri în setările telefonului, în funcție de dispozitiv. </p> <p> Deținerea unui smartphone Android vă oferă libertatea de a instala aplicații non-Play Store. Nu vă limitați la instalarea celor mai bune aplicații Android în Magazin Play, ci mai degrabă de la terți. </p> <p> <img alt=\"APKPure app store\" src=\"images/apkpure-578.png\" loading=\"lazy\"> </p> <p> Magazine precum <a href=\"https://apkpure.com/\" target=\"_blank\" rel=\"nofollow noopener\"> APKPure.com </a> și <a href=\"https://www.apkmirror.com/\" target=\"_blank\" rel=\"nofollow noopener\"> APKMirror.com </a> sunt bune și, în general, magazine de aplicații alternative sigure pe care le puteți utiliza pe aproape orice dispozitiv Android. </p> <p> Sistemul iOS vă împiedică să instalați surse necunoscute, deci sunteți întotdeauna limitat la ceea ce face Apple și nu vrea să utilizați. </p> <h3 id=\"lots-of-hardware-innovations\"> 2. O mulțime de inovații hardware </h3> <p> Dispozitivele cu sisteme Android au numeroase configurații hardware pentru a le oferi consumatorilor. Aveți la dispoziție procesoare, dimensiuni ale bateriei, cantități de memorie RAM sau stocare și suport pentru stocare detașabilă, cum ar fi utilizarea cardurilor de memorie. </p> <p> Există opțiuni care acoperă o gamă largă de dimensiuni, forme și seturi de caracteristici. Majoritatea inovațiilor hardware provin și de la Android, inclusiv telefoane bendy, scanere de amprentă pe ecran și camere de tip selfie pop-up. </p> <p> </p> <h3 id=\"expandable-memory\"> 3. Memorie extensibilă </h3> <p> Completarea spațiului de stocare nu este o problemă pentru multe telefoane Android, cu suportul său pentru memorie extensibilă. Prin intermediul spațiului de stocare detașabil, cum ar fi cardurile de memorie, utilizatorii Android pot pune în mod convenabil spațiu de stocare suplimentar pentru a-și susține nevoile. Poti <a href=\"https://www.makeuseof.com/tag/move-android-apps-sd-card/\" target=\"_blank\" rel=\"nofollow noopener\"> salvați aplicațiile preferate pe un card de memorie </a> , precum și fotografii și videoclipuri. </p> <p> Totuși, nu toate telefoanele acceptă memorie suplimentară, cum ar fi <a href=\"https://www.makeuseof.com/samsung-galaxy-s21-worth-upgrading/\" target=\"_blank\" rel=\"nofollow noopener\"> Samsung Galaxy S21 </a> . Dacă modelul ales nu, asigurați-vă că are suficient spațiu de stocare pentru nevoile dvs. atunci când îl cumpărați. </p> <h3 id=\"widgets\"> 4. Widgeturi </h3> <p> <strong class=\"gallery__section-title\"> Galerie de imagini (2 imagini) </strong> <img alt=\"best weather widget Android 1\" src=\"images/overdrop-weather-288.png\" loading=\"lazy\"> Extinde <img alt=\"best weather widget Android 2\" src=\"images/overdrop-widgets-125.png\" loading=\"lazy\"> Extinde </p> <p> Închide </p> <p> Widgeturile sunt pentru acele aplicații sau informații pe care doriți să le cunoașteți imediat, cum ar fi un calendar și mementourile acestuia, prognozele meteo, titlurile de știri relevante și multe altele. Unele sunt pentru a obține informații rapid; altele oferă controale convenabile, cum ar fi pentru aplicațiile dvs. media. </p> <p> Deși smartphone-urile iOS au widget-uri, Android-urile sunt mult mai complexe și mai capabile. Acestea vă permit să accesați informații importante cu cea mai mică cantitate de derulare și atingere. </p> <h3 id=\"diverse-phone-options\"> 5. Opțiuni diverse pentru telefon </h3> <p> După cum știți, Android este un sistem de operare care se adresează unei game largi de mărci de smartphone-uri din întreaga lume. Aceasta înseamnă că există o mare varietate de dispozitive din care să alegeți. </p> <p> Fiecare marcă oferă hardware și caracteristici distincte pentru a reflecta marca și piețele țintă. Smartphone-urile cu Android variază în funcție de dimensiune, spațiul de stocare al telefonului, pixelii camerei, durata de viață a bateriei, stilul și multe altele. Indiferent de bugetul dvs. sau de cât de mare aveți nevoie de un ecran, veți găsi un dispozitiv Android care se potrivește. </p> <p> </p> <h2 id=\"top-5-disadvantages-of-an-android-smartphone\"> Top 5 dezavantaje ale unui smartphone Android </h2> <p> Cunoașterea dezavantajelor utilizării smartphone-urilor Android vă poate duce pe o altă parte a drumului. Următoarele sunt cele mai neplăcute caracteristici ale unui sistem Android. </p> <h3 id=\"hardware-quality-is-mixed\"> 1. Calitatea hardware-ului este mixtă </h3> <p> S-ar putea să vă gândiți „cu atât mai bine”, când vine vorba de alegeri; cu toate acestea, s-ar putea să vă coste mult să găsiți un smartphone Android compact și solid unde toate caracteristicile și hardware-ul dorit sunt deja acolo. </p> <p> Cu parteneriatele vaste ale Android cu diferite mărci de smartphone-uri, este greu să menții controlul calității. Există o mulțime de mărci pe care nu le-ați auzit niciodată, adesea cu motive întemeiate. </p> <p> <img alt=\"cheap android phones\" src=\"images/cheap-phones-861.png\" loading=\"lazy\"> </p> <p> Unele smartphone-uri Android ar putea arăta ca o afacere, dar s-ar putea să nu fie atât de grozav. Multe telefoane mai ieftine nu durează mult mai mult de un an, fie din cauza limitărilor hardware-ului, fie din cauza faptului că software-ul nu mai este actualizat. </p> <h3 id=\"you-need-a-google-account\"> 2. Aveți nevoie de un cont Google </h3> <p> Dacă nu aveți un cont Google, de ce să folosiți un smartphone Android? Nu puteți profita la maximum de telefon fără un cont Google. Necesită utilizarea contului dvs., mai ales în instalarea de aplicații, descărcarea de conținut sau alte activități pe care le desfășurați - trebuie să fie backup pentru contul dvs. Google. </p> <p> Sistemul de telefonie iOS folosește ID-ul Apple pentru a autentifica activitățile pe smartphone. Deoarece sistemul de operare Android este realizat de Google, serviciile sale sunt destul de mult legate de acesta. Și adevărat, majoritatea oamenilor sunt în regulă cu asta. Dar unii oameni ar prefera <a href=\"https://www.makeuseof.com/tag/using-android-without-google/\" target=\"_blank\" rel=\"nofollow noopener\"> folosiți un telefon fără Google </a> . </p> <h3 id=\"updates-are-patchy\"> 3. Actualizările sunt neuniforme </h3> <p> <img alt=\"\" src=\"images/android-apkupdater-updates-featured-744.jpg\" loading=\"lazy\"> </p> <p> În timp ce Apple își acceptă iPhone-urile de ani de zile, majoritatea dispozitivelor Android vor primi cel puțin una sau două noi actualizări ale sistemului de operare. Multe modele mai ieftine nu vor primi deloc. </p> <p> În timp ce actualizările sistemului de operare sunt plăcute, o problemă mai mare este atunci când telefoanele încetează să primească sau nu primesc niciodată actualizări de securitate. Android primește oficial patch-uri de securitate lunare pentru a remedia eventualele vulnerabilități din sistem. Unii producători de telefoane le lansează în fiecare lună sau două, dar odată ce telefonul nu mai primește actualizări, acesta poate deveni rapid un risc de securitate. </p> <h3 id=\"many-ads-in-apps\"> 4. Multe reclame în aplicații </h3> <p> Un alt lucru care îi enervează pe utilizatori este <a href=\"https://www.makeuseof.com/tag/block-popup-ads-android/\" target=\"_blank\" rel=\"nofollow noopener\"> reclame pop-up pe Android </a> , mai ales pe cele cu costuri reduse. Ori de câte ori deschizi Magazinul Play, există reclame peste tot. Câteva telefoane mai ieftine ar putea afișa chiar și anunțuri în notificări. </p> <p> Este un compromis. Aplicațiile iOS au adesea mai puține reclame, dar și mai multă cultură în care se acceptă plata pentru aplicații. Pe Android, tendința este mult mai mare către obținerea de aplicații gratuite. </p> <h3 id=\"they-have-bloatware\"> 5. Au Bloatware </h3> <p> Majoritatea producătorilor de dispozitive Android își instalează propriul set de aplicații pe telefoanele lor. Uneori, aceste funcții duplicate care există deja. De exemplu, unele mărci Android, cum ar fi Samsung, au propria lor aplicație de poștă electronică, unde au și aplicația Gmail la cumpărare sau un browser diferit, atunci când Chrome este standard. </p> <p> <img alt=\"chrome on android\" src=\"images/android-chrome-502.jpg\" loading=\"lazy\"> </p> <p> Nu puteți dezinstala aceste aplicații în majoritatea cazurilor, deși puteți <a href=\"https://www.makeuseof.com/tag/remove-unwanted-apps-android-device/\" target=\"_blank\" rel=\"nofollow noopener\"> dezactivați aplicațiile încorporate </a> de care nu ai nevoie. Nu va recupera niciun spațiu de stocare, dar vă va ajuta să eliminați orice dezordine din sertarul aplicațiilor. </p> <p> </p> <h2 id=\"android-s-pros-and-cons\"> Pro și contra Android </h2> <p> Android este cel mai popular sistem de operare mobil dintr-un motiv bun. Este ușor de utilizat, are milioane de aplicații și este plin de inovații. Și cu prețuri cuprinse între 100 $ și 1000 $ sau mai mult, este accesibil oricui are orice buget. </p> <p> Desigur, nu este perfect și are defecte pe care ne-ar plăcea să le vedem în viitor. Dar flexibilitatea platformei înseamnă că, chiar dacă aveți probleme între timp, sunt ușor de rezolvat. </p>"}