{"title":"Roku își dorește gândurile asupra telecomenzii sale reîncărcabile","content":"<p> Roku recrutează unii oameni pentru a se alătura programului său de acces timpuriu, pentru a testa o nouă telecomandă (numită Roku Voice Remote Pro) care are o baterie reîncărcabilă. </p> <p> Este o ofertă de timp limitat până la epuizarea consumului, deși trebuie totuși să plătiți pentru telecomandă. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> Ce este Roku Voice Remote Pro? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> În cele din urmă o telecomandă cu o baterie reîncărcabilă </a> din <a href=\"https://www.reddit.com/r/Roku/\"> Roku </a> </blockquote>  <p> Așa cum a fost observat pentru prima dată de utilizatorul Kingtut206 pe <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , Roku recrutează oameni în programul său de acces timpuriu pentru a testa o nouă telecomandă numită Roku Voice Remote Pro. </p> <p> Noua telecomandă are o baterie reîncărcabilă, un dispozitiv de căutare pierdut (de exemplu, puteți spune „Hei Roku, găsește telecomanda mea”), voce fără mâini și butoane de comandă rapidă personale alături de butoanele standard marca. </p> <p> După cum a raportat <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> The Verge </a> , telecomanda se încarcă prin micro-USB, mai degrabă decât USB-C mult superioară. Poate că feedback-ul adunat prin Programul de acces timpuriu va recunoaște acest lucru. </p> <p> Participarea la program este doar pe bază de invitație, deși nu se știe ce te face calificat. </p> <p> Telecomanda costă 29,99 USD și se așteaptă să fie livrată pe 19 februarie 2021. </p> <p> Doar 2.000 de unități vor fi vândute, iar Roku va colecta feedback despre experiența dvs. cu telecomanda. După acest timp, putem presupune că telecomanda va fi rafinată înainte de a fi pusă în vânzare generală. </p>"}