{"title":"RPG-uri pentru computer vs. RPG-uri clasice: ce înseamnă CRPG în 2021?","content":"<p> Istoria jocurilor RPG pe computer este atâta timp cât istoria jocurilor video în sine, care evoluează și se dezvoltă împreună de-a lungul anilor. Și la fel cum au evoluat CRPG-urile, îmbunătățind grafica, adăugând sau renunțând la mecanica de joc, tot așa au făcut și sensul și terminologia utilizate pentru a le descrie. </p> <p> Acronimul CRPG, care a reprezentat în mod tradițional Computer Role Playing Game, și-a extins semnificația în timp pentru a include RPG-uri pentru diferite platforme. Acum, a adoptat un nou sens. Deși noua sa semnificație nu este complet diferită de cea originală, ea descrie acum un sub-gen RPG specific. </p> <h2 id=\"the-history-of-crpgs\"> Istoria CRPG-urilor </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> Istoria CRPG-urilor a început în anii 1970, odată cu lansarea celei mai vechi adaptări pentru jocuri video a RPG-ului Dungeons &amp; Dragons, Dungeon. Jocul a fost inițial disponibil pe Atari (îl puteți juca prin <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, un serviciu de streaming de jocuri pe Plex </a> ). </p> <p> Deși jocul Dungeon a fost în principal bazat pe text, acesta a descris pe deplin mișcările petrecerii dvs. cu mai multe personaje într-un cadru fantezist, în timp ce a implementat majoritatea principiilor de bază ale Dungeons &amp; Dragons. </p> <p> Pe atunci, le etichetam RPG-uri pentru computer pentru a le deosebi de omologii de pe masă, care erau mult mai populare la vremea respectivă, și le știam pur și simplu ca RPG-uri. </p> <p> Până în anii 1990, CRPG-urile erau în plină înflorire, acum puteau afișa o lume fantastică în întregime, cel puțin într-o perspectivă de sus în jos sau vizualizare izometrică. Așa a fost cazul Ultima VII, unul dintre cele mai interactive CRPG-uri pe care le-a jucat acest scriitor. </p> <p> Aproape tot ce puteți vedea vă puteți mișca sau interacționa: puteți să creați arme, să jucați instrumente și chiar să vă duceți membruul de partid mort dintr-o temniță până la camera tronului regelui pentru a le învia! </p> <p> Poarta lui Baldur a fost una dintre cele care au imitat cel mai mult experiența RPG de pe masă. A adaptat setul de reguli Dungeons &amp; Dragons 2nd Edition (AKA Advanced Dungeons &amp; Dragons) într-un izometric <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> CRPG pauzabil în timp real </a> . Aceste tipuri de CRPG-uri au subliniat tactica în luptă, progresia personajului, luarea deciziilor și au încurajat explorarea. </p> <p> </p> <p> Astăzi, într-o lume în care consolele domină piața, jocurile video cu roluri au devenit mai populare decât RPG-urile de masă. În măsura în care în utilizarea modernă, acronimul RPG se referă mai mult la versiunea sa de jocuri video. Ați numi Dungeon&#39;s &amp; Dragons un RPG de masă, mai degrabă decât un RPG. </p> <p> Odată cu evoluția graficii, mecanismele de joc CRPG adaptate la standardele grafice moderne. Seriile CRPG-uri precum The Elder Scrolls, Gothic sau The Witcher au revoluționat genul, introducând unele noi mecanici de joc în timp ce renunță la altele. </p> <p> Aceste RPG-uri sunt mai orientate spre acțiune și mai rapide, plasându-se oarecum, deși nu complet, în subgenul hack and slash (acestea sunt totuși RPG-uri solide!) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Un nou val de CRPG-uri </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> Cu toate acestea, mergând împotriva tendinței din industria jocurilor video de astăzi de a merge pentru realismul grafic, a venit un nou val de CRPG-uri. RPG-urile vechi sau clasice influențează puternic aceste jocuri și pun accentul pe mecanica de joc și pe imersiune, mai degrabă decât pe imagini. </p> <p> Sunt, în general, jocuri izometrice, cu bătălii tactice în timp real, pauzabile, sau pe ture. Aceste CRPG-uri fac tot posibilul să fie cât mai captivante posibil, oferindu-vă blocuri oarecum mari de proză bine lucrate și o poveste solidă. </p> <p> Majoritatea se bazează pe text, mai degrabă decât pe voce, pentru majoritatea dialogurilor, la fel ca CRPG-urile din vechea școală. Unele dintre aceste CRPG-uri includ Pillars of Eternity, Divinity: Original Sin sau Pathfinder: Kingmaker. </p> <p> Aceste jocuri subliniază, de asemenea, tacticile de luptă, progresia personajelor, luarea deciziilor și încurajează explorarea, la fel cum au făcut CRPG-urile vechi. Din aceste motive, le considerăm ca fiind mai strâns legate de RPG-uri clasice decât de cele mai moderne RPG-uri. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> Ce înseamnă CRPG în 2021 </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> Începând cu anii 2000, RPG devenise termenul standard atunci când se referea la orice joc video de rol. Dar, în jurul anului 2015, au lansat Divinity: Original Sin și Pillars of Eternity. </p> <p> Aceste RPG-uri s-au îndepărtat de acțiunile orientate spre acțiune ale RPG-urilor moderne, în timp ce erau foarte asemănătoare cu titlurile mai vechi atât în ​​estetică, cât și în mecanica de joc. În această perioadă a apărut nevoia unui nou termen pentru a diferenția aceste RPG-uri de RPG-urile moderne. </p> <p> Deși oamenii au aruncat de ani de zile termenii „școală veche” și „RPG clasic” pentru a descrie aceste jocuri, acesta din urmă este cel care a rămas. Așa cum jocurile de roluri moderne au revendicat acronimul RPG pentru ei înșiși, oamenii numesc acum RPG-urile vechilor școli „CRPG-uri”. </p>"}