{"title":"Raport: Android 12 va avea un mod cu o singură mână","content":"<p> Am ajuns oficial la faza ciclului de viață al Android 11, în care zvonurile despre Android 12 încep să iasă în forță. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> Dezvoltatori XDA </a> a raportat că Google lucrează la un mod cu o singură mână pentru Android 12, care va face mult mai ușor navigarea prin telefon cu o singură mână. Indiferent dacă aveți mâini mari sau mici, acest lucru ar putea deschide un mod cu totul nou de a interacționa cu dispozitivul dvs. Android. </p> <p> Desigur, mulți producători de dispozitive și <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> dezvoltatorii de software au introdus soluții pentru îmbunătățirea utilizării cu o singură mână </a> . Totuși, va fi mult mai plăcut să-l folosiți atunci când este integrat direct în sistemul de operare. </p> <h2 id=\"android-12-s-one-handed-mode\"> Modul cu o singură mână al Android 12 </h2> <p> Conform raportului, Google intenționează să adauge funcția cu o singură mână la AOSP, care este versiunea open-source a Android pe care orice constructor de software o poate folosi pe dispozitivele sale. Asta înseamnă, de asemenea, că OEM-urile care încă nu și-au dezvoltat propriul mod cu o singură mână vor avea o modalitate ușoară de a implementa caracteristica în dispozitivele lor. </p> <p> Ceea ce raportul nu a indicat a fost dacă Google va solicita producătorilor de telefoane să utilizeze funcția cu o singură mână a Android 12 sau dacă ar fi opțională. </p> <p> Deoarece este încă incredibil de devreme, nu știm exact cum va funcționa modul cu o singură mână al Android 12. Dacă abilitatea trecută a Google de a adăuga funcții în sistemul de operare este un indiciu, ne-am aștepta ca compania să facă o treabă bună cu implementarea. Google poate alege să micșoreze întregul ecran până la un colț al dispozitivului pentru un acces ușor. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> Raportul indică, de asemenea, că modul cu o singură mână Android 12 va avea o modalitate de a-l declanșa folosind modul tradițional cu trei butoane, împreună cu noul mod de navigare gestuală. </p> <p> După cum sa menționat, o mulțime de OEM-uri pentru smartphone-uri au implementat deja această caracteristică în propria versiune modificată de Android. De exemplu, Huawei a încercat de fapt să trimită versiunea sa a funcției către AOSP, dar Google a respins-o. Poate că Google a refuzat-o, deoarece compania știa că intenționează să aducă propria versiune a funcției. </p> <p> Deoarece această scurgere este atât de timpurie, nicio fotografie nu demonstrează încă caracteristica, așa că va trebui să așteptăm până când Android 12 se apropie de lansare. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Când va fi lansat Android 12? </h2> <p> Din păcate, nu știm exact când Android 12 va fi lansat publicului (deși nu va fi pentru o vreme). De asemenea, nu știm exact când va apărea această funcție pentru dezvoltatori sau pentru versiunile Beta sau Stable Android. </p> <p> Așa cum se întâmplă întotdeauna cu noile funcții Android, va trebui să așteptăm și să vedem dacă este vorba de sistem de operare. </p>"}