{"title":"S-ar putea să obțineți noul Microsoft Teams Pro gratuit","content":"<p> Cu puțin timp în urmă, am acoperit un serviciu de abonament planificat pentru Microsoft Teams numit „Teams Pro”, care va debloca caracteristici suplimentare pentru software. Cu toate acestea, Microsoft a înregistrat apoi faptul că unele persoane vor primi Teams Pro fără costuri suplimentare pentru planurile lor actuale. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Declarația Microsoft privind abonamentele gratuite Teams Pro </h2> <p> În cazul în care aveți nevoie de un memento, am tratat anterior acest subiect în articolul nostru <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro adăugând webinarii la serviciu </a> . </p> <p> Acum, un articol de <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> pe același subiect a primit de atunci o declarație de la Microsoft. Declarația este o veste bună pentru persoanele îngrijorate de plata suplimentară pentru seminarii web: </p> <blockquote> <p> Pe 9 februarie, am publicat o postare MC referitoare la un nou plan de servicii Teams Pro. Pentru a clarifica, nu există nicio modificare a licențelor de produs existente prin adăugarea acestui nou plan de servicii. Mai degrabă, planul de servicii va fi adăugat automat la licențele Microsoft 365 și Office 365 E5 / E3 / A5 / A3 și Microsoft 365 Business Standard / Business Premium și va permite utilizatorilor care sunt licențiați pentru aceste SKU-uri să primească automat capabilități de implementare pe Echipe în viitorul apropiat. </p> </blockquote> <p> Microsoft continuă să afirme că administratorii nu trebuie să facă nimic pentru a activa aceste noi funcții. De asemenea, oricine are o licență compatibilă, așa cum este enumerat mai sus, va primi aceste noi funcții strălucitoare fără costuri suplimentare. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Obținerea mai mult pentru același lucru cu echipele Microsoft </h2> <p> Microsoft lansează un nou plan de abonament Teams Pro care deblochează seminarii web și multe altele, dar nu toată lumea va trebui să plătească suplimentar pentru asta. Dacă v-ați abonat la una dintre licențele de mai sus, puteți aștepta cu nerăbdare să obțineți toate funcțiile Teams Pro pentru nimic în plus. </p> <p> Asta nu înseamnă că oamenii fără Teams Pro vor fi lăsați la umbră. De exemplu, toată lumea va avea în curând acces la o funcție de recapitulare la îndemână în Microsoft Teams. </p> <p> <small> Credit de imagine: Postmodern Studio / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}