{"title":"Surface Duo obține o dată de lansare în Marea Britanie și o scădere a prețului","content":"<p> Surface Duo de la Microsoft nu a avut o recepție de lansare atât de fantastică, dar se pare că compania dorește să facă primele impresii mai bune în afara SUA. Nu numai că compania reduce prețul Surface Duo, dar are și o dată de lansare confirmată pentru piața din Marea Britanie. </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> Pregătirile finale de peste mări ale Microsoft pentru Surface Duo </h2> <p> Această veste ne vine de la <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . Dacă vă amintiți, înapoi la lansarea Surface Duo, <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> nu a primit recenzii grozave </a> . Un punct central a fost cât de buggy a fost sistemul de operare al Duo-ului, dar altul a fost prețul său atrăgător, de 1399,99 USD. </p> <p> Microsoft a lucrat din greu la soluționarea problemelor majore pe care le-au găsit recenzorii, dar prețul său ridicat a rămas în continuare acolo unde era. Cu toate acestea, Microsoft intenționează să ofere Surface Duo o scădere semnificativă a prețului la 999,99 USD. </p> <p> Această scădere este probabil în pregătirea lansării sale în străinătate, deoarece criticii din întreaga lume se pregătesc să descompună Surface Duo inch cu inch. Cu acest punct de preț redus, plus corecțiile recente ale sistemului de operare Surface Duo, minunea cu ecran dublu poate face încă o impresie pozitivă în străinătate. </p> <p> Microsoft a confirmat, de asemenea, când fanii din Marea Britanie pot încerca singuri Surface Duo. Dacă sunteți în Marea Britanie, urmăriți comercianții cu amănuntul de produse electronice pe 18 februarie 2021. </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> Zgârierea suprafeței planurilor Microsoft în străinătate </h2> <p> În timp ce Surface Duo s-a străduit să facă o impresie bună în SUA, s-ar putea să mai existe speranță pentru el în străinătate. Cu toate soluțiile la sistemul de operare Surface Duo combinate cu această scădere a prețului, iarba poate ajunge să fie mai verde pe cealaltă parte. </p> <p> Dacă doriți să știți ce fel de patch-uri a impus Microsoft pentru Surface Duo, compania a lansat recent câteva actualizări de stabilitate pentru a rezolva erorile înainte de debutul internațional al Duo. </p> <p> <small> Credit de imagine: Jack Skeens / <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}