{"title":"Spotify testează versuri live în SUA","content":"<p> Îți place să cânți melodiile preferate de Spotify, dar trebuie să cauți mereu versurile pentru a te asigura că karaoke-ul tău este corect? Ai noroc. Spotify își testează acum versiunea de versuri live unor persoane din SUA. </p> <h2 id=\"spotify-rolls-out-real-time-lyrics\"> Versuri Spotify se lansează în timp real </h2> <p> Dacă vă aflați în SUA, s-ar putea să vedeți o nouă funcție Spotify care vă permite să afișați versurile în timp real împotriva muzicii pe care o redați. Versurile sunt furnizate de compania de date muzicale Musixmatch. </p> <p> „Might” este cuvântul cheie acolo, deoarece acesta este încă într-o fază de testare. Asta înseamnă că numai un grup de utilizatori vor vedea funcția în timp ce Spotify măsoară impactul acesteia. Nu se știe câți utilizatori alcătuiesc grupul de testare. </p> <p> Versurile au fost o caracteristică solicitată de mult timp pentru Spotify, așa că ar fi surprinzător dacă în cele din urmă funcția nu a fost lansată pentru toată lumea, dar nimic nu este sigur. </p> <p> Într-un e-mail către <a href=\"https://www.engadget.com/spotify-live-lyrics-united-states-test-ios-android-140045159.html\" target=\"_blank\" rel=\"nofollow noopener\"> Engadget </a> , un purtător de cuvânt al Spotify a spus: </p> <blockquote> <p> Putem confirma că testăm în prezent funcția de versuri pentru un număr select de utilizatori din SUA. La Spotify, efectuăm în mod obișnuit o serie de teste pentru a ne îmbunătăți experiența utilizatorului. Unele dintre aceste teste ajung să deschidă calea pentru experiența noastră de utilizator mai largă, iar altele servesc doar ca o învățare importantă. În acest moment nu mai avem alte știri de împărtășit. </p> </blockquote> <p> </p> <h2 id=\"are-lyrics-new-for-spotify\"> Versurile sunt noi pentru Spotify? </h2> <p> Strict vorbind, versurile în timp real nu sunt o caracteristică nouă. Acest lucru se datorează faptului că este disponibil în țări precum Brazilia, Mexic, India și Singapore din iunie 2020. </p> <p> De fapt, cu mult înainte de aceasta, Spotify avea o versiune de versuri live în toată lumea. A venit, de asemenea, ca urmare a unui parteneriat cu Musixmatch, deși caracteristica a fost înlăturată fără cerimonie la încheierea acordului dintre cele două companii. </p> <p> Spotify l-a înlocuit apoi cu o integrare cu Genius, într-o caracteristică denumită „În spatele versurilor”, care afișează informații și fapte amuzante despre unele melodii. Acest lucru este, de asemenea, disponibil pe Apple Music, care acceptă și versuri live. </p> <p> Engadget raportează că „În spatele versurilor” va fi eliminat din Spotify dacă versiunea live a versurilor se extinde mai larg. Probabil că nu va fi ratat de mulți. </p> <p> Pentru acele persoane din regiuni care nu au încă versuri live, există opțiunea de a <a href=\"https://www.makeuseof.com/tag/lyrics-currently-playing-songs-spotify/\" target=\"_blank\" rel=\"nofollow noopener\"> utilizați alte aplicații pentru a vizualiza versurile în Spotify </a> . </p> <p> Desigur, puteți utiliza, de asemenea, unul dintre numeroasele site-uri web de text, deși acestea nu se vor afișa la timp pentru muzica dvs. Spotify. </p>"}