{"title":"Twitter pentru a eticheta conturile personale ale oficialilor guvernamentali","content":"<p> Twitter va începe în curând să plaseze etichete pe conturile personale ale oficialilor guvernamentali. Etichetele ar trebui să ajute utilizatorii să identifice cu ușurință pe oricine este asociat cu guvernul. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Mai mulți oficiali guvernamentali vor primi o etichetă pe Twitter </h2> <p> Potrivit unei postări pe <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> blogul Twitter </a> , platforma va începe etichetarea conturilor personale ale „șefilor de stat” pe 17 februarie 2021. Va aplica etichete și pe conturile asociate cu mass-media afiliate de stat. </p> <p> Twitter extinde, de asemenea, acoperirea etichetelor sale pentru a acoperi oficialii guvernamentali din mai multe țări. Aceste locații includ Canada, Cuba, Ecuador, Egipt, Germania, Honduras, Indonezia, Iran, Italia, Japonia, Arabia Saudită, Serbia, Spania, Thailanda, Turcia și Emiratele Arabe Unite. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Credit de imagine: Twitter </p> <p> Platforma speră că aceste etichete vor ajuta utilizatorii „să aibă o experiență mai informată pe Twitter” și intenționează, de asemenea, să modifice textul etichetei pentru a „adăuga mai multă specificitate” prin „diferențierea între persoane și instituții”. </p> <p> Primul val de etichete Twitter pentru conturi afiliate guvernului a fost lansat în august 2020. Inițial, aceste etichete se aplicau doar oficialilor asociați cu cele cinci țări din Consiliul de Securitate al Națiunilor Unite și nu includeau conturile personale ale acestor oficiali. </p> <p> Acestea fiind spuse, aceste etichete nu sunt <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> jab flagrant la dezinformare </a> , dar vor ajuta în continuare utilizatorii să obțină mai mult context despre ceea ce citesc și de la cine provine. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter va continua doar să-și extindă etichetele </h2> <p> La sfârșitul postării sale pe blog, Twitter a menționat că speră să-și extindă etichetele către „țări suplimentare în timp”. Eticheta apare ca un steag gri deschis pe profilul Twitter al unei persoane și este probabil să o întâlniți mai des în următoarele săptămâni. </p>"}