{"title":"Ultima actualizare WatchOS se apără împotriva bug-ului Apple Watch-Bricking","content":"<p> Cea mai recentă actualizare Apple watchOS, versiunea software 7.3.1, include o soluție foarte importantă --- rezolvarea unei erori care oprește încărcarea unor dispozitive Apple Watch Series 5 și Apple Watch SE atunci când intră în modul de rezervă de energie. </p> <p> Compania a lansat, de asemenea, un nou program gratuit de reparații pentru dispozitivele afectate care sunt prinse în acest mod de consum redus de energie și nu pot ieși din el. Această eroare „cărămizi” este în esență Apple Watch, făcându-l să nu mai funcționeze. </p> <h2 id=\"the-power-reserve-mode-bug\"> Bugul modului de rezervă de energie </h2> <p> Modul de rezervă de energie este inițiat atunci când un Apple Watch este descărcat. Împiedică comunicarea Apple Watch să comunice cu iPhone-ul. De asemenea, împiedică utilizatorii să acceseze alte funcții de pe Apple Watch. Pentru a ieși din modul de rezervă de rezervă, utilizatorii trebuie să-și încarce Apple Watch. </p> <p> Pe o <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> pagina de asistență despre programul de erori și reparații </a> , din 15 februarie, Apple începe notând: </p> <blockquote> <p> Un număr foarte mic de clienți cu modele Apple Watch Series 5 sau Apple Watch SE care rulează watchOS 7.2 sau 7.3 au întâmpinat o problemă cu ceasul care nu se încarcă după ce acesta intră în rezerva de alimentare. </p> </blockquote> <p> Pentru a afla dacă aveți un model Apple Watch afectat, Apple vă recomandă să puneți ceasul pe un încărcător și să așteptați cel puțin 30 de minute. Dacă nu se va percepe, contactați asistența Apple și acestea vor aranja o reparație gratuită prin poștă. </p> <p> Ceasurile vor fi examinate pentru a verifica dacă sunt eligibile și, cu condiția ca acestea să fie, reparația va fi efectuată gratuit, iar ceasul reparat va fi returnat proprietarului său. </p> <p> Nu este clar exact câte ceasuri Apple sunt grav afectate de eroare. Cu toate acestea, se pare că problema afectează doar un subset de modele Apple Watch Series 5 sau Apple Watch SE și niciun alt model. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> Cum să faceți upgrade la WatchOS 7.3.1 </h2> <p> Pentru cei care nu au experimentat eroarea, merită să treceți la cea mai recentă versiune watchOS doar pentru a vă proteja împotriva potențialului său. </p> <p> Importanța remedierii erorilor este indicată de faptul că Apple a trimis imediat watchOS 7.3.1 tuturor utilizatorilor. Acest lucru este în contrast cu modul în care emite în mod normal actualizări de software, făcându-le disponibile inițial dezvoltatorilor pentru testarea beta. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple a lansat watchOS 7.3 </a> la sfârșitul lunii ianuarie. </p> <p> Utilizatorii pot descărca watchOS 7.3.1 folosind aplicația Apple Watch de pe iPhone. Pentru a face acest lucru, trebuie să meargă la <strong> General&gt; Actualizare software </strong> . Pentru a se actualiza, Apple Watch trebuie să aibă cel puțin 50% din baterie. De asemenea, trebuie să fie în imediata apropiere a iPhone-ului. </p>"}