{"title":"Veți juca în curând jocuri cu personaje MetaHuman Epic","content":"<p> Dacă credeți că jocurile arată acum realiste, atunci așteptați până când veți prinde o mulțime de ceea ce Epic Games are în lucru cu motorul său ireal. Pregătiți-vă să vă suflați mintea. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games dezvăluie noi MetaHumans </h2> <p> Probabil că vă întrebați despre ce pământ vorbim. MetaHuman Creator este cea mai recentă funcție pe care Epic Games a adăugat-o la Unreal Engine; un mediu de dezvoltare software, pe care dezvoltatorii de jocuri îl pot folosi pentru a-și crea titlurile. </p> <p> Potrivit unui <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Postare pe blogul Unreal Engine </a> anunțând noul interesant instrument de dezvoltare: </p> <blockquote> <p> MetaHuman Creator este o aplicație transmisă în cloud concepută pentru a lua în timp real creația umană digitală de la săptămâni sau luni la mai puțin de o oră, fără a compromite calitatea. </p> </blockquote> <p> Deci, este în esență o modalitate prin care dezvoltatorul de jocuri creează facsimile umane incredibil de realiste. Rapid. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> Ce înseamnă MetaHuman Creator pentru dezvoltatori? </h2> <p> </p> <p> Implicațiile acestui lucru pentru dezvoltarea de software sunt schimbarea jocului (joc de cuvinte). Imaginați-vă cât de repede dezvoltatorii își vor popula lumea jocurilor cu NPC-uri, folosind MetaHuman Creator. Nu numai asta, dar și oamenii digitali arată incredibil. </p> <p> Acest lucru va însemna, de asemenea, în mod evident că dezvoltatorii pot termina titlurile mai repede, deci nu trebuie să așteptați prin nenumărate întârzieri. MetaHuman Creator permite dezvoltatorilor să își construiască rapid populația de NPC-uri, lăsând timp pentru alte aspecte mai presante. </p> <p> Dar de ce este nevoie de acest instrument? Epic Games explică: </p> <blockquote> <p> Crearea unui om digital de înaltă calitate este dificilă și consumă mult timp. Scalarea efortului de a crea mulți oameni digitali diferiți de calitatea cerută de platformele de ultimă generație și de producția virtuală de ultimă generație este într-adevăr o sarcină formidabilă. </p> </blockquote> <p> Deci, așa cum am spus; instrumentul economisește timp și îmbunătățește fluxul de lucru, permițând dezvoltatorilor să ofere consolelor de nouă generație jocurile pe care le merită. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> Cum va afecta MetaHuman Creator jocurile? </h2> <p> Ei bine, datorită MetaHuman Creator, jocurile ar putea fi lansate mult mai repede, pentru început. Având la dispoziție instrumente puternice de genul acesta, dezvoltatorii ar putea perfecționa mecanica jocului sau pot petrece mai mult timp rezolvând de fapt bug-urile înainte de a lansa un joc defect ... </p> <p> Oricum, amărăciunea deoparte, instrumentul de dezvoltare al Epic pare a fi ceva care va face și jocurile să arate mai bine. Trebuie doar să te uiți la randuri pentru a vedea cât de uluitoare sunt de fapt oamenii digitali. Când îi vedem în jocuri, totuși, atunci se va întâmpla adevărata magie. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> Când vom vedea MetaHumans în jocuri? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> Este greu de spus. În prezent, Epic a legat software-ul Creator pentru testarea accesului timpuriu în „următoarele câteva luni”. Deci nu veți vedea niciodată MetaHumans în curând. </p> <p> Dacă vă place să creați propriul om digital, trebuie să așteptați dacă doriți să utilizați Creatorul MetaHuman al Unreal Engine. Puteți încerca întotdeauna să puneți unul împreună într-un alt program, dar cu siguranță nu va dura mai puțin de o oră! </p>"}