{"title":"VW pretinde că Apple nu a câștigat o călătorie ușoară în industria auto","content":"<p> Herbert Diess, directorul executiv al grupului Volkswagen, a minimizat orice potențial impact al unei mașini Apple asupra industriei auto, spunând că VW „nu se teme” de Project Titan. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW „Nu-ți este frică” de o mașină Apple </h2> <p> Deși Diess recunoaște că un automobil cu mărcile Apple poate avea într-adevăr un sens, el nu crede că Apple ar putea domina peisajul producătorului de automobile „peste noapte” din cauza concurenței intense. Tăierea oțelului și vânzarea de mașini către consumatori neplăcuți este o afacere dificilă, a sugerat el, adăugând că acest lucru nu este un domeniu pe care o singură companie îl poate „prelua dintr-o singură lovitură”. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> transmite ceea ce Diess i-a spus lui Frankfurter Allgemeine Sonntagszeitung într-un interviu: </p> <blockquote> <p> Industria auto nu este un sector tehnologic tipic pe care l-ați putea prelua dintr-o singură lovitură. Apple nu va gestiona asta peste noapte. Totuși, nu ne este frică. </p> </blockquote> <p> Totuși, un vehicul marca Apple ar avea sens având în vedere competențele Apple în domeniul bateriilor, software-ului, designului industrial și resurselor sale aparent nesfârșite, a adăugat executivul. Apple nu oferă produse legate de mașină în afară de <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Software pentru tabloul de bord CarPlay </a> care permite ca un radio auto sau unitatea principală să acționeze ca un afișaj și un controler pentru un iPhone. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> Cel mai rău secret păstrat din industrie </h2> <p> Planurile pentru Project Titan (numele de cod intern pentru o mașină Apple) nu sunt încă publice, în ciuda unei valuri de zvonuri recente care spun <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple căuta să se asocieze cu Hyundai / Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Se spune că Apple a vorbit cu alte companii de automobile </a> și producătorii de contracte --- inclusiv Magna, Nissan și Foxconn --- despre construirea vehiculului său condus autonom. Surse spun că un Apple Car ar putea să nu aibă un volan, deoarece poate fi inițial <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> accent pe livrarea de alimente și operațiuni robotaxi </a> înainte de a fi vândute consumatorilor. </p> <p> </p> <p> Cea mai mare opțiune din comentariul lui Herbert ar fi că industria automobilelor a acordat o atenție deosebită proiectului Titan. În mod clar, chiar gândul la intrarea Apple în acest sector îi face pe unii dintre directorii de top să fie nervoși. Acestea fiind spuse, istoria este plină de oameni care ar fi trebuit să știe mai bine decât să ridiculizeze Apple pentru intrarea într-o nouă categorie de produse. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Cum a râs CEO-ul Palm de pe iPhone </h2> <p> Cel mai bun exemplu în acest sens este fostul CEO al Palm, Ed Colligan. Cu doar câteva săptămâni înainte de introducerea originală a iPhone-ului în 2007, Colligan a râs de ideea că o companie cunoscută pentru proiectarea de computere frumoase ar putea câștiga clienți din sectorul competitiv al smartphone-urilor, spunând: </p> <blockquote> <p> Am învățat și ne-am luptat câțiva ani aici găsind cum să facem un telefon decent. Băieții din PC nu vor rezolva acest lucru. Nu vor intra doar. </p> </blockquote> <p> Similar cu modul în care Colligan l-a descris pe Apple drept „băieți de la PC”, șeful Volkswagen încearcă să minimizeze noțiunea că o companie de tehnologie ar putea câștiga clienți în industria de producere de mașini. Istoria va arăta dacă comentariul lui Herbert va îmbătrâni mai bine decât al lui Colligan. </p>"}