{"title":"10 вещей, которые могут делать Документы Google, о которых вы не знали","content":"<p> Google Doc может показаться простым на первый взгляд, но в инструменте повышения производительности облака есть много упускаемых из виду функций, которые могут помочь вам сделать больше на работе. </p> <p> В этой статье мы рассмотрим несколько функций Google Doc, о которых вы, вероятно, не знали, и то, как вы можете использовать их, чтобы сэкономить время при создании контента. </p> <p> Обратите внимание, что эти функции в основном доступны в настольной версии инструмента Google Docs. Будут указаны те, которые также можно использовать в мобильной версии. </p> <h2 id=\"voice-typing\"> 1. Голосовой набор </h2> <p> Чтобы использовать функцию голосового набора, откройте документ и щелкните <strong> Инструменты </strong> в строке меню вверху страницы. Выбирать <strong> Голосовой набор </strong> из раскрывающегося списка. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> На вашем экране появится микрофон с языковым меню, в котором вы можете выбрать предпочитаемый язык общения. Когда вы будете готовы произнести текст, щелкните микрофон или нажмите <strong> Cmd + Shift + S </strong> (если вы используете Mac) или <strong> Ctrl + Shift + S </strong> (если вы используете ПК с Windows), чтобы начать запись. </p> <p> Чтобы добавить знаки препинания между текстом, произнесите название знака препинания, который вы хотите добавить, например «точка», «запятая» или «знак вопроса». Вы можете дать инструкции по форматированию, такие как «новая строка» или «новый абзац», или «прекратить прослушивание», если вы хотите сделать перерыв в голосовом вводе, и «возобновить», когда будете готовы продолжить. </p> <p> Найдите команды расширенного редактирования в этом <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> список команд </a> на странице поддержки Google. </p> <p> Вы также можете использовать эту функцию для расшифровки любого аудио. Просто воспроизведите звук (со своего телефона или любого другого устройства) для преобразования голоса в текст, и он должен напечатать его за вас. Возможно, вам придется внести несколько изменений, но вы сэкономите много времени. </p> <p> </p> <p> Функция голосового набора доступна только на рабочем столе, но работает только в браузере Chrome. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Автономное редактирование </h2> <p> Многие люди любят Документы Google за возможность мгновенного сохранения в облаке, но это может быть неудобно, если у вас какое-то время нет доступа к Интернету. Хорошей новостью является то, что вы по-прежнему можете просматривать и редактировать свои файлы в автономном режиме. </p> <p> Эта функция доступна только в Google Chrome, и вам потребуется установить и активировать <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Расширение Google Docs Offline для Chrome </a> . Кроме того, убедитесь, что вы не просматриваете веб-сайты в приватном режиме. </p> <p> Эту функцию необходимо использовать, когда вы в сети, но как только это будет сделано, вы сможете писать и редактировать текст в автономном режиме, а затем они будут сохранены в облаке, когда вы получите доступ к Интернету. Вот как. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> Чтобы сделать возможным <strong> открывать и сохранять файлы Google Документов в автономном режиме </strong> , следить <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> эти инструкции </a> . Эта функция доступна на ПК, iOS и Android. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Отслеживание / восстановление истории версий документа. </h2> <p> Если вы работаете над документом в одиночку или вместе с другими, вы можете отслеживать изменения в документе с помощью функции истории версий. </p> <p> Вы также можете временно или навсегда восстановить предыдущую версию документа; функция, которая может спасти вас, если вы случайно удалите части документа и не сможете использовать <strong> Отменить </strong> кнопку, чтобы восстановить их. </p> <p> Чтобы использовать функцию истории версий, щелкните <strong> Файл </strong> в строке меню и выберите <strong> История версий </strong> из раскрывающегося списка. Вы увидите, что вы также можете назвать версию, чтобы использовать это для отслеживания постоянных изменений в документе, особенно если другие пользователи вносят изменения в тот же документ. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Эта функция доступна только на рабочем столе. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Режим предложения и просмотра </h2> <p> Хотя здорово сотрудничать с другими и вместе редактировать документ, может быть сложно (и беспорядочно) отслеживать изменения, внесенные каждым человеком. </p> <p> Функция предложения позволяет вам просто предлагать правки, если вы не хотите вообще изменять документ. Ваши предложения появятся в редакторе в виде комментариев на боковой панели, и редактор может мгновенно внести изменения, приняв предложение. Вы также можете вести беседы с <strong> Отвечать </strong> , так что вы можете оставлять и получать отзывы прямо на странице документа, не отправляя электронные письма туда и обратно. </p> <p> Чтобы предложить изменения, щелкните значок карандаша для режима редактирования в правом верхнем углу открытого документа, затем выберите <strong> Предлагая </strong> . </p> <p> Чтобы просмотреть документ без предложений, нажмите <strong> Viewing </strong> . Вы сможете читать без зачеркивания и всплывающих окон с комментариями. </p> <p> Чтобы сэкономить время, вы можете принять или отклонить все предложения сразу. Нажмите <strong> Инструменты </strong> , затем выберите <strong> Просмотреть предложенные правки </strong> . Нажмите <strong> Принять все </strong> или же <strong> Отклонить все </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Эта функция доступна только на рабочем столе. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Добавить шрифты </h2> <p> Если ты когда-нибудь захочешь <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> стилизовать свой текст </a> в соответствии с вашим сообщением, вы также можете сделать это с помощью Документов Google. Помимо 24 шрифтов по умолчанию, которые уже запрограммированы в инструменте Google Docs, вы можете добавить несколько классных шрифтов по вашему выбору, чтобы визуально улучшить текст. </p> <p> Чтобы добавить шрифты, просто нажмите на <strong> Шрифты </strong> в строке меню и выберите <strong> Больше шрифтов </strong> . Выберите сколько угодно шрифтов из предоставленной коллекции. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Эта функция доступна только на рабочем столе. </p> <p> </p> <h2 id=\"compare-documents\"> 6. Сравните документы </h2> <p> Это еще одна функция, которую вы можете использовать для отслеживания изменений, внесенных в документ вами или соавтором. Это особенно полезно для больших документов, и, как следует из названия, вы можете сравнить два документа, чтобы увидеть различия между ними. </p> <p> Чтобы использовать эту функцию, откройте базовый документ, для которого вы хотите провести сравнение, затем щелкните значок <strong> Инструменты </strong> и выберите <strong> Сравнить документы </strong> . </p> <p> В появившемся диалоговом окне выберите документ, с которым вы хотите сравнить его, на вашем Диске, и нажмите <strong> Сравнивать </strong> . в <strong> Атрибут различия в </strong> В поле введите имя соавтора, который будет автором предлагаемых правок в окончательном документе. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> Различия будут отображаться так же, как и в <strong> Предлагая </strong> режим, который мы обсуждали выше, и вы также можете принять или отклонить изменения. </p> <p> Эта функция доступна только на рабочем столе. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Найти и заменить </h2> <p> Если вам когда-либо понадобится заменить несколько экземпляров ошибки в тексте, Документы Google упрощают это с помощью функции «Найти и заменить». </p> <p> Для пользователей, знакомых с функцией «Найти и заменить» в Microsoft Word, это работает точно так же. </p> <p> Чтобы найти в документе определенное слово или фразу, используйте ярлык <strong> Ctrl + F </strong> на ПК с Windows или <strong> Command + F </strong> на Mac. Введите слово в поле «Найти в документе». </p> <p> Чтобы заменить найденный текст, нажмите на три точки справа и выберите <strong> Найти и заменить </strong> . </p> <p> Затем введите текст в поле <strong> Находить </strong> поле и текст замены в <strong> Заменить </strong> поле. Прокрутите экземпляры текста с помощью курсора вверх и вниз и щелкните <strong> Заменять </strong> чтобы поменять их местами по отдельности. Или нажмите <strong> Заменить все </strong> для замены всего выделенного текста сразу. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Используйте словарь. </h2> <p> Чтобы помочь вам сконцентрироваться и избежать необходимости переключаться между вкладками при поиске значения слова, в Документах Google есть словарь в приложении. </p> <p> Когда вы печатаете и вам нужно найти слово, выделите слово, затем щелкните правой кнопкой мыши и выберите <strong> Определять </strong> из меню. Инструмент «Словарь» выполнит поиск определения слова в Интернете, и оно появится в правой части экрана. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Добавьте языковые акценты </h2> <p> Попрощайтесь с запоминанием сочетаний клавиш с диакритическими знаками или копированием / вставкой букв с диакритическими знаками из других документов. </p> <p> Чтобы использовать буквы с диакритическими знаками, вам необходимо скачать <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> надстройка «Easy Accents» </a> . Он позволяет вставлять акценты для 20 разных языков прямо с боковой панели документа. </p> <p> Загрузите надстройку Google Doc, открыв <strong> Инструменты </strong> меню, затем нажмите <strong> Дополнения </strong> а также <strong> Получите дополнения </strong> . Во всплывающем окне Google Marketplace найдите <strong> Легкие акценты </strong> и нажмите синюю кнопку установки, чтобы добавить его в свою коллекцию надстроек Google Документов. </p> <p> После установки нажмите на <strong> Дополнения </strong> меню, чтобы выбрать дополнение Easy Accents и начать добавлять правильные акценты ко всем вашим иностранным словам. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Это дополнение доступно только для настольных компьютеров, но мобильные клавиатуры обычно поддерживают языковые акценты, поэтому вы сможете писать текст с диакритическими знаками на телефоне без надстройки. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Создавайте собственные ярлыки. </h2> <p> Большинство людей знакомы с <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Ярлыки Microsoft Word </a> , но вы также можете создать свои собственные ярлыки в Документах Google. Чтобы создать индивидуальные ярлыки, нажмите <strong> Инструменты&gt; Настройки&gt; Замена. </strong> Вы обнаружите, что уже есть несколько сокращений для дробей и символов (например, изменение 3/4 на ¾), но вы можете добавить свои собственные. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Эта функция доступна только на рабочем столе. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Делайте больше с Google Документами </h2> <p> Теперь, когда вы изучили эти инструменты Google Docs, вы можете использовать их при создании следующего документа. Надеюсь, они облегчат вам жизнь! </p>"}