{"title":"5 вещей, из-за которых вас могут навсегда заблокировать в Facebook","content":"<p> Facebook не так известен как Twitter для удаления учетных записей. Однако есть некоторые запрещаемые правонарушения, на которые Facebook отвечает не только предупреждением. </p> <p> Здесь мы исследуем положения и условия Facebook и где компания проводит черту, рассматривая исторические примеры пользователей, которых Facebook «деплатизировал» за свое поведение. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> Позиция Facebook в отношении постоянных запретов </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> В отличие от других социальных сетей, Facebook не перечисляет многие правонарушения, которые приводят к постоянному бану. Вместо этого в качестве главного фактора в нем упоминаются повторные правонарушения, а не тяжесть правонарушений. В результате теоретически любое повторяющееся нарушение Facebook может привести к блокировке профиля. </p> <p> Однако лишь немногие действия приводят к полному запрету, и Facebook на удивление проявляет слабость в отношении некоторых признанных незаконных действий. Например, продажа «регулируемых товаров», таких как оружие и марихуана, запрещена на торговой площадке Facebook, но Facebook не называет это преступлением, подлежащим запрету. </p> <p> Facebook предпочитает помечать или удалять контент по отдельности, а не удалять профили. Однако бывают исключения. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Неправильное использование инструментов и данных </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> Условия использования Facebook определяют три запрещенных нарушения. Первый - это набор действий, который в оставшейся части статьи рассматривается более подробно. Второй и третий более конкретны и связаны с неправильным использованием инструментов и данных Facebook. </p> <p> Этот общий срок обслуживания запрещает доступ и использование частей сайта, которые должны быть зарезервированы для разработчиков. Он также запрещает использование инструментов общедоступных сайтов намеренно вредоносным способом, например использование Facebook для распространения вирусов и вредоносных программ. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Угрозы общественной безопасности </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Один из немногих случаев, когда Facebook заявляет об отключении учетных записей, - это «реальный риск причинения физического вреда или прямой угрозы общественной безопасности». Facebook также удаляет профили, которые «провозглашают насильственную миссию или участвуют в насилии». </p> <p> Это послужило основанием для бессрочного запрета тогдашнего президента Дональда Трампа после беспорядков в Капитолии США в январе 2021 года. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Связь с агрессивными группами </h2> <p> Facebook занял свою позицию в отношении вредоносного и угрожающего контента до ассоциативного уровня в октябре 2020 года, когда он удалил профили, связанные с заговором QAnon, даже если отдельные профили не содержали агрессивного контента. Группа заговора привела к эпизодам насилия с 2016 года. </p> <p> </p> <p> Facebook также заблокировал музыкальную группу Trapt за посты, в которых упоминается группа ненависти Proud Boys. Экстремистская политическая организация участвует в уличных беспорядках в США и Канаде с 2016 года. </p> <p> Компания также оставляет за собой право отключить учетные записи, если эти учетные записи представляют правовой риск для Facebook. Кроме того, Facebook более категоричен, чем другие платформы социальных сетей, в отношении работы с правоохранительными и информационными организациями при обнаружении такого рода контента. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Нарушение безопасности других учетных записей </h2> <p> Еще одно из тех редких правонарушений, которые могут быть запрещены в списках Facebook, - это «нарушение безопасности других учетных записей и наших сервисов». Нарушение безопасности сервисов Facebook очень похоже на вредоносное ПО и неправомерное использование, упомянутые в условиях обслуживания. Однако идея поставить под угрозу безопасность других учетных записей указывает на доксинг. </p> <p> </p> <p> Doxxing - это раскрытие конфиденциальной реальной информации пользователя социальных сетей, потенциально включая его домашний или рабочий адрес, частный номер телефона или физическое местоположение в реальном времени. Эта практика часто делается с намерением причинить этому человеку вред. </p> <p> </p> <h2 id=\"misinformation\"> 5. Дезинформация </h2> <p> </p> <p> Официальные инструкции Facebook гласят, что Facebook не удаляет дезинформацию, вместо этого предпочитая маркировать ее, чтобы она могла участвовать в диалогах, не вводя в заблуждение других. Тем не менее, ряд владельцев аккаунтов с заблокированным аккаунтом говорят, что их удаление произошло в результате того, что Facebook называет «ложными новостями». </p> <p> Это происходит по ряду причин. В некоторых случаях Facebook определяет, что ложные новости также вредны для личного или общественного здоровья. </p> <p> Это было <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> Объяснение Facebook по устранению теоретика заговора Дэвида Айка </a> за утверждение, среди прочего, что Интернет 5G вызывает Covid-19. Facebook также заявил, что Ике «неоднократно нарушал» политику. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Политика Facebook и ваша учетная запись </h2> <p> По большей части Facebook не беспокоится о вас до тех пор, пока вы не злоупотребляете платформой, чтобы причинить вред другим. Однако есть определенные проблемы, когда компания проводит черту на песке. </p> <p> Если вы не нарушаете эти условия обслуживания, вы должны оставаться в безопасности от постоянной блокировки Facebook. </p>"}