{"title":"8 способов, которыми социальные сети могут помочь вам выучить новый язык","content":"<p> Вам все еще снятся кошмары об учебниках испанского и плохо преподаваемых французских классах, которые вы получали в школе? Не бойся. Благодаря Интернету изучение нового языка в наши дни может быть и увлекательным, и доступным. </p> <p> Социальные сети, в частности, помогли соединить миллионы людей, изучающих языки, по всему миру. Независимо от того, изучаете ли вы что-то популярное, например, немецкий, или что-то более малоизвестное, например фарерские, вы найдете широкий спектр ресурсов, которые помогут вам в вашем путешествии. </p> <p> Вот несколько способов использовать социальные сети, чтобы освоить следующий иностранный язык. </p> <h2 id=\"join-facebook-groups\"> 1. Присоединяйтесь к группам Facebook. </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> На Facebook вы найдете группы практически на всех языках, которые только можно вообразить. Вы найдете сообщества недавно переселенных эмигрантов, которые хотят улучшить свои навыки, а также группы для учащихся со всего мира. Чтобы получить максимальную отдачу от своего опыта, вам следует присоединиться к обоим. </p> <p> Чтобы найти нужные группы в Facebook, вы можете выполнить простой поиск в Интернете. Кроме того, вы можете найти то, что ищете, в Facebook. Для этого перейдите в Группы и найдите свой язык. После этого вы получите список сообществ, отвечающих этим потребностям. </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> Если вы учитесь в местной языковой школе, вы также можете создать свою собственную группу, чтобы общаться со своими одноклассниками. Сделать это, <strong> Перейдите в Группы&gt; Создать новую группу </strong> . Затем вы можете изменить настройки и начать приглашать участников. </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2. Используйте Reddit </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit - популярный онлайн-форум, который является золотой жилой для изучающих язык. Вы найдете субреддиты как для конкретных языков, так и для общего изучения языка. </p> <p> Когда вы присоединитесь к сабреддиту, вы получите множество полезных советов и подсказок от других учеников, которые прошли ваш путь. Вы также найдете множество мемов, которые, без сомнения, вам понравятся. </p> <p> Чтобы найти субреддит, перейдите в строку поиска вверху и введите свой язык. После загрузки результатов стоит присоединиться как к группам, специализирующимся на обучении, так и к культурным, чтобы больше узнать о местных обычаях. </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. Общайтесь с носителями языка </h2> <p> Лучший способ быстро выучить язык - поговорить с людьми, которые на нем уже говорят. И социальные сети могут стать отличным местом для поиска этих ораторов. Возможно, вам придется обратиться к нескольким людям, но в конечном итоге вы найдете кого-то, кто готов выделить время, чтобы помочь вам. </p> <p> Общаясь с носителями языка в социальных сетях, сосредоточьтесь в первую очередь на дружбе. Если вы с ними в одном городе, предложите встретиться с ними и заплатить за кофе. Тем, кто живет дальше, предложите помочь им выучить один из языков, на которых вы уже говорите. </p> <p> Шаги для них аналогичны для каждой платформы социальных сетей. В Instagram или Twitter подпишитесь на них и отправьте сообщение (если их настройки конфиденциальности позволяют). Вы можете использовать аналогичный подход в Facebook, хотя некоторые люди могут быть менее склонны принимать запросы о дружбе от тех, кого они не знают. </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. Создайте свой собственный контент в социальных сетях. </h2> <p> Вам не нужно просто потреблять в социальных сетях, чтобы выучить язык. Попробуйте также создавать свои собственные сообщения. Это не только поможет вам попрактиковаться в устной и письменной речи; вы также можете найти новых пользователей, с которыми можно попрактиковаться. </p> <p> Когда дело доходит до создания контента, у вас есть множество вариантов. В Twitter вы можете присоединиться к беседам или написать несколько своих твитов на вашем целевом языке. С Instagram вы можете писать подписи, создавать графику и записывать свои разговоры. </p> <p> Создавая собственный контент для социальных сетей, вы также получите обратную связь от носителей языка. Кроме того, вы также можете расширить свое портфолио и изучить несколько новых полезных навыков. </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. Установите в своих приложениях язык, который вы изучаете. </h2> <p> Изменение настроек телефона - это простой способ заставить себя думать на изучаемом языке и комфортно его читать. Вы также пополните свой словарный запас десятками новых слов. </p> <p> </p> <p> Во всех крупных социальных сетях есть настройки в приложении, где вы можете изменить свой язык. В Instagram, например, перейдите по ссылке <strong> Аккаунт&gt; Язык </strong> . Затем вы увидите раскрывающийся список всех языков, которые вы можете использовать. </p> <p> <strong class=\"gallery__section-title\"> Галерея изображений (2 изображения) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> Расширять <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <p> Вы также можете изменить языки всех приложений сразу в настройках телефона. Перейти к <strong> Настройки </strong> &gt; <strong> Общие&gt; Язык и регион </strong> . Оттуда вы увидите список всех доступных языков. Обратите внимание, что для небольших языков вы не сможете оптимизировать свою учетную запись. </p> <p> <strong class=\"gallery__section-title\"> Галерея изображений (2 изображения) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> Расширять <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. Максимально используйте хэштеги </h2> <p> Использование и поиск с помощью хэштегов - мощный способ найти больше пользователей на изучаемом вами языке. Используя разнообразие, вы можете подключаться к контенту как носителей языка, так и других учащихся и потреблять его. </p> <p> Чтобы найти нужный вам контент, подумайте, что будут использовать другие учащиеся. Вы также можете найти материалы для носителей языка, выполнив поиск по существующим темам в любой стране. Часто вы можете найти их в трендовых постах и ​​статьях. </p> <p> Для поиска хэштегов используйте функцию поиска в любом приложении социальных сетей, которое вы используете. Вы также можете щелкнуть по сообщениям, в которых они используются, и найти все результаты. </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. Следите за аккаунтами на вашем целевом языке </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> У каждой интересной учетной записи, на которую вы подписаны на английском языке, вероятно, есть эквивалент на вашем целевом языке. Это могут быть массовые публикации или обычные люди, которым удобнее создавать работы на своем родном языке. </p> <p> </p> <p> Вы также должны увидеть, есть ли у ваших любимых журналов, спортивных команд и музыкальных исполнителей аккаунты на вашем изучаемом языке. Например, многие из крупнейших спортивных клубов мира имеют аккаунты на английском, испанском и других языках. </p> <p> При отслеживании аккаунтов на языке, который вы хотите выучить, хорошее практическое правило - следовать им, только если вы находите их англоязычный контент столь же интересным. В противном случае вы в конечном итоге проигнорируете их и откажетесь от подписки позже. </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. Подпишитесь на приложения для изучения языков в социальных сетях. </h2> <p> <strong class=\"gallery__section-title\"> Галерея изображений (2 изображения) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> Расширять <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <p> Приложения для изучения языков также часто имеют активные профили в социальных сетях. Они отлично подходят для сбора общих советов и решения общих проблем, с которыми сталкивается каждый, независимо от того, изучает ли он норвежский или японский язык. </p> <p> Некоторые аккаунты, за которыми стоит следить, - это Babbel, Busuu и Duolingo. </p> <p> Однако вам не нужно просто использовать эти приложения для потребления. Не стесняйтесь оставлять свои мысли в комментариях. Вы можете даже завести новых друзей, даже если они будут учить совершенно другой язык, чем вы. </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> Сделайте изучение языка увлекательным с помощью социальных сетей </h2> <p> Итак, вот оно. Теперь у вас есть больше идей об использовании социальных сетей, чтобы сделать ваше путешествие по изучению языка увлекательным. Хотя работа по учебнику по-прежнему важна, она не должна быть вашим единственным вариантом. </p> <p> Даже если вы не можете оптимизировать приложение для вашего целевого языка, вы все равно найдете множество носителей языка и других учеников, с которыми можно связаться. </p> <p> Ключ к изучению языка с помощью социальных сетей - это одновременно вовлекать и потреблять. Когда вы это сделаете, вы найдете свой опыт более удовлетворяющим и поймете слова, которым вас никогда не учили в учебниках. </p>"}