{"title":"Огромное обновление Microsoft Edge ожидает вас","content":"<p> Microsoft очень усердно работает над тем, чтобы сделать свой интернет-браузер Edge самым лучшим из возможных. Теперь компания привносит в него три важные функции, и будущее Edge выглядит радужно. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Что Microsoft запланировала для Edge </h2> <p> Большое обновление бампера было замечено <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Последние версии Windows </a> . Планируется, что эти три функции появятся в одном большом обновлении, поэтому в ближайшем будущем стоит обратить внимание на Edge. </p> <p> Во-первых, Microsoft Edge получает поддержку веб-виджетов. Эти виджеты - удобный способ быстро увидеть важную информацию в течение дня. Софтверный гигант хочет поэкспериментировать с виджетами всех форм и размеров, но для начала решил начать с виджета новостей. </p> <p> Затем в Microsoft Edge появилась функция поиска по вкладкам. Если вам это кажется знакомым, скорее всего, вы читали <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> первоначальное предположение о том, что Edge получит инструмент поиска по вкладкам </a> . К счастью, это предположение стало реальностью, и Microsoft планирует внедрить функцию Chrome в Edge. </p> <p> Наконец, вы сможете управлять всеми расширениями Edge из одного меню. Он появится в виде кусочка пазла на панели задач вашего браузера, и когда вы нажмете на него, он покажет вам все установленные вами расширения, а также быстрый способ их включения и отключения. </p> <p> Неизвестно, когда именно будет выпущено это обновление, но в последней версии Windows оно закреплено для «следующего большого обновления». Таким образом, совсем скоро Microsoft Edge станет привлекательным выбором для людей, ищущих что-то новое. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: следующий большой шаг? </h2> <p> В течение очень долгого времени браузеры Microsoft считались продвинутыми менеджерами загрузки для установки Chrome или Firefox. Однако с тех пор, как Microsoft приняла кодовую базу Chromium для своего браузера, она перестала быть посмешищем в мире браузеров. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCounter </a> перечисляет Microsoft Edge как второй по популярности браузер Windows в США на момент написания. Мы уже знали, что Edge оставил Firefox в пыли, но с тех пор разрыв только увеличился. </p> <p> Теперь Edge составляет 5,25% рынка США по сравнению с 3,35%, которыми владеет Firefox. И то, и другое далеко от 45,83 процента Chrome, но это только начало. </p> <p> Таким образом, если вы раньше отворачивались от браузера Microsoft, сейчас хорошее время, чтобы дать ему второй шанс. Кто знает, возможно, вам понравится лучший браузер от Microsoft! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Расширение браузера до края </h2> <p> Если в прошлом вы не были поклонником браузеров Microsoft, сейчас хорошее время, чтобы сесть и посмотреть, о чем идет речь. Большое обновление находится в разработке, и с этого момента оно будет только улучшаться. </p> <p> Microsoft знает, что это выигрышная формула. Фактически, компания недавно сообщила, что 600 миллионов человек по всему миру теперь используют Edge для просмотра веб-страниц. </p> <p> <small> Имиджевый кредит: ДАНИЭЛЬ КОНСТАНТЕ / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}