{"title":"Простая пища для мозга: 5 сайтов, на которых можно быстро и увлекательно узнать новое","content":"<p> Документальные фильмы продолжительностью менее минуты. Эпизоды подкаста всего за 60 секунд. Анимированная инфографика для объяснения сложных тем. Здесь вы можете узнать больше об окружающем мире в кратких капсулах увлекательных знаний. </p> <p> В эпоху непродолжительного внимания и обновления 280 символов даже обучение должно происходить в крошечных дозах. Вот почему есть создатели контента, которые специализируются на создании информационных и развлекательных материалов, которые почти не занимают времени в нашей напряженной жизни. От мини-документальных фильмов об увлекательных людях и предметах до руководств в социальных сетях по актуальным темам - дайте своему разуму небольшую пищу для мозга, которую можно пережевать. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 60 секунд документов </a> (Интернет): профили интересных людей и тем за 60 секунд </h2> <p> </p> <p> Есть минутка? В 60 Second Docs есть классная история, чтобы рассказать вам об интересном человеке и, в свою очередь, на интересную тему. Каждый документальный фильм длится всего 60 секунд, но он охватывает лучшее, что вам нужно знать по теме. </p> <p> Самое крутое, что 60 Second Docs фокусируется на профилях реальных людей, а не на концепциях или тенденциях. Обычно этот человек делает что-то уникальное, будь то начало новой тенденции, изучение новой темы или каким-то образом раздвигая границы. Делая это о человеке, вы не только лучше понимаете человеческий аспект уникального объекта, но и чувствуете себя более реальным и эмоциональным. </p> <p> Все 60-секундные документы доступны на их канале YouTube или в социальных сетях. Хорошая идея - подписаться на них в любой социальной сети, которую вы часто посещаете, и полностью смотреть каждое новое видео, когда они публикуют обновления. </p> <p> Если вам нравятся более длинные документальные фильмы, посмотрите <strong> Официальный отбор </strong> на сайте 60 Second Docs. Здесь редакторы выбирают 10-20-минутные документальные фильмы, снятые другими, на темы, которые, по их мнению, вам следует смотреть. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Итак, вы хотите поговорить о </a> (Instagram): Мини-справочники по политическим и социальным темам </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> Кто знал, что в мире селфи влиятельных людей и хэштегов, продвигаемых брендами, Instagram станет платформой для обучения? So You Want To Talk About (Sywtta) использует форматы постов с несколькими изображениями Instagram для создания мини-руководств на политические и социальные темы. </p> <p> Темы, которые выбирает Sywtta, обычно связаны с такими актуальными темами, как отмена студенческой ссуды, права и история чернокожих, логические заблуждения, вакцины от COVID-19 и многое другое. На каждом слайде используется красиво оформленная типографика, чтобы познакомить вас с предметом, и, более того, каждый слайд сам по себе похож на мини-урок. Каждое руководство становится быстрым и информативным ускоренным курсом, не перегруженным данными. </p> <p> В то время, когда нужно проявлять бдительность <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> предвзятые или фейковые новости </a> , также важно понимать философию того, что вы читаете. Что касается политики, Sywtta пропагандирует прогрессивные и левые взгляды. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> 60-секундная наука </a> (Подкаст): краткие аудиообъяснения науки, здоровья и технологий </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Если вы предпочитаете слушать свою информацию, чем читать или смотреть, посмотрите подкаст «60-секундная наука». Этот ежедневный подкаст, созданный командой Scientific American, затрагивает темы науки, медицины и технологий и коротко объясняет одну тему. Хотя он больше не ограничивается минутным ограничением по времени, каждый эпизод по-прежнему длится меньше пяти минут. </p> <p> У каждого подкаста есть разные ведущие из команды Scientific American, освещающие такие темы, как COVID, животные и птицы, ДНК и медицина, наука об окружающей среде и т. Д. Они обладают высокой производственной ценностью, включают звуки реального мира по теме обсуждения и часто добавляют голосовые клипы от экспертов. </p> <p> Чтобы просмотреть архивы прошлых серий, зайдите на официальный сайт 60-Second Science. Здесь вы можете отфильтровать эпизоды по темам (здоровье, разум, устойчивость, технологии, наука). Если вам не нужна информация в виде коротких пакетов, попробуйте подкаст Science Talk. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Анимаграффы </a> (Интернет): высококачественная анимированная инфографика для объяснения вещей </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> Как работает криптовалюта? Каковы плюсы и минусы автострахования? Как вы совершаете лунную походку? Дизайнер и аниматор Джейкоб О&#39;Нил разбивает сложные темы на простые объяснения и рисует высококачественную анимированную инфографику для их иллюстрации. </p> <p> Animagraffs - это сборник кратких пояснений в виде наглядных руководств с использованием анимированных GIF-файлов. Джейкоб использует различные методы проектирования, такие как виды в разрезе для иллюстрации каждой части инструмента или большие изображения с движущимися частями, которые можно увеличивать и уменьшать, как в Google Maps. Каждый стиль соответствует предмету, который вы изучаете. </p> <p> У испытуемых также есть широкий диапазон, в том числе то, как бегает гепард, как работают электромобили, как динамик издает звук и так далее. Вам также стоит заглянуть в раздел «Работа с клиентами», где Джейкоб демонстрирует оплачиваемые задания для брендов. Не волнуйтесь, даже если это реклама, она тем не менее информативна и увлекательна. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Великая большая история </a> (YouTube): увлекательные и интересные короткометражные документальные фильмы </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> «Великая большая история» завершила работу в конце 2020 года, но не раньше, чем оставила пять лет восхитительных короткометражных документальных фильмов. Погрузитесь в архивы, чтобы найти примерно 5-минутные видеоролики по ряду интересных тем и интересных людей со всего мира. </p> <p> От фильма, показываемого в индийском кинотеатре в течение 24 лет, до удивительного турецкого мороженого, которое не тает, каждое короткое видео - это качественный и хорошо проработанный взгляд на предмет. В отличие от большинства других подобных видеороликов, создатели видео Great Big Story часто путешествуют по миру, чтобы оказаться в центре сюжета. Сортируйте по наиболее популярным или используйте различные настраиваемые плейлисты, рекомендованные создателями. </p> <p> На канале вы также найдете несколько более длинных видеороликов, продолжительностью от 10 до 15 минут. Обычно это списки и сборники, в которые входят несколько отрывков из более коротких видеороликов. Если у вас есть время, чтобы узнать больше об окружающем мире, вы не ошибетесь с этим. Даже после того, как были опущены ставни, Great Big Story остается одной из самых <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> увлекательные и познавательные каналы на YouTube </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Используйте капельное обучение для изучения больших предметов </h2> <p> Эти веб-сайты и подкасты сосредоточены на превращении каждой новой темы в компактный и развлекательный пакет информации. Это хороший способ узнать что-то новое за небольшие кусочки. Но вы также можете применить ту же философию к изучению более сложных и крупных предметов. </p> <p> Все чаще капельное обучение или микрообучение становится популярным способом получения образования. Получив <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> небольшие уроки каждый день </a> , вы можете заниматься такими темами, как программирование, дизайн, разработка приложений, управление продуктами и т. д. Быстрый поиск в Интернете должен помочь вам найти обучающую версию того, чему вы хотите научиться. </p>"}