{"title":"BitPay переносит биткойны в Apple Pay","content":"<p> Пользователи BitPay в США теперь могут добавлять свои предоплаченные биткойн-карты в приложение Apple Wallet и <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> использовать его для оплаты вещей с помощью Apple Pay </a> . Клиенты, не принадлежащие к Apple, скоро смогут добавлять свои карты BitPay под брендом MasterCard в Google Pay и Samsung Pay. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> Как добавить карту BitPay в Apple Wallet </h2> <p> Чтобы добавить карту BitPay на устройство Apple, откройте приложение Wallet на своем iPhone и нажмите «+» в правом верхнем углу, затем следуйте инструкциям на экране, чтобы завершить добавление карты. </p> <p> С помощью BitPay в приложении Wallet вы можете добавить карту в Apple Pay, перейдя в <strong> Настройки&gt; Кошелек и Apple Pay </strong> , затем коснитесь параметра «Добавить карту». Чтобы стать пользователем BitPay и заказать карту предоплаты, загрузите приложение BitPay Wallet из <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> Магазин приложений </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Новый способ тратить с Apple Pay </h2> <p> Пост на <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> Блог BitPay </a> говорит, что добавление карты BitPay в Apple Pay - это удобный способ тратить криптовалюту в большем количестве мест, чем раньше. «У нас есть тысячи клиентов приложения BitPay Wallet, использующих карту BitPay, которые всегда ищут новые места и способы потратить свои криптовалюты», - сказал генеральный директор BitPay Стивен Пайр. <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> пресс-релиз </a> . </p> <p> </p> <p> С помощью Apple Pay держатели карт BitPay могут совершать безопасные бесконтактные покупки в обычных магазинах, приложениях, поддерживающих Apple Pay, и в Интернете. Компания отмечает, что клиенты, ожидающие доставки пластиковой карты, могут добавить ее виртуальный аналог в Apple Wallet через официальное приложение BitPay Wallet. Это позволит вам немедленно начать тратить. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> Что такое карта BitPay? </h2> <p> Карта предоплаты, которая использует сеть Mastercard, карта BitPay позволяет легко совершать как бесконтактные платежи, так и платежи по PIN-коду, а также снимать наличные в любом совместимом банкомате. С помощью приложения клиенты могут делать такие вещи, как просматривать свой баланс, запрашивать новый PIN-код, мгновенно перезагружать, а также конвертировать криптовалюту в фиатную валюту (которая затем загружается на карту, готовая к использованию везде, где дебетовая карта Mastercard принимается во всем мире). </p> <blockquote> <p> Для мощных пользователей блокчейнов приложение BitPay Wallet поддерживает множество опций для покупки и хранения криптовалюты и совершения онлайн-платежей. Пользователи могут мгновенно покупать подарочные карты в сотнях ведущих розничных продавцов в магазинах и в Интернете. </p> </blockquote> <p> Карта имеет чип EMV и может быть заблокирована в случае возникновения чрезвычайной ситуации с помощью приложения. </p> <p> По заявлению компании, поддержка Google Pay и Samsung Pay запланирована «позднее в этом квартале». Что касается приложения BitPay, в настоящее время оно поддерживает Bitcoin, Bitcoin Cash и Ether, а также четыре стейблкоина с привязкой к доллару, криптовалюты USDC, GUSD, PAX и BUSD. </p>"}