{"title":"Можете ли вы получить Netflix на своем Nintendo Switch?","content":"<p> Похоже, вы можете получить Netflix на любой платформе. Будь то телевизор, телеприставка или телефон, самый популярный в мире потоковый сервис доступен везде, где вы этого хотите. Либо это? </p> <p> Если у вас есть Nintendo Switch, вам может быть интересно, сможете ли вы смотреть Netflix на нем. Давай выясним... </p> <h2 id=\"can-you-watch-netflix-on-the-nintendo-switch\"> Можно ли смотреть Netflix на Nintendo Switch? </h2> <p> <a href=\"https://www.makeuseof.com/nintendo-switch-streaming-services/\" target=\"_blank\" rel=\"nofollow noopener\"> Nintendo Switch поддерживает несколько потоковых сервисов. </a> но Netflix не входит в их число. По крайней мере официально. </p> <p> Это означает, что вы не можете зайти в интернет-магазин и загрузить приложение Netflix. Фактически, на момент написания потоковые услуги, которые Nintendo Switch предлагает через интернет-магазин, ограничены Hulu, YouTube и Funimation. </p> <p> Вы также не можете использовать веб-браузер консоли для просмотра Netflix. Это не сработает. </p> <p> Однако вы можете установить Android на свой Nintendo Switch, а Netflix доступен на Android. Это сложный процесс, который не поддерживается Nintendo. Это приведет к аннулированию гарантии и должно выполняться только пользователями, которые понимают процесс и последствия. </p> <p> Для большинства людей лучше не терять надежды, что Netflix официально поддержит Nintendo Switch в будущем. </p> <p> В интервью 2017 г. <a href=\"https://www.washingtonpost.com/news/the-switch/wp/2017/03/08/nintendos-u-s-ceo-responds-to-our-biggest-gripes-with-the-switch/\" target=\"_blank\" rel=\"nofollow noopener\"> Вашингтон Пост </a> , Тогдашний президент Nintendo of America Реджи Филс-Эйм сказал, что Nintendo разговаривала с Netflix - конечно, с тех пор прошло много времени, и ничего не получилось. </p> <p> </p> <h2 id=\"can-you-watch-netflix-on-other-nintendo-consoles\"> Можно ли смотреть Netflix на других консолях Nintendo? </h2> <p> И Nintendo Wii, и Nintendo Wii U в прошлом имели специальные приложения Netflix. </p> <p> Однако с 31 декабря 2020 года приложение Netflix больше не было доступно новым пользователям для загрузки из интернет-магазина. </p> <p> 30 июня 2021 года приложение Netflix будет полностью закрыто для существующих пользователей. В этот момент ни одна консоль Nintendo не будет поддерживать Netflix. </p> <p> На данный момент вам просто нужно насладиться ограниченными возможностями потокового видео, которые поддерживает Switch, и смотреть Netflix на другом устройстве. </p>"}