{"title":"Компьютерные ролевые игры против классических ролевых игр: что означает CRPG в 2021 году?","content":"<p> История компьютерных ролевых игр - это столько же, сколько и история самих видеоигр, они развивались и растут вместе с годами. И так же, как CRPG развивались, улучшая графику, добавляя или отбрасывая игровую механику, менялись значение и терминология, используемая для их описания. </p> <p> Аббревиатура CRPG, которая традиционно расшифровывалась как Computer Role Playing Game, со временем расширила свое значение, включив в нее RPG для различных платформ. Теперь оно приобрело новое значение. Хотя его новое значение не полностью отличается от первоначального, теперь он описывает определенный поджанр RPG. </p> <h2 id=\"the-history-of-crpgs\"> История CRPG </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> История CRPG началась в 1970-х годах с выпуска самой ранней видеоигровой адаптации настольной RPG Dungeons &amp; Dragons, Dungeon. Изначально игра была доступна на Atari (в нее можно играть через <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, сервис потоковой передачи игр на Plex </a> ). </p> <p> Хотя игровой процесс Dungeon был в основном основан на тексте, он полностью описывал движения вашей многопользовательской группы в фэнтезийной обстановке, при этом реализовывая большинство основных принципов Dungeons &amp; Dragons. </p> <p> Тогда мы назвали их компьютерными ролевыми играми, чтобы отличать их от настольных аналогов, которые были гораздо более популярны в то время, и мы знали их просто как ролевые игры. </p> <p> К 1990-м годам CRPG, находящиеся в полном расцвете, теперь могут полностью отображать фантастический мир, по крайней мере, в перспективе сверху или в изометрической проекции. Так было с Ultima VII, одной из самых интерактивных CRPG, в которую играл этот писатель. </p> <p> Почти все, что вы видите, вы можете перемещать или взаимодействовать: вы можете создавать оружие, играть на инструментах и ​​даже переносить мертвого члена группы из темницы в тронный зал короля, чтобы он воскрес! </p> <p> Baldur&#39;s Gate была одной из тех, которые наиболее точно копировали настольную ролевую игру. Он адаптировал набор правил Dungeons &amp; Dragons 2nd Edition (AKA Advanced Dungeons &amp; Dragons) в изометрическую форму. <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> CRPG с возможностью паузы в реальном времени </a> . Такие CRPG подчеркивали тактику в битве, развитие персонажа, принятие решений и поощряли исследования. </p> <p> </p> <p> Сегодня в мире, где приставки доминируют на рынке, ролевые видеоигры стали более популярными, чем настольные ролевые игры. В той степени, в которой в современном использовании аббревиатура RPG больше относится к версии видеоигры. Вы бы назвали Dungeon&#39;s &amp; Dragons настольной RPG, а не просто RPG. </p> <p> С развитием графики механика игрового процесса CRPG адаптировалась к современным графическим стандартам. Такие серии CRPG, как The Elder Scrolls, Gothic или The Witcher, произвели революцию в жанре, представив одни новые игровые механики и отбросив другие. </p> <p> Эти ролевые игры в большей степени ориентированы на действия и динамичны, они в некоторой степени, хотя и не полностью, относятся к поджанру рубильника и слэша (хотя это все еще солидные РПГ!) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Новая волна CRPG </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> Тем не менее, вопреки тенденции сегодняшней индустрии видеоигр стремиться к графическому реализму, пришла новая волна CRPG. Олдскульные или классические ролевые игры сильно влияют на эти игры, и они делают упор на механику игрового процесса и погружение, а не на визуальные эффекты. </p> <p> Как правило, это изометрические игры с паузами в реальном времени или пошаговыми тактическими боями. Эти CRPG также делают все возможное, чтобы быть максимально захватывающими, предоставляя вам довольно большие блоки хорошо продуманной прозы и солидную предысторию. </p> <p> Большинство из них полагаются на текст, а не на озвучку в большинстве диалогов, как в старых CRPG. Некоторые из этих CRPG включают Pillars of Eternity, Divinity: Original Sin или Pathfinder: Kingmaker. </p> <p> Эти игры также подчеркивают боевую тактику, развитие персонажа, принятие решений и поощряют исследования, как это делали старые CRPG. По этим причинам мы считаем их более близкими к классическим ролевым играм, чем к большинству современных ролевых игр. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> Что означает CRPG в 2021 году </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> С 2000-х годов «RPG» стало стандартным термином для обозначения любой ролевой видеоигры. Но примерно в 2015 году они выпустили Divinity: Original Sin и Pillars of Eternity. </p> <p> Эти ролевые игры были отходом от экшн-ориентированных современных ролевых игр, но при этом были очень похожи на более старые игры как по эстетике, так и по механике игрового процесса. Примерно в это же время возникла необходимость в новом термине, чтобы отделить эти РПГ от современных РПГ. </p> <p> Хотя для описания этих игр в Интернете уже много лет используются термины «старая школа» и «классическая ролевая игра», последняя прижилась. Точно так же, как современные ролевые видеоигры заявили для себя аббревиатуру RPG, люди теперь называют старые школьные RPG «CRPG». </p>"}