{"title":"Canon запускает приложение Photo Culling, которое позволяет находить ваши лучшие снимки","content":"<p> Почти за каждой идеальной фотографией скрывается фотопленка, полная других фотографий, которые выглядят почти так же. Фотографы нередко держат кнопку спуска затвора нажатой, опасаясь пропустить мимолетный момент. </p> <p> Просмотр десятков или, может быть, даже сотен фотографий, чтобы выбрать свои любимые и освободить место для хранения, может оказаться долгим и раздражающим процессом. К счастью, Canon выпустила новое приложение, которое автоматически сделает это за вас. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> Легко делайте фотографии из нескольких лучших </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon США </a> запустила приложение для удаления фотографий на <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> Магазин приложений </a> что позволяет быстро и легко находить свои лучшие фотографии. Само приложение бесплатное, но для его использования вам нужно будет оформить подписку за 14,99 доллара в год или 2,99 доллара в месяц. Оба варианта подписки имеют трехдневную пробную версию. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> Исполнительный вице-президент Canon в США Тацуро «Тони» Кано объясняет: </p> <blockquote> <p> В современном постоянно меняющемся и непреодолимом мире, где тысячи фотографий записываются и хранятся на смартфоне человека, потребителям нужен экспертный, надежный и интуитивно понятный инструмент для обработки фотографий, который поможет им выбрать лучшие фотографии на основе многолетних проверенных знаний и технологий. </p> </blockquote> <p> Приложение Canon, называемое просто Photo Culling, работает на базе искусственного интеллекта, называемого «Photography Intelligence Learning» или сокращенно PHIL. PHIL предлагает, какие фотографии следует сохранить, а какие удалить, в зависимости от того, какой из двух вариантов удаления фотографий вы выбрали. </p> <p> Первый вариант, <strong> Полная выбраковка </strong> , отлично подходит для <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> лучшая портретная фотография </a> . Когда выбран этот параметр, PHIL будет определять ваши лучшие фотографии, оценивая их на основе четырех факторов: резкости, шума, эмоций и того, закрыты ли глаза вашего объекта (если применимо). </p> <p> Между тем <strong> Подобные выбраковки </strong> Эта опция выбирает ваши лучшие снимки, сравнивая оценки между похожими фотографиями. Например, предположим, вы сделали несколько фотографий облаков, а затем несколько фотографий цветов. Приложение разделило бы фотографии облаков и фотографии цветов на отдельные группы. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Какой бы вариант отбраковки вы ни выбрали, если оценка фотографии превышает установленную вами целевую оценку, фотография считается хранимой. Затем PHIL предложит удалить оставшиеся фотографии, получившие недостаточно высокий балл. Если вы не согласны с PHIL, не волнуйтесь. Вы по-прежнему полностью контролируете все свои снимки. </p> <p> </p> <p> Другие функции приложения включают в себя количество фотографий и информацию об отображении места для хранения, фотоальбомы, настройки параметров для оценки фотографий и возможность использования темного режима. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> Вы загрузите приложение Canon Photo Culling? </h2> <p> Казалось бы, в приложении Canon для отбраковки фотографий есть все необходимое, чтобы сделать процесс выбора лучших фотографий менее утомительным. Однако, в конце концов, вам решать, достаточно ли вы ненавидите отбраковку фотографий, чтобы оправдать оплату чего-то, что вы могли бы сделать самостоятельно (хотя, вероятно, очень медленно и скучно). </p> <p> На момент написания приложение недоступно для Android, но, возможно, у Canon это есть в планах на будущее. </p>"}