{"title":"Проверьте версию браузера Microsoft xCloud","content":"<p> Если вы с нетерпением ждали новостей о порте браузера xCloud, то сегодня ваш счастливый день, потому что вы можете взглянуть, как это на самом деле выглядит. </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> Тестеры показывают скриншоты браузера xCloud </h2> <p> xCloud в настоящее время доступен на ряде устройств, но мы все еще ждем, когда Microsoft официально выпустит версию браузера. </p> <p> Детали были довольно скудными ... до сих пор. Согласно отчету <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> Грани </a> &quot;источники, знакомые с планами Microsoft Xbox&quot; утверждают, что &quot;сотрудники сейчас тестируют веб-версию xCloud перед общедоступной предварительной версией&quot;. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Вот первый взгляд на Microsoft xCloud для Интернета <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> - Грань (@verge) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> 15 февраля 2021 г. </a></blockquote>  <p> Не забывайте, что это только изображения от тестировщиков, а это означает, что - хотя это маловероятно - Microsoft может полностью изменить внешний вид версии браузера xCloud. </p> <p> Судя по скриншотам, похоже, что xCloud настроен так же, как версия для Android, доступная на смартфонах и планшетах. </p> <p> Вы можете увидеть недавно добавленные игры в верхней части скриншота, за которыми следует раздел «Скоро в продаже». Ниже у вас есть различные варианты выбора жанра игры по вашему выбору, с полной библиотекой игр xCloud, доступной внизу страницы. </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> Как получить доступ к xCloud в браузере? </h2> <p> В настоящее время вы не можете. Публичная версия веб-порта xCloud пока недоступна. Это означает, что вам придется подождать еще немного, если вы хотите получить доступ к xCloud через браузер. Предположительно Microsoft планирует публично раскрыть эту услугу во втором квартале 2021 года. </p> <p> А пока вам придется найти другие способы доступа к xCloud. В настоящее время вы можете получить доступ к облачному игровому сервису только на устройствах Android (для игры на iOS вам нужна версия браузера, благодаря <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> ссора между Apple и Microsoft </a> ). </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> Можно ли получить доступ к играм xCloud любым другим способом? </h2> <p> Ну да и нет. Вы не можете получить доступ к каким-либо заголовкам на xCloud, так сказать. Нет, если вы не используете для этого устройство Android и официальное приложение Game Pass. </p> <p> Однако все игры, доступные в облачном игровом сервисе Microsoft, доступны в Game Pass. Фактически, вы получаете доступ к xCloud как часть подписки Game Pass Ultimate. Таким образом, вы по-прежнему можете получить доступ к этим играм через Xbox или ПК с Windows. </p> <p> Одним словом, да. Вы можете получить доступ к этим играм другим способом. Просто не используйте xCloud, если у вас нет доступа к версии Android. </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud: скоро появится на устройстве iOS рядом с вами </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> Вам не придется долго ждать, пока вы получите облачную игровую платформу Microsoft. После того, как xCloud пройдет тестирование, Microsoft внесет все необходимые изменения, прежде чем позволить нам всем взглянуть и, надеюсь, вскоре после этого, поиграть в него. </p>"}