{"title":"DeviantArt добавляет в свое мобильное приложение боковую панель и группы","content":"<p> У каждого художника есть свой уникальный творческий процесс, но обычным явлением - особенно в сегодняшнюю цифровую эпоху - является то, что последним шагом этого процесса является публикация готовой работы в Интернете. </p> <p> Прошли те времена, когда вам нужно было искать музеи, в которых ваши картины или фотографии будут выставлены на обозрение людей. Вместо этого выберите платформу, которая вам больше всего нравится, и публикуйте сообщения! </p> <p> DeviantArt, основанная в 2000 году, является одним из старейших арт-сообществ в Интернете. DeviantArt запустила свое мобильное приложение в 2017 году, и его последнее обновление небольшое, но важное. </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt для мобильных устройств улучшает навигацию </h2> <p> DeviantArt улучшила пользовательский интерфейс своего мобильного приложения, добавив боковую панель, очень похожую на ту, что есть на веб-сайте DeviantArt. Боковая панель обеспечивает быстрый доступ к домашней странице, извращенцам (артистам), за которыми вы подписаны, и группам. </p> <p> <strong class=\"gallery__section-title\"> Галерея изображений (2 изображения) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> Расширять <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <p> Доступ к последнему элементу в этом списке особенно примечателен, потому что до этого обновления группы DeviantArt были доступны только на веб-сайте. Группы DeviantArt работают аналогично <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> Группы в фейсбуке </a> - коллекции пользователей, объединившихся на платформе с общими интересами или целями. </p> <p> На боковой панели вы можете нажать <strong> Мои группы </strong> для просмотра всех групп, в которых вы состоите, или <strong> Рекомендуемые группы </strong> для просмотра групп, которые, по мнению DeviantArt, вам подойдут. Вы также можете закрепить свои любимые группы в верхней части боковой панели для облегчения доступа. </p> <p> Если у вас есть собственная группа, она может появиться в рекомендованном разделе для других девиантов, которые могут быть заинтересованы в присоединении. Если вас не интересует группа, вы можете нажать на три точки справа от ее названия, чтобы удалить рекомендацию. </p> <p> Когда вы посещаете группу в приложении, вы видите как ее отклонения (отправленные материалы), так и сообщения. Администраторы групп могут публиковать обновления для своей группы из ленты сообщений. </p> <p> <strong> Скачать: </strong> DeviantArt для <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> (Бесплатно) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> Где вы делитесь своими творениями в Интернете? </h2> <p> Если вы художник, дизайнер или фотограф, который давно работает в Интернете, скорее всего, вы когда-то были на DeviantArt. Сообщество не выглядит таким оживленным, как в начале 2000-х, но в последние годы количество присланных работ резко возросло. </p> <p> С такой активной пользовательской базой для DeviantArt крайне важно улучшить свое мобильное приложение. На момент написания приложение имеет рейтинг 2.6 / 5.0 в App Store и 3.2 / 5.0 в Google Play. </p>"}