{"title":"Disney + приближается к 100 миллионам подписчиков","content":"<p> Никогда не недооценивайте Дисней. В то время как Disney + был запущен в США только в ноябре 2019 года, сервис потоковой передачи теперь имеет почти 100 миллионов подписчиков. Такого роста не ожидала даже компания. </p> <h2 id=\"how-many-customers-does-disney-have\"> Сколько клиентов у Disney +? </h2> <p> Как было объявлено в <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Отчет Disney о доходах за 1 квартал 2021 года </a> , Disney + имеет 94,9 миллиона подписчиков по всему миру по состоянию на 2 января 2021 года. </p> <p> Это означает, что эта цифра не учитывает количество подписчиков, полученных в результате успешного выпуска WandaVision. Было бы несправедливо предположить, что у Disney + сейчас более 100 миллионов подписчиков. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Последние цифры были опубликованы в декабре 2020 года, когда Disney объявила, что получила 86 миллионов подписчиков на свой титульный стриминговый сервис. С тех пор скачок, вероятно, можно объяснить сильным эксклюзивным контентом, таким как второй сезон «Мандалорца» и полнометражный фильм Pixar «Душа». </p> <p> Средний ежемесячный доход на одного подписчика упал с 5,56 доллара в прошлом году до 4,04 доллара сегодня, что в основном объясняется более низкой стоимостью услуги в Индии и Индонезии. </p> <p> Стриминговые сервисы Hulu и ESPN +, также принадлежащие Disney, также продемонстрировали значительный рост. Первый вырос на 30% в годовом исчислении до 39,4 миллиона подписчиков, а второй вырос на 83% в годовом исчислении, в общей сложности 12,1 миллиона подписчиков. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney недавно запустила пакет, объединяющий все свои потоковые сервисы. </a> , поэтому ясно, что компания продолжает поддерживать всех трех. </p> <p> Star также скоро появится во многих регионах, что значительно повысит количество фильмов и телешоу, которые предлагает Disney +. </p>"}