{"title":"Войдите в третье измерение: работа с 3D-рабочими процессами в Adobe After Effects","content":"<p> Если вы хотите улучшить рабочий процесс Adobe After Effects, вам в конечном итоге придется начать работать с осью Z, что позволит вам управлять глубиной 3D объекта. </p> <p> Это открывает для вас ряд новых визуальных эффектов и стилей, но также создает свои собственные наборы ограничений и соображений. </p> <p> В этой статье мы расскажем, как включать и работать с 3D-слоями, а также как добавлять и анимировать 3D-камеры для создания динамических движений. Также будет рассмотрен сценарий, в котором мы анимируем и перемещаем текст в трехмерном пространстве. </p> <p> Давайте прыгнем! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> Как включить и анимировать 3D-слои </h2> <p> В своей композиции вы можете переключать слои на временной шкале, чтобы включить их как 3D. </p> <p> Это очень простой процесс. Просто найдите <strong> Куб </strong> значок для ваших слоев на шкале времени и щелкните поле под ним, чтобы включить 3D для этого слоя. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> Как только это будет сделано, вы, скорее всего, не увидите никаких немедленных изменений. Однако, если вы перейдете к своим параметрам положения, масштаба и поворота на своем слое, вы увидите, что появился третий набор регулируемых чисел. </p> <p> Эти новые числа теперь определяют ваше вращение, положение и масштаб по оси Z в трехмерном пространстве. Как и другие параметры, они могут быть ключевыми кадрами для анимации и манипуляции. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> В качестве примера создадим композицию и текстовый слой с несколькими словами. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Как только это будет сделано, включите 3D-слой. Обратите внимание: если вы планируете использовать <strong> Выровнять </strong> инструмент, чтобы убедиться, что ваш слой идеально отцентрован, вам нужно сделать это перед включением 3D. Это потому, что <strong> Выровнять </strong> инструмент работает только с 2D-слоями. </p> <p> Теперь, когда наш текстовый слой является трехмерным, мы можем перемещать его в трехмерном пространстве по оси Z. Итак, давайте переместим текст «к экрану». </p> <p> Сначала мы установим наш параметр оси Z. По умолчанию он установлен на ноль. Давай установим это на <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Теперь мы переместимся на две секунды вниз по нашей временной шкале и установим для нашего значения оси Z значение <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> После этого изменения мы должны теперь видеть, как текст перемещается «по направлению» к экрану. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> Что такое 3D-камеры? </h2> <p> Мы успешно анимировали объект в трехмерном пространстве в After Effects. Но что, если у вас есть несколько объектов, и вы хотите создать ощущение движения зрителя к ним или от них? </p> <p> Вы можете просто анимировать каждый отдельный элемент, чтобы он двигался к вам, но это будет значительно трудоемко и не особенно эффективно. Здесь вы можете использовать 3D-камеру. </p> <p> </p> <p> Если вы используете программное обеспечение для 3D, такое как Cinema 4D или Blender, скорее всего, вы уже использовали 3D-камеры раньше. Если вы когда-либо играли в компьютерную игру, вы также испытали трехмерную камеру, которая перемещает ваш взгляд в трехмерном мире. </p> <p> Поначалу все это может показаться сложным, но 3D-камеры работают так же, как настоящая камера. Они дают вам поле обзора, которым можно управлять и перемещать в трехмерном пространстве. </p> <p> Давайте поработаем на примере. </p> <h3 id=\"setting-up-a-3d-camera\"> Настройка 3D-камеры </h3> <p> Для начала создайте несколько слоев трехмерного текста и расположите их последовательно по оси Z. </p> <p> В этом примере пробел в <strong> 3000 пикселей </strong> между каждым слоем был использован. Первый уровень находится на нуле, следующий - на 3000, следующий - на 6000 и так далее. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Теперь пора создать 3D-камеру, нажав <strong> Слой </strong> &gt; <strong> Новый </strong> &gt; <strong> Камера </strong> , в котором вы увидите окно для настройки параметров вашего нового слоя камеры. Они бывают двух типов: <strong> Один узел </strong> а также <strong> Два узла </strong> . </p> <p> В <strong> Один узел </strong> Камера предназначена для работы и имитации реальной камеры в максимально возможной степени, а точка фокусировки определяется вручную путем движения камеры. </p> <p> А <strong> Два узла </strong> Камера предназначена для отслеживания одной интересующей точки, что делает ее идеальной для полета по орбите или слежения за движущимся объектом. </p> <p> В этом сценарии <strong> Один узел </strong> камера будет использоваться. Вы заметите в окне ряд дополнительных настроек, таких как <strong> Увеличить </strong> , <strong> Угол обзора </strong> , <strong> Включить глубину резкости </strong> , а также <strong> Фокусное расстояние </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Они предназначены для отражения реальных настроек камеры. Если вы разбираетесь в том, как они работают, не стесняйтесь экспериментировать с ними. Если нет, вы можете выбрать серию предустановок в правом верхнем углу. </p> <p> Мы собираемся выбрать <strong> 35 мм </strong> предустановка на данный момент. Теперь, когда наш слой камеры настроен и находится в сцене, вы сначала не заметите большой разницы. </p> <h3 id=\"using-3d-camera-navigation\"> Использование 3D-навигации по камере </h3> <p> Существует два метода настройки и анимации обзора камеры. Самый точный - ввод разных <strong> Должность </strong> ценности в <strong> Преобразовать </strong> настройки для слоя камеры. Затем вы можете использовать ключевые кадры, как при анимации любого другого слоя. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> Когда вы перемещаете камеру, вы заметите, что все другие 3D-объекты в вашей сцене будут перемещаться относительно нее. Обратите внимание, что камера <strong> не влияет на 2D-слои </strong> . </p> <p> Итак, давайте настроим нашу камеру на перемещение по оси Z от нуля до 9000 в течение четырехсекундного интервала и создадим ключевые кадры для нашего движения. </p> <p> Вот оно что! Если вы настроили его правильно, слова должны подталкивать «к вам», «через» поле зрения и «позади» зрителя. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> Другие способы перемещения 3D-камеры </h3> <p> Если вы предпочитаете немного больше экспериментировать и меньше ориентироваться на числа с помощью камеры, есть другие средства для перемещения, навигации и настройки. В <strong> Орбита </strong> , <strong> Кастрюля </strong> , а также <strong> Долли </strong> инструменты в верхней части панели инструментов позволяют это сделать. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> Используя их, вы можете щелкнуть и перетащить, чтобы перемещаться из стороны в сторону ( <strong> Кастрюля) </strong> , повернуть вокруг ( <strong> Орбита </strong> ), а также увеличивать и уменьшать масштаб ( <strong> Долли </strong> ). Эти элементы управления менее точны, чем ввод чисел, но они отлично подходят для планирования грубых движений камеры и анимации. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> Практика ведет к совершенству </h2> <p> Теперь у вас должна быть возможность создавать и анимировать 3D-слои по оси Z, а также работать с 3D-камерами для навигации с несколькими 3D-объектами. </p> <p> Если вам нравится работать в трехмерном пространстве, возможно, вы захотите изучить более продвинутые возможности, которые может предложить более специализированная часть программного обеспечения для 3D, например Blender. </p>"}