{"title":"Марк Цукерберг из Facebook лично принял меры по защите конфиденциальности Apple","content":"<p> Генеральный директор Facebook Марк Цукерберг, как сообщается, сказал сотрудникам Facebook, что «нам нужно причинить боль» Apple за то, что она так плохо обращалась с гигантом социальных сетей, <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> Wall Street Journal </a> отчеты. </p> <p> Цукерберг предположительно сделал комментарий в 2018 году после того, как руководители Apple и Facebook столкнулись с скандалом с Cambridge Analytica, в ходе которого к личным данным миллионов пользователей Facebook был осуществлен доступ без их согласия в целях политической рекламы. </p> <h2 id=\"apple-vs-facebook\"> Apple против Facebook </h2> <p> В то время генерального директора Apple Тима Кука в интервью спросили, как он отреагировал бы, если бы оказался в ситуации Цукерберга перед лицом кризиса. «Я бы не оказался в этой ситуации», - сказал Кук. </p> <p> Wall Street Journal утверждает, что, хотя Цукерберг отметил, что слова Кука были «чрезвычайно бойкими» и «совсем не совпадающими с правдой», за кулисами он был значительно резче в своей оценке. </p> <p> С тех пор отношения между двумя технологическими компаниями не улучшились. Apple удвоила свою позицию, ориентированную на конфиденциальность, при этом Кук объявил конфиденциальность одним из <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> самые насущные проблемы мира </a> . iOS 14 содержит несколько функций, связанных с конфиденциальностью, с которыми Facebook не согласен, утверждая, что они могут нанести ущерб малому бизнесу. </p> <p> Во время последнего ежеквартального звонка инвесторам Facebook Цукерберг назвал Apple &quot; <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> один из крупнейших конкурентов [Facebook] </a> «в результате этих новых мер защиты конфиденциальности». Apple может сказать, что делает это, чтобы помочь людям, но эти шаги явно соответствуют их конкурентным интересам », - сказал Цукерберг. </p> <p> </p> <p> Facebook якобы готовит антимонопольное дело против Apple, которое превратит перестрелку между двумя титанами Кремниевой долины в настоящую судебную тяжбу. В отчете Wall Street Journal отмечается, что «потенциальные регулирующие соглашения и судебные решения, вероятно, затронут сотни миллионов телефонов потребителей в ближайшие годы». </p> <p> </p> <h2 id=\"different-approaches\"> Разные подходы </h2> <p> Представитель Facebook Дэни Левер сообщил Wall Street Journal, что «Apple утверждает, что речь идет о конфиденциальности, но о прибыли, и мы присоединяемся к другим, чтобы указать на их предпочтение и антиконкурентное поведение». Она сказала, что Facebook «сознательно противостоит Apple» от имени малых предприятий и разработчиков, пострадавших от функции Apple App Privacy. </p> <p> Хотя Левер отрицал, что битва между двумя компаниями носит личный характер, она абсолютно выходит за рамки нескольких спорных моментов между двумя крупными технологическими компаниями. Бизнес-модель Facebook, финансируемая за счет рекламы, сильно отличается от модели Apple, финансируемой за счет аппаратного обеспечения. Ни одна из двух компаний - или их руководители - вряд ли откажутся от своих основных убеждений о том, как строить будущее технологий. </p> <p> Тот факт, что генеральный директор Apple Тим Кук обсуждает конфиденциальность с моральной точки зрения, показывает, насколько это действительно личное, с одной стороны. </p> <p> <small> Кредит изображения: Википедия / <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Энтони Кинтано CC </a></small> </p>"}