{"title":"Google добавляет поддержку Face ID в Chrome для iOS","content":"<p> Google тестирует новую функцию безопасности в Chrome 89 для iOS, которая использует биометрическую аутентификацию iPhone для защиты вкладок частного просмотра. В настоящее время доступно только для пользователей бета-канала Chrome, это позволит вам заблокировать вкладки в режиме инкогнито с помощью Face ID или Touch ID. </p> <h2 id=\"even-more-private-private-browsing\"> Еще более частный приватный просмотр </h2> <p> Все вкладки в режиме инкогнито, защищенные Face или Touch ID, размываются в переключателе вкладок. Заблокированные вкладки снова становятся видимыми после подтверждения биометрической аутентификации iPhone. </p> <p> Эта полезная функция не только повышает вашу конфиденциальность, но и укрепляет вашу безопасность, поскольку вы работаете одновременно с несколькими приложениями на iPhone или iPad. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> отмечает, что не все пользователи бета-версии могут получить доступ к новой опции блокировки из-за серверного компонента. </p> <p> </p> <h2 id=\"how-s-this-useful\"> Как это полезно? </h2> <p> Это также полезно в тех случаях, когда друг может попросить одолжить ваш iPhone, чтобы быстро найти что-нибудь в Интернете. Благодаря защите Face ID для режима частного просмотра Chrome они не смогут видеть ваши открытые веб-сайты в режиме инкогнито при переключении вкладок. </p> <p> </p> <p> «Инкогнито» - это маркетинговое название режима приватного просмотра в Chrome. В режиме инкогнито вы можете просматривать веб-страницы без сохранения в Chrome информации о сеансе. Когда вы закрываете окно в режиме инкогнито, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> вся информация об этом сеансе исчезнет </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> Как включить Face или Touch ID в Chrome </h2> <p> Эту новую функцию необходимо вручную включить в разделе «Конфиденциальность» в настройках приложения Chrome. Аналогичная блокировка конфиденциальности присутствует и в других приложениях Google. </p> <p> Например, в собственном приложении Search биометрическая аутентификация iPhone подтверждает вашу личность при возвращении в сеанс инкогнито через 15 минут. Дополнительная аутентификация Face или Touch ID также доступна на Google Диске для защиты ваших файлов при выходе из приложения. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> Когда будет официально выпущена функция? </h2> <p> Пока нет информации, когда новая опция блокировки может быть запущена для всех, но ожидается, что Chrome 89 выйдет для публичного использования в следующем месяце. Google также может решить не выпускать эту функцию вообще, несмотря на то, что она указана в официальных примечаниях к выпуску. </p>"}