{"title":"Как получить доступ к статистике игрового процесса на PS4 и PS5 за 2020 год","content":"<p> Sony выпустила обзор PlayStation Wrap-Up, который позволяет вам поразмышлять о своем путешествии по PlayStation за последний год. </p> <p> Мы расскажем вам, как получить доступ к этому опыту, и познакомим вас с некоторыми требованиями. </p> <h2 id=\"what-is-playstation-wrap-up\"> Что такое итоговая информация о PlayStation? </h2> <p> Как мы сообщали, <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation Wrap-Up - итоги вашего последнего года игр </a> . </p> <p> Это персонализированная страница, на которой подробно описаны ваши игровые привычки на PS4 и PS5, в том числе сколько игр вы сыграли, сколько времени вы провели в них и сколько трофеев заработали. </p> <p> Вы также можете получить бесплатную динамическую тему с фигурами PlayStation. Как ни странно, это доступно только для PS4, а не для недавно выпущенной PS5. </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> Как получить доступ к обзору PlayStation Wrap-Up </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> Чтобы просмотреть свой отчет, перейдите на <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> Веб-сайт PlayStation Wrap-Up </a> . Вам нужно будет войти в свою учетную запись Sony, если вы еще этого не сделали. Оказавшись на странице, вы можете прокрутить вниз, чтобы просмотреть свою статистику и активировать тему PS4. </p> <p> Подведение итогов будет доступно только до 2 марта 2021 года. Поэтому не откладывайте, если хотите принять участие. </p> <p> Чтобы использовать PlayStation Wrap-Up, вы должны выполнить следующие условия: </p> <ul> <li> Иметь зарегистрированную учетную запись PSN в вашем регионе. </li> <li> Быть в возрасте 18 лет и старше. </li> <li> Играли в игры не менее 10 часов на консоли PS4 с 1 января 2020 г. по 31 декабря 2020 г. </li> </ul> <p> Кроме того, пользователи в Европе, на Ближнем Востоке, в Африке, Австралии, Индии и России должны были включить сбор <strong> Дополнительная информация </strong> . Вы можете включить это на PS4 через <strong> Настройки </strong> &gt; <strong> Данные устройства / Здоровье и безопасность </strong> &gt; <strong> Данные устройства </strong> . </p> <p> Наконец, вы можете получить электронное письмо с итоговым отчетом о PlayStation. Однако вы должны были согласиться на получение маркетинговых писем, что можно сделать через <strong> Настройки уведомлений </strong> в вашей учетной записи PSN. </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> Будет ли завершено 2021 год? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> Sony уже второй год подряд проводит итоговую оценку. Поскольку он анализирует только данные за 2020 год, он больше ориентирован на PS4. </p> <p> Надеюсь, Sony сделает это снова в следующем году, когда PS5 будет отсутствовать дольше и будет выпущено больше игр. </p>"}