{"title":"Как сделать снимок экрана на планшете Surface Pro","content":"<p> Создание снимка экрана - простой, но важный навык на любом устройстве. На планшете Surface Pro вы можете делать снимки экрана с помощью сочетаний клавиш, инструмента для обрезки или даже игровой панели Xbox. Мы покажем вам, как использовать все эти методы, чтобы сделать снимок экрана или даже запись экрана на вашем устройстве Surface. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Создание снимка экрана с помощью комбинаций кнопок </h2> <p> На устройствах линейки Surface Pro сделать снимок экрана с помощью комбинаций кнопок можно быстро и легко. Чтобы сделать снимок экрана, удерживайте <strong> Мощность </strong> а также <strong> Увеличить громкость </strong> ключ одновременно. Экран должен мигать, и снимок экрана должен быть сохранен в папке снимков экрана в разделе «Изображения» на вашем устройстве. </p> <p> Этот метод работает для последней линейки устройств Surface Pro (например, Surface Pro 7+, Pro X), Surface Go, Surface Go 2 и линейки устройств Surface Book. </p> <p> Если у вас Surface более старая модель (Surface 3 или старше), комбинация кнопок немного отличается. Вы должны нажать <strong> Кнопка Windows </strong> (не клавиша Windows на клавиатуре) и <strong> Звук тише </strong> кнопку одновременно. Устройство сохранит ваш снимок экрана в папке «Снимки экрана» в разделе «Фотографии». </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> Точно так же, чтобы сделать снимок экрана на Surface Duo, удерживайте <strong> Мощность </strong> кнопка и <strong> Звук тише </strong> ключ. Снимок экрана должен быть сохранен в галерее вашего устройства в разделе Скриншоты. В качестве альтернативы вы можете просто удерживать <strong> Мощность </strong> ключ и щелкните <strong> Скриншот </strong> кнопку на экране. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> Как сделать снимок экрана Surface Pro с помощью сочетаний клавиш </h2> <p> Сочетания клавиш - это еще один способ захвата изображения на экране. </p> <p> Эти сочетания клавиш работают на всех устройствах Windows, поэтому обратите внимание <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> другие методы создания снимков экрана в Windows 10 </a> . Сочетания клавиш лучше всего работают на устройствах линейки Surface Laptop и Surface Book, но, конечно, если у вас есть прикрепленная клавиатура для устройства Surface Pro или Go, эти сочетания клавиш также работают. </p> <h3 id=\"print-screen-methods\"> Способы печати экрана </h3> <p> Чтобы сделать снимок экрана с помощью метода Print Screen, просто нажмите кнопку <strong> PrtScn </strong> кнопку на клавиатуре. Это сделает снимок экрана всего вашего рабочего стола. Обратите внимание, что это не сохранит снимок экрана на Surface, а добавит его в буфер обмена. Вы должны использовать такую ​​программу, как Microsoft Paint, чтобы вставить снимок экрана. </p> <p> Нажатие <strong> Alt + PrtScn </strong> сделает снимок экрана только текущего окна и аналогичным образом добавит снимок в буфер обмена. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Снимок и набросок </h3> <p> Это, безусловно, самый простой способ сделать снимок экрана на устройстве Surface. </p> <p> Чтобы открыть Snip and Sketch, нажмите кнопку <strong> Клавиша Windows + Shift + S, </strong> и на вашем экране должен появиться оверлей. Чтобы сделать полный снимок экрана, нажмите кнопку «Полноэкранный режим» в верхней части оверлея. Чтобы сделать снимок экрана только текущего окна, нажмите кнопку Window Snip рядом с кнопкой Fullscreen. </p> <p> Вы также можете сделать снимок экрана определенной области экрана. По умолчанию Snip and Sketch имеет Прямоугольный Snip. Просто перетащите часть, снимок экрана которой хотите сделать, с помощью сенсорного экрана или трекпада. </p> <p> Snip and Sketch выдаст вам уведомление на панели уведомлений о том, что ваш снимок экрана скопирован в буфер обмена. Если вы нажмете на нее, вы можете рисовать и делать наброски поверх снимка экрана, если хотите. </p> <p> Чтобы сохранить его в свои файлы, используйте <strong> Ctrl + S </strong> или кнопку «Сохранить» в правом верхнем углу, чтобы сохранить снимок экрана в определенной папке. </p> <h3 id=\"xbox-game-bar\"> Панель игр Xbox </h3> <p> Чтобы сделать снимок экрана с помощью Xbox Game Bar, нажмите кнопку <strong> Клавиша Windows + G </strong> чтобы открыть его. </p> <p> Оттуда вы можете щелкнуть вкладку «Снимки» и нажать кнопку «Камера». Этот метод также позволит вам снимать видео с экрана со звуком. Ваши сохраненные снимки появятся в папке «Видео» и в подпапке «Снимки». На Xbox вы можете аналогичным образом <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> снимать скриншоты и делать записи </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Создание снимка экрана Surface Pro с помощью Surface Pen </h2> <p> Чтобы сделать снимок экрана с помощью Surface Pen, просто дважды щелкните ластик, и на вашем устройстве должны появиться фрагменты и эскиз всего окна. Отсюда вы можете сделать набросок и экспортировать снимок экрана. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> Вы также можете получить к нему доступ, выполнив поиск Windows Ink Workspace на своей док-станции. Отсюда выберите Full-Screen Snip. Вы можете изменить то, что делают ярлыки кнопок вашего Surface Pen, выполнив поиск по параметрам Windows Ink Workspace и прокрутив вниз до Windows Ink Workspace. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Сделать снимок экрана на поверхности стало проще </h2> <p> Теперь вы знаете все различные методы создания снимков экрана или записи экрана на устройстве Surface. Комбинации кнопок - лучший тактильный способ сделать снимок экрана, если вы используете Surface Pro или Surface Go, но сочетания клавиш также просты. </p>"}