{"title":"Как узнать, кто подписан на вас на Facebook","content":"<p> Если вы заботитесь о том, чтобы получить больше подписчиков на Facebook так же, как вам нравится растить друзей на Facebook, тогда вы можете увидеть, кто подписывается на вас на Facebook. Вы можете легко сделать это как на компьютере, так и на мобильном телефоне. </p> <p> Вот как узнать, сколько у вас подписчиков на Facebook. </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-desktop\"> Как узнать, кто подписан на вас на Facebook (Рабочий стол) </h2> <p> На рабочем столе вы можете видеть, кто подписан на вас в Facebook, но не количество подписчиков. Однако мобильное приложение Facebook позволяет вам видеть, кто подписан на вас и сколько ваших подписчиков. </p> <p> <img alt=\"Facebook profile interface with friends\" src=\"images/click-more-and-select-followers-786.jpg\" loading=\"lazy\"> </p> <p> Сначала войдите в свой <a href=\"https://web.facebook.com\" target=\"_blank\" rel=\"nofollow noopener\"> аккаунт в Фэйсбуке </a> через браузер и используйте следующие инструкции, чтобы увидеть своих подписчиков в Facebook: </p> <ol> <li> После входа в систему нажмите кнопку <strong> маленький значок изображения </strong> рядом с вашим именем на боковой панели. </li> <li> В меню профиля щелкните <strong> Друзья </strong> . </li> <li> В меню «Друзья» щелкните значок <strong> Более </strong> раскрывающийся список справа. </li> <li> В раскрывающемся списке выберите <strong> Подписчики </strong> для просмотра всех ваших подписчиков в Facebook. </li> </ol> <p> </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-mobile\"> Как узнать, кто подписан на вас на Facebook (мобильный) </h2> <p> Как мы заявляли ранее, мобильное приложение Facebook позволяет вам получить доступ к списку и количеству людей, подписанных на вас на Facebook. </p> <p> <strong class=\"gallery__section-title\"> Галерея изображений (3 изображения) </strong> <img alt=\"Facebook profile about info menu\" src=\"images/tap-see-your-about-info-732.png\" loading=\"lazy\"> Расширять <img alt=\"Mobile Facebook interface displaying Facebook followers\" src=\"images/tap-see-all-to-load-a-list-of-your-followers-895.png\" loading=\"lazy\"> Расширять <img alt=\"Mobile Facebook page displaying a list of followers and their numbers\" src=\"images/look-to-the-upper-right-corner-to-see-the-number-of-followers-677.png\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <p> Войдите в свою учетную запись Facebook через мобильное приложение. Затем следуйте этим инструкциям: </p> <ol> <li> На главной странице мобильного приложения коснитесь круглого значка изображения рядом с <strong> Что у тебя на уме? </strong> панель поиска для загрузки вашего профиля. </li> <li> В меню профиля коснитесь <strong> См. Информацию о вас </strong> . </li> <li> Прокрутите страницу вниз. Тогда под <strong> Подписчики </strong> , кран <strong> Увидеть все </strong> чтобы загрузить список всех ваших подписчиков на Facebook. </li> <li> Посмотрите в правый верхний угол страницы (напротив <strong> Подписчики </strong> ), чтобы увидеть количество подписчиков на вас в Facebook. </li> </ol> <p> У вас не будет возможности проверить своих подписчиков в Facebook, если у вас их нет. В результате выполнение описанных выше шагов не позволит вам проверить своих подписчиков, так как их нет. </p> <p> Вы также можете не получить эту опцию, если ваша учетная запись Facebook новая, поскольку у вас, скорее всего, еще нет подписчиков. Или вам может понадобиться <a href=\"https://www.makeuseof.com/tag/quickly-switch-facebook-profiles/\" target=\"_blank\" rel=\"nofollow noopener\"> переключиться на другую учетную запись Facebook </a> . Кроме того, ваша учетная запись может быть не настроена так, чтобы люди могли подписаться на вас в Facebook - мы объясним, как это изменить ниже. </p> <p> </p> <p> </p> <h2 id=\"how-to-give-the-public-access-to-follow-you-on-facebook\"> Как предоставить публичный доступ, чтобы подписаться на вас в Facebook </h2> <p> Иногда, если вы запретили публике следить за вами, это ограничивает шансы получить больше подписчиков в Facebook. </p> <p> Это потому, что люди, которых нет в вашем списке друзей, не могут подписаться на вас в Facebook, если вы им не позволите. Однако вы можете установить для своего предпочтения подписки значение «Общедоступно», чтобы любой мог подписаться на вас, а не только на ваших друзей. </p> <p> <strong> Для этого на рабочем столе: </strong> </p> <p> <img alt=\"Facebook privacy settings page\" src=\"images/click-on-public-post-and-change-who-can-follow-you-to-public-880.jpg\" loading=\"lazy\"> </p> <ol> <li> Зайдите в свой профиль. </li> <li> Щелкните значок <strong> круглый выпадающий значок </strong> в правом верхнем углу строки меню. </li> <li> Из списка выберите <strong> Настройки и конфиденциальность </strong> . </li> <li> Нажмите <strong> Настройки </strong> . </li> <li> На боковой панели меню настроек нажмите <strong> Публичные сообщения </strong> . </li> <li> Посмотрите вправо от <strong> Кто может следовать за мной </strong> вариант и щелкните <strong> Друзья </strong> падать. </li> <li> Выбирать <strong> Общественные </strong> чтобы предоставить доступ к подписке для всех, в том числе для тех, кто не является вашими друзьями на Facebook. </li> </ol> <p> <strong> Для этого в мобильном приложении Facebook: </strong> </p> <p> <strong class=\"gallery__section-title\"> Галерея изображений (3 изображения) </strong> <img alt=\"Facebook menu list\" src=\"images/tap-the-three-menu-bars-and-go-to-settings-170.png\" loading=\"lazy\"> Расширять <img alt=\"Facebook settings list\" src=\"images/scroll-down-and-select-public-posts-754.png\" loading=\"lazy\"> Расширять <img alt=\"Facebook followers settings page\" src=\"images/tick-the-public-option-under-who-can-follow-728.png\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <ol> <li> Откройте мобильное приложение Facebook и коснитесь <strong> три горизонтальных строки меню </strong> справа от главной страницы. </li> <li> Прокрутите вниз и выберите <strong> Настройки </strong> . </li> <li> Кран <strong> Публичные сообщения </strong> . </li> <li> Под <strong> Кто может следовать за мной </strong> , ТИК <strong> Общественные </strong> . </li> </ol> <p> </p> <h2 id=\"keep-control-over-your-facebook-followers\"> Держите под контролем своих подписчиков в Facebook </h2> <p> Если вы используете Facebook для продвижения своего бренда или бизнеса, необходимо отслеживать своих подписчиков. Это хороший способ модерировать то, что о вас видят люди. </p> <p> Если вы хотите больше контролировать своих друзей и подписчиков в Facebook, вам следует подумать о том, чтобы скрыть их из своей ленты. </p>"}