{"title":"Как использовать приложение Apple Watch Workout","content":"<p> Вы сможете лучше понять свой прогресс в фитнесе, просто коснувшись Apple Watch. </p> <p> Мы изучаем все, что может предложить приложение Apple Watch Workout, в том числе то, как оно работает, какие типы тренировок оно может отслеживать и как просматривать всю собираемую информацию. </p> <h2 id=\"getting-started-with-the-workout-app\"> Начало работы с приложением для тренировок </h2> <p> Вы можете открыть приложение Workout на Apple Watch несколькими способами. Сначала просто нажмите один раз на <strong> Цифровая Корона </strong> , чтобы открыть список приложений на часах. Затем выберите <strong> Тренировка </strong> . </p> <p> Еще более быстрый способ - просто использовать Siri, удерживая нажатой кнопку <strong> Цифровая Корона </strong> или поднесите часы ко рту. Затем просто скажите «Откройте приложение для тренировки». </p> <p> Открыв приложение, вы увидите самые разные типы тренировок - от стрельбы из лука до йоги и всего, что между ними. </p> <p> Главный экран выбора тренировки выделен наиболее популярными опциями. Прокрутите список вниз и выберите <strong> Добавить тренировку </strong> чтобы увидеть список других типов тренировок. Если по какой-то причине вы не видите свой тип тренировки, вы также можете выбрать <strong> Другой </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> Вы можете выбрать <strong> три точки </strong> ( <strong> ... </strong> ) для каждого типа тренировки, чтобы установить конкретную цель по расстоянию, сожженным калориям или времени. Если какая-либо из этих целей вас не интересует, просто нажмите на название тренировки, чтобы начать немедленно. </p> <p> Перед началом отслеживания на экране появится трехсекундный обратный отсчет. </p> <p> Все функции приложения Workout доступны без iPhone поблизости или при использовании Apple Watch, подключенных к Wi-Fi или сотовому сигналу. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Знакомство с приложением для тренировок </h2> <p> В приложении три основных экрана. Вы можете переключаться между ними, проводя пальцем влево или вправо. </p> <p> На главном экране будет отображаться весь ваш прогресс в выбранном вами типе тренировки. Вы увидите время тренировки, активные калории, общее количество калорий и текущую частоту пульса. В зависимости от типа тренировки вы также можете увидеть пройденное расстояние. </p> <p> Если у вас Apple Watch Series 5 или новее и у вас включен постоянно включенный дисплей, вы всегда можете видеть статистику своей тренировки. Любой, у кого установлена ​​более старая модель, должен будет поднять или коснуться экрана, чтобы увидеть эту информацию. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Когда вы бежите или идете пешком, Apple Watch будут осторожно нажимать на каждую милю или километр и отображать обновление с информацией о темпе. Повторение и нажатие на велосипеде будет происходить каждые пять миль или километров. </p> <p> Если вы выполняете тренировку Apple Fitness +, вы можете видеть данные как в приложении Workout, так и на экране iPhone, iPad или Apple Watch. </p> <p> </p> <p> Проведение вправо от главного экрана покажет вам четыре различных варианта: <strong> Замок </strong> , <strong> Новый </strong> , <strong> Конец </strong> , а также <strong> Пауза </strong> . </p> <p> Выбор <strong> Замок </strong> заблокирует экран, чтобы избежать случайных нажатий. Вы можете повернуть колесико Digital Crown, чтобы разблокировать экран. Обратите внимание: эта опция автоматически включается во время любой тренировки по плаванию, чтобы предотвратить случайное попадание капель воды. </p> <p> Как вы могли догадаться, <strong> Новый </strong> завершает текущую тренировку и позволяет выбрать новый тип упражнения, чтобы начать заново. Выбор <strong> Конец </strong> завершит текущую тренировку. </p> <p> Если вас когда-либо прервали, вы можете выбрать <strong> Пауза </strong> кнопка. При повторном нажатии начнется отслеживание тренировки. Вы также можете сделать это, одновременно нажав цифровую колесную головку и боковую кнопку. </p> <p> Смахивание влево от основного экрана тренировки показывает элементы управления воспроизведением мультимедиа. Это простой способ получить доступ к вашей музыке или тому, что вы слушаете во время тренировки. Вы можете пропускать треки, воспроизводить, приостанавливать и увеличивать или уменьшать громкость. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Автоматические напоминания о тренировках </h2> <p> Не беспокойтесь, если вы забыли начать тренировку. Если у вас есть watchOS 5 или новее, Apple Watch могут автоматически распознавать, когда вы тренируетесь. Он коснется вас по запястью и спросит, хотите ли вы записать тренировку, что позволит вам изменить тип тренировки, отключить эти уведомления на день или просто закрыть это уведомление. </p> <p> Хотя отображение уведомления может занять несколько минут, все кредиты на тренировку по-прежнему сохраняются. </p> <p> Вы можете получать напоминания о тренировках для следующих типов тренировок: прогулка в помещении, прогулка на свежем воздухе, бег в помещении, бег на улице, эллиптический тренажер, гребля, плавание в бассейне и плавание в открытой воде. </p> <p> Чтобы включить или выключить эту функцию, перейдите в <strong> Настройки&gt; Тренировка&gt; Напоминание о начале тренировки </strong> на ваших Apple Watch. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> Apple Watch также могут определять, когда тренировка завершена. После касания вы увидите на экране уведомление с вариантами завершения или приостановки тренировки. Вы также можете полностью закрыть уведомление и продолжить тренировку. </p> <p> Включите эту функцию, зайдя на Apple Watch и выбрав <strong> Настройки&gt; Тренировка&gt; Напоминание о завершении тренировки </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Настройте данные, отображаемые в приложении для тренировки </h2> <p> В представлении тренировки Apple Watch вы можете настроить информацию, отображаемую на экране, для множества различных типов тренировок. </p> <p> Для начала откройте приложение-компаньон Watch на своем iPhone. в <strong> Мои часы </strong> выбор вкладки <strong> Тренировка </strong> . Тогда выбирай <strong> Просмотр тренировки </strong> . Вверху страницы вы можете выбрать, отображать ли на экране один или несколько показателей во время тренировки. Если вы выберете <strong> Единая метрика </strong> , просто прокрутите колесико Digital Crown, чтобы увидеть больше данных на Apple Watch. </p> <p> <strong class=\"gallery__section-title\"> Галерея изображений (3 изображения) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Расширять <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Расширять <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <p> Ниже вы также можете увидеть несколько различных типов тренировок, где вы можете редактировать информацию, отображаемую на экране. Выберите тип тренировки, а затем выберите <strong> Редактировать </strong> в правом верхнем углу экрана, чтобы настроить, что будет отображаться на экране и в каком порядке. </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Просмотр данных тренировки в приложении для фитнеса </h2> <p> Когда вы закончите тренировку, все данные будут на вашем iPhone всего в несколько нажатий. </p> <p> Чтобы увидеть это, откройте <strong> Фитнес </strong> приложение. </p> <p> <strong class=\"gallery__section-title\"> Галерея изображений (2 изображения) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Расширять <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <p> Под <strong> Резюме </strong> вкладка, выберите <strong> Тренировки </strong> . Вы увидите информацию обо всех своих тренировках. Данные также доступны в <strong> Здоровье </strong> приложение. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Разбейте пот с приложением Apple Watch Workout </h2> <p> Как видите, приложение Apple Watch Workout - отличный способ помочь отслеживать все ваши различные показатели физической подготовки, занимаясь всем, от плавания до танцев и многого другого. </p> <p> И когда вы готовы закончить ночь и отправиться спать, ваши Apple Watch по-прежнему могут быть большим подспорьем со встроенной функцией отслеживания сна. </p>"}