{"title":"Как запретить Windows 10 блокировать загруженные файлы","content":"<p> Когда вы пытаетесь открыть файл, Windows 10 может помешать вам открыть его напрямую. Он покажет вам предупреждение системы безопасности о том, что файл создан из неизвестного источника и может быть небезопасным. Это происходит, когда функция Windows 10, называемая диспетчером вложений, блокирует файлы, которые она считает небезопасными для вашего ПК. </p> <p> Хотя вы можете вручную разблокировать каждый файл, это может быть утомительным процессом, особенно если вам приходится делать это почти для каждого файла, который вы загружаете. В этой статье мы покажем вам, как отключить блокировку загруженных файлов в Windows 10. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> Что такое диспетчер вложений в Windows 10? </h2> <p> В Windows 10 есть функция безопасности, называемая диспетчером вложений, которая блокирует открытие небезопасных файлов. Это могут быть файлы, которые вы скачали, или <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> файлы, которые Windows определяет как небезопасные вложения электронной почты </a> . Если диспетчер вложений считает файл небезопасным, он предотвращает его открытие в Windows 10 и отображает предупреждающее сообщение. Диспетчер вложений классифицирует загружаемые файлы по типу и расширению имени файла. </p> <p> Диспетчер вложений Windows использует интерфейс прикладного программирования (API) IAttachmentExecute для поиска типа файла, ассоциации файлов и определения наиболее подходящего действия. Когда вы загружаете файлы и сохраняете их на диске, Windows добавляет к этим файлам определенные метаданные. Эти метаданные считаются вложениями. Когда Windows добавляет метаданные к загружаемым файлам в виде вложения, это называется информацией о зоне. </p> <p> Теперь <strong> Информация о зоне </strong> Вот в чем корень проблемы. Когда проводник открывает файл, он считывает информацию о прикрепленной зоне, хранящуюся в том же месте, и проверяет, был ли файл из неизвестного источника или нет. Если Windows обнаружит, что файл не распознан или получен из неизвестных источников, она не позволит вам открыть его. </p> <p> Появится предупреждение Windows SmartScreen, в котором говорится: </p> <blockquote> <p> Windows SmartScreen предотвратила запуск нераспознанного приложения. Запуск этого приложения может поставить под угрозу ваш компьютер. </p> </blockquote> <p> Если вы хотите вручную открыть заблокированный файл, щелкните загруженный файл правой кнопкой мыши и выберите <strong> Характеристики </strong> . На вкладке Общие щелкните <strong> Разблокировать </strong> нажмите <strong> Применять </strong> а затем щелкните <strong> ОК </strong> . </p> <p> Но представьте, что вам нужно делать это каждый раз при загрузке файла - это может раздражать и отнимать много времени. Если вы часто загружаете файлы из Интернета или получаете файлы в виде вложений по электронной почте, вы можете полностью отключить блокировку файлов вашим компьютером. </p> <p> Чтобы Windows 10 не блокировала открытие файлов, необходимо запретить ей добавлять информацию о зоне к загружаемым файлам. Это можно сделать, настроив диспетчер вложений вручную с помощью редактора локальной групповой политики или редактора реестра. </p> <p> Мы расскажем, как это сделать. Вы должны войти в систему как администратор или вы должны <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> запросить права администратора </a> чтобы иметь возможность предотвратить блокировку загруженных файлов. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Настройте диспетчер вложений с помощью редактора реестра </h2> <p> нажмите <strong> Клавиша Windows + R </strong> , чтобы открыть редактор реестра. Оттуда введите «Regedit» и нажмите <strong> Входить </strong> . Появится запрос контроля учетных записей пользователей. Когда появится этот запрос, щелкните значок <strong> да </strong> кнопку, чтобы продолжить. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Перейдите к разделу «Вложения» в редакторе реестра: <strong> HKEY_CURRENT_USER&gt; Программное обеспечение&gt; Microsoft&gt; Windows&gt; Текущая версия&gt; Политики&gt; Вложения </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> Если ключ вложений отсутствует в ключе политик, вам придется его создать. Для этого щелкните правой кнопкой мыши значок <strong> Политики </strong> ключ, нажмите <strong> Новый </strong> нажмите <strong> Ключ </strong> . Это создаст новый ключ, который вы затем должны назвать «Вложения». Если вы обнаружите, что клавиша «Вложения» уже присутствует, вы можете перейти к следующему шагу. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> Щелкните правой кнопкой мыши <strong> Вложения </strong> ключ, нажмите <strong> Новый </strong> а затем выберите <strong> DWORD (32 бита) Значение </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Вам будет предложено назвать это вновь созданное значение DWORD. Назовите его «SaveZoneInformation» и нажмите <strong> Входить </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> Наконец, чтобы отключить диспетчер вложений в Windows 10, дважды щелкните вновь созданный <strong> SaveZoneInformation </strong> значение и измените его данные значения на 1. Щелкните <strong> ОК </strong> заканчивать. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Когда вы выполните эти шаги, закройте редактор реестра и перезагрузите компьютер, чтобы изменения вступили в силу. С этого момента любой загружаемый вами файл больше не будет прикреплять информацию о зоне к альтернативному потоку данных файла. Это позволит вам без проблем открывать ваши файлы. </p> <p> Если вы хотите вернуться и включить диспетчер вложений, вы можете сделать это, перейдя к разделу «Вложения» в редакторе реестра: <strong> HKEY_CURRENT_USER&gt; Программное обеспечение&gt; Microsoft&gt; Windows&gt; Текущая версия&gt; Политики&gt; Вложения </strong> . Отсюда с правой стороны дважды щелкните значок <strong> SaveZoneInformation </strong> значение и измените его данные значения на 3. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Настройте диспетчер вложений с помощью редактора локальной групповой политики </h2> <p> Редактор локальной групповой политики доступен только в выпусках Windows 10 Enterprise, Education и Pro. В результате этот метод неприменим, если у вас установлена ​​Windows 10 Домашняя. Если ваш компьютер работает под управлением Windows 10 Home edition, вам нужно будет настроить диспетчер вложений через редактор реестра. </p> <p> Если вы используете выпуск Windows 10 с редактором локальной групповой политики, вы можете настроить диспетчер вложений, выполнив указанные здесь действия. </p> <p> Для начала нажмите <strong> Клавиша Windows + R </strong> , введите &quot;gpedit.msc&quot; и нажмите <strong> Входить </strong> , чтобы открыть редактор локальной групповой политики. </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Перейдите к диспетчеру вложений: <strong> Конфигурация пользователя&gt; Административные шаблоны&gt; Компоненты Windows&gt; Диспетчер вложений </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> На правой панели диспетчера вложений дважды щелкните значок <strong> Не сохранять информацию о зоне во вложенных файлах </strong> политика для редактирования параметров информации о зоне. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> Появится окно, в котором вы можете выбрать, следует ли диспетчеру вложений сохранять информацию о зоне. </p> <p> Нажмите <strong> Включено </strong> чтобы позволить диспетчеру вложений не сохранять информацию о зоне. Это гарантирует, что Windows не будет блокировать ваши файлы при их открытии. Щелкните значок <strong> Применять </strong> кнопку, чтобы сохранить изменения, а затем нажмите <strong> ОК </strong> . </p> <p> Когда вы закончите, закройте редактор локальной групповой политики и перезагрузите компьютер, чтобы сохранить изменения. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows больше не блокирует ваши файлы </h2> <p> Если бы вам раньше приходилось вручную разблокировать большинство загруженных файлов, вы бы осознали, насколько утомительным может быть этот процесс. Применяя эти советы, вы сможете с легкостью открывать все свои файлы. </p> <p> Если вы загружаете файлы и почему-то сомневаетесь в их достоверности, вы всегда можете открыть их в безопасных изолированных средах, чтобы убедиться, что ваш компьютер и данные в безопасности. </p>"}