{"title":"Как исправить BSOD VIDEO_TDR_FAILURE в Windows 10","content":"<p> Ошибка VIDEO_TDR_FAILURE означает, что ваша видеокарта неисправна или драйверы дисплея могут быть устаревшими / неисправными. Но могут быть и другие причины, например перегрев компонентов или повреждение системных файлов. TDR - это сокращение от <strong> Тайм-аут, обнаружение и восстановление </strong> , метод, используемый Windows для выявления и исправления неисправных компонентов программного обеспечения. </p> <p> Если вы столкнулись с этой ошибкой, не бойтесь, потому что следующие методы исправят ошибку VIDEO_TDR_FAILURE быстрее, чем вы ожидали. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Обновите и переустановите драйверы дисплея. </h2> <p> Как упоминалось выше, ошибка обычно возникает из-за неправильной работы или устаревания драйверов дисплея. Таким образом, вам следует обновить драйверы видеокарты. Если это не поможет, переустановите их. В зависимости от вашей видеокарты вы можете столкнуться с разными именами файлов, связанных с ошибкой. </p> <ol> <li> Для пользователей Nvidia это <strong> nvlddmkm.sys </strong> . Если вы являетесь пользователем Nvidia, вот <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 простых способов исправить ошибку. </a> </li> <li> Для пользователей AMD ошибка отображается как <strong> atikmpag.sys </strong> . </li> <li> Для пользователей Intel HD ошибка <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> Как обновить драйверы дисплея </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> Нажмите <strong> Клавиша Windows + R </strong> , чтобы открыть команду «Выполнить». Печатать <strong> devmgmt.msc </strong> и нажмите Enter. </li> <li> в <strong> Диспетчер устройств </strong> окно, перейдите к <strong> Видеоадаптеры </strong> и расширить его. </li> <li> Щелкните правой кнопкой мыши адаптер дисплея, затем выберите <strong> Обновить драйвер </strong> . </li> <li> Выбирать <strong> Автоматический поиск обновленного программного обеспечения драйвера </strong> . </li> <li> Windows автоматически выполнит поиск в Интернете и загрузит необходимые драйверы. При этом убедитесь, что у вас есть активное подключение к Интернету. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> Как переустановить драйверы дисплея </h3> <p> Если BSOD с ошибкой tdr видео сохраняется после обновления драйверов дисплея, лучше переустановить эти драйверы. Желательно сделать это, когда Windows загружается в безопасном режиме. Но перед этим вам следует зайти на сайт производителя вашей видеокарты и загрузить последнюю версию графических драйверов. </p> <p> Наиболее распространенными производителями являются <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> , а также <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intel </a> . </p> <p> Чтобы загрузиться в безопасном режиме, выполните следующие действия: </p> <ol> <li> Нажмите <strong> Клавиша Windows + R, </strong> и в диалоговом окне «Выполнить» введите <strong> msconfig, </strong> и нажмите Enter. </li> <li> в <strong> Конфигурация системы </strong> окно, нажмите на <strong> Ботинок </strong> таб. </li> <li> Теперь отметьте <strong> Безопасный режим </strong> флажок расположен внизу. </li> <li> Примените настройки и перезагрузите компьютер. </li> </ol> <p> После загрузки в безопасном режиме самое время переустановить драйверы дисплея. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> В строке поиска меню Пуск введите <strong> Диспетчер устройств </strong> и откройте его. </li> <li> Ищу <strong> Видеоадаптеры </strong> и разверните меню. </li> <li> Щелкните правой кнопкой мыши свой графический процессор и нажмите <strong> Удалить устройство </strong> . </li> <li> В мастере удаления обязательно проверьте <strong> Удалите программное обеспечение драйвера для этого устройства </strong> коробка. </li> <li> Подождите, пока Windows удалит устройство и перезагрузит компьютер. </li> <li> Теперь переустановите графические драйверы, которые вы скачали ранее. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Используйте SFC для сканирования и исправления системных файлов. </h2> <p> SFC - это встроенная утилита Windows, которую можно использовать для сканирования и исправления поврежденных системных файлов. В случае BSOD весьма вероятно, что некоторые системные файлы повреждены, поэтому запуск этой утилиты является обязательным. Это только один из <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> доступно несколько полезных утилит </a> в распоряжении пользователя Windows. </p> <p> Чтобы запустить SFC, просто выполните следующие действия: </p> <ol> <li> В строке поиска меню Пуск введите <strong> cmd </strong> . </li> <li> Щелкните правой кнопкой мыши на <strong> Командная строка </strong> и выберите <strong> Запустить от имени администратора </strong> . </li> <li> В консоли введите <strong> sfc / scannow </strong> и нажмите Enter. </li> <li> После завершения сканирования и восстановления перезагрузите компьютер. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Запустите восстановление при загрузке. </h2> <p> Для пользователей, у которых возникает ошибка сразу после загрузки Windows 10 или вскоре после входа в систему, восстановление при загрузке - находка. Эта функция Windows проверяет наличие аномалий во время запуска и немедленно исправляет их. </p> <p> Поскольку этот раздел предназначен для пользователей, чьи компьютеры оказались непригодными для использования из-за ошибки, т.е. они не могут открыть <strong> Настройки </strong> , им придется выполнить полную перезагрузку, чтобы войти в среду восстановления Windows (winRE). </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Выполните следующие действия, чтобы загрузить среду восстановления Windows: </p> <ol> <li> Нажмите и удерживайте кнопку питания, пока компьютер не выключится. </li> <li> Снова нажмите кнопку питания, чтобы загрузить компьютер. </li> <li> Повторяйте первый и второй шаги, пока компьютер не загрузится в режим восстановления. Будет синий экран. </li> <li> На экране восстановления нажмите <strong> См. Дополнительные варианты ремонта </strong> . </li> <li> На следующем экране нажмите <strong> Устранение неполадок </strong> </li> <li> Нажмите на <strong> Расширенные опции </strong> </li> <li> Нажмите на <strong> Восстановление при загрузке </strong> и введите свои учетные данные при появлении запроса. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Измените настройки управления питанием. </h2> <p> Параметры управления питанием Windows обычно хорошо оптимизированы, но иногда они могут влиять на то, как ваш компьютер обрабатывает графику. Это особенно актуально, когда компьютер имеет дискретный графический процессор. Оптимальные настройки, позволяющие избежать появления BSOD VIDEO_TDR_FAILURE, приведены ниже: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> В строке поиска меню Пуск введите <strong> Панель управления </strong> и откройте его. </li> <li> В строке поиска панели управления введите «параметры питания» и нажмите Enter. </li> <li> Нажмите на <strong> Варианты питания, </strong> и рядом с используемой схемой электропитания нажмите <strong> Измените настройки тарифного плана. </strong> </li> <li> Нажмите на <strong> Измените расширенные настройки мощности. </strong> </li> <li> Ищу <strong> PCI E </strong><strong> xpress </strong> и расширить его. </li> <li> Повернуть <strong> Link State Power Management </strong> установка на <strong> Выключенный </strong> . </li> <li> Сохраните изменения и перезагрузите компьютер. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Очистите свой компьютер. </h2> <p> Перегрев никогда не бывает хорошо, и обычно причиной этого является скопление пыли. Пользователям рекомендуется ежемесячно очищать компоненты ПК от пыли. Но будь осторожен. Делать это нужно аккуратно. </p> <p> Обязательно очистите верхнюю часть видеокарты, вентилятора ЦП, блока питания и вентиляторов корпуса. В общем, обязательно избегайте <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> ошибки обслуживания, которые могут повредить дорогостоящие компоненты. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Проверьте аппаратные компоненты. </h2> <p> Если ошибка по-прежнему появляется после попытки всего перечисленного выше, возможно, неисправно само оборудование. Пользователи, у которых есть выделенная видеокарта, должны удалить ее и загрузить компьютер. Если ошибка устранена, значит, это аппаратная неисправность самого графического процессора. Вы можете попытаться связаться с производителем и попытаться заменить устройство. </p> <p> </p> <p> При использовании встроенной графики попробуйте отключить их и загрузиться. Чтобы отключить их, выполните следующие действия: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> Нажмите <strong> Клавиша Windows + R, </strong> тип <strong> devmgmt.msc </strong> в текстовом поле Выполнить и нажмите Enter. </li> <li> В <strong> Диспетчер устройств </strong> , Ищу <strong> Видеоадаптеры </strong> и разверните меню. </li> <li> Щелкните правой кнопкой мыши встроенный графический процессор и выберите <strong> Отключить устройство </strong> . </li> <li> Перезагрузите компьютер и проверьте, устранена ли ошибка. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> Ошибка &quot;Video TDR Failure&quot; успешно устранена </h2> <p> Для большинства пользователей проблему решит простое обновление или переустановка драйверов дисплея. Но если плохо пойдет хуже, вам, возможно, придется перезагрузить компьютер или заменить какое-то оборудование. </p>"}