{"title":"Как посмотреть статистику игрового времени на PS5","content":"<p> Если вам нравится видеть, сколько времени вы проводите, играя в игры, у PS5 есть скрытая, но полезная функция для вас. Он отслеживает, сколько времени вы потратили на игры в системе. </p> <p> Вот как узнать, сколько времени вы провели, играя в игры для PlayStation 5. Что может побудить вас <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> выключи свой PS5 </a> чаще. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> Как проверить статистику игрового времени на PlayStation 5 </h2> <p> На главном экране PS5 выберите значок своего профиля в правом верхнем углу. Вы можете нажать <strong> Треугольник </strong> чтобы быстро переместить выделение в эту область экрана. После того, как вы откроете это меню, выберите <strong> Профиль </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Теперь переключитесь на <strong> Игры </strong> таб. Здесь вы увидите все игры, в которые вы играли на своей учетной записи PlayStation. Каждый показывает, когда вы в последний раз играли в игру, а также общее количество игровых часов. Однако это не с точностью до минуты. Вы увидите, что время игры округлено до часа. </p> <p> Здесь вы также увидите время воспроизведения своих игр для PS4, даже если вы не играли в них на PS5. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> Насколько нам известно, это игровое время включает все время, в течение которого игра была запущена, а не только то время, когда вы активно играли. Это означает, что если вы вышли из игры в меню паузы, когда вы ответили на телефонный звонок или собирались что-нибудь поесть, это время будет включено в общее количество. Так что это может быть не очень точно, но, по крайней мере, даст вам представление о том, как долго вы играли в каждую игру. </p> <p> </p> <p> Если вам интересно, вы также можете посмотреть статистику игрового времени своих друзей. Выберите <strong> Друзья </strong> на том же экране и выберите друга, о котором хотите узнать больше. Это покажет вам, сколько времени они провели в своих играх в одинаковом меню. </p> <p> Если вы не хотите, чтобы информация о вашем игровом времени была видна другим игрокам, прокрутите вправо и выберите <strong> Настройки конфиденциальности </strong> . В этом меню под <strong> Ваша деятельность </strong> раздел, измените параметр для <strong> Кто может видеть вашу историю игр </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Некоторые игры тоже отслеживают собственное игровое время </h2> <p> Если вас интересуют подобные данные, обязательно откройте свои любимые игры и посмотрите, отслеживают ли они, сколько времени вы провели за игрой. Большое количество заголовков включает общее время воспроизведения в файле сохранения, в меню паузы и т. Д. </p> <p> Хотя это не является единообразным для разных игр и может включать или не включать время, проведенное во время паузы, это может дать вам больше информации об игре, о которой вы хотите узнать больше. Некоторые онлайн-игры, такие как Overwatch, даже отслеживают время, проведенное с каждым героем в разных режимах. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Посмотрите, сколько вы на самом деле играете </h2> <p> PS5 позволяет легко увидеть, сколько времени вы провели за играми. Это небольшая, но очень ценная функция, поскольку PS4 не делает эти данные легкодоступными. </p> <p> Между тем, есть больше способов управлять игрой, играя за пределами самой консоли. </p> <p> <small> Кредит изображения: LightField Studios / <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}