{"title":"Как сделать свою настольную игру в настольном симуляторе","content":"<p> Вы когда-нибудь задумывались о создании игры, в которую можно играть с друзьями на настольном симуляторе (TTS)? Или, может быть, вы разработчик настольных игр, который хочет создавать прототипы игр и тестировать их в режиме онлайн. </p> <p> Сейчас самое подходящее время, чтобы воспользоваться универсальной игровой средой TTS. Сегодня мы научим вас, как это сделать. </p> <h2 id=\"what-is-tabletop-simulator\"> Что такое настольный симулятор? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Для тех, кто не знает, Tabletop Simulator (TTS) предоставляет трехмерную среду для игры в настольные игры локально или онлайн. Это стало отличным способом <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> играть в настольные игры онлайн с друзьями </a> . </p> <p> В TTS можно играть в разные игры: покер, шашки, Dungeons &amp; Dragons, мини-гольф и даже новейшие настольные игры. Любая игра, в которую вы хотите поиграть, обычно доступна в виде DLC или в мастерской сообщества. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> Зачем использовать настольный симулятор? </h2> <p> Если вы когда-либо пытались создать физическую настольную игру, вы знаете, как много времени может потребоваться не только на создание игровых элементов, но и на их изменение или замену, когда вы решите настроить или пересмотреть игру. </p> <p> В TTS все, от цвета до веса объекта, можно изменить одним щелчком мыши, что делает процесс редактирования гладким и безболезненным. </p> <p> Кроме того, легко транслировать свой игровой процесс в прямом эфире и демонстрировать его в социальных сетях и на потоковых платформах. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> Что вам понадобится для начала работы </h2> <p> Прежде чем начать, вам понадобится следующее: </p> <ul> <li> Учетная запись пользователя Steam </li> <li> Tabletop Simulator установлен на вашем ПК </li> <li> JPG-изображения ваших досок и открыток </li> </ul> <p> <strong> Скачать: </strong> Настольный симулятор на <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> Готовить на пару </a> (19,99 долл. США) </p> <p> Проектирование игровых элементов лучше всего делать при помощи иллюстрации программного обеспечения или путем сканирования изображений физических карт, которые вы уже сделали. Просто убедитесь, что у них есть расширения JPG и они сохранены индивидуально. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Создание досок и ковриков для игроков </h2> <p> Когда вы проектируете свои доски и другие 2D-объекты, убедитесь, что разрешение достаточно высокое, чтобы вы могли правильно подобрать размер без потери качества. TTS автоматически изменит его размер при импорте, и вы сможете изменить его размер точно так, как вам нравится. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Создание карточек </h2> <p> Карты в TTS имеют три аспекта: лицевую сторону карты, рубашку карты и скрытую карту (как карта будет выглядеть для других в руке игрока). У вас должен быть дизайн для каждого из них, хотя у вас есть возможность просто сделать скрытую карту обратной стороной карты. </p> <h3 id=\"create-and-arrange-card-faces\"> Создание и расположение лицевых сторон карт </h3> <p> Вместо того, чтобы импортировать каждую карту по одной, лучше импортировать все или большую часть ваших карт как одну колоду. </p> <p> Чтобы создать колоду, скопируйте и вставьте каждый рисунок на карточный лист размером 7х10. Использование шаблона, подобного приведенному ниже, поможет вам начать работу. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> В шаблоне выделены слоты для каждой карты в вашей колоде, что позволяет импортировать до 69 карт за раз. Если вам не нужно так много, вы можете оставить слоты неиспользованными, а если у вас их больше, вы можете комбинировать колоды или дублировать карты после импорта. </p> <p> Однако вам не обязательно использовать этот шаблон. Лист карточки может быть любого размера, и TTS автоматически разрежет его на сетку 7x10. </p> <p> Для вашего удобства вышеуказанный шаблон и шаблон квадратной карточки доступны в вашем локальном файловом каталоге TTS. </p> <p> Если вы не знаете, где находятся ваши локальные файлы, вы можете найти их в своей библиотеке Steam, открыв <strong> Характеристики </strong> меню для ТТС. Выберите <strong> Локальные файлы </strong> вкладку и щелкните <strong> Просматривать </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Рубашки карт </h3> <p> Если вам нужен только один дизайн для спинки всей колоды, то все, что вам нужно, - это одно изображение дизайна в формате JPG; карточный лист не понадобится. </p> <p> Если ваша колода будет иметь несколько уникальных рубашек, вам нужно будет создать дополнительный лист карты с дизайном рубашек, соответствующим рисунку лицевых сторон на вашем первом листе карты. Для дизайна лица в слоте один поместите его заднюю часть обратно в слот один на вашем заднем листе. Для стороны два поместите ее заднюю часть в прорезь два и так далее. </p> <h3 id=\"hidden-cards\"> Скрытые карты </h3> <p> В слот 70 листа карт, помеченный на шаблоне «Скрытая карта для других игроков», поместите любой рисунок, который вы хотите, чтобы его видели противники, когда карты этой колоды находятся в руке игрока. Это традиционно сплошной черный или белый цвет или дизайн задней части колоды. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Импорт элементов </h2> <p> Теперь, когда вы создали свои доски и колоды, вы готовы начать импорт. </p> <p> Прежде чем фактически разместить сервер с вашей игрой, полезно начать однопользовательскую игру и заранее импортировать элементы. Затем вы можете сохранить настройку и быть готовым немедленно начать, когда прибудут игроки. </p> <p> Запустите TTS и нажмите <strong> Создавать </strong> , а затем выберите <strong> Один игрок </strong> для создания окружающей среды. Удалите все элементы, созданные TTS, и выберите стол, на котором вы хотите играть в свою игру. </p> <p> Когда среда готова, щелкните значок <strong> Объекты </strong> в верхнем меню, а затем выберите <strong> Обычай </strong> категория. </p> <h3 id=\"boards-and-player-mats\"> Доски и коврики для игроков </h3> <p> Выбирать <strong> Доска </strong> от <strong> Обычай </strong> и щелкните в любом месте стола, где должна отображаться доска. Щелкните правой кнопкой мыши в любом месте, чтобы открыть диалоговое окно импорта платы. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Перейдите к своему изображению доски, и TTS спросит, хотите ли вы загрузить его в свою учетную запись Steam Cloud или сохранить локальный файл. Загрузите файлы в облако, если вы планируете когда-либо играть в свою игру онлайн или на другом устройстве. </p> <p> При желании вы можете загрузить свои изображения на другой хост, например Dropbox, Photobucket или Imgur, и вставить сюда URL-адрес. Однако внешние хосты менее надежны и не рекомендуются. </p> <p> Когда вы загрузите его в Steam Cloud, TTS попросит вас дать ему имя файла. После завершения загрузки нажмите <strong> Импортировать </strong> . </p> <p> Теперь, когда плата импортирована, вы можете уменьшить или увеличить ее с помощью <strong> - </strong> а также <strong> + </strong> клавиши на клавиатуре. Чтобы зафиксировать его на месте, чтобы случайно не переместить во время игры, щелкните правой кнопкой мыши доску и под <strong> Переключает </strong> нажмите <strong> Замок </strong> . </p> <h3 id=\"card-decks\"> Колоды карт </h3> <p> в <strong> Пользовательский объект </strong> меню, щелкните <strong> Палуба </strong> . Щелкните в любом месте стола, где должна появиться колода, а затем щелкните правой кнопкой мыши, чтобы начать импорт. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Отрегулируйте настройки следующим образом: </p> <ul> <li> <strong> Тип: </strong> Измените это, если вы имеете в виду конкретную форму, отличную от обычной прямоугольной карты с закругленными углами. </li> <li> <strong> Лицо: </strong> Щелкните значок <strong> Просмотр локальных файлов </strong> кнопку и найдите свою карточку. Опять же, мы рекомендуем опцию Steam Cloud поверх локальных файлов или внешних хостов. </li> <li> <strong> Уникальные спинки: </strong> Отметьте этот вариант, если ваша колода будет иметь несколько дизайнов рубашек, а затем загрузите лист обратной карты в <strong> Назад </strong> коробка. Если вы используете единый дизайн для всей колоды, просто загрузите вместо него свой дизайн задней части. </li> <li> <strong> Ширина и высота: </strong> Отрегулируйте это, если вы использовали другое соотношение, отличное от стандартной прямоугольной карты, 10x7. </li> <li> <strong> Число: </strong> Убедитесь, что это соответствует количеству карточек, которые вы импортируете. </li> <li> <strong> Сбоку: </strong> Это меняет ориентацию <strong> Alt Zoom </strong> функция в TTS. Не устанавливайте этот флажок, если не хотите, чтобы карточка отображалась боком. </li> <li> <strong> Спина скрыта: </strong> Установите этот флажок, если хотите, чтобы скрытые изображения ваших карточек были просто рубашками. </li> </ul> <p> Когда ваши настройки верны, нажмите <strong> Импортировать </strong> . Ваша колода появится на столе, и вы сможете начать тасовать и сдавать карты. </p> <p> Если вы хотите, чтобы у ваших карточек были имена для облегчения сортировки, щелкните одну карточку правой кнопкой мыши и выберите <strong> Имя </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Импорт других игровых элементов </h2> <p> Импорт других 2D-объектов аналогичен процессу импорта плат. Не забывайте, что в TTS есть много общих игровых элементов, таких как игральные кости и фигурки, готовые к использованию в игре. <strong> Объекты </strong> меню. </p> <p> Если у вас есть собственные 3D-элементы, которые вы хотите использовать, следуйте инструкциям <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> Руководство TTS по импорту 3D-моделей </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Сохранение полной игры </h2> <p> После установки компонентов в состояние начальной настройки щелкните значок <strong> Игры </strong> кнопку в верхнем меню. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Выбирать <strong> Сохранить загрузить </strong> и щелкните <strong> Сохранить игру </strong> кнопка. Дайте ему имя и нажмите <strong> Сохранить </strong> . Теперь, когда вы размещаете игры, вы можете перезагрузить их в идеальной настройке, открыв <strong> Сохранить загрузить </strong> меню. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Максимально эффективное использование настольных игр на заказ </h2> <p> Создавать собственные игры и играть в них в Tabletop Simulator просто, если вы знаете, как это делать. Приглашайте друзей или ищите готовых и желающих плейтестеров в <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> Сообщество TTS </a> . Теперь вы можете показать свою игру другим! </p>"}