{"title":"Как выполнить чистую загрузку в Windows 10","content":"<p> Вероятно, на вашем компьютере с Windows установлено множество сторонних приложений. Не волнуйтесь, большинство людей думают. </p> <p> От выполнения основных задач, таких как просмотр веб-страниц, до написания сложных строк кода, люди предпочитают использовать приложения, альтернативные тем, которые встроены в Windows. Хотя эти приложения облегчают нашу жизнь, они иногда мешают работе системы. Они могут варьироваться от незначительных сбоев до критических ошибок и BSOD. </p> <p> Здесь на сцену выходит чистая загрузка. </p> <h2 id=\"what-is-a-windows-clean-boot-anyway\"> Что такое чистая загрузка Windows? </h2> <p> Чистая загрузка Windows 10 позволяет пользователям исключить сторонние приложения как причину ошибки. Это делается путем простой загрузки устройства с отключенными всеми сторонними приложениями. И хотя название звучит так, будто это встроенная функция Windows, это не так. Вы должны вручную выполнить чистую загрузку вашего компьютера. </p> <p> Преимущества чистой загрузки не ограничиваются только диагностикой ошибок. Известно, что помогает, когда <a href=\"https://www.makeuseof.com/tag/fix-windows-update-error-0x80070057/\" target=\"_blank\" rel=\"nofollow noopener\"> Обновления Windows не устанавливаются должным образом </a> . Это также особенно полезно, когда ваша ОС кажется вялой, и вы хотите проверить, что может быть причиной проблемы. </p> <p> </p> <p> </p> <h2 id=\"how-to-clean-boot-and-fix-errors\"> Как очистить загрузку и исправить ошибки </h2> <p> Чистая загрузка - это относительно простой процесс, если пользователи попробовали его несколько раз. </p> <p> Прежде чем перечислять шаги, пользователи должны знать, что для некоторых действий требуются права администратора. Ваш компьютер также может работать не так, как вы привыкли, но не нужно его беспокоить. Это происходит потому, что иногда пользователи даже не подозревают, что некоторые второстепенные задачи выполняются сторонним программным обеспечением. </p> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-128.png\" loading=\"lazy\"> </p> <p> Вот шаги, как очистить загрузочную Windows 10: </p> <ol> <li> В строке поиска меню Пуск введите <strong> sysconfig </strong> и нажмите на <strong> Конфигурация системы </strong> . </li> <li> в <strong> Конфигурация системы </strong> окно, перейдите в <strong> Услуги </strong> таб. </li> <li> Проверить <strong> Скрыть все службы Microsoft </strong> коробка. </li> <li> Отметьте все услуги в списке и нажмите <strong> Отключить все </strong> расположен в правом нижнем углу, затем сохраните и выйдите. </li> <li> Теперь откройте <strong> Диспетчер задач </strong> . Вы можете сделать это, щелкнув правой кнопкой мыши на панели задач и выбрав <strong> Диспетчер задач </strong> или используя <strong> Ctrl + Alt + Delete </strong> . </li> <li> в <strong> Диспетчер задач </strong> окно, перейдите к <strong> Запускать </strong> таб. </li> <li> Поочередно выберите все службы и нажмите <strong> Запрещать </strong> . </li> <li> Выход <strong> Диспетчер задач </strong> а также <strong> Запустить снова </strong> твой компьютер. </li> </ol> <p> <img alt=\"Startup tab in the task manager\" src=\"images/startup-tab-task-manager-383.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"fixing-errors-with-clean-boot\"> Исправление ошибок с помощью чистой загрузки </h2> <p> После выполнения действий, перечисленных выше, ваш <a href=\"https://www.makeuseof.com/tag/clean-computer-original-state-reinstalling-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> ПК загрузится в чистом состоянии. </a> Первое, что должны сделать пользователи, это подождать и проверить, появляется ли снова та же ошибка. Иногда источником ошибки могут быть системные файлы Windows, и в этом случае ошибка появится, но это может занять больше времени, чем при обычной загрузке. </p> <p> Если ошибка не появляется, пора сузить круг подозреваемых. Это несколько утомительная задача, но, к сожалению, лучший способ ее решить. Чтобы сузить список, сделайте следующее: </p> <ol> <li> В состоянии чистой загрузки откройте <strong> Конфигурация системы </strong> . </li> <li> Под <strong> Услуги </strong> вкладку, выберите верхнюю половину списка и нажмите <strong> Давать возможность </strong> . Убедитесь, что <strong> Скрыть все службы Microsoft </strong> флажок установлен. </li> <li> Теперь откройте <strong> Диспетчер задач </strong> и перейти к <strong> Запускать </strong> таб. </li> <li> Точно так же включите верхнюю половину служб и перезагрузите компьютер. </li> </ol> <p> После перезагрузки, если ошибка не появляется, вы можете исключить выбранное программное обеспечение и службы из списка виновных. Вам придется повторять эти шаги, пока вы не найдете программу или службу, ответственную за это, и не удалите ее. </p> <p> </p> <h2 id=\"clean-boot-windows-10-to-isolate-errors\"> Чистая загрузка Windows 10 для выявления ошибок </h2> <p> Пришло время стандартно перезагрузить Windows 10. Просто откройте <strong> Конфигурация системы </strong> а также <strong> Диспетчер задач </strong> и включить все службы и программы. Рекомендуется, чтобы пользователи выполняли чистую загрузку, прежде чем прибегать к более сложным исправлениям, когда Windows дает сбой или отображает BSOD. </p>"}