{"title":"Как лучшие службы обмена мгновенными сообщениями используют сквозное шифрование","content":"<p> Личные данные важны как никогда. Правительства, компании и киберпреступники жаждут, чтобы личные данные людей служили их интересам. Различные онлайн-платформы позволяют легко передавать личные данные без нашего ведома. </p> <p> По этой причине важно хорошо понимать, как платформы, которые вы используете в Интернете, защищают вашу конфиденциальность. Одним из ключевых факторов, на которые следует обратить внимание при рассмотрении мер защиты приложений обмена сообщениями, является сквозное шифрование. </p> <p> Признавая необходимость уделять приоритетное внимание конфиденциальности данных, все больше приложений для обмена сообщениями предприняли значительные шаги для внедрения сквозного шифрования. </p> <h2 id=\"what-is-end-to-end-encryption\"> Что такое сквозное шифрование? </h2> <p> </p> <p> Сквозное шифрование <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> метод шифрования сообщений </a> так что третьи стороны не могут получить доступ к информации, совместно используемой людьми, обменивающимися сообщениями друг с другом. </p> <p> При сквозном шифровании для сокрытия содержимого сообщений используется секретный код, а не простой текст. Это означает, что только те, кто общается на платформе с сквозным шифрованием, могут читать сообщения, отправляемые между собой. </p> <p> Давайте посмотрим, как три популярных сервиса безопасного обмена сообщениями, Signal, WhatsApp и Telegram, используют сквозное шифрование. </p> <p> </p> <h2 id=\"signal\"> Сигнал </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signal считается одним из самых безопасных приложений для обмена сообщениями. Все коммуникации на платформе по умолчанию зашифрованы. </p> <p> Signal не выполняет резервное копирование сообщений в облаке, что снижает риски злоумышленников, использующих альтернативные методы для получения информации. Он также шифрует метаданные сообщений, поэтому место и время обмена сообщениями не отслеживаются. </p> <p> Благодаря механизму шифрования с открытым исходным кодом общественность получает выгоду от более высокого уровня прозрачности технологии, лежащей в основе их деятельности по обмену сообщениями. Пользователи могут более внимательно изучить технические детали, чтобы лучше понять методы, используемые для защиты их конфиденциальности. </p> <p> Платформы с открытым исходным кодом могут значительно упростить и обезопасить использование программного обеспечения в долгосрочной перспективе. Люди не только могут лучше понять, как работает программное обеспечение, но также могут попытаться создать свою собственную версию приложения, которая могла бы быть более подходящей для их уникальных потребностей в безопасности. </p> <p> Signal использует комбинацию OTR, называемую многосторонним обменом сообщениями без записи, что позволяет осуществлять сквозное шифрование сообщений в групповых чатах. Риски утечки данных могут возрастать по мере увеличения числа участников сети. Благодаря групповому чату с непрерывным шифрованием такие риски значительно снижаются. </p> <p> </p> <h2 id=\"whatsapp\"> WhatsApp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp был одним из первых популярных приложений для обмена сообщениями, в котором реализовано сквозное шифрование. Он использует сквозное шифрование для сообщений и звонков. </p> <p> WhatsApp использует протокол сквозного шифрования, разработанный Open Whisper Systems, командой, стоящей за мессенджером Signal. Это большой плюс для приложения, учитывая, насколько безопасен протокол шифрования Signal. </p> <p> </p> <p> Использование WhatsApp собственного проприетарного развертывания означает, что его не так часто исследуют многие исследователи в области безопасности, как полностью открытое программное обеспечение Signal. </p> <p> Несмотря на шифрование сообщений, можно использовать другие способы, чтобы узнать больше о сообщениях, отправляемых в WhatsApp, поскольку сообщения можно создавать в облаке, а метаданные в приложении не шифруются. Это упрощает определение времени и местоположения сообщений. Кроме того, появились сообщения о групповых чатах WhatsApp, проиндексированных поиском Google, что поставило под сомнение безопасность групповых чатов. </p> <p> </p> <h2 id=\"telegram\"> Телеграмма </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegram любят за использование шифрования и самоуничтожение сообщений. К сожалению, в Telegram есть несколько проблем со сквозным шифрованием, которые многим пользователям могут показаться не столь очевидными. </p> <p> В Telegram сквозное шифрование по умолчанию не включено. Предлагается только тогда, когда пользователи переходят в секретные чаты. Для пользователей, не обладающих техническими знаниями, это представляет угрозу безопасности, о которой они могут даже не подозревать. </p> <p> Telegram может получать доступ к сообщениям, хранящимся на его серверах, резервные копии которых хранятся в его облаке. Некоторые считают, что это представляет собой дополнительные векторы атак, которые могут привести к утечке личных данных в случаях, когда киберпреступники пытаются украсть данные обмена сообщениями из приложения. </p> <p> При этом все секретные чаты в Telegram зависят от устройства, а это означает, что к сообщениям, которые вы отправляете через секретные чаты, можно получить доступ только с того устройства, с которого они были отправлены. </p> <p> Секретные чаты Telegram зашифрованы сквозным шифрованием, а групповые чаты - нет. Это означает, что пользователи могут использовать несколько устройств для одного и того же группового чата. Журналы чата могут быть загружены пользователями на несколько устройств. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Секретные чаты на <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #Телеграмма </a> означает, что ваши сообщения защищены сквозным шифрованием и удаляются по прошествии определенного времени. <br><br> Вот как можно активировать эту функцию. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> - Касперский (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 31 января 2021 г. </a></blockquote>  <p> Telegram создает превью ссылок на своих удаленных серверах как из обычных, так и из секретных чатов. Когда пользователь впервые вводит ссылку в секретном чате, приложение предупреждает его, что ссылки будут отправлены на удаленные серверы. Это считается слабым местом в системе безопасности, поскольку отправка ссылок, совместно используемых в частном чате, на удаленный сервер противоречит целям сквозного шифрования. </p> <p> Протокол шифрования Telegram MTProto предназначен для доступа к API сервера из мобильных приложений. Он проприетарный и только частично с открытым исходным кодом. Это ставит под сомнение степень контроля и понимания публикой методов шифрования, используемых для защиты своих сообщений. </p> <p> К счастью, приложение для обмена сообщениями не сталкивалось с серьезными жалобами на утечки данных, но его беспокоит то, что его операторы могут получить доступ к вашим сообщениям. </p> <p> Несмотря на опасения, многих могут успокоить различные юридические обручи, через которые нужно будет пройти, чтобы получить доступ к сообщениям. В прошлом Telegram ясно давал понять, насколько сложно людям получить доступ к сообщениям на его платформе. Ключи должны быть доступны из разных юрисдикций, что расстроит многих людей. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> Выбор наиболее безопасного приложения для обмена сообщениями </h2> <p> Хотя Signal не так популярен, как WhatsApp, его протокол стал важным фактором успеха WhatsApp в области сквозного шифрования. Хотя его методы сквозного шифрования аналогичны WhatsApp, он считается лучше, чем WhatsApp для сквозного шифрования. Он отличается тем, что принимает дополнительные меры для защиты пользователей. </p> <p> Решение Telegram не отдавать приоритет сквозному шифрованию объясняется тем, что он предпочитает удобство. Отсутствие шифрования компенсируется косвенными методами защиты пользователей с помощью облачного шифрования и хранения ключей в различных правовых юрисдикциях. </p>"}