{"title":"Как сбросить рекомендации Apple Music","content":"<p> В Apple Music раньше был легко доступный способ пересмотреть ваши музыкальные рекомендации путем повторного выбора ваших любимых исполнителей и музыкальных жанров. К сожалению, во время обновления приложения Apple удалила этот метод обновления музыки. </p> <p> Не бойтесь, вот руководство по альтернативным методам остановки или сброса автоматических предложений Apple Music. </p> <h2 id=\"apple-music-recommendations-explained\"> Объяснение рекомендаций Apple Music </h2> <p> Когда вы впервые запускаете свою учетную запись Apple Music в первый раз, она предлагает вам выбрать свои любимые из широкого списка музыкальных жанров и исполнителей. Это наставление - это то, как Apple Music будет предлагать плейлисты, альбомы, исполнителей и песни в будущем. </p> <p> Например, если вы выберете Classic Rock, New Rock и Foo Fighters в качестве одного из своих любимых музыкальных произведений, Apple Music, вероятно, предложит очень похожие станции для прослушивания и будет продвигать недавно выпущенную рок-музыку. </p> <p> Изменения в приложении означают, что теперь вы можете настраивать свои музыкальные предпочтения только во время первоначального создания учетной записи, вы не можете сбросить их позже, хотя Apple Music продолжит изменять свои предложения на основе ваших привычек прослушивания. </p> <p> Это лишь один из нескольких полезных <a href=\"https://www.makeuseof.com/tag/apple-music-features-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Функции Apple Music для использования </a> . </p> <p> Не беспокойтесь, есть еще несколько способов сбросить настройку Apple Music, отключив настройки Apple ID или удалив и воссоздав свою учетную запись Apple Music. </p> <p> У обоих вариантов есть свои плюсы и минусы, поэтому давайте разберемся, какой вариант лучше для вас. </p> <p> </p> <h2 id=\"turn-off-personalized-recommendations\"> Отключить персональные рекомендации </h2> <p> Отключение персонализированных рекомендаций для вашего Apple ID - хороший способ перестать видеть любые новые предложения. </p> <p> Отключение этой опции не приведет к удалению ваших существующих данных курирования, то есть приложение продолжит создавать предложения на основе вашего использования. Вы их просто больше не увидите. Отключение персонализированных рекомендаций также повлияет на ваши рекомендации в других сервисных приложениях Apple, таких как Apple Books. </p> <p> Вот как отключить персональные рекомендации на iPhone: </p> <ol> <li> Открой <strong> Apple Музыка </strong> приложение. </li> <li> Перейти к <b> Теперь слушай </b> таб. </li> <li> Откройте свой профиль Apple Music, выбрав круглый значок с силуэтом человека в правом верхнем углу экрана. Если вы ранее загрузили изображение в качестве изображения личного профиля, оно появится вместо силуэта. </li> <li> Выбирать <b> Посмотреть Apple ID </b> который можно найти, прокрутив вниз <b> Счет </b> страница. </li> <li> Выключать <b> Персональные рекомендации </b> . </li> <li> Выбирать <b> Сделанный </b> в правом верхнем углу, и все готово. </li> </ol> <p> <strong class=\"gallery__section-title\"> Галерея изображений (3 изображения) </strong> <img alt=\"Apple Music Lisen Now featuring Halle x Chloe\" src=\"images/apple-music-listen-now-page-713.jpg\" loading=\"lazy\"> Расширять <img alt=\"Apple Music Account Options Screenshot\" src=\"images/apple-music-account-page-914.jpg\" loading=\"lazy\"> Расширять <img alt=\"Apple ID Options Screenshot\" src=\"images/apple-id-account-page-817.jpg\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <p> После этого любой поиск новой музыки, загрузка или воспроизведение в Apple Music больше не будут влиять на ваши автоматические предложения. Это не приведет к автоматическому удалению ваших предыдущих поисков, что означает, что может потребоваться некоторое время, чтобы заметить эффекты этого метода. </p> <p> </p> <h2 id=\"delete-your-apple-music-profile\"> Удалить свой профиль Apple Music </h2> <p> Если вам требуется полная переделка Apple Music со свежими музыкальными предложениями, лучшим вариантом будет удаление и воссоздание вашего профиля Apple Music. </p> <p> Важно отметить, что удаление вашего профиля полностью удалит вашу текущую музыкальную библиотеку. Создание нового профиля позволит вам выбрать совершенно новую музыку и жанровые предпочтения, но также полностью удалит любую предыдущую историю Apple Music. </p> <p> </p> <p> Если вас интересует новый профиль Apple Music с недавно выбранными избранными, выполните следующие действия, чтобы создать его: </p> <ol> <li> От <strong> Теперь слушай </strong> вкладка, перейдите в Apple Music <strong> Счет </strong> , и выберите <b> Просмотреть профиль </b> . </li> <li> Выбирать <b> Редактировать </b> в центре экрана под вашим именем. </li> <li> Прокрутите экран вниз и выберите <b> Удалить профиль </b> . Имейте в виду, что это окончательное удаление, которое потребует сброса учетной записи. </li> <li> Настройте для себя новый профиль Apple Music, который теперь свободен от ваших старых настроек. Если вы отключили персональные рекомендации, как описано в предыдущем разделе, вы больше не будете получать индивидуальные музыкальные предложения. Уход <strong> Персональные рекомендации </strong> on приведет к тому, что Apple Music будет предлагать музыку в соответствии с вашими новыми привычками прослушивания. </li> <li> Просматривайте бесплатно и наслаждайтесь широким спектром недавно выбранных параметров звука. </li> </ol> <p> <strong class=\"gallery__section-title\"> Галерея изображений (2 изображения) </strong> <img alt=\"Apple Music Profile feat Halle x Chloe\" src=\"images/apple-music-profile-page-771.jpg\" loading=\"lazy\"> Расширять <img alt=\"Apple Music Profile Options Screenshot\" src=\"images/apple-music-edit-profile-page-450.jpg\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <p> </p> <h2 id=\"spotify-s-recommendations-might-be-better\"> Рекомендации Spotify могут быть лучше </h2> <p> Если вы все еще недовольны рекомендациями Apple Music даже после создания нового профиля, возможно, пришло время переключить платформу потоковой передачи музыки. Apple Music и Spotify имеют много схожих функций, но многие люди считают, что Spotify намного лучше предлагает новую музыку. </p> <p> Конечно, есть много других факторов, которые следует учитывать при выборе между Apple Music и Spotify. </p>"}