{"title":"Как создать или отредактировать узор в Adobe Illustrator","content":"<p> Создайте узор в Adobe Illustrator, и вы сможете быстро применить его к фигурам, обводкам и даже к тексту. Вы можете сделать что-то простое, например узор из точек, или сделать что-то более сложное. Вы даже можете использовать часть существующей векторной графики и превратить ее в узор. </p> <p> Узоры отлично подходят для фонов, текстур и многого другого. Вот как использовать инструменты рисования в Illustrator, а также как создавать и редактировать свои собственные узоры. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Использование шаблонов по умолчанию в Adobe Illustrator </h2> <p> В Illustrator встроено несколько шаблонов. Помимо того, что они полезны сами по себе, они также являются хорошим способом увидеть, как работают шаблоны. Эти шаблоны также дадут вам представление о том, как использовать ваши собственные шаблоны после их создания. </p> <p> </p> <p> Вы можете найти паттерны в окне «Образцы». Если он еще не открыт, перейдите к <strong> Окно&gt; Образцы </strong> из верхнего меню. В дополнение к сплошным цветам в окне «Образцы» уже могут быть некоторые узоры, но это не единственные узоры, которые есть в Illustrator. </p> <p> Щелкните значок <strong> Библиотека образцов </strong> в нижнем левом углу окна Swatch. Парить <strong> Шаблон </strong> , а затем выберите одну из библиотек образцов узоров. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Теперь вы можете применять эти образцы, как и к сплошным цветам. Здесь вы можете увидеть образцы из <strong> Природа - листва </strong> Библиотека применяется как для заливок и обводок, так и для текста. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> Как создать базовый повторяющийся узор в Illustrator </h2> <p> Вы можете превратить любой вектор в узор, будь то что-то, что вы уже разработали, или что-то, что вы создаете с этим конкретным намерением. Вы можете сделать это со всей векторной графикой, одним слоем или чем-то средним. </p> <p> Все, что вам нужно сделать, это выбрать то, что вы хотите превратить в узор, а затем перетащить его в окно Swatches. Например, вы можете перетащить этот кошачий глаз в свои Образцы. Это создаст образец узора, который затем можно использовать для заливки прямоугольника или любой другой формы. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> В качестве альтернативы вы можете сделать то же самое со всем вектором. В любом случае Illustrator создаст узор из того, что вы перетаскиваете в окно Swatches. Вы можете просто применить образец, как и любой обычный образец цвета. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Если дважды щелкнуть образец узора в окне «Образцы», откроется <strong> Параметры узора </strong> окно. Вы также можете открыть это прямо из <strong> Windows&gt; Параметры узора </strong> в верхнем меню. </p> <p> Здесь вы можете дополнительно редактировать свой узор, в том числе то, как он повторяется и насколько велики промежутки между каждой итерацией вашего изображения. Вы также редактируете свой дизайн выкройки прямо здесь. Версию изображения, которая не затемнена, можно редактировать как обычно. Вы можете менять цвета, перемещать слои и так далее. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> С окном параметров узора можно делать разные вещи. Вы можете, например, повторить свое изображение в шахматном расположении кирпича и уменьшить промежуток между каждой частью узора. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> Сложите части выкройки достаточно близко друг к другу, и вы сможете сделать так, чтобы они перекрывали друг друга. Поступая так, вы можете создать своего рода мозаичный узор, подобный показанному ниже. Попробуйте все настройки перекрытия в параметрах узора, чтобы найти то, что вам подходит. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> Как создать бесшовный узор в Adobe Illustrator </h2> <p> Если вы хотите создать бесшовный геометрический узор, вам нужно убедиться, что в вашем дизайне есть симметрия. Например, линия, которая начинается на 10 пикселей вверх с левой стороны вашего узора, должна заканчиваться на 10 пикселей вверх с правой стороны. Когда это повторится, эти точки нужно будет объединить. </p> <p> Для этого создайте новый документ с квадратными размерами. Включите наложение сетки, нажав <strong> Ctrl + &quot; </strong> ( <strong> Cmd + &quot; </strong> на Mac). Умные направляющие тоже полезны - включите их с помощью <strong> Ctrl + U </strong> ( <strong> Cmd + U </strong> на Mac). Если ваши линейки не видны, нажмите <strong> Ctrl + R </strong> ( <strong> Cmd + R </strong> на Mac), чтобы включить их. </p> <p> Вы также можете найти эти настройки в <strong> Вид </strong> в верхнем меню, но мы рекомендуем использовать <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Сочетания клавиш Illustrator </a> где можно сэкономить время. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Разместите свой дизайн в квадрате. Любые части, выходящие за края, должны быть выровнены с другой стороны. В <strong> Выровнять </strong> инструмент ( <strong> Окно&gt; Выровнять </strong> ) может помочь вам правильно согласовать вещи друг с другом. Щелкните и перетащите из линейки, чтобы создать свои собственные направляющие там, где они вам нужны. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> Также важно иметь цвет фона, даже если он белый. Убедитесь, что это идеально подходит к краям артборда, потому что вам нужно обрезать лишний материал. </p> <p> Выбрать все с помощью <strong> Ctrl + A </strong> ( <strong> Cmd + A </strong> на Mac), а затем нажмите <strong> Shift + M </strong> активировать <strong> Конструктор фигур </strong> инструмент. Это также можно найти в наборе инструментов. Удерживать <strong> Alt </strong> ( <strong> Вариант </strong> на Mac). Это ставит <strong> Конструктор фигур </strong> инструмент в режим вычитания. </p> <p> Когда вы наводите курсор на части вашего дизайна с помощью этого инструмента, вы должны видеть, что они немного меняют цвет. Щелкните области, которые вам не нужны, и Illustrator удалит эти части, оставив только те части, которые перекрываются с фоновым квадратом. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> Как только это будет сделано, выберите все и перетащите в свои образцы, чтобы превратить в узор. Чтобы использовать узор в новом документе, вы можете сохранить его в библиотеке образцов или использовать библиотеку Adobe Cloud. </p> <p> Кроме того, вы также можете просто скопировать его из этого окна Swatch и вставить в другое окно Swatch в другом документе. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Теперь вы можете применить этот узор так же, как и любой другой. Если вы все сделали правильно, все должно выровняться без зазоров. При необходимости внесите изменения в документ с выкройками. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> Когда следует использовать узоры в Adobe Illustrator? </h2> <p> Наиболее очевидное использование узоров - создание повторяющихся плиток для фона, но вы можете использовать их для заливки фигур, чтобы придать им текстуру. Текст с узором - еще одно хорошее применение, которое может сделать вашу типографику действительно выделяющейся. </p> <p> При желании вы даже можете создавать свои собственные узоры вручную, копируя и вставляя одно и то же изображение снова и снова. Могут быть случаи, когда вы захотите это сделать, но в большинстве случаев способность Illustrator автоматизировать создание узоров будет правильным решением. </p> <p> Это лишь один из многих способов, с помощью которых Illustrator может облегчить вашу жизнь, давая вам больше времени для работы над дизайном. </p>"}