{"title":"Как улучшить свои навыки редактирования в Lightroom: 10 простых способов","content":"<p> Adobe Lightroom - одна из самых известных платформ для редактирования фотографий на рынке. Это решение популярно не только потому, что в нем так много полезных функций, но и благодаря удобству в использовании. </p> <p> Когда фотографы хотят более серьезно отнестись к своему ремеслу, первое, что они сделают, - это купят программное обеспечение для редактирования. Но даже если вы просто любитель снимков, Lightroom предлагает множество способов удивить ваших друзей. </p> <p> В этом руководстве вы откроете для себя несколько простых способов улучшить свои фотографии в Lightroom. Эти советы подходят как для Lightroom Classic, так и для Lightroom Creative Cloud. </p> <h2 id=\"use-masking\"> 1. Используйте маскировку </h2> <p> Если вы увеличите резкость фотографии по умолчанию, вы добавите детали ко всему изображению - даже к нежелательным областям. Это может оставить много зерна в нежелательных местах, например, в небе или в воде. </p> <p> Вы также рискуете сделать свою фотографию больше похожей на рисунок, чем на то, что вы сняли на камеру. К счастью, есть простое решение. </p> <p> В приложении Lightroom прокрутите вниз до <strong> Деталь </strong> . Когда ты там, иди в <strong> Заточка </strong> &gt; <strong> Маскировка </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Прокрутите ползунок до тех пор, пока не будут выбраны те части изображения, которые вы хотите сделать резче. Чтобы увидеть, что вы маскируете, нажмите кнопку <strong> Alt </strong> одновременно нажмите клавишу на клавиатуре. </p> <p> После того, как вы замаскировали нужную область, прокрутите ползунок повышения резкости настолько, насколько вам нужно. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Используйте профили камеры вместо стандартных Adobe Ones. </h2> <p> Если вы загружаете изображение в формате RAW, Adobe по умолчанию добавит один из своих программных профилей. И хотя в некоторых случаях это может улучшить ваше изображение, часто лучше выбрать камеру для конкретной камеры. </p> <p> Когда вы используете профиль камеры, изображение станет легче редактировать в зависимости от того, что вы сняли на свое устройство. </p> <p> Чтобы изменить профиль фотографии, перейдите в <strong> Профили </strong> &gt; <strong> Соответствие камеры </strong> . Затем вы можете выбрать из <strong> Стандарт </strong> , <strong> Нейтральный </strong> , <strong> Пейзаж </strong> , и другие взгляды. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Помнить: </strong> вы не можете изменить профиль изображения с такой глубиной, если вы берете только файлы в формате JPEG. Итак, прежде чем пойти сделать несколько снимков, установите камеру на <strong> СЫРОЙ </strong> или же <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Нанесите кистью на части изображения. </h2> <p> Вы когда-нибудь повышали четкость, насыщенность или детализацию всего изображения в ожидании шедевра, но вместо этого получали изображение, которое выглядит так, как будто оно было снято в микроволновой печи? Если это так, вам может быть полезно настроить только часть изображения. </p> <p> В Lightroom вы можете получить доступ к функции под названием <strong> Щетка </strong> . Вы можете использовать это, чтобы «закрасить» части вашего изображения, оставив остальную часть в покое. </p> <p> Чтобы использовать этот инструмент, перейдите в <strong> Щетка </strong> значок в правой части экрана. Вы можете сделать кисть больше или меньше, в зависимости от того, какую часть изображения вы хотите редактировать. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Перед тем, как начать чистку, измените характеристики изображения, которые вы хотите настроить. Например, вы можете поднять ползунок четкости вверх, если хотите сделать одну часть изображения более четкой. </p> <p> После изменения этих функций проведите кистью по областям, которые хотите отредактировать. Нажмите <strong> O </strong> на клавиатуре, чтобы увидеть, где вы заметили. </p> <p> Если вы слишком много зашли в определенном месте, удерживайте <strong> Минус </strong> ( <strong> - </strong> ) И закрасьте эти части, чтобы стереть ваши правки. Зная <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> сочетания клавиш для Adobe Lightroom </a> пригодится в таких ситуациях, так что не забудьте освежить их в памяти! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Избегайте правонарушений на фотографиях </h2> <p> Иногда камера делает снимки, края которых имеют неестественные цвета. Вы особенно заметите это при съемке на ярком солнечном свете. В основном они бывают оттенков зеленого и фиолетового. </p> <p> Чтобы убрать границу на фотографиях, прокрутите вниз до <strong> Defringe </strong> . Вы можете избавиться от фиолетовой или зеленой бахромы. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> Использовать <strong> Количество </strong> чтобы решить, какую степень защиты от бровей вы хотите добавить. Перемещайте цветовую шкалу, пока не будете довольны результатом. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Используйте геометрию, чтобы выровнять фотографии </h2> <p> Как бы вы ни старались, удерживать камеру ровно будет сложно, если у вас нет штатива. Но благодаря волшебству программного обеспечения для редактирования ваши фотографии легко выпрямить. </p> <p> В Lightroom вы можете автоматически выравнивать фотографии, перейдя в <strong> Обрезать </strong> раздел. Однако есть более точный способ добиться того же результата. </p> <p> На правой вкладке выберите верхний вариант. Затем прокрутите вниз до <strong> Геометрия </strong> . Когда ты здесь, иди в <strong> В вертикальном положении </strong> &gt; <strong> Уровень </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> Также можно рисовать по прямым линиям, чтобы фото получилось максимально ровным. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Отрегулируйте размер области резкости. </h2> <p> Теперь вы знаете о маскировании, но знаете ли вы, что вы также можете повысить резкость определенных областей фотографии? </p> <p> Чтобы выбрать область на фотографии с маской, которую вы хотите повысить резкость, перейдите к <strong> Заточка </strong> , держи <strong> Alt </strong> ключ и направляйтесь к <strong> Радиус </strong> . Регулировка этого ползунка позволяет увеличивать или уменьшать область заточки. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> После этого подойдите к <strong> Заточка </strong> бар. Точно так же удерживайте <strong> Alt </strong> и переместите ползунок вправо. Это позволит вам повысить резкость определенной области фотографии, а не всего изображения. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Используйте кривые цветовой точки. </h2> <p> Если цвет вашего изображения не выглядит правильным даже после настройки баланса белого, вы можете проверить кривые цветовых точек в Lightroom. Вы можете использовать их для настройки определенных цветов в вашем изображении. </p> <p> В приложении вы найдете три панели с разными цветовыми кривыми: красную, синюю и зеленую. </p> <p> Чтобы перейти к этим цветовым кривым, прокрутите вниз до <strong> Точечная кривая </strong> . Затем щелкните цвет, который хотите изменить. Затем вы можете поиграть с цветами так же, как и на стандартном <strong> Точечная кривая </strong> таб. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Введите номер для каждого ползунка и настройте его соответственно. </h2> <p> Часто новые фотографы будут в восторге от количества доступных для них вариантов редактирования. Когда они открывают Lightroom, они сдвигают каждую полоску слишком далеко в любом направлении. Но вместо того, чтобы улучшить свой имидж, они попадают в ужасный беспорядок. </p> <p> При редактировании фотографий главное - вносить небольшие изменения. Скорее всего, вы уже являетесь хорошим фотографом, и снимок, который вы сделали, просто нуждается в небольшой постпроизводственной доработке. </p> <p> </p> <p> Вместо того, чтобы свободно перемещать каждый ползунок, попробуйте изменить число в областях, которые вы хотите изменить, с помощью <strong> +10 </strong> или же <strong> -10 </strong> . Если вы считаете, что требуется дополнительная работа, повторите процесс. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Когда вы почувствуете, что находитесь рядом, медленно перемещайте каждый ползунок влево или вправо, пока не почувствуете себя счастливым. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Обрежьте свои фотографии </h2> <p> Кадрирование может показаться очевидным, но многие фотографы до сих пор недооценивают эту функцию. Также важно обрезать изображения в зависимости от того, где вы собираетесь их использовать. В противном случае они исказятся. </p> <p> Чтобы кадрировать фотографии, перейдите в <strong> Обрезать </strong> икона. Это второй по высоте сверху. Перейти к <strong> Соотношение сторон </strong> , чтобы изменить размер, и перетащите углы, чтобы избавиться от нежелательных объектов. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> После того, как вы закончите обрезку, нажмите <strong> Входить </strong> на вашем компьютере, и изменения вступят в силу. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Используйте гистограмму </h2> <p> Гистограмму Lightroom легко игнорировать, но ее необходимо знать. Этот небольшой график покажет вам, где цвета и освещение неравны на вашем изображении, что позволит вам создать более четкое редактирование. </p> <p> Как правило, на гистограмме хорошо отредактированной фотографии будет несколько всплесков. Иногда это неизбежно. Но в целом вы должны стараться сделать график как можно более ровным. </p> <p> В зависимости от используемой версии Lightroom вы можете более или менее напрямую управлять гистограммой. В Lightroom Classic вы можете нажимать на гистограмму и даже что-то, перемещаясь по определенным разделам. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> В Creative Cloud гистограмма аналогичным образом отображается в верхнем правом углу, но вы должны сами изменить ползунки, чтобы гистограмма двигалась. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> В обеих версиях платформы гистограмма доступна в верхней части экрана над функциями редактирования. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> Отличный монтаж не только для профессионалов </h2> <p> Lightroom - отличное программное обеспечение для редактирования для всех, кто хочет вывести свою фотографию на новый уровень. И даже если вы никогда раньше не использовали платформу, вам не о чем беспокоиться, так как ей легко научиться. </p> <p> При редактировании фотографий в Lightroom помните, что чем меньше, тем лучше. Помимо рассмотрения этих советов, рекомендуется сделать шаг назад после редактирования и вернуться позже, чтобы посмотреть, так ли хорошо они отредактированы, как вы думали. </p>"}