{"title":"Как превратить вашу PS5 из вертикальной в горизонтальную (или наоборот)","content":"<p> PlayStation 5 работает как в вертикальном, так и в горизонтальном положении. Если вы передумаете о предпочтительной ориентации, довольно легко переместить PS5 из вертикального положения в горизонтальное (или наоборот). </p> <p> Давайте посмотрим, как безопасно переместить PS5 из вертикальной ориентации в горизонтальную на бок и обратно. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> Во-первых: выключите и отключите PS5 </h2> <p> Прежде чем выполнять какую-либо работу, физически перемещая PlayStation 5, важно выключить ее и все отсоединить от электросети. Это предотвратит повреждение системы, которое может произойти, если вы переместите ее, когда она включена. </p> <p> Вам следует полностью выключить PS5. Для этого нажмите кнопку <strong> Кнопка PS </strong> на вашем контроллере, чтобы вызвать быстрое меню в нижней части экрана. Выбирать <strong> Мощность </strong> справа и выберите <strong> Выключите PS5 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Подождите, пока погаснет свет вашей консоли, затем отсоедините кабель питания, кабель HDMI и все остальное, что вы подключили к системе. Теперь вы готовы изменить ориентацию вашей PS5. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Удалите винт подставки </h2> <p> Когда вы устанавливаете PS5 вертикально, вам нужно было вынуть прилагаемый винт из отсека в основании и использовать его, чтобы прикрепить базу к консоли, когда она находится вертикально. Таким образом, удаление этого винта - ваш первый шаг к изменению ориентации консоли. </p> <p> Осторожно переверните PS5 на бок, чтобы получить доступ к подставке внизу. Используйте отвертку с плоской головкой, монету или что-то подобное, чтобы открутить единственный серебряный винт, крепящий основание к системе. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Как только винт будет ослаблен, основание освободится. В основании есть небольшой отсек, в котором можно хранить винт. Защелкните его там, затем вставьте в маленькое отверстие, чтобы зафиксировать. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> Также в этом отсеке вы найдете небольшую черную пробку (если вы поместите ее туда во время первоначальной настройки). Удалите этот стопор и используйте его, чтобы закрыть отверстие в нижней части PS5, где вы только что вытащили винт. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Поверните базу </h2> <p> Теперь вам нужно повернуть основание, чтобы оно подходило к консоли в горизонтальной ориентации. Это также закроет небольшой отсек, в который вы поместили винт, еще больше закрепив его. </p> <p> Вы должны повернуть основание, если смотреть на него сверху (напротив того места, где вы только что хранили винт). Если вы относитесь к приподнятой части подставки как к «северу», вам нужно повернуть внешнюю часть подставки на «северо-запад», как показано ниже. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Это правильная ориентация для использования подставки в горизонтальном положении. Он щелкнет и мягко остановится, когда он окажется в нужном месте. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Установите подставку в горизонтальном положении </h2> <p> Теперь вы можете прикрепить подставку к PS5, когда она находится горизонтально. Убедитесь, что система установлена ​​правильно - логотип PS должен быть обращен вверх. </p> <p> На задней панели вашей системы, под двумя портами USB и рядом с ними, вы увидите символы контроллера PlayStation, отпечатанные на консоли. Наденьте внешние рычаги основы (которую вы только что повернули) на систему в том месте, где этот узор заканчивается с каждой стороны. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Надавите на зажимы, чтобы закрепить их, но имейте в виду, что в этом положении подставка не полностью зафиксирована на месте (как это происходит с винтом при вертикальном размещении). Будьте осторожны, когда кладете систему, и помните, что подставка может соскользнуть, если вы потянете за нее. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Теперь вы готовы использовать PS5 в горизонтальной ориентации. Подключите все кабели обратно и запустите его, чтобы вернуться к игре. Если у вас стандартная PS5, вы вставляете диски в этой ориентации лицевой стороной вверх. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> Как изменить горизонтальную ориентацию PS5 на вертикальную </h2> <p> Хотите вернуться к вертикальной ориентации для своей PS5 или, может быть, вы изначально настроили PS5 в горизонтальной форме и теперь хотите перейти в вертикальную? В любом случае легко выполнить описанный выше процесс в обратном порядке. Убедитесь, что вы выключили и сначала отключили PS5, если она в данный момент включена или находится в режиме покоя. </p> <p> </p> <p> Чтобы переключиться на вертикальную ориентацию, сначала поднимите PS5 и осторожно вытяните подставку из системы, чтобы снять ее. Затем вы должны повернуть внешний рычаг основания. Если смотреть на него сверху, рука должна быть «на север» на одной линии с приподнятой частью. Убедитесь, что вы чувствуете легкий щелчок, чтобы знать, что он находится в нужном месте. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> Расположите PS5 так, чтобы у вас был доступ к нижней части, затем удалите черную заглушку из отверстия посередине - она ​​расположена примерно посередине вентиляционных отверстий. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Поместите эту черную пробку в небольшое отверстие в отсеке на нижней стороне основания. Стопор должен встать на место. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> Затем выверните винт из того же отсека в основании. Теперь вам нужно установить подставку в правильное положение. Для этого поставьте PS5 так, чтобы задняя часть консоли была обращена вверх, как показано ниже. </p> <p> Возьмите подставку и поместите ее так, чтобы отверстие для винта совместилось с отверстием для винта, из которого вы только что сняли стопор. Разместите зажимы на кронштейне основания в задней части системы под разъемом питания. Подставка должна легко выровняться. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Теперь используйте отвертку или что-то подобное, чтобы затянуть винт. Когда вы закончите и почувствуете, что подставка надежно закреплена, вы готовы к использованию PS5 в вертикальном положении. Подключите все кабели, чтобы завершить работу. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> Стоит ли ставить PS5 вертикально или горизонтально? </h2> <p> Sony поддерживает использование вашей PS5 как в вертикальном, так и в горизонтальном положении, поэтому нет правильного или неправильного способа сделать это, если ваша система получает достаточный воздушный поток. Какую ориентацию вам следует использовать, зависит от ваших потребностей. </p> <p> </p> <p> Если у вас много места и вы не против, чтобы PS5 занимала много места по горизонтали, горизонтальный вид выглядит гладким. Для тех, кто пользуется стандартной моделью PS5, это также немного упрощает процесс установки дисков, поскольку этикетка всегда должна быть обращена вверх. Это немного сложнее запомнить с вертикальной ориентацией, когда этикетка диска должна быть обращена влево. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> Однако внутри вашей развлекательной системы может не хватить места для горизонтальной установки. В этих случаях лучше всего двигаться вертикально. В любом случае PS5 - огромная консоль, но в вертикальном положении она прекрасно сидит рядом с подставкой для телевизора или чем-то подобным. Я использую эту установку, как показано на изображении ниже. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> Какую бы ориентацию вы ни выбрали для PS5, обязательно используйте подставку. Он удерживает систему от земли, что улучшает воздушный поток. Подставка также защищает PS5, что затрудняет его опрокидывание и возможное повреждение. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> Настройте свою PS5 и приступайте к игре </h2> <p> Теперь вы знаете, как изменить вертикальное положение PS5 на горизонтальное и обратно всего за несколько минут. После того, как ваша система настроена, запустите ее и наслаждайтесь некоторыми из лучших игр для PS5. </p> <p> Не забывайте, что почти вся библиотека PS4 работает и на PS5, что дает вам гораздо больше удовольствия. </p> <p> <small> Кредит изображения: Алекс Ван Акен / <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}