{"title":"Как исправить код остановки BSOD «ИСКЛЮЧЕНИЕ СИСТЕМНОЙ НИТИ НЕ ОБРАБОТАНО» в Windows 10","content":"<p> «SYSTEM THREAD EXCEPTION NOT HANDLED» - это распространенная ошибка Windows 10, которая возникает в основном из-за устаревшего или несовместимого драйвера. </p> <p> Что делает его более сложным для исправления, чем другие BSOD, так это то, что проблема может быть вызвана несколькими драйверами, и иногда ваш компьютер может не обнаружить их все. Вот почему первый шаг, который пользователи должны предпринять при устранении этой ошибки, - это найти точный драйвер, который вызывает проблему. </p> <p> Вот как вы исправляете ошибку исключения системного потока, которая не обрабатывается в Windows 10. </p> <h2 id=\"boot-into-safe-mode\"> 1. Загрузитесь в безопасном режиме. </h2> <p> Первый шаг, который пользователи должны сделать, прежде чем пытаться решить эту проблему, - это загрузить свой компьютер в безопасном режиме. В зависимости от ваших предпочтений и от того, можете ли вы загрузить компьютер с экрана входа в систему, есть несколько способов сделать это: </p> <h3 id=\"boot-into-safe-mode-via-settings\"> Загрузитесь в безопасном режиме через настройки </h3> <ol> <li> Нажми на <strong> Начинать </strong> кнопку, затем выберите <strong> Настройки </strong> . </li> <li> Перейдите к <strong> Обновление и безопасность </strong> затем нажмите на <strong> Восстановление </strong> . </li> <li> Под <strong> Расширенный запуск, </strong> нажмите на <strong> Перезагрузить сейчас. </strong> </li> <li> Когда ваш компьютер перезагружает <strong> Выберите опцию </strong> экран должен появиться. </li> <li> Отсюда перейти к <strong> Устранение неполадок&gt; Дополнительные параметры&gt; Параметры запуска </strong> . Затем нажмите на <strong> Запустить снова </strong> </li> <li> Когда ваш компьютер перезагрузится, нажмите <strong> F5 </strong> чтобы загрузить ваш компьютер в <strong> Безопасный режим с поддержкой сети </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> С экрана входа в систему </h3> <ol> <li> Просто удерживайте <strong> Сдвиг </strong> и выберите <strong> Мощность </strong> кнопка, за которой следует <strong> Запустить снова </strong> . </li> <li> Выполните шаги 4, 5 и 6 из раздела выше. </li> </ol> <h3 id=\"from-a-blank-screen\"> С пустого экрана </h3> <ol> <li> Если вам не удается перейти на экран входа в систему, выполните следующие действия. </li> <li> Удерживайте кнопку питания на устройстве в течение 10 секунд, чтобы выключить его. </li> <li> Нажмите кнопку питания еще раз, чтобы загрузить его. </li> <li> Как только ваш компьютер запустится, т. Е. Появится логотип производителя, снова нажмите кнопку питания и удерживайте 10 секунд. </li> <li> Нажмите кнопку питания, чтобы запустить устройство. </li> <li> Если все сделано правильно, ваш компьютер загрузится в <strong> Среда восстановления Windows </strong> . </li> <li> Выполните шаги 4, 5 и 6 из первого раздела. </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. Определение ответственного водителя </h2> <p> Поскольку ошибка, скорее всего, вызвана неисправным драйвером, вы можете использовать журнал Windows, чтобы узнать, какой из них. </p> <p> Для этого просто выполните следующие действия: </p> <ol> <li> Нажмите <strong> Клавиша Windows + R </strong> и в <strong> Запустить </strong> диалоговое окно, введите <strong> eventvwr. </strong> </li> <li> Перейдите к <strong> Журналы Windows </strong> меню и разверните его, затем выберите <strong> Система. </strong> </li> <li> Найдите журнал с именем <strong> system_thread_exception_not_handled </strong> и щелкните по нему, чтобы узнать, какой драйвер вызывает проблему. </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> Обычно связанный драйвер будет драйвером дисплея или сетевым драйвером, поскольку они печально известны тем, что вызывают этот BSOD. Если связанный файл окажется <strong> nvlddmkm.sys </strong> , вы можете взглянуть на <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> несколько простых способов исправить это. </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. Откатить или обновить драйверы </h2> <p> В зависимости от того, какой драйвер отвечает за ошибку, не обработанную исключением системного потока, вам может потребоваться обновить или переустановить связанные драйверы. </p> <p> Если драйвер не обновлялся в течение долгого времени, обновление драйвера, скорее всего, решит проблему. Если драйвер был обновлен недавно, возможно, лучше откатить драйвер или переустановить обновления. </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> Как обновить драйверы в Windows 10 </h3> <ol> <li> Нажмите <strong> Клавиша Windows + R </strong> и введите <strong> devmgmt.msc </strong> открыть <strong> Диспетчер устройств </strong> . </li> <li> Перейдите к связанному устройству и разверните меню. Например, если ошибка была вызвана драйвером дисплея, вам придется развернуть <strong> Видеоадаптеры </strong> вариант. </li> <li> Щелкните драйвер правой кнопкой мыши и выберите <strong> Обновить драйвер </strong> . </li> <li> В открывшемся диалоговом окне нажмите на <strong> Автоматический поиск обновленного программного обеспечения драйвера </strong> . </li> <li> Затем Windows автоматически найдет в Интернете самые свежие драйверы и установит их. </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> Как откатить драйверы в Windows 10 </h3> <ol> <li> Открыть <strong> Диспетчер устройств </strong> и перейдите к соответствующему драйверу. </li> <li> Разверните меню и щелкните драйвер правой кнопкой мыши. </li> <li> Нажмите на <strong> Характеристики </strong> . </li> <li> Под <strong> Водитель </strong> вкладку, нажмите на <strong> Откат драйвера </strong> . </li> <li> Windows автоматически вернется к последней доступной версии драйвера. </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. Переименуйте неисправный файл. </h2> <p> После получения имени файла, связанного с ошибкой необработанного исключения системного потока, пользователи должны переименовать файл. Это заставит Windows создать новую копию и переустановить ее. Файлы драйвера расположены по адресу <strong> C: \\ Windows \\ System32 \\ драйверы </strong> </p> <p> Выполните следующие действия, чтобы переименовать файл: </p> <ol> <li> Открыть <strong> Проводник </strong> и перейти к <strong> C: \\ Windows \\ System32 \\ драйверы </strong> </li> <li> Найдите пострадавшего водителя </li> <li> Щелкните по нему и нажмите <strong> F2. </strong> </li> <li> Замените расширение имени файла на <strong> .Старый </strong> . </li> <li> Нажмите Enter и перезагрузите компьютер. </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. Используйте SFC и DISM для восстановления системных файлов. </h2> <p> SFC и DISM - два мощных инструмента, доступных каждому пользователю Windows. В сочетании они могут найти и исправить практически любые системные ошибки. Их также довольно просто выполнить. </p> <p> </p> <p> Обязательно создайте точку восстановления системы, поскольку эти команды изменяют системные файлы. </p> <h3 id=\"how-to-use-dism\"> Как использовать DISM </h3> <ol> <li> Запустить <strong> Командная строка </strong> как администратор </li> <li> В консоли введите <strong> DISM / Онлайн / Очистка-Образ / ScanHealth </strong> и нажмите Enter. </li> <li> Подождите, пока Windows завершит сканирование. Затем введите <strong> DISM / Online / Очистить образ / RestoreHealth </strong> </li> <li> Windows устранит все проблемы, обнаруженные во время сканирования. </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> Как использовать SFC </h3> <ol> <li> В строке поиска меню Пуск введите <strong> cmd </strong> затем щелкните правой кнопкой мыши <strong> Командная строка </strong> и запускаем от имени администратора. </li> <li> В консоли введите <strong> sfc / scannow </strong> </li> <li> Будьте терпеливы, так как Windows потребуется время для сканирования и замены поврежденных системных файлов. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. Используйте Восстановление системы, чтобы восстановить ваш компьютер. </h2> <p> Если проблема все еще остается нерешенной, вам придется использовать Восстановление системы в крайнем случае. Восстановление системы - это функция, которая восстанавливает более раннее состояние Windows. Эти точки восстановления создаются периодически и при установке нового программного обеспечения. В качестве альтернативы вы можете установить <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows для ежедневного создания точки восстановления </a> </p> <h3 id=\"how-to-use-system-restore\"> Как использовать восстановление системы </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> В строке поиска меню Пуск введите <strong> Панель управления </strong> и нажмите &quot;Открыть&quot;. </li> <li> В строке поиска панели управления введите <strong> Восстановление </strong> и откройте его из результатов. </li> <li> Нажмите на <strong> Открыть восстановление системы </strong> . </li> <li> Нажмите на <strong> Следующий </strong> и выберите точку восстановления из списка. </li> <li> Нажмите на <strong> Заканчивать. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> Исключение обработано </h2> <p> Перечисленные выше советы предоставляют простое решение для неприятностей, которые вызывают BSOD, такие как system_thread_exception_not_handled. Самое приятное то, что большинство советов можно использовать для диагностики множества других распространенных ошибок типа &quot;синий экран смерти&quot; (BSOD) в Windows. </p>"}