{"title":"HBO Max выйдет в Латинской Америке в июне","content":"<p> HBO Max, потоковый сервис от WarnerMedia, запускается в Латинской Америке и Карибском бассейне в июне 2021 года. Это первый раз, когда сервис будет доступен за пределами США. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> Где запускается HBO Max в Латинской Америке? </h2> <p> На данный момент HBO Max доступен только в США. В конце июня 2021 года он будет доступен во многих странах Латинской Америки и Карибского бассейна. Новость была объявлена ​​в <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> Пресс-релиз WarnerMedia </a> . </p> <p> В частности, это следующие страны: Ангилья, Антигуа, Аргентина, Аруба, Британские Виргинские острова, Багамы, Барбадос, Белиз, Боливия, Бразилия, Каймановы острова, Чили, Колумбия, Коста-Рика, Кюрасао, Доминика, Доминиканская Республика, Эквадор, Сальвадор. , Гренада, Гватемала, Гайана, Гаити, Гондурас, Ямайка, Мексика, Монтсеррат, Никарагуа, Панама, Парагвай, Перу, Сент-Китс и Невис, Сент-Люсия, Сент-Винсент, Суринам, Тринидад и Тобаго, Теркс и Кайкос, Уругвай , и Венесуэла. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> Что будет предлагать HBO Max в Латинской Америке? </h2> <p> </p> <p> Существующие подписчики HBO GO, которые платят напрямую или через «подходящих партнеров», получат мгновенный доступ к HBO Max. Затем HBO GO будет прекращен во всех регионах. </p> <p> Подробная информация о ценах не разглашается, но обещана в ближайшие месяцы вместе с информацией о новом контенте и рекламных предложениях. </p> <p> Как и в США, HBO Max будет предлагать различные пакеты подписки и устройства поддержки, такие как смартфоны, планшеты и другие интеллектуальные платформы. </p> <p> </p> <p> В трейлере, объявляющем новости, можно увидеть отрывки из таких сериалов, как «Игра престолов» и «Друзья», а также таких фильмов, как «Матрица» и «Касабланка». Однако в конце появляется небольшое сообщение, предупреждающее, что «не все заголовки [будут] доступны при запуске». </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> Когда HBO Max станет доступен во всем мире? </h2> <p> В прошлом году Warner Bros. неоднозначно заявила, что планирует выпустить на HBO Max всю свою театральную серию 2021 года. Это вызвало у директора <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Кристофер Нолан назовет HBO Max «худшим стриминговым сервисом» </a> . </p> <p> Тем не менее, хотя некоторые в киноиндустрии могут ныть, для потребителей это отличный шаг в пользу выбора. </p> <p> Таким образом, жители Латинской Америки и Карибского бассейна, вероятно, будут рады запуску HBO Max в надежде, что сделка будет применима и к ним. </p> <p> Что до остального мира? Точные сроки не установлены, но WarnerMedia сообщила, что в Северной Европе, Испании, Центральной Европе и Португалии планируется перейти на HBO Max в конце этого года. </p> <p> Йоханнес Ларчер, глава HBO Max International, сказал: </p> <blockquote> <p> Мы очень рады запуску HBO Max в Латинской Америке и Карибском бассейне, который является первым шагом на пути к предоставлению услуги WarnerMedia Direct-to-Consumer потребителям за пределами США и по всему миру. </p> </blockquote>"}