{"title":"Как защитить ваши личные данные от работодателей","content":"<p> Технологии видеонаблюдения широко распространены как в офисе, так и за его пределами. Многие работодатели используют продукты для управления мобильными устройствами для корпоративных устройств, таких как телефоны, ноутбуки и планшеты. Они содержат программы, предназначенные для защиты предприятий от краж, корпоративного шпионажа или злонамеренных действий. </p> <p> Однако, хотя все это отлично подходит для защиты вашей компании, это не совсем лучший вариант для вас. Это больше не вопрос <strong> если </strong> ваша компания отслеживает вас; Следующее, что вам нужно спросить, - сколько данных действительно могут найти компании? Удивительно, но много. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> Что работодатели видят на корпоративных Wi-Fi и удаленных устройствах? </h2> <p> Большинство людей не осознают, в какой степени компании имеют доступ к их данным или какую часть из них они подписывают при использовании корпоративных устройств. Вот несколько примеров. </p> <h3 id=\"location\"> Место расположения </h3> <p> Многие сотрудники думают, что использования виртуальной частной сети (VPN) достаточно, чтобы их работодатели поверили, что они там, где должны быть. </p> <p> Хотя есть способы скрыть свое реальное местоположение на личном устройстве, это не совсем надежно, особенно при входе в любое приложение или веб-сайт с адресом электронной почты или номером мобильного телефона, выданным компанией. </p> <p> </p> <p> Скрыть свое настоящее местоположение при использовании корпоративных устройств может быть практически невозможно. Например, телекоммуникационные компании могут определить, когда вы подключились к любому из их партнеров по роумингу. </p> <p> Кроме того, корпоративные VPN отличаются от коммерческих VPN, шлюзы которых контролируются внутренними ИТ-командами. </p> <h3 id=\"notes-documents-and-emails\"> Заметки, документы и электронные письма </h3> <p> Если вы думаете, что никто не знает, что вы использовали корпоративный Wi-Fi для поиска следующей работы, вы ошибаетесь. Даже если вы не используете корпоративный адрес электронной почты, многие компании имеют предустановленные программы на корпоративных ноутбуках, которые включают журналы активности в реальном времени, обновления истории просмотров и синхронизированные скриншоты открытых документов и электронных писем. </p> <p> Для защиты от возможных утечек данных многие компании также используют их в качестве механизмов отчетности или трекеров производительности. </p> <p> </p> <h3 id=\"online-messaging-history\"> История обмена сообщениями в Интернете </h3> <p> Несмотря на рост числа зашифрованных платформ, реальность такова, что ваши сообщения не являются полностью конфиденциальными на корпоративных устройствах. При использовании платформ обмена сообщениями компании могут не видеть точные сведения о ваших обменах, но, вероятно, все равно смогут распознать метаданные, такие как размер и тип файла. </p> <p> При этом, если вы решите отправлять файлы PDF большого размера через приложение, такое как WhatsApp, система обнаружения вторжений вашей компании, скорее всего, отметит вас подозрительным поведением. В соответствии с корпоративными правилами они могут попросить вас доказать, что ваши действия не были злонамеренными, и, возможно, потребуется запросить одобрение руководства для получения разрешения. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> Как не делиться личными данными с вашим работодателем </h2> <p> Не существует абсолютного способа постоянно держать вашу личную информацию, разговоры и действия вне досягаемости. Однако есть несколько способов снизить риски. </p> <p> Мы не поддерживаем сокрытие данных от ваших работодателей; фактически, они имеют право собирать информацию о своих сотрудниках, даже если они <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> возможность отслеживать вас на законных основаниях </a> . Но вам нужно знать, когда уместно держать вещи при себе, и это зависит от отдельных компаний. </p> <h3 id=\"read-company-policies\"> Ознакомьтесь с политикой компании </h3> <p> Прежде чем вы сможете спорить о прозрачности данных, вы также должны понимать, какую информацию вы сознательно предоставляете своему работодателю, работая на него. Только зная, чего от вас ждут, вы сможете установить соответствующие профессиональные границы. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Стремитесь понять политику и процедуры сбора данных компании до того, как они будут собраны. Отсюда вы можете эффективно составить план отказа от предоставления дополнительной информации, чем необходимо. </p> <h3 id=\"use-personal-gadgets\"> Используйте личные гаджеты </h3> <p> Хотя всегда есть соблазн использовать корпоративные устройства для экономии денег, на самом деле ничто не бывает бесплатным. Инвестируйте в ноутбуки, мобильные телефоны и планшеты для личного пользования. </p> <p> Наличие отдельных личных устройств - также отличный способ установить границы, особенно при удаленной работе. </p> <p> Использование собственного устройства дает вам возможность устанавливать и управлять различными методами безопасности, необходимыми для защиты ваших данных от посторонних глаз. Это может показаться ненужным расходом, но он имеет большое значение для сохранения вашего душевного спокойствия. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Используйте гостевые профили на личных устройствах </h3> <p> Подключение к любой чужой сети всегда представляет угрозу безопасности, даже если она находится на рабочем месте. Вход в корпоративный Wi-Fi дает вашему работодателю разрешение на доступ ко всему, от метаданных ваших сообщений до журналов истории просмотров. </p> <p> Если вам абсолютно необходимо использовать свой личный ноутбук в корпоративных сетях, вы можете выбрать использование гостевого профиля, чтобы уменьшить объем данных, к которым они могут получить удаленный доступ. Кроме того, вы можете подключиться к тарифному плану вашего личного мобильного телефона или портативному устройству Wi-Fi. </p> <h3 id=\"keep-your-passwords-safe\"> Храните свои пароли в безопасности </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Создание надежных паролей </a> недостаточно. Вам необходимо убедиться, что ваши пароли не сохраняются на устройствах компании. Сохранение личных паролей для учетных записей онлайн-банкинга, личной электронной почты или государственных веб-сайтов на гаджетах, которыми вы не владеете, подвергает ваши данные непосредственному риску в случае взлома базы данных вашей компании. </p> <p> Используйте только свой личный мобильный телефон или ноутбук для доступа к важным учетным записям, особенно к тем, в которых используются деньги. По возможности включайте двухфакторную аутентификацию. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> Разделите свою работу и личную жизнь </h2> <p> Работодатели имеют право на удаленный доступ к устройству, выпущенному вашей компанией, если они подозревают, что вы участвуете в какой-либо форме незаконной деятельности, подвергая риску информацию компании, или если они запрошены правоохранительными органами для расследования. </p> <p> Однако это отличается от личных устройств. </p> <p> Ваша безопасность настолько сильна, насколько сильны люди, с которыми вы общаетесь, включая вашего работодателя. Разделение личных и рабочих устройств - это всего лишь один шаг к децентрализации ваших данных. Применяя строгие меры безопасности, вы можете ограничить количество точек доступа хакеров к документам, электронной почте и сетям. </p> <p> Децентрализация личных данных необходима, поскольку она защищает вас как отдельного человека и вашу компанию от краж, мошенничества и других форм киберпреступлений. </p>"}