{"title":"Как управлять группами пользователей с помощью Groupadd в Linux","content":"<p> Управление пользователями довольно простое, если вы используете Linux на своем персональном компьютере. Но для тех, у кого есть сервер с тысячами пользователей, управление становится серьезной проблемой, о которой следует позаботиться. </p> <p> К счастью, операционные системы на базе Linux предоставляют вам возможность контролировать пользователей в вашей системе и управлять ими. Вы можете создавать группы и добавлять в них пользователей. Затем вместо того, чтобы назначать разрешения каждому пользователю в системе, вы можете легко авторизовать группы пользователей, предоставив им привилегии, связанные с рабочим процессом системы. </p> <h2 id=\"create-user-groups-on-linux\"> Создание групп пользователей в Linux </h2> <p> В Linux есть команда по умолчанию для создания групп пользователей. Вы можете использовать <strong> groupadd </strong> для добавления новых групп в вашу систему. Основной синтаксис команды: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> Чтобы создать новую группу пользователей «писатели»: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> Выполнение вышеупомянутой команды добавит новую запись в <strong> / etc / group </strong> а также <strong> / etc / gshadow </strong> файлы в вашей системе. Вы можете проверить новую запись группы в файлах, набрав <strong> кот / и т. д. / группа </strong> а также <strong> кошка / etc / gshadow </strong> в вашем терминале. </p> <p> Обратите внимание, что только пользователи с правами администратора могут создавать группы пользователей. Не забудьте переключиться на суперпользователя перед выполнением команды groupadd. </p> <p> Если вы попытаетесь создать группу с уже существующим именем, вы увидите сообщение об ошибке: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> Однако вы можете отклонить ошибку, используя <strong> -f </strong> или же <strong> --сила </strong> флаг с командой. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Создавайте группы пользователей с уникальным GID </h3> <p> Когда вы создаете новую группу пользователей, система автоматически присваивает ей Group ID или GID. Если вы хотите, чтобы у вашей группы был определенный идентификатор группы, вы можете сделать это с помощью <strong> -грамм </strong> или же <strong> --gid </strong> флаг. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Если вы попытаетесь назначить идентификатор группы, который уже был занят, произойдет следующая ошибка. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Хотя это не рекомендуется, но вы можете добавить <strong> -о </strong> или же <strong> - неуникальный </strong> флаг для принудительного присвоения идентификатора группы. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Создание групп пользователей с паролем </h3> <p> Хотя вы можете добавить пароль к своим группам, они бесполезны для пользователя. В <strong> -п </strong> flag позволяет вам указать пароль для вашей группы пользователей. </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Создание системных групп в Linux </h3> <p> Между системными группами и обычными группами есть небольшая разница. Системные группы - это особые группы, в которые входят пользователи, ответственные за выполнение системных операций, таких как резервное копирование и обслуживание. </p> <p> Использовать <strong> -р </strong> или же <strong> --система </strong> флаг для создания системной группы в Linux: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Получить список участников в группе пользователей </h3> <p> Чтобы узнать, сколько членов входит в определенную группу, вы можете использовать <strong> getent </strong> команда с вашего терминала. Следующая команда отобразит список всех членов, присутствующих в группе «писателей»: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Добавить пользователей в группы </h2> <p> Теперь, когда вы создали группу пользователей в своей системе, пора добавить в нее пользователей. Usermod - это мощная утилита командной строки, поскольку она содержит различные параметры, связанные с управлением пользователями и модерацией. Это также позволяет легко добавлять пользователей в вашу группу. Основной синтаксис команды: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Добавить существующего пользователя в группы </h3> <p> Если вы хотите добавить существующего пользователя в свою группу, <strong> -а </strong> а также <strong> -ГРАММ </strong> флаги - это то, что вам нужно. В <strong> -ГРАММ </strong> флаг обозначает группы, тогда как <strong> -а </strong> означает добавление, добавление или добавление. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> Вы также можете добавить пользователя в несколько групп. Все, что вам нужно сделать, это ввести имена групп через запятую. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Добавить нового пользователя в группу </h3> <p> Вы можете использовать <strong> useradd </strong> команда, когда вы хотите <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> добавить нового пользователя в вашу систему Linux </a> . Useradd предоставляет вам возможность назначить группу пользователю во время ее создания. В <strong> -ГРАММ </strong> Флаг позволяет указать пользователю группу. </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> Также легко добавить пользователя в несколько групп. Просто передайте имена групп, разделенные запятыми, в команде по умолчанию. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Удалить пользователей из группы </h2> <p> Вы также можете удалить пользователей из группы, используя <strong> usermod </strong> . Имейте в виду, что в системе Linux пользователю может быть назначено несколько групп. Одна из этих групп объявлена ​​первичной группой, а другие называются вторичными группами. </p> <p> Если вы пытаетесь удалить пользователя из группы, убедитесь, что после удаления у него есть хотя бы одна основная группа. Например, «случайный» пользователь входит в состав групп «администратор», «писатели» и «редакторы»; где admin - основная группа, а остальные - вторичные группы. </p> <p> Вы можете удалить пользователя только из группы писателей и редакторов. И для этого вы должны передать имя группы, членом которой вы хотите, чтобы пользователь оставался членом. Это означает, что для удаления пользователя &#39;random&#39; из редакторов группы используется следующая команда: </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> Обратите внимание, что все, что вам нужно было сделать, это снять <strong> добавить флаг (-a) </strong> из команды, которую вы используете для добавления пользователя в группу. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Удалить группы в Linux </h2> <p> Если вы больше не хотите сохранять группу пользователей в своей системе, вы можете удалить группу с помощью <strong> Groupdel </strong> команда. Синтаксис команды: </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> Для удаления группы пользователей «писатели»: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Если вы попытаетесь удалить несуществующую группу, вы получите сообщение об ошибке: </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Управление группами пользователей в Linux </h2> <p> Управление пользователями может быть трудным, если вы не знаете, какие команды Linux вам нужно использовать. Это становится действительно легко, если вы знаете, как входить и выходить из команд, связанных с модерацией и управлением. </p> <p> Администраторы серверов должны стараться использовать дистрибутивы Linux, которые хорошо подходят для их нужд. Таким образом, они сразу получат все инструменты и утилиты, необходимые для управления сервером. </p>"}