{"title":"Как установить умный контроллер гаражных ворот","content":"<p> Хотите управлять воротами гаража с помощью смартфона или планшета? Умный контроллер - отличный вариант, если в вашем доме уже установлено устройство для открывания гаражных ворот. </p> <p> Мы покажем вам, как установить умный контроллер гаражных ворот. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Различия между открывателем и контроллером </h2> <p> Есть два основных различия между интеллектуальным устройством открывания гаражных ворот и контроллером. Первое - это размер. </p> <p> Большинство открывателей большие и крепятся к потолку гаража. Они используют механическую направляющую, чтобы открывать и закрывать дверь. С другой стороны, контроллер гаражных ворот представляет собой небольшой электронный блок, который позволяет вам управлять открывателем с помощью приложения на интеллектуальном устройстве. </p> <p> Второе различие между этими двумя продуктами - цена. Устройство открывания гаражных ворот может стоить около 300 долларов. Для установки этих открывателей обычно требуется помощь профессионального установщика. </p> <p> Однако контроллер обычно не требует профессиональной установки. Вместо этого контроллер функционирует как дополнение к существующему открывателю. </p> <p> Это означает, что за небольшую часть цены нового открывателя вы можете достичь той же функциональности, просто используя контроллер. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> Каковы преимущества умных гаражных ворот? </h2> <p> Умные гаражные ворота обладают тремя основными преимуществами. </p> <ul> <li> <strong> Безопасность </strong> - Умные гаражные ворота позволяют открывать и закрывать дверь практически из любого места. </li> <li> <strong> Безопасность </strong> - Большинство интеллектуальных устройств открывания гаражных ворот и контроллеров предупреждают вас, когда ваш гараж открыт в течение определенного времени. </li> <li> <strong> Удобство </strong> - Если вам когда-либо приходилось возвращаться домой, чтобы закрыть гаражные ворота, то наличие приложения для умных гаражных ворот сэкономит время. Вместо того, чтобы ехать домой, просто вытащите телефон. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> Как установить умный контроллер гаражных ворот </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Если вы решили, что контроллер умных гаражных ворот подходит именно вам, то это руководство покажет вам, как его установить. В этой демонстрации <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meross MSG100 </a> используется, но этот процесс аналогичен при использовании другого бренда. За подробностями обращайтесь к документации вашего контроллера. </p> <h3 id=\"what-you-ll-need\"> Что вам понадобится </h3> <ul> <li> Умный гаражный контроллер </li> <li> Скрепочный пистолет или крепления для проволоки </li> <li> Установлены гаражные ворота с автоматическим открыванием </li> <li> Отвертки Philips и шлицевые </li> <li> Лестница </li> </ul> <h3 id=\"plan-the-installation\"> 1. Спланируйте установку </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Прежде чем установить контроллер, вам нужно осмотреть несколько мест в гараже. Первый - это источник питания для контроллера. Второй - это путь провода от контроллера к датчику на двери, входящему в комплект. И третье - расположение магнитного датчика. </p> <p> Этот магнитный датчик позволяет контроллеру знать, когда дверь открывается или закрывается. </p> <p> Большинство контроллеров используют длинный провод для подключения к дверному датчику. Вам нужно будет провести этот провод через потолок или вниз по стене, чтобы он не мешал. </p> <p> После того, как вы спланировали установку, проверьте, правильно ли подсоединен провод датчика от контроллера к месту расположения датчика. Эта тестовая подгонка гарантирует, что провод датчика достигает вашего контроллера. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Отключите питание открывателя гаражных ворот. </h3> <p> Большинство гаражных ворот подключаются к электросети где-то в потолке. Что касается этих открывателей, вы должны убедиться, что они отключены, прежде чем продолжить. </p> <p> Если у вашего открывателя нет вилки и вместо этого он прикреплен к проводке, выходящей из потолка, вам нужно найти коробку выключателя и отключить там питание открывателя. </p> <p> <strong> Примечание: </strong> Домашний ток 120 В может стать причиной серьезных травм. Если вам неудобно работать с электричеством, остановитесь сейчас и проконсультируйтесь с профессиональным установщиком гаражных ворот и / или электриком. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Подключите прилагаемые провода к контроллеру. </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> На блоке Meross есть набор синих и коричневых проводов, которые необходимо подключить к контроллеру для подключения к механизму открывания гаражных ворот. Откройте пластиковую крышку на контроллере, и вы увидите две винтовые клеммы. </p> <p> С помощью небольшой шлицевой отвертки ослабьте винты на каждой клемме. Вставьте провода и затяните винты. Неважно, какой провод куда идет. </p> <p> Осторожно потяните за провода, чтобы убедиться, что они надежно закреплены. Затем установите крышку контроллера. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Установите контроллер ворот гаража. </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Поскольку вы спланировали свои местоположения, пришло время установить контроллер. Убедитесь, что контроллер находится в месте, где он может получить доступ к необходимому питанию, не подвергая нагрузку никакую проводку. </p> <p> Затем снимите липкую подложку с контроллера и прижмите ее. Если у вас есть контроллер с винтовым креплением, используйте отвертку, чтобы закрепить контроллер на месте. </p> <h3 id=\"mount-the-sensor\"> 5. Установите датчик. </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> Далее вам нужно установить датчик на дверь. Рекомендуется размещать этот датчик так, чтобы он не загораживал путь двери. </p> <p> Кроме того, у вас может возникнуть соблазн установить датчик рядом с землей. Это не рекомендуется, так как частые брызги воды прямо на датчик могут повредить его. После того, как вы разместили датчик, используйте прилагаемый двусторонний скотч или винты, чтобы закрепить его. </p> <p> На фото выше черный датчик был установлен рядом с воротами гаража, а магнитная часть была прикреплена к самой двери. Для крепления этого датчика используется двусторонний скотч. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Подключите провода датчика. </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Пришло время подключить провода к датчику и контроллеру. Используя план, который вы составили на первом этапе, проложите провода и с помощью скобозабивателя прикрепите провода к стене или потолку. </p> <p> Не переживайте и не перекручивайте провода, так как это может привести к их повреждению. Когда они разводятся, подсоедините красный стыковой разъем &quot;мама&quot; на контроллере к стыковому красному разъему &quot;папа&quot; на конце провода датчика. </p> <p> Затем вам нужно открыть крышку устройства открывания гаражных ворот. Должно быть четыре провода, два управляющих питания и общий для устройства, а два управляющих кнопкой на стене. </p> <p> </p> <p> Обычно эти провода идут от потолка и должны иметь гофрированные плоские клеммы, прикрепляющие их к блоку открывания гаражных ворот. Если вы не можете определить, какие провода какие, остановитесь и обратитесь к руководству по эксплуатации устройства открывания гаражных ворот или проконсультируйтесь с сертифицированным электриком. </p> <p> Если вы нашли провода, подключите коричневый и синий провода от контроллера к клеммам на открывателе, которые подключены к настенной кнопке. На фото выше провода контроллера вставлены в два крайних левых вывода. </p> <p> Когда вы закончите, к каждой клемме настенной кнопки должно быть подключено два провода. Повторно закрепите крышку устройства открывания гаражных ворот, подключите контроллер и устройство открывания, и установка должна быть завершена. </p> <p> На следующем шаге вы подключите контроллер к беспроводной сети. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Подключите контроллер к Wi-Fi. </h3> <p> <strong class=\"gallery__section-title\"> Галерея изображений (3 изображения) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Расширять <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Расширять <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <p> Для настройки подключения к Wi-Fi мы использовали приложение Meross. Это доступно для <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> а также <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . Этот процесс почти всегда состоит из открытия приложения, идентификации вашего продукта, подключения приложения к вашему Wi-Fi, открытия экрана настроек и предоставления контроллеру доступа к вашей сети. </p> <p> Здесь откройте приложение, затем коснитесь <strong> Умный открывалка для гаражных ворот </strong> а потом <strong> Начинать </strong> . Выберите производителя и модель устройства открывания гаражных ворот, которое вы используете с контроллером. Убедитесь, что вы следуете инструкциям, относящимся к вашему приложению. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Установите интервал времени открытия / закрытия. </h3> <p> <strong class=\"gallery__section-title\"> Галерея изображений (3 изображения) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Расширять <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Расширять <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Расширять </p> <p> Закрывать </p> <p> Одна вещь, которую важно установить перед тестированием вашего нового контроллера, - это синхронизация открывания двери гаража. В приложении Meross вы можете выбрать от 10 секунд до 40 секунд с пятисекундными интервалами или можете добавить пользовательскую настройку для дверей, для закрытия которых требуется четное количество секунд. </p> <p> Установить время для вашей двери легко, но вы должны сделать это правильно. Слишком короткий интервал оставит дверь частично открытой, а слишком длинная настройка может вызвать чрезмерную нагрузку на двигатель механизма открывания гаражных ворот. </p> <p> Чтобы установить интервал, вам понадобятся часы с секундной стрелкой или секундомер. Вы также можете использовать встроенный таймер вашего телефона. Подготовьте свой таймер и встаньте возле кнопки открывания двери гаража. Затем нажмите кнопку одновременно с нажатием кнопки «Пуск» на секундомере или отметьте время на секундной стрелке. </p> <p> Подождите, пока дверь вашего гаража не перестанет двигаться, и запишите время. Это ваш интервал. Перенесите эту информацию в приложение, и настройка интервала завершена. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Проверьте контроллер гаражных ворот. </h3> <p> Используя приложение, откройте и закройте дверь несколько раз, чтобы убедиться, что все работает. Теперь вы можете использовать настенную кнопку или приложение, чтобы открыть дверь гаража. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Наслаждайтесь своим умным контроллером гаражных ворот </h2> <p> Перенос технологий умного дома в гаражные ворота не обязательно должен стоить целое состояние. </p> <p> Установка нового интеллектуального контроллера гаражных ворот обеспечит вам и вашей семье большую гибкость, безопасность и удобство для вашего дома. Это также обеспечивает душевное спокойствие, которое приходит с пониманием того, что вашими гаражными воротами можно управлять практически из любого места. </p>"}