{"title":"iPhone 13 может похвастаться «всегда включенным» дисплеем","content":"<p> Apple представила свой «всегда включенный» дисплей для Apple Watch Series 5 в 2019 году. По словам репортера Макса Вайнбаха, который поделился информацией с каналом YouTube, пару лет спустя он может появиться и на iPhone. <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> ВсеApplePro </a> . </p> <p> В отчете утверждается, что iPhone 13 - если Apple действительно решит назвать его так, - будет постоянно освещать некоторые участки экрана, чтобы отображать определенные детали. </p> <h2 id=\"how-always-on-display-will-work\"> Как будет работать &quot;всегда включенный&quot; дисплей </h2> <p> Эти сведения могут включать значки часов и батареи. Они останутся видимыми, даже когда iPhone заблокирован, что означает, что он не используется активно пользователем. Уведомления, такие как уведомления о новых сообщениях, будут светиться только временно. </p> <p> Это будет первый случай, когда в iPhone используется технология «всегда включенного» дисплея. Однако это ни в коем случае не будет первым случаем, когда подобная технология появится в смартфоне. Nokia представила функцию «всегда активный» экран еще в 2009 году. В последнее время она стала широко доступной функцией на различных телефонах Android, включая модели, произведенные Huawei, Motorola, Samsung, Google и другими. </p> <p> Большое, очевидное преимущество «всегда включен» состоит в том, что он не требует, чтобы пользователь будил или разблокировал его или свой телефон, чтобы получить доступ к информации, даже если это такая мелочь, как проверка времени. </p> <p> Обратной стороной является то, что он потребляет дополнительное время автономной работы, что уже может быть чем-то вроде премиум-класса на смартфонах. Однако дисплеи AMOLED могут уменьшить это воздействие на батарею, активировав на дисплее только те пиксели, которые необходимы для отображения информации. </p> <p> Другими словами, этот «всегда включенный» дисплей всегда включен в техническом смысле, хотя большая часть экрана выключена, и только некоторые части остаются освещенными все время. Это означает, что влияние на срок службы батареи не так велико, как могло бы быть в противном случае. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> Чего ожидать от iPhone 13 </h2> <p> IPhone следующего поколения, скорее всего, появится в сентябре 2021 года. По словам Вайнбаха, он будет иметь тот же общий дизайн корпуса, что и серия iPhone 12, хотя будут некоторые внутренние обновления. </p> <p> Они будут включать в себя более сильные магниты MagSafe, улучшенную систему камеры для съемки луны и звезд, сверхширокий объектив камеры для всей линейки iPhone, видео в портретном режиме (а не просто неподвижные изображения), улучшенную матовую заднюю панель и улучшенный A- чип серии. В предыдущем отчете утверждалось, что Apple может <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> ввести в дисплей Touch ID </a> как альтернатива Face ID. </p> <p> Учитывая, что до этого еще больше полугода, может появиться множество новых деталей, прежде чем Apple продемонстрирует свой следующий iPhone в третьем квартале. Тем не менее, похоже, мельница слухов уже начинает работать. Смотрите это пространство! </p>"}