{"title":"JPG против JPEG: в чем разница между этими форматами файлов изображений?","content":"<p> Не все форматы файлов изображений одинаковы. Фактически, многие из них были созданы для решения проблемы, которую уже существующий формат не мог решить. JPEG, например, появился из-за того, что размеры файлов изображений занимали слишком много места для хранения. </p> <p> Вы не поверите, но расширения файлов JIF, JPEG и JPG более или менее относятся к одному и тому же. Чтобы понять, почему у формата файла так много имен, нам нужно немного разобраться в запутанной истории. </p> <h2 id=\"what-is-a-jpeg\"> Что такое JPEG? </h2> <p> Аббревиатура JPEG расшифровывается как Joint Photographic Experts Group - тип файла был назван в честь подкомитета, который помог создать стандарт формата обмена JPEG (JIF). Впервые он был выпущен в 1992 году Международной организацией по стандартизации (ISO). </p> <p> JPEG - это 24-битные неподвижные растровые изображения с восемью битами в каждом канале цветовой модели RGB. Это не оставляет места для альфа-канала, а это означает, что, хотя файлы JPEG могут поддерживать более 16 миллионов цветов, они не могут поддерживать прозрачность. </p> <p> Когда изображение сохраняется в формате JPEG, некоторые из его данных отбрасываются в процессе, называемом с потерями. <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> сжатие файлов </a> . В свою очередь, изображение занимает на 50-75 процентов меньше места для хранения (по сравнению со старыми форматами, такими как BMP) с незначительной или незаметной потерей качества изображения. </p> <p> Сжатие JPEG основано на методе сжатия изображений с потерями, называемом дискретным косинусным преобразованием (DCT), который впервые был предложен инженером-электриком Насиром Ахмедом в 1972 году. </p> <h3 id=\"what-is-a-jif\"> Что такое JIF? </h3> <p> Вы можете думать о файле JIF как о JPEG в его «чистейшей» форме. Однако этот формат больше не используется, потому что он имеет некоторые досадные ограничения. Например, определения цвета и пиксельного аспекта JIF вызвали проблемы совместимости между кодировщиками и декодерами (программами просмотра). </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> К счастью, эти проблемы позже были решены другими «дополнительными» стандартами, основанными на JIF. Первым из них был формат обмена файлами JPEG (JFIF), а позже - формат обмена файлами. <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Сменный формат файла изображения </a> (Exif) и цветовые профили ICC. </p> <p> JPEG / JFIF - самый популярный в настоящее время формат для хранения и передачи фотографических изображений в Интернете, а JPEG / Exif - для цифровых камер и других устройств захвата изображений. Большинство людей не видят разницы между этими вариантами и называют их оба просто JPEG. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> Что такое JPG2 или JPF? </h3> <p> В 2000 году группа JPEG выпустила другой формат файлов изображений, названный JPEG 2000 (его файлы с расширениями JPG2 и JPF). Он должен был стать преемником JPEG, но был далеко не таким популярным. Даже когда его передовой метод кодирования часто приводил к более качественному изображению. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Кредит изображения: Dake / <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Формат файлов JPEG 2000 потерпел неудачу по нескольким причинам. Во-первых, он был основан на совершенно новом коде и, следовательно, не был обратно совместим с JPEG. Вдобавок ко всему, обработка файлов JPEG 2000 требовала большего объема памяти для обработки, что в то время было неким препятствием. В конце концов, средний компьютер в то время имел только 64 МБ памяти. </p> <p> JPEG 2000 пережил некоторое возрождение сейчас, когда компьютерное оборудование в целом значительно улучшилось за последние 20 лет, но формат файла по-прежнему очень мало используется. На момент написания статьи единственным интернет-браузером, поддерживающим файлы JPEG 2000, был Safari. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG против JPG </h3> <p> Ранние версии Windows (в частности, файловые системы MS-DOS 8.3 и FAT-16) имели максимальное ограничение в 3 буквы, когда дело доходило до длины расширений файлов. JPEG пришлось сократить до JPG, чтобы не превышать ограничение. На компьютерах Mac и Linux такого никогда не было, поэтому пользователи продолжали сохранять изображения в формате JPEG. </p> <p> </p> <p> Популярные программы для редактирования изображений, которые работали в разных операционных системах, таких как Photoshop и <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> GIMP </a> - в конечном итоге установили расширение файла JPEG по умолчанию на JPG, чтобы избежать путаницы. </p> <p> И вот как мы закончили с двумя расширениями файлов для одного и того же формата: JPEG и JPG. При выборе того, как сохранить изображение, разницы между ними нет. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG против PNG: что лучше? </h2> <p> </p> <p> JPEG и PNG были выпущены в одно и то же десятилетие, причем каждый формат файла решал разные проблемы цифрового изображения, с которыми тогда столкнулся технологический мир. Можно сказать, что это естественно, что их постоянно сравнивают ... и это так, даже по сей день. Какой формат файлов изображений преобладает между JPEG и PNG? </p> <p> Честно говоря, ответ зависит от того, какое изображение вы сохраняете. </p> <p> JPEG лучше подходит для фотографий, потому что в них используется сжатие с потерями для сохранения разумных размеров файлов. Фотографии - это такие большие, детализированные изображения, что артефакты сжатия (тонкие искажения изображения, вызванные сжатием) на них не очень заметны. </p> <p> С другой стороны, изображения с резкими точками, четкими краями и большими областями одного цвета (например, векторные логотипы, пиксельная графика и т. Д.) Выглядят не совсем правильно при сохранении в формате JPEG. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Кредит изображения: Аксель Гримар / <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Здесь может пригодиться файл Portable Network Graphics (PNG). Формат PNG, разработанный группой разработчиков PNG через четыре года после выпуска JPEG, поддерживает сжатие данных без потерь и прозрачность. Таким образом, PNG часто используются, если необходимо сохранить качество изображения и размер файла не является проблемой. </p> <p> Хорошее практическое правило - сохранять JPEG для фотографий и сохранять PNG для изображений с прозрачностью и нефотографических изображений. Чтобы получить больше информации о различных типах файлов (не только изображениях), ознакомьтесь с нашим руководством по <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> зная, когда использовать какой формат файла. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG и JPG - это один и тот же формат файла </h2> <p> Несмотря на путаницу, которую вызвал JPEG своими многочисленными обновлениями и вариациями, возможный поток цифровых изображений в Интернете в середине 90-х годов, несомненно, был в первую очередь вызван его выпуском. </p> <p> В следующий раз, когда вы будете готовы экспортировать фотографию из графического редактора и вам будет представлен длинный список доступных форматов, просто помните: JPEG и JPG - это одно и то же. </p>"}