{"title":"Долгожданные AirTags наконец-то могут дебютировать в марте","content":"<p> По слухам, Apple AirTags, миниатюрный трекер местоположения ключей и других мелких предметов, не за горами с 2019 года. Однако через шесть недель 2021 года Apple еще не анонсировала их, не говоря уже о начале поставок. клиентам. </p> <p> Это вполне может измениться в следующем месяце, по словам многолетнего информатора Apple Джона Проссера. В твите, отправленном в пятницу, 12 февраля, Проссер заявил, что «метки AirTags все еще работают на март. На этот раз мы не слышали о каких-либо дальнейших задержках». </p> <h2 id=\"what-to-expect-from-airtags\"> Чего ожидать от AirTags </h2> <p> Проссер имеет в виду предыдущую задержку, о которой он сообщил в конце прошлого года, перед медиа-мероприятием Apple 13 октября. В то время Проссер отметил <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800\" target=\"_blank\" rel=\"nofollow noopener\"> Твиттер </a> что он слышал из своих (казалось бы, хорошо расположенных) источников, что «Apple отложила объявление и запуск AirTags до марта 2021 года». Спустя полгода кажется, что никакие дальнейшие задержки не остановят выпуск AirTags. Хотелось бы надеяться. </p> <p> Сообщается, что AirTags будет использовать сверхширокополосную технологию Apple, чтобы iPhone мог определять свое точное местоположение с высокой степенью точности. Предполагается, что они будут использовать как звуковые сигналы, так и расширенный виртуальный маркер, чтобы точно указать, где находится объект, прикрепленный к AirTags. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Подушки безопасности на март все еще активны. <br><br> На этот раз мы не слышали о дальнейших задержках. 🤞 </p> - Джон Проссер (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1360265330296250377?ref_src=twsrc%5Etfw\"> 12 февраля 2021 г. </a></blockquote>  <p> Поиск отдельных подушек безопасности будет <a href=\"https://www.makeuseof.com/apple-find-my-items-hidden-tab/\" target=\"_blank\" rel=\"nofollow noopener\"> выполняется через приложение &quot;Найди меня&quot; для iOS </a> , который также позволяет пользователям отслеживать свои iPhone, iPad, Mac и другие устройства Apple. AirTags будет конкурентом Apple популярным продуктам для отслеживания Bluetooth от таких компаний, как Tile. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Итак, об AirTags. <br><br> Это больно моему сердцу ... <br><br> Мне сказали, что Apple перенесла объявление и запуск AirTags до марта 2021 года. <a href=\"https://t.co/xtUvCAFmoE\"> https://t.co/xtUvCAFmoE </a> <a href=\"https://t.co/DIUlcp01Xy\"> pic.twitter.com/DIUlcp01Xy </a></p> - Джон Проссер (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800?ref_src=twsrc%5Etfw\"> 9 октября 2020 г. </a></blockquote>  <p> Apple еще не объявила о специальном мероприятии в марте, на котором можно было бы объявить AirTags. Однако, если он все-таки примет, то он будет соответствовать последним годам. Шесть из последних 10 лет Apple устраивала мероприятия в марте, на которых демонстрировала новые продукты. </p> <p> В прошлом году ходили слухи об этом событии, но оно не состоялось, скорее всего, из-за начала пандемии COVID-19 в США и других странах. Однако теперь, когда Apple перешла на виртуальные мероприятия, это не помешало бы ей провести еще одно мероприятие в следующем месяце. В качестве альтернативы Apple может объявить AirTags через пресс-релиз. </p> <p> </p> <h2 id=\"expect-a-new-ipad-pro-as-well\"> Ожидайте и новый iPad Pro </h2> <p> Это может быть не единственный новый продукт Apple в следующем месяце. Проссер также ответил на вопрос о следующем iPad Pro от Apple, сказав, что он «также [установлен] на март, насколько мне известно». </p> <p> Хотя Проссер и раньше ошибался, у него в целом впечатляющий послужной список, когда дело доходит до точных заявлений Apple. Будут ли среди них AirTags и iPad Pro следующего поколения? Нам осталось недолго ждать, пока мы узнаем. </p> <p> <small> Кредит изображения: iphonedigital / <a href=\"https://www.flickr.com/photos/137872055@N03/22522566994/\" target=\"_blank\" rel=\"nofollow noopener\"> Flickr </a></small> </p>"}