{"title":"LastPass ограничит вас одним типом устройства, если вы не заплатите","content":"<p> LastPass, популярный менеджер паролей, претерпевает большие изменения. Вскоре те, кто пользуется услугой бесплатно, смогут делать это только на компьютерах или мобильных устройствах, но не на обоих сразу, если только они не заплатят. </p> <p> Это означает, что LastPass больше не является привлекательным выбором в качестве бесплатного менеджера паролей. В мире, где мы постоянно переключаемся между компьютерами и мобильными телефонами, бесполезно иметь менеджер паролей, который работает только с одним типом устройств. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> Что меняется в LastPass Free? </h2> <p> Как было объявлено на <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> Блог LastPass </a> В бесплатную версию менеджера паролей внесены изменения. </p> <p> В настоящее время LastPass Free позволяет использовать сервис на всех ваших устройствах. Независимо от того, используете ли вы LastPass на своем компьютере, планшете или мобильном телефоне, это не имеет значения. Все это бесплатно. Это должно измениться 16 марта 2021 года. </p> <p> С этого момента LastPass Free будет включать неограниченное количество устройств только одного типа: компьютеры или мобильные телефоны. </p> <p> Для LastPass компьютеры классифицируются как любые настольные компьютеры или ноутбуки, а мобильные устройства - это мобильные телефоны, планшеты и умные часы. </p> <p> При первом входе в LastPass 16 марта вам нужно будет указать активный тип устройства. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> Например, если вы выберете компьютеры в качестве типа устройства, вы сможете использовать LastPass на своем настольном компьютере и ноутбуке. Однако, если вы хотите использовать LastPass на любом мобильном устройстве, вам необходимо перейти на LastPass Premium. </p> <p> В каком-то смысле это возврат к прошлому LastPass. Возможность бесплатного использования LastPass для настольных компьютеров и мобильных устройств стала доступна только в 2015 году. До этого вам приходилось платить за поддержку для мобильных устройств. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> Поддержка LastPass также меняется </h2> <p> LastPass также меняет способ оказания поддержки. С 17 мая 2021 года поддержка по электронной почте будет доступна только для клиентов Premium и Family. </p> <p> Бесплатные пользователи будут застрять в справочных статьях, доступных на веб-сайте поддержки LastPass, или они могут попросить помощи в сообществе LastPass. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> Каждый должен использовать менеджер паролей </a> . Скорее всего, вам нужно использовать его на настольных компьютерах и мобильных устройствах. LastPass знает об этом и рассчитывает на то, что пользователи перейдут на платную услугу, на которую в настоящее время действует скидка 25% за 27 долларов в год. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> Пришло время сменить менеджер паролей? </h2> <p> Если вы используете LastPass Free, вероятно, это заставило вас задуматься о переходе. Если это так, существует множество других отличных менеджеров паролей, которые вы можете бесплатно использовать на всех своих устройствах. </p> <p> Опять же, может быть, вы думаете, что это справедливо, если вы заплатите небольшую сумму LastPass в поддержку услуги, которую он предоставляет. </p>"}