{"title":"Последнее обновление WatchOS защищает от ошибки, связанной с блокировкой Apple Watch","content":"<p> Последнее обновление Apple WatchOS, версия программного обеспечения 7.3.1, включает очень важное исправление - устранение ошибки, из-за которой некоторые устройства Apple Watch Series 5 и Apple Watch SE перестают заряжаться, когда они переходят в режим Power Reserve. </p> <p> Компания также запустила новую бесплатную программу ремонта для затронутых устройств, которые находятся в этом режиме пониженного энергопотребления и не могут выйти из него. Эта ошибка по существу &quot;блокирует&quot; их Apple Watch, делая их неработоспособными. </p> <h2 id=\"the-power-reserve-mode-bug\"> Ошибка режима резервного питания </h2> <p> Режим Power Reserve запускается, когда Apple Watch разряжаются. Это мешает вашим Apple Watch обмениваться данными с вашим iPhone. Он также запрещает пользователям доступ к другим функциям Apple Watch. Чтобы выйти из режима Power Reserve, пользователям необходимо зарядить Apple Watch. </p> <p> На <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> страница поддержки об ошибке и программе восстановления </a> от 15 февраля, Apple начинает с того, что отмечает: </p> <blockquote> <p> У очень небольшого числа клиентов с моделями Apple Watch Series 5 или Apple Watch SE под управлением watchOS 7.2 или 7.3 возникла проблема, из-за которой их часы не заряжались после перехода в режим Power Reserve. </p> </blockquote> <p> Чтобы узнать, есть ли у вас соответствующая модель Apple Watch, Apple рекомендует подключить часы к зарядному устройству и подождать не менее 30 минут. Если плата не будет взиматься, обратитесь в службу поддержки Apple, и они организуют бесплатный ремонт по почте. </p> <p> Часы будут проверены на предмет соответствия критериям, и при условии, что они соответствуют требованиям, ремонт будет проведен бесплатно, а отремонтированные Часы будут возвращены владельцу. </p> <p> Неясно, сколько именно часов Apple Watch серьезно затронуто этой ошибкой. Однако похоже, что проблема затрагивает только подмножество моделей Apple Watch Series 5 или Apple Watch SE и никакие другие модели. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> Как перейти на WatchOS 7.3.1 </h2> <p> Тем, кто не сталкивался с этой ошибкой, все же стоит обновить ее до последней версии watchOS, чтобы защитить себя от ее возможного возникновения. </p> <p> На важность исправления ошибки указывает тот факт, что Apple немедленно выпустила watchOS 7.3.1 для всех пользователей. Это контрастирует с тем, как он обычно выпускает обновления программного обеспечения, изначально делая их доступными разработчикам для бета-тестирования. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple выпустила watchOS 7.3 </a> в конце января. </p> <p> Пользователи могут загрузить watchOS 7.3.1 с помощью приложения Apple Watch на iPhone. Для этого они должны перейти в <strong> Общие&gt; Обновление программного обеспечения </strong> . Для обновления в Apple Watch должно быть не менее 50 процентов заряда батареи. Он также должен находиться в непосредственной близости от вашего iPhone. </p>"}