{"title":"Браузер Microsoft Edge был хостом для секретных игровых эмуляторов Nintendo","content":"<p> Microsoft удалила серию нелегальных игровых эмуляторов, скрывающихся в ее магазине расширений для браузера Microsoft Edge. В магазине расширений Microsoft Edge были размещены десятки эмуляторов, которые позволяли пользователям играть в несколько знаковых игр, ни одна из которых не была размещена в магазине на законных основаниях. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft удаляет нелегальные эмуляторы расширения Edge </h2> <p> В магазине расширений Microsoft Edge скрывались одни из самых знаковых игр всех времен, в том числе Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2 и даже Minecraft. Каждая игра запускалась в браузере в окне эмулятора и позволяла пользователям полностью пройти каждую игру. </p> <p> Однако ни в одной из классических игр не указаны официальные разработчики игр, такие как Nintendo, Sega, Atari и да - даже Microsoft. Имена перечисленных разработчиков включают Gamelands, Kday и StayReal, все они являются полностью вымышленными и не имеют ссылок на оригинальных разработчиков. </p> <p> Как ни странно, официальный аккаунт Microsoft Edge Development в Twitter, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , рассказывал об эмуляторах, появляющихся для продвижения игр, доступных в магазине расширений для браузера. Мы не поймали оригинальный твит, рекламирующий эмуляторы, но его копию можно получить через <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Resetera </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> Эмуляторы незаконны? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Эмуляторы позволяют запускать различное программное обеспечение </a> на твоем компьютере. Вы также можете использовать эмулятор, чтобы играть в старые игры. </p> <p> Хотя сами эмуляторы не являются незаконными, загрузка контента, защищенного авторским правом, для воспроизведения на эмуляторе является незаконной. Твит из официальной учетной записи Microsoft Edge Development был странным шагом, поскольку эмуляторы загрузили новую копию ПЗУ игры, чтобы пользователь мог играть. </p> <p> Тема брошенного ПО тоже в некотором роде серая зона. Заброшенные игры больше не публикуются и больше не доступны для продажи в Интернете или в магазине. Однако во многих случаях авторские права на эти игры еще не истекли, но правообладатель активно не защищает свои права. </p> <p> </p> <p> Во многих случаях отказ от ПО является незаконным. Тем не менее, нет никаких судебных дел, связанных с отказом от программного обеспечения, или, по крайней мере, ни одного дела о том, что старый разработчик игр преследует кого-то за загрузку названия брошенного программного обеспечения. </p> <p> В этом конкретном примере эмуляция этих старых игр в веб-браузере является незаконной. Кроме того, Nintendo печально известна блокированием любых сайтов или служб, которые пытаются копировать или распространять ее интеллектуальную собственность. </p> <p> В настоящее время игры удалены из магазина расширений Microsoft Edge. Более того, пока неизвестно, как эмулируемые игры попали в магазин расширений и кто их туда поместил. Излишне говорить, что они вряд ли вернутся. </p>"}