{"title":"Microsoft выпускает новое приложение Office для iPad","content":"<p> Microsoft выпустила унифицированное приложение Office для планшета Apple. С его помощью Word, Excel и PowerPoint теперь доступны для единой загрузки на iPhone и iPad в <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> Магазин приложений </a> . Microsoft по-прежнему предоставляет эти приложения для iPad в виде отдельных загрузок. </p> <h2 id=\"better-late-than-never\"> Лучше поздно, чем никогда </h2> <p> «Мы объединяем известные вам приложения Word, Excel и PowerPoint в одно приложение, оптимизированное для iPadOS», - написала Microsoft в примечаниях к выпуску, сопровождающих загрузку. Это отличная новость, если вы используете Office и хотите работать в дороге. Для тех, кто хочет <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> превратить свой iPad в замену ноутбуку </a> , это важный выпуск. </p> <p> Приложения доступны бесплатно, но для редактирования и других расширенных функций требуется подписка на Office 365. Тем, кому интересно, Microsoft предлагает различные варианты подписки в приложении по цене от 6,99 долларов в месяц. </p> <p> Если вам нужен только текстовый процессор на iPad, возможно, лучше рассмотреть альтернативы в <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> Обзор лучших текстовых редакторов для iPad от MUO </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> Единый опыт работы с мобильным офисом </h2> <p> Чтобы было понятно, это обновление существующего Office для iOS, а не совершенно новый выпуск. В <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> универсальное приложение Office дебютировало на iPhone </a> и Android в феврале 2020 года. Непонятно, на что Microsoft ушел целый год, чтобы добавить оптимизированные для iPad версии Word, Excel и PowerPoint, но лучше поздно, чем никогда. </p> <p> </p> <p> До сегодняшнего дня приложения для повышения продуктивности, включенные в пакет, обеспечивали на iPad невысокую производительность, поскольку раньше работали в оконном режиме. Но с последним доступным обновлением клиенты Apple теперь могут работать с Office на своих iPhone, iPad или iPod touch независимо от размера экрана. </p> <p> </p> <h2 id=\"ipad-specific-features\"> Особенности iPad </h2> <p> Microsoft регулярно добавляет новые, оптимизированные для планшетов функции к своим предложениям для мобильных устройств Office. Например, в мобильных версиях Word, Excel и PowerPoint недавно появилась поддержка жестов с помощью мыши и трекпада. Приложения также поддерживают функцию параллельной многозадачности iOS Split View. </p> <p> Хотя мобильная и настольная версии Office не имеют всех одинаковых функций, новый Office для iOS предлагает несколько новых функций. Они позволяют вам делать такие вещи, как подписывать документы с помощью Apple Pencil или пальца, быстро создавать PDF-файлы из ваших документов, преобразовывать изображения в текст и таблицы и т. Д. </p> <p> </p> <p> Кроме того, теперь вы можете легко вставлять дату, форму, изображение и заметки в PDF-файлы. Что касается опытных пользователей, теперь они могут получить доступ к действиям Office на основе изображений (например, «Создать PPT», «Создать PDF» и т. Д.) Через многоцелевое меню «Поделиться» iOS. «Кроме того, если при открытии приложения Office есть какие-либо недавние снимки экрана, они отображаются как предложение конвертировать в PDF или PPT», - отмечает компания. </p> <p> Microsoft также внесет некоторые изменения в свой пакет Office для Mac и Windows. По словам производителя Windows, предстоящие обновления Office для настольных ПК в 2021 году будут включать бессрочные лицензии, помимо других улучшений. </p>"}