{"title":"Microsoft запускает Azure в космос с помощью HPE Spaceborne Computer-2","content":"<p> Microsoft выходит за пределы планеты, чтобы предоставлять внеземные услуги. Компания будет работать с Hewlett Packard Enterprises над подключением к ПК на Международной космической станции (МКС) через свою платформу Azure. </p> <p> Spaceborne Computer-2 будет подключаться к Azure через наземные станции NASA и HPE, обеспечивая космическую станцию ​​большой мощностью обработки данных. </p> <h2 id=\"azure-heads-into-space\"> Лазурные головы в космос </h2> <p> Как сообщается на <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Блог Microsoft Azure </a> Космический компьютер-2 (SBC-2) предоставит астронавтам МКС технологии, более близкие к их наземным аналогам. </p> <p> Есть надежда, что это резко сократит время, необходимое для передачи данных между МКС и Землей, а также уменьшит пропускную способность, необходимую для обработки и анализа. </p> <blockquote> <p> Астронавты и исследователи космоса заслуживают доступа к лучшим технологиям облачных вычислений и передовой обработке данных на высочайшем уровне. Иногда анализ необходимо проводить сразу на грани, где важен каждый момент, а иногда анализ настолько сложен, что его можно выполнить только с помощью мощного гипермасштабируемого облака. </p> </blockquote> <p> Spaceborne Computer-2 использует систему Edgeline Converged Edge от Hewlett Packard Enterprises, которая «специально спроектирована для суровых периферийных сред» и предоставит МКС множество функциональных возможностей Azure. </p> <p> Когда соединение установлено и работает, SBC-2 позволит проводить исследования в таких областях, как моделирование погоды для будущих миссий на Марс, анализ растений и гидропоники для поддержки роста продуктов питания и сельскохозяйственных культур в космосе, а также получение медицинских изображений на самой МКС (для поддержки здравоохранения космонавтов ). </p> <p> Д-р Марк Фернандес, архитектор решений для конвергентных периферийных систем в HPE и главный исследователь Spaceborne Computer-2, сказал: </p> <blockquote> <p> Объединив HPE Spaceborne Computer-2, основанный на системе HPE Edgeline Converged Edge для расширенных периферийных вычислений и возможностей искусственного интеллекта, с Microsoft Azure для подключения к облаку, мы даем возможность исследователям космоса беспрепятственно передавать большие наборы данных в и из Земля и преимущества от края до облака </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> Следующий этап космической инициативы Microsoft Azure </h2> <p> Объявление Microsoft - еще один шаг вперед для ее <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Azure Space </a> Инициатива, запущенная в октябре 2020 года. </p> <p> Инициатива Azure Space - это попытка Microsoft сделать «следующий гигантский скачок в облачных вычислениях», выведя свою платформу облачных вычислений Azure в космос. </p> <p> </p> <p> Ранее Azure Space работала с проектом SpaceX Starlink для доставки спутниковой широкополосной связи в модульный центр обработки данных Azure (MDC) и продолжает работу над проектом Azure Orbital, который расширит возможности подключения между его облачными центрами обработки данных с помощью спутниковой технологии. </p>"}