{"title":"Microsoft пыталась купить Pinterest, но сделка отменена ... пока","content":"<p> Microsoft недавно обратилась к Pinterest по поводу потенциальной сделки по поглощению, которая могла бы стать одним из крупнейших приобретений Редмонда. В настоящее время переговоры не ведутся, но масштаб предполагаемого слияния еще больше свидетельствует о планах Microsoft по росту. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft хочет купить Pinterest </h2> <p> Как сообщает <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Financial Times </a> , Microsoft попыталась купить Pinterest, крупнейшую в мире доску для любителей. </p> <p> Pinterest в настоящее время оценивается примерно в 51 миллиард долларов, а его рыночная стоимость выросла более чем на 600 процентов во время пандемии COVID-19, поскольку люди выходят в Интернет во время блокировки. Новости о предполагаемой сделке по поглощению подняли акции Pinterest на 7% перед открытием рынков в четверг, 11 февраля. </p> <p> Этот шаг привел бы Pinterest к постоянно растущему числу крупных технологических приобретений Microsoft. В 2016 году Microsoft приобрела LinkedIn за 26 миллиардов долларов, после чего в 2018 году последовала покупка Github за 7,5 миллиардов долларов. </p> <p> Это не говоря уже о том, что Microsoft владеет Minecraft, купила 2,5 миллиарда долларов в 2014 году и продолжающееся приобретение крупного игрового холдинга ZeniMax за 7,5 миллиарда долларов. ZeniMax является материнской компанией таких игровых студий, как Bethesda Softworks, id Software, Alpha Dog Games и Tango Gameworks. </p> <p> Кроме того, был <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> неудачная попытка купить TikTok&#39;s </a> Активы в Северной Америке, Австралии и Новой Зеландии в середине 2020 года. Сделка в конечном итоге сорвалась, но была оценена в 20-30 миллиардов долларов и была заключена после того, как бывший президент <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Трамп пригрозил запретить </a> социальная сеть для обмена видео полностью из США. </p> <p> Если сделка с Pinterest состоится или действительно, если она будет завершена позже, она станет крупнейшим приобретением Microsoft на сегодняшний день. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> Почему Microsoft покупает так много технологических компаний? </h2> <p> У Microsoft нет недостатка в деньгах, и она хочет расширить свою империю. Его собственные акции выросли примерно на 80 процентов с начала пандемии COVID-19 и недавно показали рекордную прибыль. </p> <p> </p> <p> Приобретение другой платформы, такой как Pinterest, - это билет к данным для других сервисов Microsoft. Огромный объем данных, генерируемых такими платформами, как LinkedIn, является идеальным инструментом для обучения технологиям искусственного интеллекта. Кроме того, управление огромным онлайн-сервисом, таким как Pinterest, также служит рекламой для его платформы Azure. </p> <p> Как упоминается в сообщении Financial Times, разговоры о таком огромном слиянии двух технологических компаний также подвергнут испытанию администрацию президента Байдена. Рада ли новая администрация позволить технологическим гигантам, таким как Microsoft, Google и Facebook, скупать конкуренцию? Время покажет. </p>"}