{"title":"Соучредитель Netflix критикует стратегию Apple TV + Video","content":"<p> Бывший глава Netflix Марк Рэндольф раскритиковал видеостратегию Apple, заявив, что Apple TV + отстает от конкурентов из-за бесплатных предложений компании и отсутствия убедительного контента. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple не транслирует &quot;обеими ногами&quot; </h2> <p> Если вы спросите бывшего генерального директора и соучредителя Netflix Марка Рэндольфа, Apple TV столкнулась с проблемой халявщика, которая способствовала слабому росту сервиса по сравнению с Netflix, Disney + и другими успешными потоковыми сервисами. </p> <p> Говоря с <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Yahoo Finance </a> , он сказал, что Apple TV + тратит энергию на рекламные акции и бесплатные предложения, тогда как ему следует сосредоточиться на добавлении более качественного контента для повышения ценности. </p> <blockquote> <p> Если бы Apple тратила на контент на четверть меньше времени, чем на раздачи, они действительно могли бы играть. У них нет оправдания, [и] они все еще не в ней обеими ногами. Им действительно нужно заниматься предпринимательством, подходить к краю обрыва и прыгать. </p> </blockquote> <p> Проще сказать, чем сделать, спрыгнуть с обрыва, потому что Apple TV + не хватает рыночной власти Disney и узнаваемости бренда Netflix. Прямо сейчас это все о <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney + против Netflix </a> и какой потоковый сервис предлагает потенциальным клиентам лучшее соотношение цены и качества. </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV + имеет самый высокий коэффициент оттока </h2> <p> Рэндольф выступает против бесплатных раздач и рекламных акций на рынке потокового вещания, предполагая, что Apple TV + ‌ имеет «самый высокий процент оттока» среди основных сервисов. </p> <blockquote> <p> Вы не можете продолжать заменять людей. Вы должны дать им повод остаться. </p> </blockquote> <p> Моффет Натансон-Харрис X обнаружил, что 29 процентов тех, кто подписался через бесплатную подписку, не планируют повторно подписываться после истечения срока их бесплатной пробной версии, как сообщает <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> Разнообразие </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> Бесплатные предложения Apple TV + </h2> <p> Apple предлагает 12 месяцев бесплатного обслуживания Apple TV + всем, кто приобретает подходящее новое устройство у компании, например новый iPhone. В это время, <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple продлила бесплатную подписку на год </a> дважды для тех, кто зарегистрировался в 2019 году. </p> <p> </p> <p> Это явный сигнал, что сама Apple не верит, что сервис предоставляет достаточно контента, чтобы оправдать запрашиваемую цену в 5 долларов в месяц. Взгляните на это с другой стороны: если бы Apple TV + превысила внутренние прогнозы, Apple бы уже хвасталась количеством подписчиков. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney + и Netflix создают серьезную конкуренцию </h2> <p> Всего 15 месяцев назад в ноябре 2019 года дебютировал Apple TV +. Вскоре за ним последовал Disney +. Apple не раскрывает, сколько платных подписчиков у Apple TV +, но Disney только что превысила 94 миллиона подписчиков, что намного превосходит даже ее собственные ожидания. </p> <p> Для сравнения, на конец 2020 года Netflix насчитывает 204 миллиона платежеспособных клиентов. Disney надеется, что сможет сравниться с Netflix по количеству подписчиков всего за 12 месяцев. </p> <p> </p> <p> Рэндольф говорит, что Disney + «пробился к действительно сильным позициям» благодаря контенту. «Это действительно война за то, кто готов создавать контент», - добавил он. </p> <blockquote> <p> Мы наблюдаем, как разрабатываются новые правила игры. Это не просто объявление, это не просто продвижение - вы должны продемонстрировать, что у вас есть контент, контент, контент. </p> </blockquote> <p> Действительно, игра о содержании. Например, как указано в <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> планы на 2021 год </a> , Netflix будет запускать новый оригинальный фильм каждую неделю в течение года. Напротив, на Apple TV + есть несколько фильмов, таких как драма «Грейхаунд» с участием Тома Хэнкса (основанная на реальных событиях), оригинальная драма «Палмер» с Джастином Тимберлейком в главной роли и «На скалах» Софии Копполы. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> Подход Apple к медленному прожиганию </h2> <p> Чего Рэндольф не признает, так это того, что Netflix и Disney + имели огромное количество контента с первого дня, тогда как Apple TV + создает свою библиотеку контента с нуля. </p> <p> Apple явно выбрала медленный подход, о чем свидетельствует нехватка шоу по сравнению с Disney + и Netflix. Независимо от того, как вы на это смотрите, его стратегия с Apple TV +, похоже, требует заманивания людей бесплатными предложениями в надежде, что сервис накопит достаточно качественного контента, чтобы превратить бесплатных клиентов в платных подписчиков. </p>"}