{"title":"Новое исследование показывает, что пользователи Android становятся лучшими партнерами, чем пользователи iPhone","content":"<p> Между пользователями iPhone и Android-смартфонов идет нескончаемая битва. Даже те, кто не участвует в битве, выбирают сторону, только взяв свой смартфон. </p> <p> В битве появилась новая морщина, так как <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> Сравнить </a> провела недавнее исследование относительно того, станут ли пользователи iPhone или Android лучшими партнерами в отношениях. Оказывается, пользователи iPhone, как правило, имеют более раздражающие телефонные привычки, чем пользователи Android, что приводит к выводу, что пользователи Android - лучшие партнеры. </p> <p> Конечно, данные - это нечто большее, чем простой вывод, так что давайте углубимся немного глубже и посмотрим. </p> <h2 id=\"iphone-and-android-relationship-study\"> Исследование взаимоотношений iPhone и Android </h2> <p> Общий вывод исследования состоит в том, что пользователи Android являются лучшими партнерами, чем пользователи iPhone, но результаты намного глубже, чем этот поверхностный вывод. Всего в исследовании было опрошено более 2000 пользователей, поэтому выборка была достаточно большой. </p> <p> Изучая самые раздражающие привычки смартфонов, исследование показало, что пользователи iPhone на 12% чаще совершают преступление, чем их коллеги-владельцы Android. Фактически, пользователи iPhone совершили больше злодеяний при использовании телефонов, чем пользователи Android, в каждой категории опроса. </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> Некоторые примеры раздражающих нарушений включают в себя то, что они оставляют своего партнера для чтения, пользуются телефоном во время просмотра фильма и даже пользуются телефоном во время вождения (что не только раздражает, но и невероятно опасно). Пользователи iPhone с большей вероятностью уронят и сломают свой телефон, чем пользователи Android, что является поистине удивительной статистикой. </p> <p> Некоторые другие раздражающие привычки включают: <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> ползать по профилям других людей в социальных сетях </a> , использование чрезмерных фильтров на фотографиях, отправка нескольких однострочных сообщений (я знаю, что делаю это слишком часто) и использование своего телефона во время разговора. </p> <p> Интересно, что исследование также показало, что мужчины с большей вероятностью выполняли большинство раздражающих (а в некоторых случаях и совершенно небезопасных) привычек, чем женщины. </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> Но пользователи Apple получают больше свиданий </h2> <p> Согласно другому исследованию, опубликованному CompareMyMobile, пользователи iPhone с большей вероятностью будут получать свидания в приложениях для онлайн-знакомств. Исследование, в ходе которого было проанализировано более 50 000 свайпов, показало, что пользователи iPhone на 76 процентов чаще соглашаются на свидание, чем те, у кого есть телефон Android, когда разговаривают через приложение для знакомств. </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> Если верить первому исследованию, отношения могут не сложиться из-за того, что пользователь iPhone крадется по другим профилям в социальных сетях и пишет текстовые сообщения во время вождения. Тем не менее, они с большей вероятностью найдут следующего партнера, когда предыдущие отношения не сложились. </p> <p> В конце концов, свидания никогда не бывают легкими. Так что сделайте все возможное, чтобы ваш телефон не превратился в устройство, убивающее все хорошее! </p>"}