{"title":"Parler возвращается в строй после месячного простоя","content":"<p> После того, как Big Tech закрыла его глаза, Парлер наконец-то появился в сети. Платформа «свободы слова» теперь доступна существующим пользователям, и вскоре в ближайшие недели начнется прием регистрации новых пользователей. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Парлер возрождается после отключения больших технологий </h2> <p> Парлер вернулся после длительного отключения электроэнергии. Альтернативная социальная сеть набирала обороты среди политических консерваторов и была <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> загружается Amazon Web Services (AWS), Google и Apple </a> после беспорядков в Капитолии. Парлера обвинили в том, что он недостаточно сдерживал контент с насилием, что привело к его удалению из магазинов приложений и Интернета. </p> <p> Вместо AWS компания Parler теперь использует хост под названием SkySilk. Сайт также зарегистрировал свое доменное имя в Epik, регистраторе, обслуживающем другие типы сетей «свободы слова», такие как Gab. </p> <p> Новый хост и регистратор домена - не единственные изменения, которые сделал Парлер - Парлер даже вернулся с новым временным генеральным директором. Это происходит после <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> команда Парлера якобы уволила соучредителя Джона Матце </a> . </p> <p> Марк Меклер временно заменит Маце на посту генерального директора и ранее был одним из основателей правой группы Tea Party Patriots. В заявлении, полученном <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> Холм </a> , Меклер объявил о долгожданном возвращении Парлера, сказав: </p> <blockquote> <p> Когда в январе Парлер был отключен от сети теми, кто желает заставить замолчать десятки миллионов американцев, наша команда собралась вместе, решив сдержать свое обещание, данное нашему активному сообществу, что мы вернемся сильнее, чем когда-либо. Мы очень рады приветствовать всех снова. </p> </blockquote> <p> Меклер продолжил, отметив, что Парлер останется приверженным «свободе слова, конфиденциальности и гражданскому диалогу». Он также заверил пользователей, что «Парлером управляет опытная команда, и она здесь надолго». </p> <p> Хотя старые учетные записи на платформе сохранены, более старые сообщения (или «переговоры») не были восстановлены. Если у вас уже есть учетная запись в Parler, вы можете продолжить использование сайта. В противном случае вам придется подождать около недели, пока вы не сможете зарегистрироваться. </p> <p> Но даже если у вас уже есть учетная запись Parler, вы можете столкнуться с некоторыми техническими трудностями при использовании платформы. Похоже, что сервис еще не полностью восстановлен. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> Приложение Parler все еще остается в подвешенном состоянии </h2> <p> Парлеру по-прежнему запрещен доступ в Google Play Store и Apple App Store, что может серьезно повредить его пользовательской базе. В настоящее время платформа может оставаться недоступной на мобильных устройствах в течение неизвестного периода времени. </p> <p> Скорее всего, он не сможет вернуться в Play Store или App Store, если не изменит свою политику модерации, что Parler, скорее всего, откажется сделать. </p>"}