{"title":"Контроллер PS4 не работает? Как исправить самые частые проблемы","content":"<p> В большинстве случаев ваш контроллер PlayStation 4, вероятно, работает нормально. Но когда ваш DualShock 4 перестает подключаться или отключается случайным образом, это расстраивает. </p> <p> Давайте посмотрим на исправления, когда ваш контроллер PS4 не работает, чтобы вы могли вернуться к игре. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> Контроллер PS4 не соединяется или не подключается </h2> <p> Обычно, когда вы нажимаете <strong> Кнопка PS </strong> на вашем контроллере он должен включиться и подключиться к вашей системе. Однако, когда он не подключается, вместо этого вы увидите, что световая полоса на вашем контроллере немного мигнет, а затем погаснет. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Обычно это происходит, если вы использовали DualShock 4 с другим устройством. Например, если вы <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> Подключите контроллер PS4 к компьютеру </a> или консоль друга, он запомнит это устройство в будущем. </p> <p> В этих случаях вам нужно будет повторно подключить DualShock 4 к вашей собственной PS4. Для этого подключите контроллер к PS4 с помощью кабеля micro-USB. Убедитесь, что вы используете качественный кабель, который, как вы знаете, работает правильно. </p> <p> </p> <p> нажмите <strong> Кнопка PS </strong> на вашем контроллере на мгновение, и индикатор должен ненадолго мигнуть, прежде чем станет синим. Это означает, что ваш контроллер спарен и успешно подключен. </p> <p> Если у вас есть DualShock 4 в паре с другим ближайшим устройством, например с телефоном или PlayStation 5, это, скорее всего, включит и подключит контроллер к этому устройству. Таким образом, вы должны выключить и отсоединить любое устройство, к которому ваш DualShock 4 был подключен первым. </p> <p> После повторного сопряжения контроллера вы можете отсоединить USB-кабель и использовать контроллер в обычном режиме без проводов. Ваш PS4 запомнит это, пока вы не соедините контроллер с другим устройством в будущем. </p> <p> Имейте в виду, что максимальное количество контроллеров DualShock 4, которые вы можете одновременно подключить к PS4, равно четырем. Если у вас уже подключено четыре контроллера, вам нужно отключить один, чтобы освободить место для других. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> Контроллер PS4 продолжает отключаться </h2> <p> Если ваш DualShock 4 случайно отключается во время игры, вы можете попробовать несколько способов. </p> <p> Во-первых, убедитесь, что аккумулятор вашего контроллера заряжен. Звучит просто, но если аккумулятор в вашем контроллере почти разряжен, он может отключиться. Чтобы проверить срок службы батареи контроллера, удерживайте <strong> Кнопка PS </strong> , чтобы вызвать быстрое меню в левой части экрана. Вы увидите значок контроллера с дисплеем батареи внизу. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Подключите контроллер к PS4 и снова посетите быстрое меню, чтобы убедиться, что вы видите анимацию зарядки аккумулятора. После того, как ваш контроллер зарядится в течение некоторого времени, попробуйте использовать его как обычно. </p> <p> Если проблема не в батарее, убедитесь, что вы не пытаетесь использовать контроллер слишком далеко от системы. Типичный диапазон Bluetooth составляет около 30 футов; в зависимости от ваших настроек, вы можете использовать свой контроллер дальше, чем это, или вы можете ограничить его использование ближе. </p> <p> Говоря об этом, вы должны попытаться минимизировать помехи между вашим контроллером и консолью. Удалите все металлические предметы между ними, например стеллажи или ноутбуки, которые могут препятствовать прохождению сигнала. Вы также должны вынести PS4 из любого замкнутого пространства, в котором он находится, для лучшей передачи и приема сигнала. </p> <p> Наконец, помните, что у PS4 есть настройка, которая отключает контроллеры после того, как они некоторое время бездействуют. Если вы не хотите, чтобы ваш контроллер PS4 выключался при просмотре мультимедийных приложений, таких как YouTube, перейдите в <strong> Настройки&gt; Настройки энергосбережения&gt; Установить время до выключения контроллеров </strong> и выберите <strong> Никогда </strong> . Обратите внимание, что это израсходует батарею, даже когда вы бездействуете. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> Общие советы по ремонту контроллера PlayStation 4 </h2> <p> Мы рассмотрели конкретные исправления для нескольких распространенных проблем DualShock 4 выше. Далее давайте рассмотрим более общие решения проблем с контроллерами PS4. Просмотрите их, если вам нужна дополнительная помощь. </p> <h3 id=\"restart-your-console\"> 1. Перезагрузите консоль. </h3> <p> Хотя большинство проблем с контроллером связаны с самим контроллером, есть вероятность, что проблема в вашем PS4. Чтобы исключить это, вам следует перезагрузить консоль перед дальнейшим устранением неполадок. </p> <p> Если ваш контроллер работает достаточно для доступа к меню, удерживайте <strong> Кнопка PS </strong> чтобы открыть быстрое меню, затем перейдите в <strong> Питание&gt; Перезагрузите PS4 </strong> чтобы перезагрузить вашу систему. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> Если ваш контроллер не работает, нажмите и удерживайте кнопку <strong> Мощность </strong> на консоли PS4, пока не услышите два звуковых сигнала. Это полностью отключит его (на передней панели не будет индикаторов) - как только он выключится, нажмите кнопку <strong> Мощность </strong> еще раз, чтобы включить его. </p> <p> Попробуйте снова использовать контроллер после перезагрузки и посмотрите, поможет ли это. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. Забудьте и повторно подключите контроллер PS4. </h3> <p> Если у вас есть второй контроллер PS4 (или контроллер PS Move), вы можете использовать его для доступа к меню, которое позволяет удалить контроллер, у которого возникла проблема. Направляйтесь к <strong> Настройки&gt; Устройства&gt; Устройства Bluetooth </strong> и выберите <strong> DualShock 4 </strong> запись - это та, рядом с которой нет зеленой лампочки. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> В появившемся меню нажмите кнопку <strong> Параметры </strong> кнопку на вашем контроллере и выберите <strong> Забыть устройство </strong> . Это приведет к тому, что ваш PS4 удалит его из памяти, поэтому вам придется снова подключить его. </p> <p> Это хорошее время, чтобы попробовать немного другой метод сопряжения: повторное сопряжение при запуске. Для этого выключите PS4 (как объяснялось ранее). После выключения подключите проблемный контроллер к консоли с помощью USB-кабеля. Ударь <strong> Кнопка PS </strong> надеюсь включить и подключить ваш контроллер за один процесс. </p> <p> Если это не сработает, снова включите PS4 и попробуйте выполнить сопряжение обычным способом, как указано выше. </p> <h3 id=\"hard-reset-your-controller\"> 3. Выполните полный сброс контроллера. </h3> <p> Если удаление и повторное сопряжение контроллера не помогло, вы можете затем попробовать процедуру полного сброса DualShock 4. Для этого вам понадобится небольшой заостренный предмет, например, изогнутая канцелярская скрепка или инструмент для извлечения SIM-карты. . </p> <p> Выключите PS4, затем переверните контроллер. Вы увидите небольшое отверстие рядом с винтом возле кнопки L2 (на правой стороне контроллера, если его перевернуть). Используйте остроконечный инструмент, чтобы нажать и удерживать кнопку внутри этого отверстия примерно пять секунд. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> Как только вы это сделаете, снова подключите контроллер к PS4 через USB-кабель и посмотрите, успешно ли он соединяется. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Попробуйте контроллер в другом месте. </h3> <p> На этом этапе, если вы еще этого не сделали, вам следует попробовать использовать контроллер, у которого возникли проблемы с другим устройством. Если у вас есть похожие проблемы на PS4 друга или на вашем ПК, то ваш контроллер, скорее всего, неисправен. </p> <p> Также неплохо попробовать другой контроллер PS4 с вашей консолью, если это возможно. Если вы одолжите у друга DualShock 4, который, как вы знаете, работает правильно, и обнаружите, что у него есть проблемы с вашей системой, вероятно, что-то не так с беспроводным подключением вашей PS4. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Используйте контроллер в проводном режиме. </h3> <p> Прежде чем отказаться от контроллера, попробуйте поиграть с ним, постоянно подключенным через USB-кабель. Однако имейте в виду, что это работает только для обновленной модели контроллеров PS4. Вы узнаете, что у вас есть эта модель, если на сенсорной панели на передней панели контроллера есть световая полоса. В противном случае вы не можете принудительно установить проводную связь. </p> <p> Если у вас его еще нет, купите длинный кабель, чтобы по-прежнему наслаждаться игрой, не вставая с дивана. В <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Айлун в упаковке из трех штук </a> 10-футовый кабель micro-USB - хороший экономичный вариант. </p> <p> Чтобы заставить PS4 подключать контроллеры через USB, перейдите в <strong> Настройки&gt; Устройства&gt; Контроллеры&gt; Способ связи </strong> и выберите <strong> Используйте USB-кабель </strong> . Это предотвратит использование DualShock 4 Bluetooth даже при подключении через USB. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> Варианты исправления оборудования DualShock 4 </h2> <p> Как и на большинство оборудования, на контроллеры DualShock 4 предоставляется годовая гарантия. Если вы купили контроллер PS4 в течение последнего года и не можете его исправить с помощью всех вышеперечисленных советов, вам следует посетить <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> Страница исправления и замены PlayStation </a> отправить заявку на ремонт вашего контроллера. </p> <p> В противном случае вы можете попытаться исправить оборудование самостоятельно, открыв контроллер. Но в зависимости от конкретной проблемы это может быть сложно или невозможно. Мы рекомендуем обратиться к местному специалисту по ремонту, если вам неудобно делать это самостоятельно. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> Проблемы с контроллером PS4, исправлены </h2> <p> Теперь вы знаете, как исправить наиболее распространенные проблемы с контроллером PS4. Более конкретные проблемы, такие как кнопка, которая перестает работать, к сожалению, относятся к упомянутым выше решениям для исправления оборудования. </p> <p> Надеюсь, вашу проблему легко исправить. Но если нет, и вам нужно подобрать новый контроллер PS4, у вас есть множество отличных вариантов. </p> <p> <small> Кредит изображения: Джоэри Мостманс / <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}