{"title":"Отчет: Android 12 будет поддерживать одноручный режим","content":"<p> Мы официально достигли той фазы жизненного цикла Android 11, когда слухи об Android 12 начинают выходить в полную силу. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> Разработчики XDA </a> сообщил, что Google работает над режимом работы одной рукой для Android 12, который упростит навигацию по телефону одной рукой. Независимо от того, есть ли у вас большие или маленькие руки, это может открыть совершенно новый способ взаимодействия с вашим устройством Android. </p> <p> Конечно, многие производители устройств и <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> разработчики программного обеспечения внедрили решения для повышения удобства использования одной рукой </a> . Тем не менее, пользоваться им будет гораздо приятнее, если он будет интегрирован непосредственно в операционную систему. </p> <h2 id=\"android-12-s-one-handed-mode\"> Одноручный режим Android 12 </h2> <p> Согласно отчету, Google планирует добавить функцию управления одной рукой в ​​AOSP, которая представляет собой версию Android с открытым исходным кодом, которую любые разработчики программного обеспечения могут использовать на своих устройствах. Это также означает, что OEM-производители, которым еще предстоит разработать собственный режим работы одной рукой, смогут легко реализовать эту функцию на своих устройствах. </p> <p> В отчете не указано, будет ли Google потребовать от производителей телефонов использовать функцию управления одной рукой в ​​Android 12 или она будет необязательной. </p> <p> Поскольку это еще невероятно рано, мы не знаем точно, как будет работать одноручный режим в Android 12. Если прошлое умение Google добавлять функции в операционную систему является каким-либо признаком, мы ожидаем, что компания хорошо поработает над реализацией. Google может решить уменьшить весь экран до угла устройства для облегчения доступа. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> В отчете также указывается, что режим Android 12 для работы одной рукой будет иметь возможность запускать его с помощью традиционного трехкнопочного режима вместе с новым режимом жестовой навигации. </p> <p> Как уже упоминалось, многие производители смартфонов уже внедрили эту функцию в свою модифицированную версию Android. Например, Huawei действительно пыталась отправить свою версию функции в AOSP, но Google ее отклонил. Возможно, Google отклонил его, потому что компания знала, что намеревается представить свою собственную версию этой функции. </p> <p> Поскольку эта утечка настолько ранняя, фотографии еще не демонстрируют эту функцию, поэтому нам придется подождать, пока Android 12 не приблизится к его выпуску. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Когда выйдет Android 12? </h2> <p> К сожалению, мы не знаем точно, когда Android 12 станет общедоступным (хотя это произойдет не скоро). Мы также не знаем точно, когда эта функция появится для разработчиков или в бета-версии или стабильной версии Android. </p> <p> Как всегда бывает с новыми функциями Android, нам придется подождать и посмотреть, дойдет ли это вообще до ОС. </p>"}