{"title":"Roku хочет ваших мыслей на перезаряжаемом пульте дистанционного управления","content":"<p> Roku набирает людей для участия в своей программе раннего доступа, чтобы протестировать новый пульт (называемый Roku Voice Remote Pro) с аккумулятором. </p> <p> Это ограниченное по времени предложение, пока расходные материалы есть, хотя вам все равно придется платить за пульт. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> Что такое Roku Voice Remote Pro? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> Наконец-то пульт с аккумулятором </a> из <a href=\"https://www.reddit.com/r/Roku/\"> Року </a> </blockquote>  <p> Как впервые заметил пользователь Kingtut206 на <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , Roku набирает людей в свою Программу раннего доступа, чтобы протестировать новый пульт под названием Roku Voice Remote Pro. </p> <p> Новый пульт дистанционного управления оснащен аккумуляторной батареей, удаленным удаленным поиском (например, вы можете сказать «Привет, Року, найди мой пульт»), голосовой связью без помощи рук и персональными кнопками быстрого доступа наряду со стандартными фирменными кнопками. </p> <p> Как сообщает <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> Грани </a> , пульт ДУ заряжается через micro-USB, а не через гораздо более совершенный USB-C. Возможно, отзывы, собранные в рамках Программы раннего доступа, подтвердят это. </p> <p> Участие в программе только по приглашениям, но неизвестно, что дает вам право на участие. </p> <p> Пульт стоит 29,99 долларов, и ожидается, что он будет доставлен 19 февраля 2021 года. </p> <p> Будет продано только 2000 единиц, и Roku соберет отзывы о вашем опыте работы с пультом. По истечении этого времени можно предположить, что пульт будет доработан перед тем, как поступить в широкую продажу. </p>"}