{"title":"Камера Sony FX3 раскрыта через утечку в Twitter","content":"<p> Прошло всего две недели с тех пор, как Sony объявила о выпуске Sony A1, камеры 8.6K, которая может снимать 50-мегапиксельные изображения со скоростью до 30 кадров в секунду. Но разве компания не готовится к чему-то большему? </p> <p> Все, что у нас есть сейчас, - это просто предположения, но Sony может добавить новую гладкую и компактную камеру в свою серию FX. </p> <h2 id=\"a-preview-of-the-sony-fx3\"> Превью Sony FX3 </h2> <p> В среду Нокишита опубликовал в Твиттере изображение Sony FX3, камеры, которая могла бы бросить вызов Canon EOS C70 и Pocket Cinema 6K от Blackmagic Design. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> ニ ー FX3 の 画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> # 噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> - 下 デ ジ カ メ 情報 局 (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> 10 февраля 2021 г. </a></blockquote>  <p> Nokishita - японский технический блог, печально известный ранними и точными утечками предстоящего фото и видео оборудования. Несмотря на то, что он не является официальным источником для каких-либо компаний, производящих оптическую продукцию, некоторые люди заходят так далеко, что информация, предоставленная Nokishita, также может быть подтверждена. </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> TechRadar </a> однажды назвал Нокишиту «Дедом Морозом слухов о камерах». В ответ на приведенный выше твит пользователь Twitter @miemelaar спросил: «[это] реально или концепция?» и @rauuru_san ответил: «Если Nokishita опубликует это, то это настоящая сделка». </p> <p> Но даже если бы мы предположили, что утечка была правдой, сколько информации нам остается в действительности? </p> <p> Мы можем предположить, что FX3 является частью линейки FX из-за своего названия, но на камере есть символ, который сбивает с толку многих спекулянтов. Если эта белая метка альфа (α) на передней панели камеры кажется вам знакомой, это связано с тем, что вы можете найти такую ​​же метку на беззеркальных камерах Sony. </p> <p> Так что же, FX3 - это кинокамера, беззеркальная камера или гибрид в стиле DSLR? Нам придется подождать, пока появятся более подробные сведения. А пока прочтите нашу статью о <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> ключевые различия между беззеркальными фотоаппаратами, зеркалками и видеокамерами </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> Что принесет Sony FX3? </h2> <p> С тех пор, как Нокишита опубликовал твит, предполагаемые технические характеристики камеры разлетелись по сети. Тем не менее, пока нет ничего из столь же авторитетных источников. </p> <p> К счастью, мы узнаем больше о Sony FX3 в ближайшие недели. Крупнейшее фото-событие Японии CP + 2021 состоится 25-28 февраля. </p>"}