{"title":"Смарт-карта здоровья и цифровой паспорт вакцинации: в чем большая разница?","content":"<p> Пандемия COVID-19 потрясла системы здравоохранения. Теперь перспективы цифровых паспортов здоровья и смарт-карт здоровья набирают обороты, поскольку правительства и компании пытаются вернуться к нормальной жизни. </p> <p> Итак, что такое смарт-карта здоровья и совпадает ли она с паспортом здоровья? </p> <h2 id=\"what-is-a-smart-health-card\"> Что такое смарт-карта здоровья? </h2> <p> Смарт-карта здоровья представляет собой тонкий пластик со встроенной микросхемой, содержащей зашифрованные данные. </p> <p> Что делает его умным, так это чип, который действует как суперкомпьютер. Микросхема может быть запрограммирована для выполнения различных действий с многочисленными приложениями, в то время как считыватели, подключенные к компьютерной системе, могут получать доступ или обновлять данные микросхемы. </p> <p> Он может выглядеть как кредитная карта, но функционирует иначе. Смарт-карта здоровья, используемая во многих странах Европы и во всем мире, хранит медицинскую информацию, страховое покрытие и другие важные медицинские данные. </p> <p> </p> <h2 id=\"advantages-of-using-a-smart-health-card\"> Преимущества использования смарт-карты здоровья </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Здравоохранение во Франции: что такое «Carte Vitale»? <a href=\"https://t.co/5VVcTjZyxh\"> https://t.co/5VVcTjZyxh </a> <a href=\"https://t.co/6I0TCy70wg\"> pic.twitter.com/6I0TCy70wg </a></p> - FrenchEntrée (@FrenchEntree) <a href=\"https://twitter.com/FrenchEntree/status/738646709308379136?ref_src=twsrc%5Etfw\"> 3 июня 2016 г. </a></blockquote>  <p> Среди многих других преимуществ использования этой системы наиболее важным является улучшение оказания неотложной или неотложной помощи. Смарт-карты здоровья обеспечивают немедленный доступ к данным о здоровье пациента или медицинской документации в экстренных случаях. </p> <p> Например, служба экстренной помощи с портативным устройством для чтения карт будет иметь немедленную информацию о пациенте, находясь в машине скорой помощи по пути в больницу. Это еще более важно, когда пациент без сознания, не отвечает или просто не может сообщить респонденту свою медицинскую информацию. </p> <p> Представьте себе респондента, который может передать важные данные о пациенте персоналу отделения неотложной помощи до прибытия машины скорой помощи. Это поможет персоналу скорой помощи подготовить все необходимое для лечения пациента еще до прибытия. </p> <p> Быстрая и эффективная передача данных о пациентах во время оказания неотложной помощи может значительно сократить время отклика и тем самым спасти жизни. </p> <h3 id=\"seamless-transfer-of-data\"> Беспроблемная передача данных </h3> <p> Использование этой системы также обеспечивает более точную и плавную передачу информации о пациенте от персонала отделения неотложной помощи поставщикам медицинских услуг в стационарных условиях. </p> <p> Врачам не нужно полагаться на память пациента, чтобы <a href=\"https://www.makeuseof.com/tag/google-store-medical-data-cloud/\" target=\"_blank\" rel=\"nofollow noopener\"> получить важные медицинские данные </a> , что снижает вероятность ошибки. Помимо этого, система смарт-карт здоровья предлагает беспрепятственный обмен информацией о пациентах между врачами. </p> <p> Это снижает вероятность утечки важных данных пациента (которые могут быть использованы для <a href=\"https://www.makeuseof.com/tag/the-10-pieces-of-information-identity-thieves-are-looking-for/\" target=\"_blank\" rel=\"nofollow noopener\"> кража личных данных </a> ). Это часто происходит, когда информация о пациенте передается по факсу, телефону или электронной почте. </p> <h3 id=\"easier-storage-and-retrieval-of-medical-records\"> Упрощение хранения и поиска медицинских записей </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"it\" dir=\"ltr\"> Tessera sanitaria: come richiederne un duplicato <a href=\"https://t.co/2GrFWpanC2\"> https://t.co/2GrFWpanC2 </a> <a href=\"https://t.co/JKR6ampnXq\"> pic.twitter.com/JKR6ampnXq </a></p> - CataniaToday (@CataniaToday) <a href=\"https://twitter.com/CataniaToday/status/1359189830937300995?ref_src=twsrc%5Etfw\"> 9 февраля 2021 г. </a></blockquote>  <p> Система предоставляет пациентам удобный и беспроблемный способ носить с собой результаты лабораторных исследований или записи врача. </p> <p> Это все равно, что хранить базу данных с медицинской информацией - предыдущими тестами, лечением и файлами для страхового покрытия - на маленькой карточке в бумажнике пациента. Больше не нужно таскать с собой бумажки для записи на прием к врачу. </p> <h3 id=\"reduces-medical-errors-and-duplicate-testing\"> Снижает количество медицинских ошибок и дублирования тестов </h3> <p> Система здравоохранения страны может даже выиграть от этого, поскольку можно избежать медицинских ошибок и повторных анализов. С помощью этой системы можно свести к минимуму медицинские ошибки, связанные с неправильным вводом данных, языковыми барьерами или недопониманием. </p> <p> Человеческая ошибка иногда может привести к несоответствию пациентов и записей. Наличие смарт-карты здоровья позволяет поставщикам медицинских услуг легко сопоставлять пациента с правильными записями о состоянии здоровья. Это снижает вероятность наличия повторяющихся записей или множественных избыточных тестов, что может стоить больших денег. Это могло бы сэкономить системе здравоохранения ненужные расходы. </p> <h3 id=\"more-accurate-verification-of-insurance-coverage\"> Более точная проверка страхового покрытия </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Городской перерыв? Рабочая поездка? Каникулы? Для душевного спокойствия всегда носите с собой европейскую карту медицинского страхования! <a href=\"https://t.co/31zoREZAEy\"> https://t.co/31zoREZAEy </a> <a href=\"https://twitter.com/hashtag/EHIC?src=hash&ref_src=twsrc%5Etfw\"> #EHIC </a> <a href=\"https://t.co/o05Jx8aIwq\"> pic.twitter.com/o05Jx8aIwq </a></p> - Европейская комиссия 🇪🇺 (@EU_Commission) <a href=\"https://twitter.com/EU_Commission/status/893485278114992128?ref_src=twsrc%5Etfw\"> 4 августа 2017 г. </a></blockquote>  <p> В последние годы кража медицинских данных стала серьезной проблемой. Преступление включает мошенническое использование информации о медицинском страховании для доступа к медицинским услугам или получения возмещения. Проще говоря, человек, на которого не распространяется действие полиса, может украсть чужую информацию о медицинском страховании, чтобы получить пособие. </p> <p> Нарушения системы здравоохранения или медицинского страхования часто приводят к утечке конфиденциальной информации, позволяющей установить личность (PII), которую хакеры могут продавать в темной сети. PII может включать информацию о медицинском страховании. </p> <p> Это то, что воры используют для доступа к медицинским услугам, к которым у них не должно быть доступа. Они могут покупать рецептурные лекарства или подавать ложные страховые иски за процедуры, которые никогда не выполнялись. </p> <p> Система смарт-карт здоровья может предотвратить все это, поскольку большинство из них используют протоколы аутентификации и безопасности. Некоторые могут использовать двухфакторную аутентификацию (2FA) или многофакторную аутентификацию (MFA), в то время как другие имеют функцию биометрии, которая проверяет отпечатки пальцев пациента, чтобы подтвердить их личность. </p> <p> </p> <h2 id=\"disadvantages-of-using-a-smart-health-card-system\"> Недостатки использования системы смарт-карт здоровья </h2> <p> Проблемы конфиденциальности остаются самой большой проблемой, которая удерживает пользователей от адаптации технологий для медицинских целей. Многие выразили обеспокоенность по поводу предоставления людям легкого доступа к множеству конфиденциальных данных, таких как лечение, записи о заболеваниях и лекарства. А учитывая новости о том, что системы здравоохранения и страхования становятся жертвами утечки данных, эти опасения не совсем необоснованны. </p> <p> Удобно хранить все записи в одном месте, но <a href=\"https://www.makeuseof.com/tag/healthcare-new-attack-vector-scammers-id-thieves/\" target=\"_blank\" rel=\"nofollow noopener\"> данные нарушения </a> может передать очень конфиденциальные данные в чужие руки. </p> <h3 id=\"creating-digital-divide\"> Создание цифрового разрыва </h3> <p> Затем возникает проблема создания цифрового разрыва. Многие утверждают, что смарт-карты здоровья могут использоваться только больницами и сообществами, имеющими доступ к системе. Чтобы воспользоваться этой технологией, больничный компьютер должен поддерживать такое же программное обеспечение, интерфейс устройства чтения смарт-карт и необходимое оборудование. </p> <p> Говоря об оборудовании, возникает еще вопрос о дополнительных расходах. Аппаратное обеспечение системы, программное обеспечение для считывателя и сеть с базой данных могут стоить миллионы, а обслуживание может стоить еще больше. Даже производство самих пластиковых карт стоит денег. </p> <p> Кто сделает первоначальные вложения? Кроме того, как скоро эти первоначальные инвестиции принесут пользу правительству и его гражданам? </p> <h3 id=\"bugs-and-power-failures\"> Ошибки и сбои питания </h3> <p> Конечно, такая технология не защищена от ошибок и сбоев или кибератак, которые могут вызвать утечку данных. Одно непропатченное устройство в системе может стать шлюзом для вредоносных программ, которые могут нанести ущерб сети и базе данных. </p> <p> Есть также опасения по поводу перебоев в подаче электроэнергии. Как это можно поддерживать в сообществах с ограниченными энергоснабжением или проблемами с энергетической инфраструктурой? Даже самые сложные энергосистемы могут выйти из строя при крупных бедствиях. Представьте, что у вас нет доступа к медицинским данным во время бедствия. </p> <p> </p> <h2 id=\"smart-healthcare-vs-digital-vaccination-passport\"> Smart Healthcare Vs. Цифровой паспорт вакцинации </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Крупные имена в сфере технологий и здравоохранения, включая клинику Mayo, Cigna&#39;s Evernorth и Microsoft, объединяются для создания цифрового паспорта вакцинации COVID-19. <a href=\"https://t.co/KgTVjq9lUe\"> https://t.co/KgTVjq9lUe </a> <a href=\"https://t.co/ZiJIE8xoTY\"> pic.twitter.com/ZiJIE8xoTY </a></p> - Здоровье мачты (@MastAnalytics) <a href=\"https://twitter.com/MastAnalytics/status/1351683116990164993?ref_src=twsrc%5Etfw\"> 20 января 2021 г. </a></blockquote>  <p> Были разговоры о цифровом паспорте вакцинации для поездок и доступа на концерты или собрания после Covid. Хотя цифровой паспорт здоровья может показаться похожим на смарт-карту здоровья, используемую в таких странах, как Германия, Франция и Австрия, между ними есть ключевые различия. </p> <p> </p> <p> Во-первых, цифровой паспорт вакцины COVID-19 будет представлен в виде цифрового сертификата, загружаемого на телефон человека. Цифровой сертификат или паспорт вакцины Covid - это пропуск с именем пациента и данными о его вакцине Covid (дата введения, производитель вакцины, место вакцинации). Это одностраничный цифровой документ со штрих-кодом или QR-кодом, который можно сканировать в точках входа. </p> <p> В отличие от смарт-карты здоровья, цифровой паспорт здоровья не предназначен для использования в качестве физической пластиковой карты. </p> <p> В нем будет только информация, касающаяся тестов человека на COVID-19, записей о вакцинациях и медицинских учреждений, в которых проводились эти вакцинации и тесты. В нем не будет всей истории болезни пациента. </p> <p> Эти цифровые паспорта здоровья предоставят людям доступ к собраниям, таким как концерты и рабочие места, где они будут контактировать со многими людьми, или позволят им въезд в страны, как только путешествие станет нормальным. Люди без смартфона могут распечатать свои коды, отсканированные при въезде. </p> <h3 id=\"breach-of-privacy-and-curtailment-of-human-rights\"> Нарушение конфиденциальности и ущемление прав человека </h3> <p> В то время как многие хотят получить укол, загрузить цифровой паспорт вакцинации и вернуться к нормальной жизни, некоторые бьют тревогу по поводу возможных последствий внедрения этой технологии. Эксперты и правозащитники предупреждают разработчиков о том, что они должны решать потенциальные проблемы с конфиденциальностью данных и правами человека, которые могут возникнуть в результате вакцинации. </p> <p> Исследования, опубликованные <a href=\"https://socialsciences.exeter.ac.uk/media/universityofexeter/collegeofsocialsciencesandinternationalstudies/lawimages/research/Policy_brief_-_Digital_Health_Passports_COVID-19_-_Beduschi.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Школа права Университета Эксетера </a> предупреждает, как этот паспорт может ограничить основные права человека, включая право на неприкосновенность частной жизни, свободу передвижения и мирных собраний. </p> <p> Согласно отчету, проблема заключается в использовании паспортом конфиденциальной личной информации о здоровье (как она будет храниться, у кого будет к ней доступ?) И как это может создать новый разрыв между людьми в зависимости от состояния их здоровья. </p> <p> Паспорт также потенциально может определять или ограничивать степень, в которой человек пользуется правами и свободами. Эксперты предупреждают, что использование цифровых паспортов здоровья может усугубить неравенство между сообществами, которые имеют немедленный доступ к вакцинам или паспортам здоровья, и теми, у которых нет. </p> <p> </p> <h2 id=\"future-of-healthcare\"> Будущее здравоохранения </h2> <p> Такие страны, как Франция, используют смарт-карты здравоохранения с 90-х годов, а другие страны последовали их примеру в начале 2000-х годов. </p> <p> Внедрение этой технологии в таких странах, как США, идет довольно медленно, поскольку первоочередной проблемой являются вопросы конфиденциальности. Принятие этой системы дает множество преимуществ, но есть и несколько недостатков, которые требуют внимательного рассмотрения. </p>"}