{"title":"Twitter для обозначения личных аккаунтов государственных служащих","content":"<p> Twitter скоро начнет наклеивать ярлыки на личные аккаунты государственных чиновников. Этикетки призваны помочь пользователям легко идентифицировать кого-либо, связанного с правительством. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Больше государственных чиновников получат ярлыки в Твиттере </h2> <p> Согласно сообщению на <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> блог Twitter </a> , платформа начнет маркировать личные аккаунты &quot;глав государств&quot; 17 февраля 2021 года. Она также будет прикреплять ярлыки к аккаунтам, связанным с аффилированными с государством СМИ. </p> <p> Twitter также расширяет сферу деятельности своих лейблов, чтобы охватить правительственных чиновников в большем количестве стран. Эти местоположения включают Канаду, Кубу, Эквадор, Египет, Германию, Гондурас, Индонезию, Иран, Италию, Японию, Саудовскую Аравию, Сербию, Испанию, Таиланд, Турцию и Объединенные Арабские Эмираты. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Кредит изображения: Twitter </p> <p> Платформа надеется, что эти ярлыки помогут пользователям «получить более информированный опыт работы в Твиттере», а также планирует настроить текст ярлыка, чтобы «добавить больше конкретики», «проводя различие между отдельными лицами и учреждениями». </p> <p> Первая волна ярлыков Twitter для аккаунтов, связанных с государством, была запущена в августе 2020 года. Первоначально эти ярлыки применялись только к должностным лицам, связанным с пятью странами в Совете Безопасности Организации Объединенных Наций, и не включали личные аккаунты этих должностных лиц. </p> <p> Тем не менее, эти ярлыки не <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> вопиющий удар по дезинформации </a> , но они по-прежнему помогут пользователям получить больше информации о том, что они читают и от кого это исходит. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter будет только продолжать расширять свои лейблы </h2> <p> В конце своего сообщения в блоге Twitter отметил, что надеется со временем расширить свои лейблы на «другие страны». Ярлык отображается в профиле пользователя в Твиттере в виде бледно-серого флажка, и, вероятно, вы будете чаще его встречать в ближайшие недели. </p>"}