{"title":"Дата выхода Surface Duo в Великобритании и снижение цен","content":"<p> У Microsoft Surface Duo не было такой фантастической реакции на выпуск, но похоже, что компания стремится произвести лучшее первое впечатление за пределами США. Компания не только снижает цену на Surface Duo, но и имеет подтвержденную дату выпуска для рынка Великобритании. </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> Окончательная подготовка Microsoft к выпуску Surface Duo за рубежом </h2> <p> Эта новость приходит к нам из <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . Если вы помните, когда был запущен Surface Duo, <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> он не получил хороших отзывов </a> . Одним из главных препятствий было то, насколько глючна операционная система Duo, но другим была его привлекательная цена в 1399,99 долларов. </p> <p> Microsoft усердно работала над исправлением основных проблем, обнаруженных обозревателями, но ее высокая цена все еще оставалась на прежнем уровне. Однако Microsoft планирует значительно снизить цену Surface Duo до 999,99 долларов. </p> <p> Это падение, вероятно, связано с подготовкой к его выпуску за границу, поскольку критики во всем мире готовятся разбить Surface Duo дюйм за дюймом. Благодаря этой сниженной цене, а также недавним исправлениям операционной системы Surface Duo, чудо с двумя экранами может произвести положительное впечатление за границей. </p> <p> Microsoft также подтвердила, когда британские фанаты смогут опробовать Surface Duo на себе. Если вы находитесь в Великобритании, следите за розничными продавцами электроники 18 февраля 2021 года. </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> Сквозь поверхность планов Microsoft за рубежом </h2> <p> В то время как Surface Duo изо всех сил пытался произвести хорошее впечатление в США, на него все еще есть надежда за рубежом. Со всеми исправлениями в операционной системе Surface Duo в сочетании с этим падением цены трава может оказаться более зеленой на другой стороне. </p> <p> Если вы хотите знать, какие патчи Microsoft выдвинула для Surface Duo, компания недавно выпустила несколько обновлений стабильности, чтобы устранить ошибки перед международным дебютом Duo. </p> <p> <small> Кредит изображения: Джек Скинс / <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}