{"title":"Правительство США хочет знать о точности меток конфиденциальности приложений","content":"<p> Благодаря своим ярлыкам конфиденциальности приложений iOS 14 в App Store, Apple дает пользователям новый способ получить больше информации о приложениях, которые они используют, и о том, как эти приложения могут их отслеживать. </p> <p> Но похоже, что это также потенциально открыло для себя банку червей, поскольку Apple теперь заставляют поручиться за точность этих этикеток, которые разработчики начали отправлять в Apple еще в декабре. </p> <h2 id=\"concerns-over-accuracy\"> Опасения по поводу точности </h2> <p> Как отмечает <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumors </a> , Apple получила <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> письмо </a> от комитета Палаты представителей США по энергетике и торговле с просьбой уточнить информацию о точности предоставленных разработчиками этикеток конфиденциальности приложений. </p> <p> Эти ярлыки - это функция iOS 14, которую с нетерпением ждали в одних, а в других опасались. Это означает, что пользователи смогут принять более обоснованное решение, когда дело доходит до преимуществ и недостатков использования определенных приложений. </p> <p> </p> <p> В своем письме Комитет по энергетике и торговле Палаты представителей США спрашивает Apple о сообщениях, согласно которым определенные ярлыки конфиденциальности приложений могут предоставлять пользователям «вводящую в заблуждение и ложную» информацию. Это основано на отчете, опубликованном в прошлом месяце, в котором утверждается, что многие приложения, получившие чистую оценку здоровья, могут быть не такими невинными, как они предполагают. </p> <p> Потенциальная проблема с функцией iOS 14 заключается в том, что она полагается на честность разработчика, чтобы сказать, как собираются данные, а также для подтверждения точности этой информации. Сама Apple отмечает, что информация «не была проверена Apple». </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Запрос ответа от Apple </h2> <p> Хотя кажется вероятным, что большинство разработчиков будут играть честно и соблюдать систему чести, это нельзя считать само собой разумеющимся. Apple будет регулярно проверять отправляемую информацию. Однако огромное количество приложений в App Store не позволяет Apple лично проверять каждое объявление. </p> <p> В письме Комитета Палаты представителей США по энергетике и торговле продолжается следующее: </p> <blockquote> <p> «Мы призываем Apple повысить достоверность своих меток конфиденциальности приложений, чтобы гарантировать, что потребителям предоставляется значимая информация о методах обработки данных в их приложениях, и чтобы потребители не пострадали от этих потенциально вводящих в заблуждение методов». </p> </blockquote> <p> Комитет попросил Apple предоставить более подробную информацию о процессе аудита, будут ли исправлены метки конфиденциальности приложений, если они будут признаны ложными, подробности о том, что происходит, когда разработчики предоставляют неточную информацию, и многое другое. </p> <p> Они просят Apple предоставить информацию, запрошенную до 23 февраля. </p> <p> <small> Кредит изображения: Джейсон Дент / <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Unsplash CC </a></small> </p>"}