{"title":"VW утверждает, что Apple не сможет легко управлять автомобилем","content":"<p> Герберт Дисс, исполнительный директор Volkswagen Group, преуменьшает возможное влияние Apple Car на автомобильную промышленность, заявляя, что VW «не боится» проекта Titan. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW &quot;не боится&quot; Apple Car </h2> <p> Хотя Дисс признает, что автомобиль Apple действительно может иметь смысл, он не думает, что Apple сможет доминировать в автомобильной отрасли «в мгновение ока» из-за жесткой конкуренции. Он намекнул, что резка стали и продажа автомобилей привередливым потребителям - это сложный бизнес, добавив, что это не та область, которую любая компания может просто «захватить одним махом». </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Рейтер </a> передает то, что Дисс сказал Frankfurter Allgemeine Sonntagszeitung в интервью: </p> <blockquote> <p> Автомобильная промышленность - нетипичный технический сектор, который можно было бы захватить одним махом. Apple не справится с этим в одночасье. Тем не менее, мы не боимся. </p> </blockquote> <p> Тем не менее, автомобиль под брендом Apple будет иметь смысл, учитывая компетенцию Apple в области аккумуляторов, программного обеспечения, промышленного дизайна и ее, казалось бы, бесконечных ресурсов, добавил руководитель. Apple не предлагает никаких продуктов для автомобилей, кроме <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Программное обеспечение для приборной панели CarPlay </a> что позволяет автомобильному радиоприемнику или головному устройству работать как дисплей и контроллер для iPhone. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> Наихудший секрет отрасли </h2> <p> Планы Project Titan (внутреннее кодовое название Apple Car) до сих пор не обнародованы, несмотря на шквал недавних слухов о том, что <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple искала партнерство с Hyundai / Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Говорят, что Apple разговаривала с другими автомобильными компаниями. </a> и контрактные производители, включая Magna, Nissan и Foxconn, о создании своего автомобиля с автономным приводом. Источники говорят, что в Apple Car может не хватать рулевого колеса, потому что он может изначально <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> сосредоточиться на доставке еды и операциях роботакси </a> перед продажей потребителям. </p> <p> </p> <p> Главный вывод из комментария Герберта заключается в том, что автомобильная промышленность уделяет пристальное внимание проекту «Титан». Ясно, что сама мысль о выходе Apple в этот сектор заставляет некоторых топ-менеджеров нервничать. Тем не менее, история полна людей, которые должны были знать лучше, чем высмеивать Apple за переход в новую категорию продуктов. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Как генеральный директор Palm смеялся над iPhone </h2> <p> Лучший тому пример - бывший генеральный директор Palm Эд Коллиган. Всего за несколько недель до появления оригинального iPhone в 2007 году, Коллиган посмеялся над идеей о том, что компания, известная своей разработкой красивых компьютеров, может привлечь клиентов в конкурентном секторе смартфонов, сказав: </p> <blockquote> <p> В течение нескольких лет мы учились и пытались понять, как сделать приличный телефон. Компьютерщики не собираются в этом разбираться. Они не собираются просто заходить. </p> </blockquote> <p> Подобно тому, как Коллиган охарактеризовал Apple как «компьютерщиков», босс Volkswagen пытается преуменьшить мнение о том, что технологическая компания может привлечь клиентов в автомобильном бизнесе. История покажет, устареет ли комментарий Герберта лучше, чем комментарий Коллигана. </p>"}