{"title":"Что такое MTA-STS и как он защищает вашу электронную почту?","content":"<p> Электронная почта - главный виновник большинства кибератак. Это удобная точка доступа для вредоносных программ, рекламного ПО, спама и фишинга, которая предоставляет злоумышленникам неограниченные возможности для получения вашей личной информации. </p> <p> Чтобы уменьшить эти угрозы, должны быть приняты строгие меры безопасности как для индивидуальных, так и для корпоративных учетных записей электронной почты. </p> <h2 id=\"email-security-and-encryption\"> Безопасность и шифрование электронной почты </h2> <p> Несмотря на популярность других способов связи, обмен сообщениями электронной почты по-прежнему является самой крупной формой передачи данных для любого человека или организации. Защита содержимого электронной почты является жизненно важной необходимостью. </p> <p> Безопасность электронной почты влечет за собой проверку и шифрование всего входящего и исходящего электронного трафика. Шифрование играет жизненно важную роль в сохранении конфиденциальности содержимого электронной почты за счет обеспечения безопасных соединений SMTP (Simple Mail Transfer Protocol). </p> <p> До недавнего времени шифрование было только необязательным требованием для SMTP. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> Как работает шифрование электронной почты? </h2> <p> Шифрование электронной почты - это процесс добавления шифра или фрагмента кода к содержимому вашего сообщения, что делает его нечитаемым. Преобразуя данные электронной почты в код, содержимое защищается от несанкционированного доступа. Проще говоря, ваша электронная почта зашифрована. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> В качестве дополнительной безопасности в процессе шифрования используются открытые и закрытые ключи, при этом зашифрованные ключи обмениваются, чтобы заблокировать и разблокировать закодированные электронные письма. Отправитель шифрует электронное письмо с использованием криптографии с открытым ключом, а затем получатель использует закрытый ключ для расшифровки полученного сообщения. </p> <p> Шифрование применяется ко всему пути сообщения электронной почты от начала до конца. Рекомендуется шифровать все входящие и исходящие электронные письма, а не только те, которые содержат конфиденциальную информацию. Это предотвращает получение злоумышленниками любой точки входа в вашу систему. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> Предпосылки и проблемы с SMTP </h2> <p> Когда в 1982 году появился протокол SMTP, шифрование электронной почты не было обычной практикой, и по умолчанию электронные письма отправлялись и принимались в виде обычного текста. Чтобы обеспечить безопасность на транспортном уровне, в конце 1990-х годов была добавлена ​​команда STARTTLS, которая предлагала возможность шифрования через <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> Протокол TLS (Transport Layer Security) </a> . </p> <p> Каким бы многообещающим ни казалось обновление TLS, оно оставило две лазейки в безопасности нетронутыми: </p> <ol> <li> Вариант шифрования был таким: <strong> по желанию </strong> . Небезопасные электронные письма по-прежнему процветали, вызывая всплеск кибератак. </li> <li> Даже при наличии STARTTLS не было возможности проверить подлинность сервера отправителя, поскольку серверы SMTP не проверяют сертификаты. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> Прибытие МТА-СТС </h2> <p> В 2019 году Google наконец-то подошел к делу и объявил о принятии нового стандарта MTA-STS (Mail Transfer Agent / Strict Transport Security) ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> Это дает поставщикам почтовых услуг возможность применять TLS для защиты SMTP-соединений, а также предлагает возможность запретить доставку электронной почты на хосты MX, которые не предлагают TLS с надежным сертификатом сервера. </p> <p> MTA-STS наконец решает все предыдущие проблемы с SMTP, обеспечивая шифрование между взаимодействующими серверами SMTP. Но как это на самом деле работает? Давай выясним! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> Как работает MTA-STS? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS начинает работу, давая SMTP-серверу команду связываться с другим SMTP-сервером только при двух условиях: </p> <ol> <li> SMTP-сервер <strong> должен </strong> быть зашифрованным. </li> <li> Имя домена в сертификате сервера соответствует домену в политике, а сертификаты актуальны. </li> </ol> <p> Используя комбинацию DNS и HTTPS для публикации политики, MTA-STS сообщает отправляющей стороне, как действовать, если зашифрованный канал связи не может быть инициирован. </p> <p> MTA-STS легко внедрить на стороне получателя, но для отправителя требуется вспомогательное программное обеспечение почтового сервера, такое как <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> должен быть использован. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> Какие типы атак смягчают MTA-STS? </h2> <p> Если к вашим сообщениям электронной почты применяется MTA-STS, встречаются следующие угрозы: </p> <p> <strong> Атаки Man-In-The-Middle (MITM): </strong> Эта атака осуществляется, когда злоумышленник вмешивается в процесс обмена данными между двумя сторонами, чтобы украсть или изменить данные. В случае электронной почты это обычно означает два взаимодействующих сервера SMTP. Эти атаки можно легко предотвратить с помощью MTA-STS. </p> <p> <strong> Атаки на понижение версии: </strong> Злоумышленник заставляет сетевой канал перейти в небезопасный режим передачи данных. Например, эта атака может перенаправить посетителя веб-сайта с HTTPS-версии сайта на HTTP-версию. MTA-STS помогает бороться с этими атаками, предотвращая любой несанкционированный доступ. </p> <p> <strong> Атаки с использованием спуфинга DNS: </strong> Эти хитрые атаки изменяют записи DNS предполагаемого места назначения пользователя и заставляют их поверить в то, что они посещают законный сайт или домен. Внедрение MTA-STS очень помогает в смягчении этих атак. </p> <p> </p> <p> Теперь, когда мы знакомы с MTA-STS, пришло время познакомиться с новым стандартом отчетов для SMTP, известным как отчеты TLS. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> Что такое отчеты SMTP TLS (TLS-RPT)? </h2> <p> Как и MTA-STS, TLS-RPT - это стандарт отчетности, который выявляет проблемы с подключением и расхождения между отправляющими приложениями. После включения он отправляет ежедневные отчеты о любых проблемах с подключением, с которыми сталкиваются внешние серверы при отправке вам электронных писем. </p> <p> Думайте об этом как об инструменте устранения неполадок, где отчеты могут использоваться для оценки и сортировки потенциальных проблем и проблем конфигурации. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> Какие типы проблем решает TLS-RPT? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Диагностическая отчетность: </strong> Отчетность TLS предлагает диагностические отчеты в формате файла JSON, содержащие исчерпывающие сведения о любых входящих сообщениях электронной почты, с которыми возникают проблемы с доставкой. Он также обнаруживает электронные письма, которые не были доставлены или не были доставлены, например, из-за атаки на более раннюю версию. </p> <p> <strong> Улучшенная видимость: </strong> Включив TLS-RPT, вы можете улучшить видимость на всех своих каналах электронной почты. Это позволяет вам следить за всеми данными, которые поступают к вам, в том числе за ошибочными сообщениями. </p> <p> <strong> Ежедневные отчеты: </strong> Отчеты о диагностике отправляются не реже одного раза в день, чтобы подробно изучить и изучить политики MTA-STS. Отчеты также включают статистику трафика, а также подробную информацию об ошибках и неудачных доставках. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Когда все остальное терпит неудачу, шифрование преобладает </h2> <p> Из-за постоянно меняющегося характера киберугроз строгие меры безопасности и криптография являются обязательными для безопасной и надежной доставки электронной почты. </p> <p> Благодаря различным поставщикам электронной почты, предлагающим надежные возможности шифрования и стандартам MTA-STS, полностью безопасная передача электронной почты больше не является чем-то фантастическим. </p>"}