{"title":"В чем разница между LAN и WAN в сети?","content":"<p> Если вы сунули нос в компьютерные сети, есть большая вероятность, что вы встречали термины «LAN» и «WAN». Однако что означает каждый из них и каковы различия при сравнении LAN и WAN? </p> <p> Давайте посмотрим на обе эти технологии и на то, где каждая из них сияет. </p> <h2 id=\"what-does-lan-stand-for\"> Что означает &quot;LAN&quot;? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> Изображение предоставлено: Drug Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> LAN - это «локальная сеть». Этот термин описывает сеть, в которой все подключенные устройства расположены близко друг к другу. Все они находятся в «местном районе», отсюда и название. </p> <p> Когда компьютер подключается к локальной сети, он получает адрес локального интернет-протокола (IP). Это работает аналогично IP-адресу, который вы получаете при выходе в Интернет. Однако локальный IP-адрес работает только для других компьютеров в той же локальной сети, что и вы. Например, вы не можете использовать локальный IP-адрес для подключения к компьютеру через Интернет. </p> <p> Физическая граница вашей домашней локальной сети, скорее всего, не покинет ваш дом. Конечно, если вы возьмете телефон или ноутбук в сад, чтобы подышать свежим воздухом, он все равно будет подключен к локальной сети. Однако большую часть времени все ваши подключенные к сети устройства безопасно находятся в четырех стенах вашего дома. </p> <p> Компании и институты также создают локальные сети. Например, университет может подключить все ПК в своей библиотеке к сети, чтобы все они могли общаться друг с другом. Предприятиям также нравится использовать локальные сети, потому что они позволяют сотрудникам отправлять друг другу файлы и корреспонденцию, не выходя в Интернет. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> Что означает &quot;WAN&quot;? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Кредит изображения: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> С другой стороны, у нас есть глобальная сеть или WAN. Если вы читаете эту статью, вы уже подключены к глобальной сети - мы называем это Интернетом. </p> <p> «Широкий» в глобальной сети сильно варьируется. Если вы подключаетесь к внешнему серверу в том же городе, что и вы, это WAN. Это также считается WAN, если вы подключаетесь к серверу в стране на другой стороне планеты. </p> <p> Таким образом, глобальная сеть обычно используется для описания любой сети, к которой вы подключаетесь, которая существует за пределами вашего маршрутизатора. Не имеет значения, находится ли сервер в миле или на континенте; он по-прежнему «широкий». </p> <p> Интернет - не единственная глобальная сеть. Компании используют глобальные сети для подключения офисов, находящихся в разных странах. Например, если у компании есть офис в Нью-Йорке, Токио и Сиднее, он может арендовать собственную систему WAN, чтобы позволить им общаться друг с другом. </p> <p> Но подождите минутку; зачем компании создают свои собственные WAN, если они могут просто подключить все к Интернету? Проблема с этим решением заключается в том, что компании придется оплачивать сборы ISP, и если что-то пойдет не так, им придется бороться с указанным ISP, чтобы исправить это. </p> <p> Не только это, но и Интернет предназначен для подключения к большому количеству компьютеров по всему миру. Если компания хочет, чтобы ее ПК подключались только к другим офисным ПК, они могут использовать собственную глобальную сеть для защиты от сетевых угроз. Это называется «интранет». </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> Когда использовать LAN или WAN </h2> <p> Если вы хотите подключиться к другому устройству, которое у вас есть, вы можете сделать это через LAN или WAN. Но каковы преимущества и недостатки каждого из них и что следует использовать? </p> <p> Допустим, у вас есть новый беспроводной жесткий диск, который подключается к вашему маршрутизатору, и у вас есть выбор: разрешить подключения из Интернета (WAN) или оставить его только локальным (LAN). Какой из них вы выберете, зависит от того, что вы хотите от жесткого диска. </p> <p> Предоставление жесткому диску возможностей глобальной сети просто фантастически удобно. Это помещает его в Интернет, что означает, что вы можете подключиться к нему из любой точки мира. Таким образом, вы никогда больше не застрянете без файлов; они просто будут подключены к Интернету. </p> <p> Однако подключения к глобальной сети также позволяют другим людям получить доступ к вашим устройствам. Если безопасность вашего жесткого диска не на должном уровне, хакеры могут использовать тот же путь, что и вы, чтобы увидеть все ваши данные и скопировать или удалить важные вещи. </p> <p> С другой стороны, перевод жесткого диска в режим LAN-only защищает его от некоторых возможностей, которыми может воспользоваться хакер. Это не непроницаемо. Например, кто-то может использовать ваш компьютер для доступа к жесткому диску. Однако это намного безопаснее, чем транслировать жесткий диск в глобальную сеть каждый день и ночь. </p> <p> Если вы действительно хотите усилить безопасность, вы можете создать воздушный зазор на жестком диске. Воздушный зазор означает, что он и все ПК в одной сети не подключены к глобальной сети - например, к Интернету. </p> <p> An <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> компьютер с воздушным зазором не полностью защищен от сетевых угроз </a> , но это резко снижает вероятность нападения. Хакерам необходимо манипулировать людьми, заставляя их выполнять свои приказы по атаке на устройство с воздушным зазором, используя тактику социальной инженерии, чтобы добиться своего. </p> <p> Таким образом, выбирая между подключением устройства к Интернету или сохранением его заблокированным в домашней локальной сети, вам необходимо учитывать, действительно ли вы подключитесь к нему через Интернет. Если вы не думаете, что вы это сделаете, лучше отключить его возможности WAN и держать хакеров в страхе. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> Превращает ли подключение к Интернету локальную сеть в глобальную сеть? </h2> <p> Допустим, у вас настроена локальная сеть, в которой все ваши устройства подключены к маршрутизатору. Вам скучно, поэтому вы садитесь за компьютер и отправляетесь в Netflix. Теперь ваш компьютер подключен к глобальной сети: Интернету. </p> <p> Однако, поскольку ваш компьютер подключен к глобальной сети, означает ли это, что он больше не является частью локальной сети? К счастью, устройство может быть частью как LAN, так и WAN одновременно. </p> <p> Помните, как мы говорили, что устройства LAN имеют собственный локальный IP-адрес? Это не значит, что он также не может получить IP-адрес в Интернете. Фактически, если вы читаете эту статью об устройстве, подключенном к маршрутизатору, у него будет и то, и другое! </p> <p> Если вы хотите убедиться сами, мы рассмотрели <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> как проверить свой IP-адрес в Windows </a> . Если вы пользуетесь мобильным телефоном, вы все равно можете <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> найти свои IP-адреса на Android или iPhone </a> . </p> <p> Когда у вас будет статистика, вы должны увидеть два IP-адреса. Первый будет начинаться с «192.168» - это ваш локальный IP-адрес. Вы используете его, если хотите подключиться к своему текущему устройству с другого устройства в той же сети. </p> <p> Второй будет выглядеть двумя способами, в зависимости от того, используете ли вы IPv4 или IPv6. Если вы используете версию 4, он должен выглядеть как ваш локальный IP-адрес, но не будет начинаться с &quot;192.168.&quot; Если это IPv6, это должен быть беспорядок из букв и цифр, разделенный на восемь блоков двоеточиями. </p> <p> В любом случае этот адрес является вашим IP-адресом в Интернете. Это используется, когда вы подключаетесь к другому серверу в Интернете, чтобы он мог с вами разговаривать; например, чтобы отправить вам телешоу, которое вы смотрите на Netflix. </p> <p> В некотором смысле, вы можете представить Интернет как огромную сеть локальных сетей. Когда вы смотрите Netflix, ваш компьютер (в вашей личной локальной сети) получает данные с серверов Netflix (которые находятся в его собственной локальной сети). Каждая локальная сеть похожа на дом в городе, а подключение к Интернету - это как дороги и улицы, которые их всех соединяют. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> Устранение путаницы между LAN и WAN </h2> <p> Локальные и глобальные сети часто работают в тандеме, но работают по-разному. Теперь вы знаете разницу между ними и знаете, когда использовать каждый из них. </p> <p> Знаете ли вы, что можно настроить игру по локальной сети, чтобы люди в одной сети могли играть друг с другом? Это отличный способ провести время с друзьями без проблем с задержкой, которые иногда возникают в интернет-играх. </p> <p> <small> Кредит изображения: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}