{"title":"Вы можете получить новую Microsoft Teams Pro бесплатно","content":"<p> Некоторое время назад мы рассмотрели запланированную услугу подписки для Microsoft Teams под названием «Teams Pro», которая откроет дополнительные функции для программного обеспечения. Однако затем Microsoft официально заявила, что некоторые люди получат Teams Pro без дополнительной платы к своим текущим планам. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Заявление Microsoft о подписках на бесплатные команды Pro </h2> <p> Если вам нужно напоминание, мы уже обсуждали эту тему в нашей статье о <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro добавляет вебинары в сервис </a> . </p> <p> Теперь статья <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> по той же теме с тех пор поступило заявление от Microsoft. Это заявление является хорошей новостью для людей, которые беспокоятся о доплате за вебинары: </p> <blockquote> <p> 9 февраля мы опубликовали сообщение MC о новом плане обслуживания Teams Pro. Чтобы уточнить, нет никаких изменений в существующих лицензиях продукта с добавлением этого нового плана обслуживания. Скорее, план обслуживания будет автоматически добавлен к лицензиям Microsoft 365 и Office 365 E5 / E3 / A5 / A3, а также Microsoft 365 Business Standard / Business Premium и позволит пользователям, имеющим лицензию на эти SKU, автоматически получать возможности, развертываемые на Команды в ближайшее время. </p> </blockquote> <p> Microsoft продолжает заявлять, что администраторам не нужно ничего делать для активации этих новых функций. Кроме того, любой, у кого есть совместимая лицензия, указанная выше, получит эти блестящие новые функции без дополнительной оплаты. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Получение большего для того же с Microsoft Teams </h2> <p> Microsoft развертывает новый план подписки на Teams Pro, который открывает доступ к вебинарам и многому другому, но не всем придется доплачивать за это. Если вы повторно подписались на одну из вышеуказанных лицензий, вы можете рассчитывать на получение всех функций Teams Pro без дополнительных затрат. </p> <p> Это не значит, что люди без Teams Pro останутся в тени. Например, скоро у всех будет доступ к удобной функции резюме в Microsoft Teams. </p> <p> <small> Кредит изображения: Студия Постмодерна / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}