{"title":"Скоро вы будете играть в игры с эпическими персонажами MetaHuman","content":"<p> Если вы думаете, что игры сейчас выглядят реалистично, то подождите, пока вы не поймете, что Epic Games разработала с помощью своего движка Unreal Engine. Приготовьтесь, чтобы ваш мозг взорвался. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games представляет новых MetaHumans </h2> <p> Вам, наверное, интересно, о какой Земле мы говорим. MetaHuman Creator - это последняя функция, которую Epic Games добавила в Unreal Engine; среда разработки программного обеспечения, которую разработчики игр могут использовать для создания своих игр. </p> <p> Согласно <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Сообщение в блоге Unreal Engine </a> анонсируем захватывающий новый инструмент разработки: </p> <blockquote> <p> MetaHuman Creator - это облачное приложение, предназначенное для создания цифрового человека в реальном времени с недель или месяцев до менее чем часа без ущерба для качества. </p> </blockquote> <p> Таким образом, это, по сути, способ для разработчиков игр создавать невероятно реалистичные человеческие копии. Быстрый. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> Что означает MetaHuman Creator для разработчиков? </h2> <p> </p> <p> Последствия этого для разработки программного обеспечения меняют правила игры (каламбур). Представьте, как быстро разработчики заполнят свои игровые миры неигровыми персонажами, используя MetaHuman Creator. Не только это, но и цифровые люди выглядят невероятно. </p> <p> Это также, очевидно, будет означать, что разработчики могут закончить игры быстрее, поэтому вам не придется ждать с бесчисленными задержками. MetaHuman Creator позволяет разработчикам быстро наращивать популяцию неигровых персонажей, оставляя время для других, более неотложных дел. </p> <p> Но зачем нужен этот инструмент? Epic Games объясняет: </p> <blockquote> <p> Создать одного качественного цифрового человека сложно и отнимает много времени. Масштабирование этих усилий для создания множества разнообразных цифровых людей с качеством, требуемым платформами следующего поколения и высокопроизводительным виртуальным производством, действительно является сложной задачей. </p> </blockquote> <p> Итак, как мы сказали; инструмент экономит время и улучшает рабочий процесс, позволяя разработчикам предоставлять консолям нового поколения игры, которых они заслуживают. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> Как MetaHuman Creator повлияет на игры? </h2> <p> Что ж, благодаря MetaHuman Creator, для начала игры могут быть выпущены намного быстрее. Имея в своем распоряжении такие мощные инструменты, разработчики могут отточить игровую механику или потратить больше времени на исправление ошибок, прежде чем выпустить неработающую игру ... </p> <p> В любом случае, если не считать горечи, инструмент разработки Epic кажется чем-то, что также улучшит внешний вид игр. Достаточно взглянуть на рендеры, чтобы увидеть, насколько захватывают дух цифровые люди. Однако когда мы видим их в играх, тогда и происходит настоящее волшебство. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> Когда мы увидим мета-людей в играх? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> Сложно сказать. В настоящее время Epic назначила программное обеспечение Creator для тестирования в раннем доступе в «следующие несколько месяцев». Так что в ближайшее время вы не увидите никаких MetaHumans. </p> <p> Если вы хотите попробовать создать своего собственного цифрового человека, вы должны подождать, если хотите использовать MetaHuman Creator от Unreal Engine. Вы всегда можете попробовать объединить их в другую программу, но это определенно не займет меньше часа! </p>"}