{"title":"На сцене появился еще один неофициальный бренд лицевых панелей PS5","content":"<p> Компания dbrand, которая производит скины, экраны и чехлы для различных устройств, присоединилась к Sony-baiting и выпустила собственную неофициальную лицевую панель для PS5. </p> <h2 id=\"dbrand-releases-darkplates\"> dbrand выпускает темные латы </h2> <p> Если вы хотите настроить свою PS5, то dbrand - последняя компания, предлагающая неофициальные лицевые панели сторонних производителей для консоли нового поколения. Они называют их темными пластинами, потому что они черные лицевые пластины. </p> <p> Вы можете проверить тарелки на <a href=\"https://dbrand.com/shop/special-edition/ps5\" target=\"_blank\" rel=\"nofollow noopener\"> dbrand магазин </a> , где вы можете купить матовые черные лицевые панели за 49 долларов США (на момент написания). </p> <p> Вы также можете выбрать то, что dbrand называет «средним слоем», то есть виниловой наклейкой, которая закрывает блестящую черную центральную панель PS5. Это стоит дополнительно 11,95 долларов и доступен в различных цветах и ​​дизайнах. </p> <p> <img alt=\"dbrand shell texture detail\" src=\"images/dbrand-shell-texture-detail-544.png\" loading=\"lazy\"> </p> <p> Вы также заметите, что он может похвастаться текстурой лицевой панели. Это похоже на <a href=\"https://www.makeuseof.com/sony-how-ps5-controller-textured-playstation-symbols/\" target=\"_blank\" rel=\"nofollow noopener\"> крошечные символы PlayStation, которые вы найдете на DualSense </a> , другие официальные аксессуары для PS5 и лицевые панели сторонних производителей, которые прилагаются к консоли при ее покупке. Похожи, но так ли они впечатляющи? </p> <p> </p> <h2 id=\"will-dbrand-last\"> Будет ли dbrand Last? </h2> <p> Вы, несомненно, видели наши <a href=\"https://www.makeuseof.com/cmp-shells-ps5-faceplate-colors/\" target=\"_blank\" rel=\"nofollow noopener\"> покрытие faceplategate, касающееся оболочек CMP </a> , что сделало довольно-таки триумфальное возвращение поста Сони после бана. Кто-то может сказать, что его возвращение было высокомерным, поскольку он объявил свои новые лицевые панели юридически неприкосновенными. Посмотрим. </p> <p> </p> <p> Это заставляет задуматься, почему dbrand вообще беспокоился. Sony категорически <strong> не </strong> любезно отнеситесь к CMP Shells, во-первых, потому что ее прежнее название было слишком похоже на PlayStation (PlateStation). </p> <p> Затем Sony решила, что лицевые панели являются частью дизайна консоли, и поэтому их копирование является нарушением интеллектуальной собственности. Сигнал к удару молотка запрета. CMP Shells прекратили производство, отменив все заказы, прежде чем снова появиться в новой форме. </p> <p> dbrand уже находится на четвертой волне предварительных продаж потенциально невыполненных клиентов, поэтому вы должны действовать быстро, если хотите получить одну из настраиваемых лицевых панелей. Дойдут ли пластины до производства - другой вопрос. Sony вполне могла снова ударить молотком. </p> <p> </p> <h2 id=\"should-you-buy-a-dbrand-faceplate\"> Стоит ли покупать лицевую панель dbrand? </h2> <p> Как и в случае с сагой о CMP Shells, мы советуем всем, кто заинтересован в настройке лицевых панелей PS5, проявлять осторожность. Это продукты сторонних производителей, поэтому у вас нет другого способа подтвердить их качество, кроме того, что вам сообщает бренд. </p> <p> Кроме того, с учетом того, что Sony настаивала на том, чтобы PlateStation (ныне CMP Shells) прекратила производство, неудивительно, что она не вызовет ускоренного набора своих юристов, чтобы они тоже занялись делом dbrand. </p> <p> Короче говоря, будьте осторожны, если хотите настроить лицевые панели. CMP Shells вернула деньги всем своим клиентам с первого раза. Но это не значит, что это сделает другой бренд. </p> <p> </p> <h2 id=\"do-you-really-need-to-customize-your-ps5\"> Вам действительно нужно настроить PS5? </h2> <p> <img alt=\"ps5\" src=\"images/ps5-183.jpg\" loading=\"lazy\"> </p> <p> Если вас не устраивает внешний вид вашей PS5, вы всегда можете изменить его другими (значительно менее дорогими) способами. Вы всегда можете добавить виниловую обложку на консоль, если хотите, чтобы она выглядела иначе. </p> <p> PS5 была выпущена только в ноябре 2020 года. Возможно, попробуйте сыграть на ней в несколько игр, прежде чем вы почувствуете непреодолимое желание изменить внешний вид своей консоли. </p>"}