{"title":"10 สิ่งที่คุณไม่รู้ว่า Google Docs ทำได้","content":"<p> Google เอกสารอาจดูเหมือนพื้นฐานบนพื้นผิว แต่เครื่องมือเพิ่มประสิทธิภาพการทำงานของระบบคลาวด์มีคุณลักษณะที่มองข้ามไปมากมาย ซึ่งสามารถช่วยให้คุณทำงานได้มากขึ้นในที่ทำงาน </p> <p> ในบทความนี้ เราจะมาดูคุณลักษณะต่างๆ ของ Google เอกสารที่คุณอาจไม่เคยรู้จักมาก่อน และวิธีที่คุณสามารถใช้คุณลักษณะเหล่านี้เพื่อประหยัดเวลาในการสร้างเนื้อหา </p> <p> โปรดทราบว่าคุณลักษณะเหล่านี้สามารถเข้าถึงได้ในเวอร์ชันเดสก์ท็อปของเครื่องมือ Google เอกสารเป็นส่วนใหญ่ จะระบุสิ่งที่สามารถใช้ได้ในเวอร์ชันมือถือด้วย </p> <h2 id=\"voice-typing\"> 1. การพิมพ์ด้วยเสียง </h2> <p> หากต้องการใช้คุณสมบัติการพิมพ์ด้วยเสียง ให้เปิดเอกสารแล้วคลิก <strong> เครื่องมือ </strong> จากแถบเมนูที่ด้านบนของหน้า เลือก <strong> พิมพ์ด้วยเสียง </strong> จากเมนูแบบเลื่อนลง </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> ไมโครโฟนจะปรากฏขึ้นบนหน้าจอของคุณ พร้อมเมนูภาษาที่คุณสามารถเลือกภาษาพูดที่คุณต้องการได้ เมื่อคุณพร้อมที่จะพูดข้อความของคุณ ให้คลิกไมโครโฟนหรือกด <strong> Cmd + Shift + S </strong> (ถ้าคุณใช้ Mac) หรือ <strong> Ctrl + Shift + S </strong> (หากคุณใช้พีซีที่ใช้ Windows) เพื่อเริ่มการบันทึก </p> <p> หากต้องการเพิ่มเครื่องหมายวรรคตอนระหว่างข้อความ ให้พูดชื่อของเครื่องหมายวรรคตอนที่คุณต้องการเพิ่ม เช่น &quot;จุด&quot; &quot;จุลภาค&quot; หรือ &quot;เครื่องหมายคำถาม&quot; คุณสามารถให้คำแนะนำการจัดรูปแบบ เช่น &#39;บรรทัดใหม่&#39; หรือ &#39;ย่อหน้าใหม่&#39; หรือ &#39;หยุดฟัง&#39; หากคุณต้องการพักจากการพิมพ์ด้วยเสียง และ &#39;ดำเนินการต่อ&#39; เมื่อคุณพร้อมที่จะดำเนินการต่อ </p> <p> ค้นหาคำสั่งแก้ไขขั้นสูงจากสิ่งนี้ <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> รายการคำสั่ง </a> ในหน้าสนับสนุนของ Google </p> <p> คุณสามารถใช้คุณสมบัตินี้เพื่อถอดเสียงใด ๆ ก็ได้ เพียงแค่เล่นเสียง (จากโทรศัพท์หรืออุปกรณ์อื่น ๆ ของคุณ) เป็นเสียงเป็นข้อความ และควรพิมพ์ออกมาให้คุณ คุณอาจต้องทำการแก้ไขเล็กน้อย แต่จะช่วยประหยัดเวลาได้มาก </p> <p> </p> <p> คุณลักษณะการพิมพ์ด้วยเสียงมีให้ใช้งานบนเดสก์ท็อปเท่านั้น แต่ใช้งานได้บนเบราว์เซอร์ Chrome เท่านั้น </p> <p> </p> <h2 id=\"offline-editing\"> 2. การแก้ไขออฟไลน์ </h2> <p> หลายคนชอบ Google Docs เนื่องจากฟีเจอร์บันทึกไปยังคลาวด์แบบทันที แต่อาจไม่สะดวกถ้าคุณไม่สามารถเข้าถึงอินเทอร์เน็ตได้ชั่วขณะ ข่าวดีก็คือคุณยังคงสามารถเข้าถึงและแก้ไขไฟล์ของคุณแบบออฟไลน์ได้ </p> <p> คุณลักษณะนี้มีให้ใช้งานบน Google Chrome เท่านั้น และคุณจะต้องติดตั้งและเปิดใช้งาน <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> ส่วนขยาย Chrome ออฟไลน์ของ Google เอกสาร Offline </a> . ตรวจสอบให้แน่ใจว่าคุณไม่ได้ท่องเว็บในโหมดส่วนตัว </p> <p> ฟีเจอร์นี้จะต้องนำมาใช้เมื่อคุณออนไลน์ แต่เมื่อเสร็จแล้ว คุณสามารถเขียนและแก้ไขข้อความแบบออฟไลน์ จากนั้นข้อความเหล่านั้นจะถูกบันทึกไว้ในระบบคลาวด์เมื่อคุณเข้าถึงอินเทอร์เน็ตได้ นี่คือวิธีการ </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> เพื่อให้เป็นไปได้ <strong> เปิดและบันทึกไฟล์ Google เอกสารแบบออฟไลน์ </strong> , ติดตาม <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> คำแนะนำเหล่านี้ </a> . ฟีเจอร์นี้พร้อมใช้งานบนพีซี, iOS และ Android </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. ติดตาม/กู้คืนประวัติเวอร์ชันเอกสาร </h2> <p> หากคุณกำลังทำงานกับเอกสารคนเดียวหรือกับผู้อื่น คุณสามารถติดตามการเปลี่ยนแปลงในเอกสารได้โดยใช้คุณสมบัติประวัติเวอร์ชัน </p> <p> คุณยังสามารถกู้คืนเอกสารเป็นเวอร์ชันก่อนหน้าชั่วคราวหรือถาวรได้ คุณลักษณะที่สามารถช่วยชีวิตได้หากคุณลบบางส่วนของเอกสารโดยไม่ได้ตั้งใจและไม่สามารถใช้ .ได้ <strong> เลิกทำ </strong> ปุ่มเพื่อกู้คืน </p> <p> หากต้องการใช้คุณสมบัติประวัติเวอร์ชัน ให้คลิก <strong> ไฟล์ </strong> จากแถบเมนู แล้วเลือก <strong> ประวัติเวอร์ชัน </strong> จากเมนูแบบเลื่อนลง คุณจะเห็นว่าคุณสามารถตั้งชื่อเวอร์ชันได้ด้วย ดังนั้นคุณสามารถใช้สิ่งนั้นเพื่อติดตามการเปลี่ยนแปลงอย่างต่อเนื่องในเอกสาร โดยเฉพาะอย่างยิ่งถ้าผู้ใช้รายอื่นกำลังแก้ไขเอกสารเดียวกัน </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> คุณลักษณะนี้มีเฉพาะบนเดสก์ท็อปเท่านั้น </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. แนะนำและทบทวนโหมด </h2> <p> แม้ว่าจะเป็นการดีที่จะทำงานร่วมกับผู้อื่นและแก้ไขเอกสารร่วมกัน แต่การติดตามการเปลี่ยนแปลงที่แต่ละคนทำขึ้น (และยุ่งเหยิง) อาจเป็นเรื่องยาก (และยุ่งเหยิง) </p> <p> ฟีเจอร์ Suggesting ช่วยให้คุณแนะนำการแก้ไขได้ง่ายๆ หากคุณไม่ต้องการแก้ไขเอกสารทั้งหมด คำแนะนำของคุณจะปรากฏขึ้นที่ตัวแก้ไขเป็นความคิดเห็นบนแถบด้านข้าง และตัวแก้ไขสามารถเปลี่ยนแปลงได้ทันทีโดยยอมรับคำแนะนำ คุณยังสามารถดำเนินกระทู้สนทนาด้วย <strong> ตอบ </strong> เพื่อให้คุณสามารถให้และรับคำติชมได้ทันทีบนหน้าเอกสารโดยไม่ต้องส่งอีเมลไปมา </p> <p> หากต้องการแนะนำการแก้ไข ให้คลิกไอคอนดินสอสำหรับโหมดแก้ไขที่มุมบนขวาของเอกสารที่เปิดอยู่ จากนั้นเลือก <strong> แนะนำ </strong> . </p> <p> หากต้องการดูเอกสารโดยไม่มีคำแนะนำ ให้คลิก <strong> กำลังดู </strong> . คุณจะสามารถอ่านได้โดยไม่ต้องขีดทับและป๊อปอัปความคิดเห็น </p> <p> เพื่อประหยัดเวลา คุณสามารถยอมรับหรือปฏิเสธคำแนะนำทั้งหมดได้ในคราวเดียว คลิก <strong> เครื่องมือ </strong> จากนั้นเลือก <strong> ตรวจสอบการแก้ไขที่แนะนำ </strong> . คลิก <strong> รับทั้งหมด </strong> หรือ <strong> ปฏิเสธทั้งหมด </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> คุณลักษณะนี้มีเฉพาะบนเดสก์ท็อปเท่านั้น </p> <p> </p> <h2 id=\"add-fonts\"> 5. เพิ่มแบบอักษร </h2> <p> หากคุณเคยต้องการที่จะ <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> จัดสไตล์ข้อความของคุณ </a> เพื่อให้เหมาะกับข้อความของคุณ คุณสามารถทำได้ด้วย Google เอกสารเช่นกัน นอกเหนือจากแบบอักษรเริ่มต้น 24 แบบซึ่งตั้งโปรแกรมไว้ในเครื่องมือ Google เอกสารแล้ว คุณสามารถเพิ่มแบบอักษรเจ๋งๆ หลายแบบที่คุณเลือกเพื่อเพิ่มความคมชัดให้กับข้อความ </p> <p> หากต้องการเพิ่มแบบอักษร ให้คลิกที่ <strong> แบบอักษร </strong> บนแถบเมนูแล้วเลือก <strong> แบบอักษรเพิ่มเติม </strong> . เลือกแบบอักษรได้มากเท่าที่คุณต้องการจากคอลเล็กชันที่มีให้ </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> คุณลักษณะนี้มีเฉพาะบนเดสก์ท็อปเท่านั้น </p> <p> </p> <h2 id=\"compare-documents\"> 6. เปรียบเทียบเอกสาร </h2> <p> นี่เป็นอีกหนึ่งฟีเจอร์ที่คุณสามารถใช้เพื่อติดตามการเปลี่ยนแปลงที่ทำกับเอกสารได้ด้วยตัวเองหรือจากผู้ทำงานร่วมกัน มีประโยชน์อย่างยิ่งสำหรับเอกสารขนาดใหญ่ และตามชื่อที่แนะนำ คุณสามารถเปรียบเทียบเอกสารสองฉบับเพื่อดูความแตกต่างระหว่างเอกสารทั้งสองได้ </p> <p> ในการใช้คุณสมบัตินี้ ให้เปิดเอกสารพื้นฐานที่คุณต้องการเปรียบเทียบ จากนั้นคลิกที่ <strong> เครื่องมือ </strong> และเลือก <strong> เปรียบเทียบเอกสาร </strong> . </p> <p> ในกล่องโต้ตอบที่ปรากฏขึ้น ให้เลือกเอกสารที่คุณต้องการเปรียบเทียบจากไดรฟ์ของคุณ แล้วคลิก <strong> เปรียบเทียบ </strong> . ใน <strong> ความแตกต่างของแอตทริบิวต์ถึง </strong> ให้ป้อนชื่อผู้ทำงานร่วมกันที่จะเป็นผู้เขียนการแก้ไขที่แนะนำในเอกสารขั้นสุดท้าย </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> ความแตกต่างจะแสดงในลักษณะเดียวกับที่ทำใน <strong> แนะนำ </strong> โหมดที่เรากล่าวถึงข้างต้น และคุณสามารถยอมรับหรือปฏิเสธการแก้ไขได้เช่นกัน </p> <p> คุณลักษณะนี้มีเฉพาะบนเดสก์ท็อปเท่านั้น </p> <p> </p> <h2 id=\"find-and-replace\"> 7. ค้นหาและแทนที่ </h2> <p> หากคุณต้องการแทนที่ข้อผิดพลาดหลายรายการในข้อความของคุณ Google เอกสารจะทำให้การแทนที่เป็นเรื่องง่ายด้วยคุณลักษณะค้นหาและแทนที่ </p> <p> สำหรับผู้ใช้ที่คุ้นเคยกับคุณลักษณะค้นหาและแทนที่ใน Microsoft Word การทำงานนี้จะเหมือนกัน </p> <p> หากต้องการค้นหาคำหรือวลีเฉพาะในเอกสาร ให้ใช้ทางลัด <strong> Ctrl + F </strong> บนพีซี Windows หรือ <strong> คำสั่ง + F </strong> บนเครื่อง Mac ป้อนคำในช่อง &quot;ค้นหาในเอกสาร&quot; </p> <p> หากต้องการแทนที่ข้อความที่พบ ให้คลิกที่จุดสามจุดทางด้านขวาแล้วเลือก <strong> ค้นหาและแทนที่ </strong> . </p> <p> จากนั้นป้อนข้อความใน <strong> หา </strong> ฟิลด์และข้อความแทนที่ใน <strong> แทนที่ด้วย </strong> สนาม เลื่อนดูอินสแตนซ์ข้อความด้วยเคอร์เซอร์ขึ้นและลง แล้วคลิก <strong> แทนที่ </strong> เพื่อสลับเป็นรายบุคคล หรือ คลิก <strong> แทนที่ทั้งหมด </strong> เพื่อแทนที่ข้อความที่เลือกทั้งหมดพร้อมกัน </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. ใช้พจนานุกรม </h2> <p> เพื่อช่วยให้คุณมีสมาธิและไม่ต้องสลับไปมาระหว่างแท็บต่างๆ เมื่อคุณกำลังมองหาความหมายของคำ Google เอกสารมีพจนานุกรมในแอป </p> <p> เมื่อคุณพิมพ์และความจำเป็นที่จะต้องมองถึงคำที่เน้นคำว่ากำลังจากนั้นคลิกขวาและเลือก <strong> กำหนด </strong> จากเมนู เครื่องมือพจนานุกรมจะค้นหาคำจำกัดความของคำบนอินเทอร์เน็ต และคำนั้นจะปรากฏที่ด้านขวาของหน้าจอ </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. เพิ่มสำเนียงภาษา </h2> <p> บอกลาการท่องจำแป้นพิมพ์ลัดแบบเน้นเสียง หรือคัดลอก/วางตัวอักษรเน้นเสียงจากเอกสารอื่นๆ </p> <p> หากต้องการใช้ตัวอักษรเน้นเสียง คุณจะต้องดาวน์โหลด <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> โปรแกรมเสริม “Easy Accents” </a> . ช่วยให้คุณสามารถแทรกเครื่องหมายเน้นเสียงสำหรับ 20 ภาษาที่แตกต่างกันได้โดยตรงจากแถบด้านข้างในเอกสารของคุณ </p> <p> ดาวน์โหลดโปรแกรมเสริมของ Google Doc โดยเปิด <strong> เครื่องมือ </strong> เมนูจากนั้นคลิกที่ <strong> ส่วนเสริม </strong> และ <strong> รับส่วนเสริม </strong> . ในช่อง Google Marketplace ที่ปรากฏขึ้น ให้ค้นหา <strong> สำเนียงง่าย </strong> และคลิกที่ปุ่มติดตั้งสีน้ำเงินเพื่อเพิ่มลงในคอลเล็กชันโปรแกรมเสริมของ Google Docs </p> <p> หลังจากติดตั้งให้คลิกที่ on <strong> ส่วนเสริม </strong> เมนูเพื่อเลือกส่วนเสริม Easy Accents และเริ่มเพิ่มสำเนียงที่ถูกต้องสำหรับคำต่างประเทศทั้งหมดของคุณ </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> ส่วนเสริมนี้ใช้ได้เฉพาะบนเดสก์ท็อป แต่โดยทั่วไปแล้ว แป้นพิมพ์สำหรับอุปกรณ์พกพาจะรองรับการเน้นเสียง ดังนั้นคุณจึงสามารถเขียนข้อความที่มีเครื่องหมายเน้นเสียงบนโทรศัพท์ของคุณได้โดยไม่ต้องใช้ส่วนเสริม </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. สร้างทางลัดที่กำหนดเอง </h2> <p> คนส่วนใหญ่คุ้นเคย <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> ทางลัด Microsoft Word Word </a> แต่คุณสามารถสร้างทางลัดของคุณเองใน Google เอกสารได้เช่นกัน ในการสร้างทางลัดที่กำหนดเอง ให้คลิกที่ <strong> เครื่องมือ &gt; ค่ากำหนด &gt; การทดแทน </strong> คุณจะพบว่ามีทางลัดเศษส่วนและสัญลักษณ์อยู่สองสามตัวอยู่แล้ว (เช่น การเปลี่ยน 3/4 เป็น ¾) แต่คุณสามารถเพิ่มบางส่วนของคุณเองได้ตามสบาย </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> คุณลักษณะนี้มีเฉพาะบนเดสก์ท็อปเท่านั้น </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> ทำสิ่งต่างๆ ได้มากขึ้นด้วย Google เอกสาร </h2> <p> เมื่อคุณได้เรียนรู้เครื่องมือ Google เอกสารเหล่านี้แล้ว คุณสามารถนำไปใช้ในการสร้างเอกสารต่อไปได้ หวังว่าพวกเขาจะทำสิ่งต่าง ๆ ได้ง่ายขึ้นสำหรับคุณ! </p>"}