{"title":"5 สิ่งที่จะทำให้คุณถูกแบนจาก Facebook อย่างถาวร","content":"<p> Facebook ไม่เป็นที่รู้จักเท่า Twitter ในการลบบัญชี อย่างไรก็ตาม มีการกระทำผิดกฎหมายบางอย่างที่ Facebook ตอบโต้ด้วยมากกว่าแค่ป้ายเตือน </p> <p> ที่นี่ เราสำรวจข้อกำหนดและเงื่อนไขของ Facebook และจุดที่บริษัทกำหนด โดยดูตัวอย่างในอดีตของผู้ใช้ที่ Facebook &quot;เลิกใช้แพลตฟอร์ม&quot; สำหรับพฤติกรรมของพวกเขา </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> จุดยืนของ Facebook เกี่ยวกับการแบนถาวร </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> ไม่เหมือนกับไซต์โซเชียลมีเดียอื่นๆ Facebook ไม่ได้ระบุการกระทำผิดหลายอย่างที่ส่งผลให้มีการแบนถาวร แต่จะอ้างถึงความผิดซ้ำมากกว่าความรุนแรงของความผิดเป็นปัจจัยหลัก ในทางทฤษฎีแล้ว การละเมิด Facebook ที่เกิดขึ้นซ้ำๆ บ่อยครั้งอาจส่งผลให้โปรไฟล์ถูกบล็อกได้ </p> <p> อย่างไรก็ตาม มีกิจกรรมบางอย่างที่ส่งผลให้มีการแบนอย่างสมบูรณ์ และ Facebook ก็มีกิจกรรมที่ผิดกฎหมายบางอย่างที่เป็นที่ยอมรับ ตัวอย่างเช่น ไม่อนุญาตให้ขาย &quot;สินค้าควบคุม&quot; เช่น ปืนและกัญชาบน Marketplace ของ Facebook แต่ Facebook ไม่ได้ระบุว่าเป็นการกระทำผิดกฎหมาย </p> <p> Facebook ชอบที่จะตั้งค่าสถานะหรือลบเนื้อหาแบบโพสต์ต่อโพสต์ แทนที่จะลบโปรไฟล์ อย่างไรก็ตาม มีข้อยกเว้น </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. การใช้เครื่องมือและข้อมูลในทางที่ผิด </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> ข้อกำหนดในการให้บริการของ Facebook กำหนดความผิดที่ต้องห้ามสามประการ อย่างแรกคือชุดของการกระทำ ซึ่งส่วนที่เหลือของบทความนี้จะพิจารณาโดยละเอียดยิ่งขึ้น ข้อที่สองและสามมีความเฉพาะเจาะจงมากกว่าและเกี่ยวข้องกับการใช้เครื่องมือและข้อมูลของ Facebook ในทางที่ผิด </p> <p> ข้อกำหนดในการให้บริการทั่วไปนี้ห้ามมิให้เข้าถึงและใช้งานบางส่วนของไซต์ที่ควรสงวนไว้สำหรับนักพัฒนา นอกจากนี้ยังห้ามมิให้ใช้เครื่องมือเว็บไซต์สาธารณะในลักษณะที่จงใจมุ่งร้าย เช่น การใช้ Facebook เพื่อแพร่ไวรัสและมัลแวร์ </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. ภัยคุกคามต่อความปลอดภัยสาธารณะ </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> หนึ่งในกรณีเดียวที่ Facebook ระบุว่าปิดการใช้งานบัญชีคือ &quot;ความเสี่ยงอย่างแท้จริงต่ออันตรายทางกายภาพหรือภัยคุกคามโดยตรงต่อความปลอดภัยสาธารณะ&quot; Facebook ยังลบโปรไฟล์ที่ &quot;ประกาศภารกิจที่รุนแรงหรือมีส่วนร่วมในความรุนแรง&quot; </p> <p> นี่เป็นเหตุผลในการสั่งห้ามประธานาธิบดีโดนัลด์ ทรัมป์อย่างไม่มีกำหนด หลังจากการจลาจลที่รัฐสภาสหรัฐฯ ในเดือนมกราคม 2564 </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. คบหาสมาคมกับกลุ่มรุนแรง </h2> <p> Facebook แสดงจุดยืนเกี่ยวกับเนื้อหาที่เป็นอันตรายและคุกคามในระดับการเชื่อมโยงในเดือนตุลาคม 2020 เมื่อลบโปรไฟล์ที่เกี่ยวข้องกับการสมรู้ร่วมคิดของ QAnon แม้ว่าแต่ละโปรไฟล์จะไม่มีเนื้อหาที่รุนแรง กลุ่มสมคบคิดนำไปสู่เหตุการณ์ที่รุนแรงตั้งแต่ปี 2559 </p> <p> </p> <p> Facebook ยังแบนกลุ่มดนตรี Trapt สำหรับการโพสต์ที่อ้างถึงกลุ่มเกลียดชัง Proud Boys องค์กรทางการเมืองหัวรุนแรงนี้มีส่วนเกี่ยวข้องกับความรุนแรงระดับท้องถนนในสหรัฐอเมริกาและแคนาดามาตั้งแต่ปี 2559 </p> <p> บริษัทขอสงวนสิทธิ์ในการปิดการใช้งานบัญชีหากบัญชีเหล่านั้นก่อให้เกิดความเสี่ยงทางกฎหมายต่อ Facebook นอกจากนี้ Facebook ยังยืนกรานมากกว่าแพลตฟอร์มโซเชียลมีเดียอื่น ๆ เกี่ยวกับการทำงานร่วมกับหน่วยงานบังคับใช้กฎหมายและการเผยแพร่ประชาสัมพันธ์เมื่อพบเนื้อหาประเภทนี้ </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. การประนีประนอมการรักษาความปลอดภัยของบัญชีอื่น </h2> <p> อีกหนึ่งในการกระทำผิดกฎหมายที่หาได้ยากในรายชื่อ Facebook คือ &quot;การประนีประนอมความปลอดภัยของบัญชีอื่นและบริการของเรา&quot; การประนีประนอมความปลอดภัยของบริการของ Facebook ฟังดูเหมือนมัลแวร์และการใช้ในทางที่ผิดที่กล่าวถึงในข้อกำหนดในการให้บริการ อย่างไรก็ตาม แนวคิดในการประนีประนอมความปลอดภัยของบัญชีอื่นๆ ชี้ไปที่การทำ doxxing </p> <p> </p> <p> Doxxing คือการเปิดเผยข้อมูลที่ละเอียดอ่อนของผู้ใช้โซเชียลมีเดียในโลกจริง ซึ่งอาจรวมถึงที่อยู่บ้านหรือที่ทำงาน หมายเลขโทรศัพท์ส่วนตัว หรือตำแหน่งทางกายภาพแบบเรียลไทม์ การปฏิบัตินี้มักทำขึ้นโดยมีเจตนาที่จะทำร้ายบุคคลนั้น </p> <p> </p> <h2 id=\"misinformation\"> 5. ข้อมูลที่ผิด </h2> <p> </p> <p> แนวทางอย่างเป็นทางการของ Facebook ระบุว่า Facebook ไม่ได้ลบข้อมูลที่ผิด แต่เลือกที่จะติดป้ายกำกับแทนเพื่อให้สามารถมีส่วนร่วมในการสนทนาโดยไม่ทำให้ผู้อื่นเข้าใจผิด อย่างไรก็ตาม เจ้าของบัญชีที่ถูกระงับจำนวนหนึ่งกล่าวว่าการลบของพวกเขาเป็นผลมาจากสิ่งที่ Facebook เรียกว่า &quot;ข่าวเท็จ&quot; </p> <p> มีหลายสาเหตุที่สิ่งนี้เกิดขึ้น ในบางกรณี Facebook พิจารณาว่าข่าวเท็จยังเป็นอันตรายต่อสุขภาพส่วนบุคคลหรือสาธารณะ </p> <p> นี้คือ <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> คำอธิบายของ Facebook สำหรับการลบ David Icke นักทฤษฎีสมคบคิด </a> สำหรับการอ้างว่าอินเทอร์เน็ต 5G ทำให้เกิด Covid-19 Facebook ยังกล่าวอีกว่า Icke ได้ &quot;ละเมิดนโยบายซ้ำแล้วซ้ำเล่า&quot; </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> นโยบาย Facebook และบัญชีของคุณ </h2> <p> โดยส่วนใหญ่แล้ว Facebook จะไม่สร้างปัญหากับคุณ ตราบใดที่คุณไม่ใช้แพลตฟอร์มในทางที่ผิดเพื่อสร้างความเสียหายต่อผู้อื่น อย่างไรก็ตาม มีปัญหาบางอย่างที่บริษัทขีดเส้นไว้ </p> <p> หากคุณไม่ปฏิบัติตามข้อกำหนดในการให้บริการเหล่านี้ คุณควรอยู่อย่างปลอดภัยจากการแบน Facebook อย่างถาวร </p>"}