{"title":"8 วิธีที่โซเชียลมีเดียสามารถช่วยให้คุณเรียนรู้ภาษาใหม่ได้","content":"<p> คุณยังคงฝันร้ายเกี่ยวกับหนังสือเรียนภาษาสเปนและชั้นเรียนภาษาฝรั่งเศสที่คุณได้รับที่โรงเรียนไม่ดีหรือไม่? อย่ากลัวเลย ต้องขอบคุณอินเทอร์เน็ต การเรียนรู้ภาษาใหม่ในปัจจุบันสามารถทั้งสนุกและเข้าถึงได้ </p> <p> โดยเฉพาะอย่างยิ่ง โซเชียลมีเดียได้ช่วยเชื่อมโยงผู้เรียนภาษาหลายล้านคนทั่วโลก ไม่ว่าคุณจะกำลังเรียนรู้บางสิ่งที่เป็นที่นิยม เช่น ภาษาเยอรมัน หรือที่คลุมเครืออย่าง Faroese คุณจะพบแหล่งข้อมูลมากมายที่จะช่วยคุณในการเดินทางของคุณ </p> <p> ต่อไปนี้คือบางวิธีที่คุณสามารถใช้โซเชียลมีเดียเพื่อรับภาษาต่างประเทศครั้งต่อไปของคุณ </p> <h2 id=\"join-facebook-groups\"> 1. เข้าร่วมกลุ่ม Facebook </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> บน Facebook คุณจะพบกลุ่มสำหรับเกือบทุกภาษาเท่าที่จะจินตนาการได้ คุณจะพบชุมชนของชาวต่างชาติที่เพิ่งย้ายใหม่ที่ต้องการพัฒนาทักษะ ตลอดจนกลุ่มสำหรับผู้เรียนทั่วโลก เพื่อให้ได้รับประโยชน์สูงสุดจากประสบการณ์ของคุณ คุณควรเข้าร่วมทั้งสองอย่าง </p> <p> หากต้องการค้นหากลุ่ม Facebook ที่เหมาะสม คุณสามารถค้นหาออนไลน์ได้ง่ายๆ หรือคุณสามารถค้นหาสิ่งที่คุณต้องการได้จากภายใน Facebook ในการดำเนินการนี้ ให้ไปที่ Groups และค้นหาภาษาของคุณ จากนั้นคุณจะได้รับรายชื่อชุมชนที่ตรงกับความต้องการเหล่านี้ </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> หากคุณเรียนที่โรงเรียนสอนภาษาท้องถิ่น คุณสามารถสร้างกลุ่มของคุณเองเพื่อติดต่อกับเพื่อนร่วมชั้นของคุณได้ เพื่อทำสิ่งนี้, <strong> ไปที่ กลุ่ม &gt; สร้างกลุ่มใหม่ </strong> . จากนั้นคุณสามารถแก้ไขการตั้งค่าและเริ่มเชิญสมาชิกได้ </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2. ใช้ประโยชน์จาก Reddit </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit เป็นฟอรัมออนไลน์ยอดนิยมที่เป็นขุมทรัพย์สำหรับผู้เรียนภาษา คุณจะพบ subreddits สำหรับทั้งภาษาเฉพาะและการเรียนรู้ภาษาทั่วไป </p> <p> เมื่อคุณเข้าร่วม subreddit คุณจะค้นพบเคล็ดลับและคำแนะนำที่เป็นประโยชน์มากมายจากผู้เรียนคนอื่นๆ ที่เดินตามเส้นทางของคุณ นอกจากนี้คุณยังจะได้พบกับมส์มากมายที่คุณไม่ต้องสงสัยเลย </p> <p> หากต้องการค้นหา subreddit ให้ไปที่แถบค้นหาที่ด้านบนและพิมพ์ภาษาของคุณ หลังจากโหลดผลลัพธ์แล้ว ก็ควรเข้าร่วมทั้งกลุ่มการเรียนรู้เฉพาะและกลุ่มวัฒนธรรมเพื่อเรียนรู้เพิ่มเติมเกี่ยวกับประเพณีท้องถิ่น </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. เชื่อมต่อกับเจ้าของภาษา </h2> <p> วิธีที่ดีที่สุดในการเรียนรู้ภาษาอย่างรวดเร็วคือการพูดคุยกับคนที่พูดไปแล้ว และโซเชียลมีเดียสามารถเป็นที่ที่ดีในการหาวิทยากรเหล่านี้ คุณอาจต้องเอื้อมมือออกไปสองสามคน แต่ในที่สุด คุณจะพบคนที่เต็มใจที่จะสละเวลาบางส่วนเพื่อช่วยคุณ </p> <p> เมื่อเชื่อมต่อกับเจ้าของภาษาบนโซเชียลมีเดีย ให้เน้นที่การสร้างมิตรภาพก่อน หากคุณอยู่ในเมืองเดียวกับพวกเขา เสนอตัวเพื่อพบพวกเขาและจ่ายค่ากาแฟ สำหรับผู้ที่อยู่ไกลออกไป เสนอเพื่อช่วยให้พวกเขาเรียนรู้ภาษาใดภาษาหนึ่งที่คุณพูดอยู่แล้ว </p> <p> ขั้นตอนเหล่านี้มีความคล้ายคลึงกันในแต่ละแพลตฟอร์มโซเชียลมีเดีย บน Instagram หรือ Twitter ให้ติดตามและส่งข้อความ (หากการตั้งค่าความเป็นส่วนตัวของพวกเขาอนุญาต) คุณสามารถใช้แนวทางที่คล้ายกันบน Facebook แม้ว่าบางคนอาจไม่เต็มใจที่จะยอมรับคำขอเป็นเพื่อนจากผู้ที่พวกเขาไม่รู้จัก </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. สร้างเนื้อหาโซเชียลมีเดียของคุณเอง </h2> <p> คุณไม่เพียงแค่ต้องใช้งานโซเชียลมีเดียเพื่อช่วยให้ตัวเองเรียนรู้ภาษา ลองสร้างโพสต์ของคุณเองด้วย การทำเช่นนี้ไม่เพียงช่วยให้คุณฝึกพูดและเขียนเท่านั้น คุณอาจค้นพบผู้ใช้ใหม่เพื่อฝึกฝนด้วย </p> <p> คุณมีตัวเลือกมากมายในการสร้างเนื้อหา บน Twitter คุณสามารถเข้าร่วมการสนทนาหรือเขียนทวีตในภาษาเป้าหมายของคุณ ด้วย Instagram คุณสามารถเขียนคำบรรยายภาพ สร้างกราฟิก และบันทึกคำพูดของตัวเองได้ </p> <p> เมื่อคุณสร้างเนื้อหาโซเชียลมีเดียของคุณเอง คุณจะได้รับคำติชมจากเจ้าของภาษาด้วย นอกจากนั้น คุณยังสามารถขยายพอร์ตโฟลิโอของคุณและเรียนรู้ทักษะใหม่ ๆ ที่เป็นประโยชน์อีกด้วย </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. ตั้งค่าแอปของคุณเป็นภาษาที่คุณกำลังเรียนรู้ </h2> <p> การเปลี่ยนการตั้งค่าโทรศัพท์เป็นวิธีง่ายๆ ในการทำให้ตัวเองนึกถึงภาษาเป้าหมายและอ่านได้อย่างสบายใจ คุณจะเพิ่มคำศัพท์ใหม่ๆ มากมายให้กับคำศัพท์ของคุณ </p> <p> </p> <p> เครือข่ายโซเชียลมีเดียขนาดใหญ่ทั้งหมดมีการตั้งค่าในแอปซึ่งคุณสามารถเปลี่ยนภาษาของคุณได้ ตัวอย่างเช่น บน Instagram ให้ไปที่ <strong> บัญชี &gt; ภาษา </strong> . จากนั้นคุณจะเห็นเมนูแบบเลื่อนลงของภาษาทั้งหมดที่คุณสามารถใช้ได้ </p> <p> <strong class=\"gallery__section-title\"> แกลเลอรี่ภาพ (2 รูปภาพ) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> ขยาย <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> ขยาย </p> <p> ปิด </p> <p> คุณยังสามารถเปลี่ยนภาษาของแอปทั้งหมดได้พร้อมกันโดยใช้การตั้งค่าโทรศัพท์ของคุณ ไปที่ <strong> การตั้งค่า </strong> &gt; <strong> ทั่วไป &gt; ภาษาและภูมิภาค </strong> . จากตรงนั้น คุณจะเห็นรายการภาษาทั้งหมดที่มี โปรดทราบว่าสำหรับภาษาที่เล็กกว่า คุณอาจไม่สามารถเพิ่มประสิทธิภาพบัญชีของคุณได้ </p> <p> <strong class=\"gallery__section-title\"> แกลเลอรี่ภาพ (2 รูปภาพ) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> ขยาย <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> ขยาย </p> <p> ปิด </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. ใช้แฮชแท็กให้เกิดประโยชน์สูงสุด </h2> <p> การใช้และค้นหาด้วยแฮชแท็กเป็นวิธีที่มีประสิทธิภาพในการค้นหาผู้ใช้ในภาษาที่คุณกำลังเรียนรู้มากขึ้น ด้วยการใช้ความหลากหลาย คุณสามารถเชื่อมต่อและใช้เนื้อหาของทั้งเจ้าของภาษาและผู้เรียนคนอื่นๆ </p> <p> หากต้องการค้นหาประเภทเนื้อหาที่ต้องการ ให้นึกถึงสิ่งที่ผู้เรียนคนอื่นๆ จะใช้ คุณยังค้นหาเนื้อหาของเจ้าของภาษาได้ด้วยการค้นหาหัวข้อที่มีอยู่ในประเทศใดๆ บ่อยครั้ง คุณสามารถค้นหาสิ่งเหล่านี้ได้ในโพสต์และบทความที่กำลังเป็นที่นิยม </p> <p> หากต้องการค้นหาแฮชแท็ก ให้ใช้ฟังก์ชันการค้นหาบนแอปโซเชียลมีเดียที่คุณใช้ คุณยังสามารถคลิกโพสต์ที่ใช้โพสต์เหล่านั้นและค้นหาผลลัพธ์ที่ได้ทั้งหมด </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. ติดตามบัญชีในภาษาเป้าหมายของคุณ </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> บัญชีที่น่าสนใจทุกบัญชีที่คุณติดตามเป็นภาษาอังกฤษมักจะมีภาษาเป้าหมายที่เทียบเท่ากัน สิ่งเหล่านี้อาจเป็นสิ่งพิมพ์ขนาดใหญ่ หรืออาจเป็นผู้พูดในชีวิตประจำวันที่สบายใจในการสร้างงานในภาษาของตนเอง </p> <p> </p> <p> นอกจากนี้ คุณควรดูว่านิตยสาร ทีมกีฬา และศิลปินเพลงที่คุณชื่นชอบมีบัญชีในภาษาเป้าหมายของคุณหรือไม่ ตัวอย่างเช่น สโมสรกีฬาที่ใหญ่ที่สุดในโลกหลายแห่ง มีบัญชีเป็นภาษาอังกฤษ สเปน และอื่นๆ </p> <p> เมื่อติดตามบัญชีในภาษาที่คุณต้องการเรียนรู้ หลักการทั่วไปที่ดีคือให้ปฏิบัติตามหากคุณพบว่าเนื้อหาภาษาอังกฤษของพวกเขาน่าสนใจพอๆ กัน มิฉะนั้น คุณจะละเลยและเลิกติดตามพวกเขาอีกครั้งในภายหลัง </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. ติดตามแอพเรียนภาษาบนโซเชียลมีเดีย </h2> <p> <strong class=\"gallery__section-title\"> แกลเลอรี่ภาพ (2 รูปภาพ) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> ขยาย <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> ขยาย </p> <p> ปิด </p> <p> แอพเรียนภาษามักจะมีโปรไฟล์โซเชียลมีเดียที่ใช้งานได้เช่นกัน สิ่งเหล่านี้ยอดเยี่ยมสำหรับการรวบรวมเคล็ดลับทั่วไปและเกี่ยวข้องกับการต่อสู้ที่ทุกคนต้องเผชิญ ไม่ว่าพวกเขาจะเรียนภาษานอร์เวย์หรือภาษาญี่ปุ่น </p> <p> บางบัญชีที่น่าติดตามคือ Babbel, Busuu และ Duolingo </p> <p> คุณไม่จำเป็นต้องใช้แอพเหล่านี้เพื่อการบริโภคเท่านั้น รู้สึกอิสระที่จะเพิ่มความคิดของคุณในความคิดเห็น คุณอาจได้รู้จักเพื่อนใหม่แม้ว่าพวกเขาจะเรียนภาษาที่ต่างไปจากคุณ </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> ทำให้การเรียนภาษาเป็นเรื่องสนุกด้วยโซเชียลมีเดีย </h2> <p> ดังนั้นคุณมีมัน ตอนนี้คุณมีไอเดียมากขึ้นในการใช้โซเชียลมีเดียเพื่อช่วยให้การเดินทางเรียนภาษาของคุณสนุก แม้ว่างานหนังสือเรียนจะยังมีความสำคัญ แต่ก็ไม่ควรเป็นทางเลือกเดียวของคุณ </p> <p> แม้ว่าคุณจะปรับแอปให้เหมาะกับภาษาเป้าหมายไม่ได้ แต่คุณก็ยังพบเจ้าของภาษาและเพื่อนที่เรียนรู้ที่จะเชื่อมต่อด้วย </p> <p> กุญแจสำคัญในการเรียนรู้ภาษาด้วยโซเชียลมีเดียคือการมีส่วนร่วมและบริโภค เมื่อคุณทำ คุณจะพบประสบการณ์ที่เติมเต็มและรับคำที่ตำราไม่เคยสอน </p>"}