{"title":"การอัปเดต Microsoft Edge ครั้งใหญ่กำลังมาถึงคุณ","content":"<p> Microsoft กำลังทำงานอย่างหนักเพื่อสร้างอินเทอร์เน็ตเบราว์เซอร์ Edge ให้ดีที่สุดเท่าที่จะเป็นไปได้ ตอนนี้บริษัทกำลังนำเสนอคุณสมบัติที่สำคัญสามประการ และสิ่งต่างๆ ก็ดูสดใสสำหรับอนาคตของ Edge </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> สิ่งที่ Microsoft ได้วางแผนไว้สำหรับ Edge </h2> <p> อัปเดตบัมเปอร์ใหญ่ถูกจับโดย <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows ล่าสุด </a> . คุณสมบัติทั้งสามมีกำหนดจะมาในการอัปเดตครั้งใหญ่ครั้งเดียว ดังนั้นคุณควรจับตาดู Edge ในอนาคตอันใกล้นี้จึงคุ้มค่า </p> <p> ก่อนอื่น Microsoft Edge กำลังได้รับการสนับสนุนวิดเจ็ตเว็บ วิดเจ็ตเหล่านี้เป็นวิธีที่สะดวกในการดูข้อมูลสำคัญอย่างรวดเร็วตลอดทั้งวัน ยักษ์ซอฟต์แวร์ต้องการทดลองกับวิดเจ็ตทุกรูปทรงและขนาด แต่ได้ตัดสินใจที่จะเริ่มต้นด้วยวิดเจ็ตข่าวเพื่อเริ่มต้นสิ่งต่างๆ </p> <p> ถัดไป Microsoft Edge กำลังได้รับคุณลักษณะการค้นหาแท็บ หากฟังดูคุ้นๆ อาจเป็นเพราะคุณได้อ่าน <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> การเก็งกำไรเบื้องต้นของ Edge ได้รับเครื่องมือค้นหาแท็บ </a> . โชคดีที่การเก็งกำไรนี้ได้กลายเป็นจริงแล้ว และ Microsoft วางแผนที่จะนำคุณลักษณะ Chrome มาสู่ Edge </p> <p> สุดท้าย คุณจะสามารถจัดการส่วนขยาย Edge ทั้งหมดได้จากเมนูเดียว มันจะปรากฏเป็นชิ้นส่วนปริศนาบนทาสก์บาร์ของเบราว์เซอร์ของคุณ และเมื่อคุณคลิกมัน จะแสดงให้คุณเห็นทุกส่วนขยายที่คุณได้ติดตั้งพร้อมกับวิธีที่รวดเร็วในการเปิดและปิดการใช้งานส่วนขยายแต่ละรายการ </p> <p> การอัปเดตนี้ไม่แน่ใจว่าจะออกเมื่อใด แต่ Windows ล่าสุดได้ตรึงไว้สำหรับ &quot;การอัปเดตครั้งใหญ่ครั้งต่อไป&quot; ด้วยเหตุนี้ จะใช้เวลาไม่นานนักจนกว่า Microsoft Edge จะเป็นตัวเลือกที่น่าสนใจสำหรับผู้ที่กำลังมองหาสิ่งใหม่ </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: สิ่งที่ยิ่งใหญ่ต่อไป? </h2> <p> เป็นเวลานานมาก เบราว์เซอร์ของ Microsoft ถือเป็นตัวจัดการการดาวน์โหลดขั้นสูงสำหรับการติดตั้ง Chrome หรือ Firefox นับตั้งแต่ที่ Microsoft นำ Chromium codebase มาใช้ในเบราว์เซอร์ อย่างไรก็ตาม มันได้กลายเป็นสิ่งที่น่าหัวเราะของโลกเบราว์เซอร์ </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCounter </a> ระบุว่า Microsoft Edge เป็นเบราว์เซอร์ Windows ที่ใช้มากที่สุดเป็นอันดับสองในสหรัฐอเมริกาในขณะที่เขียน เรารู้แล้วว่า Firefox ถูกทิ้งไว้ในฝุ่นโดย Edge แต่ตั้งแต่นั้นมา ช่องว่างก็กว้างขึ้น </p> <p> ปัจจุบัน Edge มีส่วนแบ่งตลาดในสหรัฐฯ 5.25% เทียบกับ 3.35% ที่ Firefox เป็นเจ้าของ ทั้งสองเป็นหนทางไกลจากร้อยละ 45.83 ของ Chrome แต่เป็นการเริ่มต้น </p> <p> ดังนั้น หากคุณเคยเงยหน้าขึ้นที่เบราว์เซอร์ของ Microsoft ตอนนี้เป็นเวลาที่ดีที่จะให้โอกาสครั้งที่สอง ใครจะไปรู้ คุณอาจถูกเบราว์เซอร์ที่ดีที่สุดของ Microsoft ชนะใจคุณ! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> ผลักเบราว์เซอร์ไปที่ขอบ </h2> <p> หากคุณไม่เคยชื่นชอบเบราว์เซอร์ของ Microsoft มาก่อน เป็นเวลาที่ดีที่จะเข้าร่วมและดูว่าเอะอะเป็นอย่างไร การอัปเดตครั้งใหญ่อยู่ในระหว่างดำเนินการ และจะดีขึ้นจากที่นี่เท่านั้น </p> <p> Microsoft รู้ดีว่ามันอยู่ในสูตรสำเร็จ อันที่จริง บริษัทเพิ่งรายงานว่า 600 ล้านคนทั่วโลกตอนนี้ใช้ Edge ในการท่องเว็บ </p> <p> <small> เครดิตภาพ: DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}