{"title":"BitPay นำ Bitcoin มาสู่ Apple Pay","content":"<p> ผู้ใช้ BitPay ในสหรัฐอเมริกาสามารถเพิ่มบัตร bitcoin แบบเติมเงินไปยังแอพ Wallet ของ Apple และ <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> ใช้เพื่อชำระค่าสินค้าด้วย Apple Pay </a> . ลูกค้าที่ไม่ใช่ของ Apple จะสามารถเพิ่มบัตร BitPay ที่มีตรา MasterCard ลงใน Google Pay และ Samsung Pay ได้ในเร็วๆ นี้ </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> วิธีเพิ่มบัตร BitPay ของคุณไปยัง Apple Wallet </h2> <p> หากต้องการเพิ่มบัตร BitPay ลงในอุปกรณ์ Apple ให้เปิดแอป Wallet บน iPhone แล้วแตะ &quot;+&quot; ที่มุมขวาบน จากนั้นทำตามคำแนะนำบนหน้าจอเพื่อเพิ่มบัตรให้เสร็จสิ้น </p> <p> ด้วย BitPay ในแอป Wallet คุณสามารถเพิ่มบัตรไปยัง Apple Pay ได้โดยไปที่ <strong> การตั้งค่า &gt; กระเป๋าเงินและ Apple Pay </strong> จากนั้นแตะตัวเลือกที่ระบุว่า &quot;เพิ่มการ์ด&quot; หากต้องการเป็นผู้ใช้ BitPay และสั่งซื้อบัตรเติมเงินของคุณ ให้ดาวน์โหลดแอป BitPay Wallet จาก <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> แอพสโตร์ </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> วิธีใหม่ในการใช้จ่ายด้วย Apple Pay </h2> <p> โพสต์เกี่ยวกับ <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> บล็อก BitPay </a> กล่าวว่าการเพิ่มบัตร BitPay ใน Apple Pay เป็นวิธีที่สะดวกในการใช้จ่าย cryptocurrencies &quot;เรามีลูกค้าแอป BitPay Wallet หลายพันรายที่ใช้บัตร BitPay ซึ่งมักจะมองหาสถานที่และวิธีการใหม่ๆ ในการใช้เงินดิจิทัล&quot; Stephen Pair ซีอีโอ BitPay กล่าว <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> ข่าวประชาสัมพันธ์ </a> . </p> <p> </p> <p> ด้วย Apple Pay ผู้ถือบัตร BitPay สามารถซื้อสินค้าแบบไม่ต้องสัมผัสได้อย่างปลอดภัยในร้านค้าจริง แอพที่รองรับ Apple Pay และบนเว็บ บริษัทตั้งข้อสังเกตว่าลูกค้าที่รอการส่งมอบบัตรพลาสติกสามารถเพิ่มคู่เสมือนใน Apple Wallet ผ่านแอป BitPay Wallet อย่างเป็นทางการ การทำเช่นนี้จะช่วยให้คุณเริ่มใช้จ่ายได้ทันที </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> บัตร BitPay คืออะไร? </h2> <p> บัตรเติมเงินที่ใช้เครือข่ายมาสเตอร์การ์ด บัตร BitPay ทำให้การชำระเงินแบบไม่ต้องสัมผัสและการชำระเงินด้วย PIN เป็นเรื่องง่าย รวมถึงการถอนเงินสดจากตู้เอทีเอ็มที่เข้ากันได้ ด้วยแอปนี้ ลูกค้าสามารถทำสิ่งต่างๆ เช่น ดูยอดเงินคงเหลือ ขอ PIN ใหม่ โหลดซ้ำได้ทันที รวมทั้งแปลงสกุลเงินดิจิทัลเป็นสกุลเงินคำสั่ง </p> <blockquote> <p> สำหรับผู้ใช้บล็อคเชนที่ทรงพลัง แอพ BitPay Wallet รองรับตัวเลือกมากมายในการซื้อและจัดเก็บ crypto และชำระเงินออนไลน์ ผู้ใช้สามารถซื้อบัตรของขวัญจากร้านค้าปลีกชั้นนำหลายร้อยแห่งทั้งในร้านค้าและทางออนไลน์ได้ทันที </p> </blockquote> <p> การ์ดมีชิป EMV และสามารถล็อกได้ในกรณีฉุกเฉินด้วยแอป </p> <p> ตามที่บริษัทระบุ รองรับ Google Pay และ Samsung Pay &quot;ในช่วงปลายไตรมาสนี้&quot; สำหรับแอพ BitPay ปัจจุบันรองรับ Bitcoin, Bitcoin Cash และ Ether รวมถึงเหรียญ stablecoin ที่ตรึงกับดอลลาร์สี่สกุล USDC, GUSD, PAX และ BUSD </p>"}