{"title":"อาหารสมองขนาดพอดีคำ: 5 ไซต์เพื่อเรียนรู้สิ่งใหม่ ๆ ในระยะสั้นและสนุก","content":"<p> สารคดียาวไม่ถึงนาที ตอน Podcast เพียง 60 วินาที อินโฟกราฟิกแบบเคลื่อนไหวเพื่ออธิบายเรื่องที่ซับซ้อน ที่นี่คุณสามารถเรียนรู้เพิ่มเติมเกี่ยวกับโลกในแคปซูลความรู้ที่มีส่วนร่วมอย่างรวดเร็ว </p> <p> ในยุคของความสนใจสั้น ๆ และการอัปเดตอักขระ 280 ตัว แม้แต่การเรียนรู้ก็ยังต้องการในปริมาณเล็กน้อย นั่นเป็นเหตุผลที่มีผู้สร้างเนื้อหาที่เชี่ยวชาญในการสร้างชิ้นส่วนที่ให้ข้อมูลและความบันเทิงที่แทบไม่มีเวลาในชีวิตที่วุ่นวาย จากสารคดีขนาดเล็กของผู้คนที่น่าสนใจและหัวข้อต่างๆ ไปจนถึงคู่มือโซเชียลมีเดียเกี่ยวกับหัวข้อที่กำลังเป็นที่นิยม ให้อาหารสมองขนาดพอดีคำแก่สมองของคุณที่จะเคี้ยว </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> เอกสาร 60 วินาที </a> (เว็บ): โปรไฟล์ของบุคคลและหัวข้อที่น่าสนใจใน 60 วินาที </h2> <p> </p> <p> ขอเวลาสักครู่? 60 Second Docs มีเรื่องราวเจ๋งๆ ที่จะบอกคุณเกี่ยวกับบุคคลที่น่าสนใจ และในทางกลับกัน ก็เป็นหัวข้อที่น่าสนใจ สารคดีแต่ละเรื่องมีความยาวเพียง 60 วินาที แต่ครอบคลุมสิ่งที่ดีที่สุดที่คุณต้องรู้เกี่ยวกับหัวข้อนี้ </p> <p> ส่วนที่ยอดเยี่ยมที่สุดคือ 60 Second Docs มุ่งเน้นไปที่โปรไฟล์ของคนจริง แทนที่จะเป็นแนวคิดหรือแนวโน้ม โดยปกติแล้ว บุคคลนั้นกำลังทำอะไรบางอย่างที่ไม่เหมือนใคร ไม่ว่าจะเป็นการเริ่มต้นเทรนด์ใหม่ การสำรวจหัวข้อใหม่ หรือการผลักดันขอบเขตในทางใดทางหนึ่ง การทำให้เนื้อหาเกี่ยวกับบุคคลนั้นไม่เพียงแต่จะทำให้คุณเข้าใจมากขึ้นในแง่มุมของมนุษย์ของตัวแบบที่มีเอกลักษณ์เฉพาะ แต่ยังให้ความรู้สึกที่แท้จริงและมีอารมณ์อีกด้วย </p> <p> เอกสาร 60 วินาทีทั้งหมดมีอยู่ในช่อง YouTube หรือที่จัดการโซเชียลมีเดีย เป็นความคิดที่ดีที่จะติดตามพวกเขาบนโซเชียลเน็ตเวิร์กที่คุณอยู่บ่อยๆ ดูวิดีโอใหม่ทุกรายการอย่างครบถ้วนทุกครั้งที่โพสต์การอัปเดต </p> <p> ถ้าคุณชอบสารคดีที่ยาวกว่านี้ตรวจสอบ <strong> การคัดเลือกอย่างเป็นทางการ </strong> บนเว็บไซต์ 60 Second Docs ที่นี่ กองบรรณาธิการเลือกสารคดี 10-20 นาทีที่คนอื่นถ่ายทำ ในเรื่องที่พวกเขาคิดว่าคุณควรดู </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> คุณต้องการพูดคุยเกี่ยวกับ </a> (Instagram): Mini Guides to Political and Social Topics </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> ใครจะรู้ว่าในโลกของเซลฟี่ผู้มีอิทธิพลและแฮชแท็กที่โปรโมตแบรนด์ Instagram จะเป็นเวทีให้ความรู้ คุณต้องการพูดคุยเกี่ยวกับ (Sywtta) ใช้รูปแบบโพสต์รูปภาพหลายรูปของ Instagram เพื่อสร้างคู่มือขนาดเล็กเกี่ยวกับหัวข้อทางการเมืองและสังคม </p> <p> หัวข้อที่ Sywtta เลือกมักจะเกี่ยวข้องกับหัวข้อที่กำลังเป็นที่นิยม เช่น การยกเลิกเงินกู้นักเรียน สิทธิและประวัติคนดำ การเข้าใจผิดอย่างมีเหตุผล วัคซีน COVID-19 และอื่นๆ แต่ละสไลด์ใช้รูปแบบตัวอักษรที่สวยงามเพื่อให้ความรู้แก่คุณเกี่ยวกับเรื่องนั้น ๆ และยิ่งกว่านั้น ทุกสไลด์ก็เหมือนบทเรียนย่อย คู่มือแต่ละเล่มจะกลายเป็นหลักสูตรความผิดพลาดที่รวดเร็วและให้ข้อมูล โดยไม่ต้องใช้ข้อมูลมากเกินไป </p> <p> ในเวลาที่คุณต้องระมัดระวังเกี่ยวกับ <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> ข่าวลำเอียงหรือข่าวลวง </a> คุณควรสังเกตปรัชญาของสิ่งที่คุณอ่านด้วย เมื่อพูดถึงการเมือง Sywtta เผยแพร่มุมมองของนโยบายที่ก้าวหน้าและฝ่ายซ้าย </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> วิทยาศาสตร์ 60 วินาที </a> (พอดคาสต์): คำอธิบายเสียงสั้น ๆ เกี่ยวกับวิทยาศาสตร์ สุขภาพ และเทคโนโลยี </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> หากคุณต้องการฟังข้อมูลของคุณมากกว่าอ่านหรือดู ให้ลองดูพอดคาสต์วิทยาศาสตร์ 60 วินาที สร้างขึ้นโดยทีมงานที่ Scientific American พอดคาสต์รายวันนี้พูดถึงหัวข้อทางวิทยาศาสตร์ การแพทย์ และเทคโนโลยี และอธิบายหนึ่งหัวข้อโดยสรุปสั้นๆ แม้ว่าจะไม่ได้จำกัดตัวเองไว้ที่การจำกัดเวลานานเป็นนาทีแล้ว แต่แต่ละตอนก็ยังเหลือน้อยกว่าห้านาที </p> <p> พ็อดคาสท์แต่ละรายการมีโฮสต์ที่แตกต่างจากทีม Scientific American ซึ่งครอบคลุมหัวข้อต่างๆ เช่น โควิด สัตว์และนก ดีเอ็นเอและการแพทย์ วิทยาศาสตร์สิ่งแวดล้อม ฯลฯ พวกเขาสนุกกับคุณค่าการผลิตที่สูง ผสมผสานเสียงในโลกแห่งความเป็นจริงเกี่ยวกับประเด็นการสนทนาและมักเพิ่มคลิปเสียง จากผู้เชี่ยวชาญ </p> <p> หากต้องการเรียกดูที่เก็บถาวรของตอนที่ผ่านมา ให้ไปที่เว็บไซต์ทางการของวิทยาศาสตร์ 60 วินาที ที่นี่ คุณสามารถกรองตอนตามหัวข้อ (สุขภาพ จิตใจ ความยั่งยืน เทคโนโลยี วิทยาศาสตร์) หากคุณไม่ต้องการข้อมูลอย่างรวดเร็ว ให้ลองใช้พอดคาสต์ Science Talk ฉบับเต็ม </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Animagraffs </a> (เว็บ): อินโฟกราฟิกภาพเคลื่อนไหวคุณภาพสูงเพื่ออธิบายสิ่งต่างๆ </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> สกุลเงินดิจิทัลทำงานอย่างไร ประกันภัยรถยนต์เข้า-ออกมีอะไรบ้าง? มูนวอล์กทำอย่างไร? นักออกแบบและอนิเมเตอร์ Jacob O&#39;Neal แบ่งหัวข้อที่ซับซ้อนออกเป็นคำอธิบายง่ายๆ และดึงอินโฟกราฟิกแอนิเมชันคุณภาพสูงมาแสดง </p> <p> Animagraffs คือชุดคำอธิบายสั้นๆ ผ่านคำแนะนำด้วยภาพ โดยใช้ GIF แบบเคลื่อนไหว เจคอบใช้เทคนิคการออกแบบที่หลากหลาย เช่น มุมมองภาคตัดขวางเพื่อแสดงทุกส่วนของเครื่องมือ หรือรูปภาพขนาดใหญ่ที่มีส่วนที่เคลื่อนไหว ซึ่งคุณสามารถซูมเข้าและออกได้เหมือน Google แผนที่ แต่ละสไตล์เหมาะสมกับหัวข้อที่คุณกำลังเรียนรู้ </p> <p> ตัวแบบก็มีหลากหลายเช่นกัน เช่น เสือชีตาห์วิ่งอย่างไร รถยนต์ไฟฟ้าทำงานอย่างไร ลำโพงสร้างเสียงอย่างไร เป็นต้น นอกจากนี้ คุณควรตรวจสอบส่วน &quot;งานของลูกค้า&quot; ซึ่ง Jacob นำเสนองานที่ได้รับค่าจ้างสำหรับแบรนด์ต่างๆ ไม่ต้องกังวล แม้ว่าจะเป็นโฆษณา แต่ก็ให้ความรู้และความสนุกสนาน </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> เรื่องใหญ่ที่ยิ่งใหญ่ </a> (YouTube): สารคดีขนาดสั้นที่น่าสนใจและน่าสนใจ </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story ปิดฉากการดำเนินการเมื่อปลายปี 2020 แต่ก่อนจะทิ้งสารคดีสั้นที่น่ายินดีตลอดห้าปี ดำดิ่งลงในเอกสารสำคัญเพื่อค้นหาวิดีโอความยาวประมาณ 5 นาทีเกี่ยวกับหัวข้อที่น่าสนใจและผู้คนที่น่าสนใจจากทั่วโลก </p> <p> ตั้งแต่ภาพยนตร์ที่ฉายในโรงภาพยนตร์ในอินเดียมาเป็นเวลา 24 ปี ไปจนถึงไอศกรีมตุรกีที่น่าทึ่งที่ไม่ละลายน้ำ วิดีโอสั้นแต่ละเรื่องมีคุณภาพสูงและผ่านการค้นคว้ามาอย่างดี ในการเปลี่ยนแปลงจากวิดีโออื่นๆ ส่วนใหญ่ ผู้สร้างวิดีโอของ Great Big Story มักจะเดินทางไปทั่วโลกเพื่อให้ตัวเองอยู่ตรงกลางของเรื่อง จัดเรียงตามความนิยมมากที่สุด หรือใช้เพลย์ลิสต์ที่กำหนดเองต่างๆ ที่ครีเอเตอร์แนะนำ </p> <p> ในช่องนี้ คุณยังจะได้พบกับวิดีโอที่ยาวกว่าซึ่งมีความยาวประมาณ 10 ถึง 15 นาที เหล่านี้มักจะเป็นรายการและการรวบรวมซึ่งรวมถึงคลิปบางส่วนจากวิดีโอที่สั้นกว่า หากคุณมีเวลาที่จะเรียนรู้เพิ่มเติมเกี่ยวกับโลกรอบตัวเรา คุณจะไม่ผิดหวังกับสิ่งเหล่านี้ แม้หลังจากดึงบานประตูหน้าต่างลงแล้ว Great Big Story ก็เป็นหนึ่งในที่สุด <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> ช่องที่น่าสนใจและให้ความรู้บน YouTube </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> ใช้การเรียนรู้แบบหยดเพื่อพิชิตวิชาขนาดใหญ่ </h2> <p> เว็บไซต์และพอดแคสต์เหล่านี้มุ่งเน้นที่การเปลี่ยนหัวข้อใหม่ให้เป็นชุดข้อมูลที่มีขนาดกะทัดรัดและให้ความบันเทิง เป็นวิธีที่ดีในการเรียนรู้สิ่งใหม่ๆ แต่คุณยังสามารถใช้ปรัชญาเดียวกันนี้ในการเรียนรู้เกี่ยวกับวิชาที่ซับซ้อนและใหญ่ขึ้นได้ </p> <p> การเรียนรู้แบบหยดหรือไมโครเลิร์นนิงเป็นวิธีที่นิยมในการศึกษามากขึ้น โดยการรับ <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> บทเรียนขนาดพอดีคำทุกวัน </a> คุณสามารถจัดการกับหัวข้อต่างๆ เช่น การเขียนโปรแกรม การออกแบบ การพัฒนาแอพ การจัดการผลิตภัณฑ์ และอื่นๆ การค้นหาเว็บอย่างรวดเร็วจะช่วยคุณค้นหาเวอร์ชันการเรียนรู้แบบหยดของสิ่งที่คุณกำลังมองหาเพื่อให้ความรู้กับตัวเอง </p>"}