{"title":"คุณจะได้รับ Netflix บน Nintendo Switch ของคุณหรือไม่?","content":"<p> ดูเหมือนว่าคุณจะได้รับ Netflix ในทุกแพลตฟอร์ม ไม่ว่าจะเป็นทีวี เซ็ตท็อปบ็อกซ์ หรือโทรศัพท์ บริการสตรีมมิ่งที่ได้รับความนิยมมากที่สุดในโลกพร้อมให้บริการทุกที่ที่คุณต้องการ หรือว่า? </p> <p> หากคุณเป็นเจ้าของ Nintendo Switch คุณอาจสงสัยว่าคุณสามารถรับชม Netflix ได้หรือไม่ มาหาคำตอบกัน... </p> <h2 id=\"can-you-watch-netflix-on-the-nintendo-switch\"> คุณสามารถรับชม Netflix บน Nintendo Switch ได้หรือไม่? </h2> <p> <a href=\"https://www.makeuseof.com/nintendo-switch-streaming-services/\" target=\"_blank\" rel=\"nofollow noopener\"> Nintendo Switch รองรับบริการสตรีมมิ่งบางอย่าง </a> แต่ Netflix ไม่ใช่หนึ่งในนั้น อย่างน้อยเป็นทางการ </p> <p> นั่นหมายความว่าคุณไม่สามารถเข้าไปที่ eShop และดาวน์โหลดแอป Netflix ได้ ในความเป็นจริง ในขณะที่เขียน บริการสตรีมมิ่งที่ Nintendo Switch นำเสนอผ่าน eShop นั้น จำกัด อยู่ที่ Hulu, YouTube และ Funimation </p> <p> คุณยังใช้เว็บเบราว์เซอร์ของคอนโซลเพื่อดู Netflix ไม่ได้ มันจะไม่ทำงาน </p> <p> อย่างไรก็ตาม คุณสามารถติดตั้ง Android บน Nintendo Switch ได้ และ Netflix ก็พร้อมใช้งานบน Android นี่เป็นกระบวนการที่ซับซ้อนที่ Nintendo ไม่รองรับ การทำเช่นนี้จะทำให้การรับประกันของคุณเป็นโมฆะ และควรทำโดยผู้ใช้ที่เข้าใจกระบวนการและผลที่ตามมาเท่านั้น </p> <p> สำหรับคนส่วนใหญ่ วิธีที่ดีที่สุดคือยังคงหวังว่า Netflix จะสนับสนุน Nintendo Switch อย่างเป็นทางการในอนาคต </p> <p> ในการสัมภาษณ์ปี 2017 กับ <a href=\"https://www.washingtonpost.com/news/the-switch/wp/2017/03/08/nintendos-u-s-ceo-responds-to-our-biggest-gripes-with-the-switch/\" target=\"_blank\" rel=\"nofollow noopener\"> เดอะวอชิงตันโพสต์ </a> Reggie Fils-Aime ประธานาธิบดี Nintendo แห่งอเมริกาในขณะนั้นกล่าวว่า Nintendo กำลังคุยกับ Netflix—แน่นอนว่าเวลาผ่านไปมากแล้วและไม่มีอะไรเกิดขึ้น </p> <p> </p> <h2 id=\"can-you-watch-netflix-on-other-nintendo-consoles\"> คุณสามารถรับชม Netflix บนคอนโซล Nintendo อื่น ๆ ได้หรือไม่? </h2> <p> ทั้ง Nintendo Wii และ Nintendo Wii U มีแอป Netflix เฉพาะในอดีต </p> <p> อย่างไรก็ตาม ตั้งแต่วันที่ 31 ธันวาคม 2020 เป็นต้นไป แอป Netflix จะไม่มีให้ผู้ใช้ใหม่ดาวน์โหลดจาก eShop อีกต่อไป </p> <p> ในวันที่ 30 มิถุนายน 2021 แอป Netflix จะปิดอย่างสมบูรณ์สำหรับผู้ใช้ที่มีอยู่ ณ จุดนั้นไม่มีคอนโซล Nintendo ใดที่จะรองรับ Netflix </p> <p> ในตอนนี้ คุณจะต้องเพลิดเพลินไปกับตัวเลือกการสตรีมวิดีโอแบบจำกัดที่ Switch รองรับและดู Netflix บนอุปกรณ์อื่น </p>"}