{"title":"Canon เปิดตัวแอพ Photo Culling ที่จะค้นหาช็อตที่ดีที่สุดของคุณ","content":"<p> เบื้องหลังภาพถ่ายที่สมบูรณ์แบบเกือบทุกภาพคือม้วนฟิล์มที่เต็มไปด้วยภาพถ่ายอื่นๆ ที่เกือบจะเหมือนกันทุกประการ ไม่ใช่เรื่องแปลกที่ช่างภาพจะกดปุ่มชัตเตอร์ลงเกือบทุกครั้ง โดยกลัวว่าจะพลาดช่วงเวลาชั่วขณะหนึ่ง </p> <p> การดูรูปภาพหลายสิบหรือหลายร้อยภาพเพื่อเลือกรายการโปรดและพื้นที่จัดเก็บที่ชัดเจนอาจเป็นกระบวนการที่ใช้เวลานานและน่ารำคาญ โชคดีที่ Canon ได้เปิดตัวแอพใหม่ที่ทำงานให้คุณโดยอัตโนมัติ </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> ถ่ายม้วนภาพให้เหลือเพียงไม่กี่ภาพได้อย่างง่ายดาย </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon USA </a> ได้เปิดตัวแอพแต่งรูปบน <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> แอพสโตร์ </a> ที่ช่วยให้คุณค้นหาภาพถ่ายที่ดีที่สุดของคุณได้อย่างรวดเร็วและง่ายดาย แอพนี้ฟรี แต่หากต้องการใช้งาน คุณจะต้องสมัครสมาชิก $14.99/ปี หรือ $2.99/เดือน ตัวเลือกการสมัครรับข้อมูลทั้งสองแบบมีการทดลองใช้สามวัน </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> รองประธานบริหาร Canon USA Tatsuro &quot;Tony&quot; Kano อธิบายว่า: </p> <blockquote> <p> ในโลกที่เปลี่ยนแปลงตลอดเวลาและท่วมท้นในปัจจุบัน ซึ่งภาพถ่ายนับพันถูกบันทึกและจัดเก็บไว้ในสมาร์ทโฟนของบุคคล ผู้บริโภคต้องการเครื่องมือภาพถ่ายที่เชี่ยวชาญ เชื่อถือได้ และใช้งานง่าย เพื่อช่วยในการตัดสินใจเลือกภาพถ่ายที่ดีที่สุดโดยอาศัยความรู้และเทคโนโลยีที่ไว้วางใจมานานหลายปี </p> </blockquote> <p> แอปของ Canon ชื่อง่ายๆ ว่า Photo Culling ทำงานบน AI ที่เรียกว่า Photography Intelligence Learning หรือเรียกสั้นๆ ว่า PHIL PHIL แนะนำว่าคุณควรเก็บรูปภาพใดและควรลบรูปภาพใด โดยพิจารณาจากตัวเลือกการเลือกรูปภาพที่คุณเลือก </p> <p> ตัวเลือกแรก, <strong> ทั้ง Culling </strong> , เหมาะสำหรับ <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> ถ่ายพอร์ตเทรตดีกว่า </a> . เมื่อเลือกตัวเลือกนี้ PHIL จะกำหนดภาพถ่ายที่ดีที่สุดของคุณโดยให้คะแนนโดยพิจารณาจากปัจจัยสี่ประการ ได้แก่ ความคมชัด จุดรบกวน อารมณ์ และการหลับตาของตัวแบบ (ถ้ามี) </p> <p> ในขณะเดียวกัน <strong> ที่คล้ายกัน Culling </strong> ตัวเลือกจะเลือกภาพที่ดีที่สุดของคุณโดยการเปรียบเทียบคะแนนระหว่างภาพถ่ายที่คล้ายกัน ตัวอย่างเช่น สมมติว่าคุณถ่ายภาพกลุ่มเมฆ แล้วถ่ายภาพดอกไม้เป็นพวง แอปจะแยกรูปภาพคลาวด์และรูปภาพดอกไม้ออกเป็นกลุ่มต่างๆ </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> ไม่ว่าคุณจะเลือกตัวเลือกใด หากคะแนนของภาพถ่ายสูงกว่าคะแนนเป้าหมายที่ตั้งไว้ ภาพนั้นจะถือเป็นผู้รักษาประตู จากนั้น PHIL จะแนะนำให้ลบรูปภาพที่เหลือซึ่งไม่ได้คะแนนสูงพอ ในกรณีที่คุณไม่เห็นด้วยกับ PHIL ไม่ต้องกังวล คุณยังคงควบคุมทุกช็อตของคุณได้อย่างเต็มที่ </p> <p> </p> <p> ฟีเจอร์อื่นๆ ของแอปประกอบด้วยข้อมูลการแสดงจำนวนรูปภาพและพื้นที่เก็บข้อมูล อัลบั้มรูปภาพ การตั้งค่าพารามิเตอร์สำหรับคะแนนรูปภาพ และตัวเลือกในการใช้โหมดมืด </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> คุณจะดาวน์โหลดแอป Photo Culling ของ Canon หรือไม่ </h2> <p> ดูเหมือนว่าแอปเลือกรูปภาพของ Canon มีทุกอย่างที่จำเป็นเพื่อให้ขั้นตอนการเลือกรูปภาพที่ดีที่สุดของคุณไม่น่าเบื่อ อย่างไรก็ตาม ท้ายที่สุดแล้ว ขึ้นอยู่กับคุณที่จะตัดสินใจว่าคุณเกลียดการเลือกรูปภาพมากพอที่จะพิสูจน์ให้เห็นถึงการจ่ายเงินเพื่อสิ่งที่คุณสามารถทำได้ด้วยตัวเองหรือไม่ (แม้ว่าจะอาจจะช้ามากและทำให้คุณรู้สึกเบื่อ) </p> <p> ในขณะที่เขียน แอพไม่พร้อมใช้งานสำหรับ Android แต่บางที Canon อาจมีสิ่งนั้นอยู่ในการ์ดสำหรับอนาคต </p>"}