{"title":"RPG คอมพิวเตอร์เทียบกับ RPG แบบคลาสสิก: CRPG หมายถึงอะไรในปี 2564","content":"<p> ประวัติของ Computer RPGs นั้นยาวนานเท่ากับประวัติศาสตร์ของวิดีโอเกมเอง พัฒนาและเติบโตไปด้วยกันตลอดหลายปีที่ผ่านมา และในขณะที่ CRPGs พัฒนาขึ้น ปรับปรุงกราฟิก เพิ่มหรือลดกลไกการเล่นเกม ความหมายและคำศัพท์ที่ใช้ในการอธิบายก็เช่นกัน </p> <p> CRPG ย่อมาจาก Computer Role Playing Game ได้ขยายความหมายเมื่อเวลาผ่านไปเพื่อรวม RPG สำหรับแพลตฟอร์มต่างๆ ตอนนี้มันได้นำความหมายใหม่มาใช้ แม้ว่าความหมายใหม่นี้ไม่ได้แตกต่างไปจากความหมายเดิมอย่างสิ้นเชิง แต่ตอนนี้ได้อธิบายถึงประเภทย่อยของ RPG ที่เฉพาะเจาะจงแล้ว </p> <h2 id=\"the-history-of-crpgs\"> ประวัติความเป็นมาของ CRPGs </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> ประวัติของ CRPG เริ่มต้นขึ้นในปี 1970 ด้วยการเปิดตัววิดีโอเกมที่ดัดแปลงจากเกม RPG Dungeons &amp; Dragons บนโต๊ะเกมแรกสุด เดิมเกมนี้มีอยู่ใน Atari (คุณสามารถเล่นได้ผ่าน <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade บริการสตรีมเกมบน Plex </a> ). </p> <p> แม้ว่ารูปแบบการเล่นของ Dungeon จะเน้นไปที่ข้อความเป็นหลัก แต่ก็ได้อธิบายการเคลื่อนไหวของปาร์ตี้ที่มีตัวละครหลายตัวในสภาพแวดล้อมแบบแฟนตาซีโดยสมบูรณ์ ในขณะที่ใช้หลักการพื้นฐานของ Dungeons &amp; Dragons </p> <p> ย้อนกลับไปในตอนนั้น เราเรียกพวกมันว่า Computer RPG เพื่อแยกพวกมันออกจากเกมบนโต๊ะ ซึ่งเป็นที่นิยมมากกว่าในตอนนั้น และเราแค่รู้จักพวกมันว่าเป็นเกม RPG </p> <p> ภายในปี 1990 CRPGs ที่บานเต็มที่ ตอนนี้สามารถแสดงโลกแฟนตาซีได้อย่างเต็มรูปแบบ อย่างน้อยก็ในมุมมองจากบนลงล่าง หรือมุมมองแบบสามมิติ เช่นกรณีของ Ultima VII ซึ่งเป็นหนึ่งใน CRPG แบบโต้ตอบมากที่สุดที่นักเขียนคนนี้เคยเล่น </p> <p> เกือบทุกอย่างที่คุณเห็นคุณสามารถเคลื่อนไหวหรือโต้ตอบด้วย: คุณสามารถสร้างอาวุธ เล่นเครื่องดนตรี และแม้กระทั่งนำสมาชิกในปาร์ตี้ที่เสียชีวิตของคุณออกจากคุกใต้ดินไปจนถึงห้องบัลลังก์ของกษัตริย์เพื่อให้พวกเขาฟื้นคืนชีพ </p> <p> Baldur&#39;s Gate เป็นหนึ่งในเกมที่เลียนแบบประสบการณ์ RPG บนโต๊ะได้อย่างใกล้ชิดที่สุด ได้ดัดแปลงชุดกฎของ Dungeons &amp; Dragons 2nd Edition (AKA Advanced Dungeons &amp; Dragons) ให้เป็นภาพสามมิติ <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> CRPG . หยุดชั่วคราวแบบเรียลไทม์ </a> . CRPG ประเภทนี้เน้นกลยุทธ์ในการต่อสู้ ความก้าวหน้าของตัวละคร การตัดสินใจ และการสำรวจที่ได้รับการสนับสนุน </p> <p> </p> <p> ทุกวันนี้ ในโลกที่คอนโซลครองตลาด วิดีโอเกมเล่นตามบทบาทได้รับความนิยมมากกว่าเกม RPG บนโต๊ะ ในการใช้งานในปัจจุบัน RPG ย่อหมายถึงเวอร์ชันวิดีโอเกม คุณจะเรียก Dungeon&#39;s &amp; Dragons ว่าเป็นเกม RPG บนโต๊ะ ไม่ใช่แค่ RPG </p> <p> ด้วยวิวัฒนาการของกราฟิก กลไกการเล่นเกม CRPG ที่ปรับให้เข้ากับมาตรฐานกราฟิกสมัยใหม่ ซีรีส์ CRPGs เช่น The Elder Scrolls, Gothic หรือ The Witcher ปฏิวัติแนวนี้ โดยแนะนำกลไกการเล่นเกมใหม่ในขณะที่ปล่อยเกมอื่นๆ </p> <p> RPG เหล่านี้มีแนวแอ็กชันและรวดเร็วมากกว่า โดยวางตัวเองอยู่ในประเภทย่อยของแฮ็คและสแลช (แต่ยังคงเป็น RPG ที่แข็งแกร่งอยู่!) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> คลื่นลูกใหม่ของ CRPGs </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> ทว่าการต่อต้านแนวโน้มในอุตสาหกรรมวิดีโอเกมในปัจจุบันที่มุ่งไปสู่ความสมจริงของกราฟิก จึงเป็นคลื่นลูกใหม่ของ CRPG เกม RPG แบบเก่าหรือคลาสสิกมีอิทธิพลอย่างมากต่อเกมเหล่านี้ และเน้นที่กลไกการเล่นเกมและการดื่มด่ำ มากกว่าภาพ </p> <p> โดยทั่วไปแล้วเป็นเกมที่มีมิติเท่ากันโดยมีการต่อสู้ทางยุทธวิธีแบบหยุดชั่วคราวแบบเรียลไทม์หรือแบบผลัดกันเล่น CRPG เหล่านี้พยายามอย่างเต็มที่เพื่อให้ดื่มด่ำที่สุดเท่าที่จะเป็นไปได้ โดยมอบบทร้อยแก้วที่สร้างขึ้นมาอย่างดีและเรื่องราวเบื้องหลังที่แข็งแกร่งให้กับคุณ </p> <p> ส่วนใหญ่ใช้ข้อความมากกว่าการแสดงด้วยเสียงสำหรับบทสนทนาส่วนใหญ่ เช่นเดียวกับ CRPG ของโรงเรียนเก่า CRPG เหล่านี้บางส่วน ได้แก่ Pillars of Eternity, Divinity: Original Sin หรือ Pathfinder: Kingmaker </p> <p> เกมเหล่านี้ยังเน้นกลยุทธ์การต่อสู้ ความก้าวหน้าของตัวละคร การตัดสินใจ และส่งเสริมการสำรวจ เช่นเดียวกับ CRPG ในโรงเรียนเก่า ด้วยเหตุผลเหล่านี้ เราถือว่าสิ่งเหล่านี้มีความเกี่ยวข้องอย่างใกล้ชิดกับเกม RPG คลาสสิกมากกว่าเกม RPG สมัยใหม่ส่วนใหญ่ </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> CRPG หมายถึงอะไรในปี 2564 </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> ตั้งแต่ยุค 2000 RPG ได้กลายเป็นคำมาตรฐานเมื่อพูดถึงวิดีโอเกมสวมบทบาท แต่ราวๆ ปี 2015 พวกเขาได้เปิดตัว Divinity: Original Sin and Pillars of Eternity </p> <p> RPG เหล่านี้แตกต่างจากเกมแนวแอ็กชัน RPG สมัยใหม่ ในขณะที่มีความคล้ายคลึงกับชื่อที่เก่ากว่ามากทั้งในด้านสุนทรียศาสตร์และกลไกการเล่นเกม ในช่วงเวลานี้จำเป็นต้องมีคำศัพท์ใหม่เพื่อทำให้เกม RPG เหล่านี้แตกต่างจากเกม RPG สมัยใหม่ </p> <p> แม้ว่าผู้คนจะใช้คำว่า &quot;โรงเรียนเก่า&quot; และ &quot;เกม RPG คลาสสิก&quot; ในโลกออนไลน์มาหลายปีแล้วเพื่ออธิบายเกมเหล่านี้ แต่เกมหลังกลับเป็นสิ่งที่ติดอยู่ เช่นเดียวกับวิดีโอเกมเล่นตามบทบาทที่ทันสมัยอ้างว่า RPG ตัวย่อสำหรับตัวเอง ผู้คนเรียก RPG แบบเก่าว่า &quot;CRPG&quot; ในตอนนี้ </p>"}