{"title":"ตรวจสอบเวอร์ชันเบราว์เซอร์ของ xCloud . ของ Microsoft","content":"<p> หากคุณตั้งตารอข่าวสารบนพอร์ตเบราว์เซอร์ xCloud อย่างใจจดใจจ่อ วันนี้เป็นวันโชคดีของคุณ เพราะคุณสามารถมองดูว่ามันเป็นอย่างไร </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> ผู้ทดสอบเปิดเผยภาพหน้าจอเบราว์เซอร์ xCloud </h2> <p> ขณะนี้ xCloud มีให้บริการในอุปกรณ์หลายประเภท แต่เรายังคงรอให้ Microsoft เปิดตัวเบราว์เซอร์เวอร์ชันอย่างเป็นทางการ </p> <p> รายละเอียดค่อนข้างน้อย...จนถึงตอนนี้ ตามรายงานของ <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> The Verge </a> &quot;แหล่งข้อมูลที่คุ้นเคยกับแผน Xbox ของ Microsoft&quot; อ้างว่า &quot;ขณะนี้พนักงานกำลังทดสอบ xCloud เวอร์ชันเว็บก่อนการแสดงตัวอย่างสาธารณะ&quot; </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> มาดูครั้งแรกที่ xCloud สำหรับเว็บของ Microsoft <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> – The Verge (@verge) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> 15 กุมภาพันธ์ 2564 </a></blockquote>  <p> อย่าลืมว่านี่เป็นเพียงรูปภาพจากผู้ทดสอบเท่านั้น ซึ่งหมายความว่า Microsoft สามารถเปลี่ยนรูปลักษณ์ของเวอร์ชันเบราว์เซอร์ xCloud ได้ทั้งหมด แม้ว่าไม่น่าจะเป็นไปได้ </p> <p> จากภาพหน้าจอ ดูเหมือนว่า xCloud ได้รับการตั้งค่าเหมือนกับเวอร์ชัน Android ซึ่งมีอยู่ในสมาร์ทโฟนและแท็บเล็ต </p> <p> คุณสามารถดูเกมที่เพิ่มล่าสุดได้ที่ด้านบนของภาพหน้าจอ ตามด้วยส่วน &quot;เร็วๆ นี้&quot; ด้านล่างนี้ คุณมีตัวเลือกมากมายในการเลือกประเภทเกมที่คุณเลือก โดยมีไลบรารีเกม xCloud เต็มรูปแบบอยู่ที่ด้านล่างของหน้า </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> คุณเข้าถึง xCloud ในเบราว์เซอร์ของคุณได้อย่างไร? </h2> <p> ปัจจุบันคุณไม่สามารถ เว็บพอร์ตของ xCloud เวอร์ชันสาธารณะยังไม่พร้อมใช้งาน ซึ่งหมายความว่าคุณต้องรออีกสักหน่อยหากต้องการเข้าถึง xCloud ผ่านเบราว์เซอร์ของคุณ ถูกกล่าวหาว่า Microsoft มีแผนที่จะเปิดเผยบริการต่อสาธารณะในไตรมาสที่สองของปี 2564 </p> <p> ก่อนหน้านั้น คุณจะต้องหาวิธีอื่นในการเข้าถึง xCloud ปัจจุบันคุณเข้าถึงได้เฉพาะบริการเกมบนคลาวด์บนอุปกรณ์ Android เท่านั้น (คุณต้องใช้เวอร์ชันเบราว์เซอร์เพื่อเล่นบน iOS ต้องขอบคุณ <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> ความขัดแย้งระหว่าง Apple และ Microsoft </a> ). </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> คุณสามารถเข้าถึงเกม xCloud ด้วยวิธีอื่นได้หรือไม่? </h2> <p> ใช่และไม่ใช่ คุณไม่สามารถเข้าถึงชื่อใด ๆ บน xCloud ได้ ไม่เว้นแต่คุณจะใช้อุปกรณ์ Android และแอป Game Pass อย่างเป็นทางการในการดำเนินการดังกล่าว </p> <p> อย่างไรก็ตาม เกมต่างๆ ที่มีอยู่ในบริการเกมบนคลาวด์ของ Microsoft นั้นมีอยู่ใน Game Pass ที่จริงแล้ว คุณสามารถเข้าถึง xCloud โดยเป็นส่วนหนึ่งของการสมัครสมาชิก Game Pass Ultimate ดังนั้นคุณจึงยังสามารถเข้าถึงเกมเหล่านั้นผ่าน Xbox หรือพีซีที่ใช้ Windows ได้ </p> <p> ดังนั้นในคำหนึ่งใช่ คุณสามารถเข้าถึงเกมเหล่านั้นได้อีกทางหนึ่ง แค่ไม่ได้ใช้ xCloud เว้นแต่คุณจะสามารถเข้าถึงเวอร์ชัน Android ได้ </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud: เร็วๆ นี้บนอุปกรณ์ iOS ใกล้ตัวคุณ </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> คุณไม่ควรรอนานจนกว่าคุณจะได้รับแพลตฟอร์มเกมบนคลาวด์ของ Microsoft เมื่อ xCloud ผ่านการทดสอบแล้ว Microsoft จะทำการเปลี่ยนแปลงที่จำเป็นก่อนที่จะให้พวกเราทุกคนได้ดูและหวังว่าจะไม่นานหลังจากนั้นก็เล่นด้วย </p>"}