{"title":"DeviantArt เพิ่มแถบด้านข้างและกลุ่มในแอพมือถือ","content":"<p> ศิลปินทัศนศิลป์ทุกคนมีกระบวนการสร้างสรรค์ที่เป็นเอกลักษณ์ของตัวเอง แต่เป็นเรื่องปกติ โดยเฉพาะอย่างยิ่งในยุคดิจิทัลในปัจจุบัน ที่ขั้นตอนสุดท้ายในกระบวนการนั้นคือการแบ่งปันผลงานที่เสร็จแล้วของคุณทางออนไลน์ </p> <p> ไปเป็นวันที่คุณต้องหาพิพิธภัณฑ์ที่จะนำภาพวาดหรือภาพถ่ายของคุณไปให้ผู้คนได้ดู ให้เลือกแพลตฟอร์มที่คุณสนใจมากที่สุดและโพสต์ออกไปแทน! </p> <p> DeviantArt ก่อตั้งขึ้นในปี 2000 เป็นหนึ่งในชุมชนศิลปะที่เก่าแก่ที่สุดบนอินเทอร์เน็ต DeviantArt เปิดตัวแอพมือถือในปี 2560 และอัปเดตล่าสุดมีขนาดเล็กแต่มีความสำคัญ </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt สำหรับมือถือปรับปรุงการนำทาง </h2> <p> DeviantArt ได้ปรับปรุงส่วนต่อประสานผู้ใช้ของแอพมือถือ โดยเพิ่มแถบด้านข้างที่คล้ายกับที่แสดงบนเว็บไซต์ DeviantArt แถบด้านข้างช่วยให้คุณเข้าถึงหน้าแรก เบี่ยงเบน (ศิลปิน) ที่คุณติดตาม และกลุ่มได้อย่างรวดเร็ว </p> <p> <strong class=\"gallery__section-title\"> แกลเลอรี่ภาพ (2 รูปภาพ) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> ขยาย <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> ขยาย </p> <p> ปิด </p> <p> การเข้าถึงรายการสุดท้ายในรายการนั้นมีความโดดเด่นเป็นพิเศษ เนื่องจากก่อนหน้าการอัปเดตนี้ กลุ่ม DeviantArt จะพร้อมใช้งานบนเว็บไซต์เท่านั้น กลุ่ม DeviantArt ทำงานคล้ายกับ <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> กลุ่มเฟสบุ๊ค </a> —กลุ่มผู้ใช้ที่รวมตัวกันบนแพลตฟอร์มที่มีความสนใจหรือเป้าหมายร่วมกัน </p> <p> บนแถบด้านข้าง คุณสามารถแตะ <strong> กลุ่มของฉัน </strong> เพื่อดูกลุ่มทั้งหมดที่คุณเป็นส่วนหนึ่งหรือ <strong> กลุ่มที่แนะนำ </strong> เพื่อดูกลุ่มที่ DeviantArt เชื่อว่าจะเหมาะกับคุณ คุณยังสามารถตรึงกลุ่มโปรดไว้ที่ด้านบนสุดของแถบด้านข้างเพื่อให้เข้าถึงได้ง่ายขึ้น </p> <p> หากคุณจัดกลุ่มของคุณเอง กลุ่มอาจปรากฏในหัวข้อแนะนำสำหรับผู้เบี่ยงเบนความสนใจอื่นๆ ที่อาจสนใจเข้าร่วม หากไม่สนใจกลุ่ม คุณสามารถแตะจุดสามจุดทางด้านขวาของชื่อกลุ่มเพื่อนำคำแนะนำออก </p> <p> เมื่อคุณเยี่ยมชมกลุ่มในแอป คุณจะเห็นทั้งความเบี่ยงเบน (การส่ง) และโพสต์ ผู้ดูแลระบบกลุ่มสามารถเผยแพร่การอัปเดตไปยังกลุ่มของตนได้จากฟีดโพสต์ </p> <p> <strong> ดาวน์โหลด: </strong> DeviantArt สำหรับ <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> (ฟรี) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> คุณแบ่งปันการสร้างสรรค์ของคุณทางออนไลน์ที่ไหน </h2> <p> หากคุณเป็นศิลปิน นักออกแบบ หรือช่างภาพที่ใช้งานอินเทอร์เน็ตมาเป็นเวลานาน เป็นไปได้ว่าคุณเคยใช้งาน DeviantArt มาก่อน ดูเหมือนชุมชนจะไม่ค่อยมีชีวิตชีวาเหมือนในต้นทศวรรษ 2000 แต่ผลงานที่ส่งเข้ามามีจำนวนเพิ่มขึ้นอย่างมากในช่วงไม่กี่ปีที่ผ่านมา </p> <p> ด้วยฐานผู้ใช้ที่ใช้งานอยู่ DeviantArt จึงควรมีความสำคัญสูงสุดในการปรับปรุงแอปบนอุปกรณ์เคลื่อนที่ ในขณะที่เขียน แอปได้รับคะแนน 2.6/5.0 ใน App Store และ 3.2/5.0 บน Google Play </p>"}