{"title":"เข้าสู่มิติที่สาม: การทำงานกับเวิร์กโฟลว์ 3 มิติใน Adobe After Effects","content":"<p> หากคุณต้องการปรับปรุงเวิร์กโฟลว์ Adobe After Effects ในที่สุด คุณจะต้องเริ่มจัดการกับแกน Z เพื่อให้คุณจัดการความลึก 3 มิติของวัตถุ </p> <p> ซึ่งเป็นการเปิดภาพและสไตล์ใหม่ๆ ให้คุณใช้งาน แต่ยังสร้างชุดข้อจำกัดและข้อควรพิจารณาอีกด้วย </p> <p> ในบทความนี้ เราจะพูดถึงวิธีการเปิดใช้งานและทำงานกับเลเยอร์ 3 มิติ รวมถึงวิธีการเพิ่มและทำให้กล้อง 3 มิติเคลื่อนไหวเพื่อสร้างการเคลื่อนไหวแบบไดนามิก เราจะตรวจสอบสถานการณ์ที่เราสร้างภาพเคลื่อนไหวและย้ายข้อความในพื้นที่ 3 มิติด้วย </p> <p> มาโดดกัน! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> วิธีเปิดใช้งานและทำให้เลเยอร์ 3 มิติเคลื่อนไหว </h2> <p> ภายในองค์ประกอบของคุณ คุณสามารถสลับเลเยอร์ของคุณในไทม์ไลน์ของคุณเพื่อเปิดใช้งานเป็น 3 มิติ </p> <p> นี่เป็นกระบวนการที่ตรงไปตรงมามาก เพียงแค่หา <strong> คิวบ์ </strong> ไอคอนสำหรับเลเยอร์ของคุณในไทม์ไลน์ของคุณ แล้วคลิกช่องด้านล่างเพื่อเปิดใช้งาน 3D สำหรับเลเยอร์นั้น </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> เมื่อดำเนินการเสร็จแล้ว คุณจะไม่เห็นการเปลี่ยนแปลงใดๆ ในทันที อย่างไรก็ตาม หากคุณไปยังตำแหน่ง มาตราส่วน และพารามิเตอร์การหมุนในเลเยอร์ของคุณ คุณจะเห็นว่ามีตัวเลขที่ปรับได้ชุดที่สามปรากฏขึ้น </p> <p> ตัวเลขใหม่เหล่านี้กำหนดการหมุน ตำแหน่ง และมาตราส่วนของคุณบนแกน Z ในพื้นที่ 3 มิติ เช่นเดียวกับพารามิเตอร์อื่นๆ ของคุณ พารามิเตอร์เหล่านี้สามารถเป็นคีย์เฟรมเพื่อให้สามารถเคลื่อนไหวและปรับแต่งได้ </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> ตัวอย่างเช่น มาสร้างองค์ประกอบและเลเยอร์ข้อความด้วยคำบางคำ </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> เมื่อเสร็จแล้ว ให้เปิดใช้งานเลเยอร์ 3 มิติ โปรดทราบว่าหากคุณวางแผนที่จะใช้ use <strong> จัดตำแหน่ง </strong> เครื่องมือเพื่อให้แน่ใจว่าเลเยอร์ของคุณอยู่ตรงกลางอย่างสมบูรณ์ คุณจะต้องทำสิ่งนี้ก่อนเปิดใช้งาน 3D ทั้งนี้เป็นเพราะ <strong> จัดตำแหน่ง </strong> เครื่องมือทำงานบนเลเยอร์ 2D เท่านั้น </p> <p> ตอนนี้เลเยอร์ข้อความของเราเป็นเลเยอร์ 3 มิติ เราสามารถย้ายเลเยอร์นั้นไปในพื้นที่ 3 มิติตามแกน Z ให้ย้ายข้อความ &quot;ไปที่หน้าจอ&quot; </p> <p> อันดับแรก เราจะตั้งค่าพารามิเตอร์แกน Z ของเรา โดยค่าเริ่มต้น ระบบจะตั้งค่าเป็นศูนย์ มาตั้งค่าเป็น <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> ตอนนี้ เราจะเลื่อนไปตามไทม์ไลน์ของเราสองวินาที และตั้งค่าแกน Z เป็น <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> ด้วยการเปลี่ยนแปลงนี้ เราควรเห็นข้อความเคลื่อน &quot;ไปทาง&quot; หน้าจอ </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> กล้อง 3D คืออะไร? </h2> <p> เราทำให้วัตถุเคลื่อนไหวได้สำเร็จในพื้นที่ 3 มิติใน After Effects แต่จะเป็นอย่างไรถ้าคุณมีวัตถุหลายชิ้น และต้องการสร้างความรู้สึกของผู้ดูที่กำลังเคลื่อนที่เข้าหาหรือออกจากวัตถุเหล่านั้น </p> <p> คุณสามารถทำให้องค์ประกอบแต่ละอย่างเคลื่อนไหวเพื่อเคลื่อนเข้าหาตัวคุณได้ แต่จะต้องใช้เวลามากและไม่มีประสิทธิภาพโดยเฉพาะ นี่คือที่ที่คุณจะใช้กล้อง 3 มิติ </p> <p> </p> <p> หากคุณใช้ซอฟต์แวร์ 3D เช่น Cinema 4D หรือ Blender เป็นไปได้ว่าคุณเคยใช้กล้อง 3D มาก่อน หากคุณเคยเล่นเกมคอมพิวเตอร์ คุณก็จะได้สัมผัสกับกล้อง 3 มิติที่เคลื่อนไหวมุมมองของคุณไปรอบๆ ในโลก 3 มิติ </p> <p> ทั้งหมดนี้อาจดูซับซ้อนในตอนแรก แต่กล้อง 3D ทำงานเหมือนกับกล้องจริง พวกเขาให้มุมมองที่สามารถจัดการและย้ายในพื้นที่ 3 มิติ </p> <p> มาลองทำตัวอย่างกัน </p> <h3 id=\"setting-up-a-3d-camera\"> การตั้งค่ากล้อง 3 มิติ </h3> <p> ในการเริ่มต้น ให้สร้างเลเยอร์ข้อความ 3 มิติหลายชั้น แล้วจัดตำแหน่งตามลำดับลงในแกน Z </p> <p> ในตัวอย่างนี้ ช่องว่างของ <strong> 3,000 พิกเซล </strong> ระหว่างแต่ละชั้นถูกใช้ เลเยอร์แรกอยู่ที่ศูนย์ ถัดไปที่ 3,000 ถัดไปที่ 6,000 เป็นต้น </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> ถึงเวลาสร้างกล้อง 3 มิติด้วยการคลิก <strong> ชั้น </strong> &gt; <strong> ใหม่ </strong> &gt; <strong> กล้อง </strong> ซึ่งคุณจะเห็นหน้าต่างสำหรับปรับการตั้งค่าสำหรับเลเยอร์กล้องใหม่ของคุณ เหล่านี้มาในสองประเภท: <strong> โหนดเดียว </strong> และ <strong> สองโหนด </strong> . </p> <p> <strong> โหนดเดียว </strong> กล้องได้รับการออกแบบให้ใช้งานและเลียนแบบกล้องในโลกแห่งความเป็นจริงได้ใกล้เคียงที่สุด และจุดโฟกัสถูกกำหนดด้วยตนเองโดยการเคลื่อนไหวของกล้อง </p> <p> อา <strong> สองโหนด </strong> กล้องได้รับการออกแบบมาให้ติดตามจุดสนใจเพียงจุดเดียว ทำให้เหมาะสำหรับการโคจรหรือติดตามวัตถุที่กำลังเคลื่อนที่ </p> <p> ในสถานการณ์สมมตินี้ <strong> โหนดเดียว </strong> จะใช้กล้อง คุณจะสังเกตเห็นการตั้งค่าเพิ่มเติมจำนวนหนึ่งในหน้าต่าง เช่น <strong> ซูม </strong> , <strong> มุมมองภาพ </strong> , <strong> เปิดใช้งานความชัดลึก </strong> , และ <strong> ความยาวโฟกัส </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> สิ่งเหล่านี้มีจุดประสงค์เพื่อสะท้อนการตั้งค่ากล้องในโลกแห่งความเป็นจริง หากคุณเข้าใจวิธีการทำงานเหล่านี้ อย่าลังเลที่จะลองใช้มัน หากไม่เป็นเช่นนั้น คุณสามารถเลือกชุดค่าที่ตั้งล่วงหน้าได้ที่มุมขวาบน </p> <p> เราจะเลือก <strong> 35mm </strong> ที่ตั้งไว้ล่วงหน้าสำหรับตอนนี้ ตอนนี้เลเยอร์กล้องของเราได้รับการตั้งค่าและในฉากแล้ว คุณจะไม่เห็นความแตกต่างมากนักในตอนแรก </p> <h3 id=\"using-3d-camera-navigation\"> การใช้การนำทางด้วยกล้อง 3 มิติ </h3> <p> มีสองวิธีที่คุณสามารถปรับและทำให้มุมมองของกล้องเคลื่อนไหวได้ ที่ถูกต้องที่สุดคือโดยการป้อนที่แตกต่างกัน <strong> ตำแหน่ง </strong> ค่าใน <strong> แปลง </strong> การตั้งค่าสำหรับเลเยอร์กล้อง จากนั้น คุณสามารถคีย์เฟรมได้เหมือนกับที่คุณทำเมื่อสร้างแอนิเมชันเลเยอร์อื่นๆ </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> เมื่อคุณขยับกล้อง คุณจะสังเกตเห็นว่าวัตถุ 3 มิติอื่นๆ ทั้งหมดในฉากของคุณจะเคลื่อนที่สัมพันธ์กับวัตถุนั้น โปรดทราบว่ากล้องจะ <strong> ไม่ส่งผลต่อเลเยอร์ 2 มิติ </strong> . </p> <p> ดังนั้น ให้ตั้งค่ากล้องของเราให้เคลื่อนที่บนแกน Z จากศูนย์ถึง 9,000 ในช่วงเวลา 4 วินาที แล้วจัดเฟรมหลักการเคลื่อนไหวของเรา </p> <p> ที่นั่นคุณมีมัน! หากคุณตั้งค่าอย่างถูกต้อง คำพูดควรผลัก &quot;เข้าหา&quot; คุณ &quot;ผ่าน&quot; ช่องมอง และ &quot;ข้างหลัง&quot; ผู้ชม </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> วิธีอื่นๆ ในการเคลื่อนย้ายกล้อง 3 มิติ </h3> <p> หากคุณต้องการทดลองมากขึ้นอีกเล็กน้อยและใช้กล้องกับตัวเลขน้อยลง มีวิธีอื่นในการเคลื่อนย้าย นำทาง และปรับเปลี่ยน <strong> วงโคจร </strong> , <strong> ปาน </strong> , และ <strong> ดอลลี่ </strong> เครื่องมือที่ด้านบนของแถบเครื่องมือช่วยให้คุณทำสิ่งนี้ได้ </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> เมื่อใช้สิ่งเหล่านี้ คุณสามารถคลิกและลากเพื่อย้ายจากด้านหนึ่งไปอีกด้านหนึ่ง ( <strong> แพน) </strong> , หมุนไปรอบๆ ( <strong> วงโคจร </strong> ) และซูมเข้าและออก ( <strong> ดอลลี่ </strong> ). การควบคุมเหล่านี้แม่นยำน้อยกว่าการป้อนตัวเลข แต่เหมาะสำหรับการวางแผนการเคลื่อนไหวของกล้องคร่าวๆ และแอนิเมชั่น </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> การฝึกฝนนำไปสู่ความสมบูรณ์แบบ </h2> <p> ตอนนี้คุณควรจะสามารถสร้างและสร้างภาพเคลื่อนไหวให้กับเลเยอร์ 3 มิติตามแนวแกน Z และทำงานร่วมกับกล้อง 3 มิติเพื่อนำทางด้วยวัตถุ 3 มิติหลายชิ้น </p> <p> หากคุณชอบทำงานในพื้นที่ 3 มิติ คุณอาจต้องการสำรวจความเป็นไปได้ขั้นสูงที่ซอฟต์แวร์ 3D โดยเฉพาะ เช่น Blender สามารถนำเสนอได้ </p>"}