{"title":"Mark Zuckerberg ของ Facebook ได้ผลักดันความเป็นส่วนตัวของ Apple","content":"<p> มีรายงานว่า Mark Zuckerberg CEO ของ Facebook บอกกับพนักงาน Facebook ว่า &quot;เราต้องสร้างความเจ็บปวด&quot; ให้กับ Apple สำหรับการปฏิบัติต่อโซเชียลมีเดียยักษ์ใหญ่อย่างย่ำแย่ <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> วอลล์สตรีทเจอร์นัล </a> รายงาน </p> <p> Zuckerberg ควรจะแสดงความคิดเห็นในปี 2018 หลังจากที่ผู้บริหารระดับสูงของ Apple และ Facebook ทะเลาะกันเรื่องอื้อฉาว Cambridge Analytica ซึ่งข้อมูลส่วนบุคคลของผู้ใช้ Facebook หลายล้านคนถูกเข้าถึงโดยไม่ได้รับความยินยอมสำหรับการโฆษณาทางการเมือง </p> <h2 id=\"apple-vs-facebook\"> Apple vs. Facebook </h2> <p> ในเวลานั้น Tim Cook CEO ของ Apple ถูกถามในการสัมภาษณ์ว่าเขาจะตอบสนองอย่างไรหากเขาอยู่ในสถานการณ์ของ Zuckerberg ซึ่งกำลังเผชิญกับวิกฤต “ฉันจะไม่อยู่ในสถานการณ์นี้” คุกกล่าว </p> <p> The Wall Street Journal อ้างว่าในขณะที่ Zuckerberg แสดงความคิดเห็นว่าคำพูดของ Cook นั้น &quot;ไร้สาระอย่างยิ่ง&quot; และ &quot;ไม่สอดคล้องกับความจริงเลย&quot; เบื้องหลังเขาประเมินได้ค่อนข้างรุนแรงกว่ามาก </p> <p> ตั้งแต่นั้นมา ความสัมพันธ์ระหว่างบริษัทเทคโนโลยีทั้งสองก็ไม่ดีขึ้นเลย Apple ได้เพิ่มจุดยืนที่เน้นความเป็นส่วนตัวเป็นสองเท่าโดย Cook ประกาศความเป็นส่วนตัวให้เป็นหนึ่งใน <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> ความกังวลที่เร่งด่วนที่สุดในโลก </a> . iOS 14 มีคุณสมบัติที่เกี่ยวข้องกับความเป็นส่วนตัวหลายประการ ซึ่ง Facebook ได้นำประเด็นมาอ้างว่ามีศักยภาพที่จะทำร้ายธุรกิจขนาดเล็กได้ </p> <p> ในระหว่างการโทรหานักลงทุนรายไตรมาสล่าสุดของ Facebook Zuckerberg ระบุว่า Apple &quot; <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> หนึ่งใน [Facebook&#39;s] คู่แข่งที่ใหญ่ที่สุด </a> อันเป็นผลมาจากมาตรการปกป้องความเป็นส่วนตัวใหม่เหล่านี้ &quot;Apple อาจกล่าวว่าพวกเขากำลังทำเช่นนี้เพื่อช่วยเหลือผู้คน </p> <p> </p> <p> Facebook คาดว่าจะเตรียมคดีต่อต้านการผูกขาดกับ Apple ที่จะเปลี่ยนการจู่โจมระหว่างไททันของ Silicon Valley ทั้งสองให้กลายเป็นการต่อสู้ทางกฎหมายเต็มรูปแบบ รายงานของ Wall Street Journal ระบุว่า &quot;ข้อตกลงด้านกฎระเบียบและการตัดสินใจทางกฎหมายที่อาจเกิดขึ้นมีแนวโน้มที่จะส่งผลกระทบต่อโทรศัพท์ของผู้บริโภคหลายร้อยล้านเครื่องในอีกไม่กี่ปีข้างหน้า&quot; </p> <p> </p> <h2 id=\"different-approaches\"> แนวทางที่แตกต่าง </h2> <p> Dani Lever โฆษกของ Facebook บอกกับ Wall Street Journal ว่า &quot;Apple อ้างว่าเรื่องนี้เกี่ยวกับความเป็นส่วนตัว แต่มันเป็นเรื่องของกำไร และเรากำลังร่วมกับคนอื่นๆ เพื่อชี้ให้เห็นถึงพฤติกรรมต่อต้านการชอบตัวเองและต่อต้านการแข่งขัน&quot; เธอกล่าวว่า Facebook &quot;จงใจยืนหยัดเพื่อ Apple&quot; ในนามของธุรกิจขนาดเล็กและนักพัฒนาที่ได้รับผลกระทบจากคุณสมบัติความเป็นส่วนตัวของแอพของ Apple </p> <p> แม้ว่าลีเวอร์จะปฏิเสธว่าการต่อสู้ระหว่างสองบริษัทเป็นเรื่องส่วนตัว แต่ก็เป็นมากกว่าความขัดแย้งเพียงไม่กี่ประเด็นระหว่างบริษัทเทคโนโลยีขนาดใหญ่สองแห่ง รูปแบบธุรกิจที่ได้รับทุนสนับสนุนจากโฆษณาที่ Facebook ดำเนินการอยู่นั้นแตกต่างอย่างมากจากโมเดลที่ได้รับทุนสนับสนุนจากฮาร์ดแวร์ซึ่งขับเคลื่อน Apple ทั้ง 2 บริษัทหรือผู้นำของบริษัททั้งสองไม่น่าจะถอยกลับความเชื่อหลักของพวกเขาเกี่ยวกับวิธีสร้างอนาคตของเทคโนโลยี </p> <p> ความจริงที่ว่า Tim Cook CEO ของ Apple กล่าวถึงความเป็นส่วนตัวในแง่ศีลธรรมแสดงให้เห็นว่าเรื่องนี้เป็นเรื่องส่วนตัวเพียงใดในระดับหนึ่ง </p> <p> <small> เครดิตภาพ: Wikipedia/ <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> แอนโธนี่ ควินตาโน ซีซี </a></small> </p>"}