{"title":"Google กำลังเพิ่มการรองรับ Face ID ให้กับ Chrome สำหรับ iOS","content":"<p> Google กำลังทดสอบฟีเจอร์ความปลอดภัยใหม่ใน Chrome 89 สำหรับ iOS ที่ใช้การตรวจสอบสิทธิ์ไบโอเมตริกของ iPhone เพื่อปกป้องแท็บการท่องเว็บแบบส่วนตัวของคุณ ขณะนี้จำกัดให้เฉพาะผู้ที่อยู่ในช่องเบต้าของ Chrome เท่านั้น ซึ่งจะช่วยให้คุณล็อกแท็บที่ไม่ระบุตัวตนด้วย Face ID หรือ Touch ID </p> <h2 id=\"even-more-private-private-browsing\"> การท่องเว็บแบบส่วนตัวมากยิ่งขึ้น </h2> <p> แท็บที่ไม่ระบุตัวตนที่ป้องกันด้วย Face หรือ Touch ID จะเบลอในตัวสลับแท็บ แท็บที่ล็อกไว้จะมองเห็นได้อีกครั้งเมื่อยืนยันด้วยการตรวจสอบไบโอเมตริกซ์ของ ‌iPhone‌ </p> <p> ฟีเจอร์ที่เป็นประโยชน์นี้ไม่เพียงแต่ช่วยเพิ่มความเป็นส่วนตัว แต่ยังเสริมความปลอดภัยให้แข็งแกร่งเมื่อคุณทำงานหลายอย่างพร้อมกันในแอปต่างๆ บน iPhone หรือ iPad <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> สังเกตว่าผู้ใช้เบต้าบางคนไม่สามารถเข้าถึงตัวเลือกการล็อกใหม่ได้เนื่องจากส่วนประกอบฝั่งเซิร์ฟเวอร์ </p> <p> </p> <h2 id=\"how-s-this-useful\"> สิ่งนี้มีประโยชน์อย่างไร? </h2> <p> นอกจากนี้ยังเป็นประโยชน์สำหรับช่วงเวลาที่เพื่อนอาจขอยืม iPhone ของคุณเพื่อค้นหาบางสิ่งทางออนไลน์อย่างรวดเร็ว ด้วยการป้องกัน Face ID สำหรับโหมดการท่องเว็บแบบส่วนตัวของ Chrome พวกเขาจะไม่สามารถเห็นเว็บไซต์ที่ไม่ระบุตัวตนที่เปิดอยู่ของคุณเมื่อเปลี่ยนแท็บ </p> <p> </p> <p> &quot;ไม่ระบุตัวตน&quot; เป็นชื่อทางการตลาดสำหรับโหมดการท่องเว็บแบบส่วนตัวของ Chrome ขณะไม่ระบุตัวตน คุณสามารถท่องเว็บได้โดยไม่ต้องให้ Chrome บันทึกข้อมูลใดๆ เกี่ยวกับเซสชัน เมื่อคุณปิดหน้าต่างที่ไม่ระบุตัวตน <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> ข้อมูลทั้งหมดในเซสชั่นนั้นหายไป </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> วิธีเปิดใช้งาน Face หรือ Touch ID ใน Chrome </h2> <p> ฟีเจอร์ใหม่ที่กำลังจะเกิดขึ้นนี้ต้องเปิดใช้งานด้วยตนเองในส่วนความเป็นส่วนตัวของการตั้งค่าในแอปของ Chrome มีการล็อกความเป็นส่วนตัวที่คล้ายกันในแอปอื่นๆ ของ Google </p> <p> ตัวอย่างเช่น ในแอปค้นหาแบบเนทีฟ การตรวจสอบไบโอเมตริกซ์ของ iPhone จะยืนยันตัวตนของคุณเมื่อกลับสู่เซสชันที่ไม่ระบุตัวตนหลังจากผ่านไป 15 นาที การตรวจสอบสิทธิ์ Face หรือ Touch ID ที่เป็นตัวเลือกมีให้ใน Google ไดรฟ์เพื่อปกป้องไฟล์ของคุณเมื่อคุณออกจากแอป </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> คุณลักษณะนี้จะเผยแพร่อย่างเป็นทางการเมื่อใด </h2> <p> ยังไม่มีข้อมูลใดๆ ว่าตัวเลือกการล็อกแบบใหม่อาจเปิดตัวสำหรับทุกคน แต่ Chrome 89 คาดว่าจะออกสู่สาธารณะในเดือนหน้า Google ยังสามารถตัดสินใจที่จะไม่เผยแพร่คุณลักษณะนี้เลย แม้ว่าจะระบุไว้ในบันทึกประจำรุ่นอย่างเป็นทางการก็ตาม </p>"}