{"title":"วิธีเปลี่ยน PS5 จากแนวตั้งเป็นแนวนอน (หรือกลับกัน)","content":"<p> PlayStation 5 ทำงานในแนวตั้งหรือแนวนอนก็ได้ หากคุณเปลี่ยนใจในแนวที่ต้องการ การย้าย PS5 จากแนวตั้งเป็นแนวนอนนั้นค่อนข้างง่าย (หรือกลับกัน) </p> <p> มาดูวิธีการย้าย PS5 ของคุณอย่างปลอดภัยจากแนวตั้งเป็นแนวนอนด้านข้าง แล้วกลับมาใหม่อีกครั้ง </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> ขั้นแรก: ปิดและถอดปลั๊ก PS5 . ของคุณ </h2> <p> ก่อนที่คุณจะทำงานใดๆ ในการเคลื่อนย้าย PlayStation 5 ของคุณ สิ่งสำคัญคือต้องปิดเครื่องและถอดปลั๊กทุกอย่าง วิธีนี้จะป้องกันความเสียหายต่อระบบที่อาจเกิดขึ้นหากคุณเคลื่อนย้ายไปรอบๆ ขณะที่เปิดเครื่อง </p> <p> คุณควรปิด PS5 ของคุณจนสุด เมื่อต้องการทำเช่นนี้ ให้กด <strong> ปุ่ม PS </strong> บนคอนโทรลเลอร์ของคุณเพื่อเปิดเมนูด่วนที่ด้านล่างของหน้าจอ เลือก <strong> พลัง </strong> ทางขวาและเลือก <strong> ปิด PS5 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> รอจนกระทั่งไฟคอนโซลของคุณดับลง จากนั้นถอดสายไฟ สาย HDMI และสิ่งอื่นใดที่คุณเชื่อมต่อกับระบบ ตอนนี้คุณพร้อมที่จะเปลี่ยนการวางแนวของ PS5 แล้ว </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> ถอดสกรูขาตั้ง </h2> <p> เมื่อคุณตั้งค่า PS5 ในแนวตั้ง คุณต้องถอดสกรูที่ให้มาด้วยออกจากช่องในฐาน และใช้เพื่อยึดฐานเข้ากับคอนโซลเมื่อวางในแนวตั้ง ด้วยเหตุนี้ การถอดสกรูนี้เป็นขั้นตอนแรกของคุณในการเปลี่ยนการวางแนวคอนโซลของคุณ </p> <p> ค่อยๆ พลิก PS5 ไปด้านข้าง เพื่อให้คุณสามารถเข้าถึงขาตั้งที่ด้านล่างได้ ใช้ไขควงปากแบน เหรียญ หรือสิ่งที่คล้ายคลึงกันเพื่อถอดสกรูสีเงินตัวเดียวที่ยึดฐานเข้ากับระบบ </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> เมื่อสกรูหลวม ฐานจะหลุดออกมา มีช่องเล็กในฐานสำหรับเก็บสกรู ยึดเข้าที่ จากนั้นเลื่อนเข้าไปในรูเล็กๆ เพื่อยึดให้แน่น </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> นอกจากนี้ ในช่องนี้ คุณจะพบจุกสีดำขนาดเล็ก (ตราบใดที่คุณวางไว้ระหว่างการตั้งค่าเริ่มต้น) ถอดจุกนี้ออกแล้วใช้เพื่อเสียบรูที่ด้านล่างของ PS5 ที่คุณเพิ่งถอดสกรูออก </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> หมุนฐาน </h2> <p> ตอนนี้ คุณจะต้องหมุนฐานเพื่อให้พอดีกับคอนโซลในแนวนอน นอกจากนี้ยังปิดช่องขนาดเล็กที่คุณวางสกรูและยึดให้แน่นยิ่งขึ้น </p> <p> คุณควรหมุนฐานเมื่อมองจากด้านบน (ตรงข้ามกับที่คุณเพิ่งเก็บสกรูไว้) หากคุณปฏิบัติต่อส่วนที่ยกสูงของขาตั้งแบบ &quot;ทิศเหนือ&quot; คุณจะต้องหมุนส่วนภายนอกของขาตั้งให้ไปทาง &quot;ทิศตะวันตกเฉียงเหนือ&quot; ดังที่แสดงด้านล่าง </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> นี่คือการวางแนวที่ถูกต้องสำหรับการใช้ขาตั้งในแนวนอน มันจะคลิกและหยุดเบา ๆ เมื่อคุณอยู่ในจุดที่ถูกต้อง </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> ติดขาตั้งในแนวนอน </h2> <p> ตอนนี้คุณสามารถติดขาตั้งเข้ากับ PS5 ของคุณในขณะที่วางเครื่องในแนวนอน ตรวจสอบให้แน่ใจว่าระบบอยู่ในตำแหน่งที่ถูกต้อง — โลโก้ PS ควรหงายขึ้น </p> <p> ที่ด้านหลังระบบของคุณ ด้านล่างและใกล้กับพอร์ต USB สองพอร์ต คุณจะเห็นสัญลักษณ์ตัวควบคุม PlayStation บางตัวประทับอยู่บนคอนโซล เลื่อนแขนด้านนอกของฐาน (ที่คุณเพิ่งหมุนไป) เข้ากับระบบรอบๆ โดยที่รูปแบบนี้สิ้นสุดที่แต่ละด้าน </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> ดันคลิปเพื่อยึดให้แน่น แต่โปรดทราบว่าในตำแหน่งนี้ ขาตั้งไม่ได้ล็อคเข้าที่จนสุด (เช่นเดียวกับสกรูเมื่อวางในแนวตั้ง) ค่อยๆ วางระบบลง และระวังว่าขาตั้งอาจลื่นได้หากดึงขึ้น </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> ตอนนี้คุณพร้อมที่จะใช้ PS5 ในแนวนอนแล้ว เสียบสายเคเบิลทั้งหมดกลับเข้าที่แล้วเริ่มต้นใหม่เพื่อกลับไปเล่น หากคุณมี PS5 มาตรฐาน คุณจะต้องใส่แผ่นดิสก์โดยหงายหน้าขึ้นในทิศทางนี้ </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> วิธีเปลี่ยน PS5 กลับจากแนวนอนเป็นแนวตั้ง </h2> <p> ต้องการกลับไปที่แนวตั้งสำหรับ PS5 ของคุณ หรือบางทีคุณอาจตั้งค่า PS5 ในรูปแบบแนวนอนในตอนแรกและต้องการเป็นแนวตั้งในตอนนี้ ไม่ว่าจะด้วยวิธีใด คุณสามารถทำตามขั้นตอนข้างต้นในลำดับที่กลับกันได้ง่ายๆ ตรวจสอบให้แน่ใจว่าคุณปิดเครื่องและถอดปลั๊ก PS5 ออกก่อน หากเครื่องเปิดอยู่หรืออยู่ในโหมดพัก </p> <p> </p> <p> หากต้องการเปลี่ยนเป็นแนวตั้ง ก่อนอื่นให้ยก PS5 ของคุณขึ้น แล้วค่อยๆ ดึงขาตั้งออกจากระบบเพื่อถอดออก ถัดไป คุณควรหมุนแขนด้านนอกของฐาน เมื่อมองจากด้านบน แขนควรอยู่ &quot;เหนือ&quot; ในแนวเดียวกับส่วนที่ยก ตรวจสอบให้แน่ใจว่าคุณสัมผัสได้ถึงการคลิกอย่างนุ่มนวล คุณจะได้รู้ว่ามันมาถูกที่แล้ว </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> จัดตำแหน่ง PS5 ของคุณเพื่อให้คุณสามารถเข้าถึงด้านล่าง จากนั้นถอดตัวหยุดสีดำออกจากรูตรงกลาง ซึ่งอยู่ตรงกลางช่องระบายอากาศ </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> วางตัวหยุดสีดำนี้ไว้ในรูเล็กๆ ในช่องที่ด้านล่างของฐาน จุกควรล็อคเข้าที่ </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> ถัดไป ถอดสกรูออกจากช่องเดียวกันในฐาน ตอนนี้ คุณจะต้องติดขาตั้งให้อยู่ในตำแหน่งที่เหมาะสม ในการทำเช่นนั้น ให้ยืน PS5 ของคุณขึ้นโดยให้ด้านหลังของคอนโซลหงายขึ้น ดังที่แสดงด้านล่าง </p> <p> นำขาตั้งมาวางโดยให้รูสำหรับสกรูอยู่ในแนวเดียวกับรูสกรูที่คุณเพิ่งถอดจุก จัดตำแหน่งคลิปบนแขนฐานที่ด้านหลังของระบบของคุณใต้ขั้วต่อสายไฟ ขาตั้งควรเข้าแถวได้ง่าย </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> ตอนนี้ใช้ไขควงหรือสิ่งที่คล้ายกันเพื่อขันสกรูให้แน่น เมื่อคุณทำเสร็จแล้วและรู้สึกว่าขาตั้งแน่นหนา คุณก็พร้อมที่จะใช้ PS5 ในแนวตั้ง เสียบสายเคเบิลทั้งหมดกลับเข้าที่เพื่อให้งานเสร็จสมบูรณ์ </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> คุณควรยืน PS5 ของคุณในแนวตั้งหรือแนวนอน? </h2> <p> Sony รองรับการใช้ PS5 ของคุณทั้งในแนวตั้งและแนวนอน ดังนั้นจึงไม่มีทางถูกหรือผิด ตราบใดที่ระบบของคุณมีอากาศไหลเวียนเพียงพอ คุณควรใช้การวางแนวใดขึ้นอยู่กับความต้องการของคุณ </p> <p> </p> <p> หากคุณมีพื้นที่เยอะและไม่รังเกียจว่า PS5 จะใช้พื้นที่ในแนวนอนมาก สำหรับผู้ที่ใช้ PS5 รุ่นมาตรฐาน ยังทำให้ขั้นตอนการใส่แผ่นดิสก์ง่ายขึ้นอีกเล็กน้อย เนื่องจากควรหงายฉลากขึ้นเสมอ ซึ่งจำยากกว่าเล็กน้อยเมื่อใช้การวางแนวตั้ง โดยที่ป้ายชื่อดิสก์ควรหันไปทางซ้าย </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> อย่างไรก็ตาม คุณอาจไม่มีที่ว่างในระบบความบันเทิงของคุณเพื่อรองรับการตั้งค่าแนวนอน ในกรณีเหล่านี้ การไปในแนวดิ่งเป็นทางออกที่ดีที่สุดของคุณ PS5 เป็นคอนโซลขนาดใหญ่ไม่ว่าจะด้วยวิธีใด แต่เมื่อวางในแนวตั้ง เครื่องจะวางชิดติดกับขาตั้งทีวีหรือรุ่นใกล้เคียง นี่คือการตั้งค่าที่ฉันใช้ดังแสดงในภาพด้านล่าง </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> ไม่ว่าคุณจะเลือกทิศทางใดสำหรับ PS5 ของคุณ ตรวจสอบให้แน่ใจว่าคุณใช้ขาตั้ง มันทำให้ระบบอยู่เหนือพื้น ซึ่งช่วยเพิ่มการไหลเวียนของอากาศ ขาตั้งยังยึด PS5 ให้แน่น ทำให้ยากต่อการล้มและอาจสร้างความเสียหายได้ </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> ตั้งค่า PS5 ของคุณแล้วเริ่มเล่นได้เลย </h2> <p> ตอนนี้คุณรู้วิธีเปลี่ยน PS5 จากแนวตั้งเป็นแนวนอนและย้อนกลับอีกครั้งในเวลาเพียงไม่กี่นาที เมื่อระบบของคุณได้รับการตั้งค่าแล้ว ให้เริ่มทำงานและสนุกไปกับเกมที่ดีที่สุดของ PS5 </p> <p> อย่าลืมว่าไลบรารีของ PS4 เกือบทั้งหมดทำงานบน PS5 ได้เช่นกัน ทำให้คุณเพลิดเพลินได้มากขึ้น </p> <p> <small> เครดิตภาพ: Alex Van Aken/ <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}