{"title":"วิธีสร้างหรือแก้ไขรูปแบบใน Adobe Illustrator","content":"<p> สร้างรูปแบบใน Adobe Illustrator และคุณสามารถนำไปใช้กับรูปร่าง ลายเส้น และแม้แต่ข้อความได้อย่างรวดเร็ว คุณสามารถทำสิ่งที่ง่าย เช่น รูปแบบของจุด หรือทำอะไรที่ซับซ้อนกว่านี้ คุณยังใช้ส่วนหนึ่งของกราฟิกแบบเวกเตอร์ที่มีอยู่แล้วเปลี่ยนเป็นรูปแบบได้อีกด้วย </p> <p> รูปแบบเหมาะสำหรับพื้นหลัง พื้นผิว และอื่นๆ ต่อไปนี้คือวิธีใช้เครื่องมือรูปแบบของ Illustrator และวิธีสร้างและแก้ไขรูปแบบของคุณเอง </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> การใช้รูปแบบเริ่มต้นใน Adobe Illustrator </h2> <p> Illustrator มาพร้อมกับรูปแบบต่างๆ ในตัว นอกจากจะมีประโยชน์ในตัวเองแล้ว ยังเป็นวิธีที่ดีในการดูว่ารูปแบบทำงานอย่างไร รูปแบบเหล่านี้จะทำให้คุณมีไอเดียเกี่ยวกับวิธีใช้รูปแบบของคุณเองเมื่อคุณสร้างมันแล้ว </p> <p> </p> <p> คุณสามารถหารูปแบบได้ในหน้าต่าง Swatches หากยังไม่เปิด ให้ไปที่ <strong> หน้าต่าง &gt; Swatches </strong> จากเมนูด้านบน นอกจากสีทึบแล้ว อาจมีบางรูปแบบในหน้าต่าง Swatches ของคุณอยู่แล้ว แต่นี่ไม่ใช่รูปแบบเดียวที่ Illustrator มี </p> <p> คลิก <strong> ห้องสมุดสวอตช์ </strong> ไอคอนที่ด้านล่างซ้ายของหน้าต่าง Swatch ของคุณ วางเมาส์เหนือ <strong> รูปแบบ </strong> แล้วเลือกหนึ่งในไลบรารีสวอตช์รูปแบบ </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> ตอนนี้คุณสามารถใช้แถบสีเหล่านี้ได้เช่นเดียวกับสีทึบ ที่นี่คุณสามารถดูรูปแบบจาก <strong> ธรรมชาติ_ใบไม้ </strong> ไลบรารีที่ใช้เป็นการเติมและขีดตลอดจนข้อความ </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> วิธีสร้างรูปแบบการทำซ้ำขั้นพื้นฐานใน Illustrator </h2> <p> คุณสามารถเปลี่ยนเวกเตอร์ใดๆ ให้เป็นรูปแบบ ไม่ว่าจะเป็นสิ่งที่คุณออกแบบไว้แล้วหรือสิ่งที่คุณสร้างขึ้นด้วยความตั้งใจเฉพาะนี้ คุณสามารถทำได้ด้วยกราฟิกแบบเวกเตอร์ทั้งหมด เลเยอร์เดียว หรืออะไรก็ได้ที่อยู่ระหว่างนั้น </p> <p> สิ่งที่คุณต้องทำคือเลือกสิ่งที่คุณต้องการแปลงเป็นรูปแบบ แล้วลากลงในหน้าต่าง Swatches ตัวอย่างเช่น คุณสามารถลากดวงตาของแมวตัวนี้เข้าไปในเสื้อโค้ตของคุณ ซึ่งจะสร้างตัวอย่างรูปแบบ ซึ่งคุณสามารถใช้เติมสี่เหลี่ยมหรือรูปร่างอื่นๆ ได้ </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> หรือคุณอาจทำแบบเดียวกันกับเวกเตอร์ทั้งหมดก็ได้ ไม่ว่าในกรณีใด Illustrator จะสร้างแพทเทิร์นจากสิ่งที่คุณลากเข้าไปในหน้าต่าง Swatches คุณสามารถใช้แถบตัวอย่างได้เหมือนกับที่คุณทำกับแถบสีปกติ </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> หากคุณดับเบิลคลิก swatch รูปแบบของคุณในหน้าต่าง Swatches จะเป็นการเปิด <strong> ตัวเลือกรูปแบบ </strong> หน้าต่าง. คุณสามารถเปิดได้โดยตรงจาก <strong> Windows &gt; ตัวเลือกรูปแบบ </strong> ในเมนูด้านบน </p> <p> ที่นี่ คุณสามารถแก้ไขรูปแบบของคุณเพิ่มเติม รวมถึงการทำซ้ำและช่องว่างระหว่างการทำซ้ำแต่ละครั้งของภาพ คุณยังแก้ไขการออกแบบลวดลายได้โดยตรงที่นี่ เวอร์ชันของรูปภาพที่ไม่หรี่แสงสามารถแก้ไขได้ตามปกติ คุณสามารถเปลี่ยนสี ย้ายเลเยอร์ และอื่นๆ </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> มีหลายสิ่งที่คุณสามารถทำได้ด้วยหน้าต่างตัวเลือกรูปแบบ ตัวอย่างเช่น คุณสามารถทำซ้ำรูปภาพของคุณในรูปแบบอิฐที่เซ และลดช่องว่างระหว่างแต่ละส่วนของรูปแบบ </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> นำส่วนต่างๆ ของลวดลายมาชิดกันมากพอ และทำให้ซ้อนทับกันได้ โดยการทำเช่นนี้ คุณสามารถสร้างชนิดของรูปแบบกระเบื้องเหมือนที่แสดงด้านล่าง ลองใช้การตั้งค่าการทับซ้อนกันต่างๆ ทั้งหมดในตัวเลือกรูปแบบเพื่อค้นหาสิ่งที่เหมาะกับคุณ </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> วิธีสร้างรูปแบบไร้รอยต่อใน Adobe Illustrator </h2> <p> หากคุณต้องการสร้างลวดลายเรขาคณิตที่ไร้รอยต่อ คุณต้องแน่ใจว่าการออกแบบของคุณมีความสมมาตร ตัวอย่างเช่น เส้นที่เริ่มต้น 10px ขึ้นไปทางด้านซ้ายของรูปแบบจะต้องสิ้นสุดที่ 10px ทางด้านขวา เมื่อเกิดซ้ำ จุดเหล่านั้นจะต้องรวมกัน </p> <p> เมื่อต้องการทำเช่นนี้ ให้สร้างเอกสารใหม่ที่มีขนาดสี่เหลี่ยมจัตุรัส เปิดใช้งานการซ้อนทับกริดโดยกด <strong> Ctrl + &quot; </strong> ( <strong> cmd + &quot; </strong> บน Mac) Smart Guide ก็มีประโยชน์เช่นกัน—เปิดใช้งานด้วย <strong> Ctrl + U </strong> ( <strong> Cmd + U </strong> บน Mac) หากมองไม่เห็นไม้บรรทัดของคุณ ให้กด <strong> Ctrl + R </strong> ( <strong> Cmd + R </strong> บน Mac) เพื่อเปิดใช้งาน </p> <p> คุณยังค้นหาการตั้งค่าเหล่านี้ได้ที่ <strong> ดู </strong> ในเมนูด้านบน แต่เราแนะนำให้ใช้ <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> ปุ่มลัดของ Illustrator Illustrator </a> ที่ซึ่งคุณสามารถประหยัดเวลาได้ </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> วางการออกแบบของคุณในสี่เหลี่ยมจัตุรัส ส่วนใดที่เกินขอบจะต้องเรียงกันที่อีกด้านหนึ่ง <strong> จัดตำแหน่ง </strong> เครื่องมือ ( <strong> หน้าต่าง &gt; จัดแนว </strong> ) อาจช่วยให้คุณจัดวางสิ่งของต่างๆ ให้สอดคล้องกันได้อย่างเหมาะสม คลิกและลากจากไม้บรรทัดเพื่อสร้างไกด์ของคุณเองในที่ที่คุณต้องการ </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> สิ่งสำคัญคือต้องมีสีพื้นหลังด้วย แม้ว่าจะเป็นสีขาว ตรวจสอบให้แน่ใจว่าได้พอดีกับขอบอาร์ตบอร์ดเพราะคุณต้องการตัดแต่งวัสดุที่ไม่จำเป็น </p> <p> เลือกทุกอย่างด้วย <strong> Ctrl + A </strong> ( <strong> Cmd + A </strong> บน Mac) แล้วกด <strong> Shift + M </strong> เพื่อเปิดใช้งาน <strong> ตัวสร้างรูปร่าง </strong> เครื่องมือ. นอกจากนี้ยังสามารถพบได้ในกล่องเครื่องมือ กดค้างไว้ <strong> Alt </strong> ( <strong> ตัวเลือก </strong> บน Mac) สิ่งนี้ทำให้ <strong> ตัวสร้างรูปร่าง </strong> เครื่องมือเข้าสู่โหมดการลบ </p> <p> เมื่อคุณวางเมาส์เหนือส่วนต่างๆ ของการออกแบบด้วยเครื่องมือนี้ คุณจะเห็นว่าส่วนเหล่านั้นเปลี่ยนสีเล็กน้อย คลิกที่พื้นที่ที่คุณไม่ต้องการ และ Illustrator จะลบส่วนเหล่านั้น เหลือเพียงบิตที่ทับซ้อนกับสี่เหลี่ยมพื้นหลัง </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> เมื่อเสร็จแล้ว ให้เลือกทุกอย่างแล้วลากไปยัง swatches ของคุณเพื่อเปลี่ยนเป็นแพทเทิร์น หากต้องการใช้รูปแบบของคุณในเอกสารใหม่ คุณสามารถบันทึกลงในไลบรารีสวอตช์หรือใช้ Adobe Cloud Library ของคุณ </p> <p> หรือคุณสามารถคัดลอกจากหน้าต่าง Swatch นี้ แล้ววางลงในหน้าต่าง Swatch อื่นในเอกสารอื่น </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> ตอนนี้คุณสามารถใช้รูปแบบนี้เหมือนกับที่คุณทำกับรูปแบบอื่นๆ หากคุณทำถูกต้องแล้ว ทุกอย่างควรอยู่ในแนวเดียวกันโดยไม่มีช่องว่าง ทำการปรับเปลี่ยนในเอกสารรูปแบบของคุณหากคุณต้องการ </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> เมื่อใดที่คุณควรใช้รูปแบบใน Adobe Illustrator </h2> <p> การใช้รูปแบบที่ชัดเจนที่สุดคือการสร้างกระเบื้องที่ทำซ้ำได้สำหรับพื้นหลัง แต่คุณสามารถใช้เพื่อเติมรูปร่างเพื่อให้พื้นผิวได้เช่นกัน ข้อความที่มีลวดลายเป็นการใช้งานที่ดีอีกอย่างหนึ่งและสามารถทำให้การพิมพ์ของคุณโดดเด่นได้ </p> <p> หากคุณต้องการ คุณสามารถสร้างรูปแบบของคุณเองได้ด้วยตนเอง คัดลอกและวางภาพเดียวกันซ้ำแล้วซ้ำอีก อาจมีบางครั้งที่คุณต้องการทำเช่นนั้น แต่โดยส่วนใหญ่ ความสามารถของ Illustrator ในการสร้างรูปแบบอัตโนมัติจะเป็นวิธีที่จะไป </p> <p> เป็นเพียงหนึ่งในหลายๆ วิธีที่ Illustrator สามารถทำให้ชีวิตของคุณง่ายขึ้น ทำให้คุณมีเวลาทำงานออกแบบมากขึ้น </p>"}