{"title":"วิธีพัฒนาทักษะการแก้ไข Lightroom ของคุณ: 10 วิธีง่ายๆ","content":"<p> Adobe Lightroom เป็นหนึ่งในแพลตฟอร์มการแก้ไขภาพที่มีชื่อเสียงที่สุดในตลาด โซลูชันนี้ได้รับความนิยมไม่เพียงเพราะมีคุณสมบัติที่มีประโยชน์มากมาย แต่ยังเป็นเพราะใช้งานง่าย </p> <p> เมื่อช่างภาพต้องการใช้ฝีมือของพวกเขาอย่างจริงจังมากขึ้นอีกเล็กน้อย สิ่งแรกที่พวกเขาจะทำคือซื้อซอฟต์แวร์แก้ไข แต่ถึงแม้ว่าคุณจะเป็นแค่คนถ่ายรูปธรรมดาๆ แต่ Lightroom ก็มีวิธีมากมายที่จะทำให้เพื่อนของคุณว้าว </p> <p> ในคู่มือนี้ คุณจะค้นพบวิธีง่ายๆ หลายวิธีในการปรับปรุงภาพถ่ายของคุณใน Lightroom เคล็ดลับเหล่านี้ใช้ได้กับทั้ง Lightroom Classic และ Lightroom Creative Cloud </p> <h2 id=\"use-masking\"> 1. ใช้มาสก์ </h2> <p> หากคุณปรับความคมชัดของรูปภาพโดยค่าเริ่มต้น คุณจะเพิ่มรายละเอียดให้กับรูปภาพทั้งหมด แม้กระทั่งพื้นที่ที่คุณไม่ต้องการ สิ่งนี้อาจทำให้คุณมีเมล็ดพืชจำนวนมากในที่ที่ไม่พึงปรารถนา เช่น บนท้องฟ้าและในน้ำ </p> <p> คุณยังเสี่ยงต่อการทำให้ภาพถ่ายของคุณดูเหมือนภาพวาดมากกว่าสิ่งที่คุณถ่ายด้วยกล้อง โชคดีที่มีวิธีแก้ปัญหาที่ง่าย </p> <p> ในแอพ Lightroom ให้เลื่อนลงไปที่ <strong> รายละเอียด </strong> . เมื่อคุณอยู่ที่นั่น ไปที่ <strong> ลับคม </strong> &gt; <strong> Masking </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> เลื่อนแถบเลื่อนจนกว่าจะเลือกส่วนต่างๆ ของรูปภาพที่ต้องการเพิ่มความคมชัด หากต้องการดูว่าคุณกำลังปิดบังอะไรอยู่ ให้กด <strong> Alt </strong> บนแป้นพิมพ์ของคุณพร้อมกัน </p> <p> เมื่อคุณปิดบังบริเวณที่ต้องการแล้ว ให้เลื่อนแถบเลื่อนการลับให้มากหรือน้อยตามที่คุณต้องการ </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. ใช้โปรไฟล์กล้องแทน Adobe Ones เริ่มต้น </h2> <p> หากคุณอัปโหลดรูปภาพใน RAW Adobe จะเพิ่มโปรไฟล์โปรแกรมอย่างใดอย่างหนึ่งตามค่าเริ่มต้น และแม้ว่าสิ่งเหล่านี้อาจทำให้ภาพของคุณดูดีขึ้นในบางกรณี คุณมักจะดีกว่าการเลือกกล้องเฉพาะสำหรับกล้อง </p> <p> เมื่อคุณใช้โปรไฟล์กล้อง ภาพจะแก้ไขได้ง่ายขึ้นตามสิ่งที่คุณถ่ายด้วยอุปกรณ์ของคุณ </p> <p> หากต้องการเปลี่ยนโปรไฟล์ของรูปภาพ ให้ไปที่ <strong> โปรไฟล์ </strong> &gt; <strong> การจับคู่กล้อง </strong> . จากนั้นคุณสามารถเลือกจาก <strong> มาตรฐาน </strong> , <strong> เป็นกลาง </strong> , <strong> ภูมิทัศน์ </strong> และรูปลักษณ์อื่นๆ </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> จำไว้ว่า: </strong> คุณไม่สามารถเปลี่ยนโปรไฟล์ภาพในเชิงลึกได้หากคุณถ่ายเฉพาะ JPEG ดังนั้น ก่อนออกไปถ่ายรูป ควรตั้งกล้องไว้ที่ใด <strong> ดิบ </strong> หรือ <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. ปัดทับส่วนของรูปภาพของคุณ </h2> <p> คุณเคยเพิ่มความชัดเจน ความอิ่มตัว หรือรายละเอียดของภาพทั้งหมดของคุณโดยคาดหวังผลงานชิ้นเอก แต่ได้ภาพที่ดูเหมือนถ่ายด้วยไมโครเวฟหรือไม่? หากเป็นเช่นนั้น คุณอาจได้ประโยชน์จากการปรับแต่งเฉพาะบางส่วนของรูปภาพแทน </p> <p> ใน Lightroom คุณสามารถเข้าถึงคุณสมบัติที่เรียกว่า <strong> แปรง </strong> . คุณสามารถใช้สิ่งนี้เพื่อ &quot;แปรง&quot; เหนือส่วนต่างๆ ของรูปภาพโดยปล่อยให้ส่วนที่เหลืออยู่ตามลำพัง </p> <p> หากต้องการใช้เครื่องมือนี้ ให้ไปที่ <strong> แปรง </strong> ไอคอนทางด้านขวามือของหน้าจอ คุณสามารถทำให้แปรงของคุณใหญ่ขึ้นหรือเล็กลงได้ ขึ้นอยู่กับว่าคุณต้องการแก้ไขรูปภาพมากน้อยเพียงใด </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> ก่อนที่คุณจะเริ่มแปรง ให้เปลี่ยนลักษณะภาพที่คุณต้องการปรับแต่ง ตัวอย่างเช่น คุณสามารถดันแถบเลื่อนความคมชัดขึ้นได้หากต้องการทำให้ส่วนหนึ่งของรูปภาพชัดเจนขึ้น </p> <p> หลังจากเปลี่ยนคุณสมบัติเหล่านี้แล้ว ให้ปัดบริเวณที่คุณต้องการแก้ไข กด <strong> อู๋ </strong> บนแป้นพิมพ์เพื่อดูว่าคุณปัดไปทางไหน </p> <p> หากคุณทำมากเกินไปในพื้นที่ใดพื้นที่หนึ่ง ให้กด <strong> ลบ </strong> ( <strong> - </strong> ) ที่สำคัญและแปรงเหนือส่วนเหล่านั้นเพื่อลบการแก้ไขของคุณ ความรู้ <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> แป้นพิมพ์ลัดสำหรับ Adobe Lightroom </a> มีประโยชน์สำหรับสถานการณ์เหล่านี้ ดังนั้นอย่าลืมทำความเข้าใจกับมัน! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. ปรับแต่งรูปภาพของคุณ </h2> <p> บางครั้ง กล้องของคุณจะถ่ายภาพที่ขอบมีสีผิดธรรมชาติ คุณจะสังเกตเห็นสิ่งเหล่านี้เป็นพิเศษเมื่อถ่ายภาพในแสงแดดจ้า ส่วนใหญ่มาในเฉดสีเขียวและม่วง </p> <p> ในการจัดเรียงรูปภาพของคุณ ให้เลื่อนลงไปที่ <strong> Defringe </strong> . คุณสามารถเลือกที่จะกำจัดขอบสีม่วงหรือสีเขียว </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> ใช้ <strong> จำนวนเงิน </strong> เพื่อตัดสินใจว่าคุณต้องการเพิ่มการละลายเท่าใด เลื่อนแถบสีจนกว่าคุณจะพอใจกับผลลัพธ์ </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. ใช้เรขาคณิตเพื่อทำให้รูปภาพของคุณตรงขึ้น </h2> <p> ไม่ว่าคุณจะพยายามมากแค่ไหน การถือกล้องให้ตรงก็เป็นเรื่องยากเว้นแต่คุณจะมีขาตั้งกล้อง แต่ด้วยความมหัศจรรย์ของซอฟต์แวร์แก้ไข การยืดรูปภาพของคุณจึงเป็นเรื่องง่าย </p> <p> ใน Lightroom คุณสามารถปรับรูปภาพให้ตรงโดยอัตโนมัติโดยไปที่ <strong> ครอบตัด </strong> มาตรา. อย่างไรก็ตาม ยังมีวิธีที่แม่นยำกว่าเพื่อให้ได้ผลลัพธ์แบบเดียวกัน </p> <p> ที่แท็บด้านขวา ให้เลือกตัวเลือกด้านบน จากนั้นเลื่อนลงไปที่ <strong> เรขาคณิต </strong> . เมื่อคุณอยู่ที่นี่ ไปที่ <strong> ตรง </strong> &gt; <strong> ระดับ </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> คุณยังสามารถวาดเส้นตรงเพื่อทำให้รูปภาพตรงที่สุด </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. ปรับขนาดของพื้นที่ลับคมของคุณ </h2> <p> ตอนนี้คุณรู้เกี่ยวกับการกำบังแล้ว แต่คุณรู้หรือไม่ว่าคุณสามารถลับเฉพาะพื้นที่ของรูปภาพได้ </p> <p> ในการเลือกพื้นที่ภายในรูปภาพที่ปิดบังที่คุณต้องการเพิ่มความคมชัด ให้ไปที่ <strong> ลับคม </strong> ถือ <strong> Alt </strong> ที่สำคัญและมุ่งหน้าไปที่ <strong> รัศมี </strong> . การปรับแถบเลื่อนนี้จะทำให้พื้นที่ลับคมของคุณใหญ่ขึ้นหรือเล็กลง </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> หลังจากนี้ให้ขึ้นไปที่ <strong> ลับคม </strong> บาร์. ในทำนองเดียวกัน ถือ <strong> Alt </strong> ที่สำคัญและเลื่อนตัวเลื่อนไปทางขวา วิธีนี้จะช่วยให้คุณปรับความคมชัดบริเวณเฉพาะของรูปภาพได้ง่ายขึ้น แทนที่จะปรับให้ทั้งภาพ </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. ใช้เส้นโค้งจุดสี </h2> <p> หากสีของรูปภาพดูไม่ถูกต้องแม้จะปรับไวต์บาลานซ์แล้ว คุณอาจต้องการตรวจสอบเส้นโค้งจุดสีใน Lightroom คุณสามารถใช้สิ่งเหล่านี้เพื่อปรับสีบางสีในภาพของคุณ </p> <p> คุณจะพบแผงโค้งสีที่แตกต่างกันสามแบบในแอป: สีแดง สีน้ำเงิน และสีเขียว </p> <p> หากต้องการไปยังเส้นโค้งสีเหล่านี้ ให้เลื่อนลงไปที่ <strong> จุดโค้ง </strong> . จากนั้นคลิกที่สีที่คุณต้องการเปลี่ยน จากนั้นคุณสามารถเล่นกับสีได้แบบเดียวกับที่คุณใช้ในมาตรฐาน <strong> จุดโค้ง </strong> แท็บ </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. พิมพ์ตัวเลขสำหรับตัวเลื่อนแต่ละตัวและปรับแต่งตามนั้น </h2> <p> บ่อยครั้ง ช่างภาพหน้าใหม่จะตื่นเต้นกับตัวเลือกการแก้ไขที่มีอยู่มากมาย เมื่อพวกเขาเปิด Lightroom พวกเขาจะเลื่อนแต่ละแถบไปในทิศทางใดทิศทางหนึ่งมากเกินไป แต่แทนที่จะปรับปรุงภาพลักษณ์ กลับกลายเป็นปัญหาที่แก้ไขมากเกินไป </p> <p> เมื่อแก้ไขรูปภาพ สิ่งสำคัญคือการเปลี่ยนแปลงเล็กน้อย เป็นไปได้ว่าคุณเป็นช่างภาพที่ดีอยู่แล้ว และภาพที่คุณถ่ายก็ต้องการการปรับแต่งเล็กน้อยหลังการถ่ายทำ </p> <p> </p> <p> แทนที่จะเลื่อนแต่ละแถบเลื่อนอย่างอิสระ ให้ลองเปลี่ยนตัวเลขในพื้นที่ที่คุณต้องการเปลี่ยนด้วย <strong> +10 </strong> หรือ <strong> -10 </strong> . หากคุณคิดว่าจำเป็นต้องทำงานมากกว่านี้ ให้ทำขั้นตอนนี้ซ้ำ </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> เมื่อคุณรู้สึกว่าคุณอยู่ใกล้กัน ให้ค่อยๆ เลื่อนแถบเลื่อนแต่ละตัวไปทางซ้ายหรือขวาจนกว่าคุณจะพอใจ </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. ครอบตัดรูปภาพของคุณ </h2> <p> การครอบตัดอาจดูเหมือนชัดเจน แต่ช่างภาพจำนวนมากยังคงใช้คุณสมบัตินี้น้อยเกินไป สิ่งสำคัญคือต้องครอบตัดรูปภาพของคุณโดยขึ้นอยู่กับตำแหน่งที่คุณจะใช้ มิฉะนั้นพวกเขาจะบิดเบี้ยว </p> <p> หากต้องการครอบตัดรูปภาพ ให้ไปที่ <strong> ครอบตัด </strong> ไอคอน. ซึ่งสูงเป็นอันดับสองจากด้านบน ไปที่ <strong> อัตราส่วนภาพ </strong> เพื่อเปลี่ยนขนาด และลากมุมเพื่อกำจัดวัตถุที่ไม่ต้องการ </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> หลังจากครอบตัดเสร็จแล้ว ให้กด <strong> ป้อน </strong> บนคอมพิวเตอร์ของคุณ แล้วการเปลี่ยนแปลงจะมีผล </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. ใช้ฮิสโตแกรม </h2> <p> ฮิสโตแกรมของ Lightroom นั้นง่ายต่อการมองข้าม แต่จำเป็นต้องรู้ กราฟขนาดเล็กนี้จะแสดงให้คุณเห็นว่าสีและแสงในภาพของคุณไม่เท่ากัน ช่วยให้คุณสร้างการแก้ไขที่สะอาดขึ้นได้ </p> <p> ตามกฎทั่วไป รูปภาพที่แก้ไขอย่างดีจะมีจุดแหลมเล็กน้อยบนฮิสโตแกรม บางครั้งก็หลีกเลี่ยงไม่ได้ แต่โดยทั่วไปแล้ว คุณควรพยายามทำให้กราฟมีความสม่ำเสมอมากที่สุด </p> <p> ขึ้นอยู่กับเวอร์ชันของ Lightroom ที่คุณใช้ คุณสามารถจัดการฮิสโตแกรมโดยตรงมากหรือน้อยได้ ใน Lightroom Classic คุณสามารถคลิกที่ฮิสโตแกรมและแม้กระทั่งสิ่งต่างๆ ออกโดยเลื่อนไปที่บางส่วน </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> ใน Creative Cloud ฮิสโตแกรมจะมองเห็นได้เช่นเดียวกันที่มุมบนขวา แต่คุณต้องเปลี่ยนตัวเลื่อนเองเพื่อให้ฮิสโตแกรมเคลื่อนที่ </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> บนแพลตฟอร์มทั้งสองเวอร์ชัน ฮิสโตแกรมจะอยู่ที่ด้านบนของหน้าจอเหนือฟังก์ชันการแก้ไข </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> การแก้ไขที่ยอดเยี่ยมไม่ได้มีไว้สำหรับมือโปรเท่านั้น </h2> <p> Lightroom เป็นซอฟต์แวร์ตัดต่อที่ยอดเยี่ยมสำหรับทุกคนที่ต้องการยกระดับการถ่ายภาพไปอีกระดับ และแม้ว่าคุณจะไม่เคยใช้แพลตฟอร์มนี้มาก่อน คุณก็ไม่จำเป็นต้องกังวล เพราะเรียนรู้ได้ง่าย </p> <p> เมื่อแก้ไขรูปภาพใน Lightroom จำไว้ว่าให้น้อยแต่มาก นอกจากการพิจารณาเคล็ดลับเหล่านี้แล้ว คุณควรถอยกลับหลังจากแก้ไขแล้วกลับมาใหม่ในภายหลังเพื่อดูว่ามีการแก้ไขอย่างที่คุณคิด </p>"}