{"title":"วิธีการติดตั้งตัวควบคุมประตูโรงรถอัจฉริยะ","content":"<p> คุณต้องการควบคุมประตูโรงรถด้วยสมาร์ทโฟนหรือแท็บเล็ตหรือไม่? ตัวควบคุมอัจฉริยะเป็นตัวเลือกที่ดีหากคุณติดตั้งที่เปิดประตูโรงรถในบ้านของคุณแล้ว </p> <p> เราจะแสดงวิธีการติดตั้งตัวควบคุมประตูโรงรถอัจฉริยะ </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> ความแตกต่างระหว่างตัวเปิดและตัวควบคุม </h2> <p> มีความแตกต่างหลักสองประการระหว่างที่เปิดประตูโรงรถอัจฉริยะและตัวควบคุม อย่างแรกคือขนาด </p> <p> openers ส่วนใหญ่มีขนาดใหญ่และติดตั้งกับเพดานโรงรถของคุณ พวกเขาใช้รางเพื่อเปิดและปิดประตู ในทางกลับกัน ตัวควบคุมประตูโรงรถเป็นหน่วยอิเล็กทรอนิกส์ขนาดเล็กที่ให้คุณควบคุมที่เปิดโดยใช้แอพบนอุปกรณ์อัจฉริยะ </p> <p> ความแตกต่างที่สองระหว่างผลิตภัณฑ์ทั้งสองนี้คือราคา ที่เปิดประตูโรงรถมีราคาประมาณ 300 เหรียญ การติดตั้ง openers เหล่านี้มักต้องการความช่วยเหลือจากผู้ติดตั้งมืออาชีพ </p> <p> อย่างไรก็ตาม คอนโทรลเลอร์ไม่จำเป็นต้องติดตั้งแบบมืออาชีพ แต่ตัวควบคุมจะทำหน้าที่เป็นส่วนเสริมของตัวเปิดที่คุณมีอยู่ </p> <p> ซึ่งหมายความว่าในราคาเพียงเศษเสี้ยวของที่เปิดใหม่ คุณสามารถใช้งานฟังก์ชันเดียวกันได้เพียงแค่ใช้คอนโทรลเลอร์ </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> ประตูโรงรถอัจฉริยะมีประโยชน์อย่างไร? </h2> <p> ประโยชน์หลักสามประการของการมีประตูโรงรถอัจฉริยะ </p> <ul> <li> <strong> ความปลอดภัย </strong> —ประตูโรงรถอัจฉริยะช่วยให้คุณเปิดและปิดประตูได้จากทุกที่ </li> <li> <strong> ความปลอดภัย </strong> —ที่เปิดประตูโรงรถและตัวควบคุมที่ชาญฉลาดส่วนใหญ่จะเตือนคุณเมื่อโรงรถของคุณถูกเปิดในระยะเวลาที่กำหนด </li> <li> <strong> ความสะดวกสบาย </strong> —หากคุณเคยต้องกลับบ้านเพื่อปิดประตูโรงรถ การมีแอพประตูโรงรถอัจฉริยะจะช่วยประหยัดเวลา แทนที่จะขับรถกลับบ้าน แค่ดึงโทรศัพท์ของคุณออกมา </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> วิธีการติดตั้งตัวควบคุมประตูโรงรถอัจฉริยะ </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> หากคุณตัดสินใจว่าตัวควบคุมประตูโรงรถอัจฉริยะเหมาะกับคุณแล้ว คู่มือนี้จะแสดงวิธีการติดตั้ง ในการสาธิตนี้ a <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> มีรอส MSG100 </a> ใช้แล้ว แต่กระบวนการนี้จะคล้ายคลึงกันหากใช้ยี่ห้ออื่น ศึกษาเอกสารของผู้ควบคุมสำหรับรายละเอียด </p> <h3 id=\"what-you-ll-need\"> สิ่งที่คุณต้องการ </h3> <ul> <li> ตัวควบคุมโรงรถอัจฉริยะ </li> <li> ปืนเย็บกระดาษหรือที่ยึดสายไฟ </li> <li> ประตูโรงรถพร้อมระบบเปิดอัตโนมัติ </li> <li> ฟิลิปส์และไขควงปากแบน </li> <li> บันได </li> </ul> <h3 id=\"plan-the-installation\"> 1. วางแผนการติดตั้ง </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> ก่อนที่คุณจะติดตั้งคอนโทรลเลอร์ คุณจะต้องสำรวจบางจุดในโรงรถของคุณ อย่างแรกคือแหล่งพลังงานสำหรับคอนโทรลเลอร์ อย่างที่สองคือทางเดินสายไฟจากคอนโทรลเลอร์ไปยังเซ็นเซอร์ที่ติดประตูที่รวมอยู่ในชุดอุปกรณ์ของคุณ และที่สามคือตำแหน่งของเซ็นเซอร์แม่เหล็ก </p> <p> เซ็นเซอร์แม่เหล็กนี้ช่วยให้ผู้ควบคุมรู้ว่าประตูเปิดหรือปิดเมื่อใด </p> <p> ตัวควบคุมส่วนใหญ่ใช้สายไฟยาวเพื่อเชื่อมต่อกับเซ็นเซอร์ประตู คุณจะต้องเดินสายไฟนี้ข้ามเพดานหรือตามผนังเพื่อกันสายไฟให้พ้นทาง </p> <p> เมื่อคุณวางแผนการติดตั้งแล้ว ให้ทดสอบสายเซ็นเซอร์จากตัวควบคุมไปยังตำแหน่งเซ็นเซอร์พอดี การทดสอบพอดีนี้ช่วยให้มั่นใจได้ว่าสายเซ็นเซอร์ของคุณไปถึงตัวควบคุมของคุณ </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. ปิดไฟที่เปิดประตูโรงรถของคุณ </h3> <p> ประตูโรงรถส่วนใหญ่เสียบปลั๊กไฟไว้ที่เพดาน สำหรับ openers เหล่านั้น คุณจะต้องแน่ใจว่าได้ถอดปลั๊กออกก่อนที่จะดำเนินการต่อ </p> <p> หากที่เปิดของคุณไม่มีปลั๊กและเสียบกับสายไฟที่ออกมาจากเพดานแทน คุณจะต้องหากล่องเบรกเกอร์และปิดไฟที่ที่เปิดอยู่ </p> <p> <strong> บันทึก: </strong> กระแสไฟในบ้าน 120 โวลต์อาจทำให้ได้รับบาดเจ็บสาหัส หากคุณไม่สะดวกในการทำงานกับไฟฟ้า ให้หยุดและปรึกษาช่างติดตั้งประตูโรงรถมืออาชีพและ/หรือช่างไฟฟ้า </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. เชื่อมต่อสายไฟที่รวมเข้ากับคอนโทรลเลอร์ </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> ในยูนิต Meross มีชุดสายไฟสีน้ำเงินและสีน้ำตาลที่ต้องติดตั้งในคอนโทรลเลอร์เพื่อเชื่อมต่อกับที่เปิดประตูโรงรถ เปิดฝาพลาสติกบนตัวควบคุม แล้วคุณจะเห็นขั้วสกรูสองตัว </p> <p> ใช้ไขควงปากแบนขนาดเล็กคลายสกรูที่ขั้วแต่ละขั้ว ใส่สายไฟและขันสกรูให้แน่น ไม่สำคัญว่าจะไปสายไหน </p> <p> ดึงสายไฟเบาๆ เพื่อให้แน่ใจว่าปลอดภัย จากนั้นเปลี่ยนฝาครอบตัวควบคุม </p> <h3 id=\"mount-the-garage-door-controller\"> 4. ติดตั้งตัวควบคุมประตูโรงรถ </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> เนื่องจากคุณได้วางแผนสถานที่ของคุณแล้ว ตอนนี้ก็ถึงเวลาติดตั้งคอนโทรลเลอร์ของคุณแล้ว ตรวจสอบให้แน่ใจว่าคอนโทรลเลอร์อยู่ในตำแหน่งที่สามารถเข้าถึงพลังงานที่ต้องการได้โดยไม่ทำให้เกิดความเครียดกับสายไฟ </p> <p> ถัดไป นำแผ่นรองเหนียวบนตัวควบคุมออก แล้วกดเข้าที่ หากคุณมีตัวควบคุมที่มีสกรูยึด ให้ใช้ไขควงเพื่อยึดตัวควบคุมให้เข้าที่ </p> <h3 id=\"mount-the-sensor\"> 5. ติดตั้งเซนเซอร์ </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> ถัดไป คุณจะต้องติดตั้งเซ็นเซอร์สำหรับประตู ขอแนะนำให้วางเซ็นเซอร์นี้ในที่ที่ไม่กีดขวางทางเดินของประตู </p> <p> นอกจากนี้ คุณอาจถูกล่อลวงให้ติดตั้งเซ็นเซอร์ไว้ใกล้พื้น ไม่แนะนำ เนื่องจากน้ำที่สาดโดยตรงบนเซ็นเซอร์ซ้ำๆ อาจทำให้เกิดความเสียหายได้ เมื่อคุณได้ตำแหน่งเซ็นเซอร์แล้ว ให้ใช้เทปกาวสองหน้าหรือสกรูที่ให้มาเพื่อยึดให้แน่น </p> <p> ในภาพด้านบน เซ็นเซอร์สีดำถูกติดตั้งไว้ข้างประตูโรงรถโดยติดส่วนแม่เหล็กไว้ที่ประตู เซ็นเซอร์นี้ใช้เทปกาวสองหน้าในการติดตั้ง </p> <h3 id=\"connect-the-sensor-wires\"> 6. เชื่อมต่อสายเซนเซอร์ </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> ตอนนี้ได้เวลาเชื่อมต่อสายไฟเข้ากับเซ็นเซอร์และตัวควบคุมแล้ว ใช้แผนที่คุณทำในขั้นตอนแรก เดินสายไฟและใช้ปืนหลักเพื่อยึดสายไฟกับผนังหรือเพดาน </p> <p> ระวังอย่าหนีบหรืองอสายไฟเพราะอาจทำให้สายไฟเสียหายได้ เมื่อกำหนดเส้นทางแล้ว ให้ต่อขั้วต่อก้นตัวเมียสีแดงบนคอนโทรลเลอร์กับขั้วต่อก้นตัวผู้สีแดงที่ปลายสายเซ็นเซอร์ </p> <p> ถัดไป คุณจะต้องเปิดฝาที่เปิดประตูโรงรถของคุณ ควรมีสายไฟสี่เส้น กำลังไฟควบคุมสองเส้นและใช้กับตัวเครื่อง และอีกสองปุ่มควบคุมที่ผนัง </p> <p> </p> <p> โดยปกติ สายไฟเหล่านี้มาจากเพดานและควรมีขั้วจอบจีบเพื่อยึดไว้กับชุดที่เปิดประตูโรงรถ หากคุณไม่สามารถระบุได้ว่าสายไฟใดเป็นสายใด ให้หยุดและศึกษาคู่มือสำหรับเจ้าของที่เปิดประตูโรงรถของคุณ หรือปรึกษาช่างไฟฟ้าที่ผ่านการรับรอง </p> <p> หากคุณพบสายไฟ ให้ต่อสายสีน้ำตาลและสีน้ำเงินจากคอนโทรลเลอร์กับขั้วต่อบนตัวเปิดที่เชื่อมต่อกับปุ่มที่ผนัง ในภาพด้านบน สายไฟของคอนโทรลเลอร์ถูกเสียบเข้ากับขั้วต่อด้านซ้ายสุดสองขั้ว </p> <p> เมื่อเสร็จแล้ว ควรมีสายไฟสองเส้นต่อเข้ากับขั้วต่อปุ่มที่ผนังแต่ละอัน ยึดฝาครอบสำหรับที่เปิดประตูโรงรถของคุณอีกครั้ง เสียบคอนโทรลเลอร์และที่เปิดเข้าไป และการติดตั้งควรเสร็จสมบูรณ์ </p> <p> ในขั้นตอนต่อไป คุณจะต้องเชื่อมต่อคอนโทรลเลอร์กับเครือข่ายไร้สาย </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. เชื่อมต่อคอนโทรลเลอร์กับ Wi-Fi </h3> <p> <strong class=\"gallery__section-title\"> แกลเลอรี่ภาพ (3 ภาพ) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> ขยาย <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> ขยาย <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> ขยาย </p> <p> ปิด </p> <p> ในการตั้งค่าการเชื่อมต่อ Wi-Fi เราใช้แอพ Meross มันใช้ได้สำหรับ <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> และ <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . กระบวนการนี้ประกอบด้วยการเปิดแอป การระบุผลิตภัณฑ์ การเชื่อมต่อแอปกับ Wi-Fi การเปิดหน้าจอการตั้งค่า และอนุญาตให้ผู้ควบคุมเข้าถึงเครือข่ายของคุณ </p> <p> ที่นี่ เปิดแอพ แล้วแตะ <strong> ที่เปิดประตูโรงรถอัจฉริยะ </strong> แล้วก็ <strong> เริ่ม </strong> . เลือกผู้ผลิตและรุ่นของที่เปิดประตูโรงรถที่คุณใช้กับคอนโทรลเลอร์ ตรวจสอบให้แน่ใจว่าคุณทำตามคำแนะนำเฉพาะสำหรับแอปของคุณ </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. ตั้งค่าช่วงเวลาเปิด/ปิดช่วงเวลา </h3> <p> <strong class=\"gallery__section-title\"> แกลเลอรี่ภาพ (3 ภาพ) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> ขยาย <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> ขยาย <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> ขยาย </p> <p> ปิด </p> <p> สิ่งหนึ่งที่สำคัญที่ต้องตั้งค่าก่อนทดสอบคอนโทรลเลอร์ใหม่ของคุณคือจังหวะเวลาของที่เปิดประตูโรงรถ ในแอพ Meross คุณสามารถเลือกระหว่าง 10 วินาทีถึง 40 วินาทีในช่วงเวลาห้าวินาที หรือคุณสามารถเพิ่มการตั้งค่าแบบกำหนดเองสำหรับประตูที่ใช้เวลาเป็นวินาทีในการปิด </p> <p> กำหนดเวลาสำหรับประตูของคุณเป็นเรื่องง่าย แต่คุณต้องทำให้ถูกต้อง ระยะห่างที่สั้นเกินไปจะทำให้ประตูเปิดได้บางส่วน และการตั้งค่าที่ยาวเกินไปอาจทำให้เกิดความเครียดที่เกินควรกับมอเตอร์ของที่เปิดประตูโรงรถ </p> <p> ในการตั้งค่าช่วงเวลา คุณจะต้องใช้นาฬิกาที่มีเข็มวินาทีหรือฟังก์ชันนาฬิกาจับเวลา คุณยังสามารถใช้ตัวจับเวลาในตัวของโทรศัพท์ได้อีกด้วย เตรียมตัวจับเวลาและยืนใกล้ปุ่มเปิดประตูโรงรถของคุณ จากนั้นกดปุ่มพร้อมกันเมื่อคุณกดปุ่มเริ่มบนนาฬิกาจับเวลา หรือสังเกตเวลาบนเข็มวินาที </p> <p> รอจนกว่าประตูโรงรถของคุณจะหยุดเคลื่อนที่และบันทึกเวลา นี่คือช่วงเวลาของคุณ ถ่ายโอนข้อมูลนั้นไปยังแอพ และการตั้งค่าช่วงเวลาเสร็จสมบูรณ์ </p> <h3 id=\"test-the-garage-door-controller\"> 9. ทดสอบตัวควบคุมประตูโรงรถ </h3> <p> ใช้แอพของคุณ เปิดและปิดประตูสองสามครั้งเพื่อให้แน่ใจว่าทุกอย่างทำงาน ตอนนี้คุณน่าจะใช้ปุ่มติดผนังหรือแอปเพื่อเปิดประตูโรงรถได้แล้ว </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> เพลิดเพลินไปกับตัวควบคุมประตูโรงรถอัจฉริยะของคุณ </h2> <p> การนำเทคโนโลยีบ้านอัจฉริยะของคุณมาสู่ประตูโรงรถไม่ต้องเสียค่าใช้จ่ายมากมาย </p> <p> การติดตั้งตัวควบคุมประตูโรงรถอัจฉริยะใหม่ช่วยให้คุณและครอบครัวมีความยืดหยุ่น ความปลอดภัย ความปลอดภัย และความสะดวกสบายมากขึ้นสำหรับบ้านของคุณ นอกจากนี้ยังให้ความอุ่นใจที่มาพร้อมกับการรู้ว่าประตูโรงรถของคุณสามารถควบคุมได้จากแทบทุกที่ </p>"}