{"title":"วิธีแก้ไข VIDEO_TDR_FAILURE BSOD ใน Windows 10","content":"<p> ข้อผิดพลาด VIDEO_TDR_FAILURE แสดงว่าการ์ดแสดงผลของคุณเสีย หรือไดรเวอร์การแสดงผลอาจล้าสมัย/ทำงานผิดปกติ แต่อาจมีสาเหตุอื่นๆ เช่น ส่วนประกอบที่มีความร้อนสูงเกินไปหรือไฟล์ระบบเสียหาย TDR ย่อมาจาก <strong> การหมดเวลา การตรวจจับ และการกู้คืน </strong> ซึ่งเป็นวิธีการที่ Windows ใช้ในการระบุและแก้ไขส่วนประกอบซอฟต์แวร์ที่ทำงานผิดปกติ </p> <p> หากคุณพบข้อผิดพลาดนี้ อย่ากลัวเพราะวิธีการต่อไปนี้จะแก้ไขข้อผิดพลาด VIDEO_TDR_FAILURE ได้เร็วกว่าที่คุณคาดไว้ </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. อัปเดตและติดตั้งไดรเวอร์จอแสดงผลอีกครั้ง </h2> <p> ดังที่กล่าวไว้ข้างต้น ข้อผิดพลาดมักเกิดจากไดรเวอร์แสดงผลทำงานผิดปกติหรือล้าสมัย ดังนั้น คุณควรอัปเดตไดรเวอร์การ์ดแสดงผลของคุณ หากไม่สามารถแก้ไขได้ ให้ติดตั้งใหม่ คุณอาจพบชื่อไฟล์ต่างๆ ที่เกี่ยวข้องกับข้อผิดพลาด ทั้งนี้ขึ้นอยู่กับการ์ดกราฟิกของคุณ </p> <ol> <li> สำหรับผู้ใช้ Nvidia มันคือ <strong> nvlddmkm.sys </strong> . หากคุณเป็นผู้ใช้ Nvidia นี่คือ <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 วิธีง่ายๆ ในการแก้ไขข้อผิดพลาด </a> </li> <li> สำหรับผู้ใช้ AMD ข้อผิดพลาดจะแสดงเป็น <strong> atikmpag.sys </strong> . </li> <li> สำหรับผู้ใช้ Intel HD ข้อผิดพลาดคือ <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> วิธีอัปเดตไดรเวอร์จอแสดงผล </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> กด <strong> คีย์ Windows + R </strong> เพื่อเปิดคำสั่ง Run พิมพ์ <strong> devmgmt.msc </strong> และกด Enter </li> <li> ใน <strong> ตัวจัดการอุปกรณ์ </strong> หน้าต่าง นำทางไปยัง <strong> อะแดปเตอร์แสดงผล </strong> และขยายมัน </li> <li> คลิกขวาที่การ์ดแสดงผลของคุณ จากนั้นเลือก <strong> อัพเดทไดรเวอร์ </strong> . </li> <li> เลือก <strong> ค้นหาซอฟต์แวร์ไดรเวอร์ที่อัปเดตโดยอัตโนมัติ </strong> . </li> <li> Windows จะค้นหาเว็บโดยอัตโนมัติและดาวน์โหลดไดรเวอร์ที่จำเป็น โปรดตรวจสอบให้แน่ใจว่าคุณมีการเชื่อมต่ออินเทอร์เน็ตขณะดำเนินการดังกล่าว </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> วิธีการติดตั้งไดรเวอร์จอแสดงผลอีกครั้ง </h3> <p> หากความล้มเหลวของวิดีโอ tdr BSOD ยังคงอยู่หลังจากอัปเดตไดรเวอร์การแสดงผล แนะนำให้ติดตั้งไดรเวอร์เหล่านี้ใหม่ ขอแนะนำให้ทำเช่นนี้ในขณะที่ Windows บูทเข้าสู่เซฟโหมด แต่ก่อนที่จะดำเนินการดังกล่าว คุณควรไปที่เว็บไซต์ของผู้ผลิตการ์ดกราฟิกและดาวน์โหลดไดรเวอร์กราฟิกเวอร์ชันล่าสุด </p> <p> การผลิตที่พบมากที่สุดคือ <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> , และ <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> อินเทล </a> . </p> <p> ในการบูตเข้าสู่เซฟโหมด ให้ทำตามขั้นตอนเหล่านี้: </p> <ol> <li> กด <strong> คีย์ Windows + R, </strong> และในกล่องโต้ตอบ Run ให้พิมพ์ <strong> msconfig, </strong> และกด Enter </li> <li> ใน <strong> การกำหนดค่าระบบ </strong> หน้าต่าง คลิกที่ <strong> บูต </strong> แท็บ </li> <li> ตอนนี้ทำเครื่องหมาย <strong> โหมดปลอดภัย </strong> ช่องทำเครื่องหมายที่อยู่ด้านล่าง </li> <li> ใช้การตั้งค่าและรีสตาร์ทเครื่องคอมพิวเตอร์ของคุณ </li> </ol> <p> หลังจากบูตเข้าสู่เซฟโหมด ก็ถึงเวลาติดตั้งไดรเวอร์การแสดงผลอีกครั้ง </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> ในแถบค้นหาเมนูเริ่ม ให้พิมพ์ <strong> ตัวจัดการอุปกรณ์ </strong> และเปิดมัน </li> <li> มองหา <strong> อะแดปเตอร์แสดงผล </strong> และขยายเมนู </li> <li> คลิกขวาที่ GPU ของคุณแล้วคลิก <strong> ถอนการติดตั้งอุปกรณ์ </strong> . </li> <li> ในวิซาร์ดการถอนการติดตั้ง ตรวจสอบให้แน่ใจว่าได้ตรวจสอบ <strong> ลบซอฟต์แวร์ไดรเวอร์สำหรับอุปกรณ์นี้ </strong> กล่อง. </li> <li> รอให้ Windows ถอนการติดตั้งอุปกรณ์และรีสตาร์ทเครื่องคอมพิวเตอร์ของคุณ </li> <li> ตอนนี้ ติดตั้งไดรเวอร์กราฟิกที่คุณดาวน์โหลดไว้ก่อนหน้านี้อีกครั้ง </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. ใช้ SFC เพื่อสแกนและแก้ไขไฟล์ระบบ </h2> <p> SFC เป็นยูทิลิตี้ Windows ในตัวที่สามารถใช้เพื่อสแกนและแก้ไขไฟล์ระบบที่เสียหาย ในกรณีของ BSOD มีโอกาสสูงที่ไฟล์ระบบบางไฟล์อาจเสียหาย ดังนั้นการเรียกใช้ยูทิลิตี้นี้จึงมีความจำเป็น มันเป็นเพียงหนึ่งใน <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> ยูทิลิตี้ที่มีประโยชน์หลายอย่างที่มีอยู่ </a> สำหรับผู้ใช้ Windows </p> <p> ในการเรียกใช้ SFC เพียงทำตามขั้นตอนเหล่านี้: </p> <ol> <li> ในแถบค้นหาเมนูเริ่ม ให้พิมพ์ <strong> cmd </strong> . </li> <li> คลิกขวาที่ <strong> พร้อมรับคำสั่ง </strong> และเลือก <strong> เรียกใช้ในฐานะผู้ดูแลระบบ </strong> . </li> <li> ในคอนโซล พิมพ์ <strong> sfc /scannow </strong> และกด Enter </li> <li> หลังจากขั้นตอนการสแกนและซ่อมแซมเสร็จสิ้น ให้รีบูตเครื่องคอมพิวเตอร์ </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. เรียกใช้การซ่อมแซมการเริ่มต้น </h2> <p> สำหรับผู้ใช้ที่ได้รับข้อผิดพลาดทันทีที่บูต Windows 10 หรือหลังจากลงชื่อเข้าใช้ไม่นาน การซ่อมแซมการเริ่มต้นระบบจะมาจากสวรรค์ ฟีเจอร์ของ Windows นี้จะตรวจหาความผิดปกติระหว่างการเริ่มต้นระบบและแก้ไขได้ทันที </p> <p> เนื่องจากส่วนนี้มุ่งเป้าไปที่ผู้ใช้ที่มีการแสดงผลคอมพิวเตอร์ที่ไม่สามารถใช้งานได้เนื่องจากข้อผิดพลาด กล่าวคือ ไม่สามารถเปิดได้ <strong> การตั้งค่า </strong> พวกเขาจะต้องฮาร์ดรีบูตเพื่อเข้าสู่ Windows Recovery Environment (winRE) </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> ทำตามขั้นตอนเหล่านี้เพื่อบูตเข้าสู่ Windows Recovery Environment: </p> <ol> <li> กดปุ่มเปิด/ปิดค้างไว้จนกว่าพีซีของคุณจะปิด </li> <li> กดปุ่ม Power อีกครั้งเพื่อบู๊ตพีซีของคุณ </li> <li> ทำซ้ำขั้นตอนแรกและขั้นตอนที่สองจนกว่าพีซีจะบู๊ตเข้าสู่โหมดการกู้คืน มันจะเป็นจอฟ้า </li> <li> ในหน้าจอการกู้คืน ให้คลิกที่ <strong> ดูตัวเลือกการซ่อมขั้นสูง </strong> . </li> <li> ในหน้าจอถัดไป ให้คลิกที่ <strong> แก้ไขปัญหา </strong> </li> <li> คลิกที่ <strong> ตัวเลือกขั้นสูง </strong> </li> <li> คลิกที่ <strong> การเริ่มต้นการซ่อมแซม </strong> และป้อนข้อมูลประจำตัวของคุณเมื่อได้รับแจ้ง </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. เปลี่ยนการตั้งค่าการจัดการพลังงานของคุณ </h2> <p> การตั้งค่าการจัดการพลังงานของ Windows มักจะได้รับการปรับให้เหมาะสมดี แต่บางครั้งอาจรบกวนวิธีที่คอมพิวเตอร์ของคุณจัดการกับกราฟิก โดยเฉพาะอย่างยิ่งเมื่อคอมพิวเตอร์มี GPU ที่รอบคอบ การตั้งค่าที่เหมาะสมที่สุดเพื่อหลีกเลี่ยงการรับ VIDEO_TDR_FAILURE BSOD แสดงไว้ด้านล่าง: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> ในแถบค้นหาเมนูเริ่ม ให้พิมพ์ <strong> แผงควบคุม </strong> และเปิดมัน </li> <li> ในแถบค้นหาของแผงควบคุม ให้ป้อน &quot;ตัวเลือกพลังงาน&quot; แล้วกด Enter </li> <li> คลิกที่ <strong> ตัวเลือกด้านพลังงาน, </strong> และถัดจากแผนการใช้พลังงานที่คุณใช้อยู่ ให้คลิกที่ <strong> เปลี่ยนการตั้งค่าแผน </strong> </li> <li> คลิกที่ <strong> เปลี่ยนการตั้งค่าพลังงานขั้นสูง </strong> </li> <li> มองหา <strong> PCI E </strong><strong> xpress </strong> และขยายมัน </li> <li> หมุน <strong> เชื่อมโยงการจัดการพลังงานของรัฐ </strong> ตั้งเป็น <strong> ปิด </strong> . </li> <li> บันทึกการเปลี่ยนแปลงและรีบูตเครื่องคอมพิวเตอร์ของคุณ </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. ทำความสะอาดคอมพิวเตอร์ของคุณ </h2> <p> ความร้อนสูงเกินไปไม่ใช่สิ่งที่ดี และโดยปกติสาเหตุเบื้องหลังคือการสะสมของฝุ่น ขอแนะนำให้ผู้ใช้ทำความสะอาดส่วนประกอบพีซีจากฝุ่นทุกเดือน แต่ต้องระวัง ก็ควรทำอย่างเบามือ </p> <p> ตรวจสอบให้แน่ใจว่าได้ทำความสะอาดส่วนบนของกราฟิกการ์ด พัดลม CPU หน่วยจ่ายไฟ และพัดลมตู้ สรุปแล้วต้องหลีกเลี่ยง <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> ข้อผิดพลาดในการบำรุงรักษาที่อาจสร้างความเสียหายให้กับส่วนประกอบที่มีราคาแพง </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. ตรวจสอบส่วนประกอบฮาร์ดแวร์ </h2> <p> หากข้อผิดพลาดยังคงปรากฏขึ้นหลังจากพยายามทำทุกอย่างตามรายการข้างต้น แสดงว่าฮาร์ดแวร์อาจมีปัญหา ผู้ใช้ที่มีการ์ดแสดงผลเฉพาะควรถอดออกและบูตเครื่องคอมพิวเตอร์ หากข้อผิดพลาดได้รับการแก้ไข แสดงว่าเป็นความผิดพลาดของฮาร์ดแวร์ในตัว GPU คุณสามารถลองติดต่อผู้ผลิตและลองเปลี่ยนเครื่องของคุณ </p> <p> </p> <p> เมื่อใช้กราฟิกออนบอร์ด ให้ลองปิดการใช้งานและบู๊ต หากต้องการปิดใช้งาน ให้ทำตามขั้นตอนเหล่านี้: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> กด <strong> คีย์ Windows +R, </strong> พิมพ์ <strong> devmgmt.msc </strong> ในกล่องข้อความเรียกใช้แล้วกด Enter </li> <li> ใน <strong> ตัวจัดการอุปกรณ์ </strong> , มองหา <strong> อะแดปเตอร์แสดงผล </strong> และขยายเมนู </li> <li> คลิกขวาที่ GPU ออนบอร์ดของคุณแล้วคลิก <strong> ปิดการใช้งานอุปกรณ์ </strong> . </li> <li> รีบูตเครื่องคอมพิวเตอร์และตรวจสอบว่าข้อผิดพลาดได้รับการแก้ไขหรือไม่ </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> ข้อผิดพลาด &quot;วิดีโอ TDR ล้มเหลว&quot; ได้รับการแก้ไขเรียบร้อยแล้ว </h2> <p> สำหรับผู้ใช้ส่วนใหญ่ การอัปเดตหรือติดตั้งไดรเวอร์จอแสดงผลใหม่อย่างง่ายจะช่วยแก้ไขปัญหาได้ แต่ถ้าแย่กว่านั้น คุณอาจต้องรีเซ็ตพีซีหรือเปลี่ยนฮาร์ดแวร์บางตัว </p>"}