{"title":"วิธีดำเนินการคลีนบูตใน Windows 10","content":"<p> คุณอาจมีแอปพลิเคชันของบริษัทอื่นจำนวนมากติดตั้งอยู่ในคอมพิวเตอร์ Windows ของคุณ ไม่ต้องกังวลคนส่วนใหญ่ทำ </p> <p> ตั้งแต่การทำงานพื้นฐาน เช่น การท่องเว็บไปจนถึงการกำหนดบรรทัดโค้ดที่ซับซ้อน ผู้คนชอบใช้แอปพลิเคชันอื่นจากแอปพลิเคชันที่มีอยู่ภายใน Windows แม้ว่าแอปพลิเคชันเหล่านี้จะทำให้ชีวิตของเราง่ายขึ้น แต่บางครั้งก็รบกวนการทำงานของระบบ สิ่งเหล่านี้อาจมีตั้งแต่อุบัติเหตุเล็กน้อยไปจนถึงข้อผิดพลาดร้ายแรงและ BSOD </p> <p> นี่คือจุดที่คลีนบูตเข้าสู่รูปภาพ </p> <h2 id=\"what-is-a-windows-clean-boot-anyway\"> Windows Clean Boot คืออะไร? </h2> <p> คลีนบูตของ Windows 10 ช่วยให้ผู้ใช้สามารถแยกแยะแอปพลิเคชันของบุคคลที่สามที่เป็นสาเหตุของข้อผิดพลาดได้ ทำได้โดยเพียงแค่บูตอุปกรณ์โดยปิดใช้งานแอปพลิเคชันของบุคคลที่สามทั้งหมด และแม้ว่าชื่อจะดูเหมือนเป็นคุณลักษณะของ Windows ในตัว แต่ก็ไม่ใช่ คุณต้องคลีนบูตคอมพิวเตอร์ด้วยตนเอง </p> <p> ประโยชน์ของคลีนบูตไม่ได้จำกัดอยู่เพียงการวินิจฉัยข้อผิดพลาดเท่านั้น เป็นที่รู้กันดีว่าช่วยได้เมื่อ <a href=\"https://www.makeuseof.com/tag/fix-windows-update-error-0x80070057/\" target=\"_blank\" rel=\"nofollow noopener\"> ติดตั้งการอัปเดต Windows ไม่ถูกต้อง </a> . นอกจากนี้ยังมีประโยชน์อย่างยิ่งเมื่อระบบปฏิบัติการของคุณรู้สึกเฉื่อย และคุณต้องการตรวจสอบว่าสิ่งใดที่อาจเป็นสาเหตุของปัญหา </p> <p> </p> <p> </p> <h2 id=\"how-to-clean-boot-and-fix-errors\"> วิธีคลีนบูตและแก้ไขข้อผิดพลาด </h2> <p> คลีนบูตเป็นกระบวนการที่ค่อนข้างง่ายเมื่อผู้ใช้ได้ลองแล้วสองสามครั้ง </p> <p> ก่อนที่จะแสดงรายการขั้นตอน ผู้ใช้ควรทราบว่าการดำเนินการบางอย่างต้องใช้สิทธิ์ของผู้ดูแลระบบ คอมพิวเตอร์ของคุณอาจไม่ทำงานในแบบที่คุณคุ้นเคย แต่ก็ไม่จำเป็นต้องทำให้เหนื่อย สิ่งนี้เกิดขึ้นเพราะบางครั้งผู้ใช้ไม่รู้ด้วยซ้ำว่าซอฟต์แวร์ของบุคคลที่สามดูแลงานเล็กน้อย </p> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-128.png\" loading=\"lazy\"> </p> <p> นี่คือขั้นตอนในการคลีนบูต Windows 10: </p> <ol> <li> ในแถบค้นหาเมนู Start ให้พิมพ์ <strong> sysconfig </strong> และคลิกที่ <strong> การกำหนดค่าระบบ </strong> . </li> <li> ใน <strong> การกำหนดค่าระบบ </strong> หน้าต่าง ไปที่ <strong> บริการ </strong> แท็บ </li> <li> ตรวจสอบ <strong> ซ่อนบริการของ Microsoft ทั้งหมด </strong> กล่อง. </li> <li> ตรวจสอบบริการทั้งหมดในรายการและคลิกที่ <strong> ปิดการใช้งานทั้งหมด </strong> อยู่ทางด้านขวาล่าง จากนั้นบันทึกและออก </li> <li> ตอนนี้เปิด <strong> ผู้จัดการงาน </strong> . คุณสามารถทำได้โดยคลิกขวาที่แถบงานแล้วเลือก <strong> ผู้จัดการงาน </strong> หรือใช้ <strong> Ctrl + Alt + ลบ </strong> . </li> <li> ใน <strong> ผู้จัดการงาน </strong> หน้าต่าง นำทางไปยัง <strong> สตาร์ทอัพ </strong> แท็บ </li> <li> เลือกบริการทั้งหมดทีละรายการแล้วคลิก <strong> ปิดการใช้งาน </strong> . </li> <li> ทางออก <strong> ผู้จัดการงาน </strong> และ <strong> เริ่มต้นใหม่ </strong> คอมพิวเตอร์ของคุณ. </li> </ol> <p> <img alt=\"Startup tab in the task manager\" src=\"images/startup-tab-task-manager-383.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"fixing-errors-with-clean-boot\"> แก้ไขข้อผิดพลาดด้วย Clean Boot </h2> <p> หลังจากทำตามขั้นตอนข้างต้นแล้ว . ของคุณ <a href=\"https://www.makeuseof.com/tag/clean-computer-original-state-reinstalling-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> พีซีจะบูตเข้าสู่สถานะที่สะอาด </a> สิ่งแรกที่ผู้ใช้ควรทำคือรอและตรวจสอบว่าข้อผิดพลาดเดิมปรากฏขึ้นอีกครั้งหรือไม่ บางครั้ง แหล่งที่มาของข้อผิดพลาดอาจเป็นไฟล์ระบบ Windows ซึ่งในกรณีนี้ข้อผิดพลาดจะปรากฏขึ้น แต่อาจใช้เวลานานกว่าที่จะเกิดขึ้นในระหว่างการบู๊ตปกติ </p> <p> หากข้อผิดพลาดไม่ปรากฏขึ้น ก็ถึงเวลาที่จะจำกัดขอบเขตผู้ต้องสงสัยให้แคบลง นี่เป็นงานที่ค่อนข้างน่าเบื่อ แต่น่าเสียดายที่วิธีที่ดีที่สุดในการทำสิ่งนี้ หากต้องการจำกัดรายการให้แคบลง ให้ทำดังต่อไปนี้: </p> <ol> <li> ขณะอยู่ในสถานะคลีนบูต ให้เปิด <strong> การกำหนดค่าระบบ </strong> . </li> <li> ภายใต้ <strong> บริการ </strong> แท็บ เลือกครึ่งบนของรายการแล้วคลิก <strong> เปิดใช้งาน </strong> . ตรวจสอบให้แน่ใจว่า <strong> ซ่อนบริการของ Microsoft ทั้งหมด </strong> กล่องถูกทำเครื่องหมาย </li> <li> เปิดแล้วจ้า <strong> ผู้จัดการงาน </strong> และไปที่ <strong> สตาร์ทอัพ </strong> แท็บ </li> <li> ในทำนองเดียวกัน ให้เปิดใช้งานบริการครึ่งบนและรีบูตเครื่องคอมพิวเตอร์ของคุณ </li> </ol> <p> หลังจากรีบูต หากข้อผิดพลาดไม่ปรากฏขึ้น คุณสามารถตัดซอฟต์แวร์และบริการที่เลือกออกจากรายชื่อผู้กระทำผิดได้ คุณจะต้องทำซ้ำขั้นตอนเหล่านี้จนกว่าคุณจะพบโปรแกรมหรือบริการที่รับผิดชอบและถอนการติดตั้ง </p> <p> </p> <h2 id=\"clean-boot-windows-10-to-isolate-errors\"> คลีนบูต Windows 10 เพื่อแยกข้อผิดพลาด </h2> <p> ตอนนี้ได้เวลารีบูต Windows 10 ตามมาตรฐานแล้ว แค่เปิด <strong> การกำหนดค่าระบบ </strong> และ <strong> ผู้จัดการงาน </strong> และเปิดใช้งานบริการและโปรแกรมทั้งหมด ขอแนะนำให้ผู้ใช้ทำคลีนบูตก่อนที่จะใช้วิธีแก้ไขขั้นสูงเมื่อ Windows ขัดข้องหรือแสดง BSOD </p>"}