{"title":"วิธีแก้ไข &quot;SYSTEM THREAD EXCEPTION NOT HANDLED&quot; BSOD Stop Code ใน Windows 10","content":"<p> &quot;SYSTEM THREAD EXCEPTION NOT HANDLED&quot; เป็นข้อผิดพลาดทั่วไปของ Windows 10 ซึ่งส่วนใหญ่เกิดจากไดรเวอร์ที่ล้าสมัยหรือเข้ากันไม่ได้ </p> <p> สิ่งที่ทำให้แก้ไขได้ยากกว่า BSOD อื่นๆ คือ ไดรเวอร์หลายตัวอาจทำให้เกิดปัญหา และบางครั้งคอมพิวเตอร์ของคุณอาจตรวจไม่พบทั้งหมด นั่นเป็นเหตุผลที่ผู้ใช้ขั้นตอนแรกควรทำเมื่อแก้ไขข้อผิดพลาดนี้คือการค้นหาไดรเวอร์ที่แน่นอนซึ่งเป็นสาเหตุของปัญหา </p> <p> นี่คือวิธีที่คุณแก้ไขข้อยกเว้นของเธรดของระบบที่ไม่ได้รับการจัดการข้อผิดพลาดใน Windows 10 </p> <h2 id=\"boot-into-safe-mode\"> 1. บูตเข้าสู่เซฟโหมด </h2> <p> ขั้นตอนแรกที่ผู้ใช้ควรทำก่อนที่จะพยายามแก้ไขปัญหานี้คือการบูตคอมพิวเตอร์เข้าสู่เซฟโหมด ขึ้นอยู่กับค่ากำหนดของคุณและคุณสามารถบูตคอมพิวเตอร์เข้าสู่หน้าจอลงชื่อเข้าใช้ได้หรือไม่ มีหลายวิธีในการดำเนินการนี้: </p> <h3 id=\"boot-into-safe-mode-via-settings\"> บูตเข้าสู่เซฟโหมดผ่านการตั้งค่า </h3> <ol> <li> คลิกที่ <strong> เริ่ม </strong> ปุ่ม จากนั้นเลือก <strong> การตั้งค่า </strong> . </li> <li> นำทางไปยัง <strong> อัปเดต &amp; ความปลอดภัย </strong> จากนั้นคลิกที่ <strong> การกู้คืน </strong> . </li> <li> ภายใต้ <strong> การเริ่มต้นขั้นสูง </strong> คลิกที่ <strong> เริ่มต้นใหม่เดี๋ยวนี้. </strong> </li> <li> เมื่อพีซีของคุณรีสตาร์ท <strong> เลือกตัวเลือก </strong> หน้าจอควรปรากฏขึ้น </li> <li> จากที่นี่ไปที่ <strong> แก้ไขปัญหา &gt; ตัวเลือกขั้นสูง &gt; การตั้งค่าการเริ่มต้น </strong> . จากนั้นคลิกที่ <strong> เริ่มต้นใหม่ </strong> </li> <li> เมื่อพีซีของคุณรีบูท ให้กด <strong> F5 </strong> เพื่อบูตเครื่องคอมพิวเตอร์ของคุณใน <strong> เซฟโหมดพร้อมระบบเครือข่าย </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> จากหน้าจอลงชื่อเข้าใช้ </h3> <ol> <li> เพียงแค่กดค้างไว้ <strong> กะ </strong> แล้วเลือก <strong> พลัง </strong> ปุ่มตามด้วย <strong> เริ่มต้นใหม่ </strong> . </li> <li> ทำตามขั้นตอนที่ 4, 5 และ 6 จากหัวข้อด้านบน </li> </ol> <h3 id=\"from-a-blank-screen\"> จากหน้าจอว่างเปล่า </h3> <ol> <li> หากคุณไม่สามารถเข้าสู่หน้าจอลงชื่อเข้าใช้ ให้ทำตามขั้นตอนเหล่านี้ </li> <li> กดปุ่มเปิด/ปิดบนอุปกรณ์ของคุณค้างไว้ 10 วินาทีเพื่อปิดเครื่อง </li> <li> กดปุ่มเปิดปิดอีกครั้งเพื่อบู๊ต </li> <li> ทันทีที่พีซีของคุณเริ่มทำงาน กล่าวคือ โลโก้ของผู้ผลิตปรากฏขึ้น ให้กดปุ่มเปิด/ปิดอีกครั้งเป็นเวลา 10 วินาที </li> <li> กดปุ่มเปิด/ปิดเพื่อเริ่มอุปกรณ์ของคุณ </li> <li> หากทำอย่างถูกต้อง คอมพิวเตอร์ของคุณจะบูตเข้าสู่ <strong> สภาพแวดล้อมการกู้คืนของ Windows </strong> . </li> <li> ทำตามขั้นตอนที่ 4, 5 และ 6 จากส่วนแรก </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. ค้นหาไดรเวอร์ที่รับผิดชอบ </h2> <p> เนื่องจากข้อผิดพลาดมักเกิดจากไดรเวอร์ที่ทำงานผิดพลาด คุณจึงสามารถใช้บันทึกของ Windows เพื่อค้นหาว่าไดรเวอร์ใด </p> <p> โดยทำตามขั้นตอนต่อไปนี้: </p> <ol> <li> กด <strong> คีย์ Windows + R </strong> และใน <strong> วิ่ง </strong> กล่องโต้ตอบ พิมพ์ <strong> เหตุการณ์ </strong> </li> <li> ไปที่ <strong> บันทึกของ Windows </strong> เมนูแล้วขยาย จากนั้นเลือก <strong> ระบบ. </strong> </li> <li> มองหาบันทึกที่ชื่อ <strong> system_thread_exception_not_handled </strong> และคลิกที่มันเพื่อดูว่าไดรเวอร์ใดเป็นสาเหตุของปัญหา </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> โดยปกติ ไดรเวอร์ที่เกี่ยวข้องจะเป็นไดรเวอร์จอแสดงผลหรือไดรเวอร์เครือข่าย เนื่องจากสิ่งเหล่านี้เป็นสาเหตุให้เกิด BSOD นี้ หากไฟล์ที่เกี่ยวข้องเกิดขึ้นเป็น <strong> nvlddmkm.sys </strong> , สามารถดูได้ที่ <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีแก้ไขง่ายๆ </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. ย้อนกลับหรืออัปเดตไดรเวอร์ </h2> <p> คุณอาจต้องอัปเดตหรือติดตั้งไดรเวอร์ที่เกี่ยวข้องใหม่ ทั้งนี้ขึ้นอยู่กับไดรเวอร์ที่รับผิดชอบข้อผิดพลาดของเธรดระบบที่ไม่ได้จัดการ </p> <p> หากไดรเวอร์ไม่ได้รับการอัพเดตมาเป็นเวลานาน การอัพเดตไดรเวอร์มักจะสามารถแก้ไขปัญหาได้ หากไดรเวอร์ได้รับการอัปเดตเมื่อเร็วๆ นี้ อาจเป็นการดีที่สุดที่จะย้อนกลับไดรเวอร์หรือติดตั้งการอัปเดตใหม่ </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> วิธีอัปเดตไดรเวอร์ใน Windows 10 </h3> <ol> <li> กด <strong> คีย์ Windows + R </strong> แล้วพิมพ์ <strong> devmgmt.msc </strong> เพื่อเปิด <strong> ตัวจัดการอุปกรณ์ </strong> . </li> <li> นำทางไปยังอุปกรณ์ที่เกี่ยวข้องและขยายเมนู ตัวอย่างเช่น หากข้อผิดพลาดเกิดจากไดรเวอร์จอแสดงผล คุณจะต้องขยาย <strong> อะแดปเตอร์แสดงผล </strong> ตัวเลือก </li> <li> คลิกขวาที่ไดรเวอร์แล้วคลิก <strong> อัพเดทไดรเวอร์ </strong> . </li> <li> ในกล่องโต้ตอบที่เปิดขึ้น ให้คลิกที่ <strong> ค้นหาซอฟต์แวร์ไดรเวอร์ที่อัปเดตโดยอัตโนมัติ </strong> . </li> <li> Windows จะค้นหาเว็บโดยอัตโนมัติสำหรับไดรเวอร์ล่าสุดและติดตั้ง </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> วิธีย้อนกลับไดรเวอร์ใน Windows 10 </h3> <ol> <li> เปิด <strong> ตัวจัดการอุปกรณ์ </strong> และไปที่ไดรเวอร์ที่ต้องการ </li> <li> ขยายเมนูและคลิกขวาที่ไดรเวอร์ </li> <li> คลิกที่ <strong> คุณสมบัติ </strong> . </li> <li> ภายใต้ <strong> คนขับ </strong> แท็บ คลิกที่ <strong> ไดร์เวอร์ย้อนกลับ </strong> . </li> <li> Windows จะย้อนกลับเป็นไดรเวอร์เวอร์ชันล่าสุดที่มีให้โดยอัตโนมัติ </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. เปลี่ยนชื่อไฟล์ผิดพลาด </h2> <p> เมื่อดึงชื่อไฟล์ที่เกี่ยวข้องกับข้อผิดพลาดของเธรดระบบที่ไม่ได้จัดการ ผู้ใช้ควรเปลี่ยนชื่อไฟล์ การทำเช่นนี้จะทำให้ Windows สร้างสำเนาใหม่และติดตั้งใหม่ ไฟล์ไดรเวอร์อยู่ที่ <strong> C:\\ Windows\\ System32\\ ไดรเวอร์ </strong> </p> <p> ทำตามขั้นตอนเหล่านี้เพื่อเปลี่ยนชื่อไฟล์: </p> <ol> <li> เปิด <strong> File Explorer </strong> และไปที่ <strong> C:\\Windows\\System32\\drivers </strong> </li> <li> ค้นหาไดรเวอร์ที่ได้รับผลกระทบ </li> <li> คลิกที่มันและกด <strong> F2. </strong> </li> <li> แทนที่นามสกุลไฟล์ด้วย <strong> .เก่า </strong> . </li> <li> กด Enter และรีสตาร์ทเครื่องคอมพิวเตอร์ของคุณ </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. ใช้ SFC และ DISM เพื่อซ่อมแซมไฟล์ระบบ </h2> <p> SFC และ DISM เป็นเครื่องมือที่ทรงพลังสองอย่างที่มีให้สำหรับผู้ใช้ Windows ทุกคน เมื่อรวมกันแล้ว พวกเขาสามารถค้นหาและแก้ไขข้อผิดพลาดที่เกี่ยวข้องกับระบบได้เกือบทุกอย่าง พวกเขายังค่อนข้างง่ายในการดำเนินการ </p> <p> </p> <p> โปรดสร้างจุดคืนค่าระบบเนื่องจากคำสั่งเหล่านี้จะเปลี่ยนแปลงไฟล์ระบบ </p> <h3 id=\"how-to-use-dism\"> วิธีใช้ DISM </h3> <ol> <li> วิ่ง <strong> พร้อมรับคำสั่ง </strong> เป็นผู้ดูแลระบบ </li> <li> ในคอนโซล พิมพ์ <strong> DISM / ออนไลน์ / Cleanup-Image / ScanHealth </strong> และกด Enter </li> <li> รอให้ Windows สแกนเสร็จ แล้วพิมพ์ <strong> DISM /ออนไลน์ /Cleanup-image /RestoreHealth </strong> </li> <li> Windows จะแก้ไขปัญหาทั้งหมดที่พบระหว่างการสแกน </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> วิธีใช้ SFC </h3> <ol> <li> ในแถบค้นหาเมนูเริ่ม ให้พิมพ์ <strong> cmd </strong> จากนั้นคลิกขวาที่ <strong> พร้อมรับคำสั่ง </strong> และเรียกใช้ในฐานะผู้ดูแลระบบ </li> <li> ในคอนโซล ให้ป้อน <strong> sfc /scannow </strong> </li> <li> อดทนรอเพราะ Windows จะใช้เวลาสแกนและแทนที่ไฟล์ระบบที่เสียหาย </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. ใช้การคืนค่าระบบเพื่อกู้คืนพีซีของคุณ </h2> <p> หากปัญหายังไม่ได้รับการแก้ไข คุณจะต้องใช้การคืนค่าระบบเป็นทางเลือกสุดท้าย การคืนค่าระบบเป็นคุณลักษณะที่คืนค่า Windows ให้เป็นสถานะก่อนหน้า จุดคืนค่าเหล่านี้สร้างขึ้นเป็นระยะและเมื่อติดตั้งซอฟต์แวร์ใหม่ หรือคุณสามารถตั้งค่า <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows เพื่อสร้างจุดคืนค่าทุกวัน </a> </p> <h3 id=\"how-to-use-system-restore\"> วิธีใช้การคืนค่าระบบ </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> ในแถบค้นหาเมนูเริ่ม ให้พิมพ์ <strong> แผงควบคุม </strong> และคลิกเปิด </li> <li> ในแถบค้นหาของแผงควบคุม ให้ป้อน <strong> การกู้คืน </strong> และเปิดจากผลลัพธ์ </li> <li> คลิกที่ <strong> เปิดการคืนค่าระบบ </strong> . </li> <li> คลิกที่ <strong> ต่อไป </strong> และเลือกจุดคืนค่าจากรายการ </li> <li> คลิกที่ <strong> เสร็จสิ้น. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> มีการจัดการข้อยกเว้น </h2> <p> เคล็ดลับที่แสดงด้านบนช่วยให้แก้ไขความรำคาญได้ง่ายซึ่ง BSOD เช่น system_thread_exception_not_handled ทำให้เกิด ส่วนที่ดีที่สุดคือเคล็ดลับส่วนใหญ่สามารถใช้เพื่อวินิจฉัยข้อผิดพลาด Blue Screen of Death (BSOD) ทั่วไปอื่นๆ มากมายใน Windows ได้เช่นกัน </p>"}