{"title":"วิธีถ่ายภาพหน้าจอบนแท็บเล็ต Surface Pro","content":"<p> การจับภาพหน้าจอเป็นทักษะที่เรียบง่ายแต่จำเป็นบนอุปกรณ์ทุกชนิด บนแท็บเล็ต Surface Pro คุณสามารถถ่ายภาพหน้าจอโดยใช้แป้นพิมพ์ลัด เครื่องมือสนิป หรือแม้แต่ Xbox Game Bar เราจะแสดงวิธีใช้วิธีการทั้งหมดเหล่านี้ในการถ่ายภาพหน้าจอหรือแม้แต่การบันทึกหน้าจอบนอุปกรณ์ Surface ของคุณ </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> ถ่ายภาพหน้าจอโดยใช้ปุ่มผสม </h2> <p> ในกลุ่มอุปกรณ์ Surface Pro การจับภาพหน้าจอโดยใช้ปุ่มผสมกันนั้นทำได้ง่ายและรวดเร็ว หากต้องการจับภาพหน้าจอ ให้กด . ของคุณค้างไว้ <strong> พลัง </strong> และ <strong> ปรับระดับเสียงขึ้น </strong> ที่สำคัญในเวลาเดียวกัน หน้าจอควรกะพริบ และภาพหน้าจอควรบันทึกไว้ในโฟลเดอร์ภาพหน้าจอภายใต้รูปภาพบนอุปกรณ์ของคุณ </p> <p> วิธีนี้ใช้ได้กับกลุ่มผลิตภัณฑ์ Surface Pro ล่าสุด (เช่น Surface Pro 7+, Pro X), Surface Go, Surface Go 2 และสายผลิตภัณฑ์ Surface Book </p> <p> หาก Surface ของคุณเป็นรุ่นเก่า (Surface 3 หรือเก่ากว่า) การรวมปุ่มจะแตกต่างกันเล็กน้อย ต้องกด <strong> ปุ่ม Windows </strong> (ไม่ใช่คีย์ Windows บนแป้นพิมพ์ของคุณ) และปุ่ม <strong> ลดเสียงลง </strong> ปุ่มในเวลาเดียวกัน อุปกรณ์จะบันทึกภาพหน้าจอของคุณไปยังโฟลเดอร์ภาพหน้าจอภายใต้รูปถ่าย </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> ในทำนองเดียวกัน ในการจับภาพหน้าจอบน Surface Duo ของคุณ ให้กด . ค้างไว้ <strong> พลัง </strong> ปุ่มและ <strong> ลดเสียงลง </strong> สำคัญ. ภาพหน้าจอควรบันทึกไว้ในแกลเลอรีของอุปกรณ์ภายใต้ภาพหน้าจอ หรือคุณสามารถกด . ค้างไว้ <strong> พลัง </strong> ที่สำคัญและคลิกที่ปุ่ม <strong> ภาพหน้าจอ </strong> ปุ่มบนหน้าจอ </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> วิธีถ่ายภาพหน้าจอของ Surface Pro โดยใช้แป้นพิมพ์ลัด </h2> <p> แป้นพิมพ์ลัดเป็นอีกวิธีหนึ่งในการจับภาพสิ่งที่อยู่บนหน้าจอของคุณ </p> <p> แป้นพิมพ์ลัดเหล่านี้ใช้งานได้กับอุปกรณ์ Windows ทั้งหมด ดังนั้นลองดู <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีการจับภาพหน้าจออื่นๆ บน Windows 10 </a> . แป้นพิมพ์ลัดทำงานได้ดีที่สุดในกลุ่มผลิตภัณฑ์ Surface Laptop และ Surface Book แต่แน่นอนว่า หากคุณมีส่วนต่อกับแป้นพิมพ์สำหรับอุปกรณ์ Surface Pro หรือ Go แป้นพิมพ์ลัดเหล่านี้ก็ใช้ได้เช่นกัน </p> <h3 id=\"print-screen-methods\"> วิธีการพิมพ์หน้าจอ </h3> <p> ในการจับภาพหน้าจอโดยใช้วิธี Print Screen เพียงกด <strong> PrtScn </strong> ปุ่มบนแป้นพิมพ์ของคุณ การดำเนินการนี้จะจับภาพหน้าจอของเดสก์ท็อปทั้งหมดของคุณ โปรดทราบว่าการดำเนินการนี้จะไม่บันทึกภาพหน้าจอไปยัง Surface แต่จะเพิ่มลงในคลิปบอร์ด คุณต้องใช้โปรแกรมเช่น Microsoft Paint เพื่อวางภาพหน้าจอ </p> <p> กด <strong> Alt + PrtScn </strong> จะจับภาพหน้าจอของหน้าต่างปัจจุบันของคุณเท่านั้น และในทำนองเดียวกัน จะเพิ่มภาพหน้าจอไปยังคลิปบอร์ดของคุณ </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> สนิปและสเก็ตช์ </h3> <p> นี่เป็นวิธีที่ง่ายที่สุดในการถ่ายภาพหน้าจอบนอุปกรณ์ Surface ของคุณ </p> <p> ในการเปิด Snip and Sketch ให้กด press <strong> คีย์ Windows + Shift + S, </strong> และภาพซ้อนทับควรปรากฏบนหน้าจอของคุณ หากต้องการถ่ายภาพหน้าจอแบบเต็ม ให้กดปุ่มเต็มหน้าจอที่ด้านบนของโอเวอร์เลย์ ในการถ่ายภาพหน้าจอเฉพาะหน้าต่างปัจจุบันของคุณ ให้กดปุ่ม Window Snip ถัดจากปุ่ม Fullscreen </p> <p> คุณยังสามารถถ่ายภาพหน้าจอของพื้นที่เฉพาะของหน้าจอได้อีกด้วย ตามค่าเริ่มต้น Snip และ Sketch จะมี Snip แบบสี่เหลี่ยมผืนผ้า เพียงลากส่วนที่คุณต้องการจับภาพหน้าจอโดยใช้หน้าจอสัมผัสหรือแทร็คแพด </p> <p> Snip and Sketch จะแจ้งเตือนคุณในแผงการแจ้งเตือนว่ามีการคัดลอกภาพหน้าจอของคุณไปยังคลิปบอร์ดแล้ว หากคุณคลิกเข้าไป คุณสามารถวาดและสเก็ตช์ภาพหน้าจอได้หากต้องการ </p> <p> หากต้องการบันทึกลงในไฟล์ของคุณ ให้ใช้ <strong> Ctrl + S </strong> หรือปุ่มบันทึกที่มุมบนขวาเพื่อบันทึกภาพหน้าจอของคุณไปยังโฟลเดอร์เฉพาะ </p> <h3 id=\"xbox-game-bar\"> Xbox Game Bar </h3> <p> ในการจับภาพหน้าจอโดยใช้ Xbox Game Bar ให้กด <strong> คีย์ Windows + G </strong> เพื่อเปิด </p> <p> จากที่นั่น คุณสามารถคลิกแท็บการจับภาพ และคลิกปุ่มกล้อง วิธีนี้จะช่วยให้คุณสามารถจับภาพวิดีโอบนหน้าจอพร้อมเสียงได้ การจับภาพที่บันทึกไว้ของคุณจะปรากฏใต้โฟลเดอร์วิดีโอและโฟลเดอร์ย่อยการจับภาพ บน Xbox คุณสามารถในทำนองเดียวกัน <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> จับภาพหน้าจอและบันทึก </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> ถ่ายภาพหน้าจอ Surface Pro โดยใช้ปากกา Surface Surface </h2> <p> ในการถ่ายภาพหน้าจอโดยใช้ปากกา Surface ให้ดับเบิลคลิกที่ยางลบ จากนั้นอุปกรณ์ของคุณควรเปิด Snip และ Sketch ของหน้าต่างทั้งหมด จากที่นี่ คุณสามารถสเก็ตช์และส่งออกภาพหน้าจอของคุณได้ </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> คุณยังสามารถเข้าถึงสิ่งนี้ได้ด้วยการค้นหา Windows Ink Workspace บน Dock ของคุณ จากที่นี่ ให้เลือกสนิปแบบเต็มหน้าจอ คุณสามารถเปลี่ยนการทำงานของปุ่มลัดของปากกา Surface ได้โดยค้นหาการตั้งค่าพื้นที่ทำงานของ Windows Ink และเลื่อนลงมาที่ Windows Ink Workspace </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> ถ่ายภาพหน้าจอบน Surface อย่างเรียบง่าย </h2> <p> ตอนนี้คุณรู้วิธีการต่างๆ ทั้งหมดในการจับภาพหน้าจอหรือบันทึกหน้าจอบนอุปกรณ์ Surface ของคุณแล้ว การใช้ปุ่มร่วมกันเป็นวิธีที่ดีที่สุดในการจับภาพหน้าจอหากคุณใช้ Surface Pro หรือ Surface Go แต่แป้นพิมพ์ลัดก็ง่ายเช่นกัน </p>"}