{"title":"วิธีดูสถิติเวลาเล่นของคุณบน PS5","content":"<p> หากคุณสนุกกับการดูเวลาที่คุณใช้ไปในการเล่นเกม PS5 มีคุณสมบัติที่ซ่อนอยู่แต่มีประโยชน์สำหรับคุณ มันติดตามว่าคุณใช้เวลาเล่นเกมบนระบบนานเท่าใด </p> <p> วิธีตรวจสอบเวลาที่คุณใช้เล่นเกม PlayStation 5 มีดังนี้ ที่อาจกระตุ้นให้คุณ <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> ปิด PS5 ของคุณ </a> บ่อยขึ้น. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> วิธีตรวจสอบสถิติเวลาเล่นของคุณบน PlayStation 5 </h2> <p> บนหน้าจอหลักของ PS5 ให้เลือกไอคอนโปรไฟล์ของคุณที่ด้านบนขวา สามารถกด <strong> สามเหลี่ยม </strong> เพื่อย้ายส่วนที่เลือกไปยังพื้นที่ของหน้าจออย่างรวดเร็ว หลังจากคุณเปิดเมนูนั้นแล้ว ให้เลือก <strong> ข้อมูลส่วนตัว </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> ตอนนี้สลับไปที่ <strong> เกม </strong> แท็บ ที่นี่ คุณจะเห็นเกมทั้งหมดที่คุณเล่นในบัญชี PlayStation ของคุณ แต่ละอันจะแสดงเวลาล่าสุดที่คุณเล่นเกม รวมถึงชั่วโมงเล่นทั้งหมดของคุณ มันไม่แม่นยำถึงนาทีอย่างไรก็ตาม คุณจะเห็นเวลาเล่นที่ปัดเศษเป็นชั่วโมง </p> <p> คุณจะเห็นเวลาเล่นสำหรับเกม PS4 ของคุณที่นี่ แม้ว่าคุณจะไม่ได้เล่นบน PS5 ก็ตาม </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> เท่าที่เราทราบ เวลาเล่นนี้รวมเวลาทั้งหมดที่เกมกำลังดำเนินอยู่ ไม่ใช่เฉพาะเมื่อคุณกำลังเล่นอยู่ ซึ่งหมายความว่าหากคุณออกจากเกมในเมนูหยุดชั่วคราวในขณะที่คุณรับสายหรือหาอะไรกิน เวลานั้นจะถูกรวมไว้ ดังนั้นมันจึงอาจไม่ถูกต้องนัก แต่อย่างน้อยก็จะช่วยให้คุณทราบว่าคุณเล่นแต่ละเรื่องมานานแค่ไหน </p> <p> </p> <p> หากคุณสงสัย คุณสามารถดูสถิติเวลาเล่นของเพื่อนๆ ได้ เลือก <strong> เพื่อน </strong> จากหน้าจอเดียวกันและเลือกเพื่อนที่คุณต้องการเรียนรู้เพิ่มเติม นี่จะแสดงให้คุณเห็นว่าพวกเขาใช้เวลาเล่นเกมนานแค่ไหนในเมนูที่เหมือนกัน </p> <p> หากคุณไม่ต้องการให้ผู้เล่นคนอื่นเห็นข้อมูลเวลาเล่นของคุณ ให้เลื่อนไปทางขวาและเลือก <strong> การตั้งค่าความเป็นส่วนตัว </strong> . ในเมนูนั้น ภายใต้ <strong> กิจกรรมของคุณ </strong> ส่วน เปลี่ยนตัวเลือกสำหรับ <strong> ใครสามารถดูประวัติการเล่นเกมของคุณได้บ้าง </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> เกมบางเกมติดตามเวลาเล่นของตัวเองด้วย </h2> <p> หากคุณสนใจข้อมูลเช่นนี้ อย่าลืมเปิดเกมโปรดของคุณแล้วดูว่าเกมเหล่านั้นติดตามว่าคุณใช้เวลาเล่นไปเท่าไร ชื่อเรื่องจำนวนมากรวมถึงเวลาเล่นทั้งหมดในไฟล์บันทึกของคุณ ภายในเมนูหยุดชั่วคราว หรือที่คล้ายกัน </p> <p> แม้ว่าสิ่งนี้จะไม่สอดคล้องกันในเกมต่างๆ และอาจรวมหรือไม่รวมเวลาที่ใช้ในขณะที่หยุดชั่วคราว แต่ก็สามารถให้ข้อมูลเชิงลึกเกี่ยวกับเกมที่คุณต้องการทราบข้อมูลเพิ่มเติม เกมออนไลน์บางเกม เช่น Overwatch สามารถติดตามเวลาที่คุณใช้กับฮีโร่แต่ละตัวในโหมดต่างๆ </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> ดูว่าคุณเล่นเกมมากแค่ไหน </h2> <p> PS5 ทำให้ง่ายต่อการดูว่าคุณใช้เวลาเล่นเกมไปมากแค่ไหน เป็นคุณลักษณะขนาดเล็ก แต่ได้รับความชื่นชมอย่างมาก เนื่องจาก PS4 ไม่ได้ทำให้ข้อมูลนี้เข้าถึงได้ง่าย </p> <p> ในขณะเดียวกัน มีวิธีอื่นๆ ในการจัดการเกมของคุณที่เล่นนอกคอนโซลด้วยเช่นกัน </p> <p> <small> เครดิตรูปภาพ: LightField Studios/ <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}