{"title":"วิธีหยุด Windows 10 จากการบล็อกไฟล์ที่ดาวน์โหลด","content":"<p> เมื่อคุณพยายามเปิดไฟล์ Windows 10 อาจป้องกันไม่ให้คุณเปิดไฟล์โดยตรง มันจะแสดงคำเตือนด้านความปลอดภัยว่าไฟล์นั้นมาจากแหล่งที่ไม่รู้จักและอาจไม่ปลอดภัย สิ่งนี้จะเกิดขึ้นเมื่อฟีเจอร์ Windows 10 ที่เรียกว่า Attachment Manager บล็อกไฟล์ที่ถือว่าไม่ปลอดภัยสำหรับพีซี </p> <p> แม้ว่าคุณจะสามารถปลดบล็อกแต่ละไฟล์ได้ด้วยตนเอง แต่ก็อาจเป็นกระบวนการที่น่าเบื่อหน่าย โดยเฉพาะอย่างยิ่งหากคุณต้องทำเพื่อเกือบทุกไฟล์ที่คุณดาวน์โหลด ในบทความนี้ เราจะแสดงวิธีหยุด Windows 10 จากการบล็อกไฟล์ที่ดาวน์โหลด </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> ตัวจัดการไฟล์แนบใน Windows 10 คืออะไร </h2> <p> ใน Windows 10 มีคุณลักษณะด้านความปลอดภัยที่เรียกว่า Attachment Manager ซึ่งจะบล็อกคุณจากการเปิดไฟล์ที่ไม่ปลอดภัย ไฟล์เหล่านี้อาจเป็นไฟล์ที่คุณดาวน์โหลดหรือ <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> ไฟล์ที่ Windows ระบุว่าเป็นไฟล์แนบอีเมลที่ไม่ปลอดภัย </a> . หากตัวจัดการสิ่งที่แนบมาพิจารณาว่าไฟล์ไม่ปลอดภัย จะเป็นการป้องกันไม่ให้ Windows 10 เปิดขึ้นมาและแสดงข้อความเตือน ตัวจัดการไฟล์แนบจะจัดประเภทไฟล์ที่คุณดาวน์โหลดตามประเภทไฟล์และนามสกุลไฟล์ </p> <p> Windows Attachment Manager ใช้ IattachmentExecute Application Programming Interface (API) เพื่อค้นหาประเภทไฟล์ การเชื่อมโยงไฟล์ และกำหนดการดำเนินการที่เหมาะสมที่สุด เมื่อคุณดาวน์โหลดไฟล์และบันทึกลงในดิสก์ของคุณ Windows จะเพิ่มข้อมูลเมตาเฉพาะลงในไฟล์เหล่านี้ ข้อมูลเมตาเหล่านี้ถือเป็นไฟล์แนบ เมื่อ Windows เพิ่มข้อมูลเมตาให้กับไฟล์ดาวน์โหลดเป็นไฟล์แนบ สิ่งนี้เรียกว่าข้อมูลโซน </p> <p> ตอนนี้ <strong> ข้อมูลโซน </strong> เป็นที่ที่รากของเรื่องอยู่ เมื่อ File Explorer เปิดไฟล์ขึ้นมา มันจะอ่านข้อมูลโซนที่แนบมาซึ่งจัดเก็บไว้ในตำแหน่งเดียวกันและตรวจสอบว่าไฟล์นั้นมาจากแหล่งที่ไม่รู้จักหรือไม่ หาก Windows พบว่าไฟล์นั้นไม่รู้จักหรือมาจากแหล่งที่ไม่รู้จัก จะเป็นการป้องกันไม่ให้คุณเปิดไฟล์นั้น </p> <p> คำเตือน Windows SmartScreen จะปรากฏขึ้นโดยระบุว่า: </p> <blockquote> <p> Windows SmartScreen ป้องกันไม่ให้แอปที่ไม่รู้จักเริ่มทำงาน การเรียกใช้แอปนี้อาจทำให้พีซีของคุณมีความเสี่ยง </p> </blockquote> <p> หากคุณต้องการเปิดไฟล์ที่ถูกบล็อกด้วยตนเอง ให้คลิกขวาที่ไฟล์ที่ดาวน์โหลด จากนั้นเลือก <strong> คุณสมบัติ </strong> . ในแท็บทั่วไป คลิก, <strong> เลิกบล็อก </strong> , คลิก <strong> สมัคร </strong> แล้วคลิก <strong> ตกลง </strong> . </p> <p> แต่ลองจินตนาการว่าคุณต้องทำเช่นนี้ทุกครั้งที่ดาวน์โหลดไฟล์ ซึ่งอาจทำให้น่ารำคาญและใช้เวลานาน หากคุณดาวน์โหลดไฟล์จากอินเทอร์เน็ตบ่อยๆ หรือได้รับไฟล์เป็นไฟล์แนบในอีเมล คุณอาจต้องการหยุดพีซีของคุณจากการบล็อกไฟล์ของคุณโดยสิ้นเชิง </p> <p> หากต้องการหยุด Windows 10 ไม่ให้บล็อกคุณไม่ให้เปิดไฟล์ คุณต้องป้องกันไม่ให้ระบบเพิ่มข้อมูลโซนลงในไฟล์ที่คุณดาวน์โหลด คุณสามารถทำได้โดยกำหนดค่าตัวจัดการไฟล์แนบด้วยตนเองโดยใช้ Local Group Policy Editor หรือ Registry Editor </p> <p> เราจะให้ขั้นตอนเกี่ยวกับวิธีการทำเช่นนี้ คุณต้องลงชื่อเข้าใช้ในฐานะผู้ดูแลระบบหรือคุณควร <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> ขอสิทธิ์ผู้ดูแลระบบ </a> เพื่อให้สามารถหยุดไฟล์ที่ดาวน์โหลดจากการถูกบล็อก </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> กำหนดค่าตัวจัดการไฟล์แนบโดยใช้ Registry Editor </h2> <p> กด <strong> คีย์ Windows + R </strong> เพื่อเปิด Registry Editor จากนั้นพิมพ์ &quot;Regedit&quot; แล้วคลิก <strong> ป้อน </strong> . ข้อความแจ้งการควบคุมบัญชีผู้ใช้จะปรากฏขึ้น เมื่อข้อความแจ้งนี้ปรากฏขึ้น ให้คลิกที่ <strong> ใช่ </strong> ปุ่มเพื่อดำเนินการต่อ </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> ไปที่คีย์สิ่งที่แนบมาในตัวแก้ไขรีจิสทรี: <strong> HKEY_CURRENT_USER &gt; ซอฟต์แวร์ &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; นโยบาย &gt; ไฟล์แนบ </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> หากไม่มีคีย์ไฟล์แนบในคีย์นโยบาย คุณจะต้องสร้างคีย์ดังกล่าว เมื่อต้องการทำเช่นนี้ ให้คลิกขวาที่click <strong> นโยบาย </strong> ที่สำคัญ คลิก <strong> ใหม่ </strong> , คลิก <strong> สำคัญ </strong> . การดำเนินการนี้จะสร้างคีย์ใหม่ ซึ่งคุณควรตั้งชื่อว่า &quot;ไฟล์แนบ&quot; หากคุณพบว่ามีคีย์สิ่งที่แนบมาอยู่แล้ว คุณสามารถข้ามไปยังขั้นตอนถัดไปได้ </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> คลิกขวาที่ <strong> เอกสารแนบ </strong> ที่สำคัญ คลิก <strong> ใหม่ </strong> แล้วเลือก <strong> ค่า DWORD (32 บิต) </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> คุณจะถูกขอให้ตั้งชื่อค่า DWORD ที่สร้างขึ้นใหม่นี้ ตั้งชื่อว่า &quot;SaveZoneInformation&quot; แล้วคลิก <strong> ป้อน </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> สุดท้าย หากต้องการปิดใช้งานตัวจัดการไฟล์แนบใน Windows 10 ให้ดับเบิลคลิกที่ไฟล์ที่สร้างขึ้นใหม่ <strong> SaveZoneInformation </strong> ค่าและเปลี่ยนข้อมูลค่าเป็น 1 คลิก <strong> ตกลง </strong> ที่จะเสร็จสิ้น </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> เมื่อคุณทำตามขั้นตอนเหล่านี้เสร็จแล้ว ให้ปิด Registry Editor และรีสตาร์ทคอมพิวเตอร์เพื่อใช้การเปลี่ยนแปลง จากนี้ไป ไฟล์ใดๆ ที่คุณดาวน์โหลดจะไม่แนบข้อมูลโซนกับสตรีมข้อมูลสำรองของไฟล์อีกต่อไป ซึ่งจะทำให้คุณสามารถเปิดไฟล์ของคุณได้โดยไม่มีปัญหาใดๆ </p> <p> หากคุณต้องการย้อนกลับและเปิดใช้งานตัวจัดการไฟล์แนบ คุณสามารถทำได้โดยไปที่คีย์สิ่งที่แนบมาในตัวแก้ไขรีจิสทรี: <strong> HKEY_CURRENT_USER &gt; ซอฟต์แวร์ &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; นโยบาย &gt; ไฟล์แนบ </strong> . จากที่นี่ ทางด้านขวา ให้ดับเบิลคลิกที่ <strong> SaveZoneInformation </strong> ค่าและเปลี่ยนข้อมูลค่าเป็น 3 </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> กำหนดค่าตัวจัดการสิ่งที่แนบมาโดยใช้ Local Group Policy Editor </h2> <p> Local Group Policy Editor มีเฉพาะในรุ่น Windows 10 Enterprise, Education และ Pro ด้วยเหตุนี้ วิธีนี้ใช้ไม่ได้หากคุณเป็นเจ้าของ Windows 10 Home edition หากพีซีของคุณทำงานบน Windows 10 Home edition คุณจะต้องกำหนดค่าตัวจัดการไฟล์แนบผ่าน Registry Editor </p> <p> หากคุณกำลังใช้ Windows 10 รุ่นที่มี Local Group Policy Editor คุณสามารถกำหนดค่าตัวจัดการไฟล์แนบได้โดยใช้ขั้นตอนที่ระบุไว้ที่นี่ </p> <p> ในการเริ่มต้น กด <strong> คีย์ Windows + R </strong> พิมพ์ &quot;gpedit.msc&quot; แล้วคลิก, <strong> ป้อน </strong> เพื่อเปิด Local Group Policy Editor </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> ไปที่ตัวจัดการไฟล์แนบ: <strong> การกำหนดค่าผู้ใช้ &gt; เทมเพลตการดูแลระบบ &gt; คอมโพเนนต์ของ Windows &gt; ตัวจัดการไฟล์แนบ </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> ในบานหน้าต่างด้านขวาของตัวจัดการไฟล์แนบ ให้ดับเบิลคลิกที่ <strong> อย่าเก็บข้อมูลโซนไว้ในไฟล์แนบ </strong> นโยบายการแก้ไขการตั้งค่าข้อมูลโซน </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> หน้าต่างจะปรากฏขึ้นซึ่งคุณสามารถเลือกได้ว่าจะให้โปรแกรมจัดการไฟล์แนบหรือไม่ควรรักษาข้อมูลโซน </p> <p> คลิก <strong> เปิดใช้งาน </strong> เพื่อให้ตัวจัดการไฟล์แนบไม่เก็บรักษาข้อมูลโซน เพื่อให้แน่ใจว่า Windows จะไม่บล็อกไฟล์ของคุณทุกครั้งที่คุณเปิด คลิก <strong> สมัคร </strong> ปุ่มเพื่อบันทึกการเปลี่ยนแปลงแล้วคลิก <strong> ตกลง </strong> . </p> <p> เมื่อคุณทำเสร็จแล้ว ให้ปิด Local Group Policy Editor และรีบูตพีซีของคุณเพื่อบันทึกการเปลี่ยนแปลง </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows จะไม่บล็อกไฟล์ของคุณอีกต่อไป </h2> <p> หากคุณเคยต้องปลดบล็อกไฟล์ส่วนใหญ่ที่คุณดาวน์โหลดด้วยตนเองมาก่อน คุณจะรู้ว่ากระบวนการนั้นน่าเบื่อหน่ายเพียงใด เมื่อคุณใช้เคล็ดลับเหล่านี้ คุณจะมีอิสระในการเปิดไฟล์ทั้งหมดของคุณได้อย่างง่ายดาย </p> <p> หากคุณดาวน์โหลดไฟล์และไม่แน่ใจในความน่าเชื่อถือของไฟล์ คุณสามารถเปิดไฟล์เหล่านั้นในสภาพแวดล้อมที่แยกออกมาอย่างปลอดภัยเพื่อให้แน่ใจว่าพีซีและข้อมูลของคุณปลอดภัย </p>"}