{"title":"วิธีจัดการกลุ่มผู้ใช้ด้วย Groupadd บน Linux","content":"<p> การจัดการผู้ใช้ค่อนข้างตรงไปตรงมาหากคุณใช้ Linux บนคอมพิวเตอร์ส่วนบุคคลของคุณ แต่สำหรับผู้ที่มีเซิร์ฟเวอร์ที่มีผู้ใช้หลายพันคน การจัดการกลายเป็นปัญหาร้ายแรงที่ควรได้รับการดูแล </p> <p> โชคดีที่ระบบปฏิบัติการบน Linux มีวิธีการควบคุมและจัดการผู้ใช้ในระบบของคุณ คุณสามารถสร้างกลุ่มและเพิ่มผู้ใช้ในกลุ่มได้ จากนั้น แทนที่จะกำหนดสิทธิ์ให้กับผู้ใช้ทุกคนในระบบ คุณสามารถให้สิทธิ์กลุ่มผู้ใช้ได้อย่างง่ายดายโดยมอบสิทธิ์ที่เกี่ยวข้องกับเวิร์กโฟลว์ระบบให้กับพวกเขา </p> <h2 id=\"create-user-groups-on-linux\"> สร้างกลุ่มผู้ใช้บน Linux </h2> <p> Linux มาพร้อมกับคำสั่งเริ่มต้นสำหรับการสร้างกลุ่มผู้ใช้ คุณสามารถใช้ <strong> groupadd </strong> คำสั่งเพื่อเพิ่มกลุ่มใหม่ในระบบของคุณ ไวยากรณ์พื้นฐานของคำสั่งคือ: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> ในการสร้างกลุ่มผู้ใช้ใหม่ &#39;นักเขียน&#39;: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> การรันคำสั่งดังกล่าวจะเพิ่มรายการใหม่ให้กับ <strong> /etc/group </strong> และ <strong> /etc/gshadow </strong> ไฟล์ในระบบของคุณ คุณสามารถตรวจสอบรายการกลุ่มใหม่ในไฟล์ได้โดยพิมพ์ <strong> แมว /etc/group </strong> และ <strong> แมว /etc/gshadow </strong> ในเทอร์มินัลของคุณ </p> <p> โปรดทราบว่าเฉพาะผู้ใช้ที่มีสิทธิ์ระดับผู้ดูแลระบบเท่านั้นที่สามารถสร้างกลุ่มผู้ใช้ได้ อย่าลืมเปลี่ยนไปใช้ superuser ก่อนดำเนินการคำสั่ง groupadd </p> <p> หากคุณพยายามสร้างกลุ่มที่มีชื่ออยู่แล้ว คุณจะเห็นข้อผิดพลาดที่ระบุว่า: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> อย่างไรก็ตาม คุณสามารถยกเลิกข้อผิดพลาดได้โดยใช้ปุ่ม <strong> -f </strong> หรือ <strong> --บังคับ </strong> ตั้งค่าสถานะด้วยคำสั่ง </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> สร้างกลุ่มผู้ใช้ด้วย GID ที่ไม่ซ้ำ </h3> <p> เมื่อคุณสร้างกลุ่มผู้ใช้ใหม่ ระบบจะกำหนด Group ID หรือ GID ให้โดยอัตโนมัติ หากคุณต้องการให้กลุ่มของคุณมี ID กลุ่มเฉพาะ คุณสามารถทำได้โดยใช้ปุ่ม <strong> -g </strong> หรือ <strong> --gid </strong> ธง. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> หากคุณพยายามกำหนด ID กลุ่มที่ใช้ไปแล้ว ข้อผิดพลาดต่อไปนี้จะเกิดขึ้น </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> แม้ว่าจะไม่แนะนำ แต่คุณสามารถเพิ่ม <strong> -o </strong> หรือ <strong> --ไม่ซ้ำกัน </strong> ตั้งค่าสถานะเพื่อบังคับกำหนด ID กลุ่ม </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> สร้างกลุ่มผู้ใช้ด้วยรหัสผ่าน </h3> <p> แม้ว่าคุณสามารถเพิ่มรหัสผ่านให้กับกลุ่มของคุณได้ แต่ก็ไม่มีประโยชน์อะไรกับผู้ใช้ <strong> -p </strong> ธงช่วยให้คุณระบุรหัสผ่านสำหรับกลุ่มผู้ใช้ของคุณ </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> สร้างกลุ่มระบบใน Linux </h3> <p> มีความแตกต่างเล็กน้อยระหว่างกลุ่มระบบและกลุ่มปกติ กลุ่มระบบคือกลุ่มพิเศษที่รวมผู้ใช้ที่รับผิดชอบการดำเนินการของระบบ เช่น การสำรองข้อมูลและการบำรุงรักษา </p> <p> ใช้ <strong> -r </strong> หรือ <strong> --ระบบ </strong> ตั้งค่าสถานะเพื่อสร้างกลุ่มระบบบน Linux: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> รับรายชื่อสมาชิกในกลุ่มผู้ใช้ </h3> <p> หากต้องการทราบว่ามีสมาชิกกี่คนในกลุ่มใดกลุ่มหนึ่ง คุณสามารถใช้เครื่องหมาย <strong> getent </strong> คำสั่งจากเทอร์มินัลของคุณ คำสั่งต่อไปนี้จะแสดงรายชื่อสมาชิกทั้งหมดที่อยู่ในกลุ่ม &#39;นักเขียน&#39;: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> เพิ่มผู้ใช้ในกลุ่ม </h2> <p> เมื่อคุณได้สร้างกลุ่มผู้ใช้ในระบบของคุณแล้ว ก็ถึงเวลาเพิ่มผู้ใช้บางส่วนเข้าไป Usermod เป็นยูทิลิตีบรรทัดคำสั่งที่มีประสิทธิภาพเนื่องจากมีตัวเลือกต่างๆ ที่เกี่ยวข้องกับการจัดการและการดูแลผู้ใช้ นอกจากนี้ยังช่วยให้คุณสามารถเพิ่มผู้ใช้ในกลุ่มของคุณได้อย่างง่ายดาย ไวยากรณ์พื้นฐานของคำสั่งคือ: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> เพิ่มผู้ใช้ที่มีอยู่ใน Groups </h3> <p> หากคุณต้องการเพิ่มผู้ใช้ที่มีอยู่ในกลุ่มของคุณ คำสั่ง <strong> -a </strong> และ <strong> -G </strong> ธงคือสิ่งที่คุณต้องการ <strong> -G </strong> ธงหมายถึงกลุ่มในขณะที่ <strong> -a </strong> ย่อมาจาก ผนวก เพิ่ม หรือ บวก </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> คุณยังเพิ่มผู้ใช้ในกลุ่มได้หลายกลุ่ม สิ่งที่คุณต้องทำคือป้อนชื่อกลุ่มโดยคั่นด้วยเครื่องหมายจุลภาค </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> เพิ่มผู้ใช้ใหม่ในกลุ่ม </h3> <p> คุณสามารถใช้ <strong> ผู้ใช้เพิ่ม </strong> คำสั่งเมื่อคุณต้องการ <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> เพิ่มผู้ใช้ใหม่ให้กับระบบ Linux ของคุณ </a> . Useradd มีวิธีกำหนดกลุ่มให้กับผู้ใช้ในขณะที่สร้าง <strong> -G </strong> ธงช่วยให้คุณระบุกลุ่มให้กับผู้ใช้ </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> การเพิ่มผู้ใช้ในหลายกลุ่มก็ง่ายเช่นกัน เพียงส่งชื่อกลุ่มโดยคั่นด้วยเครื่องหมายจุลภาคในคำสั่งเริ่มต้น </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> ลบผู้ใช้ออกจากกลุ่ม </h2> <p> คุณยังสามารถลบผู้ใช้ออกจากกลุ่มโดยใช้ <strong> ผู้ใช้mod </strong> . โปรดทราบว่าในระบบ Linux ผู้ใช้หนึ่งรายสามารถกำหนดกลุ่มได้หลายกลุ่ม กลุ่มใดกลุ่มหนึ่งถูกประกาศเป็นกลุ่มปฐมวัย ขณะที่กลุ่มอื่นเรียกว่ากลุ่มรอง </p> <p> หากคุณกำลังพยายามลบผู้ใช้ออกจากกลุ่ม ให้ตรวจสอบว่ามีกลุ่มหลักอย่างน้อยหนึ่งกลุ่มหลังการลบ ตัวอย่างเช่น ผู้ใช้ &#39;สุ่ม&#39; เป็นส่วนหนึ่งของผู้ดูแลระบบ นักเขียน และบรรณาธิการกลุ่ม โดยที่แอดมินคือกลุ่มหลัก ที่เหลือคือกลุ่มรอง </p> <p> คุณสามารถลบผู้ใช้ออกจากผู้เขียนและบรรณาธิการกลุ่มเท่านั้น และในการทำเช่นนั้น คุณต้องส่งชื่อกลุ่มที่คุณต้องการให้ผู้ใช้ยังคงเป็นสมาชิกอยู่ ซึ่งหมายความว่า ในการลบ &#39;สุ่ม&#39; ผู้ใช้ออกจากตัวแก้ไขกลุ่ม จะใช้คำสั่งต่อไปนี้: </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> สังเกตว่าสิ่งที่คุณต้องทำคือถอด <strong> ผนวกแฟล็ก (-a) </strong> จากคำสั่งที่คุณใช้เพื่อเพิ่มผู้ใช้ในกลุ่ม </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> ลบกลุ่มบน Linux </h2> <p> เมื่อคุณไม่ต้องการเก็บกลุ่มผู้ใช้ในระบบของคุณอีกต่อไป คุณสามารถลบกลุ่มโดยใช้ปุ่ม <strong> กรุ๊ปเดล </strong> คำสั่ง ไวยากรณ์ของคำสั่งคือ: </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> สำหรับการลบกลุ่มผู้ใช้ &#39;นักเขียน&#39;: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> หากคุณพยายามลบกลุ่มที่ไม่มีอยู่ คุณจะได้รับข้อผิดพลาดที่ระบุว่า: </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> การจัดการกลุ่มผู้ใช้บน Linux </h2> <p> การจัดการผู้ใช้อาจเป็นเรื่องยากหากคุณไม่ทราบคำสั่ง Linux ที่คุณต้องใช้ มันจะกลายเป็นเรื่องง่ายมากเมื่อคุณรู้คำสั่งเข้าและออกจากคำสั่งที่เกี่ยวข้องกับการดูแลและการจัดการ </p> <p> ผู้ดูแลระบบเซิร์ฟเวอร์ควรพยายามใช้ลีนุกซ์ดิสทริบิวชันที่เหมาะสมกับความต้องการของพวกเขา ด้วยวิธีนี้ พวกเขาจะได้รับเครื่องมือและยูทิลิตี้ทั้งหมดที่จำเป็นสำหรับการจัดการเซิร์ฟเวอร์ทันที </p>"}