{"title":"วิธีสร้างเกมกระดานของคุณเองใน Tabletop Simulator","content":"<p> เคยคิดที่จะสร้างเกมเพื่อเล่นกับเพื่อน ๆ บน Tabletop Simulator (TTS) หรือไม่? หรือบางทีคุณอาจเป็นผู้พัฒนาเกมบนโต๊ะที่กำลังมองหาเกมต้นแบบและทดลองเล่นออนไลน์ </p> <p> ไม่เคยมีช่วงเวลาไหนที่ดีไปกว่านี้อีกแล้วในการใช้ประโยชน์จากสภาพแวดล้อมการเล่นเกมที่หลากหลายของ TTS วันนี้เราจะมาสอนวิธีทำเพียงแค่นั้น </p> <h2 id=\"what-is-tabletop-simulator\"> Tabletop Simulator คืออะไร? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> สำหรับผู้ที่ไม่ทราบ Tabletop Simulator (TTS) ให้สภาพแวดล้อมแบบ 3 มิติสำหรับการเล่นเกมบนโต๊ะ ไม่ว่าจะในเครื่องหรือทางออนไลน์ มันกลายเป็นวิธีที่ยอดเยี่ยมในการ <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> เล่นเกมกระดานออนไลน์กับเพื่อน </a> . </p> <p> เกมที่เล่นได้บน TTS มีทุกอย่างตั้งแต่โป๊กเกอร์ หมากฮอส Dungeons &amp; Dragons มินิกอล์ฟ และแม้แต่เกมกระดานล่าสุด โดยทั่วไปแล้วเกมใดๆ ที่คุณต้องการเล่นจะมีให้บริการในรูปแบบ DLC หรือในเวิร์กชอปของชุมชน </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> ทำไมต้องใช้ Tabletop Simulator? </h2> <p> หากคุณเคยพยายามสร้างเกมบนโต๊ะจริง ๆ คุณจะรู้ว่ามันใช้เวลานานเพียงใด ไม่ใช่แค่การสร้างองค์ประกอบของเกม แต่ยังต้องปรับเปลี่ยนหรือแทนที่เมื่อคุณตัดสินใจปรับแต่งหรือแก้ไขเกม </p> <p> ใน TTS ทุกอย่างตั้งแต่สีไปจนถึงน้ำหนักของวัตถุสามารถเปลี่ยนแปลงได้ด้วยการคลิกเมาส์ ทำให้กระบวนการแก้ไขราบรื่นและไม่เจ็บปวด </p> <p> นอกจากนี้ยังง่ายต่อการสตรีมการเล่นเกมของคุณและอวดบนโซเชียลมีเดียและแพลตฟอร์มสตรีมมิ่ง </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> สิ่งที่จำเป็นในการเริ่มต้น </h2> <p> ก่อนที่คุณจะเริ่มต้น คุณจะต้องมีสิ่งต่อไปนี้: </p> <ul> <li> บัญชีผู้ใช้ Steam </li> <li> ติดตั้ง Tabletop Simulator บนพีซีของคุณ </li> <li> ภาพ JPG ของการออกแบบบอร์ดและการ์ดของคุณ </li> </ul> <p> <strong> ดาวน์โหลด: </strong> Tabletop Simulator บน <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> อบไอน้ำ </a> ($ 19.99) </p> <p> การออกแบบองค์ประกอบของเกมทำได้ดีที่สุดในซอฟต์แวร์ภาพประกอบ หรือโดยการสแกนรูปภาพของการ์ดจริงที่คุณสร้างไว้แล้ว เพียงตรวจสอบให้แน่ใจว่ามีนามสกุล JPG และบันทึกเป็นรายบุคคล </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> การสร้างกระดานและเสื่อผู้เล่น </h2> <p> เมื่อคุณออกแบบบอร์ดและวัตถุ 2D อื่นๆ ตรวจสอบให้แน่ใจว่าความละเอียดสูงพอที่คุณจะปรับขนาดได้อย่างเหมาะสมโดยไม่สูญเสียคุณภาพ TTS จะปรับขนาดโดยอัตโนมัติเมื่อคุณนำเข้า และคุณจะสามารถปรับขนาดได้ตามที่คุณต้องการ </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> การสร้างการ์ด </h2> <p> การ์ดใน TTS มีสามด้าน: หน้าการ์ด หลังการ์ด และการ์ดที่ซ่อนอยู่ (การ์ดจะดูเหมือนกับคนอื่นในมือของผู้เล่น) คุณจะต้องมีการออกแบบสำหรับแต่ละสิ่งเหล่านี้ แม้ว่าคุณจะมีตัวเลือกในการทำการ์ดที่ซ่อนอยู่ด้านหลังการ์ดแทน </p> <h3 id=\"create-and-arrange-card-faces\"> สร้างและจัดเรียงหน้าการ์ด </h3> <p> แทนที่จะนำเข้าไพ่ทีละใบ ควรนำเข้าไพ่ทั้งหมดหรือเกือบทั้งหมดเป็นสำรับเดียว </p> <p> ในการสร้างสำรับ ให้คัดลอกและวางแต่ละการออกแบบลงบนแผ่นการ์ดขนาด 7x10 การใช้เทมเพลตแบบด้านล่างนี้จะช่วยให้คุณเริ่มต้นได้ </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> เทมเพลตจะกำหนดช่องสำหรับการ์ดแต่ละใบในเด็คของคุณ ช่วยให้คุณนำเข้าการ์ดได้สูงสุด 69 ใบในแต่ละครั้ง หากคุณไม่ต้องการจำนวนมากขนาดนั้น คุณสามารถปล่อยให้ช่องที่ไม่ได้ใช้ และถ้าคุณมีมากกว่านั้น คุณสามารถรวมสำรับหรือไพ่ที่ซ้ำกันหลังจากนำเข้า </p> <p> อย่างไรก็ตาม คุณไม่จำเป็นต้องใช้เทมเพลตนี้ แผ่นการ์ดสามารถมีขนาดใดก็ได้ และ TTS จะตัดเป็นตารางขนาด 7x10 โดยอัตโนมัติ </p> <p> เพื่อความสะดวกของคุณ เทมเพลตด้านบนและเทมเพลตการ์ดสี่เหลี่ยมมีอยู่ในไดเรกทอรีไฟล์ TTS ในเครื่องของคุณ </p> <p> หากคุณไม่แน่ใจว่าไฟล์ในเครื่องของคุณอยู่ที่ไหน คุณสามารถค้นหาไฟล์เหล่านั้นได้ผ่านไลบรารี Steam ของคุณโดยเปิดไฟล์ <strong> คุณสมบัติ </strong> เมนูสำหรับ TTS เลือก <strong> ไฟล์ในเครื่อง </strong> แท็บและคลิก <strong> เรียกดู </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> หลังการ์ด </h3> <p> หากคุณต้องการเพียงดีไซน์เดียวสำหรับด้านหลังทั้งเด็ค สิ่งที่คุณต้องมีคือภาพ JPG ภาพเดียวของการออกแบบ ไม่จำเป็นต้องใช้แผ่นการ์ด </p> <p> หากเด็คของคุณจะมีหลังที่ไม่ซ้ำกันหลายหลัง คุณจะต้องสร้างแผ่นการ์ดเพิ่มเติมด้วยการออกแบบด้านหลังที่สอดคล้องกับการออกแบบใบหน้าในแผ่นการ์ดแรกของคุณ สำหรับการออกแบบหน้าปัดในช่องที่หนึ่ง ให้วางด้านหลังที่กำหนดไว้ในช่องที่หนึ่งของแผ่นหลังของคุณ สำหรับหน้าที่สอง ให้วางกลับเข้าไปในช่องที่สอง และอื่นๆ </p> <h3 id=\"hidden-cards\"> การ์ดที่ซ่อนอยู่ </h3> <p> ในช่อง 70 ของแผ่นการ์ดที่มีป้ายกำกับว่า &quot;การ์ดที่ซ่อนอยู่สำหรับผู้เล่นอื่น&quot; บนเทมเพลต ให้วางการออกแบบใดๆ ที่คุณต้องการให้ฝ่ายตรงข้ามเห็นเมื่อการ์ดในสำรับนี้อยู่ในมือของผู้เล่น โดยปกติแล้วจะเป็นสีดำหรือขาวทึบ หรือมีดีไซน์ที่ด้านหลังของเด็ค </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> การนำเข้าองค์ประกอบ </h2> <p> เมื่อคุณได้สร้างบอร์ดและเด็คของคุณแล้ว คุณก็พร้อมที่จะเริ่มนำเข้าแล้ว </p> <p> ก่อนที่จะโฮสต์เซิร์ฟเวอร์กับเกมของคุณจริงๆ การเริ่มต้นเกมแบบเล่นคนเดียวและนำเข้าองค์ประกอบต่างๆ ล่วงหน้าจะเป็นประโยชน์ จากนั้นคุณสามารถบันทึกการตั้งค่าและพร้อมที่จะเริ่มทันทีเมื่อผู้เล่นมาถึง </p> <p> เปิด TTS แล้วคลิก <strong> สร้าง </strong> แล้วเลือก <strong> เล่นคนเดียว </strong> เพื่อสร้างสิ่งแวดล้อม ลบองค์ประกอบที่สร้างโดย TTS และเลือกตารางที่คุณต้องการให้เล่นเกมของคุณ </p> <p> เมื่อสภาพแวดล้อมพร้อม ให้คลิกที่ <strong> วัตถุ </strong> ในเมนูด้านบน จากนั้นเลือกปุ่ม <strong> กำหนดเอง </strong> ประเภท. </p> <h3 id=\"boards-and-player-mats\"> กระดานและเสื่อเล่น </h3> <p> เลือก <strong> คณะกรรมการ </strong> จาก <strong> กำหนดเอง </strong> เมนู และคลิกที่ใดก็ได้บนโต๊ะที่คุณต้องการให้บอร์ดปรากฏ คลิกขวาที่ใดก็ได้เพื่อเปิดกล่องโต้ตอบการนำเข้าบอร์ด </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> เรียกดูภาพกระดานของคุณและ TTS จะถามว่าคุณต้องการอัปโหลดไปยังบัญชี Steam Cloud ของคุณหรือเก็บไฟล์ในเครื่องไว้ อัปโหลดไฟล์ไปยังระบบคลาวด์ หากคุณวางแผนที่จะเล่นเกมออนไลน์หรือบนอุปกรณ์อื่น </p> <p> คุณอาจเลือกที่จะอัปโหลดรูปภาพของคุณบนโฮสต์อื่น เช่น Dropbox, Photobucket หรือ Imgur แล้ววาง URL ที่นี่ อย่างไรก็ตาม โฮสต์ภายนอกมีความน่าเชื่อถือน้อยกว่า และไม่แนะนำ </p> <p> เมื่อคุณอัปโหลดไปยัง Steam Cloud TTS จะขอให้คุณตั้งชื่อไฟล์ เมื่ออัพโหลดเสร็จแล้ว ให้คลิก <strong> นำเข้า </strong> . </p> <p> ด้วยการนำเข้าบอร์ด คุณสามารถย่อหรือขยายได้ด้วย <strong> - </strong> และ <strong> + </strong> ปุ่มบนแป้นพิมพ์ของคุณ หากต้องการล็อกให้เข้าที่เพื่อไม่ให้เคลื่อนที่โดยไม่ได้ตั้งใจระหว่างการเล่นเกม ให้คลิกขวาบนกระดานและใต้ <strong> สลับ </strong> , คลิก <strong> ล็อค </strong> . </p> <h3 id=\"card-decks\"> สำรับไพ่ </h3> <p> ใน <strong> วัตถุที่กำหนดเอง </strong> เมนู คลิก <strong> ดาดฟ้า </strong> . คลิกที่ใดก็ได้บนโต๊ะที่คุณต้องการให้สำรับปรากฏ จากนั้นคลิกขวาเพื่อเริ่มการนำเข้า </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> ปรับการตั้งค่าดังนี้: </p> <ul> <li> <strong> ประเภท: </strong> เปลี่ยนสิ่งนี้หากคุณมีรูปร่างเฉพาะในใจนอกเหนือจากการ์ดสี่เหลี่ยมมุมมนปกติ </li> <li> <strong> ใบหน้า: </strong> คลิก <strong> เรียกดูไฟล์ในเครื่อง </strong> และค้นหาแผ่นการ์ดใบหน้าของคุณ อีกครั้ง เราขอแนะนำตัวเลือก Steam Cloud แทนไฟล์ในเครื่องหรือโฮสต์ภายนอก </li> <li> <strong> หลังที่ไม่ซ้ำ: </strong> เลือกตัวเลือกนี้หากสำรับของคุณมีการออกแบบด้านหลังหลายแบบ แล้วอัปโหลดแผ่นการ์ดด้านหลังของคุณใน <strong> กลับ </strong> กล่อง. หากคุณกำลังใช้การออกแบบเดียวสำหรับทั้งเด็ค ให้อัปโหลดการออกแบบด้านหลังของคุณแทน </li> <li> <strong> ความกว้างและความสูง: </strong> ปรับค่านี้หากคุณใช้อัตราส่วนที่แตกต่างจากการ์ดสี่เหลี่ยมมาตรฐาน 10x7 </li> <li> <strong> จำนวน: </strong> ตรวจสอบให้แน่ใจว่าตรงกับจำนวนการ์ดที่คุณกำลังนำเข้า </li> <li> <strong> ด้านข้าง: </strong> สิ่งนี้จะเปลี่ยนการวางแนวสำหรับ <strong> Alt Zoom </strong> ฟังก์ชันใน TTS ปล่อยว่างไว้เว้นแต่คุณต้องการให้การ์ดปรากฏด้านข้าง </li> <li> <strong> ด้านหลังถูกซ่อน: </strong> เลือกตัวเลือกนี้หากคุณต้องการให้มุมมองที่ซ่อนอยู่ของการ์ดของคุณเป็นเพียงส่วนหลังของการ์ด </li> </ul> <p> เมื่อการตั้งค่าของคุณถูกต้อง คลิก <strong> นำเข้า </strong> . เด็คของคุณจะปรากฏบนโต๊ะ และคุณสามารถเริ่มสับไพ่และจัดการได้ </p> <p> หากคุณต้องการให้การ์ดของคุณมีชื่อเพื่อช่วยในการจัดเรียง ให้คลิกขวาที่การ์ดเดียวแล้วคลิก <strong> ชื่อ </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> การนำเข้าองค์ประกอบเกมอื่นๆ </h2> <p> การนำเข้าออบเจ็กต์ 2D อื่นๆ จะคล้ายกับกระบวนการนำเข้าบอร์ด อย่าลืมว่า TTS มีองค์ประกอบเกมทั่วไปมากมาย เช่น ลูกเต๋าและฟิกเกอร์ ที่พร้อมใช้ใน <strong> วัตถุ </strong> เมนู. </p> <p> หากคุณมีองค์ประกอบ 3 มิติที่กำหนดเองที่คุณต้องการใช้ ให้ทำตาม <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> คู่มือ TTS ในการนำเข้าโมเดล 3 มิติ </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> บันทึกเกมที่สมบูรณ์ </h2> <p> หลังจากจัดเรียงส่วนประกอบในสถานะการตั้งค่าเริ่มต้น ให้คลิกที่ <strong> เกม </strong> ปุ่มในเมนูด้านบน </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> เลือก <strong> บันทึกและโหลด </strong> และคลิก <strong> บันทึกเกม </strong> ปุ่ม. ตั้งชื่อแล้วคลิก <strong> บันทึก </strong> . ตอนนี้ เมื่อใดก็ตามที่คุณโฮสต์เกม คุณสามารถโหลดซ้ำได้ในการตั้งค่าที่สมบูรณ์แบบโดยเข้าไปที่ <strong> บันทึกและโหลด </strong> เมนู. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> ใช้ประโยชน์สูงสุดจากการเล่นเกมบนโต๊ะแบบกำหนดเอง </h2> <p> การออกแบบและเล่นเกมแบบกำหนดเองนั้นง่ายใน Tabletop Simulator เมื่อคุณรู้วิธีที่จะทำ เชิญเพื่อนของคุณหรือมองหาผู้เล่นที่พร้อมและเต็มใจใน <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> ชุมชน TTS </a> . ตอนนี้คุณอวดเกมที่คุณกำหนดเองให้คนอื่นดูได้แล้ว! </p>"}