{"title":"วิธีที่บริการส่งข้อความโต้ตอบแบบทันทียอดนิยมใช้การเข้ารหัสจากต้นทางถึงปลายทาง","content":"<p> ข้อมูลส่วนบุคคลมีความสำคัญมากกว่าที่เคย รัฐบาล บริษัท และอาชญากรไซเบอร์ต้องการข้อมูลส่วนบุคคลของผู้คนเพื่อตอบสนองความสนใจของพวกเขา แพลตฟอร์มต่างๆ ทางออนไลน์ทำให้การมอบข้อมูลส่วนตัวเป็นเรื่องง่ายโดยที่เราไม่รู้ตัว </p> <p> ด้วยเหตุนี้ จึงเป็นสิ่งสำคัญที่จะต้องมีความเข้าใจที่ดีว่าแพลตฟอร์มที่คุณใช้ออนไลน์ปกป้องความเป็นส่วนตัวของคุณอย่างไร ปัจจัยสำคัญประการหนึ่งที่ควรพิจารณาเมื่อพิจารณาถึงมาตรการป้องกันของแอปพลิเคชันการรับส่งข้อความคือการเข้ารหัสจากต้นทางถึงปลายทาง </p> <p> เมื่อตระหนักถึงความจำเป็นในการจัดลำดับความสำคัญของความเป็นส่วนตัวของข้อมูล แอปพลิเคชันการรับส่งข้อความจำนวนมากขึ้นได้ดำเนินการตามขั้นตอนที่สำคัญในการเข้ารหัสตั้งแต่ต้นทางถึงปลายทาง </p> <h2 id=\"what-is-end-to-end-encryption\"> การเข้ารหัสแบบ End-to-End คืออะไร? </h2> <p> </p> <p> การเข้ารหัสจากต้นทางถึงปลายทางคือ <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีการเข้ารหัสการสื่อสาร </a> เพื่อให้บุคคลที่สามไม่สามารถเข้าถึงข้อมูลที่แบ่งปันระหว่างบุคคลที่ส่งข้อความถึงกัน </p> <p> ด้วยการเข้ารหัสแบบ end-to-end จะใช้รหัสลับแทนข้อความธรรมดาเพื่อปกปิดเนื้อหาของข้อความ ซึ่งหมายความว่าเฉพาะผู้ที่สื่อสารบนแพลตฟอร์มที่เข้ารหัสแบบ end-to-end เท่านั้นที่สามารถอ่านข้อความที่ส่งระหว่างกัน </p> <p> มาดูกันว่าบริการส่งข้อความที่ปลอดภัยยอดนิยมสามบริการอย่าง Signal, WhatsApp และ Telegram ใช้การเข้ารหัสแบบ end-to-end อย่างไร </p> <p> </p> <h2 id=\"signal\"> สัญญาณ </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signal ถือเป็นแอปพลิเคชั่นรับส่งข้อความที่ปลอดภัยที่สุดตัวหนึ่ง การสื่อสารทั้งหมดบนแพลตฟอร์มได้รับการเข้ารหัสตั้งแต่ต้นทางถึงปลายทาง </p> <p> Signal ไม่ได้สำรองข้อความบนคลาวด์ซึ่งช่วยลดความเสี่ยงของผู้ไม่หวังดีโดยใช้วิธีการอื่นในการรับข้อมูล นอกจากนี้ยังเข้ารหัสข้อมูลเมตาของข้อความเพื่อไม่ให้ติดตามตำแหน่งและเวลาของกิจกรรมการส่งข้อความ </p> <p> ด้วยเอ็นจิ้นการเข้ารหัสโอเพนซอร์ซ ประชาชนได้รับประโยชน์จากระดับความโปร่งใสที่สูงขึ้นในเทคโนโลยีที่อยู่เบื้องหลังกิจกรรมการส่งข้อความของพวกเขา ผู้ใช้สามารถดูรายละเอียดทางเทคนิคให้ละเอียดยิ่งขึ้นเพื่อทำความเข้าใจวิธีการที่ใช้ปกป้องความเป็นส่วนตัวได้ดีขึ้น </p> <p> แพลตฟอร์มโอเพ่นซอร์สสามารถทำให้ซอฟต์แวร์ใช้งานได้ง่ายและปลอดภัยในระยะยาว ไม่เพียงแต่ผู้คนจะเข้าใจวิธีทำงานของซอฟต์แวร์ได้ดีขึ้นเท่านั้น แต่ยังสามารถลองตั้งค่าแอปพลิเคชันเวอร์ชันของตนเอง ซึ่งอาจเหมาะสมกับความต้องการด้านความปลอดภัยเฉพาะ </p> <p> Signal ใช้ OTR ร่วมกัน ซึ่งเรียกว่า Multi-Party Off-the-Record Messaging ซึ่งทำให้สามารถเข้ารหัสข้อความแบบ end-to-end ในการแชทเป็นกลุ่มได้ ความเสี่ยงของการละเมิดข้อมูลสามารถเพิ่มขึ้นได้ตามจำนวนผู้เข้าร่วมในเครือข่ายที่เพิ่มขึ้น ด้วยการแชทเป็นกลุ่มที่เข้ารหัสตั้งแต่ต้นทางถึงปลายทาง ความเสี่ยงดังกล่าวจะลดลงอย่างมาก </p> <p> </p> <h2 id=\"whatsapp\"> WhatsApp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp เป็นหนึ่งในแอปพลิเคชันการส่งข้อความยอดนิยมรายแรกๆ ที่เปิดใช้งานการเข้ารหัสแบบ end-to-end ใช้การเข้ารหัสแบบ end-to-end สำหรับข้อความและการโทร </p> <p> WhatsApp ใช้โปรโตคอลการเข้ารหัสแบบ end-to-end ที่พัฒนาโดย Open Whisper Systems ซึ่งเป็นทีมที่อยู่เบื้องหลัง Signal messenger นี่เป็นข้อดีที่สำคัญสำหรับแอปพลิเคชัน โดยพิจารณาว่าโปรโตคอลการเข้ารหัสของ Signal มีความปลอดภัยเพียงใด </p> <p> </p> <p> การใช้การติดตั้งที่เป็นกรรมสิทธิ์ของ WhatsApp หมายความว่านักวิจัยด้านความปลอดภัยจำนวนมากอาจไม่ได้รับการตรวจสอบบ่อยเท่าซอฟต์แวร์โอเพ่นซอร์สของ Signal </p> <p> แม้จะมีการเข้ารหัสข้อความ แต่สามารถใช้วิธีอื่นเพื่อค้นหาข้อมูลเพิ่มเติมเกี่ยวกับข้อความที่ส่งบน WhatsApp เนื่องจากข้อความสามารถสำรองบนคลาวด์และข้อมูลเมตาบนแอพไม่ได้เข้ารหัส ทำให้ง่ายต่อการทราบเวลาและตำแหน่งของข้อความ นอกจากนี้ รายงานที่แสดงการแชทเป็นกลุ่มของ WhatsApp ที่จัดทำดัชนีในการค้นหาของ Google ทำให้เกิดคำถามเกี่ยวกับความปลอดภัยของการแชทเป็นกลุ่ม </p> <p> </p> <h2 id=\"telegram\"> โทรเลข </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> โทรเลขเป็นที่รักสำหรับการใช้การเข้ารหัสและข้อความที่ทำลายตัวเอง น่าเศร้าที่ Telegram มีความกังวลเรื่องการเข้ารหัสแบบ end-to-end หลายประการ ซึ่งผู้ใช้หลายคนอาจดูเหมือนไม่ชัดเจน </p> <p> ใน Telegram การเข้ารหัสแบบ end-to-end จะไม่ถูกเปิดใช้งานโดยค่าเริ่มต้น มีให้เฉพาะเมื่อผู้ใช้เปลี่ยนไปใช้การแชทแบบลับเท่านั้น สำหรับผู้ใช้ที่ไม่มีแนวโน้มทางเทคนิค จะมีความเสี่ยงด้านความปลอดภัยที่พวกเขาอาจไม่ทราบด้วยซ้ำ </p> <p> โทรเลขสามารถเข้าถึงข้อความที่จัดเก็บไว้ในเซิร์ฟเวอร์ซึ่งได้รับการสำรองข้อมูลไว้บนคลาวด์ บางคนเชื่อว่าสิ่งนี้นำเสนอเวกเตอร์การโจมตีเพิ่มเติมที่อาจนำไปสู่การละเมิดข้อมูลส่วนบุคคลในกรณีที่อาชญากรไซเบอร์พยายามขโมยข้อมูลการส่งข้อความจากแอปพลิเคชัน </p> <p> ดังที่กล่าวไปแล้ว การแชทลับทั้งหมดในโทรเลขเป็นแบบเฉพาะอุปกรณ์ ซึ่งหมายความว่าข้อความที่คุณส่งผ่านการแชทลับสามารถเข้าถึงได้จากอุปกรณ์ที่ส่งเท่านั้น </p> <p> แม้ว่าการแชทลับของ Telegram จะได้รับการเข้ารหัสแบบ end-to-end แต่การแชทเป็นกลุ่มจะไม่ได้รับการเข้ารหัส ซึ่งหมายความว่าผู้ใช้อาจใช้อุปกรณ์หลายเครื่องสำหรับการแชทกลุ่มเดียวกันได้ บันทึกการแชทสามารถดาวน์โหลดได้บนอุปกรณ์หลายเครื่องโดยผู้ใช้ </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> แชทลับบน <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #โทรเลข </a> หมายความว่าข้อความของคุณได้รับการปกป้องโดยการเข้ารหัสตั้งแต่ต้นทางถึงปลายทางและจะถูกลบออกหลังจากเวลาที่กำหนด <br><br> นี่คือวิธีที่คุณสามารถเปิดใช้งานคุณลักษณะนี้ <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> — แคสเปอร์สกี้ (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 31 มกราคม 2564 </a></blockquote>  <p> Telegram สร้างตัวอย่างลิงก์บนเซิร์ฟเวอร์ระยะไกลจากการแชทปกติและลับ เมื่อผู้ใช้พิมพ์ลิงก์เป็นครั้งแรกในการแชทลับ แอปพลิเคชันจะเตือนพวกเขาว่าลิงก์จะถูกส่งไปยังเซิร์ฟเวอร์ระยะไกล นี่ถือเป็นจุดอ่อนด้านความปลอดภัยเนื่องจากการส่งลิงก์ที่แชร์ในการแชทส่วนตัวไปยังเซิร์ฟเวอร์ระยะไกลขัดต่อวัตถุประสงค์ของการเข้ารหัสตั้งแต่ต้นทางถึงปลายทาง </p> <p> MTProto โปรโตคอลการเข้ารหัสของ Telegram ออกแบบมาเพื่อเข้าถึงเซิร์ฟเวอร์ API จากแอปพลิเคชันบนมือถือ เป็นกรรมสิทธิ์และโอเพ่นซอร์สเพียงบางส่วนเท่านั้น สิ่งนี้ทำให้เกิดคำถามว่าการควบคุมและความเข้าใจของประชาชนมีวิธีการเข้ารหัสที่ใช้เพื่อปกป้องข้อความของพวกเขามากเพียงใด </p> <p> โชคดีที่แอปพลิเคชันการรับส่งข้อความไม่ต้องเผชิญกับการเรียกร้องที่ร้ายแรงเกี่ยวกับการละเมิดข้อมูล แต่เป็นเรื่องน่ากังวลที่ต้องรู้ว่าผู้ให้บริการสามารถเข้าถึงข้อความของคุณได้ </p> <p> แม้จะมีข้อกังวล แต่หลายคนอาจมั่นใจได้โดยห่วงทางกฎหมายต่างๆ ที่จะต้องข้ามผ่านเพื่อเข้าถึงข้อความ ในอดีต Telegram ได้ชี้แจงให้ชัดเจนว่าผู้คนเข้าถึงข้อความบนแพลตฟอร์มของตนได้ยากเพียงใด กุญแจจะต้องเข้าถึงได้จากเขตอำนาจศาลที่แตกต่างกันซึ่งจะทำให้คนจำนวนมากผิดหวัง </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> การเลือกแอปพลิเคชั่นรับส่งข้อความที่ปลอดภัยที่สุด </h2> <p> แม้ว่า Signal อาจไม่ได้รับความนิยมเท่า WhatsApp แต่โปรโตคอลของมันก็ทำหน้าที่เป็นปัจจัยสำคัญที่ส่งผลต่อความสำเร็จของ WhatsApp ด้วยการเข้ารหัสจากต้นทางถึงปลายทาง แม้ว่าวิธีการเข้ารหัสแบบ end-to-end จะคล้ายกับ WhatsApp แต่ก็ถือว่าดีกว่า WhatsApp สำหรับการเข้ารหัสแบบ end-to-end มันสร้างความแตกต่างด้วยการดำเนินการเพิ่มเติมเพื่อปกป้องผู้ใช้ </p> <p> การตัดสินใจของ Telegram ที่จะไม่จัดลำดับความสำคัญของการเข้ารหัสแบบ end-to-end นั้นมาจากการตั้งค่าเพื่อความสะดวก ในกรณีที่ไม่มีการเข้ารหัส มันชดเชยด้วยวิธีการทางอ้อมในการปกป้องผู้ใช้ด้วยการเข้ารหัสบนคลาวด์และการจัดเก็บคีย์ในเขตอำนาจศาลต่างๆ </p>"}