{"title":"วิธีเข้าถึงสถิติการเล่นเกม PS4 และ PS5 ของคุณในปี 2020","content":"<p> Sony ได้เปิดตัว PlayStation Wrap-Up ซึ่งช่วยให้คุณไตร่ตรองถึงเส้นทาง PlayStation ของคุณในปีที่ผ่านมา </p> <p> เราจะบอกคุณถึงวิธีเข้าถึงประสบการณ์นี้และทำให้คุณทราบถึงข้อกำหนดบางประการ </p> <h2 id=\"what-is-playstation-wrap-up\"> สรุป PlayStation คืออะไร? </h2> <p> ตามที่เรารายงาน <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation Wrap-Up คือบทสรุปของการเล่นเกมปีสุดท้ายของคุณ </a> . </p> <p> เป็นเพจส่วนบุคคลที่มีรายละเอียดเกี่ยวกับนิสัยการเล่น PS4 และ PS5 ของคุณ รวมถึงจำนวนเกมที่คุณเล่น ระยะเวลาที่คุณเล่น และจำนวนถ้วยรางวัลที่คุณได้รับระหว่างทาง </p> <p> คุณยังสามารถรับธีมไดนามิกฟรีพร้อมรูปทรง PlayStation น่าสับสนว่าใช้ได้เฉพาะกับ PS4 เท่านั้นไม่ใช่ PS5 ที่เพิ่งออกใหม่ </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> วิธีเข้าถึง PlayStation Wrap-Up </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> หากต้องการดูรายงานของคุณ ไปที่ <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> เว็บไซต์สรุป PlayStation </a> . คุณจะต้องลงชื่อเข้าใช้บัญชี Sony หากคุณยังไม่ได้ลงชื่อเข้าใช้ เมื่อคุณอยู่ในหน้านี้ คุณสามารถเลื่อนลงเพื่อดูสถิติของคุณและแลกธีม PS4 </p> <p> ประสบการณ์ Wrap-Up จะมีให้จนถึงวันที่ 2 มีนาคม 2021 เท่านั้น ดังนั้น อย่ารอช้า หากคุณต้องการเข้าร่วม </p> <p> มีเงื่อนไขที่คุณต้องปฏิบัติตามเพื่อใช้ PlayStation Wrap-Up: </p> <ul> <li> มีบัญชี PSN ที่ลงทะเบียนในภูมิภาคของคุณ </li> <li> มีอายุ 18 ปีขึ้นไป </li> <li> เล่นเกมเป็นเวลาอย่างน้อย 10 ชั่วโมงบนคอนโซล PS4 ระหว่างวันที่ 1 มกราคม 2020 ถึง 31 ธันวาคม 2020 </li> </ul> <p> นอกจากนี้ ผู้ใช้ในยุโรป ตะวันออกกลาง แอฟริกา ออสเตรเลีย อินเดีย และรัสเซีย ต้องเปิดใช้งานคอลเลกชันของ <strong> ข้อมูลเพิ่มเติม </strong> . คุณสามารถเปิดใช้งานสิ่งนี้บน PS4 ผ่าน <strong> การตั้งค่า </strong> &gt; <strong> ข้อมูลอุปกรณ์/สุขภาพและความปลอดภัย </strong> &gt; <strong> ข้อมูลอุปกรณ์ </strong> . </p> <p> สุดท้าย คุณสามารถรับอีเมลที่มี PlayStation Wrap-Up ของคุณได้ อย่างไรก็ตาม คุณต้องเลือกรับอีเมลทางการตลาด ซึ่งคุณสามารถทำได้ผ่านทาง <strong> การตั้งค่าการแจ้งเตือน </strong> ในบัญชี PSN ของคุณ </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> จะมีบทสรุปปี 2564 หรือไม่? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> นี่เป็นปีที่สองติดต่อกันที่ Sony ได้ดำเนินการสรุปประสบการณ์ เนื่องจากเป็นเพียงการวิเคราะห์ข้อมูลในปี 2020 จึงมีโฟกัส PS4 มากกว่า </p> <p> หวังว่า Sony จะทำอีกครั้งในปีหน้าเมื่อ PS5 จะออกมานานแล้วและมีเกมวางจำหน่ายมากขึ้น </p>"}