{"title":"วิธีเข้ารหัสและถอดรหัสไฟล์และไดเรกทอรีอย่างง่ายดายใน Linux","content":"<p> คุณเคยต้องการที่จะเข้ารหัสไฟล์ใน Linux อย่างรวดเร็วและง่ายดายโดยไม่ต้องติดตั้งและเรียนรู้แพ็คเกจซอฟต์แวร์ใหม่หรือไม่? นี่เป็นวิธีที่ยอดเยี่ยมและง่ายดายในการเข้ารหัสไฟล์หรือไดเรกทอรีอย่างง่ายดายผ่าน AES256 ที่มีการรักษาความปลอดภัยด้วยรหัสผ่าน ช่วยป้องกันไฟล์ของคุณจากการสอดรู้สอดเห็น </p> <h2 id=\"the-basics-of-encryption-with-openssl\"> พื้นฐานของการเข้ารหัสด้วย OpenSSL </h2> <p> สิ่งสำคัญที่ควรทราบคือมีการเข้ารหัสมากกว่านี้อีกมาก </p> <p> คุณอาจระมัดระวังในการอ่าน <a href=\"https://www.openssl.org/docs/\" target=\"_blank\" rel=\"nofollow noopener\"> เอกสาร OpenSSLSL </a> ก่อนที่จะเชื่อถือวิธีนี้กับข้อมูลของคุณ อย่างไรก็ตาม สมมติว่าคุณไม่ได้พยายามหลบเลี่ยง NSA หรือกองทัพรัสเซีย วิธีนี้น่าจะใช้ได้ผลดีในการทำให้ไฟล์และไดเรกทอรีของคุณปลอดภัยและไม่สามารถเข้าถึงได้สำหรับผู้อื่น </p> <p> </p> <h2 id=\"install-openssl\"> ติดตั้ง OpenSSL </h2> <p> คุณต้องติดตั้งแพ็คเกจ OpenSSL ยอดนิยม ดังนั้นก่อนอื่นให้ตรวจสอบว่าได้ติดตั้งไว้กับ installedแล้วหรือไม่ <a href=\"https://www.makeuseof.com/basic-commands-linux/\" target=\"_blank\" rel=\"nofollow noopener\"> คำสั่งลินุกซ์ </a> : </p> <pre><code class=\"hljs\">openssl version</code></pre> <p> หากพิมพ์หมายเลขเวอร์ชันปัจจุบัน คุณก็พร้อมสำหรับส่วนถัดไป มิฉะนั้น หากคุณได้รับข้อผิดพลาด &quot;ไม่พบคำสั่ง&quot; คุณสามารถติดตั้ง OpenSSL ได้ง่ายๆ ผ่าน apt-get: </p> <pre><code class=\"hljs perl\">sudo apt-get -y install openssl</code></pre> <p> </p> <h2 id=\"encrypt-and-decrypt-files\"> เข้ารหัสและถอดรหัสไฟล์ </h2> <p> ตัวอย่างเช่น หากคุณต้องการเข้ารหัสไฟล์ชื่อ data.tar.gz คุณจะต้องรันคำสั่ง: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -a -salt -iter 5 -in data.tar.gz -out data.enc</code></pre> <p> คุณจะได้รับแจ้งให้ป้อนรหัสผ่านการเข้ารหัสสองครั้ง ซึ่งสามารถเป็นอะไรก็ได้ที่คุณต้องการ คำสั่งนี้จะส่งผลให้ไฟล์ data.enc ใหม่เป็นไฟล์ที่เข้ารหัสใหม่ โปรดทราบว่าการดำเนินการนี้จะเก็บไฟล์ data.tar.gz เดิมไว้แทน ดังนั้นโปรดลบทิ้งหากจำเป็น </p> <p> เมื่อต้องการ คุณสามารถถอดรหัสไฟล์ data.enc ด้วยคำสั่ง: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -d -a -iter 5 -in data.enc -out data_decrypted.tar.gz</code></pre> <p> คำสั่งด้านบนจะแจ้งให้คุณใส่รหัสผ่านสำหรับการเข้ารหัส จากนั้นผลลัพธ์จะเป็นไฟล์ data_decrypted.tar.gz ที่มีไฟล์เวอร์ชันถอดรหัสของคุณ </p> <p> </p> <h2 id=\"encrypt-and-decrypt-directories\"> เข้ารหัสและถอดรหัสไดเรกทอรี </h2> <p> คำสั่งในส่วนข้างต้นใช้งานได้ดีกับไฟล์แต่ละไฟล์ แต่จะเกิดอะไรขึ้นหากคุณต้องการเข้ารหัสทั้งไดเรกทอรี ไม่มีการสนับสนุนในตัวใน OpenSSL สำหรับสิ่งนี้ แต่ด้วยความมหัศจรรย์ของ Linux นี่จึงไม่มีปัญหา ตัวอย่างเช่น หากคุณต้องการเข้ารหัสไดเร็กทอรีชื่อ &quot;documents&quot; คุณสามารถใช้คำสั่ง: </p> <pre><code class=\"hljs\">tar -cf tmpdata.tar documents && gzip tmpdata.tar && openssl aes-256-cbc -a -salt -iter 5 -in tmpdata.tar.gz -out documents.enc && rm -f tmpdata.tar.gz</code></pre> <p> คำหนึ่ง แต่เพียงสองแห่งในคำสั่งด้านบนที่คุณต้องแก้ไขคือ &quot;เอกสาร&quot; ในส่วนแรกซึ่งเป็นไดเรกทอรีที่จะเข้ารหัสและ &quot;documents.enc&quot; ในส่วนที่สามซึ่งเป็นไฟล์ที่เข้ารหัส คำสั่งนี้จะเก็บถาวรไดเร็กทอรี เข้ารหัส จากนั้นลบไฟล์เก็บถาวรชั่วคราวที่สร้างขึ้นโดยเหลือไฟล์ document.enc ที่เข้ารหัสไว้เพียงไฟล์เดียว </p> <p> การถอดรหัสไฟล์ document.enc ที่สร้างขึ้นใหม่ทำได้ง่ายด้วยคำสั่ง: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -d -a -iter 5 -in documents.enc -out tmpdata.tar.gz && tar -xzf tmpdata.tar.gz && rm -f tmpdata.tar.gz</code></pre> <p> ส่วนเดียวของคำสั่งข้างต้นที่คุณต้องแก้ไขคือ &quot;documents.enc&quot; ในส่วนแรกซึ่งเป็นชื่อของไฟล์ที่เข้ารหัส คำสั่งนี้จะแจ้งให้คุณใส่รหัสผ่านการเข้ารหัส ดำเนินการถอดรหัสและแกะไฟล์เก็บถาวร จากนั้นลบไฟล์เก็บถาวรชั่วคราวออกจากไดเร็กทอรีที่ถอดรหัสแล้ว </p> <p> </p> <h2 id=\"protect-your-data\"> ปกป้องข้อมูลของคุณ </h2> <p> ตอนนี้คุณรู้แล้วว่าการเข้ารหัสและถอดรหัสข้อมูลของคุณอย่างรวดเร็วนั้นง่ายเพียงใด นำความรู้ของคุณไปใช้และรักษาข้อมูลส่วนตัวของคุณให้ปลอดภัยและหลีกเลี่ยง <a href=\"https://www.makeuseof.com/worst-data-breaches/\" target=\"_blank\" rel=\"nofollow noopener\"> การละเมิดข้อมูล </a> . ย้ำอีกครั้งว่ามีการเข้ารหัสมากกว่าที่นำเสนอที่นี่และข้างต้นไม่ได้หมายถึงการหลบเลี่ยงการบังคับใช้กฎหมายหรือแฮกเกอร์ที่มีทักษะสูงและมุ่งมั่น </p> <p> อย่างไรก็ตาม หากคุณเพียงต้องการปกป้องข้อมูลของคุณจากการสอดรู้สอดเห็น เช่น ข้อมูลของพี่เขยหรือช่างซ่อมคอมพิวเตอร์ วิธีการข้างต้นควรทำเคล็ดลับได้อย่างสวยงาม </p>"}