{"title":"วิธีใช้แอพ Apple Watch Workout","content":"<p> ทำความเข้าใจความคืบหน้าในการออกกำลังกายของคุณได้ดีขึ้นด้วย Apple Watch </p> <p> เรากำลังพิจารณาทุกสิ่งที่แอพ Apple Watch Workout มีให้ รวมถึงวิธีการทำงานของแอพ ประเภทการออกกำลังกายที่สามารถติดตามได้ และวิธีดูข้อมูลทั้งหมดที่รวบรวม </p> <h2 id=\"getting-started-with-the-workout-app\"> เริ่มต้นใช้งานแอพออกกำลังกาย </h2> <p> คุณสามารถเปิดแอพ Workout บน Apple Watch ได้หลายวิธี ขั้นแรก เพียงคลิกหนึ่งครั้งที่ปุ่ม <strong> มงกุฎดิจิตอล </strong> เพื่อแสดงรายการแอพในนาฬิกาของคุณ จากนั้นเลือก <strong> ออกกำลังกาย </strong> . </p> <p> วิธีที่เร็วยิ่งขึ้นคือใช้ Siri โดยการกดปุ่มpressค้างไว้ <strong> มงกุฎดิจิตอล </strong> หรือยกนาฬิกาเข้าปาก แล้วพูดว่า &quot;เปิดแอป Workout&quot; </p> <p> หลังจากเปิดแอปแล้ว คุณจะเห็นประเภทการออกกำลังกายที่หลากหลาย ตั้งแต่การยิงธนูไปจนถึงโยคะ และอื่นๆ อีกมากมาย </p> <p> หน้าจอการเลือกการออกกำลังกายหลักจะถูกเน้นด้วยตัวเลือกยอดนิยม เลื่อนไปที่ด้านล่างของรายการและเลือก <strong> เพิ่มการออกกำลังกาย </strong> เพื่อดูรายการการออกกำลังกายประเภทอื่นๆ หากคุณไม่เห็นประเภทการออกกำลังกายของคุณด้วยเหตุผลบางประการ คุณสามารถเลือก <strong> อื่นๆ </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> คุณสามารถเลือก <strong> สามจุด </strong> ( <strong> ... </strong> ) ในการออกกำลังกายแต่ละประเภทเพื่อกำหนดเป้าหมายระยะทาง แคลอรีที่เผาผลาญ หรือเวลาโดยเฉพาะ หากเป้าหมายใดไม่สนใจคุณ เพียงแตะชื่อการออกกำลังกายเพื่อเริ่มทันที </p> <p> จะมีการนับถอยหลังสามวินาทีบนหน้าจอก่อนที่การติดตามจะเริ่มขึ้น </p> <p> ฟีเจอร์ทั้งหมดของแอพ Workout สามารถใช้งานได้โดยไม่ต้องมี iPhone อยู่ใกล้ๆ หรือใช้เพียงแค่ Apple Watch ที่เชื่อมต่อกับ Wi-Fi หรือสัญญาณเซลลูลาร์ </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> ทำความเข้าใจแอพออกกำลังกาย </h2> <p> มีสามหน้าจอหลักในแอป คุณสามารถสลับไปมาระหว่างกันได้ด้วยการปัดไปทางซ้ายหรือขวา </p> <p> หน้าจอหลักจะแสดงความคืบหน้าทั้งหมดของคุณในประเภทการออกกำลังกายที่คุณเลือก คุณจะเห็นเวลาออกกำลังกาย แคลอรีที่ใช้งานอยู่ แคลอรีทั้งหมด และอัตราการเต้นของหัวใจปัจจุบัน คุณอาจเห็นระยะทางที่เดินทางด้วย ทั้งนี้ขึ้นอยู่กับประเภทการออกกำลังกายของคุณ </p> <p> หากคุณมี Apple Watch Series 5 หรือใหม่กว่า และเปิดใช้งานจอภาพเปิดตลอดเวลา คุณสามารถดูสถิติการออกกำลังกายของคุณได้เสมอ ทุกคนที่มีรุ่นเก่าจะต้องยกหรือแตะหน้าจอเพื่อดูข้อมูลนี้ </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> เมื่อคุณวิ่งหรือเดิน Apple Watch จะทำการแตะเบาๆ ทุกๆ ไมล์หรือกิโลเมตร และแสดงข้อมูลอัปเดตพร้อมข้อมูลอัตราการก้าว สรุปการปั่นจักรยานและแตะจะเกิดขึ้นทุก ๆ ห้าไมล์หรือกิโลเมตร </p> <p> หากคุณกำลังออกกำลังกายด้วย Apple Fitness+ คุณสามารถดูข้อมูลได้ทั้งบนแอพ Workout และหน้าจอ iPhone, iPad หรือ Apple Watch </p> <p> </p> <p> การปัดไปทางขวาจากหน้าจอหลักจะแสดงให้คุณเห็นสี่ตัวเลือกที่แตกต่างกัน— <strong> ล็อค </strong> , <strong> ใหม่ </strong> , <strong> จบ </strong> , และ <strong> หยุด </strong> . </p> <p> กำลังเลือก <strong> ล็อค </strong> จะล็อคหน้าจอเพื่อหลีกเลี่ยงการแตะโดยไม่ได้ตั้งใจ คุณสามารถหมุน Digital Crown เพื่อปลดล็อกหน้าจอได้ โปรดทราบว่าตัวเลือกนี้จะเปิดโดยอัตโนมัติในระหว่างการออกกำลังกายว่ายน้ำทุกประเภท เพื่อป้องกันไม่ให้หยดน้ำโดยไม่ได้ตั้งใจ </p> <p> อย่างที่คุณอาจเดาได้ <strong> ใหม่ </strong> สิ้นสุดการออกกำลังกายปัจจุบันและให้คุณเลือกการออกกำลังกายประเภทใหม่เพื่อเริ่มใหม่อีกครั้ง กำลังเลือก <strong> จบ </strong> จะเสร็จสิ้นการออกกำลังกายปัจจุบัน </p> <p> หากคุณเคยถูกขัดจังหวะ คุณสามารถเลือก <strong> หยุด </strong> ปุ่ม. การกดอีกครั้งจะเป็นการเริ่มการติดตามการออกกำลังกาย คุณยังสามารถทำได้โดยกด Digital Crown และปุ่มด้านข้างพร้อมกัน </p> <p> การปัดไปทางซ้ายจากหน้าจอการออกกำลังกายหลักจะแสดงการควบคุมการเล่นสื่อ นั่นเป็นวิธีที่ง่ายในการเข้าถึงเพลงของคุณหรืออะไรก็ตามที่คุณฟังขณะออกกำลังกาย คุณสามารถข้ามเพลง เล่น หยุดชั่วคราว และเพิ่มหรือลดระดับเสียงได้ </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> เตือนการออกกำลังกายอัตโนมัติ </h2> <p> ไม่ต้องกังวลหากคุณลืมเริ่มออกกำลังกาย ตราบใดที่คุณมี watchOS 5 หรือใหม่กว่า Apple Watch สามารถจดจำได้โดยอัตโนมัติเมื่อคุณออกกำลังกาย มันจะแตะคุณที่ข้อมือและถามว่าคุณต้องการบันทึกการออกกำลังกายหรือไม่ อนุญาตให้คุณเปลี่ยนประเภทการออกกำลังกาย ปิดเสียงการแจ้งเตือนเหล่านี้สำหรับวันนั้น หรือเพียงแค่ปิดการแจ้งเตือนนี้ </p> <p> แม้ว่าการแจ้งเตือนอาจใช้เวลาสองสามนาที แต่เครดิตการออกกำลังกายทั้งหมดยังคงได้รับการบันทึกไว้ </p> <p> คุณสามารถรับการแจ้งเตือนการออกกำลังกายสำหรับประเภทการออกกำลังกายต่อไปนี้: เดินในร่ม เดินกลางแจ้ง วิ่งในร่ม วิ่งกลางแจ้ง รูปไข่ พายเรือ ว่ายน้ำในสระ และว่ายน้ำในที่โล่ง </p> <p> หากต้องการเปิดหรือปิดคุณสมบัติ ให้ไปที่ <strong> ตั้งค่า &gt; ออกกำลังกาย &gt; เตือนให้เริ่มออกกำลังกาย </strong> บน Apple Watch ของคุณ </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> Apple Watch ยังสามารถรับรู้ได้เมื่อการออกกำลังกายเสร็จสิ้น หลังจากแตะ คุณจะเห็นการแจ้งเตือนบนหน้าจอพร้อมตัวเลือกในการสิ้นสุดหรือหยุดการออกกำลังกายชั่วคราว คุณยังสามารถปิดการแจ้งเตือนทั้งหมดและออกกำลังกายต่อได้ </p> <p> สลับคุณสมบัติโดยไปที่ Apple Watch แล้วไปที่ <strong> ตั้งค่า &gt; ออกกำลังกาย &gt; เตือนให้หยุดออกกำลังกาย </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> ปรับแต่งข้อมูลที่แสดงในแอพออกกำลังกาย </h2> <p> ในมุมมอง Apple Watch Workout คุณสามารถปรับแต่งข้อมูลที่แสดงบนหน้าจอสำหรับประเภทการออกกำลังกายต่างๆ ได้ </p> <p> ในการเริ่มต้น ให้เปิดแอพ Watch ที่แสดงร่วมบน iPhone ของคุณ ใน <strong> นาฬิกาของฉัน </strong> เลือกแท็บ <strong> ออกกำลังกาย </strong> . จากนั้นเลือก <strong> มุมมองการออกกำลังกาย </strong> . ที่ด้านบนของหน้า คุณสามารถเลือกได้ว่าจะแสดงเมตริกเดียวหรือหลายรายการบนหน้าจอระหว่างการออกกำลังกาย หากคุณเลือก <strong> เมตริกเดียว </strong> เพียงเลื่อน Digital Crown เพื่อดูข้อมูลเพิ่มเติมบน Apple Watch ของคุณ </p> <p> <strong class=\"gallery__section-title\"> แกลเลอรี่ภาพ (3 ภาพ) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> ขยาย <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> ขยาย <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> ขยาย </p> <p> ปิด </p> <p> ด้านล่างนั้น คุณยังดูประเภทการออกกำลังกายต่างๆ ได้อีกด้วย ซึ่งคุณสามารถแก้ไขข้อมูลที่แสดงบนหน้าจอได้ เลือกประเภทการออกกำลังกายแล้วเลือก <strong> แก้ไข </strong> ที่ด้านบนขวาของหน้าจอเพื่อปรับแต่งสิ่งที่แสดงบนหน้าจอและในลำดับใด </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> การดูข้อมูลการออกกำลังกายในแอพฟิตเนส </h2> <p> เมื่อคุณออกกำลังกายเสร็จแล้ว ข้อมูลทั้งหมดก็อยู่ใน iPhone ของคุณเพียงแค่แตะไม่กี่ครั้ง </p> <p> หากต้องการดูให้เปิด <strong> ฟิตเนส </strong> แอพ </p> <p> <strong class=\"gallery__section-title\"> แกลเลอรี่ภาพ (2 รูปภาพ) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> ขยาย <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> ขยาย </p> <p> ปิด </p> <p> ภายใต้ <strong> สรุป </strong> แทป เลือก <strong> ออกกำลังกาย </strong> . คุณจะเห็นข้อมูลเกี่ยวกับการออกกำลังกายทั้งหมดของคุณ ข้อมูลยังมีอยู่ใน <strong> สุขภาพ </strong> แอพ </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> เหงื่อแตกด้วย App แอปเปิ้ลนาฬิกาออกกำลังกาย </h2> <p> อย่างที่คุณเห็น แอพ Apple Watch Workout เป็นวิธีที่ยอดเยี่ยมในการช่วยติดตามเมตริกฟิตเนสต่างๆ ของคุณ ในขณะที่ทำทุกอย่างตั้งแต่ว่ายน้ำไปจนถึงเต้นรำ และอื่นๆ อีกมากมาย </p> <p> และเมื่อคุณพร้อมที่จะเข้านอนแล้ว Apple Watch ของคุณก็ยังสามารถช่วยคุณได้มากด้วยคุณสมบัติการติดตามการนอนหลับในตัว </p>"}