{"title":"วิธีรักษาข้อมูลส่วนบุคคลของคุณให้ปลอดภัยจากนายจ้าง","content":"<p> เทคโนโลยีการเฝ้าระวังอาละวาดทั้งภายในและภายนอกสำนักงาน นายจ้างจำนวนมากใช้ผลิตภัณฑ์การจัดการอุปกรณ์เคลื่อนที่สำหรับอุปกรณ์ที่บริษัทออกให้ เช่น โทรศัพท์ แล็ปท็อป และแท็บเล็ต เหล่านี้มีโปรแกรมที่ออกแบบมาเพื่อปกป้องธุรกิจจากการโจรกรรม การจารกรรมขององค์กร หรือเจตนาร้าย </p> <p> อย่างไรก็ตาม แม้ว่าสิ่งเหล่านี้จะดีสำหรับการปกป้องบริษัทของคุณ แต่ก็ไม่ใช่สิ่งที่ดีที่สุดสำหรับคุณ ไม่ใช่คำถามของ .อีกต่อไป <strong> ถ้า </strong> บริษัทของคุณกำลังติดตามคุณ ต่อไปที่คุณต้องถามคือ บริษัทต่างๆ สามารถหาข้อมูลได้มากน้อยเพียงใด น่าแปลกใจมาก </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> นายจ้างสามารถเห็นอะไรในบริษัท Wi-Fi และอุปกรณ์ระยะไกล? </h2> <p> คนส่วนใหญ่ไม่ทราบว่าบริษัทใดเข้าถึงข้อมูลของตนได้มากน้อยเพียงใด หรือลงชื่อเข้าใช้ในอุปกรณ์ของบริษัทมากเพียงใด นี่คือตัวอย่างบางส่วน. </p> <h3 id=\"location\"> ที่ตั้ง </h3> <p> พนักงานหลายคนคิดว่าการใช้ Virtual Private Network (VPN) นั้นเพียงพอที่จะทำให้นายจ้างเชื่อว่าตนอยู่ในที่ที่ควรจะเป็น </p> <p> แม้ว่าจะมีวิธีซ่อนตำแหน่งจริงของคุณบนอุปกรณ์ส่วนตัว แต่ก็ไม่สามารถป้องกันการเข้าใจผิดได้ทั้งหมด โดยเฉพาะอย่างยิ่งเมื่อลงชื่อเข้าใช้แอปพลิเคชันหรือเว็บไซต์ด้วยที่อยู่อีเมลหรือหมายเลขโทรศัพท์มือถือที่บริษัทออก </p> <p> </p> <p> แทบจะเป็นไปไม่ได้เลยที่จะซ่อนตำแหน่งจริงของคุณเมื่อใช้อุปกรณ์ที่บริษัทออกให้ ตัวอย่างเช่น บริษัทโทรคมนาคมสามารถตรวจจับได้เมื่อคุณเชื่อมต่อกับพันธมิตรโรมมิ่งของพวกเขา </p> <p> นอกจากนี้ VPN ขององค์กรยังแตกต่างจาก VPN เชิงพาณิชย์ที่มีเกตเวย์ตรวจสอบโดยทีมไอทีภายใน </p> <h3 id=\"notes-documents-and-emails\"> หมายเหตุ เอกสาร และอีเมล </h3> <p> หากคุณคิดว่าไม่มีใครรู้ว่าคุณใช้ Wi-Fi ของบริษัทเพื่อหางานต่อไป คุณคิดผิด แม้ว่าคุณจะไม่ได้ใช้ที่อยู่อีเมลของบริษัท ธุรกิจจำนวนมากมีโปรแกรมติดตั้งไว้ล่วงหน้าในแล็ปท็อปของบริษัท ซึ่งรวมถึงบันทึกกิจกรรมแบบเรียลไทม์ การอัปเดตประวัติการเข้าชม และภาพหน้าจอตามกำหนดเวลาของเอกสารและอีเมลที่เปิด </p> <p> บนพื้นฐานของการป้องกันการรั่วไหลของข้อมูล หลายบริษัทยังใช้สิ่งเหล่านี้เป็นกลไกการรายงานหรือเครื่องมือติดตามประสิทธิภาพการทำงาน </p> <p> </p> <h3 id=\"online-messaging-history\"> ประวัติการส่งข้อความออนไลน์ </h3> <p> แม้จะมีแพลตฟอร์มเข้ารหัสเพิ่มขึ้น แต่ความจริงก็คือข้อความของคุณไม่ได้เป็นส่วนตัวทั้งหมดบนอุปกรณ์ขององค์กร เมื่อใช้แพลตฟอร์มการรับส่งข้อความ บริษัทต่างๆ อาจไม่สามารถดูรายละเอียดที่แน่นอนของการแลกเปลี่ยนของคุณ แต่มีแนวโน้มที่จะยังสามารถรับรู้ข้อมูลเมตาขนาดและประเภทไฟล์ดังกล่าวได้ </p> <p> ด้วยเหตุนี้ หากคุณตัดสินใจที่จะส่งไฟล์ PDF ขนาดใหญ่ผ่านแอพอย่าง WhatsApp ระบบตรวจจับการบุกรุกของบริษัทของคุณมักจะติดธงทำเครื่องหมายพฤติกรรมที่น่าสงสัยของคุณ เพื่อให้สอดคล้องกับแนวทางปฏิบัติขององค์กร พวกเขาอาจขอให้คุณพิสูจน์การกระทำของคุณว่าไม่เป็นอันตราย และอาจจำเป็นต้องขอออกจากตำแหน่งผู้นำเพื่อขออนุมัติ </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> วิธีหลีกเลี่ยงการแบ่งปันข้อมูลส่วนบุคคลกับนายจ้างของคุณ </h2> <p> ไม่มีวิธีใดที่จะรักษาข้อมูลส่วนบุคคล การสนทนา และกิจกรรมของคุณให้พ้นมือได้ตลอดเวลา อย่างไรก็ตาม มีหลายวิธีที่คุณสามารถลดความเสี่ยงได้ </p> <p> เราไม่รับรองการซ่อนข้อมูลจากนายจ้างของคุณ อันที่จริง พวกเขามีสิทธิที่จะรวบรวมข้อมูลเกี่ยวกับพนักงานของตน—แม้กระทั่ง <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> สามารถติดตามคุณได้อย่างถูกกฎหมาย </a> . แต่คุณต้องรู้ว่าเมื่อใดจึงควรที่จะเก็บสิ่งต่างๆ ไว้เป็นส่วนตัว และนั่นก็ขึ้นอยู่กับแต่ละบริษัท </p> <h3 id=\"read-company-policies\"> อ่านนโยบายบริษัท </h3> <p> ก่อนที่คุณจะสามารถโต้แย้งเกี่ยวกับความโปร่งใสของข้อมูล คุณต้องเข้าใจประเภทของข้อมูลที่คุณตั้งใจให้นายจ้างของคุณทราบด้วยการทำงานให้กับพวกเขา เฉพาะเมื่อคุณรู้ว่าคาดหวังอะไร คุณจึงจะสามารถกำหนดขอบเขตทางวิชาชีพที่เหมาะสมได้ </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> มุ่งที่จะทำความเข้าใจนโยบายและขั้นตอนการเก็บรวบรวมข้อมูลของบริษัทก่อนที่จะรวบรวม จากที่นั่น คุณสามารถวางแผนเลือกที่จะไม่ให้ข้อมูลเกินความจำเป็น </p> <h3 id=\"use-personal-gadgets\"> ใช้ แกดเจ็ตส่วนตัว </h3> <p> แม้ว่าการใช้อุปกรณ์ของบริษัทจะดึงดูดใจเสมอเพื่อประหยัดเงิน แต่ความจริงก็คือ ไม่มีอะไรที่ฟรีเสมอไป ลงทุนในแล็ปท็อป โทรศัพท์มือถือ และแท็บเล็ตสำหรับใช้ส่วนตัว </p> <p> การมีอุปกรณ์ส่วนตัวแยกต่างหากเป็นวิธีที่ดีในการสร้างขอบเขต โดยเฉพาะอย่างยิ่งเมื่อทำงานจากระยะไกล </p> <p> การใช้อุปกรณ์ของคุณเองทำให้คุณสามารถสร้างและจัดการแนวทางปฏิบัติด้านความปลอดภัยต่างๆ ที่จำเป็นเพื่อรักษาความปลอดภัยให้กับข้อมูลของคุณจากการสอดรู้สอดเห็น อาจดูเหมือนเป็นค่าใช้จ่ายที่ไม่จำเป็น แต่จะช่วยให้คุณสบายใจได้ </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> ใช้โปรไฟล์ผู้เยี่ยมชมบนอุปกรณ์ส่วนตัว </h3> <p> การเชื่อมต่อกับเครือข่ายที่ไม่ใช่เครือข่ายของคุณเองถือเป็นความเสี่ยงด้านความปลอดภัยเสมอ แม้ว่าจะอยู่ในสถานที่ทำงานก็ตาม การลงชื่อเข้าใช้ Wi-Fi ของบริษัทจะทำให้นายจ้างของคุณเข้าถึงทุกอย่างตั้งแต่ข้อมูลเมตาของข้อความไปจนถึงบันทึกประวัติการท่องเว็บ </p> <p> หากคุณต้องการใช้แล็ปท็อปส่วนตัวในเครือข่ายของบริษัทจริงๆ คุณสามารถเลือกที่จะใช้โปรไฟล์ผู้เยี่ยมชมเพื่อลดปริมาณข้อมูลที่สามารถเข้าถึงได้จากระยะไกล หรือคุณอาจเชื่อมต่อกับแผนข้อมูลของโทรศัพท์มือถือส่วนบุคคลหรืออุปกรณ์ Wi-Fi แบบพกพา </p> <h3 id=\"keep-your-passwords-safe\"> รักษารหัสผ่านของคุณให้ปลอดภัย </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> การสร้างรหัสผ่านที่รัดกุม </a> ไม่เพียงพอ คุณต้องตรวจสอบให้แน่ใจว่ารหัสผ่านของคุณไม่ได้รับการบันทึกไว้ในอุปกรณ์ของบริษัท การบันทึกรหัสผ่านส่วนบุคคลสำหรับบัญชีธนาคารออนไลน์ อีเมลส่วนตัว หรือเว็บไซต์ของรัฐบาลในแกดเจ็ตที่คุณไม่ได้เป็นเจ้าของจะทำให้ข้อมูลของคุณตกอยู่ในความเสี่ยงทันทีหากฐานข้อมูลของบริษัทถูกบุกรุก </p> <p> ใช้เฉพาะโทรศัพท์มือถือหรือแล็ปท็อปส่วนตัวของคุณในการเข้าถึงบัญชีที่สำคัญ โดยเฉพาะอย่างยิ่งบัญชีที่เกี่ยวข้องกับเงิน เปิดใช้งานการรับรองความถูกต้องด้วยสองปัจจัยเมื่อใดก็ตามที่เป็นไปได้ </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> แยกงานและชีวิตส่วนตัวของคุณ </h2> <p> นายจ้างมีสิทธิ์เข้าถึงอุปกรณ์ที่บริษัทออกให้จากระยะไกล หากสงสัยว่าคุณเข้าร่วมในกิจกรรมที่ผิดกฎหมายทุกรูปแบบ ทำให้ข้อมูลของบริษัทตกอยู่ในความเสี่ยง หรือได้รับการร้องขอจากหน่วยงานบังคับใช้กฎหมายเพื่อตรวจสอบ </p> <p> ซึ่งแตกต่างจากอุปกรณ์ส่วนตัวอย่างไรก็ตาม </p> <p> ความปลอดภัยของคุณแข็งแกร่งพอๆ กับผู้คนที่คุณติดต่อด้วย ซึ่งรวมถึงนายจ้างของคุณด้วย การแยกอุปกรณ์ส่วนตัวและอุปกรณ์ที่ทำงานออกจากกันเป็นเพียงขั้นตอนเดียวในการกระจายข้อมูลของคุณ เมื่อใช้มาตรการรักษาความปลอดภัยที่เข้มงวด คุณจะจำกัดจำนวนจุดเข้าใช้งานที่แฮ็กเกอร์มีต่อเอกสาร อีเมล และเครือข่ายได้ </p> <p> การกระจายอำนาจของข้อมูลส่วนบุคคลเป็นสิ่งจำเป็น เนื่องจากปกป้องคุณ ในฐานะบุคคล และบริษัทของคุณจากการโจรกรรม การฉ้อโกง และรูปแบบอื่นๆ </p>"}