{"title":"iPhone 13 อาจมีจอแสดงผล &quot;เปิดตลอดเวลา&quot;","content":"<p> Apple เปิดตัวจอแสดงผล &quot;เปิดตลอดเวลา&quot; สำหรับ Apple Watch Series 5 ในปี 2019 สองสามปีต่อมาอาจมีการตั้งค่าให้มาถึง iPhone ตามที่นักข่าว Max Weinbach ผู้แบ่งปันข้อมูลกับช่อง YouTube <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> EverythingApplePro </a> . </p> <p> รายงานอ้างว่า iPhone 13 หากนั่นคือสิ่งที่ Apple ตัดสินใจตั้งชื่อจริง ๆ จะทำให้บางส่วนของหน้าจอสว่างขึ้นอย่างถาวรเพื่อแสดงรายละเอียดบางอย่าง </p> <h2 id=\"how-always-on-display-will-work\"> การแสดง &quot;เปิดตลอดเวลา&quot; จะทำงานอย่างไร </h2> <p> รายละเอียดเหล่านี้อาจมีทั้งไอคอนนาฬิกาและแบตเตอรี่ พวกเขาจะยังคงมองเห็นได้แม้ในขณะที่ iPhone ถูกล็อค หมายความว่าผู้ใช้ไม่ได้ใช้งานอยู่ การแจ้งเตือน เช่น ประกาศข้อความใหม่ จะสว่างขึ้นชั่วคราวเท่านั้น </p> <p> นี่จะเป็นครั้งแรกที่ iPhone มาพร้อมกับเทคโนโลยีการแสดงผล &quot;เปิดตลอดเวลา&quot; อย่างไรก็ตาม ไม่มีทางเป็นครั้งแรกที่เทคโนโลยีที่คล้ายกันได้เข้าสู่สมาร์ทโฟน โนเกียเปิดตัวฟีเจอร์หน้าจอ &quot;เปิดตลอดเวลา&quot; ตั้งแต่ต้นปี 2552 ไม่นานมานี้ ฟีเจอร์นี้ได้กลายเป็นฟีเจอร์ที่มีให้บริการอย่างแพร่หลายในโทรศัพท์ Android หลายรุ่น ซึ่งรวมถึงรุ่นที่ผลิตโดย Huawei, Motorola, Samsung, Google และอื่นๆ </p> <p> ข้อได้เปรียบที่สำคัญและชัดเจนของ &quot;เปิดตลอดเวลา&quot; คือ ผู้ใช้ไม่ต้องปลุกหรือปลดล็อกโทรศัพท์ของตนเพื่อเข้าถึงข้อมูล แม้ว่าจะเป็นเรื่องเล็กน้อยเช่นการตรวจสอบเวลาก็ตาม </p> <p> ข้อเสียคือมันเปลืองอายุการใช้งานแบตเตอรี่มากเป็นพิเศษ ซึ่งอาจเป็นสิ่งที่มีค่าสำหรับสมาร์ทโฟนอยู่แล้ว อย่างไรก็ตาม จอแสดงผล AMOLED สามารถลดผลกระทบของแบตเตอรี่ได้โดยการเปิดใช้งานพิกเซลเหล่านั้นบนจอแสดงผลที่จำเป็นในการแสดงข้อมูลเท่านั้น </p> <p> กล่าวอีกนัยหนึ่ง จอแสดงผล &quot;เปิดตลอดเวลา&quot; นี้เปิดอยู่เสมอในแง่ทางเทคนิค แม้ว่าหน้าจอส่วนใหญ่จะปิดอยู่ และมีเพียงไม่กี่ส่วนเท่านั้นที่ยังคงสว่างตลอดเวลา ซึ่งหมายความว่าผลกระทบต่ออายุการใช้งานแบตเตอรี่ไม่ได้สำคัญเท่าที่ควร </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> สิ่งที่คาดหวังจาก iPhone 13 </h2> <p> iPhone เจเนอเรชันถัดไปน่าจะมาถึงในเดือนกันยายน 2564 จากข้อมูลของ Weinbach จะมีการออกแบบตัวเครื่องโดยรวมเหมือนกับ iPhone 12 series แม้ว่าจะมีการอัพเกรดบางอย่างภายใต้ประทุนก็ตาม </p> <p> สิ่งเหล่านี้จะรวมถึงแม่เหล็ก MagSafe ที่แข็งแรงกว่า ระบบกล้องที่ได้รับการปรับปรุงสำหรับการถ่ายภาพดวงจันทร์และดวงดาว เลนส์กล้องมุมกว้างพิเศษสำหรับ iPhone ทุกรุ่น วิดีโอโหมดแนวตั้ง (แทนที่จะเป็นแค่ภาพนิ่ง) ด้านหลังแบบด้านที่ปรับปรุงใหม่ ชิปซีรีส์ รายงานก่อนหน้านี้อ้างว่า Apple อาจ <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> แนะนำ Touch ID บนหน้าจอ </a> เป็นทางเลือกแทน Face ID </p> <p> เนื่องจากยังเหลือเวลาอีกกว่าครึ่งปี จึงอาจมีรายละเอียดใหม่ๆ เกิดขึ้นมากมายก่อนที่ Apple จะเปิดตัว iPhone เครื่องถัดไปในไตรมาสที่ 3 อย่างไรก็ตาม ดูเหมือนว่าโรงสีข่าวลือจะเริ่มดำเนินการแล้ว ดูพื้นที่นี้! </p>"}