{"title":"JPG กับ JPEG: รูปแบบไฟล์รูปภาพเหล่านี้แตกต่างกันอย่างไร","content":"<p> รูปแบบไฟล์รูปภาพบางรูปแบบไม่เท่ากัน อันที่จริง หลายคนถูกสร้างขึ้นเพื่อแก้ไขปัญหาที่รูปแบบที่มีอยู่แล้วไม่สามารถแก้ไขได้ ตัวอย่างเช่น JPEG เกิดขึ้นเนื่องจากขนาดไฟล์ภาพกินพื้นที่จัดเก็บมากเกินไป </p> <p> เชื่อหรือไม่ว่านามสกุลไฟล์ JIF, JPEG และ JPG อ้างอิงถึงสิ่งเดียวกันมากหรือน้อย เพื่อให้เข้าใจว่าทำไมรูปแบบไฟล์จึงมีชื่อมากมาย เราจำเป็นต้องเปิดเผยประวัติที่ซับซ้อนเล็กน้อย </p> <h2 id=\"what-is-a-jpeg\"> JPEG คืออะไร? </h2> <p> ตัวย่อ JPEG ย่อมาจาก Joint Photographic Experts Group ซึ่งเป็นประเภทไฟล์ที่ได้รับการตั้งชื่อตามคณะอนุกรรมการที่ช่วยสร้างมาตรฐาน JPEG Interchange Format (JIF) ออกครั้งแรกในปี 1992 โดยองค์การระหว่างประเทศเพื่อการมาตรฐาน (ISO) </p> <p> JPEG เป็นภาพนิ่งแบบ 24 บิตแบบแรสเตอร์ โดยมีแปดบิตในแต่ละช่องสัญญาณของรุ่นสี RGB ซึ่งจะทำให้ไม่มีที่ว่างสำหรับช่องอัลฟา ซึ่งหมายความว่าแม้ว่า JPEG สามารถรองรับสีได้มากกว่า 16 ล้านสี แต่ก็ไม่สามารถรองรับความโปร่งใสได้ </p> <p> เมื่อรูปภาพถูกบันทึกเป็น JPEG ข้อมูลบางส่วนจะถูกละทิ้งในกระบวนการที่เรียกว่า lossy <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> การบีบอัดไฟล์ </a> . ในทางกลับกัน รูปภาพจะใช้พื้นที่จัดเก็บน้อยลง 50-75 เปอร์เซ็นต์ (เมื่อเปรียบเทียบกับรูปแบบที่เก่ากว่า เช่น BMP) โดยที่คุณภาพของภาพลดลงเพียงเล็กน้อยหรือไม่มีเลย </p> <p> การบีบอัด JPEG ขึ้นอยู่กับเทคนิคการบีบอัดภาพที่สูญเสียซึ่งเรียกว่าการแปลงโคไซน์แบบไม่ต่อเนื่อง (DCT) ซึ่งเสนอครั้งแรกโดยวิศวกรไฟฟ้า Nasir Ahmed ในปี 1972 </p> <h3 id=\"what-is-a-jif\"> JIF คืออะไร? </h3> <p> คุณสามารถคิดว่าไฟล์ JIF เป็นไฟล์ JPEG ในรูปแบบที่ &quot;บริสุทธิ์ที่สุด&quot; ได้ อย่างไรก็ตาม รูปแบบนี้ไม่ได้ใช้อีกต่อไปแล้ว เนื่องจากมีข้อจำกัดที่น่าผิดหวัง ตัวอย่างเช่น คำจำกัดความด้านสีและพิกเซลของ JIF ทำให้เกิดปัญหาความเข้ากันได้ระหว่างตัวเข้ารหัสและตัวถอดรหัส (ผู้ดู) </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> โชคดีที่ปัญหาเหล่านี้ได้รับการแก้ไขในภายหลังโดยมาตรฐาน &quot;เสริม&quot; อื่นๆ ที่สร้างจาก JIF สิ่งแรกคือรูปแบบการแลกเปลี่ยนไฟล์ JPEG (JFIF) และต่อมา <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> รูปแบบไฟล์ภาพที่แลกเปลี่ยนได้ </a> (Exif) และโปรไฟล์สี ICC </p> <p> JPEG/JFIF เป็นรูปแบบที่นิยมมากที่สุดในปัจจุบันสำหรับการจัดเก็บและส่งภาพถ่ายทางอินเทอร์เน็ต ในขณะที่ JPEG/Exif คือรูปแบบสำหรับกล้องดิจิตอลและอุปกรณ์จับภาพอื่นๆ คนส่วนใหญ่ไม่แยกแยะความแตกต่างระหว่างรูปแบบเหล่านี้และเรียกทั้งสองแบบว่า JPEG เพียงอย่างเดียว </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> JPG2 หรือ JPF คืออะไร? </h3> <p> ในปี 2000 กลุ่ม JPEG ได้เปิดตัวรูปแบบไฟล์ภาพอื่นที่เรียกว่า JPEG 2000 (นามสกุลไฟล์คือ JPG2 และ JPF) มีจุดมุ่งหมายเพื่อเป็นตัวตายตัวแทนของ JPEG แต่ก็ไม่ได้รับความนิยมมากนัก แม้ว่าวิธีการเข้ารหัสขั้นสูงมักจะทำให้ได้ภาพที่มีคุณภาพดีขึ้น </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> เครดิตภาพ: Dake/ <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> วิกิมีเดียคอมมอนส์ </a> </p> <p> รูปแบบไฟล์ JPEG 2000 ล้มเหลวด้วยเหตุผลเล็กน้อย ประการหนึ่ง มันใช้โค้ดใหม่ทั้งหมด ดังนั้นจึงไม่สามารถใช้งานร่วมกับ JPEG แบบย้อนหลังได้ ยิ่งไปกว่านั้น การจัดการไฟล์ JPEG 2000 นั้นต้องการหน่วยความจำเพิ่มเติมในการประมวลผล ซึ่งเป็นปัญหาเล็กน้อยในสมัยนั้น ท้ายที่สุดแล้ว คอมพิวเตอร์โดยเฉลี่ยในขณะนั้นมีหน่วยความจำเพียง 64 MB เท่านั้น </p> <p> JPEG 2000 ได้เห็นการฟื้นตัวเล็กน้อยในขณะนี้ที่ฮาร์ดแวร์คอมพิวเตอร์โดยทั่วไปได้รับการปรับปรุงอย่างมากในช่วง 20 ปีที่ผ่านมา แต่รูปแบบไฟล์ยังคงใช้งานน้อยเกินไป อินเทอร์เน็ตเบราว์เซอร์เดียวที่รองรับไฟล์ JPEG 2000 ในขณะที่เขียนคือ Safari </p> <h3 id=\"jpeg-vs-jpg\"> JPEG กับ JPG </h3> <p> Windows เวอร์ชันก่อนหน้า (โดยเฉพาะระบบไฟล์ MS-DOS 8.3 และ FAT-16) มีขีดจำกัดสูงสุด 3 ตัวอักษรเมื่อพิจารณาถึงความยาวของนามสกุลไฟล์ JPEG ต้องย่อเป็น JPG เพื่อไม่ให้เกินขีดจำกัด คอมพิวเตอร์ Mac และ Linux ไม่เคยมีสิ่งนี้ ดังนั้นผู้ใช้จึงยังคงบันทึกรูปภาพเป็น JPEG ต่อไป </p> <p> </p> <p> โปรแกรมแก้ไขรูปภาพยอดนิยมที่ทำงานบนระบบปฏิบัติการต่างๆ เช่น Photoshop และ <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> Gimp </a> —ในที่สุดจะตั้งค่านามสกุลไฟล์ JPEG เริ่มต้นเป็น JPG เพื่อลดความสับสน </p> <p> และนั่นคือเหตุผลที่เราลงเอยด้วยนามสกุลไฟล์สองนามสกุลสำหรับรูปแบบเดียวกัน: JPEG และ JPG เมื่อเลือกว่าจะบันทึกภาพของคุณเป็นอะไร จะไม่มีความแตกต่างกัน </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG กับ PNG: ไหนดีกว่ากัน </h2> <p> </p> <p> JPEG และ PNG ได้รับการเผยแพร่ภายในทศวรรษเดียวกัน โดยแต่ละรูปแบบไฟล์สามารถแก้ไขปัญหาภาพดิจิทัลที่แตกต่างกันซึ่งโลกเทคโนโลยีต้องเผชิญในตอนนั้น คุณสามารถพูดได้ว่ามันเป็นเรื่องธรรมดาเท่านั้นที่มีการเปรียบเทียบกันตลอดเวลา... และพวกเขาก็ยังเป็นอยู่จนถึงทุกวันนี้ ระหว่าง JPEG และ PNG รูปแบบไฟล์ภาพใดมีอำนาจสูงสุด </p> <p> จริงๆ แล้ว คำตอบนั้นขึ้นอยู่กับว่าคุณกำลังบันทึกรูปภาพประเภทใด </p> <p> JPEG เหมาะกว่าสำหรับภาพถ่ายเพราะใช้การบีบอัดแบบสูญเสียข้อมูลเพื่อให้มีขนาดไฟล์ที่เหมาะสม ภาพถ่ายเป็นรูปภาพขนาดใหญ่และมีรายละเอียดมากจนไม่สามารถสังเกตเห็นสิ่งแปลกปลอมในการบีบอัด (ภาพบิดเบี้ยวที่ละเอียดอ่อนที่เกิดจากการบีบอัด) ได้ </p> <p> ในทางกลับกัน รูปภาพที่มีจุดคม ขอบคมชัด และมีพื้นที่สีเดียวขนาดใหญ่ (เช่น โลโก้เวกเตอร์ ภาพพิกเซล ฯลฯ) จะดูไม่ถูกต้องเมื่อบันทึกเป็น JPEG </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> เครดิตภาพ: Axel Grimard / <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> วิกิมีเดียคอมมอนส์ </a> </p> <p> นี่คือที่มาของไฟล์ Portable Network Graphics (PNG) พัฒนาโดย PNG Development Group สี่ปีหลังจากการเปิดตัว JPEG PNG รองรับการบีบอัดข้อมูลแบบไม่สูญเสียและความโปร่งใส จึงมักใช้ PNG หากต้องรักษาคุณภาพของรูปภาพและขนาดไฟล์ไม่ใช่ปัญหา </p> <p> หลักการทั่วไปที่ดีคือเก็บ JPEG ไว้ในภาพถ่าย และบันทึก PNG สำหรับรูปภาพที่มีความโปร่งใสและไม่ใช่รูปภาพ สำหรับข้อมูลเชิงลึกเพิ่มเติมเกี่ยวกับไฟล์ประเภทต่างๆ มากมาย (ไม่ใช่แค่รูปภาพ) โปรดดูคำแนะนำของเราที่ <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> รู้ว่าเมื่อใดควรใช้รูปแบบไฟล์ใด </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG และ JPG เป็นรูปแบบไฟล์เดียวกัน </h2> <p> แม้จะมีความสับสนที่ JPEG ทำให้เกิดการอัปเดตและรูปแบบต่างๆ มากมาย แต่การหลั่งไหลของภาพดิจิทัลบนอินเทอร์เน็ตในช่วงกลางทศวรรษที่ 90 นั้นสาเหตุหลักมาจากการเปิดตัวอย่างไม่ต้องสงสัย </p> <p> ครั้งต่อไปที่คุณพร้อมที่จะส่งออกรูปภาพจากโปรแกรมแก้ไขรูปภาพ และจะมีรายการรูปแบบที่มีให้เลือกมากมาย อย่าลืมว่า JPEG และ JPG เป็นไฟล์เดียวกัน </p>"}