{"title":"การอัปเดต WatchOS ล่าสุดป้องกันข้อผิดพลาดในการเชื่อมต่อกับ Apple Watch","content":"<p> ซอฟต์แวร์อัปเดต watchOS ล่าสุดของ Apple เวอร์ชัน 7.3.1 มีการแก้ไขที่สำคัญมาก ซึ่งก็คือการแก้จุดบกพร่องที่ทำให้อุปกรณ์ Apple Watch Series 5 และ Apple Watch SE บางรุ่นไม่สามารถชาร์จได้เมื่อเข้าสู่โหมดประหยัดพลังงาน </p> <p> บริษัทยังได้เปิดตัวโปรแกรมซ่อมแซมฟรีใหม่สำหรับอุปกรณ์ที่ได้รับผลกระทบซึ่งติดอยู่ในโหมดพลังงานต่ำนี้ และไม่สามารถออกจากระบบ ข้อบกพร่องนี้โดยพื้นฐานแล้ว &quot;อิฐ&quot; Apple Watch ทำให้ใช้งานไม่ได้อีกต่อไป </p> <h2 id=\"the-power-reserve-mode-bug\"> ข้อผิดพลาดของโหมดสำรองพลังงาน </h2> <p> โหมดประหยัดพลังงานเริ่มต้นเมื่อ Apple Watch เหลือแบตเตอรี่น้อย มันหยุดการสื่อสาร Apple Watch กับ iPhone ของคุณ นอกจากนี้ยังป้องกันไม่ให้ผู้ใช้เข้าถึงคุณสมบัติอื่นๆ บน Apple Watch หากต้องการออกจากโหมด Power Reserve ผู้ใช้ต้องชาร์จ Apple Watch </p> <p> บน <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> หน้าสนับสนุนเกี่ยวกับจุดบกพร่องและโปรแกรมซ่อมแซม </a> ลงวันที่ 15 กุมภาพันธ์ Apple เริ่มต้นด้วยการสังเกต: </p> <blockquote> <p> ลูกค้าจำนวนน้อยมากที่ใช้ Apple Watch Series 5 หรือ Apple Watch SE รุ่นที่ใช้ watchOS 7.2 หรือ 7.3 ประสบปัญหากับการไม่ชาร์จนาฬิกาหลังจากเข้าสู่โหมดสำรองพลังงาน </p> </blockquote> <p> ในการค้นหาว่าคุณมีรุ่น Apple Watch ที่ได้รับผลกระทบหรือไม่ Apple แนะนำให้วางนาฬิกาไว้บนที่ชาร์จและรออย่างน้อย 30 นาที หากไม่คิดค่าใช้จ่าย โปรดติดต่อฝ่ายสนับสนุนของ Apple แล้วพวกเขาจะจัดการส่งซ่อมทางไปรษณีย์ฟรี </p> <p> นาฬิกาจะได้รับการตรวจสอบเพื่อตรวจสอบว่านาฬิกาเข้าเกณฑ์ และหากเป็นเช่นนั้น การซ่อมแซมจะดำเนินการโดยไม่เสียค่าใช้จ่าย และนาฬิกาที่ได้รับการซ่อมแซมจะส่งคืนให้เจ้าของ </p> <p> ยังไม่ชัดเจนว่า Apple Watch ได้รับผลกระทบร้ายแรงจากบั๊กจำนวนเท่าใด อย่างไรก็ตาม ดูเหมือนว่าปัญหาจะมีผลกับชุดย่อยของ Apple Watch Series 5 หรือ Apple Watch SE รุ่นเท่านั้น และไม่มีรุ่นอื่นๆ </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> วิธีอัปเกรดเป็น WatchOS 7.3.1 </h2> <p> สำหรับผู้ที่ไม่เคยพบข้อบกพร่อง ก็ยังคุ้มค่าที่จะอัปเกรดเป็น watchOS เวอร์ชันล่าสุดเพื่อป้องกันตัวเองจากข้อผิดพลาดที่อาจเกิดขึ้น </p> <p> ความสำคัญของการแก้ไขข้อผิดพลาดนั้นบ่งชี้โดยข้อเท็จจริงที่ว่า Apple ผลัก watchOS 7.3.1 ออกไปยังผู้ใช้ทุกคนทันที ซึ่งตรงกันข้ามกับวิธีที่ปกติจะออกการอัปเดตซอฟต์แวร์โดยทำให้นักพัฒนาซอฟต์แวร์สามารถทดสอบเบต้าได้ในขั้นต้น <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple เปิดตัว watchOS 7.3 </a> ในปลายเดือนมกราคม </p> <p> ผู้ใช้สามารถดาวน์โหลด watchOS 7.3.1 โดยใช้แอพ Apple Watch บน iPhone การทำเช่นนี้พวกเขาต้องไปที่ <strong> ทั่วไป &gt; อัปเดตซอฟต์แวร์ </strong> . Apple Watch ของคุณต้องมีแบตเตอรี่อย่างน้อย 50 เปอร์เซ็นต์จึงจะสามารถอัปเดตได้ ต้องอยู่ใกล้กับ iPhone ของคุณด้วย </p>"}