{"title":"LastPass จะจำกัดให้คุณใช้อุปกรณ์ประเภทเดียวเว้นแต่คุณจะจ่าย You","content":"<p> LastPass ผู้จัดการรหัสผ่านยอดนิยม กำลังอยู่ระหว่างการเปลี่ยนแปลงครั้งใหญ่ ในเร็วๆ นี้ ผู้ที่ใช้บริการฟรีจะสามารถทำได้บนคอมพิวเตอร์หรือโทรศัพท์มือถือเท่านั้น แต่ไม่สามารถทำได้ทั้งสองอย่าง เว้นแต่จะจ่ายเงิน </p> <p> หมายความว่า LastPass ไม่ใช่ตัวเลือกที่น่าสนใจสำหรับผู้จัดการรหัสผ่านฟรีอีกต่อไป ในโลกที่เราสลับไปมาระหว่างคอมพิวเตอร์และโทรศัพท์มือถืออยู่ตลอดเวลา การมีผู้จัดการรหัสผ่านที่ใช้งานได้กับอุปกรณ์ประเภทเดียวเท่านั้นนั้นไม่มีประโยชน์ </p> <h2 id=\"what-s-changing-in-lastpass-free\"> มีอะไรเปลี่ยนแปลงใน LastPass ฟรี </h2> <p> ตามที่ประกาศใน <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> บล็อก LastPass </a> การเปลี่ยนแปลงกำลังดำเนินอยู่สำหรับโปรแกรมจัดการรหัสผ่านเวอร์ชันฟรี </p> <p> ปัจจุบัน LastPass Free ให้คุณใช้บริการได้กับทุกอุปกรณ์ของคุณ ไม่ว่าคุณจะใช้ LastPass บนคอมพิวเตอร์ แท็บเล็ต หรือมือถือ ไม่สำคัญ ทั้งหมดนั้นฟรี เนื่องจากมีการเปลี่ยนแปลงในวันที่ 16 มีนาคม 2021 </p> <p> จากนั้น LastPass Free จะรวมเฉพาะอุปกรณ์ประเภทเดียวเท่านั้น: คอมพิวเตอร์หรือโทรศัพท์มือถือ </p> <p> สำหรับ LastPass คอมพิวเตอร์ถูกจัดประเภทเป็นเดสก์ท็อปหรือแล็ปท็อป ในขณะที่โทรศัพท์มือถือคือโทรศัพท์มือถือ แท็บเล็ต และสมาร์ทวอทช์ </p> <p> เมื่อคุณเข้าสู่ระบบ LastPass ครั้งแรกในวันที่ 16 มีนาคม คุณจะต้องตั้งค่าประเภทอุปกรณ์ที่ใช้งานอยู่ </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> ตัวอย่างเช่น หากคุณเลือกคอมพิวเตอร์เป็นประเภทอุปกรณ์ของคุณ คุณจะสามารถใช้ LastPass บนอุปกรณ์เดสก์ท็อปและแล็ปท็อปของคุณได้ อย่างไรก็ตาม หากคุณต้องการใช้ LastPass บนอุปกรณ์พกพา คุณจะต้องอัปเกรดเป็น LastPass Premium </p> <p> ในทางใดทางหนึ่ง สิ่งนี้กำลังเปลี่ยนกลับเป็น LastPass แบบเก่า ความสามารถในการใช้ LastPass ได้ฟรีทั้งบนเดสก์ท็อปและมือถือนั้นจะมีให้ในปี 2015 เท่านั้น ก่อนหน้านั้น คุณต้องจ่ายค่าบริการผ่านมือถือ </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> การสนับสนุน LastPass ก็เปลี่ยนไปเช่นกัน </h2> <p> LastPass ยังเปลี่ยนวิธีการให้การสนับสนุนอีกด้วย ตั้งแต่วันที่ 17 พฤษภาคม 2021 เป็นต้นไป การสนับสนุนทางอีเมลจะมีให้สำหรับลูกค้า Premium และ Family เท่านั้น </p> <p> ผู้ใช้ฟรีจะติดอยู่กับบทความช่วยเหลือที่มีอยู่ในเว็บไซต์สนับสนุน LastPass หรือพวกเขาสามารถขอความช่วยเหลือภายในชุมชน LastPass </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> ทุกคนควรใช้ตัวจัดการรหัสผ่าน </a> . เป็นไปได้ว่าคุณจำเป็นต้องใช้มันบนเดสก์ท็อปและมือถือ LastPass รู้เรื่องนี้และให้การช่วยเหลือผู้ใช้ที่อัปเกรดเป็นบริการแบบชำระเงิน ซึ่งปัจจุบันมีส่วนลด 25% ในราคา $27/ปี </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> ถึงเวลาเปลี่ยนตัวจัดการรหัสผ่านแล้วหรือยัง? </h2> <p> หากคุณใช้ LastPass Free เป็นไปได้ว่าสิ่งนี้ทำให้คุณต้องพิจารณาเปลี่ยน ถ้าใช่ มีผู้จัดการรหัสผ่านที่ยอดเยี่ยมอีกมากมายที่คุณสามารถใช้กับอุปกรณ์ทั้งหมดของคุณได้ฟรี </p> <p> อีกครั้ง บางทีคุณอาจคิดว่ามันยุติธรรมที่คุณจ่ายเงินจำนวนเล็กน้อยให้กับ LastPass เพื่อสนับสนุนบริการที่มี </p>"}