{"title":"Microsoft&amp;#039;s Edge Browser เป็นโฮสต์ให้กับ Nintendo Game Emulators","content":"<p> Microsoft ได้นำเอาอีมูเลเตอร์เกมผิดกฎหมายจำนวนหนึ่งซึ่งซ่อนอยู่ในที่เก็บส่วนขยายเบราว์เซอร์ Microsoft Edge ร้านค้าส่วนขยายของ Microsoft Edge เป็นโฮสต์ของอีมูเลเตอร์หลายสิบตัว ซึ่งทำให้ผู้ใช้สามารถเล่นเกมที่เป็นสัญลักษณ์ได้หลายเกม </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft ลบ Emulators ส่วนต่อขยายที่ผิดกฎหมายออก </h2> <p> การซุ่มซ่อนในส่วนขยายของ Microsoft Edge เป็นเกมที่โดดเด่นที่สุดตลอดกาล รวมถึง Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2 และแม้แต่ Minecraft แต่ละเกมเปิดตัวภายในเบราว์เซอร์ในหน้าต่างอีมูเลเตอร์ และอนุญาตให้ผู้ใช้เล่นผ่านแต่ละชื่ออย่างเต็มรูปแบบ </p> <p> อย่างไรก็ตาม ไม่มีชื่อคลาสสิกใดที่ระบุถึงผู้พัฒนาเกมอย่างเป็นทางการ เช่น Nintendo, Sega, Atari และใช่ แม้แต่ Microsoft รายชื่อผู้พัฒนาที่มีรายชื่อ ได้แก่ Gamelands, Kday และ StayReal ซึ่งทั้งหมดเป็นเพียงเรื่องสมมุติและไม่มีลิงก์ไปยังผู้พัฒนาดั้งเดิม </p> <p> น่าแปลกที่บัญชี Twitter ของ Microsoft Edge Development อย่างเป็นทางการ <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> โพสต์เกี่ยวกับอีมูเลเตอร์ ดูเหมือนว่าจะโปรโมตเกมที่มีอยู่ในร้านส่วนขยายของเบราว์เซอร์ เราไม่พบทวีตต้นฉบับที่โปรโมตอีมูเลเตอร์ แต่มีให้คัดลอกผ่าน <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> รีเซเตรา </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> อีมูเลเตอร์ผิดกฎหมายหรือไม่? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> อีมูเลเตอร์ช่วยให้คุณเรียกใช้ซอฟต์แวร์ต่างๆ ได้ </a> บนคอมพิวเตอร์ของคุณ คุณยังสามารถใช้อีมูเลเตอร์เพื่อเล่นเกมเก่าได้อีกด้วย </p> <p> แม้ว่าอีมูเลเตอร์จะไม่ผิดกฎหมาย แต่การดาวน์โหลดเนื้อหาลิขสิทธิ์เพื่อเล่นบนอีมูเลเตอร์นั้น ทวีตจากบัญชี Microsoft Edge Development อย่างเป็นทางการเป็นการเคลื่อนไหวที่แปลกเนื่องจากอีมูเลเตอร์ดาวน์โหลดสำเนา ROM เกมใหม่เพื่อให้ผู้ใช้เล่น </p> <p> หัวข้อของการละทิ้งแวร์ก็ค่อนข้างเป็นพื้นที่สีเทาเช่นกัน เกม Abandonware จะไม่ถูกเผยแพร่อีกต่อไปและไม่มีจำหน่ายทางออนไลน์หรือในร้านค้าอีกต่อไป อย่างไรก็ตาม ในหลายกรณี ลิขสิทธิ์ของเกมเหล่านี้ยังไม่หมดอายุ แต่เจ้าของลิขสิทธิ์ไม่ได้บังคับใช้สิทธิ์ของตนอย่างจริงจัง </p> <p> </p> <p> ในหลายกรณี การละทิ้งแวร์เป็นสิ่งผิดกฎหมาย ถึงกระนั้น ก็ไม่มีคดีในศาลที่เกี่ยวข้องกับการละทิ้งแวร์ หรืออย่างน้อยก็ไม่มีคดีที่เกี่ยวข้องกับผู้พัฒนาเกมเก่าที่ดำเนินคดีกับใครบางคนเพื่อดาวน์โหลดชื่อซอฟต์แวร์ละทิ้ง </p> <p> ในตัวอย่างนี้ การจำลองเกมเก่าเหล่านี้ภายในเว็บเบราว์เซอร์นั้นผิดกฎหมาย นอกจากนี้ Nintendo ยังมีชื่อเสียงในการทำลายไซต์หรือบริการใดๆ ที่พยายามทำซ้ำหรือแจกจ่ายทรัพย์สินทางปัญญาของตน </p> <p> ขณะนี้เกมได้ถูกลบออกจากร้านส่วนขยายของ Microsoft Edge แล้ว ยิ่งไปกว่านั้น ยังไม่ทราบว่าเกมที่จำลองมาจบลงที่ส่วนขยายสโตร์หรือใครเป็นคนวางมันไว้ที่นั่น จำเป็นต้องพูดพวกเขาไม่น่าจะกลับมา </p>"}