{"title":"Microsoft พยายามซื้อ Pinterest แต่ดีลปิดแล้ว... สำหรับตอนนี้","content":"<p> Microsoft เพิ่งติดต่อ Pinterest เกี่ยวกับข้อตกลงการเข้าซื้อกิจการที่อาจเกิดขึ้นซึ่งจะมีจำนวนเท่ากับการเข้าซื้อกิจการที่ใหญ่ที่สุดแห่งหนึ่งของ Redmond ในปัจจุบัน การเจรจาไม่ได้ดำเนินไป แต่ขนาดของการควบรวมกิจการที่เสนอเป็นเครื่องหมายของแผนการเติบโตของไมโครซอฟต์ </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft ต้องการซื้อ Pinterest </h2> <p> ตามที่รายงานโดย <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> ภาวะเศรษกิจ </a> , Microsoft พยายามซื้อ Pinterest ซึ่งเป็นพินบอร์ดสำหรับงานอดิเรกที่ใหญ่ที่สุดในโลก </p> <p> ปัจจุบัน Pinterest มีมูลค่าประมาณ 51 พันล้านดอลลาร์ และมูลค่าตลาดเพิ่มขึ้นมากกว่า 600% ตลอดช่วงการระบาดใหญ่ของ COVID-19 เนื่องจากผู้คนออนไลน์ในช่วงล็อกดาวน์ ข่าวข้อตกลงการเข้าซื้อกิจการในอนาคตผลักดันสต็อกของ Pinterest ขึ้น 7% ก่อนที่ตลาดจะเปิดในวันพฤหัสบดีที่ 11 กุมภาพันธ์ </p> <p> การย้ายครั้งนี้จะทำให้ Pinterest เข้าสู่การเข้าซื้อกิจการเทคโนโลยีรายใหญ่ที่มีเสถียรภาพมากขึ้นเรื่อยๆ ของ Microsoft ในปี 2559 Microsoft เข้าซื้อ LinkedIn ในข้อตกลงมูลค่า 26 พันล้านดอลลาร์ ตามด้วยการซื้อ Github ในราคา 7.5 พันล้านดอลลาร์ในปี 2561 </p> <p> โดยไม่ต้องเอ่ยถึงว่า Microsoft เป็นเจ้าของ Minecraft ซื้อ 2.5 พันล้านดอลลาร์ในปี 2014 และการเข้าซื้อกิจการบริษัทเกมรายใหญ่อย่าง ZeniMax ด้วยมูลค่า 7.5 พันล้านดอลลาร์ ZeniMax เป็นบริษัทแม่ของสตูดิโอเกมเช่น Bethesda Softworks, id Software, Alpha Dog Games และ Tango Gameworks </p> <p> นอกจากนี้ยังมี <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> ล้มเหลวในการซื้อ TikTok&#39;s </a> สินทรัพย์ในอเมริกาเหนือ ออสเตรเลีย และนิวซีแลนด์ในช่วงกลางปี ​​2020 ในที่สุดข้อตกลงก็ล้มเหลว แต่มีมูลค่าระหว่าง 20-30 พันล้านดอลลาร์และมาหลังจากอดีตประธานาธิบดี <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> ทรัมป์ขู่แบน </a> เครือข่ายโซเชียลแชร์วิดีโอจากสหรัฐอเมริกาทั้งหมด </p> <p> หากข้อตกลง Pinterest ดำเนินต่อไป หรือหากข้อตกลงเสร็จสิ้นในภายหลัง จะกลายเป็นการเข้าซื้อกิจการที่ใหญ่ที่สุดของ Microsoft จนถึงปัจจุบัน </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> เหตุใด Microsoft จึงซื้อบริษัทเทคโนโลยีจำนวนมาก </h2> <p> Microsoft ไม่ได้ขาดแคลนเงินสดและต้องการขยายอาณาจักร หุ้นของบริษัทได้เพิ่มขึ้นประมาณ 80 เปอร์เซ็นต์ตั้งแต่เริ่มต้นการระบาดใหญ่ของโควิด-19 และเพิ่งเปิดเผยผลกำไรที่ทำลายสถิติเมื่อเร็วๆ นี้ </p> <p> </p> <p> การเข้าซื้อกิจการของแพลตฟอร์มอื่น เช่น Pinterest เป็นตั๋วสำหรับบริการอื่นๆ ของ Microsoft ปริมาณข้อมูลที่สร้างขึ้นโดยแพลตฟอร์มอย่าง LinkedIn เป็นเครื่องมือที่สมบูรณ์แบบสำหรับการฝึกอบรมเทคโนโลยี AI นอกจากนี้ การรับและจัดการบริการออนไลน์ขนาดใหญ่อย่าง Pinterest ยังทำหน้าที่เป็นโฆษณาสำหรับแพลตฟอร์ม Azure </p> <p> ตามที่รายงานของ Financial Times กล่าวถึงการควบรวมกิจการครั้งใหญ่ระหว่างบริษัทเทคโนโลยีสองแห่งจะทำให้การบริหารงานของประธานาธิบดี Biden ถูกทดสอบเช่นกัน ฝ่ายบริหารใหม่ยินดีที่จะอนุญาตให้ยักษ์ใหญ่ด้านเทคโนโลยีเช่น Microsoft, Google และ Facebook ซื้อการแข่งขันหรือไม่? เวลาเท่านั้นที่จะบอก. </p>"}