{"title":"Microsoft เปิดตัว Azure Into Space ด้วย Spaceborne Computer-2 . ของ HPE","content":"<p> ไมโครซอฟท์กำลังก้าวข้ามขอบโลกเพื่อให้บริการนอกโลก บริษัทจะทำงานร่วมกับ Hewlett Packard Enterprises เพื่อเชื่อมต่อกับพีซีบนสถานีอวกาศนานาชาติ (ISS) ผ่านแพลตฟอร์ม Azure </p> <p> Spaceborne Computer-2 จะเชื่อมต่อกับ Azure ผ่านสถานีภาคพื้นดินของ NASA และ HPE ซึ่งจะส่งมอบพลังการประมวลผลข้อมูลที่ยอดเยี่ยมให้กับสถานีอวกาศ </p> <h2 id=\"azure-heads-into-space\"> Azure มุ่งหน้าสู่อวกาศ </h2> <p> ตามที่รายงานเมื่อ <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> บล็อก Microsoft Azure </a> , Spaceborne Computer-2 (SBC-2) จะช่วยให้นักบินอวกาศ ISS ใช้เทคโนโลยีที่คล้ายกับภาคพื้นดิน </p> <p> ความหวังคือจะช่วยลดระยะเวลาที่ใช้ในการถ่ายโอนข้อมูลระหว่าง ISS กับ Earth ได้อย่างมาก รวมทั้งลดปริมาณแบนด์วิธที่จำเป็นสำหรับการประมวลผลและการวิเคราะห์ </p> <blockquote> <p> นักบินอวกาศและนักสำรวจอวกาศสมควรได้รับเทคโนโลยีการประมวลผลบนคลาวด์ที่ดีที่สุดและการประมวลผลขั้นสูงที่สุดยอด บางครั้งการวิเคราะห์จำเป็นต้องทำทันทีที่ขอบซึ่งทุกช่วงเวลาที่ผ่านไปนั้นมีค่า และในบางครั้งการวิเคราะห์นั้นซับซ้อนมากจนสามารถทำได้ด้วยพลังของคลาวด์ไฮเปอร์สเกลเท่านั้น </p> </blockquote> <p> Spaceborne Computer-2 ใช้ระบบ Edgeline Converged Edge ของ Hewlett Packard Enterprises ซึ่ง &quot;ออกแบบมาโดยเฉพาะสำหรับสภาพแวดล้อมขอบที่รุนแรง&quot; และจะนำฟังก์ชัน Azure จำนวนมากมาสู่ ISS </p> <p> เมื่อการเชื่อมต่อเริ่มต้นขึ้น SBC-2 จะช่วยให้การวิจัยในพื้นที่ต่างๆ รวมถึงการสร้างแบบจำลองสภาพอากาศสำหรับภารกิจดาวอังคารในอนาคต การวิเคราะห์พืชและไฮโดรโปนิกส์เพื่อสนับสนุนอาหารและการเจริญเติบโตของพืชผลในอวกาศ และการถ่ายภาพทางการแพทย์บน ISS ). </p> <p> Dr. Mark Fernandez สถาปนิกโซลูชันของระบบ Converged Edge Systems ที่ HPE และ Principal Investigator สำหรับ Spaceborne Computer-2 กล่าวว่า: </p> <blockquote> <p> ด้วยการนำ Spaceborne Computer-2 ของ HPE ซึ่งใช้ระบบ HPE Edgeline Converged Edge สำหรับการประมวลผลขอบขั้นสูงและความสามารถด้าน AI ด้วย Microsoft Azure เพื่อเชื่อมต่อกับคลาวด์ เราจึงช่วยให้นักสำรวจอวกาศสามารถส่งชุดข้อมูลขนาดใหญ่เข้าและออกได้อย่างราบรื่น Earth และได้รับประโยชน์จากประสบการณ์แบบ edge-to-cloud </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> ขั้นตอนต่อไปของ Azure Space Initiative ของ Microsoft </h2> <p> การประกาศของ Microsoft เป็นอีกก้าวหนึ่งสำหรับ <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Azure Space </a> ความคิดริเริ่มซึ่งเปิดตัวในเดือนตุลาคม 2020 </p> <p> ความคิดริเริ่มของ Azure Space เป็นความพยายามของ Microsoft ในการ &quot;ก้าวกระโดดครั้งใหญ่ในการประมวลผลแบบคลาวด์&quot; โดยนำแพลตฟอร์ม Azure cloud computing ไปสู่อวกาศ </p> <p> </p> <p> ก่อนหน้านี้ Azure Space ทำงานร่วมกับโครงการ SpaceX Starlink เพื่อส่งบรอดแบนด์ผ่านดาวเทียมไปยัง Azure Modular Datacenter (MDC) และยังคงทำงานในโครงการ Azure Orbital ซึ่งจะขยายการเชื่อมต่อระหว่างศูนย์ข้อมูลบนคลาวด์โดยใช้เทคโนโลยีดาวเทียม </p>"}