{"title":"Microsoft เปิดตัวแอพ Office ใหม่สำหรับ iPad","content":"<p> Microsoft ได้เปิดตัวแอป Office แบบครบวงจรสำหรับแท็บเล็ต Apple ด้วยสิ่งนี้ Word, Excel และ PowerPoint พร้อมให้ดาวน์โหลดครั้งเดียวบน iPhone และ iPad ใน <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> แอพสโตร์ </a> . Microsoft ยังคงให้แอป iPad เหล่านี้เป็นการดาวน์โหลดแบบสแตนด์อโลน </p> <h2 id=\"better-late-than-never\"> มาสายดีกว่าไม่มาเลย </h2> <p> &quot;เรากำลังรวมแอพ Word, Excel และ PowerPoint ที่คุณรู้จักเป็นแอพเดียวที่ปรับให้เหมาะกับ iPadOS&quot; Microsoft เขียนไว้ในบันทึกประจำรุ่นที่มาพร้อมกับการดาวน์โหลด นี่เป็นข่าวดีหากคุณใช้ Office และต้องการทำงานระหว่างเดินทาง สำหรับผู้ที่กำลังมองหา <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> เปลี่ยน iPad ให้เป็นแล็ปท็อปแทน </a> , นี่คือการเปิดตัวที่สำคัญ </p> <p> แอปมีให้บริการฟรี แต่การแก้ไขและฟังก์ชันขั้นสูงอื่นๆ จำเป็นต้องมีการสมัครใช้งาน Office 365 สำหรับผู้ที่สงสัย Microsoft เสนอตัวเลือกการสมัครรับข้อมูลในแอปต่างๆ เริ่มต้นที่ 6.99 เหรียญต่อเดือน </p> <p> หากคุณต้องการเพียงโปรแกรมประมวลผลคำบน iPad ของคุณ อาจเป็นความคิดที่ดีกว่าที่จะพิจารณาทางเลือกอื่นใน <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> บทสรุปของ MUO เกี่ยวกับแอพประมวลผลคำที่ดีที่สุดสำหรับ iPad </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> ประสบการณ์สำนักงานเคลื่อนที่แบบครบวงจร </h2> <p> เพื่อความชัดเจน นี่คือการอัปเดตสำหรับ Office ที่มีอยู่สำหรับ iOS ไม่ใช่รุ่นใหม่ <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> แอพ Office แบบ all-in-one เปิดตัวบน iPhone </a> และ Android ในเดือนกุมภาพันธ์ 2020 ไม่ชัดเจนว่าทำไม Microsoft ถึงใช้เวลาหนึ่งปีเต็มในการเพิ่ม Word, Excel และ PowerPoint เวอร์ชันที่ปรับให้เหมาะกับ iPad ในการมิกซ์ แต่มาช้าก็ดีกว่าไม่ </p> <p> </p> <p> ก่อนหน้าวันนี้ แอพเพิ่มประสิทธิภาพการทำงานที่รวมอยู่ในชุดโปรแกรมได้มอบประสบการณ์ระดับรองบน ​​iPad เนื่องจากเคยทำงานในโหมดหน้าต่าง แต่ด้วยการอัปเดตล่าสุดที่มีให้ใช้งานแล้ว ลูกค้า Apple สามารถมีประสบการณ์การใช้งาน Office แบบเนทีฟบน iPhone, iPad หรือ iPod touch โดยไม่คำนึงถึงขนาดหน้าจอ </p> <p> </p> <h2 id=\"ipad-specific-features\"> คุณสมบัติเฉพาะของ iPad </h2> <p> Microsoft ได้เพิ่มคุณสมบัติใหม่ที่ปรับให้เหมาะสมกับแท็บเล็ตไปยังข้อเสนอ Office บนมือถือเป็นประจำ ตัวอย่างเช่น เวอร์ชันมือถือของ Word, Excel และ PowerPoint เพิ่งได้รับการสนับสนุนสำหรับท่าทางเมาส์และแทร็คแพด แอพยังรองรับคุณสมบัติมัลติทาสก์แบบแยกมุมมองแบบเคียงข้างกันของ iOS </p> <p> แม้ว่า Office รุ่นมือถือและเดสก์ท็อปจะไม่มีฟีเจอร์เหมือนกันทั้งหมด แต่ Office ใหม่สำหรับ iOS จะนำเสนอฟีเจอร์ใหม่สองสามอย่าง สิ่งเหล่านี้ช่วยให้คุณทำสิ่งต่างๆ ได้ เช่น เซ็นเอกสารด้วย Apple Pencil หรือนิ้วของคุณ สร้าง PDF จากเอกสารของคุณอย่างรวดเร็ว แปลงรูปภาพเป็นข้อความและตาราง และอื่นๆ </p> <p> </p> <p> นอกจากนี้ คุณยังสามารถแทรกวันที่ รูปร่าง รูปภาพ และบันทึกย่อใน PDF ได้อย่างง่ายดาย สำหรับผู้ใช้ระดับสูง พวกเขาสามารถเข้าถึงการดำเนินการตามรูปภาพของ Office (เช่น สร้าง PPT, สร้าง PDF และอื่นๆ) ผ่านเมนูแชร์อเนกประสงค์ของ iOS &quot;นอกจากนี้ หากมีภาพหน้าจอล่าสุดเมื่อคุณเปิดแอป Office ภาพเหล่านี้จะปรากฏเป็นคำแนะนำในการแปลงเป็น PDF หรือ PPT&quot; บันทึกของบริษัท </p> <p> Microsoft จะทำการเปลี่ยนแปลงบางอย่างกับชุดโปรแกรม Office สำหรับ Mac และ Windows ด้วย ตามที่ผู้ผลิต Windows ระบุ การอัปเดตที่กำลังจะมีขึ้นสำหรับ Office สำหรับเดสก์ท็อปในปี 2021 จะมีใบอนุญาตถาวร นอกเหนือจากการปรับปรุงอื่นๆ </p>"}