{"title":"ผู้ร่วมก่อตั้ง Netflix วิจารณ์ Apple TV+ Video Strategy Video","content":"<p> Marc Randolph อดีตหัวหน้า Netflix ได้ประณามกลยุทธ์วิดีโอของ Apple โดยกล่าวว่า Apple TV+ นั้นล้าหลังคู่แข่งเนื่องจากบริการฟรีของบริษัทและขาดเนื้อหาที่น่าสนใจ </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple ไม่ได้อยู่ในการสตรีม &quot;ด้วยเท้าทั้งสองข้าง&quot; </h2> <p> หากคุณถามอดีต CEO ของ Netflix และ Marc Randolph ว่า Apple TV มีปัญหาเรื่อง Freeloader ซึ่งส่งผลให้บริการมีภาวะโลหิตจางมากขึ้นเมื่อเทียบกับ Netflix, Disney+ และบริการสตรีมมิ่งอื่นๆ ที่ประสบความสำเร็จ </p> <p> พูดกับ <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Yahoo Finance </a> เขากล่าวว่า Apple TV+ กำลังสิ้นเปลืองพลังงานไปกับโปรโมชันและข้อเสนอฟรี ในขณะที่ควรเน้นที่การเพิ่มเนื้อหาที่มีคุณภาพมากขึ้นเพื่อเพิ่มมูลค่า </p> <blockquote> <p> หาก Apple ใช้เวลาหนึ่งในสี่ของเวลากับเนื้อหามากเท่ากับที่พวกเขาทำในการแจกของรางวัล พวกเขาก็สามารถเล่นได้จริงๆ พวกเขาไม่มีข้อแก้ตัว [และ] พวกเขายังไม่ได้ใช้เท้าทั้งสองข้าง พวกเขาต้องทำสิ่งที่เป็นผู้ประกอบการจริงๆและเดินขึ้นไปที่ขอบหน้าผาแล้วกระโดด </p> </blockquote> <p> การกระโดดลงจากหน้าผาอาจพูดง่ายกว่าทำเพราะ Apple TV+ ขาดอำนาจทางการตลาดของดิสนีย์และการจดจำแบรนด์ของ Netflix ตอนนี้มันเป็นเรื่องของ <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney+ กับ Netflix </a> และบริการสตรีมมิ่งใดที่คุ้มค่าเงินที่สุดกับผู้มีโอกาสเป็นลูกค้า </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV+ มีอัตราการเลิกเล่นสูงสุด </h2> <p> Randolph ยืนหยัดต่อต้านการแจกของรางวัลและโปรโมชั่นในตลาดสตรีมมิ่ง โดยแนะนำว่า Apple TV+‌ มี &quot;อัตราการเลิกใช้งานสูงสุด&quot; ในบรรดาบริการหลัก </p> <blockquote> <p> คุณไม่สามารถแทนที่ผู้คนได้ คุณต้องให้เหตุผลที่จะอยู่ต่อ </p> </blockquote> <p> MoffettNathanson-HarrisX พบว่า 29 เปอร์เซ็นต์ของผู้ที่ลงทะเบียนผ่าน ฟรี ไม่ได้วางแผนที่จะสมัครรับข้อมูลใหม่เมื่อช่วงทดลองใช้ฟรีหมดอายุ ตามที่รายงานโดย <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> ความหลากหลาย </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> ข้อเสนอ Apple TV+ ฟรี </h2> <p> Apple ได้ให้บริการ Apple TV+ ฟรี 12 เดือนแก่ทุกคนที่ซื้ออุปกรณ์ใหม่ที่เข้าเกณฑ์จากบริษัท เช่น iPhone ใหม่ ในระหว่างนี้ <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple ได้ขยายเวลาการสมัครสมาชิกฟรี 1 ปี </a> สองครั้งสำหรับผู้ที่ลงทะเบียนในปี 2019 </p> <p> </p> <p> เป็นสัญญาณชัดเจนว่า Apple เองไม่เชื่อว่าบริการนี้มีเนื้อหาเพียงพอที่จะปรับราคาขอที่ $5/เดือน ดูอย่างอื่น: หาก Apple TV+ เกินประมาณการภายใน Apple คงจะโม้เกี่ยวกับจำนวนสมาชิกแล้ว </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney+ และ Netflix จัดการแข่งขันที่รุนแรง </h2> <p> เมื่อ 15 เดือนที่แล้ว Apple TV+ ได้เปิดตัวในเดือนพฤศจิกายน 2019 Disney+ ตามมาหลังจากนั้นไม่นาน Apple ไม่ได้เปิดเผยว่า Apple TV+ มีสมาชิกที่จ่ายเงินกี่คน แต่ Disney เพิ่งผ่านสมาชิก 94 ล้านคน เกินความคาดหมายของตัวเองมาก </p> <p> เมื่อเปรียบเทียบแล้ว Netflix นับลูกค้าที่จ่ายเงิน 204 ล้านคน ณ สิ้นปี 2020 Disney หวังว่าจะสามารถจับคู่ Netflix ในแง่ของสมาชิกได้ในเวลาเพียง 12 เดือน </p> <p> </p> <p> Randolph กล่าวว่า Disney+ ได้ &quot;ต่อสู้เพื่อตำแหน่งที่แข็งแกร่งจริงๆ&quot; ด้วยเนื้อหา “มันเป็นสงครามของผู้ที่เตรียมทำเนื้อหาจริงๆ” เขากล่าวเสริม </p> <blockquote> <p> เราเห็นกฎใหม่ของการพัฒนาเกม นี่ไม่ใช่แค่การประกาศ นี่ไม่ใช่แค่การโปรโมต---สิ่งที่คุณต้องแสดงให้เห็นคือคุณมีเนื้อหา เนื้อหา เนื้อหา </p> </blockquote> <p> อันที่จริงเกมนี้เกี่ยวกับเนื้อหา ตัวอย่างเช่น ตามที่ระบุไว้ใน <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> แผนสำหรับปี 2021 </a> , Netflix จะเปิดตัวภาพยนตร์ต้นฉบับเรื่องใหม่ทุกสัปดาห์ตลอดทั้งปี ในทางตรงกันข้าม Apple TV+ มีภาพยนตร์จำนวนหนึ่ง เช่น ละคร Greyhound ที่ทอม แฮงค์นำแสดงในภาพยนตร์สงครามโลกครั้งที่ 2 (อิงจากเหตุการณ์จริง) ละครต้นฉบับเรื่อง Palmer ที่นำแสดงโดยจัสติน ทิมเบอร์เลค และเรื่อง On The Rocks ของโซเฟีย คอปโปลา เป็นต้น </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> วิธีการเบิร์นช้าของ Apple </h2> <p> สิ่งที่แรนดอล์ฟไม่ยอมรับก็คือ Netflix และ Disney+ มีเนื้อหาจำนวนมากตั้งแต่วันแรก ในขณะที่ Apple TV+ กำลังสร้างไลบรารีเนื้อหาตั้งแต่เริ่มต้น </p> <p> เห็นได้ชัดว่า Apple เลือกใช้วิธีการแสดงแบบช้าๆ โดยเห็นได้จากการแสดงที่ไม่ค่อยสัมพันธ์กับ Disney+ และ Netflix ไม่ว่าคุณจะมองอย่างไร กลยุทธ์ของ Apple TV+ ดูเหมือนจะต้องการดึงดูดผู้คนด้วยข้อเสนอฟรีโดยหวังว่าบริการจะมีเนื้อหาที่มีคุณภาพเพียงพอที่จะเปลี่ยนลูกค้าฟรีให้เป็นสมาชิกที่ชำระเงิน </p>"}