{"title":"การศึกษาใหม่ระบุว่าผู้ใช้ Android สร้างพันธมิตรได้ดีกว่าผู้ใช้ iPhone","content":"<p> มีการต่อสู้ที่ไม่มีที่สิ้นสุดระหว่างผู้ใช้สมาร์ทโฟน iPhone และ Android แม้แต่ผู้ที่ไม่ได้เข้าร่วมการต่อสู้ก็ยังเลือกข้างโดยการเลือกสมาร์ทโฟนเท่านั้น </p> <p> มีริ้วรอยใหม่ในการต่อสู้เช่น <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> เปรียบเทียบMyMobile </a> ได้ทำการศึกษาเมื่อเร็ว ๆ นี้ว่าผู้ใช้ iPhone หรือ Android สร้างพันธมิตรความสัมพันธ์ที่ดีขึ้นหรือไม่ ปรากฏว่าผู้ใช้ iPhone มักจะมีนิสัยการใช้โทรศัพท์ที่น่ารำคาญมากกว่าผู้ใช้ Android ซึ่งทำให้สรุปได้ว่าผู้ใช้ Android เป็นพันธมิตรที่ดีกว่า </p> <p> แน่นอน ข้อมูลมีมากกว่าข้อสรุปง่ายๆ นั้น ดังนั้น เรามาเจาะลึกลงไปอีกเล็กน้อยแล้วมาดูกัน </p> <h2 id=\"iphone-and-android-relationship-study\"> การศึกษาความสัมพันธ์ของ iPhone และ Android </h2> <p> ข้อสรุปโดยรวมของการศึกษาคือผู้ใช้ Android สร้างพันธมิตรได้ดีกว่าผู้ใช้ iPhone แต่ผลลัพธ์นั้นลึกกว่าข้อสรุปผิวเผินนั้นมาก โดยรวมแล้ว การศึกษาได้สำรวจผู้ใช้มากกว่า 2,000 ราย ดังนั้นจึงเสนอขนาดตัวอย่างที่ใหญ่พอสมควร </p> <p> เมื่อพิจารณาถึงพฤติกรรมการใช้สมาร์ทโฟนที่น่ารำคาญที่สุด ผลการศึกษาพบว่าผู้ใช้ iPhone มีแนวโน้มที่จะกระทำความผิดมากกว่าผู้ใช้ Android ถึง 12 เปอร์เซ็นต์ อันที่จริง ผู้ใช้ iPhone กระทำการโหดร้ายในการใช้โทรศัพท์มากกว่าผู้ใช้ Android ในการสำรวจทุกประเภท </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> ตัวอย่างบางส่วนของความผิดที่น่ารำคาญ ได้แก่ ปล่อยให้คู่นอนอ่านหนังสือ ใช้โทรศัพท์ระหว่างดูหนัง และแม้กระทั่งใช้โทรศัพท์ขณะขับรถ (ซึ่งไม่เพียงแต่น่ารำคาญแต่ยังอันตรายอย่างเหลือเชื่อ) ผู้ใช้ iPhone มีแนวโน้มที่จะวางและทำลายโทรศัพท์มากกว่าผู้ใช้ Android ซึ่งเป็นสถิติที่น่าประหลาดใจอย่างแท้จริง </p> <p> นิสัยที่น่ารำคาญอื่นๆ ได้แก่ <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> คืบคลานเข้ามาในโปรไฟล์โซเชียลมีเดียของคนอื่น </a> ใช้ฟิลเตอร์มากเกินไปในรูปภาพ ส่งข้อความบรรทัดเดียวหลายข้อความ (ฉันรู้ว่าฉันทำแบบนี้มากเกินไป) และใช้โทรศัพท์ของพวกเขาขณะสนทนา </p> <p> ที่น่าสนใจคือ ผลการศึกษายังพบว่าผู้ชายมีแนวโน้มที่จะทำพฤติกรรมที่น่ารำคาญ (และในบางกรณีที่ไม่ปลอดภัยอย่างร้ายแรง) มากกว่าผู้หญิง </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> แต่ผู้ใช้ Apple จะได้รับวันที่มากขึ้น </h2> <p> จากการศึกษาอื่นที่เผยแพร่โดย CompareMyMobile ผู้ใช้ iPhone มักจะได้รับเดทในแอปหาคู่ออนไลน์ การศึกษาซึ่งตรวจสอบการกวาดนิ้วมากกว่า 50,000 ครั้ง พบว่าผู้ใช้ iPhone มีแนวโน้มที่จะออกเดทมากกว่าคนที่ใช้โทรศัพท์ Android ถึง 76 เปอร์เซ็นต์เมื่อพูดผ่านแอปหาคู่ </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> หากเป็นงานวิจัยชิ้นแรกที่เชื่อกัน ความสัมพันธ์อาจไม่สำเร็จเนื่องจากผู้ใช้ iPhone คืบคลานเข้ามาในโปรไฟล์โซเชียลมีเดียอื่นๆ และส่งข้อความขณะขับรถ ถึงกระนั้น พวกเขามักจะพบคู่ชีวิตคนต่อไปเมื่อความสัมพันธ์ครั้งก่อนไม่ราบรื่น </p> <p> ในที่สุด การออกเดทก็ไม่ง่ายเลย ดังนั้นพยายามอย่างเต็มที่เพื่อป้องกันไม่ให้โทรศัพท์ของคุณกลายเป็นอุปกรณ์ที่ฆ่าสิ่งที่ดี! </p>"}