{"title":"Parler กลับมาออนไลน์อีกครั้งหลังจากปิดตัวไปนานหลายเดือน","content":"<p> หลังจากถูก Big Tech ปิดตัว ในที่สุด Parler ก็ปรากฏตัวอีกครั้งบนเว็บ ผู้ใช้ปัจจุบันสามารถเข้าถึงแพลตฟอร์ม &quot;การพูดอย่างอิสระ&quot; และจะเริ่มยอมรับการลงทะเบียนผู้ใช้ใหม่ในไม่ช้า </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler กลับมารวมตัวอีกครั้งหลังจากเกิดไฟฟ้าดับครั้งใหญ่ </h2> <p> Parler ได้กลับมาอีกครั้งหลังจากไฟดับเป็นเวลานาน เครือข่ายสังคมทางเลือกได้รับแรงฉุดจากพรรคอนุรักษ์นิยมทางการเมืองและถูก <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> บูตโดย Amazon Web Services (AWS), Google และ Apple </a> หลังจากการจลาจลของ Capitol Parler ถูกกล่าวหาว่าไม่กลั่นกรองเนื้อหาที่มีความรุนแรง ส่งผลให้มีการนำเนื้อหาดังกล่าวออกจากร้านแอปและเว็บ </p> <p> Parler กำลังใช้โฮสต์ชื่อ SkySilk แทน AWS ไซต์ดังกล่าวยังจดทะเบียนชื่อโดเมนกับ Epik ซึ่งเป็นนายทะเบียนที่ให้บริการเครือข่าย &quot;free speech&quot; ประเภทอื่นๆ เช่น Gab </p> <p> ผู้ให้บริการโฮสต์และผู้รับจดทะเบียนโดเมนรายใหม่ไม่ได้เป็นเพียงการเปลี่ยนแปลงเดียวที่ Parler ได้ทำ— Parler ได้รวมเข้ากับ CEO ชั่วคราวคนใหม่ด้วย นี้มาทีหลัง <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> ทีม Parler ถูกกล่าวหาว่าไล่ออก John Matze . ผู้ร่วมก่อตั้ง </a> . </p> <p> Mark Meckler จะเข้ามาแทนที่ Matze ชั่วคราวในฐานะ CEO และก่อนหน้านี้ได้ร่วมก่อตั้งกลุ่ม Tea Party Patriots ฝ่ายขวา ในแถลงการณ์ที่ได้รับจาก <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> ภูเขา </a> , Meckler ประกาศการกลับมาของ Parler ที่รอคอยมานานโดยกล่าวว่า: </p> <blockquote> <p> เมื่อ Parler ถูกออฟไลน์ในเดือนมกราคมโดยผู้ที่ต้องการปิดปากชาวอเมริกันหลายสิบล้านคน ทีมงานของเราได้รวมตัวกัน มุ่งมั่นที่จะรักษาคำมั่นสัญญาที่ให้ไว้กับชุมชนที่มีส่วนร่วมสูงของเราว่าเราจะกลับมาแข็งแกร่งกว่าเดิม เรารู้สึกตื่นเต้นที่ได้ต้อนรับทุกคนกลับมา </p> </blockquote> <p> Meckler กล่าวต่อ โดยสังเกตว่า Parler จะยังคงทุ่มเทให้กับ &quot;เสรีภาพในการพูด ความเป็นส่วนตัว และการเจรจาทางแพ่ง&quot; นอกจากนี้เขายังให้ความมั่นใจกับผู้ใช้ว่า &quot;Parler ดำเนินการโดยทีมที่มีประสบการณ์และอยู่ที่นี่&quot; </p> <p> แม้ว่าบัญชีเก่าบนแพลตฟอร์มจะได้รับการสำรองข้อมูลแล้ว แต่โพสต์ที่เก่ากว่า (หรือ &quot;พาร์ลีย์&quot;) ยังไม่ได้รับการกู้คืน หากคุณมีบัญชีใน Parler แล้ว คุณสามารถใช้เว็บไซต์ต่อไปได้ มิเช่นนั้น คุณจะต้องรอประมาณหนึ่งสัปดาห์จึงจะสามารถลงทะเบียนได้ </p> <p> แต่แม้ว่าคุณจะมีบัญชี Parler แล้ว คุณอาจประสบปัญหาทางเทคนิคขณะใช้แพลตฟอร์ม ดูเหมือนว่าบริการยังไม่ได้รับการฟื้นฟูอย่างสมบูรณ์ </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> แอป Parler ยังคงอยู่ใน Limbo </h2> <p> Parler ยังคงถูกแบนจาก Google Play Store และ Apple App Store ซึ่งอาจเป็นอันตรายต่อฐานผู้ใช้อย่างรุนแรง แพลตฟอร์มดังกล่าวอาจยังคงใช้งานไม่ได้บนอุปกรณ์มือถือเป็นระยะเวลาหนึ่งโดยไม่ทราบสาเหตุ </p> <p> มีแนวโน้มว่าจะไม่สามารถกลับไปที่ Play Store หรือ App Store ได้ เว้นแต่จะเปลี่ยนนโยบายการดูแล ซึ่งเป็นสิ่งที่ Parler มักจะปฏิเสธที่จะทำ </p>"}