{"title":"คอนโทรลเลอร์ PS4 ไม่ทำงาน? วิธีแก้ไขปัญหาที่พบบ่อยที่สุด","content":"<p> โดยส่วนใหญ่แล้ว คอนโทรลเลอร์ PlayStation 4 ของคุณอาจทำงานได้ดี แต่เมื่อ DualShock 4 ของคุณหยุดเชื่อมต่อหรือตัดการเชื่อมต่อแบบสุ่ม มันน่าหงุดหงิด </p> <p> มาดูวิธีแก้ไขเมื่อคอนโทรลเลอร์ PS4 ของคุณไม่ทำงาน เพื่อให้คุณกลับไปเล่นได้ </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> คอนโทรลเลอร์ PS4 จะไม่จับคู่หรือเชื่อมต่อ </h2> <p> โดยปกติเมื่อคุณกดปุ่ม <strong> ปุ่ม PS </strong> บนคอนโทรลเลอร์ของคุณ ควรเปิดและเชื่อมต่อกับระบบของคุณ อย่างไรก็ตาม เมื่อไม่ได้เชื่อมต่อ คุณจะเห็นแถบไฟบนตัวควบคุมแฟลชชั่วครู่แทน จากนั้นจึงปิด </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> ซึ่งมักจะเกิดขึ้นหากคุณใช้ DualShock 4 กับอุปกรณ์อื่น ตัวอย่างเช่น ถ้าคุณ <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> จับคู่คอนโทรลเลอร์ PS4 ของคุณกับพีซี </a> หรือคอนโซลของเพื่อน มันจะจำอุปกรณ์นั้นต่อไป </p> <p> คุณจะต้องจับคู่ DualShock 4 กับ PS4 ของคุณใหม่ในกรณีเหล่านี้ ในการดำเนินการนี้ ให้เชื่อมต่อคอนโทรลเลอร์ของคุณกับ PS4 โดยใช้สายไมโคร USB ตรวจสอบให้แน่ใจว่าคุณใช้สายเคเบิลคุณภาพสูงที่คุณรู้ว่าใช้งานได้อย่างเหมาะสม </p> <p> </p> <p> กด <strong> ปุ่ม PS </strong> บนตัวควบคุมของคุณครู่หนึ่ง และไฟควรกะพริบชั่วครู่ก่อนที่จะเปลี่ยนเป็นสีน้ำเงิน นี่แสดงว่าคอนโทรลเลอร์ของคุณจับคู่และเชื่อมต่อสำเร็จแล้ว </p> <p> หากคุณมี DualShock 4 ที่จับคู่กับอุปกรณ์อื่นที่อยู่ใกล้เคียง เช่น โทรศัพท์หรือ PlayStation 5 การทำเช่นนี้มักจะเปิดและเชื่อมต่อคอนโทรลเลอร์กับอุปกรณ์นั้น คุณควรปิดและถอดปลั๊กอุปกรณ์ใดๆ ที่ DualShock 4 เชื่อมต่ออยู่ก่อน </p> <p> หลังจากที่คุณจับคู่คอนโทรลเลอร์ของคุณอีกครั้ง คุณสามารถถอดสาย USB และใช้คอนโทรลเลอร์แบบไร้สายได้ตามปกติ PS4 ของคุณจะจดจำมันไว้จนกว่าคุณจะจับคู่คอนโทรลเลอร์กับอุปกรณ์อื่นในอนาคต </p> <p> โปรดทราบว่าจำนวนคอนโทรลเลอร์ DualShock 4 สูงสุดที่คุณสามารถเชื่อมต่อกับ PS4 ได้ในคราวเดียวคือสี่ตัว หากคุณมีคอนโทรลเลอร์สี่ตัวที่เชื่อมต่ออยู่แล้ว คุณจะต้องถอดคอนโทรลเลอร์หนึ่งตัวออกเพื่อให้มีที่ว่างมากขึ้น </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> คอนโทรลเลอร์ PS4 ยังคงตัดการเชื่อมต่อ </h2> <p> หาก DualShock 4 ของคุณตัดการเชื่อมต่อแบบสุ่มขณะเล่น มีวิธีแก้ไขสองสามวิธีที่คุณสามารถลองได้ </p> <p> ขั้นแรก ตรวจสอบให้แน่ใจว่าได้ชาร์จแบตเตอรี่คอนโทรลเลอร์ของคุณแล้ว ฟังดูง่าย แต่ถ้าแบตเตอรี่ในคอนโทรลเลอร์ของคุณใกล้หมด แบตเตอรี่อาจตัดการเชื่อมต่อ ในการตรวจสอบอายุการใช้งานแบตเตอรี่ของคอนโทรลเลอร์ ให้กด . ค้างไว้ <strong> ปุ่ม PS </strong> เพื่อเปิด Quick Menu ทางด้านซ้ายของหน้าจอ คุณจะเห็นไอคอนตัวควบคุมพร้อมจอแสดงแบตเตอรี่ที่ด้านล่าง </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> เสียบคอนโทรลเลอร์ของคุณเข้ากับ PS4 แล้วไปที่ Quick Menu อีกครั้งเพื่อให้แน่ใจว่าคุณจะเห็นภาพเคลื่อนไหวการชาร์จแบตเตอรี่ หลังจากชาร์จคอนโทรลเลอร์ของคุณไประยะหนึ่งแล้ว ให้ลองใช้คอนโทรลเลอร์ตามปกติ </p> <p> หากแบตเตอรี่ไม่ใช่ปัญหาของคุณ ให้ตรวจสอบว่าคุณไม่ได้พยายามใช้คอนโทรลเลอร์ของคุณห่างจากระบบมากเกินไป ช่วงบลูทูธทั่วไปอยู่ที่ประมาณ 30 ฟุต; ขึ้นอยู่กับการตั้งค่าของคุณ คุณอาจใช้คอนโทรลเลอร์ได้ไกลกว่านี้ หรือจำกัดการใช้ให้ใกล้กว่านี้ก็ได้ ทั้งนี้ขึ้นอยู่กับการตั้งค่าของคุณ </p> <p> เมื่อพูดถึงเรื่องนี้ คุณควรพยายามลดการรบกวนระหว่างคอนโทรลเลอร์และคอนโซลของคุณ นำวัตถุที่เป็นโลหะระหว่างทั้งสองออก เช่น ชั้นวางหรือแล็ปท็อป ที่อาจขัดขวางสัญญาณ คุณควรนำ PS4 ออกจากพื้นที่ปิดที่มีอยู่เพื่อการส่งสัญญาณและการรับสัญญาณที่ดีขึ้น </p> <p> สุดท้ายนี้ อย่าลืมว่า PS4 มีการตั้งค่าที่จะปิดตัวควบคุมหลังจากที่ไม่ได้ใช้งานมาระยะหนึ่งแล้ว หากคุณไม่ต้องการให้คอนโทรลเลอร์ PS4 ปิดเมื่อคุณดูแอปสื่อ เช่น YouTube ให้ไปที่ <strong> การตั้งค่า &gt; การตั้งค่าประหยัดพลังงาน &gt; ตั้งเวลาจนกว่าตัวควบคุมจะปิด </strong> แล้วเลือก <strong> ไม่เคย </strong> . โปรดทราบว่าการดำเนินการนี้จะใช้แบตเตอรี่จนหมดแม้ในขณะที่คุณไม่ได้ใช้งาน </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> เคล็ดลับทั่วไปในการแก้ไขคอนโทรลเลอร์ PlayStation 4 </h2> <p> เราได้ดูการแก้ไขเฉพาะสำหรับปัญหา DualShock 4 ทั่วไปสองสามข้อข้างต้น ต่อไป มาดูวิธีแก้ปัญหาทั่วไปเพิ่มเติมสำหรับปัญหากับคอนโทรลเลอร์ PS4 ทำตามขั้นตอนเหล่านี้หากต้องการความช่วยเหลือเพิ่มเติม </p> <h3 id=\"restart-your-console\"> 1. รีสตาร์ทคอนโซลของคุณ </h3> <p> แม้ว่าปัญหาคอนโทรลเลอร์ส่วนใหญ่จะเกิดจากตัวคอนโทรลเลอร์เอง แต่มีโอกาสที่ PS4 ของคุณจะมีปัญหา หากต้องการแยกแยะสิ่งนี้ คุณควรรีสตาร์ทคอนโซลก่อนแก้ไขปัญหาเพิ่มเติม </p> <p> หากคอนโทรลเลอร์ของคุณทำงานเพียงพอที่จะเข้าถึงเมนูได้ ให้กด . ค้างไว้ <strong> ปุ่ม PS </strong> เพื่อเปิด Quick Menu จากนั้นไปที่ <strong> เปิด/ปิด &gt; รีสตาร์ท PS4 </strong> เพื่อรีบูตระบบของคุณ </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> ในกรณีที่คอนโทรลเลอร์ของคุณไม่ให้ความร่วมมือ ให้กดปุ่ม <strong> พลัง </strong> บนคอนโซล PS4 ของคุณจนกว่าคุณจะได้ยินเสียงบี๊บสองครั้ง การดำเนินการนี้จะปิดลงจนสุด (ไม่มีไฟที่ด้านหน้า)—เมื่อปิดเครื่องแล้ว ให้กด <strong> พลัง </strong> ปุ่มอีกครั้งเพื่อเปิดอีกครั้ง </p> <p> ลองใช้คอนโทรลเลอร์ของคุณอีกครั้งหลังจากรีบูตและดูว่าจะช่วยได้หรือไม่ </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. ลืมและจับคู่คอนโทรลเลอร์ PS4 ของคุณอีกครั้ง </h3> <p> หากคุณมีคอนโทรลเลอร์ PS4 ตัวที่สอง (หรือคอนโทรลเลอร์ PS Move) คุณสามารถใช้สิ่งนั้นเพื่อเข้าถึงเมนูที่ให้คุณลบคอนโทรลเลอร์ที่มีปัญหาได้ มุ่งหน้าสู่ <strong> การตั้งค่า &gt; อุปกรณ์ &gt; อุปกรณ์บลูทูธ </strong> แล้วเลือก <strong> DualShock 4 </strong> ทางเข้า—เป็นช่องที่ไม่มีไฟเขียวอยู่ข้างๆ </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> ในเมนูผลลัพธ์ ให้กด <strong> ตัวเลือก </strong> บนคอนโทรลเลอร์ของคุณแล้วเลือก <strong> ลืมอุปกรณ์ </strong> . การดำเนินการนี้จะทำให้ PS4 ของคุณลบออกจากหน่วยความจำ ดังนั้นคุณต้องจับคู่ใหม่อีกครั้ง </p> <p> นี่เป็นเวลาที่ดีที่จะลองใช้วิธีจับคู่ที่แตกต่างออกไปเล็กน้อย: ให้จับคู่ใหม่เมื่อเริ่มต้น ในการดำเนินการนี้ ให้ปิด PS4 ของคุณ (ตามที่อธิบายไว้ก่อนหน้านี้) เมื่อปิดเครื่องแล้ว ให้เชื่อมต่อคอนโทรลเลอร์ที่มีปัญหากับคอนโซลของคุณด้วยสาย USB ตี <strong> ปุ่ม PS </strong> เพื่อหวังว่าจะเปิดและจับคู่คอนโทรลเลอร์ของคุณในกระบวนการเดียว </p> <p> หากไม่ได้ผล ให้เปิด PS4 อีกครั้งแล้วลองจับคู่ตามปกติดังที่กล่าวไว้ข้างต้น </p> <h3 id=\"hard-reset-your-controller\"> 3. ฮาร์ดรีเซ็ตคอนโทรลเลอร์ของคุณ </h3> <p> หากการถอดและจับคู่คอนโทรลเลอร์ใหม่ไม่ได้ผล คุณสามารถลองทำตามขั้นตอนการรีเซ็ตแบบเต็มสำหรับ DualShock 4 ต่อไป คุณจะต้องใช้วัตถุปลายแหลมขนาดเล็ก เช่น คลิปหนีบกระดาษที่งอหรือเครื่องมือถอดซิมการ์ด เพื่อดำเนินการนี้ . </p> <p> ปิด PS4 แล้วพลิกคอนโทรลเลอร์ของคุณ คุณจะเห็นรูเล็กๆ ข้างสกรูตรงปุ่ม L2 (เมื่อพลิกกลับที่ด้านขวาของคอนโทรลเลอร์) ใช้เครื่องมือปลายแหลมเพื่อกดปุ่มภายในรูนี้ค้างไว้ประมาณห้าวินาที </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> เมื่อคุณทำเสร็จแล้ว ให้เชื่อมต่อคอนโทรลเลอร์ของคุณกับ PS4 อีกครั้งผ่านสาย USB และดูว่าจับคู่สำเร็จหรือไม่ </p> <h3 id=\"try-the-controller-elsewhere\"> 4. ลองใช้คอนโทรลเลอร์ที่อื่น </h3> <p> ณ จุดนี้ หากคุณยังไม่ได้ดำเนินการ คุณควรลองใช้ตัวควบคุมที่มีปัญหากับอุปกรณ์อื่น หากคุณมีปัญหาที่คล้ายกันใน PS4 ของเพื่อนหรือพีซีของคุณ แสดงว่าคอนโทรลเลอร์ของคุณมีข้อผิดพลาด </p> <p> เป็นความคิดที่ดีที่จะลองใช้คอนโทรลเลอร์ PS4 ตัวอื่นกับคอนโซลของคุณ ถ้าเป็นไปได้ หากคุณยืม DualShock 4 ของเพื่อนที่คุณรู้ว่าทำงานได้อย่างถูกต้องและพบว่ามีปัญหากับระบบของคุณ อาจมีบางอย่างผิดปกติกับการเชื่อมต่อไร้สายของ PS4 </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. ใช้คอนโทรลเลอร์ในโหมดมีสาย </h3> <p> ก่อนที่คุณจะเลิกใช้คอนโทรลเลอร์ คุณควรลองเล่นกับมันโดยเชื่อมต่ออย่างถาวรผ่านสาย USB อย่างไรก็ตาม โปรดทราบว่าวิธีนี้ใช้ได้กับคอนโทรลเลอร์ PS4 รุ่นปรับปรุงเท่านั้น คุณจะรู้ว่าคุณมีโมเดลนี้หากมีแถบไฟอยู่ภายในทัชแพดที่ด้านหน้าของคอนโทรลเลอร์ ถ้าไม่ คุณจะไม่สามารถบังคับการสื่อสารแบบมีสายได้ </p> <p> หากคุณยังไม่มี ให้ซื้อสายยาวเพื่อให้คุณสามารถเพลิดเพลินกับการเล่นเกมจากโซฟาได้ <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> ไอหลุน สามแพ็ค </a> สายเคเบิลไมโคร USB ขนาด 10 ฟุตเป็นตัวเลือกที่คุ้มค่า </p> <p> หากต้องการบังคับให้ PS4 เชื่อมต่อคอนโทรลเลอร์ผ่าน USB ให้ไปที่ <strong> การตั้งค่า &gt; อุปกรณ์ &gt; ตัวควบคุม &gt; วิธีการสื่อสาร </strong> แล้วเลือก <strong> ใช้สาย USB </strong> . วิธีนี้จะป้องกันไม่ให้ DualShock 4 ใช้ Bluetooth แม้ว่าจะเชื่อมต่อผ่าน USB </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> ตัวเลือกการแก้ไขฮาร์ดแวร์ DualShock 4 </h2> <p> เช่นเดียวกับฮาร์ดแวร์ส่วนใหญ่ คอนโทรลเลอร์ DualShock 4 มีการรับประกันหนึ่งปี หากคุณซื้อคอนโทรลเลอร์ PS4 ภายในปีที่แล้วและไม่สามารถแก้ไขได้ด้วยคำแนะนำข้างต้นทั้งหมด คุณควรไปที่ <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> หน้าแก้ไขและแทนที่ของ PlayStation </a> เพื่อส่งคำขอซ่อมแซมตัวควบคุมของคุณ </p> <p> มิฉะนั้น คุณสามารถลองแก้ไขฮาร์ดแวร์ด้วยตัวเองโดยเปิดคอนโทรลเลอร์ แต่อาจเป็นเรื่องยากหรือเป็นไปไม่ได้ ทั้งนี้ขึ้นอยู่กับปัญหาเฉพาะ เราขอแนะนำให้พูดคุยกับช่างซ่อมในพื้นที่ หากคุณไม่สะดวกที่จะทำเอง </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> ปัญหาคอนโทรลเลอร์ PS4 ได้รับการแก้ไขแล้ว </h2> <p> ตอนนี้คุณรู้วิธีแก้ไขปัญหาคอนโทรลเลอร์ PS4 ที่พบบ่อยที่สุดแล้ว ปัญหาเฉพาะเพิ่มเติม เช่น ปุ่มที่หยุดทำงาน โชคไม่ดีที่อยู่ภายใต้วิธีแก้ไขปัญหาฮาร์ดแวร์ที่กล่าวถึงข้างต้น </p> <p> หวังว่าปัญหาของคุณจะแก้ไขได้ง่าย แต่ถ้าไม่ใช่ และคุณจำเป็นต้องเลือกคอนโทรลเลอร์ PS4 ใหม่ คุณมีตัวเลือกที่ยอดเยี่ยมมากมาย </p> <p> <small> เครดิตภาพ: Joeri Mostmans / <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}