{"title":"รายงาน: Android 12 จะมีโหมดมือเดียว","content":"<p> เราได้เข้าสู่ช่วงของวงจรชีวิตของ Android 11 อย่างเป็นทางการแล้ว ซึ่งข่าวลือเกี่ยวกับ Android 12 นั้นเริ่มออกมาอย่างเต็มกำลัง </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> XDA Developers </a> ได้รายงานว่า Google กำลังทำงานในโหมดมือเดียวสำหรับ Android 12 ซึ่งจะทำให้ง่ายต่อการใช้งานโทรศัพท์ด้วยมือเดียว ไม่ว่าคุณจะมีมือใหญ่หรือเล็ก วิธีนี้จะช่วยเปิดวิธีใหม่ในการโต้ตอบกับอุปกรณ์ Android ของคุณ </p> <p> แน่นอนว่าผู้ผลิตอุปกรณ์หลายรายและ <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> นักพัฒนาซอฟต์แวร์ได้แนะนำโซลูชั่นเพื่อปรับปรุงการใช้งานด้วยมือเดียว </a> . ยังคงใช้งานได้ดียิ่งขึ้นเมื่อรวมเข้ากับระบบปฏิบัติการโดยตรง </p> <h2 id=\"android-12-s-one-handed-mode\"> โหมดมือเดียวของ Android 12 </h2> <p> ตามรายงาน Google กำลังวางแผนที่จะเพิ่มฟีเจอร์สำหรับใช้งานมือเดียวใน AOSP ซึ่งเป็น Android เวอร์ชันโอเพนซอร์สที่ผู้สร้างซอฟต์แวร์ทุกรายสามารถใช้ได้ในอุปกรณ์ของตน นอกจากนี้ยังหมายความว่า OEM ที่ยังไม่ได้พัฒนาโหมดมือเดียวของตนเองจะมีวิธีง่ายๆ ในการนำคุณลักษณะนี้ไปใช้กับอุปกรณ์ของตน </p> <p> สิ่งที่รายงานไม่ได้ระบุว่า Google จะกำหนดให้ผู้ผลิตโทรศัพท์ใช้คุณสมบัติมือเดียวของ Android 12 หรือไม่ หรือจะเป็นทางเลือก </p> <p> เนื่องจากยังเร็วอย่างไม่น่าเชื่อ เราจึงไม่ทราบแน่ชัดว่าโหมดมือเดียวของ Android 12 จะทำงานอย่างไร หากความสามารถที่ผ่านมาของ Google ในการเพิ่มฟีเจอร์ลงในระบบปฏิบัติการเป็นสิ่งบ่งชี้ เราคาดว่าบริษัทจะทำงานได้ดีกับการติดตั้งใช้งาน Google อาจเลือกที่จะย่อขนาดหน้าจอทั้งหมดให้เหลือเพียงมุมของอุปกรณ์เพื่อให้เข้าถึงได้ง่าย </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> รายงานยังระบุด้วยว่าโหมดมือเดียวของ Android 12 จะมีวิธีเรียกใช้โดยใช้โหมดสามปุ่มแบบเดิมร่วมกับโหมดการนำทางด้วยท่าทางสัมผัสที่ใหม่กว่า </p> <p> ดังที่กล่าวไว้ OEM สมาร์ทโฟนจำนวนมากได้นำคุณลักษณะนี้ไปใช้ใน Android เวอร์ชันดัดแปลงของตนเองแล้ว ตัวอย่างเช่น ที่จริงแล้ว Huawei พยายามส่งเวอร์ชันของฟีเจอร์ไปยัง AOSP แต่ Google ปฏิเสธ บางที Google อาจปฏิเสธเพราะบริษัทรู้ว่าตั้งใจที่จะนำคุณลักษณะเวอร์ชันของตัวเองมาใช้ </p> <p> เนื่องจากการรั่วไหลดังกล่าวยังเร็วเกินไป ยังไม่มีภาพถ่ายแสดงคุณลักษณะนี้ ดังนั้นเราจะต้องรอจนกว่า Android 12 จะเข้าใกล้การเปิดตัวมากขึ้น </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Android 12 จะออกเมื่อไหร่? </h2> <p> น่าเศร้าที่เราไม่ทราบแน่ชัดว่าเมื่อใดที่ Android 12 จะเปิดตัวสู่สาธารณะ (แม้ว่าจะไม่ใช้เวลาสักครู่) เรายังไม่ทราบแน่ชัดว่าคุณลักษณะนี้จะออกมาเมื่อใดสำหรับนักพัฒนา หรือรุ่นเบต้าหรือ Android ที่เสถียร </p> <p> เช่นเดียวกับฟีเจอร์ใหม่ๆ ของ Android เราจะต้องรอดูว่ามีมากับระบบปฏิบัติการหรือไม่ </p>"}