{"title":"กล้อง Sony FX3 เปิดเผยผ่าน Twitter Leak","content":"<p> เป็นเวลาเพียงสองสัปดาห์แล้วที่ Sony ประกาศเปิดตัว Sony A1 ซึ่งเป็นกล้อง 8.6K ที่สามารถจับภาพ 50MP ที่ความเร็วสูงสุด 30fps แต่บริษัทกำลังขยับขึ้นอีกนิดหรือไม่? </p> <p> ทั้งหมดที่เรามีในตอนนี้เป็นเพียงการเก็งกำไร แต่ Sony สามารถเพิ่มกล้องที่โฉบเฉี่ยวและกะทัดรัดให้กับซีรีส์ FX ได้ </p> <h2 id=\"a-preview-of-the-sony-fx3\"> พรีวิวของ Sony FX3 </h2> <p> เมื่อวันพุธที่ผ่านมา Nokishita ได้ทวีตภาพของ Sony FX3 ซึ่งเป็นกล้องที่อาจต้องการท้าทาย EOS C70 ของ Canon และ Pocket Cinema 6K ของ Blackmagic Design </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> ソニーFX3の画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> #噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> — 軒下デジカメ情報局 (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> 10 กุมภาพันธ์ 2564 </a></blockquote>  <p> Nokishita เป็นบล็อกเทคโนโลยีของญี่ปุ่นที่น่าอับอายสำหรับการรั่วไหลของอุปกรณ์ภาพถ่ายและวิดีโอที่จะเกิดขึ้นในช่วงต้นและแม่นยำ แม้จะไม่ใช่แหล่งข่าวอย่างเป็นทางการสำหรับบริษัทผลิตภัณฑ์เกี่ยวกับสายตา แต่บางคนก็พูดได้เต็มปากว่าข้อมูลที่ Nokishita แบ่งปันอาจได้รับการยืนยันเช่นกัน </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> TechRadar </a> เคยเรียกโนคิชิตะว่า &quot;ซานตาคลอสแห่งข่าวลือเรื่องกล้อง&quot; ในการตอบกลับทวีตข้างต้น ผู้ใช้ Twitter @miemelaar ถามว่า &quot;[เป็น] จริงหรือแนวคิด และ @rauuru_san ตอบกลับด้วยว่า &quot;ถ้า Nokishita เผยแพร่ มันคือเรื่องจริง&quot; </p> <p> แต่ถึงแม้เราจะถือว่าการรั่วไหลนั้นเป็นความจริง แต่ข้อมูลนั้นทิ้งเราไว้มากน้อยเพียงใด จริงไหม? </p> <p> เราสามารถสันนิษฐานได้ว่า FX3 เป็นส่วนหนึ่งของสาย FX เนื่องจากชื่อของมัน แต่กล้องมีสัญลักษณ์ที่ทำให้นักเก็งกำไรหลายคนสับสน หากเครื่องหมายอัลฟ่าสีขาว (α) ที่ด้านหน้าของกล้องดูคุ้นๆ สำหรับคุณ นั่นอาจเป็นเพราะคุณสามารถหาจุดเดียวกันได้บนกล้องมิเรอร์เลสของ Sony </p> <p> FX3 เป็นกล้องถ่ายภาพยนตร์ กล้องมิเรอร์เลส หรือไฮบริดสไตล์ DSLR บางประเภทใช่หรือไม่ เราจะต้องรอรายละเอียดเพิ่มเติมที่จะออกมา ก่อนหน้านั้น ลองอ่านบทความของเราเกี่ยวกับ <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> ความแตกต่างที่สำคัญระหว่างกล้องมิเรอร์เลส DSLR และกล้องวิดีโอ </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> Sony FX3 จะนำอะไรมาสู่โต๊ะ? </h2> <p> ตั้งแต่ทวีตของ Nokishita หลุดออกมา ข้อมูลจำเพาะของผลิตภัณฑ์ที่ถูกกล่าวหาของกล้องก็แพร่หลายไปทั่วเว็บ ยังไม่มีอะไรจากแหล่งใด ๆ ที่มีชื่อเสียงเท่าเทียม </p> <p> โชคดีที่เราควรหาข้อมูลเพิ่มเติมเกี่ยวกับ Sony FX3 ในอีกไม่กี่สัปดาห์ข้างหน้า งานถ่ายภาพที่ใหญ่ที่สุดของญี่ปุ่น CP+ 2021 กำลังจะมาในวันที่ 25-28 กุมภาพันธ์ </p>"}