{"title":"Surface Duo ได้รับวันวางจำหน่ายในสหราชอาณาจักรและลดราคา","content":"<p> Surface Duo ของ Microsoft ไม่ได้รับการต้อนรับที่ยอดเยี่ยมเช่นนี้ แต่ดูเหมือนว่าบริษัทจะกระตือรือร้นที่จะสร้างความประทับใจแรกพบที่ดีขึ้นนอกสหรัฐอเมริกา ไม่เพียงแต่บริษัทจะลดราคา Surface Duo เท่านั้น แต่ยังยืนยันวันวางจำหน่ายสำหรับตลาดสหราชอาณาจักรอีกด้วย </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> การเตรียมการในต่างประเทศขั้นสุดท้ายของ Microsoft สำหรับ Surface Duo </h2> <p> ข่าวนี้มาถึงเราจาก <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . หากคุณยังจำได้ ย้อนกลับไปเมื่อ Surface Duo เปิดตัว <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> ไม่ได้รับการวิจารณ์ที่ดี </a> . จุดยึดหลักจุดหนึ่งคือระบบปฏิบัติการของ Duo นั้นบั๊ก แต่อีกจุดหนึ่งคือราคาที่น่าจับตามองที่ 1399.99 ดอลลาร์ </p> <p> Microsoft ทำงานอย่างหนักเพื่อแก้ไขปัญหาสำคัญที่ผู้ตรวจสอบพบ แต่ป้ายราคาสูงก็ยังคงอยู่ที่เดิม อย่างไรก็ตาม Microsoft กำลังวางแผนที่จะลดราคา Surface Duo ลงอย่างมากเป็น 999.99 ดอลลาร์ </p> <p> การลดลงนี้น่าจะเป็นการเตรียมพร้อมสำหรับการเปิดตัวในต่างประเทศ เนื่องจากนักวิจารณ์ทั่วโลกเตรียมที่จะทำลาย Surface Duo ทีละนิ้ว ด้วยราคาที่ลดลงนี้ บวกกับการแก้ไขล่าสุดของระบบปฏิบัติการ Surface Duo ความมหัศจรรย์ของหน้าจอคู่อาจยังสร้างความประทับใจในเชิงบวกในต่างประเทศ </p> <p> Microsoft ยังได้ยืนยันเมื่อแฟน ๆ ในสหราชอาณาจักรสามารถทดลองใช้ Surface Duo ได้ด้วยตนเอง หากคุณอยู่ในสหราชอาณาจักร ให้จับตาดูร้านค้าปลีกอุปกรณ์อิเล็กทรอนิกส์ในวันที่ 18 กุมภาพันธ์ 2021 </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> เกาพื้นผิวของแผนการของ Microsoft ในต่างประเทศ </h2> <p> แม้ว่า Surface Duo จะพยายามสร้างความประทับใจที่ดีในสหรัฐอเมริกา แต่ก็ยังมีความหวังสำหรับในต่างประเทศ ด้วยการแก้ไขระบบปฏิบัติการของ Surface Duo ทั้งหมดรวมกับการลดราคานี้ หญ้าอาจเป็นสีเขียวในอีกด้านหนึ่ง </p> <p> หากคุณต้องการทราบว่าแพตช์ประเภทใดที่ Microsoft ได้ผลักดันให้กับ Surface Duo บริษัทเพิ่งเปิดตัวการอัปเดตความเสถียรบางอย่างเพื่อแก้ไขข้อบกพร่องก่อนเปิดตัว Duo ในต่างประเทศ </p> <p> <small> เครดิตภาพ: Jack Skeens / <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}