{"title":"Twitter ติดป้ายบัญชีส่วนตัวของข้าราชการ","content":"<p> เร็วๆ นี้ Twitter จะเริ่มติดป้ายกำกับในบัญชีส่วนตัวของเจ้าหน้าที่รัฐ ป้ายกำกับควรช่วยให้ผู้ใช้ระบุบุคคลที่เกี่ยวข้องกับรัฐบาลได้อย่างง่ายดาย </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> เจ้าหน้าที่ของรัฐจะได้รับฉลากบน Twitter มากขึ้น </h2> <p> ตามโพสต์บน <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> ทวิตเตอร์บล็อก </a> แพลตฟอร์มดังกล่าวจะเริ่มติดป้ายกำกับบัญชีส่วนตัวของ &quot;ประมุขแห่งรัฐ&quot; ในวันที่ 17 กุมภาพันธ์ พ.ศ. 2564 และจะติดป้ายกำกับในบัญชีที่เกี่ยวข้องกับสื่อในเครือของรัฐด้วย </p> <p> Twitter ยังขยายขอบเขตการเข้าถึงฉลากให้ครอบคลุมเจ้าหน้าที่ของรัฐในหลายประเทศ สถานที่เหล่านี้ ได้แก่ แคนาดา คิวบา เอกวาดอร์ อียิปต์ เยอรมนี ฮอนดูรัส อินโดนีเซีย อิหร่าน อิตาลี ญี่ปุ่น ซาอุดีอาระเบีย เซอร์เบีย สเปน ไทย ตุรกี และสหรัฐอาหรับเอมิเรตส์ </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> เครดิตภาพ: Twitter </p> <p> แพลตฟอร์มหวังว่าป้ายกำกับเหล่านี้จะช่วยให้ผู้ใช้ &quot;ได้รับประสบการณ์ที่มีข้อมูลมากขึ้นบน Twitter&quot; และยังมีแผนที่จะปรับแต่งข้อความของป้ายกำกับเพื่อ &quot;เพิ่มความเฉพาะเจาะจงมากขึ้น&quot; ด้วย &quot;ความแตกต่างระหว่างบุคคลและสถาบัน&quot; </p> <p> ป้ายกำกับคลื่นลูกแรกของ Twitter สำหรับบัญชีที่เชื่อมโยงกับรัฐบาลเปิดตัวในเดือนสิงหาคม 2020 ในขั้นต้น ป้ายกำกับเหล่านี้ใช้กับเจ้าหน้าที่ที่เกี่ยวข้องกับห้าประเทศในคณะมนตรีความมั่นคงแห่งสหประชาชาติเท่านั้น และไม่ได้รวมบัญชีส่วนตัวของเจ้าหน้าที่เหล่านั้น </p> <p> ที่กล่าวว่าป้ายกำกับเหล่านี้ไม่ใช่ <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> โจ่งแจ้งโจ่งแจ้งข้อมูลเท็จ </a> แต่ยังช่วยให้ผู้ใช้ได้รับบริบทเพิ่มเติมเกี่ยวกับสิ่งที่พวกเขาอ่านและที่มาของเนื้อหา </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter จะขยายป้ายกำกับต่อไปเท่านั้น </h2> <p> ในตอนท้ายของบล็อกโพสต์ Twitter ตั้งข้อสังเกตว่าหวังว่าจะขยายป้ายกำกับไปยัง &quot;ประเทศอื่น ๆ เมื่อเวลาผ่านไป&quot; ป้ายกำกับจะปรากฏเป็นธงสีเทาอ่อนบนโปรไฟล์ Twitter ของบุคคล และมีแนวโน้มว่าคุณจะเจอป้ายนี้บ่อยขึ้นในอีกไม่กี่สัปดาห์ข้างหน้า </p>"}