{"title":"รัฐบาลสหรัฐฯ ต้องการทราบความถูกต้องของป้ายกำกับความเป็นส่วนตัวของแอป","content":"<p> ด้วยป้ายกำกับความเป็นส่วนตัวของแอป iOS 14 ใน App Store ทาง Apple ได้มอบวิธีใหม่ในการเพิ่มขีดความสามารถให้กับผู้ใช้ด้วยการมีความรู้เพิ่มเติมเกี่ยวกับแอพที่พวกเขาใช้—และวิธีที่แอพเหล่านั้นอาจติดตามพวกเขา </p> <p> แต่ดูเหมือนว่ามันยังเปิดช่องเวิร์มสำหรับตัวเองด้วย เนื่องจากตอนนี้ Apple กำลังถูกผลักดันให้รับรองความถูกต้องของป้ายกำกับเหล่านี้ ซึ่งนักพัฒนาเริ่มส่งให้ Apple ในเดือนธันวาคม </p> <h2 id=\"concerns-over-accuracy\"> กังวลเกี่ยวกับความแม่นยำ </h2> <p> ตามที่ระบุไว้โดย <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumors </a> , Apple ได้รับ <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> จดหมาย </a> จากคณะกรรมการด้านพลังงานและการพาณิชย์แห่งสหรัฐอเมริกา ขอให้ชี้แจงข้อมูลเกี่ยวกับความถูกต้องของป้ายกำกับความเป็นส่วนตัวของแอปที่นักพัฒนาจัดหาให้ </p> <p> ป้ายกำกับเหล่านี้เป็นฟีเจอร์ที่คาดไม่ถึงในบางไตรมาสและน่ากลัวใน iOS 14 ที่จะบังคับให้นักพัฒนาเปิดกว้างมากขึ้นเกี่ยวกับวิธีที่แอพของพวกเขาโต้ตอบกับข้อมูลผู้ใช้ หมายความว่าผู้ใช้จะสามารถตัดสินใจอย่างมีข้อมูลมากขึ้นเมื่อพูดถึงประโยชน์และข้อเสียของการใช้แอพบางตัว </p> <p> </p> <p> ในจดหมายของคณะกรรมาธิการด้านพลังงานและการพาณิชย์แห่งสภาผู้แทนราษฎรแห่งสหรัฐอเมริกาขอให้ Apple เกี่ยวกับรายงานที่ระบุว่าป้ายกำกับความเป็นส่วนตัวของแอพบางรายการอาจให้ข้อมูลที่ &quot;ทำให้เข้าใจผิดและเป็นเท็จ&quot; แก่ผู้ใช้ อ้างอิงจากรายงานที่เผยแพร่เมื่อเดือนที่แล้วโดยอ้างว่าแอพจำนวนมากที่ได้รับค่ารักษาพยาบาลที่สะอาดอาจไม่บริสุทธิ์เท่าที่พวกเขาแนะนำ </p> <p> ปัญหาที่อาจเกิดขึ้นกับฟีเจอร์ iOS 14 คือต้องอาศัยความซื่อสัตย์ของนักพัฒนาในการบอกว่าข้อมูลถูกรวบรวมอย่างไร และเพื่อยืนยันว่าข้อมูลนี้ถูกต้อง Apple เองตั้งข้อสังเกตว่าข้อมูล &quot;ยังไม่ได้รับการยืนยันโดย Apple&quot; </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> การขอคำตอบจาก Apple </h2> <p> แม้ว่าดูเหมือนว่านักพัฒนาส่วนใหญ่จะเล่นอย่างยุติธรรมและปฏิบัติตามระบบการให้เกียรติ แต่นั่นไม่ใช่สิ่งที่สามารถมองข้ามได้ Apple จะตรวจสอบข้อมูลที่ส่งเป็นประจำ อย่างไรก็ตาม แอพจำนวนมหาศาลใน App Store ทำให้ Apple ไม่สามารถตรวจสอบทุกรายชื่อเป็นการส่วนตัวได้ </p> <p> จดหมายของคณะกรรมการพลังงานและการพาณิชย์ของสภาผู้แทนราษฎรแห่งสหรัฐอเมริกากล่าวต่อไปว่า: </p> <blockquote> <p> &quot;เราขอเรียกร้องให้ Apple ปรับปรุงความถูกต้องของป้ายกำกับความเป็นส่วนตัวของแอป เพื่อให้แน่ใจว่าผู้บริโภคจะได้รับข้อมูลที่มีความหมายเกี่ยวกับแนวทางปฏิบัติด้านข้อมูลของแอปของตน และผู้บริโภคจะไม่ได้รับอันตรายจากแนวทางปฏิบัติที่อาจเป็นการหลอกลวงเหล่านี้&quot; </p> </blockquote> <p> คณะกรรมการได้ขอให้ Apple ให้รายละเอียดเพิ่มเติมเกี่ยวกับกระบวนการตรวจสอบ ไม่ว่าจะแก้ไขป้ายกำกับความเป็นส่วนตัวของแอพหรือไม่หากพบว่าไม่เป็นความจริง รายละเอียดเกี่ยวกับสิ่งที่จะเกิดขึ้นเมื่อนักพัฒนาให้ข้อมูลที่ไม่ถูกต้อง และอื่นๆ </p> <p> พวกเขากำลังขอให้ Apple ตอบกลับด้วยข้อมูลที่ร้องขอภายในวันที่ 23 กุมภาพันธ์ </p> <p> <small> เครดิตภาพ: Jason Dent/ <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Unsplash CC </a></small> </p>"}