{"title":"VW อ้างว่า Apple ไม่สามารถขับขี่ได้ง่ายในอุตสาหกรรมรถยนต์","content":"<p> Herbert Diess ผู้บริหารระดับสูงของ Volkswagen Group ได้มองข้ามผลกระทบใดๆ ที่อาจเกิดขึ้นจาก Apple Car ต่ออุตสาหกรรมยานยนต์ โดยกล่าวว่า VW ไม่ได้ &quot;กลัว&quot; ต่อ Project Titan </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW &quot;ไม่กลัว&quot; ของ Apple Car </h2> <p> แม้ว่า Diess ยอมรับว่ารถยนต์แบรนด์ Apple อาจสมเหตุสมผล แต่เขาไม่คิดว่า Apple สามารถครองภูมิทัศน์การผลิตรถยนต์ &quot;ในชั่วข้ามคืน&quot; ได้เนื่องจากการแข่งขันที่รุนแรง การตัดเหล็กและการขายรถยนต์ให้กับผู้บริโภคที่จู้จี้จุกจิกเป็นธุรกิจที่ยากลำบาก เขาบอกเป็นนัย และเสริมว่านี่ไม่ใช่สาขาที่บริษัทใดบริษัทหนึ่งสามารถ &quot;เข้าครอบครองได้ในจังหวะเดียว&quot; </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> รอยเตอร์ </a> ถ่ายทอดสิ่งที่ Diess บอกกับ Frankfurter Allgemeine Sonntagszeitung ในการให้สัมภาษณ์: </p> <blockquote> <p> อุตสาหกรรมรถยนต์ไม่ใช่อุตสาหกรรมเทคโนโลยีทั่วไปที่คุณสามารถเข้าควบคุมได้ในจังหวะเดียว Apple จะไม่จัดการเรื่องนั้นในชั่วข้ามคืน ถึงกระนั้นเราก็ไม่กลัว </p> </blockquote> <p> ถึงกระนั้น รถแบรนด์ Apple ก็สมเหตุสมผลดีเมื่อพิจารณาจากความสามารถของ Apple ในด้านแบตเตอรี่ ซอฟต์แวร์ การออกแบบอุตสาหกรรม และทรัพยากรที่ดูเหมือนไม่มีที่สิ้นสุด ผู้บริหารกล่าวเสริม Apple ไม่ได้นำเสนอผลิตภัณฑ์เกี่ยวกับรถยนต์ใด ๆ นอกเหนือจาก <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> ซอฟต์แวร์แดชบอร์ด CarPlay </a> ที่ช่วยให้วิทยุในรถยนต์หรือเฮดยูนิตทำหน้าที่เป็นจอแสดงผลและตัวควบคุมสำหรับ iPhone </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> ความลับที่แย่ที่สุดของอุตสาหกรรม </h2> <p> แผนสำหรับ Project Titan (ชื่อรหัสภายในของ Apple Car) ยังไม่เปิดเผยต่อสาธารณะ แม้ว่าจะมีข่าวลือมากมายว่า <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple กำลังมองหาพันธมิตรทางธุรกิจกับ Hyundai/Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> มีการกล่าวว่า Apple ได้พูดคุยกับบริษัทรถยนต์อื่นแล้ว </a> และผู้ผลิตตามสัญญาต่างๆ ซึ่งรวมถึง Magna, Nissan และ Foxconn เกี่ยวกับการสร้างรถยนต์ขับเคลื่อนอัตโนมัติ แหล่งข่าวกล่าวว่า Apple Car อาจไม่มีพวงมาลัยเพราะอาจเริ่มแรก <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> มุ่งเน้นไปที่การจัดส่งอาหารและการดำเนินงานของโรโบแท๊กซี่ </a> ก่อนจำหน่ายให้กับผู้บริโภค </p> <p> </p> <p> ข้อคิดที่ใหญ่ที่สุดจากความคิดเห็นของเฮอร์เบิร์ตก็คืออุตสาหกรรมยานยนต์ให้ความสนใจกับ Project Titan อย่างใกล้ชิด เห็นได้ชัดว่าความคิดที่ว่า Apple เข้าสู่ภาคส่วนนี้ทำให้ผู้บริหารระดับสูงบางคนกังวล ที่กล่าวว่าประวัติศาสตร์เต็มไปด้วยผู้ที่น่าจะรู้จักดีกว่าเยาะเย้ย Apple ในการเข้าสู่หมวดหมู่ผลิตภัณฑ์ใหม่ </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Palm CEO หัวเราะเยาะ iPhone อย่างไร </h2> <p> ตัวอย่างที่ดีที่สุดคือ Ed Colligan อดีต CEO ของ Palm เพียงไม่กี่สัปดาห์ก่อนการเปิดตัว iPhone ครั้งแรกในปี 2550 Colligan หัวเราะกับแนวคิดที่ว่าบริษัทที่เป็นที่รู้จักในด้านการออกแบบคอมพิวเตอร์ที่สวยงามสามารถชนะใจลูกค้าในภาคธุรกิจสมาร์ทโฟนที่มีการแข่งขันสูง กล่าวว่า </p> <blockquote> <p> เราได้เรียนรู้และต่อสู้ดิ้นรนมาสองสามปีที่นี่เพื่อค้นหาวิธีสร้างโทรศัพท์ที่ดี พวกพีซีจะไม่เพียงแค่คิดออก พวกเขาจะไม่เพียงแค่เดินเข้าไป </p> </blockquote> <p> คล้ายกับที่ Colligan อธิบาย Apple ว่าเป็น &quot;พวกพีซี&quot; หัวหน้า Volkswagen พยายามมองข้ามแนวคิดที่ว่าบริษัทเทคโนโลยีสามารถเอาชนะใจลูกค้าในธุรกิจผลิตรถยนต์ได้ ประวัติศาสตร์จะแสดงให้เห็นว่าความคิดเห็นของเฮอร์เบิร์ตจะแก่กว่าของคอลลิแกนหรือไม่ </p>"}