{"title":"Volkswagen จะใช้ Microsoft Azure ในรถยนต์ไร้คนขับ","content":"<p> Microsoft กระตือรือร้นที่จะเข้าสู่ตลาดรถยนต์ไร้คนขับ แต่ไม่มีความชำนาญในการออกแบบและสร้างรถยนต์ อย่างไรก็ตาม มันสามารถจัดหาสมองที่อยู่เบื้องหลังรถยนต์อัจฉริยะได้ และ Volkswagen ก็สนใจที่จะใช้บริการของ Microsoft สำหรับรถยนต์ของตัวเอง </p> <h2 id=\"microsoft-and-volkswagen-s-partnership-for-automatic-cars\"> Microsoft จับมือ Volkswagen สำหรับรถยนต์อัตโนมัติ </h2> <p> ข่าวของการเป็นหุ้นส่วนนี้แตกออกใน <a href=\"https://www.reuters.com/article/us-microsoft-volkswagen/volkswagen-taps-microsofts-cloud-to-develop-self-driving-software-idUSKBN2AB0SZ\" target=\"_blank\" rel=\"nofollow noopener\"> รอยเตอร์ </a> . Volkswagen นำ Microsoft เข้ามาช่วยบุกเข้าสู่โลกของรถยนต์ไร้คนขับ </p> <p> Volkswagen เป็นเจ้าของบริษัทรถยนต์ไม่กี่แห่ง เช่น Audi, Porshe และ Lamborghini ปัญหาคือ วิศวกรในแต่ละบริษัทต่างก็ใช้เส้นทางของตนเองในการออกแบบรถยนต์ที่ขับเคลื่อนด้วยตนเองแทนการแบ่งปันข้อมูลซึ่งกันและกัน </p> <p> เพื่อแก้ปัญหานี้ Volkswagen ได้รวมวิศวกรด้านรถยนต์ที่ขับเคลื่อนด้วยตัวเองทั้งหมดไว้ในกลุ่มใหญ่กลุ่มเดียวที่เรียกว่า Car.Software แนวคิดคือกลุ่มสามารถรวมกันและสร้างแพลตฟอร์มสมาร์ทคาร์เพียงแพลตฟอร์มเดียวที่ Volkswagen สามารถใช้ได้กับรถยนต์ทุกคัน </p> <p> อย่างไรก็ตาม ตามที่ปรากฏ วิศวกรหลายคนใน Car.Software ยังคงใช้แพลตฟอร์มที่แตกต่างกันเพื่อพัฒนาโค้ดของตน ด้วยเหตุนี้ Volkswagen จึงหันไปหา Microsoft เพื่อช่วยให้ทุกคนมีแพลตฟอร์มพื้นฐานในการทำงาน </p> <p> นี่ไม่ได้หมายความว่ารถยนต์ของ Volkswagen นั้นใช้ Windows 10 หมด Microsoft มีแพลตฟอร์มอื่นที่เรียกว่า Azure ซึ่งออกแบบมาเพื่อเชื่อมต่ออุปกรณ์ Internet of Things (IoT) </p> <p> ถ้าฟังดูคุ้นๆ นั่นก็เพราะเป็นบริการเดียวกับที่ <a href=\"https://www.makeuseof.com/microsoft-powered-self-driving-car/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft เสนอให้ Cruise สำหรับรถยนต์ที่ขับเคลื่อนด้วยตนเอง </a> . ตอนนี้เป็นที่ชัดเจนว่าข้อตกลง Cruise ไม่ใช่ข้อตกลงครั้งเดียว Microsoft จริงจังกับการทำให้รถยนต์วิ่งบน Azure </p> <p> เมื่อพิจารณาว่า Azure ทำงานได้ดีเพียงใดสำหรับ Microsoft จึงไม่น่าแปลกใจที่ซอฟต์แวร์ยักษ์ใหญ่ต้องการโจมตีในขณะที่เตารีดร้อน การรวมกันของบริการ Azure และ Xbox ของ Microsoft มี <a href=\"https://www.makeuseof.com/microsoft-reveals-record-profits/\" target=\"_blank\" rel=\"nofollow noopener\"> ทำให้บริษัทมีกำไรที่เป็นระเบียบในช่วงการแพร่ระบาด </a> . </p> <p> ดังนั้นจึงมีแรงจูงใจอย่างมากที่จะนำ Azure มาใช้กับรถยนต์ที่ขับเคลื่อนด้วยตนเอง เพื่อให้มีสถานะที่ยิ่งใหญ่ยิ่งขึ้นในโลกของอุปกรณ์อัจฉริยะ สำหรับ Azure จะกลายเป็นผู้เล่นหลักในโลกของรถยนต์อัจฉริยะหรือไม่นั้นยังไม่มีใครเห็น </p> <p> </p> <h2 id=\"starting-the-engine-for-microsoft-azure\"> การสตาร์ทเครื่องยนต์สำหรับ Microsoft Azure </h2> <p> Microsoft Azure เป็นผู้ทำเงินรายใหญ่ให้กับยักษ์ใหญ่ด้านเทคโนโลยีอยู่แล้ว ซึ่งหมายความว่าบริษัทอยู่ในตำแหน่งที่สมบูรณ์แบบที่จะขยายสาขาไปสู่ดินแดนใหม่ ทั้งรถยนต์ไร้คนขับของ Cruise และ Volkswagen จะใช้ Microsoft Azure เป็นรากฐาน ซึ่งอาจกลายเป็นผู้เล่นสำคัญในอนาคตของยานยนต์ </p> <p> ในชะตากรรมที่บิดเบี้ยว การแข่งขันครั้งเก่าระหว่าง Microsoft และ Apple ได้แพร่กระจายไปสู่โลกของรถยนต์อัจฉริยะ แทนที่จะจัดหาเฉพาะผู้ผลิตรถยนต์ที่มีส่วน &quot;ฉลาด&quot; Apple ตั้งใจที่จะผลิต &quot;Apple Cars&quot; ที่สมบูรณ์ภายในปี 2567 </p> <p> <small> เครดิตรูปภาพ: Andrey Suslov / <a href=\"https://www.shutterstock.com/image-vector/autonomous-smart-car-scans-road-operates-635238704\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}