{"title":"MTA-STS คืออะไรและปกป้องอีเมลของคุณอย่างไร","content":"<p> อีเมลเป็นผู้ร้ายที่ใหญ่ที่สุดที่อยู่เบื้องหลังการโจมตีทางไซเบอร์ส่วนใหญ่ เป็นจุดเข้าใช้งานที่ง่ายสำหรับมัลแวร์ แอดแวร์ สแปม และฟิชชิง และให้โอกาสที่ไม่สิ้นสุดสำหรับผู้คุกคามในการเข้าถึงข้อมูลส่วนบุคคลของคุณ </p> <p> ในการบรรเทาภัยคุกคามเหล่านี้ ควรมีมาตรการรักษาความปลอดภัยที่เข้มงวดสำหรับบัญชีอีเมลส่วนบุคคลและบัญชีธุรกิจ </p> <h2 id=\"email-security-and-encryption\"> ความปลอดภัยของอีเมลและการเข้ารหัส </h2> <p> แม้ว่ารูปแบบการสื่อสารอื่นๆ จะได้รับความนิยม แต่การส่งข้อความอีเมลยังคงเป็นรูปแบบข้อมูลที่ใหญ่ที่สุดในการส่งสำหรับบุคคลหรือองค์กรใดๆ การรักษาความปลอดภัยเนื้อหาอีเมลของคุณเป็นสิ่งจำเป็นอย่างยิ่ง </p> <p> ความปลอดภัยของอีเมลมีการตรวจสอบและเข้ารหัสการรับส่งข้อมูลอีเมลขาเข้าและขาออกทั้งหมด การเข้ารหัสมีบทบาทสำคัญในการรักษาความเป็นส่วนตัวของเนื้อหาอีเมลโดยให้การเชื่อมต่อ SMTP (Simple Mail Transfer Protocol) ที่ปลอดภัย </p> <p> ก่อนหน้านี้ การเข้ารหัสเป็นเพียงข้อกำหนดทางเลือกสำหรับ SMTP </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> การเข้ารหัสอีเมลทำงานอย่างไร </h2> <p> การเข้ารหัสอีเมลเป็นกระบวนการในการเพิ่มรหัสหรือรหัสลงในเนื้อหาข้อความ ทำให้ไม่สามารถอ่านได้ ด้วยการแปลงข้อมูลอีเมลเป็นโค้ด เนื้อหาจะได้รับการปกป้องจากการเปิดเผยโดยไม่ได้รับอนุญาต พูดง่ายๆ ก็คือ อีเมลของคุณถูกรบกวน </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> เพื่อเพิ่มความปลอดภัย กระบวนการเข้ารหัสจะใช้คีย์สาธารณะและส่วนตัวซึ่งมีการแลกเปลี่ยนคีย์ที่เข้ารหัสเพื่อล็อคและปลดล็อกอีเมลที่เข้ารหัส ผู้ส่งเข้ารหัสอีเมลโดยใช้การเข้ารหัสคีย์สาธารณะ จากนั้นผู้รับจะใช้คีย์ส่วนตัวเพื่อถอดรหัสข้อความที่ได้รับ </p> <p> การเข้ารหัสจะนำไปใช้กับการเดินทางทั้งหมดของอีเมลตั้งแต่ต้นจนจบ ตามแนวทางปฏิบัติที่ดีที่สุด อีเมลขาเข้าและขาออกทั้งหมดควรได้รับการเข้ารหัส ไม่ใช่แค่อีเมลที่มีข้อมูลที่ละเอียดอ่อนเท่านั้น สิ่งนี้จะป้องกันไม่ให้ผู้คุกคามเข้าถึงจุดเข้าสู่ระบบของคุณ </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> ความเป็นมาและปัญหาเกี่ยวกับ SMTP </h2> <p> เมื่อโปรโตคอล SMTP เกิดขึ้นในปี 1982 การเข้ารหัสอีเมลไม่ใช่วิธีปฏิบัติทั่วไป และโดยค่าเริ่มต้น อีเมลจะถูกส่งและรับในรูปแบบข้อความธรรมดา ในการแนะนำการรักษาความปลอดภัยในระดับการขนส่ง คำสั่ง STARTTLS ถูกเพิ่มเข้ามาในช่วงปลายทศวรรษ 1990 ซึ่งเสนอตัวเลือกการเข้ารหัสผ่าน <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> โปรโตคอล TLS (Transport Layer Security) </a> . </p> <p> ดังที่สัญญาไว้เมื่อการอัปเกรด TLS ฟังดู ช่องโหว่ด้านความปลอดภัยสองรายการยังคงเหมือนเดิม: </p> <ol> <li> ตัวเลือกการเข้ารหัสคือ: <strong> ไม่จำเป็น </strong> . อีเมลที่ไม่ปลอดภัยยังคงมีอาละวาด ทำให้มีการโจมตีทางไซเบอร์เพิ่มขึ้นอย่างรวดเร็ว </li> <li> แม้ว่าจะมี STARTTLS อยู่แล้ว แต่ก็ไม่มีทางตรวจสอบตัวตนของเซิร์ฟเวอร์ของผู้ส่งได้ เนื่องจากเซิร์ฟเวอร์ SMTP ไม่ตรวจสอบใบรับรอง </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> การมาถึงของ MTA-STS </h2> <p> ในปี 2019 ในที่สุด Google ก็ก้าวขึ้นสู่ตำแหน่งและประกาศใช้มาตรฐาน MTA-STS (Mail Transfer Agent/Strict Transport Security) ใหม่ ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> ซึ่งจะทำให้ผู้ให้บริการอีเมลสามารถกำหนด TLS สำหรับการรักษาความปลอดภัยการเชื่อมต่อ SMTP และยังเสนอตัวเลือกในการปฏิเสธการส่งอีเมลไปยังโฮสต์ MX ที่ไม่มี TLS ที่มีใบรับรองเซิร์ฟเวอร์ที่เชื่อถือได้ </p> <p> ในที่สุด MTA-STS จะดูแลปัญหาก่อนหน้าทั้งหมดเกี่ยวกับ SMTP โดยบังคับใช้การเข้ารหัสระหว่างเซิร์ฟเวอร์ SMTP ที่สื่อสาร แต่มันทำงานอย่างไร? ลองหา! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> MTA-STS ทำงานอย่างไร </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS เริ่มทำงานโดยสั่งให้เซิร์ฟเวอร์ SMTP สื่อสารกับเซิร์ฟเวอร์ SMTP อื่นเท่านั้นโดยมีเงื่อนไขสองประการ: </p> <ol> <li> เซิร์ฟเวอร์ SMTP <strong> ต้อง </strong> ถูกเข้ารหัส </li> <li> ชื่อโดเมนบนใบรับรองของเซิร์ฟเวอร์ตรงกับโดเมนในนโยบาย และใบรับรองเป็นปัจจุบัน </li> </ol> <p> ด้วยการใช้ DNS และ HTTPS ร่วมกันเพื่อเผยแพร่นโยบาย MTA-STS จะแจ้งให้ฝ่ายส่งทราบถึงวิธีดำเนินการหากไม่สามารถเริ่มต้นช่องทางการสื่อสารที่เข้ารหัสได้ </p> <p> ง่ายต่อการติดตั้ง MTA-STS ที่ฝั่งผู้รับ แต่สำหรับผู้ส่ง ซอฟต์แวร์เซิร์ฟเวอร์อีเมลที่รองรับ เช่น <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> ควรใช้ </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> MTA-STS บรรเทาการโจมตีประเภทใด </h2> <p> ภัยคุกคามต่อไปนี้จะเกิดขึ้นทันทีหากใช้ MTA-STS กับการสื่อสารทางอีเมลของคุณ: </p> <p> <strong> การโจมตีแบบคนกลาง (MITM): </strong> การโจมตีนี้เกิดขึ้นเมื่อผู้โจมตีแทรกแซงตนเองระหว่างการสื่อสารระหว่างสองฝ่ายเพื่อขโมยหรือแก้ไขข้อมูล ในกรณีของอีเมล โดยทั่วไปจะหมายถึงเซิร์ฟเวอร์ SMTP ที่สื่อสารกันสองเครื่อง การใช้ MTA-STS สามารถป้องกันการโจมตีเหล่านี้ได้อย่างง่ายดาย </p> <p> <strong> ลดระดับการโจมตี: </strong> ผู้คุกคามบังคับให้ช่องสัญญาณเครือข่ายเปลี่ยนเป็นโหมดการรับส่งข้อมูลที่ไม่ปลอดภัย ตัวอย่างเช่น การโจมตีนี้อาจเปลี่ยนเส้นทางผู้เยี่ยมชมเว็บไซต์จากเวอร์ชัน HTTPS ของเว็บไซต์เป็นเวอร์ชัน HTTP MTA-STS ช่วยต่อสู้กับการโจมตีเหล่านี้โดยป้องกันการเข้าถึงโดยไม่ได้รับอนุญาต </p> <p> <strong> การโจมตีด้วยการปลอมแปลง DNS: </strong> การโจมตีที่ฉลาดแกมโกงเหล่านี้เปลี่ยนระเบียน DNS ของปลายทางที่ผู้ใช้ตั้งใจไว้ และหลอกให้เชื่อว่าพวกเขากำลังเยี่ยมชมไซต์หรือโดเมนที่ถูกต้อง การใช้ MTA-STS จะช่วยบรรเทาการโจมตีเหล่านี้ได้อย่างมาก </p> <p> </p> <p> ตอนนี้เราคุ้นเคยกับ MTA-STS แล้ว ก็ถึงเวลาที่จะสัมผัสกับมาตรฐานการรายงานใหม่สำหรับ SMTP ที่เรียกว่าการรายงาน TLS </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> การรายงาน SMTP TLS (TLS-RPT) คืออะไร </h2> <p> เช่นเดียวกับ MTA-STS TLS-RPT เป็นมาตรฐานการรายงานที่ตรวจจับปัญหาการเชื่อมต่อและความคลาดเคลื่อนระหว่างแอปพลิเคชันที่ส่ง เมื่อเปิดใช้งานแล้ว จะส่งรายงานรายวันเกี่ยวกับปัญหาการเชื่อมต่อที่เซิร์ฟเวอร์ภายนอกประสบขณะส่งอีเมลถึงคุณ </p> <p> ให้คิดว่าเป็นเครื่องมือแก้ไขปัญหาที่สามารถใช้รายงานเพื่อวัดและคัดแยกปัญหาที่อาจเกิดขึ้นและปัญหาการกำหนดค่าได้ </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> TLS-RPT สามารถแก้ไขปัญหาประเภทใดได้บ้าง </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> การรายงานการวินิจฉัย: </strong> การรายงาน TLS นำเสนอรายงานการวินิจฉัยในรูปแบบไฟล์ JSON ที่มีรายละเอียดที่ครอบคลุมเกี่ยวกับอีเมลขาเข้าที่ประสบปัญหาในการส่ง นอกจากนี้ยังตรวจพบอีเมลที่ตีกลับหรือไม่ส่งเนื่องจากการโจมตีดาวน์เกรด เป็นต้น </p> <p> <strong> การมองเห็นที่ดีขึ้น: </strong> เมื่อเปิดใช้งาน TLS-RPT คุณสามารถปรับปรุงการมองเห็นในช่องอีเมลทั้งหมดของคุณ วิธีนี้ช่วยให้คุณจับตาดูข้อมูลทั้งหมดที่กำลังมุ่งหน้าไป ซึ่งรวมถึงข้อความที่ล้มเหลวด้วย </p> <p> <strong> รายงานประจำวัน: </strong> รายงานการวินิจฉัยจะถูกส่งอย่างน้อยวันละครั้งเพื่อให้ครอบคลุมและปฏิบัติตามนโยบาย MTA-STS ในเชิงลึก รายงานยังรวมสถิติการเข้าชมและข้อมูลโดยละเอียดเกี่ยวกับข้อผิดพลาดและการส่งมอบที่ล้มเหลว </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> เมื่อทุกอย่างล้มเหลว การเข้ารหัสจะเหนือกว่า </h2> <p> เนื่องจากธรรมชาติของภัยคุกคามทางไซเบอร์มีการพัฒนาอย่างต่อเนื่อง มาตรการรักษาความปลอดภัยที่เข้มงวดและการเข้ารหัสจึงเป็นสิ่งจำเป็นสำหรับการส่งอีเมลที่ปลอดภัย </p> <p> ต้องขอบคุณผู้ให้บริการอีเมลหลายรายที่นำเสนอความสามารถในการเข้ารหัสที่แข็งแกร่งและมาตรฐาน MTA-STS การถ่ายโอนอีเมลที่ปลอดภัยอย่างสมบูรณ์จึงไม่ใช่เรื่องจริงอีกต่อไป </p>"}