{"title":"ความแตกต่างระหว่าง LAN และ WAN ในระบบเครือข่ายคืออะไร?","content":"<p> หากคุณเคยชินกับระบบเครือข่ายคอมพิวเตอร์ มีโอกาสสูงที่คุณจะเจอคำว่า &quot;LAN&quot; และ &quot;WAN&quot; อย่างไรก็ตาม แต่ละรายการหมายถึงอะไร และความแตกต่างเมื่อคุณเปรียบเทียบ LAN กับ WAN คืออะไร </p> <p> มาสำรวจเทคโนโลยีทั้งสองนี้กันและจุดไหนที่แต่ละเทคโนโลยีโดดเด่น </p> <h2 id=\"what-does-lan-stand-for\"> &quot;LAN&quot; ย่อมาจากอะไร? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> เครดิตรูปภาพ: ยา Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> LAN คือ &quot;เครือข่ายท้องถิ่น&quot; คำนี้อธิบายเครือข่ายที่อุปกรณ์ที่เชื่อมต่อทั้งหมดอยู่ใกล้กัน พวกเขาทั้งหมดอยู่ใน &quot;พื้นที่ท้องถิ่น&quot; จึงเป็นที่มาของชื่อ </p> <p> เมื่อคอมพิวเตอร์เชื่อมต่อกับ LAN จะได้รับที่อยู่อินเทอร์เน็ตโปรโตคอล (IP) ในพื้นที่ การทำงานนี้เหมือนกับที่อยู่ IP ที่คุณได้รับเมื่อคุณออนไลน์ อย่างไรก็ตาม ที่อยู่ IP ในเครื่องใช้งานได้กับคอมพิวเตอร์เครื่องอื่นบน LAN เดียวกันกับคุณเท่านั้น คุณไม่สามารถใช้ IP ในเครื่องเพื่อเชื่อมต่อกับพีซีของคุณผ่านทางอินเทอร์เน็ตได้ เป็นต้น </p> <p> เส้นขอบทางกายภาพของ LAN ที่บ้านของคุณไม่น่าจะออกจากบ้านของคุณ แน่นอน ถ้าคุณนำโทรศัพท์หรือแล็ปท็อปออกไปที่สวนเพื่อรับอากาศบริสุทธิ์ เครื่องจะยังคงอยู่ใน LAN อย่างไรก็ตาม โดยส่วนใหญ่แล้ว อุปกรณ์ที่เชื่อมต่อเครือข่ายทั้งหมดของคุณจะปลอดภัยภายในผนังทั้งสี่ของบ้านคุณ </p> <p> บริษัทและสถาบันต่างๆ ก็ผลิต LAN ด้วยเช่นกัน ตัวอย่างเช่น มหาวิทยาลัยอาจเชื่อมต่อพีซีทุกเครื่องในห้องสมุดเข้ากับเครือข่าย เพื่อให้ทุกคนสามารถพูดคุยกันได้ ธุรกิจต่างๆ ก็ชอบใช้ LAN เพราะช่วยให้พนักงานสามารถส่งไฟล์และโต้ตอบกันได้โดยไม่ต้องออนไลน์ </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> &quot;WAN&quot; ย่อมาจากอะไร? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> เครดิตภาพ: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> ในทางกลับกัน เรามีเครือข่ายบริเวณกว้างหรือ WAN หากคุณกำลังอ่านบทความนี้ แสดงว่าคุณเชื่อมต่อกับ WAN แล้ว เราต้องการเรียกสิ่งนี้ว่าอินเทอร์เน็ต </p> <p> &quot;กว้าง&quot; ในเครือข่ายบริเวณกว้างมีความแปรปรวนสูง หากคุณเชื่อมต่อกับเซิร์ฟเวอร์ภายนอกในเมืองเดียวกับคุณ นั่นคือ WAN นอกจากนี้ยังถือว่าเป็น WAN หากคุณเชื่อมต่อกับเซิร์ฟเวอร์ในประเทศที่อยู่อีกฟากหนึ่งของโลก </p> <p> ด้วยเหตุนี้ โดยทั่วไปแล้ว WAN จึงใช้เพื่ออธิบายเครือข่ายที่คุณเชื่อมต่อซึ่งอยู่นอกเราเตอร์ของคุณ ไม่สำคัญว่าเซิร์ฟเวอร์จะอยู่ห่างออกไปหนึ่งไมล์หรือหนึ่งทวีป มันยัง &quot;กว้าง&quot; </p> <p> อินเทอร์เน็ตไม่ใช่ WAN เดียวที่มีอยู่ ธุรกิจใช้ประโยชน์จาก WAN เพื่อเชื่อมต่อสำนักงานที่อยู่ในประเทศต่างๆ ตัวอย่างเช่น หากธุรกิจมีสำนักงานในนิวยอร์ก โตเกียว และซิดนีย์ ก็สามารถจ้างระบบ WAN ของตนเองเพื่อให้พวกเขาสามารถพูดคุยกันได้ </p> <p> แต่เดี๋ยวก่อน ทำไมบริษัทต่างๆ ถึงสร้าง WAN ของตัวเองในเมื่อพวกเขาสามารถเชื่อมต่อทุกอย่างเข้ากับอินเทอร์เน็ตได้ ปัญหาของการแก้ปัญหานี้คือบริษัทจะต้องจ่ายค่าธรรมเนียม ISP และหากมีสิ่งใดผิดพลาด พวกเขาจะต้องต่อสู้กับ ISP ดังกล่าวเพื่อแก้ไข </p> <p> ไม่เพียงเท่านั้น แต่อินเทอร์เน็ตยังได้รับการออกแบบมาเพื่อรองรับการเชื่อมต่อกับพีซีจำนวนมากทั่วโลก หากบริษัทต้องการให้พีซีของตนเชื่อมต่อกับพีซีในสำนักงานอื่นๆ เท่านั้น พวกเขาสามารถใช้ WAN ของตนเองเพื่อป้องกันตนเองจากภัยคุกคามออนไลน์ได้ สิ่งนี้เรียกว่า &quot;อินทราเน็ต&quot; </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> เมื่อใดควรใช้ LAN กับ WAN </h2> <p> เมื่อคุณต้องการเชื่อมต่อกับอุปกรณ์อื่นที่คุณเป็นเจ้าของ คุณสามารถเลือกได้ผ่าน LAN หรือ WAN แต่ข้อดีและข้อเสียของแต่ละรายการมีอะไรบ้าง และคุณควรใช้อย่างไร </p> <p> สมมติว่าคุณมีฮาร์ดไดรฟ์ไร้สายตัวใหม่ที่เชื่อมต่อกับเราเตอร์ของคุณ และคุณสามารถเลือกที่จะอนุญาตการเชื่อมต่อจากอินเทอร์เน็ต (WAN) หรือเก็บไว้ในเครื่อง (LAN) อันไหนที่คุณเลือกขึ้นอยู่กับสิ่งที่คุณต้องการจากฮาร์ดไดรฟ์ </p> <p> การให้ความสามารถของ WAN แก่ฮาร์ดไดรฟ์นั้นยอดเยี่ยมเพื่อความสะดวก วิธีนี้แสดงบนอินเทอร์เน็ต ซึ่งหมายความว่าคุณสามารถเชื่อมต่อได้จากทุกที่ในโลก ดังนั้น คุณจะไม่ติดค้างเมื่อไม่มีไฟล์ของคุณอีกต่อไป พวกเขาจะเชื่อมต่ออินเทอร์เน็ตออกไป </p> <p> อย่างไรก็ตาม การเชื่อมต่อ WAN ยังอนุญาตให้ผู้อื่นเข้าถึงอุปกรณ์ของคุณได้ หากความปลอดภัยของฮาร์ดไดรฟ์ของคุณไม่ได้มาตรฐาน แฮ็กเกอร์สามารถใช้เส้นทางเดียวกับที่คุณทำเพื่อดูข้อมูลทั้งหมดของคุณและคัดลอกหรือลบสิ่งสำคัญ </p> <p> ในทางกลับกัน การวางฮาร์ดไดรฟ์ให้อยู่ในโหมด LAN เท่านั้น จะป้องกันฮาร์ดไดรฟ์จากบางช่องทางที่แฮ็กเกอร์สามารถทำได้ มันไม่ทน ตัวอย่างเช่น อาจมีคนใช้พีซีของคุณเพื่อเข้าถึงฮาร์ดไดรฟ์ อย่างไรก็ตาม มันปลอดภัยกว่าการเผยแพร่ฮาร์ดไดรฟ์บน WAN ทุกวันทั้งคืน </p> <p> หากคุณต้องการเพิ่มความปลอดภัยจริงๆ คุณสามารถ air-gap ฮาร์ดไดรฟ์ได้ Air-gapping หมายความว่าเครื่องและพีซีทุกเครื่องบนเครือข่ายเดียวกันไม่ได้เชื่อมต่อกับ WAN เช่นอินเทอร์เน็ต เป็นต้น </p> <p> อัน <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> คอมพิวเตอร์แบบ air-gapped ไม่ปลอดภัยจากภัยคุกคามออนไลน์ทั้งหมด </a> แต่ลดโอกาสการโจมตีลงอย่างมาก แฮ็กเกอร์จำเป็นต้องชักใยให้มนุษย์ทำการประมูลเพื่อโจมตีอุปกรณ์ที่มีช่องว่างอากาศ โดยใช้กลวิธีทางวิศวกรรมสังคมเพื่อเข้าถึง </p> <p> ดังนั้น เมื่อเลือกระหว่างการวางอุปกรณ์บนอินเทอร์เน็ตหรือล็อกอุปกรณ์ไว้บน LAN ที่บ้าน คุณต้องพิจารณาว่าคุณจะเชื่อมต่ออุปกรณ์นั้นผ่านอินเทอร์เน็ตจริงหรือไม่ หากคุณไม่คิดว่าจะทำ ทางที่ดีควรปิดความสามารถของ WAN และป้องกันไม่ให้แฮกเกอร์เข้ามา </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> การเชื่อมต่ออินเทอร์เน็ตเปลี่ยน LAN เป็น WAN หรือไม่ </h2> <p> สมมติว่าคุณมีการตั้งค่า LAN โดยที่อุปกรณ์ทั้งหมดของคุณเชื่อมต่อกับเราเตอร์ คุณเบื่อ เลยเปิดคอมพิวเตอร์แล้วตรงไปที่ Netflix ตอนนี้พีซีของคุณเชื่อมต่อกับ WAN: อินเทอร์เน็ต </p> <p> อย่างไรก็ตาม เนื่องจากพีซีของคุณเชื่อมต่อกับ WAN นั่นหมายความว่าคอมพิวเตอร์ของคุณไม่ได้เป็นส่วนหนึ่งของ LAN อีกต่อไปแล้วใช่หรือไม่ โชคดีที่อุปกรณ์สามารถเป็นส่วนหนึ่งของทั้ง LAN และ WAN ได้ในเวลาเดียวกัน </p> <p> จำได้ไหมว่าเราพูดว่าอุปกรณ์ LAN มีที่อยู่ IP ในเครื่องของตัวเอง? ไม่ได้หมายความว่าจะไม่สามารถรับที่อยู่ IP ของอินเทอร์เน็ตได้เช่นกัน อันที่จริง หากคุณกำลังอ่านบทความนี้บนอุปกรณ์ที่เชื่อมต่อกับเราเตอร์ ก็จะมีทั้งสองอย่าง </p> <p> หากคุณต้องการตรวจสอบด้วยตัวเอง เราจัดให้ <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> วิธีตรวจสอบที่อยู่ IP ของคุณบน Windows </a> . ถ้าใช้มือถือก็ยังได้ <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> ค้นหาที่อยู่ IP ของคุณบน Android หรือ iPhone </a> . </p> <p> เมื่อคุณมีสถิติแล้ว คุณควรเห็นที่อยู่ IP สองที่อยู่ อันแรกจะขึ้นต้นด้วย &quot;192.168&quot; นั่นคือที่อยู่ IP ในเครื่องของคุณ คุณใช้อุปกรณ์นี้หากต้องการเชื่อมต่อกับอุปกรณ์ปัจจุบันจากอุปกรณ์อื่นในเครือข่ายเดียวกัน </p> <p> อันที่สองจะมีลักษณะอย่างใดอย่างหนึ่งจากสองลักษณะ ขึ้นอยู่กับว่าคุณใช้ IPv4 หรือ IPv6 หากคุณใช้ v4 ควรมีลักษณะเหมือนที่อยู่ IP ในเครื่องของคุณ แต่จะไม่ขึ้นต้นด้วย &quot;192.168&quot; หากเป็น IPv6 ควรเป็นตัวอักษรและตัวเลขที่ยุ่งเหยิง โดยแบ่งออกเป็นแปดช่วงตึกด้วยเครื่องหมายทวิภาค </p> <p> ไม่ว่าจะด้วยวิธีใด ที่อยู่นั้นก็คือที่อยู่ IP อินเทอร์เน็ตของคุณ ใช้เมื่อคุณเชื่อมต่อกับเซิร์ฟเวอร์อื่นบนอินเทอร์เน็ตเพื่อให้สามารถพูดคุยกับคุณได้ ตัวอย่างเช่น เพื่อส่งรายการทีวีที่คุณกำลังรับชมบน Netflix </p> <p> ในทางหนึ่ง คุณสามารถจินตนาการว่าอินเทอร์เน็ตเป็นเครือข่าย LAN ขนาดใหญ่ เมื่อคุณดู Netflix พีซีของคุณ (บน LAN ส่วนตัวของคุณ) กำลังรับข้อมูลจากเซิร์ฟเวอร์ Netflix (ซึ่งอยู่บน LAN ของตัวเอง) แต่ละ LAN เปรียบเสมือนบ้านในเมือง ในขณะที่การเชื่อมต่ออินเทอร์เน็ตก็เหมือนถนนและถนนที่เชื่อมต่อกันทั้งหมด </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> การล้างความสับสนของ LAN กับ WAN </h2> <p> LAN และ WAN มักจะทำงานควบคู่กัน แต่ทำงานในลักษณะที่ต่างกัน ตอนนี้คุณรู้ความแตกต่างระหว่างทั้งสองและเมื่อใดควรใช้แต่ละอัน </p> <p> คุณรู้หรือไม่ว่าคุณสามารถตั้งค่าเกม LAN เพื่อให้คนในเครือข่ายเดียวกันสามารถเล่นกันได้? เป็นวิธีที่ดีในการใช้เวลากับเพื่อน ๆ โดยไม่มีปัญหาเวลาแฝงที่บางครั้งมีการเล่นเกมทางอินเทอร์เน็ต </p> <p> <small> เครดิตภาพ: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}