{"title":"อีกไม่นานคุณจะได้เล่นเกมด้วยตัวละคร MetaHuman ของ Epic","content":"<p> หากคุณคิดว่าเกมดูสมจริงในตอนนี้ ให้รอจนกว่าคุณจะได้รู้ว่า Epic Games ทำอะไรได้บ้างจาก Unreal Engine เตรียมที่จะมีความคิดของคุณเป่า. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games เปิดตัว MetaHumans ใหม่ </h2> <p> คุณอาจสงสัยว่าโลกที่เรากำลังพูดถึงคืออะไร MetaHuman Creator เป็นฟีเจอร์ล่าสุดที่ Epic Games ได้เพิ่มลงใน Unreal Engine; สภาพแวดล้อมการพัฒนาซอฟต์แวร์ ซึ่งผู้พัฒนาเกมสามารถใช้เพื่อสร้างชื่อของตนได้ </p> <p> อ้างอิงจาก an <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> โพสต์บล็อก Unreal Engine </a> ประกาศเครื่องมือพัฒนาใหม่ที่น่าตื่นเต้น: </p> <blockquote> <p> MetaHuman Creator เป็นแอปสตรีมบนคลาวด์ที่ออกแบบมาเพื่อสร้างมนุษย์ดิจิทัลแบบเรียลไทม์จากสัปดาห์หรือเดือนเหลือน้อยกว่าหนึ่งชั่วโมง โดยไม่กระทบต่อคุณภาพ </p> </blockquote> <p> ดังนั้นจึงเป็นแนวทางสำหรับนักพัฒนาเกมในการสร้างโทรสารที่เหมือนจริงอย่างไม่น่าเชื่อ เร็ว. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> ผู้สร้าง MetaHuman หมายถึงอะไรสำหรับนักพัฒนา? </h2> <p> </p> <p> ความหมายที่มีต่อการพัฒนาซอฟต์แวร์คือการเปลี่ยนแปลงเกม (เล่นสำนวนเจตนา) ลองนึกภาพว่านักพัฒนาจะสร้างโลกของเกมด้วย NPC ได้เร็วแค่ไหนโดยใช้ MetaHuman Creator ไม่เพียงเท่านั้น แต่มนุษย์ดิจิทัลก็ดูเหลือเชื่อเช่นกัน </p> <p> นี่ยังหมายความว่านักพัฒนาสามารถจบเกมได้เร็วขึ้น ดังนั้นคุณจึงไม่ต้องรอจนถึงความล่าช้านับไม่ถ้วน MetaHuman Creator ช่วยให้นักพัฒนาสร้างจำนวน NPC ของพวกเขาได้อย่างรวดเร็ว ทำให้มีเวลาเหลือสำหรับเรื่องอื่นๆ ที่เร่งด่วนกว่า </p> <p> แต่ทำไมต้องใช้เครื่องมือนี้? Epic Games อธิบายว่า: </p> <blockquote> <p> การสร้างมนุษย์ดิจิทัลคุณภาพสูงหนึ่งคนนั้นยากและใช้เวลานาน การปรับขนาดความพยายามนั้นเพื่อสร้างมนุษย์ดิจิทัลที่หลากหลายที่มีคุณภาพซึ่งต้องการโดยแพลตฟอร์มยุคหน้าและการผลิตเสมือนจริงระดับไฮเอนด์นั้นเป็นงานที่น่าเกรงขามอย่างแท้จริง </p> </blockquote> <p> ดังที่เราได้กล่าวไปแล้ว เครื่องมือนี้ช่วยประหยัดเวลาและปรับปรุงเวิร์กโฟลว์ ทำให้นักพัฒนาสามารถมอบเกมคอนโซลรุ่นใหม่ที่พวกเขาสมควรได้รับ </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> ผู้สร้าง MetaHuman จะส่งผลต่อเกมอย่างไร? </h2> <p> ต้องขอบคุณ MetaHuman Creator เกมต่างๆ อาจได้รับการปล่อยตัวเร็วกว่ามากสำหรับการเริ่มต้น ด้วยเครื่องมืออันทรงพลังเช่นนี้ นักพัฒนาสามารถปรับปรุงกลไกของเกมหรือใช้เวลามากขึ้นในการแก้ไขจุดบกพร่องจริง ๆ ก่อนที่จะปล่อยเกมที่เสีย... </p> <p> อย่างไรก็ตาม นอกจากความขมขื่นแล้ว เครื่องมือพัฒนาของ Epic ดูเหมือนจะเป็นสิ่งที่จะทำให้เกมดูดีขึ้นอีกด้วย คุณต้องดูที่การเรนเดอร์เท่านั้นเพื่อดูว่ามนุษย์ดิจิทัลน่าทึ่งแค่ไหน เมื่อเราเห็นพวกเขาในเกมคือเมื่อเวทมนตร์ที่แท้จริงจะเกิดขึ้น </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> เราจะเห็น MetaHumans ในเกมเมื่อใด </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> นั่นเป็นเรื่องยากที่จะพูด ปัจจุบัน Epic ได้ตรึงซอฟต์แวร์ Creator สำหรับการทดสอบการเข้าถึงล่วงหน้าใน &quot;อีกไม่กี่เดือนข้างหน้า&quot; ดังนั้นคุณจะไม่เห็น MetaHumans ใดๆ อีกในเร็วๆ นี้ </p> <p> หากคุณอยากลองสร้างมนุษย์ดิจิทัลของคุณเอง คุณต้องรอหากต้องการใช้ MetaHuman Creator ของ Unreal Engine คุณสามารถลองรวมเข้าด้วยกันในโปรแกรมอื่นได้เสมอ แต่จะใช้เวลาไม่เกินหนึ่งชั่วโมงอย่างแน่นอน! </p>"}