{"title":"คุณอาจได้รับ Microsoft Teams Pro ใหม่ฟรี","content":"<p> เมื่อไม่นานมานี้ เราได้ครอบคลุมบริการสมัครใช้งานที่วางแผนไว้สำหรับ Microsoft Teams ที่เรียกว่า &quot;Teams Pro&quot; ซึ่งจะปลดล็อกคุณลักษณะเพิ่มเติมสำหรับซอฟต์แวร์ อย่างไรก็ตาม Microsoft ได้บันทึกไว้ว่าบางคนจะได้รับ Teams Pro โดยไม่มีค่าใช้จ่ายเพิ่มเติมสำหรับแผนปัจจุบันของพวกเขา </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> คำชี้แจงของ Microsoft เกี่ยวกับการสมัครสมาชิก Teams Pro ฟรี </h2> <p> ในกรณีที่คุณต้องการเตือนความจำ ก่อนหน้านี้เราได้กล่าวถึงหัวข้อนี้ในส่วนของเราเกี่ยวกับ <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro เพิ่มการสัมมนาผ่านเว็บในบริการ </a> . </p> <p> ตอนนี้ บทความโดย <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> ในหัวข้อเดียวกันตั้งแต่นั้นมาได้รับคำสั่งจากไมโครซอฟท์ คำแถลงนี้เป็นข่าวดีสำหรับผู้ที่กังวลเกี่ยวกับการจ่ายเงินเพิ่มเติมสำหรับการสัมมนาผ่านเว็บ: </p> <blockquote> <p> เมื่อวันที่ 9 กุมภาพันธ์ เราได้เผยแพร่โพสต์ MC เกี่ยวกับแผนบริการ Teams Pro ใหม่ เพื่อชี้แจง จะไม่มีการเปลี่ยนแปลงในใบอนุญาตผลิตภัณฑ์ที่มีอยู่ด้วยการเพิ่มแผนบริการใหม่นี้ แต่แผนบริการจะเพิ่มโดยอัตโนมัติใน Microsoft 365 และ Office 365 E5/E3/A5/A3 และสิทธิ์การใช้งาน Microsoft 365 Business Standard/Business Premium และจะช่วยให้ผู้ใช้ที่ได้รับสิทธิ์การใช้งานสำหรับ SKU เหล่านี้ได้รับความสามารถโดยอัตโนมัติ ทีมในอนาคตอันใกล้นี้ </p> </blockquote> <p> Microsoft กล่าวต่อไปว่าผู้ดูแลระบบไม่จำเป็นต้องทำอะไรเพื่อเปิดใช้งานคุณสมบัติใหม่เหล่านี้ นอกจากนี้ ใครก็ตามที่มีใบอนุญาตที่เข้ากันได้ตามรายการข้างต้นจะได้รับคุณสมบัติใหม่ที่ยอดเยี่ยมเหล่านี้โดยไม่มีค่าใช้จ่ายเพิ่มเติม </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> รับสิ่งเดียวกันมากขึ้นด้วย Microsoft Teams </h2> <p> Microsoft กำลังเปิดตัวแผนการสมัครสมาชิก Teams Pro ใหม่ที่ปลดล็อกการสัมมนาผ่านเว็บและอื่นๆ อีกมากมาย แต่ไม่ใช่ทุกคนจะต้องจ่ายเพิ่มสำหรับแผนการนี้ หากคุณสมัครรับสิทธิ์ใช้งานอย่างใดอย่างหนึ่งข้างต้น คุณสามารถรอรับฟีเจอร์ Teams Pro ทั้งหมดได้โดยไม่มีค่าใช้จ่ายเพิ่มเติม </p> <p> ไม่ได้หมายความว่าคนที่ไม่มี Teams Pro จะถูกทิ้งไว้ในที่ร่ม ตัวอย่างเช่น ทุกคนจะสามารถเข้าถึงคุณลักษณะสรุปที่มีประโยชน์ใน Microsoft Teams ได้ในไม่ช้า </p> <p> <small> เครดิตภาพ: Postmodern Studio / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}