{"title":"Apple Müzik Önerilerinizi Nasıl Sıfırlayabilirsiniz?","content":"<p> Apple Music, favori sanatçılarınızı ve müzik türlerini yeniden seçerek müzik önerilerinizi yeniden düzenlemek için kolay erişilebilir bir yola sahipti. Ne yazık ki, bir uygulama güncellemesi sırasında Apple, müzik küratörlüğünü yenilemek için bu yöntemi kaldırdı. </p> <p> Korkmayın, Apple Music otomatik önerilerinizi durdurmak veya sıfırlamak için alternatif yöntemler hakkında bir kılavuz burada. </p> <h2 id=\"apple-music-recommendations-explained\"> Apple Music Önerileri Açıklandı </h2> <p> Apple Music hesabınızı ilk kez başlattığınızda, geniş bir müzik türü ve sanatçı listesinden favorilerinizi seçmenizi ister. Bu kürasyon, Apple Music&#39;in ileriye dönük çalma listeleri, albümler, sanatçılar ve şarkılar önerme şeklidir. </p> <p> Örneğin, en sevdiğiniz müzik seçeneklerinden bazıları olarak Classic Rock, New Rock ve Foo Fighters&#39;ı seçerseniz, Apple Music muhtemelen çok benzer dinleme istasyonları önerir ve yakın zamanda piyasaya sürülen rock müziğini tanıtacaktır. </p> <p> Uygulamada yapılan değişiklikler, artık yalnızca ilk hesap oluşturma sırasında müzik tercihlerinizi düzenleyebileceğiniz anlamına gelir, daha sonraki bir tarihte bunları sıfırlayamazsınız; ancak Apple Music, önerilerini dinleme alışkanlıklarınıza göre değiştirmeye devam edecektir. </p> <p> Bu sadece birkaç kullanışlı <a href=\"https://www.makeuseof.com/tag/apple-music-features-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Kullanılacak Apple Music özellikleri </a> . </p> <p> Endişelenmeyin, Apple Kimliği tercihlerinizi devre dışı bırakarak veya Apple Music hesabınızı silip yeniden oluşturarak Apple Music küratörünüzü sıfırlamanın birkaç yolu vardır. </p> <p> Her iki seçeneğin de artıları ve eksileri var, bu yüzden sizin için en iyi seçeneğin hangisi olduğunu bulalım. </p> <p> </p> <h2 id=\"turn-off-personalized-recommendations\"> Kişiselleştirilmiş Önerileri Kapatın </h2> <p> Apple Kimliğiniz için Kişiselleştirilmiş Önerileri kapatmak, ileriye dönük yeni önerileri görmeyi bırakmanın iyi bir yoludur. </p> <p> Bu seçeneği devre dışı bırakmak, mevcut iyileştirme verilerinizi kaldırmaz, yani uygulama, kullanımınıza göre öneriler oluşturmaya devam eder. Sadece artık onları görmeyeceksin. Kişiselleştirilmiş Önerileri kapatmak, Apple Books gibi diğer Apple servis uygulamalarındaki önerilerinizi de etkiler. </p> <p> Bir iPhone&#39;da Kişiselleştirilmiş Önerileri nasıl devre dışı bırakacağınız aşağıda açıklanmıştır: </p> <ol> <li> Aç <strong> elma müziği </strong> uygulama. </li> <li> şuraya git <b> Şimdi dinle </b> sekme. </li> <li> Ekranın sağ üst köşesinde bir kişinin silueti olan dairesel simgeyi seçerek Apple Music profilinizi açın. Daha önce kişisel profil resmi olarak bir resim yüklediyseniz, silüet yerine o resim görünecektir. </li> <li> Seç <b> Apple Kimliğini Görüntüle </b> alt kısmına kaydırarak bulunabilir <b> hesap </b> sayfa. </li> <li> Kapat <b> Kişiselleştirilmiş Öneriler </b> . </li> <li> Seç <b> bitti </b> sağ üst köşede ve işiniz bitti. </li> </ol> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (3 Resim) </strong> <img alt=\"Apple Music Lisen Now featuring Halle x Chloe\" src=\"images/apple-music-listen-now-page-713.jpg\" loading=\"lazy\"> Genişlet <img alt=\"Apple Music Account Options Screenshot\" src=\"images/apple-music-account-page-914.jpg\" loading=\"lazy\"> Genişlet <img alt=\"Apple ID Options Screenshot\" src=\"images/apple-id-account-page-817.jpg\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <p> Bunu yaptıktan sonra, Apple Music&#39;teki yeni müzik aramaları, indirmeleri veya oynatma işlemleri artık otomatik önerilerinizi etkilemeyecektir. Bu, önceki aramalarınızı otomatik olarak silmez, yani bu yöntemin etkilerini fark etmeniz biraz zaman alabilir. </p> <p> </p> <h2 id=\"delete-your-apple-music-profile\"> Apple Müzik Profilinizi Silin </h2> <p> Yeni müzik önerileriyle eksiksiz bir Apple Music makyajına ihtiyacınız varsa, en iyi seçenek Apple Music profilinizi silmek ve yeniden oluşturmaktır. </p> <p> Profilinizi silmenin mevcut müzik kitaplığınızı tamamen kaldıracağını unutmamak önemlidir. Yeni bir profil oluşturmak, tamamen yeni müzik ve tür tercihleri ​​seçmenize olanak tanır, ancak aynı zamanda önceki tüm Apple Music geçmişini de tamamen kaldırır. </p> <p> </p> <p> Yeni seçilen favorilere sahip yepyeni bir Apple Music profiliyle ilgileniyorsanız, bir tane oluşturmak için şu adımları izleyin: </p> <ol> <li> itibaren <strong> Şimdi dinle </strong> sekmesinde, Apple Music&#39;inize gidin <strong> hesap </strong> ve seçin <b> Profili Görüntüle </b> . </li> <li> Seç <b> Düzenle </b> Ekranın ortasında adınızın altında. </li> <li> Ekranın en altına gidin ve seçin <b> Profili sil </b> . Dikkatli olun, bu, hesabın sıfırlanmasını gerektiren kalıcı bir silmedir. </li> <li> Kendiniz için artık eski seçimlerinizden arınmış yeni bir Apple Music profili oluşturun. Yukarıdaki bölümde açıklandığı gibi Kişiselleştirilmiş Önerileri devre dışı bıraktıysanız, artık uyarlanmış müzik önerileri görmezsiniz. ayrılmak <strong> Kişiselleştirilmiş Öneriler </strong> açık, Apple Music&#39;in yeni dinleme alışkanlıklarınıza göre müzik önermesine neden olur. </li> <li> Özgürce gezinin ve yeni seçilen çok çeşitli ses seçeneklerinin keyfini çıkarın. </li> </ol> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (2 Resim) </strong> <img alt=\"Apple Music Profile feat Halle x Chloe\" src=\"images/apple-music-profile-page-771.jpg\" loading=\"lazy\"> Genişlet <img alt=\"Apple Music Profile Options Screenshot\" src=\"images/apple-music-edit-profile-page-450.jpg\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <p> </p> <h2 id=\"spotify-s-recommendations-might-be-better\"> Spotify&#39;ın Önerileri Daha İyi Olabilir </h2> <p> Yeni bir profil oluşturduktan sonra bile Apple Music&#39;in tavsiyelerinden memnun değilseniz, bunun yerine müzik akışı platformlarını değiştirmenin zamanı gelmiş olabilir. Apple Music ve Spotify çok benzer özelliklere sahiptir, ancak birçok insan Spotify&#39;ın yeni müzik önerme konusunda çok daha üstün olduğunu düşünüyor. </p> <p> Elbette Apple Music ve Spotify arasında seçim yaparken göz önünde bulundurulması gereken birçok faktör var. </p>"}