{"title":"Apple Watch Egzersiz Uygulamasını Kullanma","content":"<p> Fitness ilerlemenizi daha iyi anlamak, Apple Watch ile yalnızca bir dokunuş uzağınızda. </p> <p> Uygulamanın nasıl çalıştığı, hangi antrenman türlerini izleyebileceği ve topladığı tüm bilgilerin nasıl görüntülenebileceği dahil olmak üzere Apple Watch Workout uygulamasının sunduğu her şeye bir göz atıyoruz. </p> <h2 id=\"getting-started-with-the-workout-app\"> Egzersiz Uygulamasına Başlarken </h2> <p> Egzersiz uygulamasını bir Apple Watch&#39;ta çeşitli şekillerde açabilirsiniz. İlk önce, sadece bir kez tıklayın <strong> Dijital Taç </strong> Saatinizdeki uygulamaların listesini getirmek için Sonra seçin <strong> Egzersiz yapmak </strong> . </p> <p> Daha da hızlı bir yol, yalnızca uzun süre basarak Siri&#39;yi kullanmaktır. <strong> Dijital Taç </strong> veya saati ağzınıza kaldırarak. Ardından &quot;Antrenman uygulamasını aç&quot; demeniz yeterlidir. </p> <p> Uygulamayı açtıktan sonra, okçuluktan yogaya ve aradaki her şeye kadar çok çeşitli egzersiz türleri göreceksiniz. </p> <p> Ana antrenman seçim ekranı, en popüler seçeneklerle vurgulanır. Listenin en altına gidin ve <strong> Antrenman Ekle </strong> Diğer egzersiz türlerinin listesini görmek için Herhangi bir nedenle egzersiz türünüzü göremiyorsanız, aşağıdakileri de seçebilirsiniz: <strong> Diğer </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> seçebilirsiniz <strong> üç nokta </strong> ( <strong> ... </strong> ) belirli bir mesafe, yakılan kalori veya süre hedefi belirlemek için her egzersiz türünde. Bu hedeflerden herhangi biri ilginizi çekmiyorsa, hemen başlamak için antrenman adına dokunmanız yeterlidir. </p> <p> İzleme başlamadan önce ekranda üç saniyelik bir geri sayım olacaktır. </p> <p> Tüm Egzersiz uygulaması özellikleri, yakınlarda bir iPhone olmadan veya yalnızca Wi-Fi veya hücresel sinyale bağlı bir Apple Watch kullanılarak kullanılabilir. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Egzersiz Uygulamasını Anlayın </h2> <p> Uygulamada üç ana ekran vardır. Sola veya sağa kaydırarak aralarında geçiş yapabilirsiniz. </p> <p> Ana ekran, seçtiğiniz antrenman türündeki tüm ilerlemenizi gösterecektir. Antrenman süresini, aktif kaloriyi, toplam kaloriyi ve mevcut kalp atış hızını göreceksiniz. Antrenman türünüze bağlı olarak, kat edilen mesafeyi de görebilirsiniz. </p> <p> Apple Watch Series 5 veya sonraki bir modeliniz varsa ve her zaman açık ekranı etkinleştirdiyseniz, antrenman istatistiklerinizi her zaman görebilirsiniz. Daha eski bir modeli olan herkesin bu bilgiyi görebilmesi için ekranı yükseltmesi veya dokunması gerekir. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Koşarken veya yürürken, Apple Watch her mil veya kilometrede hafif bir dokunuş sağlar ve hız bilgilerini içeren bir güncelleme gösterir. Her beş mil veya kilometrede bir bisiklet özeti ve dokunuş gerçekleşecek. </p> <p> Apple Fitness+ antrenmanı yapıyorsanız, hem Antrenman uygulamasında hem de iPhone, iPad veya Apple Watch ekranında verileri görebilirsiniz. </p> <p> </p> <p> Ana ekrandan sağa kaydırmak size dört farklı seçenek gösterecektir— <strong> Kilit </strong> , <strong> Yeni </strong> , <strong> Son </strong> , ve <strong> Duraklat </strong> . </p> <p> seçme <strong> Kilit </strong> yanlışlıkla dokunmaları önlemek için ekranı kilitleyecektir. Ekranın kilidini açmak için Digital Crown&#39;u çevirebilirsiniz. Sadece not etmek gerekirse, bu seçenek herhangi bir yüzme antrenmanı sırasında su damlalarının yanlışlıkla dokunmasını önlemek için otomatik olarak açılacaktır. </p> <p> Muhtemelen tahmin edebileceğiniz gibi, <strong> Yeni </strong> mevcut antrenmanı sonlandırır ve yeniden başlamak için yeni bir egzersiz türü seçmenize olanak tanır. seçme <strong> Son </strong> mevcut antrenmanı bitirir. </p> <p> Herhangi bir şekilde kesintiye uğrarsanız, şunları seçebilirsiniz: <strong> Duraklat </strong> buton. Tekrar basmak antrenman takibini başlatacaktır. Bunu Digital Crown ve Yan Düğmeye aynı anda basarak da yapabilirsiniz. </p> <p> Ana antrenman ekranından sola kaydırmak, medya oynatma kontrollerini gösterir. Bu, egzersiz yaparken müziğinize veya dinlediğiniz her şeye erişmenin kolay bir yolu. Parçaları atlayabilir, oynatabilir, duraklatabilir ve sesi açıp kapatabilirsiniz. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Otomatik Egzersiz Hatırlatıcıları </h2> <p> Bir antrenmana başlamayı unutursanız endişelenmenize gerek yok. watchOS 5 veya sonraki bir sürümüne sahip olduğunuz sürece, bir Apple Watch egzersiz yaptığınızı otomatik olarak algılayabilir. Bileğinize dokunur ve bir antrenman kaydetmek isteyip istemediğinizi sorarak antrenman türünü değiştirmenize, bu bildirimleri o gün için sessize almanıza veya yalnızca bu bildirimi kapatmanıza olanak tanır. </p> <p> Bildirimin görünmesi birkaç dakika sürebilir, ancak tüm antrenman kredisi kaydedilmeye devam eder. </p> <p> Aşağıdaki egzersiz türleri için egzersiz hatırlatıcıları alabilirsiniz: kapalı alanda yürüyüş, açık havada yürüyüş, kapalı alanda koşu, açık havada koşu, eliptik, kürekçi, havuzda yüzme ve açık suda yüzme. </p> <p> Özelliği açmak veya kapatmak için şuraya gidin: <strong> Ayarlar &gt; Antrenman &gt; Antrenman Hatırlatıcısını Başlat </strong> Apple Watch&#39;ınızda. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> Apple Watch, bir antrenmanın ne zaman tamamlandığını da algılayabilir. Bir dokunuştan sonra, antrenmanı sonlandırma veya duraklatma seçeneklerini içeren bir ekran bildirimi göreceksiniz. Ayrıca bildirimi tamamen kapatabilir ve antrenmana devam edebilirsiniz. </p> <p> Apple Watch&#39;ınıza gidip şuraya giderek özelliği değiştirin: <strong> Ayarlar &gt; Antrenman &gt; Antrenmanı Bitir Hatırlatıcı </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Antrenman Uygulamasında Gösterilen Verileri Özelleştirin </h2> <p> Apple Watch Antrenman görünümünde, birçok farklı antrenman türü için ekranda gösterilen bilgileri özelleştirebilirsiniz. </p> <p> Başlamak için iPhone&#39;unuzdaki tamamlayıcı Watch uygulamasını açın. İçinde <strong> Saatim </strong> sekme seçimi <strong> Egzersiz yapmak </strong> . sonra seç <strong> Egzersiz Görünümü </strong> . Sayfanın üst kısmında, bir antrenman sırasında ekranda tekli mi yoksa çoklu ölçümlerin mi gösterileceğini seçebilirsiniz. seçerseniz <strong> Tek Metrik </strong> , Apple Watch&#39;ınızla ilgili daha fazla veri görmek için Digital Crown&#39;u kaydırmanız yeterlidir. </p> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (3 Resim) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Genişlet <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Genişlet <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <p> Bunun altında, ekranda gösterilen bilgileri düzenleyebileceğiniz bir dizi farklı antrenman türü de görebilirsiniz. Bir antrenman türü seçin ve ardından <strong> Düzenle </strong> Ekranda nelerin ve hangi sırayla gösterileceğini özelleştirmek için ekranın sağ üst köşesindeki </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Fitness Uygulamasında Egzersiz Verilerini Görüntüleme </h2> <p> Bir antrenmanla işiniz bittiğinde, tüm veriler iPhone&#39;unuzda sadece birkaç dokunuş ötede. </p> <p> Görmek için açın <strong> Fitness </strong> uygulama. </p> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (2 Resim) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Genişlet <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <p> Altında <strong> Özet </strong> sekme, seç <strong> Antrenmanlar </strong> . Tüm antrenmanlarınız hakkında bilgi göreceksiniz. Veriler ayrıca şurada da mevcuttur: <strong> Sağlık </strong> uygulama. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Apple Watch Egzersiz Uygulaması ile Ter atın </h2> <p> Gördüğünüz gibi, Apple Watch Workout uygulaması, yüzmeden dansa ve çok daha fazlasına kadar her şeyi yaparken tüm farklı fitness ölçümlerinizi takip etmenize yardımcı olmanın harika bir yoludur. </p> <p> Ve bir gece deyip yatmaya hazır olduğunuzda, Apple Watch&#39;unuz yerleşik uyku izleme özelliğiyle hala büyük bir yardımcı olabilir. </p>"}