{"title":"Apple, Veri Kaybına Neden Olan Bir macOS Big Sur Yükleyici Hatasını Düzeltiyor","content":"<p> Apple, gerekli depolama alanı olmadan bir Mac&#39;i yükseltmeye çalışırken hata mesajı veren macOS Big Sur yükleyicisindeki kritik bir hatayı düzeltti. </p> <p> Gözden geçirilmiş bir macOS Big Sur 11.2.1 güncellemesi, şimdi şurada mevcut: <a href=\"https://apps.apple.com/app/macos-big-sur/id1526878132?mt=12\" target=\"_blank\" rel=\"nofollow noopener\"> Mac Uygulama Mağazası </a> Bay Macintosh, yükleme başlamadan önce yeterli boş alanınız olup olmadığını doğru şekilde kontrol eder, dedi <a href=\"https://twitter.com/ClassicII_MrMac/status/1361428354306633728\" target=\"_blank\" rel=\"nofollow noopener\"> heyecan </a> . </p> <p> macOS Big Sur, bilgisayarınızın başlangıç ​​diskinde, 13 gigabaytlık yükleyicinin kendisi hariç, 35 gigabaytlık boş depolama alanı gerektirir. </p> <p> Bozuk yükleyicinin sonuçlarından biri potansiyel veri kaybı olduğundan, bu daha erken olamazdı. Düzenli olarak bir alışkanlık geliştirmemiş insanlar için <a href=\"https://www.makeuseof.com/how-to-back-up-mac/\" target=\"_blank\" rel=\"nofollow noopener\"> Mac&#39;lerini Time Machine ile yedekleme </a> , bu oldukça basit hatanın potansiyel olarak korkunç sonuçları olabilir. </p> <h2 id=\"how-to-install-the-new-update\"> Yeni Güncelleme Nasıl Yüklenir </h2> <p> Yeni güncelleme şuradan edinilebilir: <strong> Sistem Tercihleri ​​&gt; Yazılım Güncelleme </strong> Mac&#39;inizde. Herhangi bir güncelleme varsa, &quot;Şimdi Güncelle&quot; düğmesine basmak onları yükleyecektir. Yönetici parolanızı girmeniz istenebilir. </p> <p> Düzeltilmiş macOS Big Sur 11.2.1 sürümü bilgisayarınızda zaten yüklüyse güncellemeyi görmeyeceksiniz. Gözden geçirilmiş yükleyici, &quot;20D75&quot; yapı numarasına sahiptir. Mac&#39;inizde yüklü olan macOS Big Sur yazılımının yapı numarasını görmek için Apple menüsünü tıklayın ve &quot;Bu Mac Hakkında&quot; etiketli seçeneği seçin. </p> <p> </p> <p> Bu Mac Hakkında penceresi açıkken, &quot;Genel Bakış&quot; sekmesine tıklayın. Bilgisayarınızdaki macOS işletim sistemi yazılımının adını ve ardından sürüm numarasını göreceksiniz. Yapı numarasını da ortaya çıkarmak için sürüm numarasını tıklamanız yeterlidir. </p> <p> adresindeki bir destek belgesinde hangi macOS sürümünün en son olduğunu görebilirsiniz. <a href=\"https://support.apple.com/HT201260\" target=\"_blank\" rel=\"nofollow noopener\"> Apple&#39;ın web sitesi </a> . </p> <p> </p> <h2 id=\"big-sur-s-broken-free-space-check\"> Big Sur&#39;un Kırık Boş Alan Kontrolü </h2> <p> Sorun, sorunu ilk başta bildiren Bay Macintosh sayesinde yakın zamanda aydınlandı. Yayın, Big Sur güncellemesinin sorunsuz bir şekilde indirileceğini ancak &quot;Yazılım güncellemesi hazırlanırken bir hata oluştu&quot; nedeniyle başlatmayı reddettiğini keşfetti. </p> <p> Sorun, Big Sur&#39;un boş alan kontrolünde bir hataya bağlandı. Bay Macintosh, macOS Big Sur&#39;un ilk herkese açık sürümünün Kasım 2020&#39;de yayınlanmasından bu yana insanların bundan şikayet ettiğini söylüyor. Yayının Apple&#39;ı sorun konusunda uyarmasının ardından şirket, bu kötü böceği ezmek için hızla harekete geçti. </p> <p> </p> <p> &quot;Yükseltme, yalnızca %1 boş alanınız kalsa bile başlayacak ve başarısız olacak&quot; <a href=\"https://mrmacintosh.com/big-sur-upgrade-not-enough-hd-space-serious-issue-possible-data-loss/\" target=\"_blank\" rel=\"nofollow noopener\"> posta </a> açıklar. Başlangıç ​​sürücüsü neredeyse yüzde 100 doluyken, yükleyici, yükleme prosedürünü tamamlamaya çalışırken sonsuz bir önyükleme döngüsüne takılıp kalırdı. </p> <p> Bay Macintosh, &quot;Bu, verilerinize erişmenizi engelliyor,&quot; diye uyardı. </p> <p> Bunu düzeltmenin tek yolu macOS yazılımını silip yeniden yüklemekti. Ancak gözden geçirilmiş güncellemenin artık Mac App Store&#39;da yayınlanmasıyla, Mac sahipleri Big Sur&#39;a güncellemenin başlangıç ​​disklerini temizleyip temizlemeyeceği konusunda endişelenmeden günlük yaşamlarına devam edebilir. </p>"}