{"title":"ABD Hükümeti, Uygulama Gizlilik Etiketlerinin Doğruluğunu Bilmek İstiyor","content":"<p> Apple, App Store&#39;daki iOS 14 Uygulama Gizliliği etiketleri ile kullanıcılara, kullandıkları uygulamalar ve bu uygulamaların onları nasıl takip ediyor olabileceği hakkında daha fazla bilgi sahibi olarak yetkilendirilmeleri için yeni bir yol sunuyor. </p> <p> Ancak Apple, geliştiricilerin Aralık ayında Apple&#39;a göndermeye başladığı bu etiketlerin doğruluğu için kefil olmaya zorlandığından, kendisi için potansiyel olarak bir solucan kutusu açmış gibi görünüyor. </p> <h2 id=\"concerns-over-accuracy\"> Doğruluk Üzerine Endişeler </h2> <p> tarafından belirtildiği gibi <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacSöylentiler </a> , Apple aldı <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> mektup </a> ABD Enerji ve Ticaret Meclisi Enerji ve Ticaret Komitesi&#39;nden, Uygulama Gizliliği etiketlerinin geliştirici tarafından sağlanan doğruluğuna ilişkin bilgileri açıklamasını istedi. </p> <p> Bu etiketler, iOS 14&#39;ün bazı çevrelerde merakla beklenen, diğerlerinde korkulan bir özelliğidir ve geliştiricileri uygulamalarının kullanıcı verileriyle nasıl etkileşime girdiği konusunda daha açık olmaya zorlayacaktır. Bu, belirli uygulamaları kullanmanın yararları ve sakıncaları söz konusu olduğunda kullanıcıların daha bilinçli bir karar verebilecekleri anlamına gelir. </p> <p> </p> <p> ABD Temsilciler Meclisi Enerji ve Ticaret Komitesi mektubunda, Apple&#39;a belirli Uygulama Gizliliği etiketlerinin kullanıcılara &quot;yanıltıcı ve yanlış&quot; bilgiler sağlayabileceğini öne süren raporlar hakkında sorular soruyor. Bu, geçen ay yayınlanan ve temiz bir sağlık raporu verilen birçok uygulamanın önerildiği kadar masum olmayabileceğini iddia eden bir rapora dayanıyor. </p> <p> iOS 14 özelliğiyle ilgili olası bir sorun, verilerin nasıl toplandığını söylemenin ve bu bilgilerin doğru olduğunu doğrulamanın geliştiricinin dürüstlüğüne dayanmasıdır. Apple, bilgilerin &quot;Apple tarafından doğrulanmadığını&quot; belirtiyor. </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Apple&#39;dan Yanıt İstemek </h2> <p> Çoğu geliştiricinin adil davranıp onur sistemine uyması muhtemel görünse de, bu hafife alınabilecek bir şey değil. Apple, gönderilen bilgileri rutin olarak denetleyecektir. Ancak, App Store&#39;daki çok sayıda uygulama, Apple&#39;ın her bir girişi kişisel olarak doğrulamasını imkansız hale getiriyor. </p> <p> ABD Temsilciler Meclisi Enerji ve Ticaret Komitesi mektubu şöyle devam ediyor: </p> <blockquote> <p> &quot;Apple&#39;ı, tüketicilere uygulamalarının veri uygulamaları hakkında anlamlı bilgiler verildiğinden ve tüketicilerin bu potansiyel olarak aldatıcı uygulamalardan zarar görmediğinden emin olmak için Uygulama Gizliliği etiketlerinin geçerliliğini iyileştirmeye çağırıyoruz.&quot; </p> </blockquote> <p> Komite, Apple&#39;dan denetim süreci, Uygulama Gizliliği etiketlerinin doğru olmadığı tespit edilirse düzeltilip düzeltilmeyeceği, geliştiricilerin yanlış bilgi sağladığında ne olacağı hakkında ayrıntılar ve daha fazlası hakkında daha fazla ayrıntı vermesini istedi. </p> <p> Apple&#39;dan 23 Şubat&#39;a kadar istenen bilgilerle yanıt vermesini istiyorlar. </p> <p> <small> İmaj Kredisi: Jason Dent/ <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> CC&#39;yi kaldır </a></small> </p>"}