{"title":"Ağda LAN ve WAN Arasındaki Fark Nedir?","content":"<p> Burnunuzu bilgisayar ağlarına soktuysanız, &quot;LAN&quot; ve &quot;WAN&quot; terimleriyle karşılaşmanız için iyi bir şans var. Ancak, her biri ne anlama geliyor ve LAN ile WAN&#39;ı karşılaştırdığınızda ne gibi farklar var? </p> <p> Bu teknolojilerin her ikisini de ve her birinin parladığı yerleri keşfedelim. </p> <h2 id=\"what-does-lan-stand-for\"> &quot;LAN&quot; Neyi Gösterir? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> İmaj Kredisi: Uyuşturucu Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> LAN, bir &quot;Yerel Alan Ağı&quot;dır. Bu terim, bağlı tüm cihazların birbirine yakın olduğu bir ağı tanımlar. Hepsi bir &quot;yerel bölgede&quot;, dolayısıyla adı. </p> <p> Bir bilgisayar bir LAN&#39;a bağlandığında, yerel bir internet protokolü (IP) adresi alır. Bu, çevrimiçi olduğunuzda aldığınız IP adresine benzer şekilde çalışır. Ancak, yerel bir IP adresi yalnızca sizinle aynı LAN&#39;daki diğer bilgisayarlar için çalışır. Örneğin, PC&#39;nize internet üzerinden bağlanmak için yerel bir IP kullanamazsınız. </p> <p> Ev LAN&#39;ınızın fiziksel sınırı büyük olasılıkla evinizden çıkmayacak. Tabii ki, telefonunuzu veya dizüstü bilgisayarınızı biraz temiz hava almak için bahçenize çıkarırsanız, hala LAN&#39;dadır. Ancak çoğu zaman, ağa bağlı tüm cihazlarınız evinizin dört duvarı arasında güvenli bir şekilde bulunur. </p> <p> Şirketler ve enstitüler de LAN üretiyor. Örneğin bir üniversite, kütüphanesindeki tüm bilgisayarları bir ağa bağlayarak hepsi birbiriyle konuşabilir. İşletmeler ayrıca LAN&#39;ları kullanmayı severler çünkü bu, çalışanların çevrimiçi olmaya gerek kalmadan birbirlerine dosya ve yazışma göndermesine olanak tanır. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> &quot;WAN&quot; Neyi Gösterir? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Resim Kredisi: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Öte yandan, Geniş Alan Ağı veya WAN&#39;ımız var. Bu makaleyi okuyorsanız, zaten bir WAN&#39;a bağlısınızdır; biz buna internet diyoruz. </p> <p> Geniş Alan Ağındaki &quot;geniş&quot; oldukça değişkendir. Sizinle aynı şehirde bulunan harici bir sunucuya bağlanırsanız, bu bir WAN&#39;dır. Gezegenin diğer tarafındaki bir ülkedeki bir sunucuya bağlanırsanız da WAN olarak kabul edilir. </p> <p> Bu nedenle, bir WAN genellikle, yönlendiricinizin ötesinde bulunan, bağlandığınız herhangi bir ağı tanımlamak için kullanılır. Sunucunun bir mil uzakta veya bir kıta uzakta olması önemli değil; hala &quot;geniş&quot;. </p> <p> İnternet, oradaki tek WAN değil. İşletmeler, farklı ülkelerdeki ofisleri birbirine bağlamak için WAN&#39;ları iyi kullanır. Örneğin, bir işletmenin New York, Tokyo ve Sidney&#39;de bir ofisi varsa, birbirleriyle konuşmalarına izin vermek için kendi WAN sistemini kiralayabilir. </p> <p> Ama bir dakika; şirketler neden her şeyi internete bağlayabiliyorken kendi WAN&#39;larını yapıyorlar? Bu çözümle ilgili sorun, şirketin ISP ücretlerini ödemek zorunda kalacak olması ve bir şeyler ters giderse, düzeltmek için söz konusu ISP ile güreşmeleri gerektiğidir. </p> <p> Sadece bu da değil, internet dünyadaki birçok bilgisayara bağlanmak üzere tasarlanmıştır. Bir şirket, bilgisayarlarının yalnızca diğer ofis bilgisayarlarına bağlanmasını istiyorsa, kendilerini çevrimiçi tehditlerden korumak için kendi WAN&#39;larını kullanabilirler. Buna &quot;intranet&quot; denir. </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> LAN ve WAN Ne Zaman Kullanılmalı? </h2> <p> Sahip olduğunuz başka bir cihaza bağlanmak istediğinizde, bunu LAN veya WAN üzerinden yapmayı seçebilirsiniz. Ancak her birinin yararları ve sakıncaları nelerdir ve hangisini kullanmalısınız? </p> <p> Diyelim ki yönlendiricinize bağlanan yeni bir kablosuz sabit sürücünüz var ve internetten bağlantılara izin verme (WAN) veya yalnızca yerel tutma (LAN) seçeneğiniz var. Hangisini seçeceğiniz, sabit sürücüden ne istediğinize bağlıdır. </p> <p> Sabit sürücüye WAN yetenekleri vermek, kolaylık sağlamak için harikadır. Bu, onu internete koyar, yani ona dünyanın her yerinden bağlanabilirsiniz. Bu nedenle, bir daha asla dosyalarınız olmadan kalmayacaksınız; sadece bir internet bağlantısı uzağınızda olacaklar. </p> <p> Ancak WAN bağlantıları, diğer kişilerin cihazlarınıza erişmesine de izin verir. Sabit sürücünüzün güvenliği en üst düzeyde değilse, bilgisayar korsanları tüm verilerinizi görmek ve önemli şeyleri kopyalamak veya silmek için kullandığınız yolu kullanabilir. </p> <p> Öte yandan, sabit sürücüyü yalnızca LAN moduna almak, onu bir bilgisayar korsanının alabileceği bazı yollardan korur. Geçirimsiz değil. Örneğin, birisi sabit sürücüye erişmek için bilgisayarınızı kullanabilir. Ancak, sabit diski her gün ve gece WAN&#39;da yayınlamaktan çok daha güvenlidir. </p> <p> Güvenliği gerçekten, gerçekten sıkılaştırmak istiyorsanız, sabit sürücüyü hava boşluğu bırakabilirsiniz. Hava boşluğu, onun ve üzerindeki aynı ağdaki her bilgisayarın örneğin internet gibi bir WAN&#39;a bağlı olmadığı anlamına gelir. </p> <p> bir <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> hava boşluklu bilgisayar çevrimiçi tehditlere karşı tamamen güvenli değildir </a> , ancak bir saldırı şansını büyük ölçüde azaltır. Bilgisayar korsanlarının, yollarını almak için sosyal mühendislik taktiklerini kullanarak, hava boşluklu bir cihaza saldırmak için tekliflerini yapmaları için insanları manipüle etmesi gerekir. </p> <p> Bu nedenle, bir cihazı internete koymak veya onu ev LAN&#39;ınızda kilitli tutmak arasında seçim yaparken, ona gerçekten internet üzerinden bağlanıp bağlanmayacağınızı düşünmeniz gerekir. Yapacağınızı düşünmüyorsanız, WAN özelliklerini kapatmak ve bilgisayar korsanlarını uzak tutmak en iyisidir. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> İnternete Bağlanmak LAN&#39;ı WAN&#39;a Dönüştürür mü? </h2> <p> Tüm cihazlarınızın bir yönlendiriciye bağlı olduğu bir LAN kurulumunuz olduğunu varsayalım. Canın sıkıldı, bilgisayarın başına geç ve Netflix&#39;e yönel. Artık PC&#39;niz bir WAN&#39;a bağlı: internet. </p> <p> Ancak, PC&#39;niz bir WAN&#39;a bağlı olduğu için bu artık bir LAN&#39;ın parçası olmadığı anlamına mı geliyor? Neyse ki, bir cihaz aynı anda hem LAN&#39;ın hem de WAN&#39;ın parçası olabilir. </p> <p> LAN cihazlarının kendi yerel IP adresleri olduğunu nasıl söylediğimizi hatırlıyor musunuz? Bu, bir internet IP adresi de alamayacağı anlamına gelmez. Aslında, bu makaleyi bir yönlendiriciye bağlı bir cihazda okuyorsanız, her ikisine de sahip olacaksınız! </p> <p> Kendiniz kontrol etmek isterseniz, biz <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows&#39;ta IP adresinizi nasıl kontrol edersiniz </a> . Mobildeyseniz, yine de yapabilirsiniz <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> IP adreslerinizi Android veya iPhone&#39;da bulun </a> . </p> <p> İstatistikleri aldıktan sonra, iki IP adresi görmelisiniz. İlki &quot;192.168&quot; ile başlayacak—bu sizin yerel IP adresinizdir. Mevcut cihazınıza aynı ağdaki başka bir cihazdan bağlanmak istiyorsanız bunu kullanırsınız. </p> <p> İkincisi, IPv4 veya IPv6&#39;da olmanıza bağlı olarak iki yoldan biriyle görünecektir. v4 kullanıyorsanız, yerel IP adresiniz gibi görünmelidir, ancak &quot;192.168&quot; ile başlamaz. IPv6 ise, iki nokta üst üste ile sekiz bloğa bölünmüş bir harf ve rakamlardan oluşan bir karmaşa olmalıdır. </p> <p> Her iki durumda da, bu adres sizin internet IP adresinizdir. Bu, sizinle konuşabilmesi için internetteki başka bir sunucuya bağlandığınızda kullanılır; örneğin, Netflix&#39;te izlediğiniz TV şovunu size göndermek için. </p> <p> Bir bakıma interneti devasa bir LAN ağı olarak hayal edebilirsiniz. Netflix&#39;i izlediğinizde, PC&#39;niz (kişisel LAN&#39;ınızda) Netflix sunucularından (kendi LAN&#39;ında bulunan) veri alıyor. Her LAN bir şehirdeki bir ev gibidir, internet bağlantısı ise hepsini birbirine bağlayan yollar ve sokaklar gibidir. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> LAN ve WAN Karmaşasını Temizleme </h2> <p> LAN&#39;lar ve WAN&#39;lar genellikle birlikte çalışır, ancak farklı şekillerde çalışırlar. Artık ikisi arasındaki farkı ve her birini ne zaman kullanacağınızı biliyorsunuz. </p> <p> Aynı ağdaki kişilerin birbirleriyle oynayabilmesi için bir LAN oyunu kurabileceğinizi biliyor muydunuz? İnternet oyunlarının bazen yaşadığı gecikme sorunları olmadan arkadaşlarınızla vakit geçirmenin harika bir yolu. </p> <p> <small> Resim Kredisi: metamorf çalışmaları / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}