{"title":"Adobe Illustrator&#39;da Desen Nasıl Oluşturulur veya Düzenlenir","content":"<p> Adobe Illustrator&#39;da bir desen oluşturun ve bunu şekillere, konturlara ve hatta metne hızla uygulayabilirsiniz. Nokta deseni gibi basit bir şey yapabilir veya daha karmaşık bir şey yapabilirsiniz. Mevcut bir vektör grafiğinin bir bölümünü bile kullanabilir ve bunu bir desene de dönüştürebilirsiniz. </p> <p> Desenler arka planlar, dokular ve daha fazlası için mükemmeldir. Illustrator&#39;ın kalıp araçlarını nasıl kullanacağınız ve kendi kalıplarınızı nasıl oluşturup düzenleyeceğiniz aşağıda açıklanmıştır. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Adobe Illustrator&#39;da Varsayılan Desenleri Kullanma </h2> <p> Illustrator, içinde yerleşik birkaç desenle birlikte gelir. Kendi başlarına faydalı olmalarının yanı sıra, kalıpların nasıl çalıştığını görmenin de iyi bir yoludur. Bu kalıplar ayrıca, onları oluşturduktan sonra kendi kalıplarınızı nasıl kullanacağınız konusunda size bir fikir verecektir. </p> <p> </p> <p> Desenleri Renk Örnekleri pencerenizde bulabilirsiniz. Henüz açık değilse, şuraya gidin: <strong> Pencere &gt; Renk Örnekleri </strong> üst menüden. Düz renklere ek olarak, Renk Örnekleri pencerenizde zaten bazı desenler olabilir, ancak bunlar Illustrator&#39;ın sahip olduğu tek desen değildir. </p> <p> Tıkla <strong> Renk Örneği Kitaplığı </strong> Swatch pencerenizin sol alt köşesindeki simge. Üzerinde gezdirmek <strong> Desen </strong> tıklayın ve ardından desen renk örneği kitaplıklarından birini seçin. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Artık bu renk örneklerini düz renklerle yaptığınız gibi uygulayabilirsiniz. Burada, desenleri görebilirsiniz <strong> Nature_Foliage </strong> dolgu ve kontur olarak ve ayrıca metne uygulanan kitaplık. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> Illustrator&#39;da Temel Bir Yinelenen Desen Nasıl Yapılır </h2> <p> Herhangi bir vektörü, önceden tasarlamış olduğunuz bir şey veya bu özel niyeti göz önünde bulundurarak yarattığınız bir şey olsun, bir kalıba dönüştürebilirsiniz. Bunu bütün bir vektör grafiğiyle, tek bir katmanla veya aradaki herhangi bir şeyle yapabilirsiniz. </p> <p> Tek yapmanız gereken, bir desene dönüştürmek istediğiniz şeyi seçmek ve ardından bunu Renk Örnekleri penceresine sürüklemektir. Örneğin, bu kedinin gözünü Renk Örneklerinize sürükleyebilirsiniz. Bu, daha sonra bir dikdörtgeni veya başka bir şekli doldurmak için kullanabileceğiniz bir desen örneği oluşturacaktır. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> Alternatif olarak, aynı şeyi vektörün tamamıyla da yapabilirsiniz. Her iki durumda da, Illustrator, Renk Örnekleri penceresine sürüklediğiniz şeyden bir desen oluşturacaktır. Renk örneğini herhangi bir normal renk örneğinde olduğu gibi kolayca uygulayabilirsiniz. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Renk Örnekleri penceresinde desen örneğinizi çift tıklatırsanız, <strong> Desen Seçenekleri </strong> pencere. Bunu doğrudan şuradan da açabilirsiniz: <strong> Pencereler &gt; Desen Seçenekleri </strong> üst menüde. </p> <p> Burada, nasıl tekrarlandığı ve görüntünüzün her yinelemesi arasındaki boşlukların ne kadar büyük olduğu dahil olmak üzere deseninizi daha fazla düzenleyebilirsiniz. Ayrıca desen tasarımınızı doğrudan burada düzenlersiniz. Resmin soluk olmayan versiyonu normal şekilde düzenlenebilir. Renkleri değiştirebilir, katmanları taşıyabilir vb. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> Desen Seçenekleri penceresiyle yapabileceğiniz çeşitli şeyler vardır. Örneğin, resminizi kademeli tuğla düzeninde tekrarlayabilir ve desenin her bir parçası arasındaki boşluğu azaltabilirsiniz. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> Deseninizin parçalarını birbirine yeterince yaklaştırın ve üst üste gelmesini sağlayabilirsiniz. Bunu yaparak, aşağıda gösterilene benzer bir tür döşeme deseni oluşturabilirsiniz. Size uygun bir şey bulmak için Desen Seçenekleri&#39;ndeki tüm farklı örtüşme ayarlarını deneyin. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> Adobe Illustrator&#39;da Kesintisiz Desen Nasıl Oluşturulur </h2> <p> Kesintisiz bir geometrik desen oluşturmak istiyorsanız, tasarımınızda simetri olduğundan emin olmanız gerekir. Örneğin, deseninizin sol tarafında 10 piksel yukarıda başlayan bir çizgi, sağ tarafta 10 piksel yukarı bitmelidir. Tekrarlandığında, bu noktaların birleşmesi gerekecek. </p> <p> Bunu yapmak için kare boyutlarında yeni bir belge oluşturun. tuşuna basarak ızgara yerleşimini etkinleştirin. <strong> Ctrl + &quot; </strong> ( <strong> cmd +&quot; </strong> Mac&#39;te). Akıllı Kılavuzlar da yararlıdır. <strong> Ctrl + U </strong> ( <strong> Komut + U </strong> Mac&#39;te). Cetvelleriniz görünmüyorsa, <strong> Ctrl + R </strong> ( <strong> Komut + R </strong> Mac&#39;te) etkinleştirmek için. </p> <p> Bu ayarları da altında bulabilirsiniz. <strong> Görünüm </strong> üst menüde, ancak kullanmanızı öneririz <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Illustrator&#39;ın kısayol tuşları </a> zaman kazanmak için nerede yapabilirsiniz. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Tasarımınızı kareye yerleştirin. Kenarlardan geçen tüm parçaların diğer tarafta hizalanması gerekecektir. <strong> hizala </strong> araç ( <strong> Pencere &gt; Hizala </strong> ) işleri birbiriyle düzgün bir şekilde hizalamanıza yardımcı olabilir. İhtiyacınız olan yerde kendi kılavuzlarınızı oluşturmak için cetvellerden tıklayıp sürükleyin. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> Beyaz olsa bile bir arka plan rengine sahip olmak önemlidir. Gereksiz malzemeyi kırpmak için ihtiyacınız olduğundan, bunun çalışma yüzeyinin kenarlarına tam olarak oturduğundan emin olun. </p> <p> ile her şeyi seçin <strong> Ctrl + A </strong> ( <strong> Komut + A </strong> Mac&#39;te) ve ardından <strong> Üst Karakter + M </strong> etkinleştirmek için <strong> Şekil Oluşturucu </strong> araç. Bu, araç kutusunda da bulunabilir. basılı tutun <strong> alt </strong> ( <strong> Seçenek </strong> Mac&#39;te). Bu koyar <strong> Şekil Oluşturucu </strong> aracı çıkarma moduna alın. </p> <p> Bu araçla tasarımınızın bölümlerinin üzerine geldiğinizde, bunların biraz renk değiştirdiğini görmelisiniz. İstemediğiniz alanlara tıklayın, Illustrator bu parçaları kaldıracak ve yalnızca arka plan karesiyle örtüşen bitleri bırakacaktır. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> Bu yapıldıktan sonra, her şeyi seçin ve bir desene dönüştürmek için renk örneklerinize sürükleyin. Deseninizi yeni bir belgede kullanmak için, onu bir renk örneği kitaplığına kaydedebilir veya Adobe Bulut Kitaplığınızı kullanabilirsiniz. </p> <p> Alternatif olarak, bu Swatch penceresinden kopyalayabilir ve farklı bir belgedeki başka bir Swatch penceresine yapıştırabilirsiniz. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Artık bu deseni diğer desenlerde olduğu gibi uygulayabilirsiniz. Doğru yaptıysanız, her şey boşluk olmadan hizalanmalıdır. Gerekirse kalıp belgenizde ayarlamalar yapın. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> Adobe Illustrator&#39;da Desenleri Ne Zaman Kullanmalısınız? </h2> <p> Desenlerin en belirgin kullanımı, arka planlar için tekrarlanabilir döşemeler oluşturmaktır, ancak bunları, onlara doku vermek için şekilleri doldurmak için de kullanabilirsiniz. Desen dolgulu metin başka bir iyi kullanımdır ve tipografinizi gerçekten öne çıkarabilir. </p> <p> İsterseniz, aynı görüntüyü tekrar tekrar kopyalayıp yapıştırarak kendi kalıplarınızı manuel olarak bile oluşturabilirsiniz. Bunu yapmak isteyeceğiniz durumlar olabilir, ancak çoğu zaman Illustrator&#39;ın desen oluşturmayı otomatikleştirme yeteneği, gidilecek yol olacaktır. </p> <p> Bu, Illustrator&#39;ın hayatınızı kolaylaştırarak tasarımlarınız üzerinde çalışmanız için size daha fazla zaman kazandırmasının birçok yolundan yalnızca biridir. </p>"}