{"title":"Akıllı Garaj Kapısı Kontrol Cihazı Nasıl Kurulur","content":"<p> Garaj kapınızı akıllı telefonunuz veya tabletinizle kontrol etmek ister misiniz? Evinizde zaten kurulu bir garaj kapısı açıcınız varsa, akıllı bir kontrolör harika bir seçenektir. </p> <p> Size akıllı bir garaj kapısı denetleyicisinin nasıl kurulacağını göstereceğiz. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Açıcı ve Denetleyici Arasındaki Farklar </h2> <p> Akıllı garaj kapısı açıcı ile kontrolör arasında iki temel fark vardır. Birincisi boyuttur. </p> <p> Çoğu açıcı büyüktür ve garajınızın tavanına monte edilir. Kapıyı açıp kapatmak için mekanik bir ray kullanırlar. Garaj kapısı denetleyicisi ise, akıllı bir cihazdaki bir uygulamayı kullanarak açıcıyı kontrol etmenizi sağlayan küçük bir elektronik ünitedir. </p> <p> Bu iki ürün arasındaki ikinci fark fiyattır. Garaj kapısı açıcıları yaklaşık 300 dolara mal olabilir. Bu açıcıların kurulumu genellikle profesyonel bir kurulumcunun yardımını gerektirir. </p> <p> Bununla birlikte, bir kontrolör genellikle profesyonel kurulum gerektirmez. Bunun yerine, denetleyici, mevcut açıcınıza bir eklenti olarak işlev görür. </p> <p> Bu, yeni bir açıcının fiyatının çok altında bir fiyata aynı işlevi yalnızca bir kontrolör kullanarak elde edebileceğiniz anlamına gelir. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> Akıllı Garaj Kapısının Faydaları Nelerdir? </h2> <p> Akıllı bir garaj kapısına sahip olmanın üç ana faydası vardır. </p> <ul> <li> <strong> Emniyet </strong> —Akıllı bir garaj kapısı, kapıyı hemen hemen her yerden açıp kapatmanıza olanak tanır. </li> <li> <strong> Güvenlik </strong> —Çoğu akıllı garaj kapısı açıcıları ve kumandaları, garajınız belirli bir süre açık kaldığında sizi uyarır. </li> <li> <strong> Kolaylık </strong> — Garaj kapınızı kapatmak için eve dönmek zorunda kaldıysanız, akıllı bir garaj kapısı uygulamasına sahip olmak zaman kazandırır. Eve gitmek yerine, telefonunuzu çıkarmanız yeterli. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> Akıllı Garaj Kapısı Kontrol Cihazı Nasıl Kurulur </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Akıllı bir garaj kapısı denetleyicisinin sizin için doğru olduğuna karar verdiyseniz, bu kılavuz size nasıl kurulacağını gösterecektir. Bu gösteride, bir <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meros MSG100 </a> kullanılır, ancak bu işlem başka bir marka kullanılıyorsa benzerdir. Ayrıntılar için denetleyicinizin belgelerine bakın. </p> <h3 id=\"what-you-ll-need\"> Neye ihtiyacınız olacak </h3> <ul> <li> Akıllı bir garaj denetleyicisi </li> <li> Zımba tabancası veya tel yuvaları </li> <li> Otomatik açıcı takılı garaj kapısı </li> <li> Philips ve oluklu tornavidalar </li> <li> Merdiven </li> </ul> <h3 id=\"plan-the-installation\"> 1. Kurulumu Planlayın </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Kumandanızı kurmadan önce garajınızda birkaç noktayı keşfetmeniz gerekecek. Birincisi, kontrolör için bir güç kaynağıdır. İkincisi, kontrolörden kitinizde bulunan kapıya monte sensöre giden kablo yoludur. Üçüncüsü, manyetik sensörün yeridir. </p> <p> Bu manyetik sensör, kontrolörün kapının ne zaman açılıp kapandığını bilmesini sağlar. </p> <p> Çoğu kontrolör, kapı sensörüne bağlanmak için uzun bir kablo kullanır. Kabloyu yoldan uzak tutmak için bu kabloyu tavandan veya bir duvardan aşağı yönlendirmeniz gerekir. </p> <p> Kurulumunuzu planladıktan sonra, kontrolörden sensör konumuna sensör kablosunu test edin. Bu test uyumu, sensör kablonuzun kontrol cihazınıza ulaşmasını sağlar. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Garaj Kapısı Açıcınızın Gücünü Kapatın </h3> <p> Garaj kapılarının çoğu, tavanın bir yerinde elektrik prizine takılıdır. Bu açıcılar için, devam etmeden önce fişlerinin çekildiğinden emin olmak isteyeceksiniz. </p> <p> Açıcınızın fişi yoksa ve bunun yerine tavandan gelen kablolara bağlıysa, kesici kutunuzu bulmanız ve orada açıcıya giden gücü kesmeniz gerekir. </p> <p> <strong> Not: </strong> 120 voltluk ev akımı ciddi yaralanmalara neden olabilir. Elektrikle çalışmak konusunda rahat değilseniz, şimdi durun ve profesyonel bir garaj kapısı montajcısı ve/veya elektrikçiye danışın. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Birlikte Verilen Kabloları Denetleyiciye Bağlayın </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> Meross ünitesinde, garaj kapısı açıcısına bağlanmak için kontrolöre takılması gereken bir dizi mavi ve kahverengi kablo vardır. Denetleyicideki plastik kapağı açın, iki vidalı terminal görmelisiniz. </p> <p> Küçük bir yarıklı tornavida kullanarak her bir terminaldeki vidaları gevşetin. Tellerinizi takın ve vidaları sıkın. Hangi telin nereye gittiği önemli değil. </p> <p> Güvenli olduklarından emin olmak için kabloları hafifçe çekin. Ardından kontrol cihazının kapağını değiştirin. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Garaj Kapısı Kontrol Ünitesini Monte Edin </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Konumlarınızı planladığınıza göre, şimdi kontrol cihazınızı monte etme zamanı. Denetleyicinin, herhangi bir kablolamaya baskı yapmadan ihtiyaç duyduğu güce erişebileceği bir yerde olduğundan emin olun. </p> <p> Ardından, denetleyicideki yapışkan desteği çıkarın ve yerine bastırın. Vida bağlantılı bir denetleyiciniz varsa, denetleyiciyi yerine sabitlemek için tornavidayı kullanın. </p> <h3 id=\"mount-the-sensor\"> 5. Sensörü Monte Edin </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> Ardından, kapı için sensörü monte etmeniz gerekecek. Bu sensörün kapı yolunu engellemeyecek bir yere yerleştirilmesi tavsiye edilir. </p> <p> Ayrıca, sensörü yere yakın monte etmek isteyebilirsiniz. Bu önerilmez, çünkü sürekli olarak doğrudan sensöre sıçrayan su sensöre zarar verebilir. Sensörü yerleştirdikten sonra, sabitlemek için verilen çift taraflı bant veya vidaları kullanın. </p> <p> Yukarıdaki fotoğrafta, siyah sensör, mıknatıs kısmı kapıya monte edilmiş olarak garaj kapısının yanına monte edilmiştir. Bu sensör, montaj için çift taraflı bant kullanır. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Sensör Kablolarını Bağlayın </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Şimdi kabloları sensöre ve kontrolöre bağlama zamanı. İlk adımda yaptığınız planı kullanarak tellerinizi yönlendirin ve telleri duvara veya tavana sabitlemek için zımba tabancasını kullanın. </p> <p> Kablolara zarar verebileceğinden, kabloları sıkıştırmadığınızdan veya bükmediğinizden emin olun. Yönlendirildiklerinde, kontrolör üzerindeki kırmızı dişi uç konnektörünü sensör kablosunun ucundaki kırmızı erkek uç konnektöre bağlayın. </p> <p> Ardından, garaj kapısı açıcınızın kapağını açmanız gerekecek. Ünite için ortak olan iki kontrol gücü ve duvardaki iki kontrol düğmesi olmak üzere dört kablo mevcut olmalıdır. </p> <p> </p> <p> Genellikle, bu teller tavandan kaynaklanır ve onları garaj kapısı açma ünitesine sabitleyen kıvrımlı kürek terminallerine sahip olmalıdır. Hangi kabloların hangisi olduğunu belirleyemiyorsanız, durun ve garaj kapısı açıcınızın kullanım kılavuzuna bakın veya sertifikalı bir elektrikçiye danışın. </p> <p> Kabloları bulduysanız, denetleyiciden gelen kahverengi ve mavi kabloları duvar düğmesine bağlı olan açıcıdaki terminallere bağlayın. Yukarıdaki fotoğrafta, kontrolör kabloları en soldaki iki terminale yerleştirilmiştir. </p> <p> Bitirdiğinizde, her bir duvar düğmesi terminaline bağlı iki kablo olmalıdır. Garaj kapısı açıcınızın kapağını tekrar sabitleyin, kontrolörü ve açıcıyı prize takın ve kurulum tamamlanmalıdır. </p> <p> Bir sonraki adımda, denetleyiciyi kablosuz bir ağa bağlayacaksınız. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Denetleyiciyi Wi-Fi&#39;ye bağlayın </h3> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (3 Resim) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Genişlet <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Genişlet <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <p> Wi-Fi bağlantısını kurmak için Meross uygulamasını kullandık. Şunun için kullanılabilir: <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> ve <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . Bu süreç neredeyse her zaman uygulamayı açmayı, ürününüzü tanımlamayı, uygulamayı Wi-Fi&#39;nize bağlamayı, Ayarlar ekranını açmayı ve denetleyicinin ağınıza erişmesine izin vermeyi içerir. </p> <p> Burada, uygulamayı açın ve ardından öğesine dokunun. <strong> Akıllı Garaj Kapısı Açıcı </strong> ve sonra <strong> Başlat </strong> . Kumandayla birlikte kullandığınız garaj kapısı açıcının üreticisini ve modelini seçin. Uygulamanıza özel talimatları uyguladığınızdan emin olun. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Açma/Kapama Zamanlama Aralığını Ayarlayın </h3> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (3 Resim) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Genişlet <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Genişlet <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <p> Yeni kontrol cihazınızı test etmeden önce ayarlamanız gereken önemli bir şey, garaj kapısı açıcının zamanlamasıdır. Meross uygulamasında, beş saniyelik aralıklarla 10 saniye ile 40 saniye arasında seçim yapabilir veya kapanması çift saniye süren kapılar için özel bir ayar ekleyebilirsiniz. </p> <p> Kapınız için zamanlamayı ayarlamak kolaydır, ancak doğru yapmanız gerekir. Çok kısa bir aralık, kapıyı kısmen açık bırakacaktır ve çok uzun bir ayar, garaj kapısı açıcının motorunda aşırı strese neden olabilir. </p> <p> Aralığı ayarlamak için ikinci ibreli veya kronometre fonksiyonlu bir saate ihtiyacınız olacak. Telefonunuzun yerleşik zamanlayıcısını da kullanabilirsiniz. Zamanlayıcınızı hazırlayın ve garaj kapısı açma düğmesinin yanında durun. Ardından, kronometrenizde başlat düğmesine basarken aynı anda düğmeye basın veya saniyedeki zamanı not edin. </p> <p> Garaj kapınızın hareketi durana kadar bekleyin ve zamanı kaydedin. Bu senin aralığın. Bu bilgileri uygulamaya aktarın ve aralık ayarı tamamlandı. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Garaj Kapısı Kontrol Ünitesini Test Edin </h3> <p> Uygulamanızı kullanarak, her şeyin çalıştığından emin olmak için kapıyı birkaç kez açıp kapatın. Artık garaj kapınızı açmak için duvar düğmesini veya uygulamayı kullanabilmelisiniz. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Akıllı Garaj Kapısı Kumandanızın Keyfini Çıkarın </h2> <p> Akıllı ev teknolojinizi bir garaj kapısına getirmenin bir servete mal olması gerekmez. </p> <p> Yeni bir akıllı garaj kapısı denetleyicisi kurmak, size ve ailenize eviniz için daha fazla esneklik, güvenlik, güvenlik ve rahatlık sağlar. Ayrıca garaj kapınızın neredeyse her yerden kontrol edilebileceğini bilmenin verdiği gönül rahatlığını da sağlar. </p>"}