{"title":"BitPay, Bitcoin&#39;i Apple Pay&#39;e Getiriyor","content":"<p> ABD&#39;deki BitPay kullanıcıları artık ön ödemeli bitcoin kartlarını Apple&#39;ın Cüzdan uygulamasına ekleyebilir ve <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple Pay ile ödeme yapmak için kullanın </a> . Apple dışındaki müşteriler yakında MasterCard markalı BitPay kartlarını Google Pay ve Samsung Pay&#39;e ekleyebilecek. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> BitPay Kartınızı Apple Cüzdanına Nasıl Eklersiniz? </h2> <p> BitPay kartınızı bir Apple cihazına eklemek için iPhone&#39;unuzda Cüzdan uygulamasını açın ve sağ üst köşedeki &quot;+&quot; simgesine dokunun, ardından kartı eklemeyi tamamlamak için ekrandaki talimatları izleyin. </p> <p> Cüzdan uygulamasındaki BitPay&#39;inizle, şuraya giderek kartı Apple Pay&#39;e ekleyebilirsiniz: <strong> Ayarlar &gt; Cüzdan ve Apple Pay </strong> , ardından &quot;Kart Ekle&quot; etiketli seçeneğe dokunun. BitPay kullanıcısı olmak ve ön ödemeli kartınızı sipariş etmek için BitPay Cüzdan uygulamasını şu adresten indirin: <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> Uygulama mağazası </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Apple Pay ile Harcamanın Yeni Bir Yolu </h2> <p> üzerinde bir yazı <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> BitPay Blogu </a> Apple Pay&#39;e bir BitPay kartı eklemenin kripto para birimlerini eskisinden daha fazla yerde harcamanın uygun bir yolu olduğunu söylüyor. BitPay CEO&#39;su Stephen Pair, &quot;Her zaman yeni yerler ve kriptolarını harcamanın yollarını arayan BitPay Kartını kullanan binlerce BitPay Cüzdan uygulaması müşterimiz var&quot; dedi. <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> basın bülteni </a> . </p> <p> </p> <p> Apple Pay ile BitPay kart sahipleri, fiziksel mağazalarda, Apple Pay&#39;i destekleyen uygulamalarda ve web&#39;de güvenli temassız alışveriş yapabilirler. Şirket, bir plastik kartın teslim edilmesini bekleyen müşterilerin, resmi BitPay Cüzdan uygulaması aracılığıyla sanal muadili Apple Cüzdan&#39;a ekleyebileceğini belirtiyor. Bunu yapmak, hemen harcamaya başlamanızı sağlayacaktır. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> BitPay Kartı Nedir? </h2> <p> Mastercard ağını kullanan ön ödemeli bir kart olan BitPay kartı, hem temassız ödemeler hem de PIN ödemeleri yapmayı ve uyumlu herhangi bir ATM&#39;den nakit çekmeyi kolaylaştırır. Uygulama ile müşteriler, bakiyelerini görüntüleme, yeni bir PIN talep etme, anında yeniden yükleme ve kripto para birimini fiat para birimine dönüştürme (daha sonra karta yüklenir, Mastercard bankacılığının dünya çapında kabul edildiği her yerde harcanmaya hazır) gibi şeyler yapabilir. </p> <blockquote> <p> Güçlü blok zinciri kullanıcıları için BitPay Cüzdan uygulaması, kripto satın almak ve depolamak ve çevrimiçi ödeme yapmak için bir dizi seçeneği destekler. Kullanıcılar, mağazada ve çevrimiçi olarak yüzlerce en iyi perakendeciden anında hediye kartı satın alabilir. </p> </blockquote> <p> Kartın bir EMV çipi vardır ve acil bir durumda uygulama ile kilitlenebilir. </p> <p> Şirkete göre, Google Pay ve Samsung Pay desteği &quot;bu çeyreğin sonunda&quot; planlanıyor. BitPay uygulamasına gelince, şu anda Bitcoin, Bitcoin Cash ve Ether&#39;in yanı sıra dört dolar sabit para, USDC, GUSD, PAX ve BUSD kripto para birimlerini desteklemektedir. </p>"}