{"title":"Bilgisayar RPG&#39;leri ve Klasik RPG&#39;ler: 2021&#39;de CRPG Ne Anlama Geliyor?","content":"<p> Bilgisayar RPG&#39;lerinin tarihi, yıllar içinde gelişen ve birlikte büyüyen video oyunlarının tarihi kadar uzundur. CRPG&#39;ler geliştikçe, grafikleri geliştirerek, oyun mekaniklerini ekleyerek veya bırakarak geliştikçe, onları tanımlamak için kullanılan anlam ve terminoloji de değişti. </p> <p> Geleneksel olarak Computer Role Playing Game&#39;in kısaltması olan CRPG kısaltması, zamanla anlamını farklı platformlar için RPG&#39;leri içerecek şekilde genişletti. Artık yeni bir anlam kazanmıştır. Yeni anlamı orijinalinden tamamen farklı olmasa da, artık belirli bir RPG alt türünü tanımlıyor. </p> <h2 id=\"the-history-of-crpgs\"> CRPG&#39;lerin Tarihi </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> CRPG&#39;lerin tarihi, 1970&#39;lerde masa üstü RPG Dungeons &amp; Dragons, Dungeon&#39;ın en eski video oyunu uyarlamasının piyasaya sürülmesiyle başladı. Oyun başlangıçta Atari&#39;de mevcuttu ( <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, Plex&#39;te bir oyun akışı hizmeti </a> ). </p> <p> Dungeon&#39;ın oynanışı esas olarak metin tabanlı olmasına rağmen, Dungeons &amp; Dragons&#39;ın temel ilkelerinin çoğunu uygularken çok karakterli partinizin hareketlerini bir fantezi ortamında tam olarak tanımladı. </p> <p> O zamanlar, onları o zamanlar çok daha popüler olan masa üstü benzerlerinden ayırmak için Bilgisayar RPG&#39;leri olarak etiketledik ve onları RPG olarak biliyorduk. </p> <p> 1990&#39;larda tam çiçek açan CRPG&#39;ler, şimdi en azından yukarıdan aşağıya bir perspektifte veya izometrik görünümde bir fantezi dünyasını tam olarak gösterebiliyor. Bu yazarın oynadığı en etkileşimli CRPG&#39;lerden biri olan Ultima VII için durum böyleydi. </p> <p> Görebildiğiniz hemen hemen her şeyi hareket ettirebilir veya etkileşime girebilirsiniz: Silahlar yapabilir, enstrüman çalabilir ve hatta ölü parti üyenizi diriltmek için bir zindandan kralın taht odasına kadar taşıyabilirsiniz! </p> <p> Baldur&#39;s Gate, masa üstü RPG deneyimini en yakından taklit edenlerden biriydi. Dungeons &amp; Dragons 2nd Edition&#39;ın kural setini (AKA Advanced Dungeons &amp; Dragons) bir izometrik olarak uyarladı. <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> gerçek zamanlı duraklatılabilir CRPG </a> . Bu tür CRPG&#39;ler savaşta taktikleri, karakter ilerlemesini, karar vermeyi vurguladı ve keşifleri teşvik etti. </p> <p> </p> <p> Bugün, konsolların pazara hakim olduğu bir dünyada, rol yapma video oyunları masa üstü RPG&#39;lerden daha popüler hale geldi. Günümüz kullanımında, RPG kısaltması daha çok video oyunu versiyonuna atıfta bulunur. Dungeon&#39;s &amp; Dragons&#39;u sadece bir RPG yerine masa üstü RPG olarak adlandırırsınız. </p> <p> Grafiklerin evrimi ile CRPG&#39;lerin oyun mekaniği modern grafik standartlarına uyarlandı. The Elder Scrolls, Gothic veya The Witcher gibi CRPG serileri, diğerlerini bırakırken bazı yeni oyun mekaniği getirerek türde devrim yarattı. </p> <p> Bu RPG&#39;ler daha aksiyon odaklı ve hızlı tempolu, kendilerini tamamen olmasa da hack and slash alt türü içine yerleştiriyorlar (bunlar hala sağlam RPG&#39;ler!) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Yeni Bir CRPG Dalgası </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> Yine de, günümüzün video oyunu endüstrisindeki grafik gerçekçilik eğilimine karşı çıkan yeni bir CRPG dalgası geldi. Eski tarz veya Klasik RPG&#39;ler bu oyunları büyük ölçüde etkiler ve görsellerden ziyade oyun mekaniğine ve sürükleyiciliğe vurgu yapar. </p> <p> Bunlar genellikle gerçek zamanlı duraklatılabilir veya sıra tabanlı taktik savaşları olan izometrik oyunlardır. Bu CRPG&#39;ler ayrıca mümkün olduğunca sürükleyici olmak için ellerinden gelenin en iyisini yapar ve size biraz büyük iyi hazırlanmış düzyazı blokları ve sağlam bir arka hikaye sağlar. </p> <p> Çoğu, eski okul CRPG&#39;leri gibi, diyalogların çoğu için ses yerine metne güveniyor. Bu CRPG&#39;lerden bazıları Pillars of Eternity, Divinity: Original Sin veya Pathfinder: Kingmaker&#39;ı içerir. </p> <p> Bu oyunlar aynı zamanda savaş taktiklerini, karakter ilerlemesini, karar vermeyi vurgular ve tıpkı eski tarz CRPG&#39;lerin yaptığı gibi keşifleri teşvik eder. Bu nedenlerden dolayı, onları çoğu modern RPG&#39;den ziyade Klasik RPG&#39;lerle daha yakından ilişkili olarak görüyoruz. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> 2021&#39;de CRPG Ne Anlama Geliyor? </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> 2000&#39;lerden beri, RPG, herhangi bir rol oynayan video oyununa atıfta bulunulan standart terim haline geldi. Ancak 2015 civarında Divinity: Original Sin ve Pillars of Eternity&#39;yi yayınladılar. </p> <p> Bu RPG&#39;ler, hem estetik hem de oyun mekaniği açısından eski oyunlara çok benzerken, modern RPG&#39;lerin aksiyon odaklı yaklaşımından ayrılıyordu. Bu zamanlarda, bu RPG&#39;leri modern RPG&#39;lerden ayırmak için yeni bir terime ihtiyaç duyuldu. </p> <p> İnsanlar bu oyunları tanımlamak için yıllardır internette &quot;eski okul&quot; ve &quot;Klasik RPG&quot; terimlerini kullansalar da, sonuncusu takılıp kaldı. Modern rol yapma video oyunlarının kendileri için RPG kısaltmasını talep etmesi gibi, insanlar şimdi eski okul RPG&#39;lerini &quot;CRPG&quot; olarak adlandırıyorlar. </p>"}