{"title":"Canon, En İyi Çekimlerinizi Bulan Bir Photo Culling Uygulamasını Başlattı","content":"<p> Neredeyse her kusursuz fotoğrafın arkasında, neredeyse tıpatıp ona benzeyen başka fotoğraflarla dolu bir film rulosu vardır. Fotoğrafçıların, kısacık bir anı kaçırabileceklerinden korkarak deklanşörlerini neredeyse her zaman basılı tutmaları alışılmadık bir durum değildir. </p> <p> Favorilerinizi seçmek ve depolama alanını temizlemek için düzinelerce, hatta yüzlerce fotoğrafın üzerinden geçmek uzun ve can sıkıcı bir süreç olabilir. Neyse ki Canon, bunu sizin için otomatik olarak yapan yeni bir uygulama yayınladı. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> En İyi Az Kişiye Kolayca Bir Fotoğraf Rulosu Alın </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon ABD </a> üzerinde bir fotoğraf itlaf uygulaması başlattı <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> Uygulama mağazası </a> bu, en iyi fotoğraflarınızı hızlı ve kolay bir şekilde bulmanızı sağlar. Uygulamanın kendisi ücretsizdir, ancak kullanmak için yıllık 14,99 ABD Doları veya aylık 2,99 ABD Doları tutarında bir abonelik almanız gerekir. Her iki abonelik seçeneğinin de üç günlük deneme süresi vardır. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> Canon ABD başkan yardımcısı Tatsuro &quot;Tony&quot; Kano şöyle açıklıyor: </p> <blockquote> <p> Binlerce fotoğrafın çekilip bir kişinin akıllı telefonunda saklandığı günümüzün sürekli değişen ve ezici dünyasında, tüketicilerin, yılların güvenilir bilgi ve teknolojisine dayalı olarak en iyi fotoğraflara karar vermelerine yardımcı olacak uzman, güvenilir ve sezgisel bir fotoğraf aracına ihtiyacı var. </p> </blockquote> <p> Canon&#39;un basitçe Photo Culling adlı uygulaması, Photography Intelligence Learning veya kısaca PHIL adlı bir yapay zeka üzerinde çalışır. PHIL, seçtiğiniz iki fotoğraf ayırma seçeneğinden hangisini temel alarak hangi fotoğrafları saklamanız ve hangilerini silmeniz gerektiğini önerir. </p> <p> İlk seçenek, <strong> bütün itlaf </strong> , için harika <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> daha iyi portre fotoğrafçılığı </a> . Bu seçenek belirlendiğinde, PHIL en iyi fotoğraflarınızı dört faktöre göre puanlayarak belirler: netlik, gürültü, duygular ve öznenizin gözlerinin kapalı olup olmadığı (varsa). </p> <p> Bu arada, <strong> benzer itlaf </strong> seçeneği, benzer fotoğraflar arasındaki puanları karşılaştırarak en iyi çekimlerinizi seçer. Örneğin, diyelim ki bir sürü bulut fotoğrafı, ardından da birkaç çiçek fotoğrafı çektiniz. Uygulama, bulut fotoğraflarını ve çiçek fotoğraflarını ayrı gruplara ayırır. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Hangi seçme seçeneğini seçerseniz seçin, bir fotoğrafın puanı belirlediğiniz hedef puanın üzerindeyse, fotoğraf kaleci olarak kabul edilir. PHIL daha sonra yeterince yüksek puan almayan kalan fotoğrafların silinmesini önerecektir. PHIL ile aynı fikirde değilseniz endişelenmeyin. Hala tüm atışlarınız üzerinde tam kontrole sahipsiniz. </p> <p> </p> <p> Uygulamanın diğer özellikleri arasında fotoğraf sayısı ve depolama alanı görüntüleme bilgileri, fotoğraf albümleri, fotoğraf puanları için parametre ayarları ve karanlık modu kullanma seçeneği yer alır. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> Canon&#39;un Photo Culling Uygulamasını İndirecek misiniz? </h2> <p> Görünüşe göre Canon&#39;un fotoğraf ayıklama uygulaması, en iyi fotoğraflarınızı seçme sürecini daha az sıkıcı hale getirmek için ihtiyacınız olan her şeye sahip. Bununla birlikte, günün sonunda, kendin yapabileceğin bir şey için ödeme yapmayı haklı çıkaracak kadar fotoğraf itlafından nefret edip etmediğine karar vermek sana kalmış (muhtemelen çok yavaş ve aklını kaçırmış olsa da). </p> <p> Yazma sırasında, uygulama Android için mevcut değil, ancak belki de Canon&#39;un gelecekteki kartlarında bu var. </p>"}