{"title":"DeviantArt, Mobil Uygulamasına Kenar Çubuğu ve Gruplar Ekliyor","content":"<p> Her görsel sanatçının kendine özgü yaratıcı süreci vardır, ancak özellikle günümüzün dijital çağında, bu süreçteki son adımın bitmiş eserinizi çevrimiçi paylaşmak olması yaygındır. </p> <p> İnsanların onları görmesi için resimlerinizi veya fotoğraflarınızı çekecek müzeler bulmanız gereken günler geride kaldı. Bunun yerine, size en çok hitap eden bir platform seçin ve yayınlayın! </p> <p> 2000 yılında kurulan DeviantArt, internetteki en eski sanat topluluklarından biridir. DeviantArt, mobil uygulamasını 2017&#39;de piyasaya sürdü ve en yeni güncellemesi küçük ama önemli. </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt for Mobile Navigasyonunu İyileştiriyor </h2> <p> DeviantArt, DeviantArt web sitesindekine çok benzeyen bir kenar çubuğu ekleyerek mobil uygulamasının kullanıcı arayüzünü iyileştirdi. Kenar çubuğu, ana sayfaya, takip ettiğiniz sapkınlara (sanatçılara) ve gruplara hızlı erişim sağlar. </p> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (2 Resim) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> Genişlet <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <p> Bu güncellemeden önce DeviantArt grupları yalnızca web sitesinde mevcut olduğundan, bu listedeki son öğeye erişim özellikle dikkate değerdir. DeviantArt grupları şuna benzer şekilde çalışır: <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> Facebook grupları </a> — platformda ortak ilgi alanları veya hedeflerle bir araya gelen kullanıcı koleksiyonları. </p> <p> Kenar çubuğunda simgesine dokunabilirsiniz. <strong> Gruplarım </strong> parçası olduğunuz tüm grupları görüntülemek için veya <strong> Önerilen Gruplar </strong> DeviantArt&#39;ın sizin için uygun olduğuna inandığı grupları görüntülemek için. Ayrıca, daha kolay erişim için favori gruplarınızı kenar çubuğunuzun üstüne sabitleyebilirsiniz. </p> <p> Kendi grubunuzu yönetiyorsanız, katılmak isteyebilecek diğer sapkınlar için önerilen bölümde görünebilir. Bir grupla ilgilenmiyorsanız, öneriyi kaldırmak için grubun adının sağındaki üç noktaya dokunabilirsiniz. </p> <p> Uygulamada bir grubu ziyaret ettiğinizde, hem sapmalarını (göndermeleri) hem de gönderilerini göreceksiniz. Grup yöneticileri, gönderiler akışından gruplarına yönelik güncellemeler yayınlayabilir. </p> <p> <strong> İndir: </strong> DeviantArt için <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> (Bedava) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> Kreasyonlarınızı Çevrimiçi Olarak Nerede Paylaşıyorsunuz? </h2> <p> Uzun süredir internette olan bir sanatçı, tasarımcı veya fotoğrafçıysanız, muhtemelen bir noktada DeviantArt&#39;ta bulunmuşsunuzdur. Topluluk 2000&#39;li yılların başındaki kadar canlı görünmüyor, ancak gönderilen eserlerin hacmi son yıllarda patladı. </p> <p> Bu kadar aktif bir kullanıcı kitlesi ile DeviantArt&#39;ın mobil uygulamasını geliştirmesi son derece önemli hale gelmelidir. Uygulama, yazıldığı sırada App Store&#39;da 2,6/5.0 ve Google Play&#39;de 3.2/5.0 olarak derecelendirilmiştir. </p>"}