{"title":"Disney+ 100 Milyon Aboneye Yakın","content":"<p> Disney&#39;i asla küçümsemeyin. Disney+ yalnızca Kasım 2019&#39;da ABD&#39;de piyasaya sürülmesine rağmen, akış hizmeti artık yaklaşık 100 milyon aboneye sahip. Şirketin bile beklemediği bir büyüme. </p> <h2 id=\"how-many-customers-does-disney-have\"> Disney+&#39;ın Kaç Müşterisi Var? </h2> <p> &#39;da açıklandığı gibi <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Disney Q1 2021 kazanç raporu </a> , Disney+&#39;ın 2 Ocak 2021 itibariyle dünya genelinde 94,9 milyon abonesi var. </p> <p> Bu, rakamın WandaVision&#39;ın başarılı bir şekilde piyasaya sürülmesiyle kazanılan aboneleri hesaba katmadığı anlamına geliyor. Disney+&#39;ın şu anda 100 milyondan fazla abonesi olduğunu varsaymak haksızlık olmaz. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Son rakamlar, Disney&#39;in itibari akış hizmeti için 86 milyon aboneye ulaştığını duyurduğu Aralık 2020&#39;de bildirildi. O zamandan bu yana yaşanan sıçrama, The Mandalorian&#39;ın ikinci sezonu ve Pixar&#39;ın uzun metrajlı filmi Soul gibi güçlü özel içeriğe bağlanabilir. </p> <p> Abone başına ortalama aylık gelir, bir yıl önce 5,56 dolardan bugün 4,04 dolara düştü, bu da çoğunlukla hizmetin Hindistan ve Endonezya&#39;daki daha ucuz maliyetinden kaynaklanabilir. </p> <p> Yine Disney&#39;in sahibi olduğu yayın hizmetleri Hulu ve ESPN+ da güçlü bir büyüme kaydetti. İlki geçen yıla göre %30 artarak 39,4 milyon aboneye ulaşırken, ikincisi yıllık %83 artarak toplam 12,1 milyon aboneye ulaştı. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney kısa süre önce tüm akış hizmetlerini birleştiren bir paket başlattı </a> , bu yüzden şirketin üçünü de desteklemeye devam ettiği açık. </p> <p> Star&#39;ın yakında birçok bölgede lansmanı yapılacak ve bu, Disney+&#39;ın sunduğu film ve TV şovlarının sayısında büyük bir artış sağlayacak. </p>"}