{"title":"Devasa Bir Microsoft Edge Güncellemesi Yolunuzu Açıyor","content":"<p> Microsoft, internet tarayıcısı Edge&#39;i olabilecek en iyi hale getirmek için çok çalışıyor. Şirket şimdi üç önemli özelliği getiriyor ve Edge&#39;in geleceği için işler pembe görünüyor. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Microsoft Edge için Ne Planladı? </h2> <p> Büyük tampon güncellemesi yakalandı <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows En Son </a> . Üç özelliğin büyük bir güncellemeyle gelmesi planlanıyor, bu nedenle yakın gelecekte gözünüzü Edge&#39;de tutmanızda fayda var. </p> <p> İlk olarak, Microsoft Edge web widget desteği alıyor. Bu widget&#39;lar, gün boyunca önemli bilgilere hızlı bir şekilde göz atmanın kullanışlı bir yoludur. Yazılım devi, tüm şekil ve boyutlardaki widget&#39;ları denemek istiyor, ancak işleri başlatmak için bir haber widget&#39;ıyla başlamaya karar verdi. </p> <p> Sırada, Microsoft Edge bir sekme arama özelliği alıyor. Bu size tanıdık geliyorsa, muhtemelen <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> Edge&#39;in sekme arama aracı aldığına dair ilk spekülasyon </a> . Neyse ki bu spekülasyon gerçeğe dönüştü ve Microsoft, Chrome özelliğini Edge&#39;e getirmeyi planlıyor. </p> <p> Son olarak, tüm Edge uzantılarınızı tek bir menüden yönetebileceksiniz. Tarayıcınızın görev çubuğunda bir yapboz parçası olarak görünecek ve tıkladığınızda, yüklediğiniz tüm uzantıların yanı sıra her birini etkinleştirmenin ve devre dışı bırakmanın hızlı bir yolunu gösterecektir. </p> <p> Bu güncellemenin tam olarak ne zaman yayınlanacağı belli değil, ancak Windows En Son &quot;bir sonraki büyük güncelleme&quot; için sabitledi. Bu nedenle, Microsoft Edge&#39;in yeni bir şey arayan insanlar için çekici bir seçim haline gelmesi çok uzun sürmeyecektir. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: Bir Sonraki Büyük Şey? </h2> <p> Çok uzun bir süre boyunca, Microsoft&#39;un tarayıcıları, Chrome veya Firefox&#39;u yüklemek için gelişmiş indirme yöneticileri olarak kabul edildi. Ancak Microsoft, tarayıcısı için bir Chromium kod tabanını benimsediğinden beri, tarayıcı dünyasının alay konusu olmaktan çıktı. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCounter </a> Microsoft Edge&#39;i, yazı yazılırken ABD&#39;de en çok kullanılan ikinci Windows tarayıcısı olarak listeler. Firefox&#39;un Edge tarafından toz içinde kaldığını zaten biliyorduk, ancak o zamandan beri boşluk daha da büyüdü. </p> <p> Şimdi, Edge, Firefox&#39;un sahip olduğu yüzde 3,35&#39;e kıyasla ABD pazar payının yüzde 5,25&#39;ini oluşturuyor. Her ikisi de Chrome&#39;un yüzde 45,83&#39;ünden çok uzak, ancak bu bir başlangıç. </p> <p> Bu nedenle, daha önce Microsoft&#39;un tarayıcısına burnunuzu soktuysanız, şimdi ona ikinci bir şans vermenin tam zamanı. Kim bilir, Microsoft&#39;un şimdiye kadarki en iyi tarayıcısı tarafından kazanılmış olabilirsiniz! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Tarayıcıyı Kenara İtmek </h2> <p> Geçmişte Microsoft&#39;un tarayıcılarının hayranı değilseniz, içeri girip yaygaraların ne hakkında olduğunu görmek için iyi bir zaman. Çalışmalarda büyük bir güncelleme var ve sadece buradan daha iyi olacak. </p> <p> Microsoft, kazanan bir formül üzerinde olduğunu biliyor. Aslında, şirket yakın zamanda dünya çapında 600 milyon insanın internette gezinmek için Edge&#39;i kullandığını bildirdi. </p> <p> <small> İmaj Kredisi: DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}