{"title":"En Son WatchOS Güncellemesi, Apple Watch-Bricking Hatasına Karşı Savunuluyor","content":"<p> Apple&#39;ın en son watchOS güncellemesi, yazılım sürümü 7.3.1, çok önemli bir düzeltmeyi içerir --- bazı Apple Watch Series 5 ve Apple Watch SE cihazlarının Güç Rezervi moduna girdiklerinde şarj olmasını engelleyen bir hatayı çözer. </p> <p> Şirket ayrıca, bu düşük güç modunda kapana kısılmış ve bu moddan çıkamayan etkilenen cihazlar için yeni bir ücretsiz onarım programı başlattı. Bu hata esasen Apple Watch&#39;larını &quot;tuğlalar&quot; ve artık işlevsel hale getirmez. </p> <h2 id=\"the-power-reserve-mode-bug\"> Güç Rezervi Modu Hatası </h2> <p> Güç Rezervi modu, Apple Watch&#39;un pili azaldığında başlatılır. Apple Watch&#39;ınızın iPhone&#39;unuzla iletişimini durdurur. Ayrıca, kullanıcıların Apple Watch&#39;taki diğer özelliklere erişmesini de engeller. Güç Rezervi modundan çıkmak için kullanıcıların Apple Watch&#39;larını şarj etmeleri gerekir. </p> <p> üzerinde <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> hata ve onarım programı hakkında destek sayfası </a> , 15 Şubat tarihli Apple şunu belirterek başlıyor: </p> <blockquote> <p> watchOS 7.2 veya 7.3 çalıştıran Apple Watch Series 5 veya Apple Watch SE modellerine sahip çok az sayıda müşteri, Güç Rezervine girdikten sonra saatlerinin şarj olmamasıyla ilgili bir sorunla karşılaştı. </p> </blockquote> <p> Apple, etkilenen bir Apple Watch modeliniz olup olmadığını öğrenmek için Saatinizi şarj cihazına yerleştirmenizi ve en az 30 dakika beklemenizi önerir. Ücretlendirilmezse, Apple Destek ile iletişime geçin ve ücretsiz postayla onarım ayarlayacaktır. </p> <p> Saatler muayeneye tabi tutulacak ve uygun olduğu takdirde ücretsiz olarak tamir ettirilecek ve tamir edilen Saat sahibine iade edilecektir. </p> <p> Hatadan tam olarak kaç tane Apple Watch&#39;ın ciddi şekilde etkilendiği belli değil. Ancak, sorunun yalnızca Apple Watch Series 5 veya Apple Watch SE modellerinin bir alt kümesini etkilediği ve diğer modelleri etkilemediği görülüyor. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> WatchOS 7.3.1&#39;e Nasıl Yükseltilir </h2> <p> Hatayı deneyimlememiş olanlar için, yalnızca potansiyel olarak meydana gelmesine karşı kendinizi korumak için en son watchOS sürümüne yükseltmeye değer. </p> <p> Hata düzeltmenin önemi, Apple&#39;ın watchOS 7.3.1&#39;i hemen tüm kullanıcılara sunması gerçeğiyle gösterilir. Bu, normalde yazılım güncellemelerini beta testi için geliştiricilerin kullanımına sunarak yayınlama biçimine zıttır. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple, watchOS 7.3&#39;ü yayınladı </a> Ocak ayı sonlarında. </p> <p> Kullanıcılar, iPhone&#39;daki Apple Watch uygulamasını kullanarak watchOS 7.3.1&#39;i indirebilir. Bunu yapmak için, gitmeleri gerekir <strong> Genel &gt; Yazılım Güncelleme </strong> . Güncelleme için Apple Watch&#39;unuzun pilinin en az yüzde 50 olması gerekir. Ayrıca iPhone&#39;unuza yakın olmalıdır. </p>"}