{"title":"En İyi Anlık Mesajlaşma Servisleri Uçtan Uca Şifrelemeyi Nasıl Kullanıyor?","content":"<p> Kişisel veriler her zamankinden daha önemli. Hükümetler, şirketler ve siber suçlular, insanların kişisel verilerinin kendi çıkarlarına hizmet etmesi için can atıyor. Çevrimiçi olarak farklı platformlar, kişisel verilerin bilgimiz dışında verilmesini kolaylaştırdı. </p> <p> Bu nedenle, çevrimiçi kullandığınız platformların gizliliğinizi nasıl koruduğunu iyi anlamak önemlidir. Mesajlaşma uygulamalarının koruma önlemlerini düşünürken dikkat edilmesi gereken temel faktörlerden biri uçtan uca şifrelemedir. </p> <p> Veri gizliliğine öncelik verme ihtiyacının farkına varan daha fazla mesajlaşma uygulaması, uçtan uca şifrelemeyi uygulamak için önemli adımlar attı. </p> <h2 id=\"what-is-end-to-end-encryption\"> Uçtan Uca Şifreleme Nedir? </h2> <p> </p> <p> Uçtan uca şifreleme <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> iletişimi şifreleme yöntemi </a> böylece üçüncü şahıslar birbirleriyle mesajlaşan kişiler arasında paylaşılan bilgilere erişemez. </p> <p> Uçtan uca şifrelemede, mesajların içeriğini gizlemek için düz metin yerine gizli bir kod kullanılır. Bu, yalnızca uçtan uca şifreli bir platformda iletişim kuranların kendi aralarında gönderilen mesajları okuyabileceği anlamına gelir. </p> <p> Üç popüler güvenli mesajlaşma hizmeti olan Signal, WhatsApp ve Telegram&#39;ın uçtan uca şifrelemeyi nasıl kullandığına bakalım. </p> <p> </p> <h2 id=\"signal\"> sinyal </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signal, en güvenli mesajlaşma uygulamalarından biri olarak kabul edilir. Platformdaki tüm iletişim varsayılan olarak uçtan uca şifrelenir. </p> <p> Signal, mesajları bulutta yedeklemez, bu da bilgi edinmek için alternatif yöntemler kullanan kötü aktörlerin risklerini azaltır. Ayrıca, mesajların meta verilerini şifreler, böylece mesajlaşma etkinliklerinin yeri ve zamanı izlenmez. </p> <p> Açık kaynaklı bir şifreleme motoruyla halk, mesajlaşma etkinliklerinin arkasındaki teknolojide daha yüksek düzeyde şeffaflıktan yararlanır. Kullanıcılar, gizliliklerini korumak için kullanılan yöntemleri daha iyi anlamak için teknik ayrıntılara daha yakından bakabilirler. </p> <p> Açık kaynak platformları, yazılımın uzun vadede kullanımını çok daha kolay ve güvenli hale getirebilir. İnsanlar yalnızca yazılımın nasıl çalıştığını daha iyi anlamakla kalmaz, aynı zamanda benzersiz güvenlik gereksinimlerine daha uygun olabilecek kendi uygulama sürümlerini kurmaya çalışabilirler. </p> <p> Signal, grup sohbetlerinde mesajları uçtan uca şifrelemeyi mümkün kılan Çok Taraflı Kayıt Dışı Mesajlaşma olarak adlandırılan bir OTR kombinasyonunu kullanır. Bir ağdaki katılımcı sayısı arttıkça veri ihlali riskleri artabilir. Uçtan uca şifreli grup sohbeti ile bu tür riskler önemli ölçüde azalır. </p> <p> </p> <h2 id=\"whatsapp\"> Naber </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp, uçtan uca şifrelemeyi etkinleştiren ilk popüler mesajlaşma uygulamalarından biriydi. Mesajlar ve aramalar için uçtan uca şifreleme kullanır. </p> <p> WhatsApp, Signal messenger&#39;ın arkasındaki ekip olan Open Whisper Systems tarafından geliştirilen uçtan uca şifreleme protokolünü kullanır. Bu, Signal&#39;in şifreleme protokolünün ne kadar güvenli olduğu düşünüldüğünde, uygulama için büyük bir artı. </p> <p> </p> <p> WhatsApp&#39;ın kendi tescilli dağıtımını kullanması, çok çeşitli güvenlik araştırmacıları tarafından Signal&#39;in tamamen açık kaynaklı yazılımı kadar sık ​​incelenmeyebileceği anlamına gelir. </p> <p> Mesajların şifrelenmesine rağmen, mesajlar bulutta yedeklenebildiği ve uygulamadaki meta veriler şifrelenmediği için WhatsApp&#39;ta gönderilen mesajlar hakkında daha fazla bilgi edinmek için başka yollar kullanılabilir. Bu, mesajların zamanını ve yerini bilmeyi kolaylaştırır. Ek olarak, Google aramasında indekslenen WhatsApp grup sohbetlerinin, grup sohbetlerinin güvenliğini sorgulayan raporlar ortaya çıktı. </p> <p> </p> <h2 id=\"telegram\"> Telgraf </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegram, şifreleme kullanımı ve kendi kendini imha eden mesajları nedeniyle sevilir. Ne yazık ki, Telegram&#39;da pek çok kullanıcı için çok açık görünmeyen birkaç uçtan uca şifreleme endişesi var. </p> <p> Telegram&#39;da uçtan uca şifreleme varsayılan olarak etkin değildir. Yalnızca kullanıcılar gizli sohbetlere geçtiğinde sunulur. Teknik olarak istekli olmayan kullanıcılar için bu, farkında bile olmayabilecekleri güvenlik riskleri sunar. </p> <p> Telegram, bulutunda yedeklenen sunucularında depolanan mesajlara erişebilir. Bazıları bunun, siber suçluların uygulamadan mesajlaşma verilerini çalmaya çalıştığı durumlarda kişisel veri ihlallerine yol açabilecek ek saldırı vektörleri sunduğuna inanıyor. </p> <p> Bununla birlikte, Telegram&#39;daki tüm gizli sohbetler cihaza özeldir, yani gizli sohbetler aracılığıyla gönderdiğiniz mesajlara yalnızca gönderildiği cihazdan erişilebilir. </p> <p> Telegram&#39;ın gizli sohbetleri uçtan uca şifrelenirken grup sohbetleri öyle değildir. Bu, kullanıcıların aynı grup sohbeti için birden fazla cihaz kullanabilecekleri anlamına gelir. Sohbet günlükleri, kullanıcılar tarafından birden fazla cihaza indirilebilir. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Gizli sohbetler <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #Telgraf </a> mesajlarınızın uçtan uca şifreleme ile korunduğu ve belirli bir süre sonra silindiği anlamına gelir. <br><br> Bu özelliği nasıl etkinleştirebileceğiniz aşağıda açıklanmıştır. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> — Kaspersky (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 31 Ocak 2021 </a></blockquote>  <p> Telegram, uzak sunucularında hem normal hem de gizli sohbetlerden bağlantı önizlemeleri oluşturur. Bir kullanıcı gizli bir sohbette ilk kez bir bağlantı yazdığında, uygulama onları bağlantıların uzak sunuculara gönderileceği konusunda uyarır. Özel bir sohbette paylaşılan bağlantıları uzak bir sunucuya göndermek, uçtan uca şifreleme amacına aykırı olduğundan, bu bir güvenlik zayıflığı olarak kabul edilir. </p> <p> Telegram&#39;ın şifreleme protokolü olan MTProto, mobil uygulamalardan bir sunucu API&#39;sine erişim için tasarlanmıştır. Tescillidir ve yalnızca kısmen açık kaynaktır. Bu, halkın mesajlarını korumak için kullanılan şifreleme yöntemleri üzerinde ne kadar kontrol ve anlayışa sahip olduğunu sorguluyor. </p> <p> Neyse ki, mesajlaşma uygulaması veri ihlalleriyle ilgili ciddi iddialarla karşılaşmadı, ancak operatörlerinin mesajlarınıza erişmesinin mümkün olduğunu bilmek endişe verici. </p> <p> Endişelere rağmen, çoğu kişiye mesajlara erişmek için atlanması gereken çeşitli yasal çemberler güven verebilir. Telegram, geçmişte insanların platformundaki mesajlara erişmesinin ne kadar zor olduğunu açıkça ortaya koydu. Anahtarlara, birçok insanı hayal kırıklığına uğratan farklı yargı alanlarından erişilmesi gerekir. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> En Güvenli Mesajlaşma Uygulamasını Seçme </h2> <p> Signal, WhatsApp kadar popüler olmasa da, protokolü, WhatsApp&#39;ın uçtan uca şifreleme ile başarısına önemli bir katkıda bulunan faktör olarak hizmet etti. Uçtan uca şifreleme yöntemleri WhatsApp&#39;a benzer olsa da, uçtan uca şifreleme için WhatsApp&#39;tan daha iyi olduğu düşünülmektedir. Kullanıcıları korumak için ekstra adımlar atarak kendini farklı kılar. </p> <p> Telegram&#39;ın uçtan uca şifrelemeye öncelik vermeme kararı, kolaylık tercihine bağlanıyor. Şifrelemeden yoksun olduğu durumlarda, kullanıcıları bulut şifreleme ve anahtarların farklı yasal yargı alanlarında saklanmasıyla korumaya yönelik dolaylı yöntemleriyle telafi eder. </p>"}