{"title":"Facebook&#39;ta Sizi Kimlerin Takip Ettiğini Nasıl Görebilirsiniz?","content":"<p> Facebook arkadaşlarınızı büyütmeyi sevdiğiniz kadar Facebook&#39;ta daha fazla takipçi edinmeyi önemsiyorsanız, sizi Facebook&#39;ta kimlerin takip ettiğini görmek isteyebilirsiniz. Bunu hem masaüstünde hem de mobilde kolayca yapabilirsiniz. </p> <p> Facebook&#39;ta kaç takipçiniz olduğunu nasıl öğreneceğiniz aşağıda açıklanmıştır. </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-desktop\"> Facebook&#39;ta Sizi Kimlerin Takip Ettiğini Nasıl Görebilirsiniz (Masaüstü) </h2> <p> Masaüstünde, Facebook&#39;ta sizi kimin takip ettiğini görebilirsiniz, ancak takipçi sayısını göremezsiniz. Ancak Facebook mobil uygulaması sizi kimlerin takip ettiğini ve takipçi sayınızı görmenizi sağlar. </p> <p> <img alt=\"Facebook profile interface with friends\" src=\"images/click-more-and-select-followers-786.jpg\" loading=\"lazy\"> </p> <p> İlk olarak, hesabınıza giriş yapın <a href=\"https://web.facebook.com\" target=\"_blank\" rel=\"nofollow noopener\"> Facebook hesabı </a> tarayıcınız aracılığıyla ve Facebook takipçilerinizi görmek için aşağıdaki talimatları kullanın: </p> <ol> <li> Giriş yaptıktan sonra, tıklayın <strong> küçük resim simgesi </strong> kenar çubuğunda adınızın yanında. </li> <li> Profil menüsünde, <strong> Arkadaşlar </strong> . </li> <li> Arkadaşlar menüsünde, <strong> Daha </strong> sağdaki açılır menü. </li> <li> Açılır listeden, <strong> Takipçiler </strong> Tüm Facebook takipçilerinizi görüntülemek için. </li> </ol> <p> </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-mobile\"> Facebook&#39;ta Sizi Takip Edenleri Nasıl Görebilirsiniz (Mobil) </h2> <p> Daha önce de belirttiğimiz gibi, Facebook mobil uygulaması, listeye ve Facebook&#39;ta sizi takip eden kişilerin sayısına erişmenizi sağlar. </p> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (3 Resim) </strong> <img alt=\"Facebook profile about info menu\" src=\"images/tap-see-your-about-info-732.png\" loading=\"lazy\"> Genişlet <img alt=\"Mobile Facebook interface displaying Facebook followers\" src=\"images/tap-see-all-to-load-a-list-of-your-followers-895.png\" loading=\"lazy\"> Genişlet <img alt=\"Mobile Facebook page displaying a list of followers and their numbers\" src=\"images/look-to-the-upper-right-corner-to-see-the-number-of-followers-677.png\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <p> Mobil uygulama üzerinden Facebook hesabınıza giriş yapın. Ardından şu talimatları izleyin: </p> <ol> <li> Mobil uygulamanın ana sayfasında, yanındaki yuvarlak resim simgesine dokunun. <strong> Aklınızdan ne geçiyor? </strong> profilinizi yüklemek için arama çubuğu. </li> <li> Profil menüsünde öğesine dokunun. <strong> Hakkında Bilgilerinizi Görün </strong> . </li> <li> Sayfanın en altına gidin. sonra altında <strong> Takipçiler </strong> , dokunmak <strong> Hepsini gör </strong> Tüm Facebook takipçilerinizin bir listesini yüklemek için. </li> <li> Sayfanın sağ üst köşesine bakın (karşı <strong> Takipçiler </strong> ) Facebook&#39;ta sizi takip eden kişi sayısını görmek için. </li> </ol> <p> Facebook takipçileriniz yoksa kontrol etme seçeneğiniz olmayacak. Sonuç olarak, yukarıdaki adımları takip etmek, takipçilerinizi kontrol etmenize izin vermez, çünkü hiçbiri yoktur. </p> <p> Facebook hesabınız yeniyse, muhtemelen henüz takipçiniz olmadığı için bu seçeneği alamayabilirsiniz. Veya yapmanız gerekebilir <a href=\"https://www.makeuseof.com/tag/quickly-switch-facebook-profiles/\" target=\"_blank\" rel=\"nofollow noopener\"> farklı bir Facebook hesabına geç </a> . Alternatif olarak, hesabınız insanların sizi Facebook&#39;ta takip etmesine izin verecek şekilde ayarlanmamış olabilir; bunun nasıl değiştirileceğini aşağıda açıklayacağız. </p> <p> </p> <p> </p> <h2 id=\"how-to-give-the-public-access-to-follow-you-on-facebook\"> Facebook&#39;ta Sizi Takip Etmek İçin Kamu Erişimi Nasıl Verilir? </h2> <p> Bazen, halkın sizi takip etmesine izin vermezseniz, daha fazla Facebook takipçisi edinme şansınızı sınırlar. </p> <p> Bunun nedeni, arkadaş listenizde olmayan kişilerin, siz izin vermezseniz Facebook&#39;ta sizi takip edemeyecek olmalarıdır. Ancak, takip tercihinizi &quot;Herkese Açık&quot; olarak ayarlayabilirsiniz, böylece sadece arkadaşlarınız değil, herkes sizi takip edebilir. </p> <p> <strong> Bunu masaüstünde yapmak için: </strong> </p> <p> <img alt=\"Facebook privacy settings page\" src=\"images/click-on-public-post-and-change-who-can-follow-you-to-public-880.jpg\" loading=\"lazy\"> </p> <ol> <li> Profilinize gidin. </li> <li> Tıkla <strong> yuvarlak açılır simge </strong> menü çubuğunun sağ üst köşesinde. </li> <li> Listeden, seçin <strong> Ayarlar ve Gizlilik </strong> . </li> <li> Tıklayın <strong> Ayarlar </strong> . </li> <li> Ayarlar menüsünün kenar çubuğundan <strong> Herkese Açık Gönderiler </strong> . </li> <li> sağına bak <strong> Beni Kimler Takip Edebilir </strong> seçeneğini tıklayın ve <strong> Arkadaşlar </strong> yıkılmak. </li> <li> Seç <strong> halka açık </strong> Facebook&#39;ta arkadaşınız olmayanlar da dahil olmak üzere herkese takip erişimi vermek için. </li> </ol> <p> <strong> Bunu Facebook mobil uygulamasında yapmak için: </strong> </p> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (3 Resim) </strong> <img alt=\"Facebook menu list\" src=\"images/tap-the-three-menu-bars-and-go-to-settings-170.png\" loading=\"lazy\"> Genişlet <img alt=\"Facebook settings list\" src=\"images/scroll-down-and-select-public-posts-754.png\" loading=\"lazy\"> Genişlet <img alt=\"Facebook followers settings page\" src=\"images/tick-the-public-option-under-who-can-follow-728.png\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <ol> <li> Facebook mobil uygulamasını açın ve <strong> üç yatay menü çubuğu </strong> ana sayfanın sağında. </li> <li> Aşağı kaydırın ve seçin <strong> Ayarlar </strong> . </li> <li> Dokunmak <strong> Herkese Açık Gönderiler </strong> . </li> <li> Altında <strong> Beni Kimler Takip Edebilir </strong> , tik <strong> halka açık </strong> . </li> </ol> <p> </p> <h2 id=\"keep-control-over-your-facebook-followers\"> Facebook Takipçilerinizi Kontrol Edin </h2> <p> Markanızı veya işletmenizi tanıtmak için Facebook kullanıyorsanız, takipçilerinizi takip etmek gereklidir. İnsanların sizin hakkınızda görebileceklerini denetlemenin iyi bir yolu. </p> <p> Facebook arkadaşlarınız ve takipçileriniz üzerinde daha fazla kontrol sahibi olmak istiyorsanız, onları akışınızdan gizlemeyi düşünmelisiniz. </p>"}