{"title":"Facebook#039;un Nefret Söylemi Tespit Eden Yapay Zeka Kazanç Sağlıyor","content":"<p> Facebook, nefret içeren içerikleri tanıma ve kaldırma konusundaki etkinliğini artırıyor. platformun <a href=\"https://transparency.facebook.com/community-standards-enforcement\" target=\"_blank\" rel=\"nofollow noopener\"> Topluluk Standartları Uygulama Raporu </a> 2020&#39;nin son çeyreğinde nefret söyleminin yaygınlığında önemli bir azalma olduğunu gösteriyor. </p> <h2 id=\"hate-speech-on-facebook-has-dipped\"> Facebook&#39;ta Nefret Söylemi Düştü </h2> <p> Facebook&#39;un Ekim-Aralık 2020 için Topluluk Standartları Uygulama Raporunda platform, Facebook&#39;un nefret söylemini ele alma biçiminde önemli gelişmeler olduğunu ortaya koydu. Facebook&#39;un dürüstlükten sorumlu başkan yardımcısı Guy Rosen bir paylaşım yaptı. <a href=\"https://about.fb.com/news/2021/02/community-standards-enforcement-report-q4-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> Facebook hakkında blogu </a> başarısını vurgulamak için. </p> <p> Facebook içeriğinin her 10.000 görünümü için, yalnızca yedi ila sekizi nefret içerikli içerik olarak görüntülendi. Facebook ayrıca, üçüncü çeyrekte 2,5 milyon gönderiden artışla 6,3 milyon zorbalık ve taciz gönderisi için harekete geçti. </p> <p> Platform ayrıca, Facebook&#39;un önceki çeyrekte kaldırdığı dört milyon parça içeriğe kıyasla büyük bir gelişme olan 6,4 milyon adet organize nefret içeriği yakalayabildi. </p> <p> Topluluk Standartları Uygulama Raporu, Instagram&#39;da benzer iyileştirmeler gösterdi. Instagram&#39;da taciz ve zorbalıkla ilgili beş milyon gönderi, nefret söylemi içeren 6,6 milyon içerik ve 308 bin organize nefret içeriği kaldırıldı. Tüm bu rakamlar üçüncü çeyrekte kaydedilen istatistikleri aşıyor. </p> <p> Facebook&#39;un proaktif oranı, yani Facebook&#39;un bir kullanıcı bunu bildirmeden önce kaldırdığı içerik miktarı olarak da bilinir. Zorbalık ve taciz için, platformun proaktif oranı Facebook&#39;ta yüzde 26&#39;dan yüzde 49&#39;a ve Instagram&#39;da yüzde 55&#39;ten yüzde 80&#39;e yükseldi. </p> <p> <img alt=\"Facebook graph for bullying\" src=\"images/facebook-content-takedowns-q4-715.png\" loading=\"lazy\"> Resim Kredisi: Facebook </p> <p> <a href=\"https://www.makeuseof.com/facebooks-ai-tackles-hateful-content/\" target=\"_blank\" rel=\"nofollow noopener\"> Facebook&#39;un nefret algılayan yapay zekası </a> nefret söylemine tepkisini artırmada önemli bir rol oynamıştır. Rosen, platformun yapay zekasında &quot;nefret söylemi veya zorbalık ve taciz gibi nüans ve bağlamın önemli olduğu durumlarda&quot; iyileştirmeler yaptığını ve bu iyileştirmelerin nihayetinde Facebook&#39;taki nefret içerikli içerik miktarını azaltmaya yardımcı olduğunu belirtiyor. </p> <p> Facebook&#39;un baş teknoloji sorumlusu Mike Schroepfer, konuyla ilgili ayrı bir gönderi yaptı. <a href=\"https://about.fb.com/news/2021/02/update-on-our-progress-on-ai-and-hate-speech-detection/\" target=\"_blank\" rel=\"nofollow noopener\"> Facebook hakkında blogu </a> Facebook&#39;un sürekli gelişen yapay zekasının başarılarını kutlamak için. Son başarılarına rağmen, Schroepfer, Facebook&#39;un yapay zekasının &quot;içeriği farklı diller, kültürler ve coğrafyalar bağlamında görüntülemede&quot; daha iyi hale gelmesini umuyor. </p> <p> </p> <h2 id=\"facebook-s-ai-is-getting-smarter\"> Facebook&#39;un yapay zekası daha akıllı hale geliyor </h2> <p> Facebook, devam eden COVID-19 pandemisi nedeniyle nefret içeren içeriklerin değerlendirilmesine yardımcı olması için AI sistemine daha fazla güvenmeye başladı. Rosen, Facebook ekibinin &quot;bir aşı yaygın olarak bulunana kadar&quot; salgından etkilenmeye devam edeceğini belirtti. </p> <p> Facebook&#39;un moderatörleri bir gün normal şekilde çalışmaya dönecek olsa da, platformun yapay zekası hiçbir yere gitmiyor gibi görünüyor. Facebook, yapay zekasını yalnızca daha akıllı ve daha verimli hale getirdi ve Facebook yakın zamanda ilerlemeyi durdurmayı planlıyor gibi görünmüyor. </p>"}