{"title":"Facebook&#39;tan Kalıcı Olarak Yasaklanmanızı Sağlayabilecek 5 Şey","content":"<p> Facebook, hesapları kaldırmak için Twitter kadar iyi bilinmiyor. Bununla birlikte, Facebook&#39;un yalnızca bir uyarı etiketinden daha fazlasıyla yanıt verdiği bazı yasaklanabilir suçlar vardır. </p> <p> Burada, Facebook&#39;un davranışları için &quot;platformdan kaldırdığı&quot; kullanıcıların tarihsel örneklerine bakarak Facebook&#39;un hüküm ve koşullarını ve şirketin çizgiyi nerede çizdiğini keşfediyoruz. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> Facebook&#39;un Kalıcı Yasaklara İlişkin Duruşu </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> Diğer sosyal medya sitelerinden farklı olarak Facebook, kalıcı bir yasakla sonuçlanan pek çok suç listelemez. Bunun yerine, birincil faktör olarak suçların ciddiyetinden ziyade tekrar eden suçları belirtmektedir. Sonuç olarak, teorik olarak, yeterince sık tekrarlanan herhangi bir Facebook ihlali, bir profil engellemesine neden olabilir. </p> <p> Bununla birlikte, çok az etkinlik tam bir yasakla sonuçlanır ve Facebook, kabul edilen bazı yasa dışı etkinliklerle şaşırtıcı bir şekilde gevşektir. Örneğin, Facebook&#39;un Marketplace&#39;inde silah ve marihuana gibi &quot;düzenlenmiş mallar&quot; satışına izin verilmez, ancak Facebook bunu yasaklanabilir bir suç olarak listelemez. </p> <p> Facebook, profilleri kaldırmak yerine, içeriği her postaya göre işaretlemeyi veya kaldırmayı tercih ediyor. Ancak, istisnalar vardır. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Araçları ve Verileri Kötüye Kullanma </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> Facebook&#39;un Hizmet Şartları, yasaklanmış üç suçu ortaya koymaktadır. İlki, bu makalenin geri kalanında daha ayrıntılı olarak incelenen bir eylemler topluluğudur. İkincisi ve üçüncüsü daha spesifiktir ve Facebook&#39;un araçlarını ve verilerini kötüye kullanmakla ilgilidir. </p> <p> Bu genel hizmet süresi, sitenin geliştiricilere ayrılmış olması gereken bölümlerine erişmeyi ve kullanmayı yasaklar. Ayrıca, virüsleri ve kötü amaçlı yazılımları yaymak için Facebook&#39;u kullanmak gibi, genel site araçlarının kasıtlı olarak kötü niyetli bir şekilde kullanılmasını da yasaklar. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Kamu Güvenliğine Yönelik Tehditler </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Facebook&#39;un hesapları devre dışı bıraktığını söylediği tek vakalardan biri, &quot;gerçek fiziksel zarar riski veya kamu güvenliğine yönelik doğrudan tehditler&quot;dir. Facebook ayrıca &quot;şiddet içeren bir misyon ilan eden veya şiddete karışan&quot; profilleri de kaldırır. </p> <p> Ocak 2021&#39;de ABD Başkenti&#39;nde çıkan bir isyanın ardından dönemin cumhurbaşkanı Donald Trump&#39;ı süresiz olarak yasaklamanın gerekçesi buydu. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Şiddet Gruplarıyla Birliktelik </h2> <p> Facebook, tek tek profillerde şiddet içeriği olmasa bile QAnon komplosu ile ilişkili profilleri kaldırdığında 2020 yılının Ekim ayında zararlı ve tehdit edici içerik konusundaki tutumunu ilişkisel düzeye taşıdı. Komplo grubu, 2016&#39;dan beri şiddet olaylarının yaşanmasına neden oldu. </p> <p> </p> <p> Facebook ayrıca Trapt adlı müzik grubunu Proud Boys nefret grubuna atıfta bulunan gönderiler için yasakladı. Aşırılık yanlısı siyasi örgüt, 2016&#39;dan beri ABD ve Kanada&#39;da sokak düzeyinde şiddet olaylarına karıştı. </p> <p> Şirket, bu hesapların Facebook için yasal risk oluşturması durumunda hesapları devre dışı bırakma hakkını da saklı tutar. Ayrıca Facebook, bu tür içeriklerle karşılaştığında kolluk kuvvetleri ve sosyal yardım kuruluşlarıyla çalışma konusunda diğer sosyal medya platformlarından daha kararlıdır. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Diğer Hesapların Güvenliğinden Ödün Vermek </h2> <p> Facebook&#39;un listelediği nadir yasaklanabilir suçlardan bir diğeri de &quot;diğer hesapların ve hizmetlerimizin güvenliğini tehlikeye atmak&quot;. Facebook hizmetlerinin güvenliğinden ödün vermek, hizmet şartlarında belirtilen kötü amaçlı yazılım ve kötüye kullanıma çok benziyor. Ancak, diğer hesapların güvenliğinden ödün verme fikri doxxing&#39;e işaret ediyor. </p> <p> </p> <p> Doxxing, bir sosyal medya kullanıcısının potansiyel olarak ev veya iş adresi, özel telefon numarası veya gerçek zamanlı fiziksel konumu dahil olmak üzere hassas gerçek dünyadaki bilgilerinin yayınlanmasıdır. Bu uygulama genellikle o kişiye zarar verme niyetiyle yapılır. </p> <p> </p> <h2 id=\"misinformation\"> 5. Yanlış bilgi </h2> <p> </p> <p> Facebook&#39;un resmi yönergeleri, Facebook&#39;un yanlış bilgileri kaldırmadığını, bunun yerine başkalarını yanıltmadan diyaloglara katkıda bulunabilmesi için etiketlemeyi seçtiğini söylüyor. Ancak, askıya alınan bazı hesap sahipleri, kaldırılmalarının Facebook&#39;un &quot;Yanlış Haber&quot; dediği şeyden kaynaklandığını söylüyor. </p> <p> Bunun olmasının birkaç nedeni var. Bazı durumlarda Facebook, yanlış haberlerin kişisel veya kamu sağlığına da zararlı olduğunu belirler. </p> <p> Buydu <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> Facebook&#39;tan komplo teorisyeni David Icke&#39;yi kaldırma açıklaması </a> diğer şeylerin yanı sıra 5G internetin Covid-19&#39;a neden olduğunu iddia ettiği için. Facebook ayrıca Icke&#39;nin politikaları &quot;tekrar tekrar ihlal ettiğini&quot; söyledi. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Facebook Politikaları ve Hesabınız </h2> <p> Çoğunlukla, platformu başkalarına zarar vermek için kötüye kullanmadığınız sürece Facebook sizinle ilgilenmez. Ancak, şirketin kuma bir çizgi çektiği bazı sorunlar vardır. </p> <p> Bu hizmet şartlarına uymazsanız, kalıcı bir Facebook yasağından korunmalısınız. </p>"}