{"title":"Facebook # 039; Mark Zuckerberg, Apple # 039; Gizliliğini Kişisel Olarak Zorladı","content":"<p> Facebook CEO&#39;su Mark Zuckerberg&#39;in Facebook çalışanlarına, sosyal medya devine bu kadar kötü davrandığı için Apple&#39;a &quot;acı vermemiz gerekiyor&quot; dediği bildirildi. <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> Wall Street Dergisi </a> raporlar. </p> <p> Zuckerberg&#39;in, Apple ve Facebook&#39;un baş yöneticilerinin, milyonlarca Facebook kullanıcısının kişisel verilerine siyasi reklamcılık için rızaları olmadan erişildiği Cambridge Analytica skandalının üzerine kafa yormasından sonra 2018&#39;de sözde yorum yaptığı iddia edildi. </p> <h2 id=\"apple-vs-facebook\"> Apple vs Facebook </h2> <p> O sırada Apple CEO&#39;su Tim Cook, Zuckerberg&#39;in durumunda olsaydı, krizle karşı karşıya olsaydı nasıl tepki vereceği konusunda bir röportajda sorgulandı. Cook, &quot;Bu durumda olmazdım&quot; dedi. </p> <p> Wall Street Journal, Zuckerberg&#39;in Cook&#39;un sözlerinin &quot;son derece geveze&quot; ve &quot;gerçekle hiç uyuşmadığını&quot; yorumlamasına rağmen, perde arkasında kendisinin değerlendirmesinde oldukça sert olduğunu iddia ediyor. </p> <p> O zamandan beri, iki teknoloji şirketi arasındaki ilişki daha iyi olmadı. Apple, gizlilik odaklı duruşunu ikiye katladı ve Cook, gizliliğin en önemli unsurlardan biri olduğunu ilan etti. <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> dünyanın en acil endişeleri </a> . iOS 14, Facebook&#39;un küçük işletmelere zarar verme potansiyeline sahip olduklarını iddia ettiği, gizlilikle ilgili birden fazla özellik içeriyor. </p> <p> Facebook&#39;un en son üç aylık yatırımcı çağrısı sırasında Zuckerberg, Apple&#39;ı etiketledi &quot; <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> [Facebook&#39;un] en büyük rakiplerinden biri </a> Zuckerberg, &quot;Bu yeni gizlilik koruma önlemlerinin bir sonucu olarak. Apple bunu insanlara yardım etmek için yaptıklarını söyleyebilir, ancak hamleler açıkça onların rekabetçi çıkarlarıyla birlikte ilerliyor&quot; dedi. </p> <p> </p> <p> Facebook&#39;un, iki Silikon Vadisi devi arasındaki keskin nişancılığı tam bir yasal savaşa dönüştürecek Apple&#39;a karşı bir antitröst davası hazırladığı iddia ediliyor. Wall Street Journal raporunda, &quot;Potansiyel yasal düzenlemeler ve yasal kararların, önümüzdeki yıllarda yüz milyonlarca tüketicinin telefonunu etkilemesi muhtemeldir.&quot; </p> <p> </p> <h2 id=\"different-approaches\"> Farklı yaklaşımlar </h2> <p> Facebook sözcüsü Dani Lever, Wall Street Journal&#39;a &quot;Apple bunun gizlilikle ilgili olduğunu iddia ediyor, ancak bu kârla ilgili ve kendilerini tercih eden, rekabete aykırı davranışlarını belirtmek için başkalarına katılıyoruz&quot; dedi. Facebook&#39;un Apple&#39;ın Uygulama Gizliliği özelliğinden zarar gören küçük işletmeler ve geliştiriciler adına &quot;kasten Apple&#39;a karşı durduğunu&quot; söyledi. </p> <p> Lever, iki şirket arasındaki savaşın kişisel olduğunu reddetse de, kesinlikle iki büyük teknoloji şirketi arasındaki birkaç çekişme noktasının ötesine geçiyor. Facebook&#39;un üzerinde çalıştığı reklam destekli iş modeli, Apple&#39;a güç veren donanım destekli modelden son derece farklıdır. İki şirketten hiçbiri - ya da liderleri - teknolojinin geleceğini nasıl inşa edeceklerine dair temel inançlarından geri adım atmayacak. </p> <p> Apple CEO&#39;su Tim Cook&#39;un mahremiyeti ahlaki terimlerle tartışması, bir düzeyde bunun gerçekten ne kadar kişisel olduğunu gösteriyor. </p> <p> <small> Resim Kredisi: Wikipedia/ <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Anthony Quintano CC </a></small> </p>"}