{"title":"Google Dokümanlar&#39;ın Yapabileceğini Bilmediğiniz 10 Şey","content":"<p> Google Doküman ilk bakışta basit görünebilir, ancak bulut üretkenlik aracı, işte daha fazlasını yapmanıza yardımcı olabilecek birçok gözden kaçan özelliğe sahiptir. </p> <p> Bu makalede, muhtemelen bilmediğiniz birkaç Google Dokümanı özelliğine ve bunları içerik oluştururken zamandan tasarruf etmek için nasıl kullanabileceğinize bakacağız. </p> <p> Bu özelliklere çoğunlukla Google Dokümanlar aracının masaüstü sürümünden erişilebildiğini lütfen unutmayın. Mobil versiyonda da kullanılabilenler belirtilecektir. </p> <h2 id=\"voice-typing\"> 1. Sesle Yazma </h2> <p> Sesle yazma özelliğini kullanmak için bir belge açın ve <strong> Araçlar </strong> sayfanın üst kısmındaki menü çubuğundan. Seç <strong> Sesle Yazma </strong> açılır menüden. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> Tercih ettiğiniz konuşma dilini seçebileceğiniz bir dil menüsü ile ekranınızda bir mikrofon açılacaktır. Metninizi söylemeye hazır olduğunuzda mikrofonu tıklayın veya <strong> Komut + Üst Karakter + S </strong> (Mac kullanıyorsanız) veya <strong> Ctrl + Üst Karakter + S </strong> (Windows PC kullanıyorsanız) kaydetmeye başlamak için. </p> <p> Metin arasına noktalama işareti eklemek için eklemek istediğiniz noktalama işaretinin adını &quot;nokta&quot;, &quot;virgül&quot; veya &quot;soru işareti&quot; gibi söyleyin. Sesle yazmaya ara vermek istiyorsanız &#39;yeni satır&#39; veya &#39;yeni paragraf&#39; veya &#39;dinlemeyi durdur&#39; ve devam etmeye hazır olduğunuzda &#39;devam et&#39; gibi biçimlendirme talimatları verebilirsiniz. </p> <p> Bundan gelişmiş düzenleme komutlarına bakın <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> komut listesi </a> Google&#39;ın Destek Sayfasında. </p> <p> Bu özelliği herhangi bir sesi kopyalamak için de kullanabilirsiniz. Sesi (telefonunuzdan veya başka bir cihazdan) sesten metne çalmanız yeterlidir ve sizin için yazmalıdır. Birkaç düzenleme yapmanız gerekebilir, ancak çok zaman kazanmış olursunuz. </p> <p> </p> <p> Sesle yazma özelliği yalnızca masaüstünde kullanılabilir ancak yalnızca Chrome tarayıcısında çalışır. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Çevrimdışı Düzenleme </h2> <p> Birçok kişi, anında buluta kaydetme özelliği nedeniyle Google Dokümanlar&#39;ı sever, ancak bir süre internete erişiminiz yoksa bu sakıncalı olabilir. İyi haber şu ki, dosyalarınıza çevrimdışı olarak erişmeye ve bunları düzenlemeye devam edebilirsiniz. </p> <p> Bu özellik yalnızca Google Chrome&#39;da mevcuttur ve aşağıdakileri yüklemeniz ve etkinleştirmeniz gerekir. <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Google Dokümanlar Çevrimdışı Chrome uzantısı </a> . Ayrıca, özel modda göz atmadığınızdan emin olun. </p> <p> Bu özelliğin çevrimiçi olduğunuzda devreye alınması gerekir, ancak bir kez yapıldığında çevrimdışı olarak metin yazabilir ve düzenleyebilirsiniz ve ardından internete eriştiğinizde buluta kaydedilirler. İşte nasıl. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> mümkün kılmak için <strong> Google Dokümanlar dosyalarını çevrimdışı açın ve kaydedin </strong> , takip et <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> bu talimatlar </a> . Bu özellik PC&#39;lerde, iOS&#39;ta ve Android&#39;de kullanılabilir. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Belge Sürüm Geçmişini İzle/Geri Yükle </h2> <p> Tek başına veya başkalarıyla birlikte bir belge üzerinde çalışıyorsanız, Sürüm Geçmişi özelliğini kullanarak belgede yapılan değişiklikleri izleyebilirsiniz. </p> <p> Ayrıca belgeyi geçici veya kalıcı olarak önceki bir sürüme geri yükleyebilirsiniz; Belgenizin bazı kısımlarını yanlışlıkla silerseniz ve belgeyi kullanamazsanız cankurtaran olabilecek bir özellik. <strong> Geri alma </strong> onları geri yüklemek için düğmesine basın. </p> <p> Sürüm geçmişi özelliğini kullanmak için <strong> Dosya </strong> menü çubuğundan seçin ve <strong> Sürüm Geçmişi </strong> açılır menüden. Bir sürümü de adlandırabileceğinizi göreceksiniz, böylece özellikle diğer kullanıcılar aynı belgede düzenlemeler yapıyorsa, belgedeki sürekli değişiklikleri takip etmek için bunu kullanabilirsiniz. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Bu özellik yalnızca masaüstünde kullanılabilir. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Önerme ve İnceleme Modu </h2> <p> Başkalarıyla işbirliği yapmak ve bir belgeyi birlikte düzenlemek harika olsa da, her bir kişinin yaptığı değişiklikleri takip etmek zor (ve dağınık) olabilir. </p> <p> Öneri özelliği, belgeyi tamamen değiştirmek istemiyorsanız, yalnızca düzenleme önermenize olanak tanır. Önerileriniz kenar çubuğunda yorum olarak editöre açılır ve editör öneriyi kabul ederek anında değişiklik yapabilir. İle konuşma dizilerini de devam ettirebilirsiniz <strong> yanıtla </strong> , böylece ileri geri e-posta göndermek zorunda kalmadan doğrudan belge sayfasında geri bildirim verebilir ve alabilirsiniz. </p> <p> Düzenleme önermek için, açık belgenizin sağ üst köşesindeki Düzenleme modu için kurşun kalem simgesini tıklayın ve ardından <strong> önermek </strong> . </p> <p> Belgeyi öneriler olmadan görüntülemek için <strong> görüntüleme </strong> . Üstü çizili ve yorum açılır pencereleri olmadan okuyabileceksiniz. </p> <p> Zaman kazanmak için tüm önerileri bir kerede kabul edebilir veya reddedebilirsiniz. Tıklayın <strong> Araçlar </strong> öğesini seçin, ardından <strong> Önerilen düzenlemeleri inceleyin </strong> . Tıklayın <strong> Hepsini kabul et </strong> veya <strong> hepsini reddet </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Bu özellik yalnızca masaüstünde kullanılabilir. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Yazı Tipi Ekle </h2> <p> eğer istersen <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> metninizi stilize edin </a> mesajınıza uyacak şekilde, bunu Google Dokümanlar ile de yapabilirsiniz. Google Dokümanlar aracında zaten programlanmış olan 24 varsayılan yazı tipinin yanı sıra, metninizi görsel olarak güçlendirmek için seçtiğiniz birkaç harika yazı tipini ekleyebilirsiniz. </p> <p> Yazı tipi eklemek için üzerine tıklamanız yeterlidir. <strong> Yazı Tipleri </strong> menü çubuğunda seçin ve <strong> Daha Fazla Yazı Tipi </strong> . Sağlanan koleksiyondan istediğiniz kadar yazı tipi seçin. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Bu özellik yalnızca masaüstünde kullanılabilir. </p> <p> </p> <h2 id=\"compare-documents\"> 6. Belgeleri Karşılaştırın </h2> <p> Bu, bir belgede kendiniz veya bir ortak çalışan tarafından yapılan değişiklikleri takip etmek için kullanabileceğiniz başka bir özelliktir. Özellikle büyük belgeler için kullanışlıdır ve adından da anlaşılacağı gibi, aralarındaki farkları görmek için iki belgeyi karşılaştırabilirsiniz. </p> <p> Bu özelliği kullanmak için karşılaştırma yapmak istediğiniz temel belgeyi açın ve ardından <strong> Araçlar </strong> ve seçin <strong> Belgeleri Karşılaştır </strong> . </p> <p> Açılan iletişim kutusunda, Drive&#39;ınızdan karşılaştırmak istediğiniz belgeyi seçin ve <strong> Karşılaştırmak </strong> . İçinde <strong> Öznitelik farklılıkları </strong> alanına, nihai belgede önerilen düzenlemelerin yazarı olacak ortak çalışanın adını girin. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> Farklılıklar, aynı şekilde gösterilecektir. <strong> önermek </strong> yukarıda tartıştığımız mod ve düzenlemeleri de kabul edebilir veya reddedebilirsiniz. </p> <p> Bu özellik yalnızca masaüstünde kullanılabilir. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Bul ve Değiştir </h2> <p> Metninizdeki bir hatanın birden çok örneğini değiştirmeniz gerekirse, Google Dokümanlar Bul ve Değiştir özelliğiyle bunu yapmayı kolaylaştırır. </p> <p> Microsoft Word&#39;deki Bul ve Değiştir özelliğine aşina olan kullanıcılar için bu aynı şekilde çalışır. </p> <p> Dokümanınızda belirli bir kelimeyi veya kelime öbeğini bulmak için kısayolu kullanın <strong> Ctrl + F </strong> Windows PC&#39;de veya <strong> Komut + F </strong> bir Mac&#39;te. &quot;Belgede bul&quot; alanına kelimeyi girin. </p> <p> Bulunan metni değiştirmek için sağ taraftaki üç noktayı tıklayın ve <strong> Bul ve Değiştir </strong> . </p> <p> Ardından, metni girin <strong> Bul </strong> alanı ve yerine geçen metin <strong> Şununla değiştir </strong> alan. Yukarı ve aşağı imleçle metin örnekleri arasında gezinin ve <strong> Değiştir </strong> onları ayrı ayrı değiştirmek için. Veya tıklayın <strong> Hepsini değiştir </strong> seçilen tüm metni bir kerede değiştirmek için. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Bir Sözlük Kullanın </h2> <p> Bir kelimenin anlamını ararken konsantre olmanıza ve sekmeler arasında geçiş yapmak zorunda kalmamanıza yardımcı olmak için Google Dokümanlar&#39;da bir uygulama içi sözlük bulunur. </p> <p> Yazarken ve bir kelimeye bakmanız gerektiğinde, kelimeyi vurgulayın, ardından sağ tıklayın ve seçin <strong> Tanımlamak </strong> menüden. Sözlük aracı, internette kelimenin tanımını arayacak ve ekranınızın sağ tarafında görünecektir. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Dil Aksanları Ekleyin </h2> <p> Aksanlı klavye kısayollarını ezberlemeye veya diğer belgelerden aksanlı harfleri kopyalayıp yapıştırmaya elveda deyin. </p> <p> Aksanlı harfleri kullanmak için indirmeniz gerekir <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> &quot;Kolay Vurgular&quot; eklentisi </a> . Belgenizdeki bir kenar çubuğundan doğrudan 20 farklı dil için aksan eklemenize olanak tanır. </p> <p> Açarak Google Doküman eklentisini indirin. <strong> Araçlar </strong> menüsüne tıklayın, ardından <strong> Eklentiler </strong> ve <strong> Eklentiler alın </strong> . Açılan Google Marketplace kutusunda şunu arayın: <strong> Kolay Vurgular </strong> ve Google Dokümanlar eklenti koleksiyonunuza eklemek için mavi yükle düğmesini tıklayın. </p> <p> Kurulumdan sonra, üzerine tıklayın <strong> Eklentiler </strong> Menüden Kolay Aksanlar eklentisini seçin ve tüm yabancı kelimelerinize doğru aksanları eklemeye başlayın. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Bu eklenti yalnızca masaüstünde kullanılabilir, ancak mobil klavyeler genellikle dil aksanlarını destekler, böylece eklenti olmadan telefonunuzda aksan işaretli metinler yazabilirsiniz. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Özel Kısayollar Oluşturun </h2> <p> Çoğu kişi aşinadır <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Word kısayolları </a> , ancak Google Dokümanlar&#39;da kendi kısayollarınızı da oluşturabilirsiniz. Özelleştirilmiş kısayollar oluşturmak için tıklayın <strong> Araçlar &gt; Tercihler &gt; Değiştirme. </strong> Halihazırda birkaç kesir ve sembol kısayolu olduğunu göreceksiniz (3/4&#39;ü ¾ olarak değiştirmek gibi), ancak kendinizden bazılarını eklemekten çekinmeyin. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Bu özellik yalnızca masaüstünde kullanılabilir. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Google Dokümanlar ile Daha Fazlasını Yapın </h2> <p> Artık bu Google Dokümanlar araçlarını öğrendiğinize göre, bir sonraki dokümanınızı oluştururken bunları kullanmaya başlayabilirsiniz. Umarım, sizin için işleri kolaylaştırırlar! </p>"}