{"title":"Google, Sinesteziyi Simüle Eden Deneysel Yapay Zekayı Yayınladı","content":"<p> Wassily Kandinsky, Münih Güzel Sanatlar Akademisi&#39;nde resim okumak için hukuk kariyerini bıraktı. Resimde saf soyutlamanın kurucularından biri olarak kabul edilir ve bu, renkleri ve şekilleri algılayışındaki merak uyandırıcı yoldan kaynaklanıyor olabilir. </p> <p> Bu AI aracı, Kandinsky&#39;nin kulaklarını ödünç almanızı sağlar. Artık resim yaparken ne yaptığını (veya en azından Google&#39;ın tarif ettiği şeyi yorumladığını) duyabilirsiniz. </p> <h2 id=\"what-if-you-could-hear-color\"> Ya Renkleri Duyabilseydiniz? </h2> <p> Google Arts &amp; Culture, Paris&#39;teki Centre Pompidou ile ortaklaşa olarak şu adı taşıyan deneysel bir proje başlattı: <a href=\"https://artsandculture.google.com/experiment/sgF5ivv105ukhA\" target=\"_blank\" rel=\"nofollow noopener\"> Kandinsky oyna </a> . </p> <p> Adından da anlaşılacağı gibi, etkileşimli araç, Wassily Kandinsky&#39;nin soyut resimlerini müzik biçiminde deneyimlemenize olanak tanır. Kandinsky, sinestezi adı verilen nörolojik bir durumu olan bir Rus ressamdı. </p> <p> <img alt=\"A screenshot of the second part of Play a Kandinsky\" src=\"images/play-kandinsky-screenshot-2-986.png\" loading=\"lazy\"> </p> <p> Antoine Bertin ve NSDOS tarafından bestelenen müzik, Kandinsky&#39;nin zamanındaki müzikten ilham aldı ve Google&#39;ın Transformer&#39;ında oluşturuldu. <a href=\"https://www.makeuseof.com/tag/what-are-neural-networks/\" target=\"_blank\" rel=\"nofollow noopener\"> sinir ağı </a> . </p> <p> tıklandığında <strong> Denemeyi başlat </strong> , müzik çalar ve AI, ekranın ortasındaki bir daireyi birkaç kez tıklamanızı ister. Her yaptığınızda, hem dairenin hem de arkasındaki arka planın renkleri ve müziği değişecektir. </p> <p> Sinestezi, algınızı etkileyen bir durumdur; bir duyuyu uyarmak, diğerinde otomatik, istemsiz bir deneyimi tetikler. Örneğin, bir sinestezi (sinestezi olan bir kişi) &quot;4&quot; sayısını düşünebilir ve &quot;arkadaş&quot; kelimesini duyduğunda kırmızı görebilir veya elmaları tadabilir. </p> <p> Kandinsky için sinestezi olması, müziği duyduğunda renkleri gördüğü ve resim yaparken müziği duyduğu anlamına geliyordu. &quot;Renklerin sesi o kadar kesin ki, parlak sarıyı bas notalarla veya koyu gölü tizlerle ifade edecek birini bulmak zor olurdu&quot; dedi bir keresinde. </p> <p> <img alt=\"Yellow-Red-Blue (1925), by Wassily Kandinsky\" src=\"images/yellow-red-blue-kandinsky-947.png\" loading=\"lazy\"> </p> <p> 1925&#39;te Sarı-Kırmızı-Mavi (yukarıdaki resimde) adını verdiği bir şaheser yarattı. Onu zamanının etkili sanat akımlarından, yani konstrüktivizm ve süprematizmden ayıran yağlı boya tabloydu. </p> <p> Play a Kandinsky&#39;nin üçüncü bölümü, tabloyu yedi bölümlük klasik bir senfonide duymanıza olanak tanır. Birbirine güçlü bir tezat oluşturan mavi ve sarıyı cömert kullanımları, <a href=\"https://www.makeuseof.com/how-to-use-color-theory-elevate-your-creative-projects/\" target=\"_blank\" rel=\"nofollow noopener\"> renk teorisi </a> Alman şair Johann Wolfgang von Goethe. </p> <p> Google, tıpkı bir enstrümanın tuşlarını ve tellerini bir müzisyene atfettiğiniz gibi, renkleri ve formları Kandinsky&#39;ye atfeder. &quot;Olağanüstü yetenekli bir sanatçı, renk seslerini renk senfonilerine dönüştürdü&quot; <a href=\"https://artsandculture.google.com/story/the-sound-of-colours/0ALymHuhPl1jLg\" target=\"_blank\" rel=\"nofollow noopener\"> hikaye </a> okur. </p> <p> </p> <h2 id=\"there-s-more-to-art-than-meets-the-eye\"> Sanatta Görünenden Daha Fazlası Var </h2> <p> Çalışırken Kandinsky&#39;nin tam olarak ne duyduğunu asla bilemeyeceğiz, ancak yaratıcılığı ve iç gözlemi gerçekten ateşleyen bunun gibi projeler. </p> <p> Belki de sanat ve müzik arasında çoğumuzun tam olarak anlayamadığı bir tür bağlantı vardır. Google&#39;ın deneyi, bu olasılığı araştırmak için iyi bir iş çıkarıyor. </p> <p> <small> İmaj Kredisi: Wassily Kandinsky/ <a href=\"https://commons.wikimedia.org/wiki/File:Kandinsky_-_Gelb-Rot-Blau,_1925.jpg\" rel=\"nofollow noopener\" target=\"_blank\"> Wikimedia Commons </a></small> </p>"}