{"title":"Google, iOS için Chrome&#39;a ​​Face ID Desteği Ekliyor","content":"<p> Google, özel tarama sekmelerinizi korumak için iPhone&#39;un biyometrik kimlik doğrulamasını kullanan iOS için Chrome 89&#39;da yeni bir güvenlik özelliğini test ediyor. Şu anda Chrome&#39;un beta kanalındaki kişilerle sınırlıdır, bu, Gizli sekmelerinizi Face ID veya Touch ID ile kilitlemenize olanak tanır. </p> <h2 id=\"even-more-private-private-browsing\"> Daha da Özel Özel Tarama </h2> <p> Face veya Touch ID ile korunan tüm Gizli sekmeler, sekme değiştiricide bulanıklaşır. Kilitli sekmeler, ‌iPhone authentication&#39;un biyometrik kimlik doğrulamasıyla onaylandıktan sonra tekrar görünür hale gelir. </p> <p> Bu yararlı özellik yalnızca gizliliğinizi artırmakla kalmaz, aynı zamanda iPhone veya iPad&#39;inizdeki uygulamalar arasında çoklu görev yaparken güvenliğinizi de güçlendirir. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> sunucu tarafı bileşeni nedeniyle tüm beta kullanıcılarının yeni kilitleme seçeneğine erişemeyeceğini not eder. </p> <p> </p> <h2 id=\"how-s-this-useful\"> Bu Nasıl Faydalıdır? </h2> <p> Ayrıca, bir arkadaşınızın internette hızlı bir şekilde arama yapmak için iPhone&#39;unuzu ödünç almak isteyebileceği zamanlar için de yararlıdır. Chrome&#39;un gizli tarama modu için Face ID korumasıyla, sekmeler arasında geçiş yaparken açık Gizli web sitelerinizi göremezler. </p> <p> </p> <p> &quot;Gizli&quot;, Chrome&#39;un özel tarama modu için bir pazarlama adıdır. Gizli moddayken, Chrome&#39;un oturumla ilgili herhangi bir bilgiyi kaydetmeden web&#39;e göz atabilirsiniz. Gizli bir pencereyi kapattığınızda, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> o oturumdaki tüm bilgiler kaybolur </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> Chrome&#39;da Yüz veya Dokunma Kimliği Nasıl Etkinleştirilir </h2> <p> Yaklaşan bu yeni özellik, Chrome&#39;un uygulama içi ayarlarının Gizlilik bölümünde manuel olarak açılmalıdır. Diğer Google uygulamalarında da benzer bir gizlilik kilidi mevcuttur. </p> <p> Örneğin, yerel Arama uygulamasında, iPhone&#39;un biyometrik kimlik doğrulaması, 15 dakika sonra Gizli oturuma döndüğünüzde kimliğinizi doğrular. Uygulamadan çıktığınızda dosyalarınızı korumak için Google Drive&#39;da isteğe bağlı bir Face veya Touch ID kimlik doğrulaması da mevcuttur. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> Özellik Resmi Olarak Ne Zaman Yayınlanacak? </h2> <p> Yeni kilitleme seçeneğinin herkes için ne zaman kullanıma sunulacağı konusunda henüz bir bilgi yok, ancak Chrome 89&#39;un önümüzdeki ay genel kullanıma sunulması bekleniyor. Google, resmi sürüm notlarında listelenmesine rağmen özelliği hiç yayınlamamaya da karar verebilir. </p>"}