{"title":"HBO Max Haziran&#39;da Latin Amerika&#39;da Çıkacak","content":"<p> WarnerMedia&#39;nın yayın hizmeti olan HBO Max, Haziran 2021&#39;de Latin Amerika ve Karayipler&#39;de başlıyor. Hizmet ilk kez ABD dışında sunulacak. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> HBO Max Latin Amerika&#39;da Nerede Lansman Yapıyor? </h2> <p> Şu anda HBO Max yalnızca ABD&#39;de mevcuttur. Haziran 2021&#39;in sonlarında, Latin Amerika ve Karayipler&#39;deki birçok ülkede satışa sunulacak. Haber bir yerde duyuruldu. <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> WarnerMedia basın açıklaması </a> . </p> <p> Bu ülkeler özellikle şunlardır: Anguilla, Antigua, Arjantin, Aruba, Britanya Virjin Adaları, Bahamalar, Barbados, Belize, Bolivya, Brezilya, Cayman Adaları, Şili, Kolombiya, Kosta Rika, Curacao, Dominika, Dominik Cumhuriyeti, Ekvador, El Salvador , Grenada, Guatemala, Guyana, Haiti, Honduras, Jamaika, Meksika, Montserrat, Nikaragua, Panama, Paraguay, Peru, St. Kitts ve Nevis, St. Lucia, St. Vincent, Surinam, Trinidad ve Tobago, Turks ve Caicos, Uruguay , ve Venezuela. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> HBO Max Latin Amerika&#39;da Neler Sunacak? </h2> <p> </p> <p> Doğrudan veya &quot;uygun ortaklar&quot; aracılığıyla ödeme yapan mevcut HBO GO aboneleri, HBO Max&#39;e anında erişim elde edecek. HBO GO daha sonra bölgeler arasında aşamalı olarak kaldırılacak. </p> <p> Fiyatlandırma detayları açıklanmadı, ancak yeni içerik ve promosyon teklifleri hakkında bilgilerle birlikte önümüzdeki aylarda söz verildi. </p> <p> ABD&#39;de olduğu gibi HBO Max, çeşitli abonelik paketleri sunacak ve akıllı telefonlar, tabletler ve diğer akıllı platformlar gibi cihazları destekleyecek. </p> <p> </p> <p> Haberi duyuran bir fragmanda, Game of Thrones ve Friends gibi dizilerin yanı sıra The Matrix ve Casablanca gibi filmlerden de klipler izlenebiliyor. Ancak, sonunda &quot;lansman sırasında tüm başlıklar mevcut olmayacak&quot; uyarısında bulunan küçük bir mesaj görünür. </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> HBO Max Küresel Olarak Ne Zaman Kullanılabilir? </h2> <p> Geçen yıl, Warner Bros. tartışmalı bir şekilde 2021 tiyatro listesinin tamamını HBO Max&#39;e sunmayı planladığını duyurdu. yönetmen neden oldu <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Christopher Nolan, HBO Max&#39;i &quot;en kötü yayın hizmeti&quot; olarak adlandıracak </a> . </p> <p> Bununla birlikte, film endüstrisinden bazıları inliyor olsa da, bu tüketiciler için harika bir seçim yanlısı hareket. </p> <p> Bu nedenle, Latin Amerika ve Karayipler&#39;dekiler, anlaşmanın kendileri için de geçerli olması umuduyla HBO Max&#39;in lansmanı için heyecanlı olacaklar. </p> <p> Dünyanın geri kalanına gelince? Kesin tarihler belirlenmedi, ancak WarnerMedia, Nordikler, İspanya, Orta Avrupa ve Portekiz&#39;in bu yıl içinde HBO Max&#39;e yükseltilmesinin planlandığını açıkladı. </p> <p> HBO Max International&#39;ın başkanı Johannes Larcher şunları söyledi: </p> <blockquote> <p> WarnerMedia&#39;nın Doğrudan Tüketiciye hizmetini ABD dışındaki ve tüm dünyadaki tüketicilere sunmanın ilk adımı olan HBO Max&#39;in Latin Amerika ve Karayipler&#39;de piyasaya sürülmesinden dolayı heyecan duyuyoruz. </p> </blockquote>"}