{"title":"Isırık Boyutunda Beyin Besinleri: Kısa ve Eğlenceli Yollarla Yeni Şeyler Öğrenmek için 5 Site","content":"<p> Bir dakikadan az süren belgeseller. Sadece 60 saniyelik podcast bölümleri. Karmaşık konuları açıklamak için animasyonlu infografikler. İlgi çekici bilginin hızlı kapsüllerinde dünya hakkında daha fazla bilgi edinebileceğiniz yer burasıdır. </p> <p> Kısa dikkat süreleri ve 280 karakter güncellemesi çağında, öğrenmenin bile küçük dozlarda olması gerekiyor. Bu yüzden yoğun hayatımızda neredeyse hiç zaman almayan bilgilendirici ve eğlenceli parçalar yapmak konusunda uzmanlaşmış içerik oluşturucular var. Büyüleyici insanların ve konuların mini belgesellerinden, trend olan konularda sosyal medya rehberlerine kadar, zihninize çiğnemek için bir lokma büyüklüğünde beyin gıdası verin. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 60 Saniyelik Dokümanlar </a> (Web): 60 Saniyede İlginç Kişilerin ve Konuların Profilleri </h2> <p> </p> <p> Bir dakikan var mı? 60 Second Docs&#39;un size ilginç bir insan ve buna karşılık harika bir konu hakkında anlatacak harika bir hikayesi var. Her belgesel yalnızca 60 saniye uzunluğundadır, ancak konuyla ilgili bilmeniz gereken en iyi şeyleri kapsar. </p> <p> En havalı kısım ise 60 Second Docs&#39;un kavramlar veya trendler yerine gerçek insanların profillerine odaklanması. Genellikle, bu kişi ister yeni bir trend başlatıyor, ister yeni bir konu keşfediyor veya bir şekilde sınırları zorluyor olsun, benzersiz bir şey yapıyor. Bunu kişi hakkında yaparak, benzersiz konunun insani yönü hakkında daha fazla içgörü elde etmekle kalmaz, aynı zamanda daha gerçek ve duygusal hissettirir. </p> <p> 60 Second Docs&#39;ın tamamı YouTube kanallarında veya sosyal medya hesaplarında mevcuttur. Onları sık kullandığınız herhangi bir sosyal ağda takip etmek ve her yeni videoyu bir güncelleme yayınladıklarında tamamını izlemek iyi bir fikirdir. </p> <p> Daha uzun belgeselleri seviyorsanız, <strong> Resmi Seçim </strong> 60 Second Docs web sitesindeki sayfa. Burada editörler, izlemeniz gerektiğini düşündükleri konularda başkalarının çektiği 10-20 dakikalık belgeselleri seçiyor. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Demek Hakkında Konuşmak İstiyorsun </a> (Instagram): Siyasi ve Sosyal Konulara Yönelik Mini Kılavuzlar </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> Etkileyici özçekimler ve marka destekli hashtag&#39;lerin olduğu bir dünyada Instagram&#39;ın eğitmek için bir platform sağlayacağını kim bilebilirdi? So You Want To Talk About (Sywtta), politik ve sosyal konular hakkında mini kılavuzlar oluşturmak için Instagram&#39;ın çoklu görüntü gönderi formatlarını kullanır. </p> <p> Sywtta&#39;nın seçtiği konular genellikle öğrenci kredisinin iptali, siyahi haklar ve tarih, mantık hataları, COVID-19 aşıları ve çok daha fazlası gibi trend olan konularla ilgilenir. Her slayt, sizi konuyla ilgili eğitmek için güzel bir şekilde biçimlendirilmiş tipografi kullanır ve dahası, her slayt kendi içinde bir mini ders gibidir. Her kılavuz, verilerle çok fazla yüklenmeden hızlı ve bilgilendirici bir hızlandırılmış kurs haline gelir. </p> <p> konusunda uyanık olmanız gereken bir zamanda <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> taraflı veya yalan haber </a> , okuduklarınızın felsefelerini not etmek de önemlidir. Siyaset söz konusu olduğunda, Sywtta ilerici ve solcu politikaların görüşlerini yayar. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> 60 Saniye Bilimi </a> (Podcast): Bilim, Sağlık ve Teknolojinin Kısa Sesli Açıklamaları </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Bilgilerinizi okumak veya izlemek yerine dinlemeyi tercih ediyorsanız, 60-Second Science podcast&#39;ine göz atın. Scientific American&#39;daki ekip tarafından hazırlanan bu günlük podcast, bilim, tıp ve teknolojideki konulara değiniyor ve bir konuyu kısa bir sürede açıklıyor. Artık kendisini bir dakikalık zaman sınırıyla sınırlamamakla birlikte, her bölüm hala beş dakikanın altında. </p> <p> Her podcast&#39;in Scientific American ekibinden farklı sunucuları vardır ve bunlar COVID, hayvanlar ve kuşlar, DNA ve tıp, çevre bilimi vb. konuları kapsar. Tartışma noktası hakkında gerçek dünya seslerini birleştirerek ve genellikle ses klipleri ekleyerek yüksek üretim değerlerinden yararlanırlar uzmanlardan. </p> <p> Geçmiş bölümlerin arşivlerine göz atmak için 60-Second Science resmi web sitesine gidin. Burada bölümleri konuya göre filtreleyebilirsiniz (sağlık, zihin, sürdürülebilirlik, teknoloji, bilimler). Kısa aralıklarla bilgi istemiyorsanız, tam uzunlukta Science Talk podcast&#39;ini deneyin. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Animasyonlar </a> (Web): Şeyleri Açıklamak için Yüksek Kaliteli Animasyonlu İnfografikler </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> Kripto para birimi nasıl çalışır? Trafik sigortasının artıları ve eksileri nelerdir? Ay yürüyüşü nasıl yapılır? Tasarımcı ve animatör Jacob O&#39;Neal, karmaşık konuları basit açıklamalara bölüyor ve bunları göstermek için yüksek kaliteli animasyonlu infografikler çiziyor. </p> <p> Animagraffs, animasyonlu GIF&#39;ler kullanan görsel kılavuzlar aracılığıyla yapılan kısa açıklamaların bir koleksiyonudur. Jacob, bir enstrümanın her parçasını göstermek için kesit görünümler veya Google Haritalar gibi yakınlaştırıp uzaklaştırabileceğiniz hareketli parçalara sahip büyük görüntüler gibi çeşitli tasarım teknikleri kullanır. Her stil, öğrendiğiniz konuya uygundur. </p> <p> Konular, bir çitanın nasıl çalıştığı, elektrikli arabaların nasıl çalıştığı, bir hoparlörün nasıl ses çıkardığı vb. gibi geniş bir yelpazeye sahiptir. Jacob&#39;ın markalar için ücretli ödevleri gösterdiği &quot;Müşteri Çalışması&quot; bölümüne de göz atmalısınız. Endişelenmeyin, reklam olmalarına rağmen bilgilendirici ve eğlencelidirler. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Büyük Büyük Hikaye </a> (YouTube): Büyüleyici ve İlginç Gerçek Kısa Belgeseller </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story, 2020&#39;nin sonunda operasyonlarını tamamladı, ancak beş yıllık keyifli kısa belgesellerden ayrılmadan önce değil. Bir dizi ilginç konu ve dünyanın dört bir yanından büyüleyici insanlarla ilgili yaklaşık 5 dakikalık videolar bulmak için arşivlere dalın. </p> <p> Hint sinemasında 24 yıldır oynayan bir filmden erimeyen muhteşem Türk dondurmasına kadar her kısa video, konuya yüksek kaliteli ve iyi araştırılmış bir bakış. Bu tür diğer videoların çoğundan farklı olarak, Great Big Story&#39;nin video yaratıcıları kendilerini hikayenin ortasına koymak için sık sık dünyayı dolaşırlar. En popülerlere göre sıralayın veya içerik oluşturucular tarafından önerilen çeşitli özel çalma listelerini kullanın. </p> <p> Kanalda ayrıca yaklaşık 10 ila 15 dakika uzunluğunda daha uzun videolar da bulacaksınız. Bunlar genellikle daha kısa videolardan birkaç klip içeren listeler ve derlemelerdir. Çevremizdeki dünya hakkında daha fazla bilgi edinmek için zamanınız varsa, bunlarla yanlış gidemezsiniz. Great Big Story, kepenklerini indirdikten sonra bile en çok <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> YouTube&#39;da büyüleyici ve eğitici kanallar </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Büyük Konuları Fethetmek için Damla Öğrenmeyi Kullanın </h2> <p> Bu web siteleri ve podcast&#39;ler, her yeni konuyu kompakt ve eğlenceli bir bilgi paketine dönüştürmeye odaklanır. Küçük lokmalarda yeni şeyler öğrenmenin güzel bir yolu. Ancak aynı felsefeyi daha karmaşık ve daha büyük konular hakkında bilgi edinmek için de uygulayabilirsiniz. </p> <p> Damla öğrenme veya mikro öğrenme giderek artan bir şekilde eğitim almanın popüler bir yoludur. alarak <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> her gün lokma büyüklüğünde dersler </a> , programlama, tasarım, uygulama geliştirme, ürün yönetimi ve daha fazlası gibi konuları ele alabilirsiniz. Hızlı bir web araması, kendinizi eğitmek istediğiniz her şeyin damla öğrenme sürümünü bulmanıza yardımcı olacaktır. </p>"}