{"title":"iPhone 13, &quot;Her Zaman Açık&quot; Ekrana Sahip Olabilir","content":"<p> Apple, 2019&#39;da Apple Watch Series 5 için &quot;her zaman açık&quot; ekranını tanıttı. Bilgileri YouTube kanalıyla paylaşan muhabir Max Weinbach&#39;a göre, birkaç yıl sonra iPhone&#39;a da gelebilir. <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> Her şeyApplePro </a> . </p> <p> Rapor, iPhone 13&#39;ün—eğer Apple gerçekten de buna karar verirse——belirli ayrıntıları göstermek için ekranın bazı bölümlerini kalıcı olarak aydınlatacağını iddia ediyor. </p> <h2 id=\"how-always-on-display-will-work\"> &quot;Her Zaman Açık&quot; Ekran Nasıl Çalışır? </h2> <p> Bu ayrıntılar hem saati hem de pil simgelerini içerebilir. İPhone kilitliyken bile görünür kalırlar, yani kullanıcı tarafından aktif olarak kullanılmaz. Yeni mesaj bildirimleri gibi bildirimler yalnızca geçici olarak aydınlatılacaktır. </p> <p> Bu, iPhone&#39;un &quot;her zaman açık&quot; ekran teknolojisiyle birlikte geldiği ilk sefer olacak. Bununla birlikte, benzer teknolojinin bir akıllı telefona ilk kez girmesi kesinlikle olmayacak. Nokia, 2009 yılında &quot;her zaman açık&quot; ekran özelliğini kullanıma sundu. Daha yakın zamanlarda, Huawei, Motorola, Samsung, Google ve diğerleri tarafından üretilen modeller de dahil olmak üzere çeşitli Android telefonlarda yaygın olarak bulunan bir özellik haline geldi. </p> <p> &quot;Her zaman açık&quot;ın büyük, bariz avantajı, saati kontrol etmek kadar küçük bir şey olsa bile, bilgiye erişmek için kullanıcının telefonunu uyandırmasını veya kilidini açmasını gerektirmemesidir. </p> <p> Dezavantajı, akıllı telefonlarda zaten bir prim olabilecek ekstra pil ömrü tüketmesidir. Ancak AMOLED ekranlar, yalnızca ekranda bilgileri göstermek için gerekli olan pikselleri etkinleştirerek bu pil etkisini azaltabilir. </p> <p> Başka bir deyişle, bu &quot;her zaman açık&quot; ekran, teknik anlamda her zaman açıktır --- ekranın çoğu kapalı olmasına ve tüm zaman boyunca yalnızca birkaç kısmı aydınlatılmış olmasına rağmen. Bu, pil ömrü üzerindeki etkinin olabileceği kadar büyük olmadığı anlamına gelir. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> iPhone 13&#39;ten Ne Beklemeli? </h2> <p> Yeni nesil iPhone büyük olasılıkla Eylül 2021&#39;de gelecek. Weinbach&#39;a göre, iPhone 12 serisiyle aynı genel kasa tasarımına sahip olacak, ancak bazı kaput altı yükseltmeler olacak. </p> <p> Bunlar arasında daha güçlü MagSafe mıknatıslar, ay ve yıldızların görüntülerini çekmek için geliştirilmiş bir kamera sistemi, tüm iPhone serisinde ultra geniş kamera lensi, portre modu videosu (sadece durağan görüntüler yerine), rafine mat arka kısım ve geliştirilmiş A- yer alacak. seri çip. Önceki bir rapor, Apple&#39;ın <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> ekran içi Touch ID&#39;yi tanıtın </a> Face ID&#39;ye alternatif olarak. </p> <p> Buna hala yarım yıldan fazla bir süre olduğu göz önüne alındığında, Apple üçüncü çeyrekte bir sonraki iPhone&#39;unu göstermeden önce birçok yeni ayrıntı ortaya çıkabilir. Bununla birlikte, söylenti değirmeni şimdiden harekete geçmeye başlıyor gibi görünüyor. Bu alanı izle! </p>"}