{"title":"JPG ve JPEG: Bu Görüntü Dosyası Formatları Arasındaki Fark Nedir?","content":"<p> Tüm görüntü dosyası biçimleri eşit yapılmaz. Aslında, birçoğu zaten var olan bir formatın çözemediği bir sorunu çözmek için oluşturuldu. Örneğin JPEG, görüntü dosyası boyutlarının çok fazla depolama alanı tüketmesi nedeniyle ortaya çıktı. </p> <p> İster inanın ister inanmayın, JIF, JPEG ve JPG dosya uzantıları aşağı yukarı aynı şeyi ifade eder. Dosya formatının neden bu kadar çok isme sahip olduğunu anlamak için biraz dolambaçlı geçmişi çözmemiz gerekiyor. </p> <h2 id=\"what-is-a-jpeg\"> JPEG Nedir? </h2> <p> JPEG kısaltması, Joint Photographic Experts Group&#39;un kısaltmasıdır; dosya türü, JPEG Değişim Biçimi (JIF) standardının oluşturulmasına yardımcı olan alt komitenin adını almıştır. İlk olarak 1992&#39;de Uluslararası Standardizasyon Örgütü (ISO) tarafından yayınlandı. </p> <p> JPEG&#39;ler, RGB renk modelinin her kanalında sekiz bit bulunan 24 bitlik sabit raster görüntülerdir. Bu, alfa kanalına yer bırakmaz, yani JPEG&#39;ler 16 milyondan fazla rengi destekleyebilirken şeffaflığı destekleyemezler. </p> <p> Bir görüntü JPEG olarak kaydedildiğinde, verilerin bir kısmı kayıplı olarak adlandırılan bir süreçte atılır. <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Dosya Sıkıştırması </a> . Buna karşılık, görüntü, görüntü kalitesinde çok az veya hiç algılanabilir kayıp olmadan (BMP gibi eski biçimlere kıyasla) yüzde 50-75 daha az depolama alanı kaplar. </p> <p> JPEG sıkıştırması, ilk olarak 1972&#39;de elektrik mühendisi Nasir Ahmed tarafından önerilen ayrık kosinüs dönüşümü (DCT) adı verilen kayıplı bir görüntü sıkıştırma tekniğine dayanmaktadır. </p> <h3 id=\"what-is-a-jif\"> JIF Nedir? </h3> <p> Bir JIF dosyasını &quot;en saf&quot; biçiminde bir JPEG olarak düşünebilirsiniz. Ancak, bazı sinir bozucu sınırlamalar sunduğu için format artık pek kullanılmamaktadır. Örneğin, bir JIF&#39;nin renk ve piksel boyut tanımları, kodlayıcılar ve kod çözücüler (görüntüleyiciler) arasında uyumluluk sorunlarına neden oldu. </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> Neyse ki, bu sorunlar daha sonra JIF&#39;i temel alan diğer &quot;tamamlayıcı&quot; standartlar tarafından ele alındı. Bunlardan ilki JPEG Dosya Değişim Formatı (JFIF) idi ve daha sonra, <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Değiştirilebilir görüntü dosyası formatı </a> (Exif) ve ICC renk profilleri. </p> <p> JPEG/JFIF, fotoğraf görüntülerini internette depolamak ve iletmek için şu anda en popüler biçimdir; JPEG/Exif ise dijital kameralar ve diğer görüntü yakalama cihazları içindir. Çoğu insan bu varyasyonlar arasındaki farkı ayırt etmez ve her ikisine de sadece JPEG olarak atıfta bulunur. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> JPG2 veya JPF Nedir? </h3> <p> 2000 yılında, JPEG grubu, JPEG 2000 adlı başka bir resim dosyası biçimi yayınladı (dosya uzantıları JPG2 ve JPF&#39;dir). JPEG&#39;in halefi olması gerekiyordu, ancak hiçbir yerde popüler değildi. Gelişmiş kodlama yöntemi genellikle daha kaliteli görüntülere yol açsa bile. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Resim Kredisi: Dake / <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> JPEG 2000 dosya formatı birkaç nedenden dolayı başarısız oldu. Birincisi, tamamen yeni bir koda dayanıyordu ve bu nedenle JPEG ile geriye dönük uyumlu değildi. Bunun da ötesinde, JPEG 2000 dosyalarının işlenmesi için daha fazla bellek gerekiyordu, bu o zamanlar biraz sorunluydu. Sonuçta, o sırada ortalama bir bilgisayar yalnızca 64 MB belleğe sahipti. </p> <p> JPEG 2000, bilgisayar donanımının genel olarak son 20 yılda büyük ölçüde geliştiği, ancak dosya biçiminin hala çok az kullanıldığı için biraz canlandı. Yazma sırasında JPEG 2000 dosyalarını destekleyen tek internet tarayıcısı Safari&#39;dir. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG ve JPG </h3> <p> Windows&#39;un ilk sürümleri (özellikle MS-DOS 8.3 ve FAT-16 dosya sistemleri), dosya uzantılarının uzunluğu söz konusu olduğunda maksimum 3 harfli bir sınıra sahipti. JPEG, sınırı aşmayacak şekilde JPG olarak kısaltılmalıdır. Mac ve Linux bilgisayarlarda hiçbir zaman böyle bir şey olmadı ve bu nedenle kullanıcılar görüntüleri JPEG olarak kaydetmeye devam edecekti. </p> <p> </p> <p> Photoshop ve Photoshop gibi farklı işletim sistemlerinde çalışan popüler görüntü düzenleme programları <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> gimp </a> — kafa karışıklığını en aza indirmek için en sonunda varsayılan JPEG dosya uzantısını JPG olarak ayarlar. </p> <p> Böylece aynı format için iki dosya uzantısı elde ettik: JPEG ve JPG. Resminizi ne olarak kaydedeceğinizi seçerken aralarında hiçbir fark yoktur. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG ve PNG: Hangisi Daha İyi? </h2> <p> </p> <p> JPEG ve PNG, aynı on yıl içinde piyasaya sürüldü ve her dosya formatı, teknoloji dünyasının o zamanlar karşılaştığı farklı bir dijital görüntü sorununu çözdü. Sürekli karşılaştırılmalarının çok doğal olduğunu söyleyebilirsiniz... ve bugün bile öyleler. JPEG ve PNG arasında hangi görüntü dosyası formatı üstündür? </p> <p> Dürüst olmak gerekirse, yanıt ne tür bir resim kaydettiğinize bağlıdır. </p> <p> JPEG&#39;ler, makul dosya boyutlarını korumak için kayıplı sıkıştırma kullandıklarından fotoğraflar için daha uygundur. Fotoğraflar o kadar büyük, ayrıntılı resimlerdir ki, sıkıştırma kusurları (sıkıştırmanın neden olduğu küçük resim bozulmaları) üzerlerinde pek fark edilmez. </p> <p> Öte yandan, keskin noktalara, keskin kenarlara ve tek renkli geniş alanlara (ör. vektör logoları, piksel resmi, vb.) sahip görüntüler, JPEG olarak kaydedildiğinde tam olarak doğru görünmez. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Resim Kredisi: Axel Grimard/ <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> İşte bu noktada Portable Network Graphics (PNG) dosyası devreye girebilir. PNG Development Group tarafından JPEG&#39;in yayınlanmasından dört yıl sonra geliştirilen PNG, kayıpsız veri sıkıştırma ve şeffaflığı destekler. PNG&#39;ler bu nedenle, görüntü kalitesinin korunması gerektiğinde ve dosya boyutunun bir sorun olmadığı durumlarda sıklıkla kullanılır. </p> <p> İyi bir kural, JPEG&#39;i fotoğraflarda tutmak ve PNG&#39;yi saydam ve fotoğrafsız görüntüler için kaydetmektir. Birçok farklı dosya türü (yalnızca resimler değil) hakkında daha fazla bilgi için kılavuzumuza göz atın. <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> hangi dosya biçimini ne zaman kullanacağını bilmek. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG ve JPG Aynı Dosya Formatıdır </h2> <p> JPEG&#39;in birçok güncellemesi ve varyasyonu ile neden olduğu kafa karışıklığına rağmen, 90&#39;ların ortalarında internetteki nihai dijital görüntü seli, şüphesiz öncelikle yayınlanmasından kaynaklandı. </p> <p> Bir dahaki sefere bir resim düzenleyiciden bir fotoğrafı dışa aktarmaya hazır olduğunuzda ve size mevcut formatların uzun bir listesi sunulursa, şunu unutmayın: JPEG ve JPG bir ve aynıdır. </p>"}