{"title":"Kişisel Verilerinizi İşverenlerden Nasıl Güvende Tutabilirsiniz?","content":"<p> Gözetim teknolojisi ofis içinde ve dışında çok yaygın. Birçok işveren, telefonlar, dizüstü bilgisayarlar ve tabletler gibi şirket tarafından verilen cihazlar için mobil yönetim ürünlerini kullanır. Bunlar, işletmeleri hırsızlıktan, kurumsal casusluktan veya kötü niyetli amaçlardan korumak için tasarlanmış programları içerir. </p> <p> Ancak, tüm bunlar şirketinizi korumak için harika olsa da sizin için tam olarak en iyi şey değildir. Artık bir soru değil <strong> Eğer </strong> şirketiniz sizi izliyor; Sormanız gereken bir sonraki soru, şirketlerin gerçekte ne kadar veri bulabileceğidir. Şaşırtıcı bir şekilde, çok. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> İşverenler Şirketin Wi-Fi ve Uzak Cihazlarında Ne Görebilir? </h2> <p> Çoğu kişi, şirketlerin verilerine ne ölçüde erişebildiğinin veya şirket cihazlarını kullanırken ne kadarını imzaladığının farkında değil. İşte bazı örnekler. </p> <h3 id=\"location\"> yer </h3> <p> Birçok çalışan, bir Sanal Özel Ağ (VPN) kullanmanın, işverenlerini olmaları gereken yerde olduklarına inandırmak için yeterli olduğunu düşünüyor. </p> <p> Kişisel bir cihazda gerçek konumunuzu gizlemenin yolları olsa da, özellikle şirket tarafından verilen bir e-posta adresi veya cep telefonu numarasıyla herhangi bir uygulama veya web sitesinde oturum açtığınızda tamamen güvenilir değildir. </p> <p> </p> <p> Şirket tarafından verilen cihazları kullanırken gerçek konumunuzu gizlemek imkansıza yakın olabilir. Örneğin, telekomünikasyon şirketleri, dolaşımdaki ortaklarından herhangi birine bağlandığınızı algılayabilir. </p> <p> Ayrıca kurumsal VPN&#39;ler, ağ geçitleri dahili BT ekipleri tarafından izlenen ticari VPN&#39;lerden farklıdır. </p> <h3 id=\"notes-documents-and-emails\"> Notlar, Belgeler ve E-postalar </h3> <p> Bir sonraki işinizi bulmak için şirket Wi-Fi&#39;sini kullandığınızı kimsenin bilmediğini düşünüyorsanız, yanılıyorsunuz. Bir şirket e-posta adresi kullanmıyor olsanız bile, çoğu işletmede gerçek zamanlı etkinlik günlükleri, tarama geçmişi güncellemeleri ve açık belgelerin ve e-postaların zamanlı ekran görüntülerini içeren şirket dizüstü bilgisayarlarına önceden yüklenmiş programlar bulunur. </p> <p> Muhtemel veri ihlallerine karşı koruma öncülüğünde, birçok şirket bunları raporlama mekanizmaları veya üretkenlik izleyicileri olarak da kullanır. </p> <p> </p> <h3 id=\"online-messaging-history\"> Çevrimiçi Mesajlaşma Geçmişi </h3> <p> Şifreli platformların yükselişine rağmen, gerçek şu ki, mesajlarınız kurumsal cihazlarda tamamen özel değil. Mesajlaşma platformlarını kullanırken, şirketler alışverişlerinizin tam ayrıntılarını göremeyebilir, ancak büyük olasılıkla yine de dosya boyutu ve türü gibi meta verileri tanıyabilir. </p> <p> Bununla, WhatsApp gibi bir uygulama aracılığıyla büyük boyutlu PDF&#39;ler göndermeye karar verirseniz, şirketinizin izinsiz giriş tespit sisteminiz muhtemelen sizi şüpheli davranışlar için işaretleyecektir. Kurumsal yönergelere uygun olarak, eylemlerinizin kötü niyetli olmadığını kanıtlamanızı isteyebilirler ve izin için liderlikten imza talep etmeleri gerekebilir. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> Kişisel Verilerinizi İşvereninizle Paylaşmaktan Nasıl Kaçınabilirsiniz? </h2> <p> Kişisel bilgilerinizi, konuşmalarınızı ve aktivitelerinizi her zaman tamamen erişilemeyecek durumda tutmanın kesin bir yolu yoktur. Ancak, riskleri azaltmanın birkaç yolu vardır. </p> <p> İşverenlerinizden veri saklamayı onaylamıyoruz; aslında, çalışanları hakkında bilgi toplama hakkına sahiptirler - hatta <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> sizi yasal olarak takip edebilecek </a> . Ancak her şeyi kendinize saklamanın ne zaman uygun olduğunu bilmeniz gerekir ve bu bireysel şirketlere bağlıdır. </p> <h3 id=\"read-company-policies\"> Şirket Politikalarını Okuyun </h3> <p> Veri şeffaflığı hakkında tartışmadan önce, işvereniniz için çalışarak bilerek verdiğiniz bilgi türünü de anlamalısınız. Sadece ne beklendiğini bildiğinizde uygun profesyonel sınırları belirleyebilirsiniz. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Şirket veri toplama politikalarını ve prosedürlerini toplanmadan önce anlamayı hedefleyin. Oradan, gerekenden daha fazla bilgi sağlamayı devre dışı bırakmak için etkili bir plan yapabilirsiniz. </p> <h3 id=\"use-personal-gadgets\"> Kişisel Gadget&#39;ları kullanın </h3> <p> Paradan tasarruf etmek için şirket cihazlarını kullanmak her zaman cazip gelse de, gerçek şu ki hiçbir şey gerçekten bedava değildir. Kişisel kullanım için dizüstü bilgisayarlara, cep telefonlarına ve tabletlere yatırım yapın. </p> <p> Ayrı kişisel cihazlara sahip olmak, özellikle uzaktan çalışırken sınırlar oluşturmanın harika bir yoludur. </p> <p> Kendi cihazınızı kullanmak, verilerinizi meraklı gözlerden korumak için gerekli çeşitli güvenlik uygulamalarını oluşturma ve yönetme olanağı sağlar. Gereksiz bir masraf gibi görünebilir, ancak iç huzurunuzu korumak için uzun bir yol kat eder. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Kişisel Cihazlarda Misafir Profillerini Kullanın </h3> <p> Size ait olmayan herhangi bir ağa bağlanmak, işyerinde olsa bile her zaman bir güvenlik riski taşır. Bir şirket Wi-Fi&#39;sinde oturum açmak, işvereninize mesajlarınızın meta verilerinden tarama geçmişi günlüklerine kadar her şeye erişme izni verir. </p> <p> Kişisel dizüstü bilgisayarınızı şirket ağlarında kesinlikle kullanmanız gerekiyorsa, uzaktan erişebilecekleri veri miktarını azaltmak için bir misafir profili kullanmayı tercih edebilirsiniz. Alternatif olarak, kişisel cep telefonunuzun veri planı veya taşınabilir Wi-Fi cihazı ile bağlanabilirsiniz. </p> <h3 id=\"keep-your-passwords-safe\"> Şifrelerinizi Güvende Tutun </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Güçlü parolalar oluşturma </a> yeterli değil. Şifrelerinizin şirket cihazlarına kaydedilmediğinden emin olmanız gerekir. Çevrimiçi bankacılık hesapları, kişisel e-postalar veya devlet web siteleri için kişisel şifreleri, sahibi olmadığınız gadget&#39;lara kaydetmek, şirket veritabanınızın güvenliği ihlal edilirse verilerinizi hemen riske sokar. </p> <p> Önemli hesaplara, özellikle de paranın söz konusu olduğu hesaplara erişmek için yalnızca kişisel cep telefonunuzu veya dizüstü bilgisayarınızı kullanın. Mümkün olduğunda, iki faktörlü kimlik doğrulamayı etkinleştirin. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> İş ve Özel Hayatınızı Ayırın </h2> <p> İşverenler, herhangi bir yasa dışı faaliyete katıldığınızdan, şirket bilgilerini riske attığınızdan veya kolluk kuvvetleri tarafından soruşturma talebinde bulunduğunuzdan şüphelenirlerse, şirket tarafından verilen cihazınıza uzaktan erişme hakkına sahiptir. </p> <p> Ancak bu, kişisel cihazlardan farklıdır. </p> <p> Güvenliğiniz, işvereniniz de dahil olmak üzere iletişim halinde olduğunuz kişiler kadar güçlüdür. Kişisel ve iş cihazlarınızı ayrı tutmak, verilerinizi merkezden uzaklaştırmaya yönelik yalnızca bir adımdır. Güçlü güvenlik önlemleri uygulayarak bilgisayar korsanlarının belgelere, e-postalara ve ağlara erişim noktası sayısını sınırlayabilirsiniz. </p> <p> Kişisel verilerin merkezi olmayan hale getirilmesi, bir birey olarak sizi ve şirketinizi hırsızlık, dolandırıcılık ve diğer siber suç türlerinden koruduğu için gereklidir. </p>"}