{"title":"Linux&#39;ta Dosyaları ve Dizinleri Kolayca Şifreleme ve Şifresini Çözme","content":"<p> Yeni yazılım paketleri kurmak ve öğrenmek zorunda kalmadan Linux&#39;ta dosyaları hızlı ve kolay bir şekilde şifrelemek istediniz mi? İşte dosyalarınızı veya dizinlerinizi bir parolayla korunan AES256 aracılığıyla kolayca şifrelemenin mükemmel ve kolay bir yolu, dosyalarınızı meraklı gözlerden uzak tutmanıza yardımcı olur. </p> <h2 id=\"the-basics-of-encryption-with-openssl\"> OpenSSL ile Şifrelemenin Temelleri </h2> <p> Şifrelemede bundan çok daha fazlası olduğunu unutmamak önemlidir. </p> <p> okumanız ihtiyatlı olabilir <a href=\"https://www.openssl.org/docs/\" target=\"_blank\" rel=\"nofollow noopener\"> OpenSSL belgeleri </a> Verilerinizle bu yönteme güvenmeden önce. Yine de, NSA veya Rus ordusundan kaçmaya çalışmadığınızı varsayarsak, bu yöntem dosyalarınızı ve dizinlerinizi güvenli ve başkaları tarafından erişilemez durumda tutmak için mükemmel şekilde çalışmalıdır. </p> <p> </p> <h2 id=\"install-openssl\"> OpenSSL&#39;yi yükleyin </h2> <p> Popüler OpenSSL paketinin kurulu olmasına ihtiyacınız var, bu nedenle önce paketin zaten kurulu olup olmadığını kontrol edin. <a href=\"https://www.makeuseof.com/basic-commands-linux/\" target=\"_blank\" rel=\"nofollow noopener\"> Linux komutu </a> : </p> <pre><code class=\"hljs\">openssl version</code></pre> <p> Geçerli sürüm numarasını yazdırırsa, bir sonraki bölüme hazırsınız demektir. Aksi takdirde, &quot;komut bulunamadı&quot; hatası alırsanız, apt-get aracılığıyla OpenSSL&#39;yi kolayca yükleyebilirsiniz: </p> <pre><code class=\"hljs perl\">sudo apt-get -y install openssl</code></pre> <p> </p> <h2 id=\"encrypt-and-decrypt-files\"> Dosyaları Şifreleyin ve Şifresini Çözün </h2> <p> Örneğin, data.tar.gz adlı bir dosyayı şifrelemek isterseniz, şu komutu çalıştırırsınız: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -a -salt -iter 5 -in data.tar.gz -out data.enc</code></pre> <p> Sizden iki kez bir şifreleme parolası girmeniz istenecektir, bu istediğiniz herhangi bir şey olabilir. Bu komut, yeni şifrelenmiş dosya olarak yeni bir data.enc dosyasıyla sonuçlanacaktır. Lütfen unutmayın, bu orijinal data.tar.gz dosyasını yerinde bırakacaktır, bu nedenle lütfen gerekirse silmeyi unutmayın. </p> <p> İstendiğinde data.enc dosyasının şifresini şu komutla çözebilirsiniz: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -d -a -iter 5 -in data.enc -out data_decrypted.tar.gz</code></pre> <p> Yukarıdaki komut sizden şifreleme parolasını isteyecek ve ardından dosyanızın şifresi çözülmüş sürümünü içeren bir data_decrypted.tar.gz dosyasıyla sonuçlanacaktır. </p> <p> </p> <h2 id=\"encrypt-and-decrypt-directories\"> Dizinleri Şifrele ve Şifresini Çöz </h2> <p> Yukarıdaki bölümdeki komutlar, tek tek dosyalar için harika çalışır, ancak tüm dizini şifrelemek isterseniz ne olur? Bunun için OpenSSL&#39;de yerleşik bir destek yoktur, ancak Linux&#39;un büyüsü sayesinde bu sorun değil. Örneğin, &quot;belgeler&quot; adlı bir dizini şifrelemek istiyorsanız şu komutu kullanabilirsiniz: </p> <pre><code class=\"hljs\">tar -cf tmpdata.tar documents && gzip tmpdata.tar && openssl aes-256-cbc -a -salt -iter 5 -in tmpdata.tar.gz -out documents.enc && rm -f tmpdata.tar.gz</code></pre> <p> Biraz ağız dolusu, ancak yukarıdaki komutta değiştirmeniz gereken yalnızca iki yer, şifrelenecek dizin olan ilk bölümdeki &quot;belgeler&quot; ve sonuçta ortaya çıkan şifreli dosya olan üçüncü bölümdeki &quot;documents.enc&quot;. Bu komut dizini arşivleyecek, şifreleyecek ve ardından yerinde tek bir şifreli Document.enc dosyası bırakarak oluşturulan geçici arşivi silecektir. </p> <p> Yeni oluşturulan Documents.enc dosyasının şifresini çözmek şu komutla aynı derecede kolaydır: </p> <pre><code class=\"hljs\">openssl aes-256-cbc -d -a -iter 5 -in documents.enc -out tmpdata.tar.gz && tar -xzf tmpdata.tar.gz && rm -f tmpdata.tar.gz</code></pre> <p> Yukarıdaki komutun değiştirmeniz gereken tek kısmı, şifrelenmiş dosyanın adı olan ilk bölümdeki &quot;documents.enc&quot; dir. Bu komut sizden şifreleme parolasını isteyecek, şifreyi çözmeye ve arşivi açmaya devam edecek ve sonuç olarak şifresi çözülmüş dizinden ayrılan geçici arşivi silecektir. </p> <p> </p> <h2 id=\"protect-your-data\"> Verilerinizi Koruyun </h2> <p> Artık verilerinizi hızlı bir şekilde şifrelemenin ve şifresini çözmenin ne kadar kolay olduğunu bildiğinize göre, bilginizi kullanmak ve özel verilerinizi güvende tutmak ve önlemek <a href=\"https://www.makeuseof.com/worst-data-breaches/\" target=\"_blank\" rel=\"nofollow noopener\"> veri ihlalleri </a> . Tekrarlamak gerekirse, şifrelemede burada sunulandan çok daha fazlası vardır ve yukarıdakiler kanun yaptırımlarından veya çok yetenekli ve kararlı bilgisayar korsanlarından kaçmak için değildir. </p> <p> Bununla birlikte, verilerinizi kayınbiraderin veya bilgisayar onarım teknisyeni gibi meraklı gözlere karşı korumak istiyorsanız, yukarıdaki yöntemler işe yarayacaktır. </p>"}