{"title":"Lightroom Düzenleme Becerilerinizi Nasıl Geliştirirsiniz: 10 Kolay Yol","content":"<p> Adobe Lightroom, piyasadaki en iyi bilinen fotoğraf düzenleme platformlarından biridir. Bu çözüm, yalnızca çok sayıda kullanışlı özelliğe sahip olduğu için değil, aynı zamanda kullanıcı dostu olması nedeniyle de popülerdir. </p> <p> Fotoğrafçılar zanaatlarını biraz daha ciddiye almak istediklerinde, yapacakları ilk şey düzenleme yazılımı satın almaktır. Ancak sıradan bir fotoğraf çeken olsanız bile, Lightroom arkadaşlarınızı şaşırtmak için birçok yol sunar. </p> <p> Bu kılavuzda, Lightroom&#39;da fotoğraflarınızı geliştirmenin birkaç kolay yolunu keşfedeceksiniz. Bu ipuçları hem Lightroom Classic hem de Lightroom Creative Cloud için geçerlidir. </p> <h2 id=\"use-masking\"> 1. Maskelemeyi Kullanın </h2> <p> Fotoğrafınızı varsayılan olarak keskinleştirirseniz, resmin tamamına, hatta istemediğiniz alanlara bile ayrıntı eklersiniz. Bu, gökyüzü ve su gibi istenmeyen yerlerde çok fazla tahıl bırakabilir. </p> <p> Ayrıca fotoğrafınızın fotoğraf makinenizle çektiğiniz bir şeyden çok bir çizime benzeme riskini de taşırsınız. Neyse ki, kolay bir çözüm var. </p> <p> Lightroom uygulamasında aşağı kaydırın <strong> Detay </strong> . Oradayken, git <strong> Bileme </strong> &gt; <strong> maskeleme </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Görüntünün keskinleştirmek istediğiniz bölümleri seçilene kadar kaydırıcıyı kaydırın. Neyi maskelediğinizi görmek için <strong> alt </strong> klavyenizdeki tuşa aynı anda basın. </p> <p> İstediğiniz alanı maskeledikten sonra, keskinleştirme kaydırıcısını istediğiniz kadar az veya çok kaydırın. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Varsayılan Adobe Profilleri Yerine Kamera Profillerini Kullanın </h2> <p> RAW&#39;da bir görüntü yüklerseniz, Adobe varsayılan olarak program profillerinden birini ekler. Bunlar bazı durumlarda resminizin daha iyi görünmesini sağlasa da, genellikle kameraya özel bir fotoğraf seçmeniz daha iyi olur. </p> <p> Bir kamera profili kullandığınızda, cihazınızla çektiklerinize bağlı olarak görüntüyü düzenlemek daha kolay hale gelecektir. </p> <p> Fotoğrafınızın profilini değiştirmek için şuraya gidin: <strong> profiller </strong> &gt; <strong> Kamera Eşleştirme </strong> . Daha sonra arasından seçim yapabilirsiniz <strong> Standart </strong> , <strong> nötr </strong> , <strong> Manzara </strong> , ve diğer görünümler. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Hatırlamak: </strong> sadece JPEG çekiyorsanız, görüntü profilini o kadar derinlikte değiştiremezsiniz. Bu nedenle, bazı çekimler yapmak için dışarı çıkmadan önce kameranızı ikisinden birine ayarlayın. <strong> ÇİĞ </strong> veya <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Resminizin Parçalarını Fırçalayın </h2> <p> Bir başyapıt bekleyerek tüm resminizin netliğini, doygunluğunu veya ayrıntısını artırdığınız, ancak bunun yerine mikrodalgada çekilmiş gibi görünen bir görüntü elde ettiğiniz oldu mu? Eğer öyleyse, bunun yerine resminizin yalnızca bazı kısımlarını değiştirmekten faydalanabilirsiniz. </p> <p> Lightroom&#39;da, adlı bir özelliğe erişebilirsiniz. <strong> Fırça </strong> . Resminizin bazı kısımlarını &quot;fırçalamak&quot; ve geri kalanını kendi haline bırakmak için bunu kullanabilirsiniz. </p> <p> Bu aracı kullanmak için şuraya gidin: <strong> Fırça </strong> Ekranınızın sağ tarafındaki simge. Resmin ne kadarını düzenlemek istediğinize bağlı olarak fırçanızı büyütebilir veya küçültebilirsiniz. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Fırçalamaya başlamadan önce, ince ayar yapmak istediğiniz görüntü özelliklerini değiştirin. Örneğin, resmin bir bölümünü daha net hale getirmek istiyorsanız netlik kaydırıcısını yukarı kaldırabilirsiniz. </p> <p> Bu özellikleri değiştirdikten sonra düzenlemek istediğiniz alanları fırçalayın. Basın <strong> Ö </strong> nereye fırçaladığınızı görmek için klavyenizde </p> <p> Belirli bir alanda çok fazla ileri gittiyseniz, basılı tutun. <strong> Eksi </strong> ( <strong> - </strong> ) düzenlemelerinizi silmek için bu kısımları tuşlayın ve fırçalayın. bilmek <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Adobe Lightroom için klavye kısayolları </a> bu durumlar için kullanışlıdır, bu yüzden onları tazelemeyi unutmayın! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Fotoğraflarınızı Engelleyin </h2> <p> Bazen kameranız, kenarların doğal olmayan renklerin olduğu yerlerde fotoğraflar çeker. Özellikle sert güneş ışığında fotoğraf çekerken bunları fark edeceksiniz. Esas olarak yeşil ve mor tonlarında gelirler. </p> <p> Fotoğraflarınızı sınırlamak için aşağı kaydırın <strong> sınırla </strong> . Mor veya yeşil saçaklardan kurtulmayı seçebilirsiniz. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> kullanın <strong> Miktar </strong> ne kadar sınır çizgisi eklemek istediğinize karar vermek için. Sonuçlardan memnun kalana kadar renk çubuğunu kaydırın. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Fotoğraflarınızı Düzleştirmek için Geometriyi Kullanın </h2> <p> Ne kadar uğraşırsanız uğraşın, tripodunuz yoksa kamerayı düz tutmak zordur. Ancak düzenleme yazılımının sihri sayesinde resimlerinizi düzeltmek çok kolay. </p> <p> Lightroom&#39;da, şuraya giderek fotoğraflarınızı otomatik olarak düzeltebilirsiniz. <strong> kırp </strong> Bölüm. Ancak, aynı sonucu elde etmenin daha doğru bir yolu var. </p> <p> Sağ taraftaki sekmede en üstteki seçeneği seçin. Ardından, aşağı kaydırın <strong> Geometri </strong> . Buradayken, git <strong> Dik </strong> &gt; <strong> Seviye </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> Fotoğrafı olabildiğince düz hale getirmek için düz çizgiler boyunca da çizebilirsiniz. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Kesme Alanınızın Boyutunu Ayarlayın </h2> <p> Artık maskelemeyi biliyorsunuz, ancak fotoğrafınızın belirli alanlarını da keskinleştirebileceğinizi biliyor muydunuz? </p> <p> Maskeli fotoğrafın içinde keskinleştirmek istediğiniz alanı seçmek için şuraya gidin: <strong> Bileme </strong> , şunu tut <strong> alt </strong> tuşuna basın ve <strong> yarıçap </strong> . Bu kaydırıcıyı ayarlamak bileme alanınızı büyütmenizi veya küçültmenizi sağlar. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> Bundan sonra, yukarı git <strong> Bileme </strong> bar. Benzer şekilde, tutun <strong> alt </strong> tuşuna basın ve kaydırıcıyı sağa hareket ettirin. Bu, resmin tamamı yerine fotoğrafınızın belirli bir alanını netleştirmenizi kolaylaştıracaktır. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Renk Noktası Eğrilerini Kullanın </h2> <p> Beyaz dengesini ayarladıktan sonra bile resminizin rengi düzgün görünmüyorsa, Lightroom&#39;daki renk noktası eğrilerini kontrol etmek isteyebilirsiniz. Bunları, resminizdeki belirli renkleri ayarlamak için kullanabilirsiniz. </p> <p> Uygulamada üç farklı renk eğrisi paneli bulacaksınız: kırmızı, mavi ve yeşil. </p> <p> Bu renk eğrilerine ulaşmak için aşağı kaydırın <strong> Nokta Eğrisi </strong> . Ardından değiştirmek istediğiniz renge tıklayın. Daha sonra standartta yaptığınız gibi renklerle oynayabilirsiniz. <strong> Nokta Eğrisi </strong> sekme. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Her Kaydırıcı İçin Bir Numara Yazın ve Buna Göre Ayarlayın </h2> <p> Çoğu zaman, yeni fotoğrafçılar, kendilerine sunulan düzenleme seçeneklerinin sayısı karşısında heyecanlanırlar. Lightroom&#39;u açtıklarında, her bir çubuğu her iki yönde de çok uzağa kaydıracaklar. Ancak imajlarını geliştirmek yerine, aşırı düzenlenmiş bir karmaşa ile sonuçlanırlar. </p> <p> Fotoğraflarınızı düzenlerken, anahtar küçük değişiklikler yapmaktır. Şansınız, zaten iyi bir fotoğrafçısınız ve çektiğiniz fotoğrafın sadece küçük bir post prodüksiyon ince ayarına ihtiyacı var. </p> <p> </p> <p> Her kaydırıcıyı serbestçe hareket ettirmek yerine, değiştirmek istediğiniz alanlardaki sayıları değiştirmeyi deneyin. <strong> +10 </strong> veya <strong> -10 </strong> . Daha fazla çalışmaya ihtiyaç olduğunu düşünüyorsanız, işlemi tekrarlayın. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Yakın olduğunuzu hissettiğinizde, mutlu olana kadar her kaydırıcıyı yavaşça sola veya sağa hareket ettirin. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Fotoğraflarınızı Kırpın </h2> <p> Kırpma bariz görünebilir, ancak birçok fotoğrafçı hala bu özelliği yeterince kullanmıyor. Resimlerinizi nerede kullanacağınıza bağlı olarak kırpmak da önemlidir. Aksi takdirde çarpıtılırlar. </p> <p> Fotoğraflarınızı kırpmak için şuraya gidin: <strong> kırp </strong> simge. Bu, tepeden ikinci en yüksek. git <strong> En Boy Oranı </strong> boyutunu değiştirmek ve istenmeyen nesnelerden kurtulmak için köşeleri sürükleyin. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> Kırpmayı bitirdikten sonra, <strong> Giriş </strong> tuşuna basın ve değişiklikler yürürlüğe girecektir. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Histogramı Kullanın </h2> <p> Lightroom histogramını göz ardı etmek kolaydır ancak bilmek önemlidir. Bu küçük grafik, görüntünüzde renklerin ve ışıklandırmanın eşit olmadığı yerleri göstererek daha temiz bir düzenleme oluşturmanıza olanak tanır. </p> <p> Genel bir kural olarak, iyi düzenlenmiş bir fotoğrafın histogramında birkaç ani yükselme olacaktır. Bazen bu kaçınılmazdır. Ancak genel olarak, grafiği mümkün olduğunca eşit hale getirmeye çalışmalısınız. </p> <p> Kullandığınız Lightroom sürümüne bağlı olarak, histogramı az çok doğrudan değiştirebilirsiniz. Lightroom Classic&#39;te histograma tıklayabilir ve hatta belirli bölümleri kaydırarak bazı şeyleri çıkarabilirsiniz. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> Creative Cloud&#39;da histogram benzer şekilde sağ üst köşede görünür; ancak histogramın hareket etmesi için kaydırıcıları kendiniz değiştirmelisiniz. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> Platformun her iki versiyonunda da histogram, ekranınızın üst kısmında düzenleme işlevlerinin üzerinde bulunur. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> Harika Düzenleme Sadece Profesyoneller İçin Değil </h2> <p> Lightroom, fotoğrafçılığını bir sonraki seviyeye taşımak isteyen herkes için mükemmel bir düzenleme yazılımıdır. Ve platformu daha önce hiç kullanmamış olsanız bile, öğrenmesi kolay olduğu için endişelenmenize gerek yok. </p> <p> Lightroom&#39;da fotoğraflarınızı düzenlerken, daha azının genellikle daha fazla olduğunu unutmayın. Bu ipuçlarını dikkate almanın yanı sıra, düzenlemeden sonra geri adım atmak ve daha sonra düşündüğünüz kadar iyi düzenlenmiş olup olmadıklarını görmek için geri dönmek iyi bir fikirdir. </p>"}