{"title":"Linux&#39;ta Groupadd ile Kullanıcı Grupları Nasıl Yönetilir","content":"<p> Kişisel bilgisayarınızda Linux kullanıyorsanız, kullanıcı yönetimi oldukça basittir. Ancak binlerce kullanıcısı olan bir sunucuya sahip olanlar için yönetim, dikkat edilmesi gereken ciddi bir konu haline gelir. </p> <p> Neyse ki, Linux tabanlı işletim sistemleri size sisteminizdeki kullanıcıları kontrol etmenin ve yönetmenin bir yolunu sunar. Gruplar oluşturabilir ve onlara kullanıcı ekleyebilirsiniz. Ardından sistemdeki her kullanıcıya izin atamak yerine, kullanıcı gruplarına sistem iş akışı ile ilgili ayrıcalıklar sağlayarak kolayca yetkilendirebilirsiniz. </p> <h2 id=\"create-user-groups-on-linux\"> Linux&#39;ta Kullanıcı Grupları Oluşturun </h2> <p> Linux, kullanıcı grupları oluşturmak için varsayılan bir komutla birlikte gelir. kullanabilirsiniz <strong> grup ekle </strong> Sisteminize yeni gruplar eklemek için komut. Komutun temel sözdizimi şöyledir: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> Yeni bir kullanıcı grubu &#39;yazarlar&#39; oluşturmak için: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> Yukarıda belirtilen komutu çalıştırmak, dosyaya yeni bir giriş ekleyecektir. <strong> /etc/grup </strong> ve <strong> /etc/gshadow </strong> sisteminizdeki dosyalar. Dosyalardaki yeni grup girişini yazarak kontrol edebilirsiniz. <strong> kedi /vb/grup </strong> ve <strong> kedi /etc/gshadow </strong> terminalinizde. </p> <p> Yalnızca yönetici izinlerine sahip kullanıcıların kullanıcı grupları oluşturabileceğini unutmayın. groupadd komutunu çalıştırmadan önce süper kullanıcıya geçmeyi unutmayınız. </p> <p> Zaten var olan bir ada sahip bir grup oluşturmaya çalışırsanız, şunu belirten bir hata görürsünüz: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> Ancak, kullanarak hatayı kapatabilirsiniz. <strong> -f </strong> veya <strong> --güç </strong> komutuyla işaretleyin. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Benzersiz GID ile Kullanıcı Grupları Oluşturun </h3> <p> Yeni bir kullanıcı grubu oluşturduğunuzda, sistem buna otomatik olarak bir Grup Kimliği veya GID atar. Grubunuzun belirli bir grup kimliğine sahip olmasını istiyorsanız, bunu <strong> -g </strong> veya <strong> --gid </strong> bayrak. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Halihazırda alınmış bir grup kimliği atamaya çalışırsanız aşağıdaki hata oluşur. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Tavsiye edilmese de, ekleyebilirsiniz. <strong> -Ö </strong> veya <strong> --benzersiz </strong> grup kimliğini zorla atamak için bayrak. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Parola ile Kullanıcı Grupları Oluşturun </h3> <p> Gruplarınıza bir şifre ekleyebilseniz de, bunlar kullanıcı için pratik bir kullanım sağlamaz. <strong> -p </strong> flag, kullanıcı grubunuz için bir parola belirlemenizi sağlar. </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Linux&#39;ta Sistem Grupları Oluşturun </h3> <p> Sistem grupları ile normal gruplar arasında küçük bir fark vardır. Sistem grupları, yedekleme ve bakım gibi sistem işlemlerini gerçekleştirmekten sorumlu kullanıcıları içeren özel gruplardır. </p> <p> Kullan <strong> -r </strong> veya <strong> --sistem </strong> Linux&#39;ta bir sistem grubu oluşturmak için bayrak: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Bir Kullanıcı Grubundaki Üyelerin Listesini Alın </h3> <p> Belirli bir grubun kaç üyesi olduğunu öğrenmek için, <strong> getent </strong> terminalinizden komut. Aşağıdaki komut, &#39;yazarlar&#39; grubunda bulunan tüm üyelerin bir listesini görüntüler: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Gruplara Kullanıcı Ekle </h2> <p> Artık sisteminizde bir kullanıcı grubu oluşturduğunuza göre, ona bazı kullanıcılar eklemenin zamanı geldi. Usermod, kullanıcı yönetimi ve denetleme ile ilgili çeşitli seçenekler içerdiğinden güçlü bir komut satırı yardımcı programıdır. Ayrıca grubunuza kolayca kullanıcı eklemenizi sağlar. Komutun temel sözdizimi şöyledir: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Mevcut Bir Kullanıcıyı Gruplara Ekle </h3> <p> Grubunuza mevcut bir kullanıcı eklemek istiyorsanız, <strong> -a </strong> ve <strong> -G </strong> bayraklar ihtiyacınız olan şeydir. <strong> -G </strong> bayrak grupları temsil ederken, <strong> -a </strong> ekleme, ekleme veya ekleme anlamına gelir. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> Ayrıca bir kullanıcıyı birden çok gruba ekleyebilirsiniz. Tek yapmanız gereken grup adlarını virgülle ayırarak girmek. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Gruba Yeni Bir Kullanıcı Ekle </h3> <p> kullanabilirsiniz <strong> kullanıcı ekleme </strong> istediğiniz zaman komut verin <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> Linux sisteminize yeni bir kullanıcı ekleyin </a> . Useradd, oluşturulduğu sırada kullanıcıya bir grup atamak için bir yol sağlar. <strong> -G </strong> flag, kullanıcıya bir grup belirlemenizi sağlar. </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> Bir kullanıcıyı birden fazla gruba eklemek de kolaydır. Yalnızca varsayılan komutta virgül karakteriyle ayrılmış grup adlarını iletin. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Kullanıcıları Bir Gruptan Kaldırma </h2> <p> Ayrıca kullanarak bir gruptan kullanıcıları kaldırabilirsiniz. <strong> kullanıcı modu </strong> . Bir Linux sisteminde bir kullanıcıya birden fazla grup atanabileceğini unutmayın. Bu gruplardan biri Birincil grup olarak ilan edilirken diğerleri ikincil gruplar olarak adlandırılır. </p> <p> Bir kullanıcıyı bir gruptan kaldırmaya çalışıyorsanız, kaldırma işleminden sonra kullanıcının en az bir birincil grubu olduğundan emin olun. Örneğin, kullanıcı &#39;rastgele&#39; admin, yazar ve editör gruplarının bir parçasıdır; burada admin birincil gruptur ve geri kalanı ikincil gruplardır. </p> <p> Kullanıcıyı yalnızca grup yazarlarından ve editörlerinden kaldırabilirsiniz. Ve bunu yapabilmek için, kullanıcının üyesi kalmasını istediğiniz grup adını iletmelisiniz. Bu, &#39;rastgele&#39; kullanıcıyı grup düzenleyicilerinden kaldırmak için aşağıdaki komutun kullanıldığı anlamına gelir: </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> Dikkat et, tek yapman gereken onu soymaktı. <strong> bayrak ekle (-a) </strong> bir gruba kullanıcı eklemek için kullandığınız komuttan. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Linux&#39;ta Grupları Sil </h2> <p> Bir kullanıcı grubunu artık sisteminizde tutmak istemiyorsanız, aşağıdaki komutu kullanarak grubu silebilirsiniz. <strong> grup oyunu </strong> komut. Komutun sözdizimi şöyledir: </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> &#39;Yazarlar&#39; kullanıcı grubunu silmek için: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Var olmayan bir grubu kaldırmaya çalışırsanız, şunu belirten bir hata alırsınız: </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Linux&#39;ta Kullanıcı Gruplarını Yönetme </h2> <p> Kullanmanız gereken Linux komutlarının farkında değilseniz, kullanıcı yönetimi zor olabilir. Denetleme ve yönetimle ilgili komutların giriş ve çıkışlarını öğrendikten sonra gerçekten kolaylaşıyor. </p> <p> Sunucu yöneticileri, ihtiyaçlarına uygun Linux dağıtımlarını kullanmaya çalışmalıdır. Bu şekilde, sunucu yönetimi için gereken tüm araçları ve yardımcı programları hemen elde edecekler. </p>"}