{"title":"LastPass, Ödemezseniz Sizi Tek Bir Cihaz Türüyle Kısıtlayacak","content":"<p> Popüler şifre yöneticisi LastPass büyük bir değişim geçiriyor. Yakında, hizmeti ücretsiz olarak kullananlar, ödeme yapmadıkları sürece bunu yalnızca bilgisayarlarda veya cep telefonlarında yapabilecekler, her ikisinde birden kullanamayacaklar. </p> <p> Bu, LastPass&#39;in artık ücretsiz bir şifre yöneticisi olarak çekici bir seçim olmadığı anlamına geliyor. Bilgisayarlar ve cep telefonları arasında sürekli geçiş yaptığımız bir dünyada, yalnızca bir cihaz türü için çalışan bir şifre yöneticisine sahip olmak işe yaramaz. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> LastPass Free&#39;de Neler Değişiyor? </h2> <p> adresinde açıklandığı gibi <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> LastPass blogu </a> , şifre yöneticisinin ücretsiz sürümü için değişiklikler yapılıyor. </p> <p> Şu anda LastPass Free, hizmeti tüm cihazlarınızda kullanmanıza izin veriyor. LastPass&#39;i bilgisayarınızda, tabletinizde veya cep telefonunuzda kullanmanız fark etmez. Bunların hepsi ücretsiz. Bu, 16 Mart 2021&#39;de değişecek. </p> <p> O andan itibaren, LastPass Free yalnızca bir tür sınırsız cihazı içerecek: bilgisayarlar veya cep telefonları. </p> <p> LastPass için bilgisayarlar herhangi bir masaüstü veya dizüstü bilgisayar olarak sınıflandırılırken, cep telefonları cep telefonları, tabletler ve akıllı saatler olarak sınıflandırılır. </p> <p> 16 Mart&#39;ta LastPass&#39;e ilk giriş yaptığınızda, aktif cihaz türünüzü ayarlamanız gerekecektir. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> Örneğin, cihaz türünüz olarak bilgisayarları seçerseniz, LastPass&#39;i masaüstü ve dizüstü cihazlarınızda kullanabileceksiniz. Ancak, LastPass&#39;i herhangi bir mobil cihazda kullanmak istiyorsanız, LastPass Premium&#39;a yükseltmeniz gerekir. </p> <p> Bu bir bakıma eski LastPass&#39;e geri dönüyor. LastPass&#39;i masaüstü ve mobil cihazlarda ücretsiz olarak kullanabilmek ancak 2015&#39;te mümkün oldu. Bundan önce mobil destek için ödeme yapmanız gerekiyordu. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> LastPass Desteği de Değişiyor </h2> <p> LastPass ayrıca destek sağlama şeklini de değiştiriyor. 17 Mayıs 2021&#39;den itibaren e-posta desteği yalnızca Premium ve Aile müşterilerine sunulacaktır. </p> <p> Ücretsiz kullanıcılar, LastPass destek web sitesinde bulunan yardım makalelerine takılıp kalacaktır veya LastPass topluluğu içinde yardım isteyebilirler. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> Herkes bir şifre yöneticisi kullanmalı </a> . Muhtemelen, masaüstünde ve mobilde kullanmanız gerekiyor. LastPass bunu biliyor ve şu anda 27 $/yıl için %25 indirimli olan ücretli hizmete geçiş yapan kullanıcılara güveniyor. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> Parola Yöneticisini Değiştirme Zamanı Geldi mi? </h2> <p> LastPass Free kullanıyorsanız, bu muhtemelen geçiş yapmayı düşünmenize neden olmuştur. Öyleyse, tüm cihazlarınızda ücretsiz olarak kullanabileceğiniz başka birçok harika şifre yöneticisi var. </p> <p> Yine de, sunduğu hizmeti desteklemek için LastPass&#39;e küçük bir miktar ödemenin adil olduğunu düşünebilirsiniz. </p>"}