{"title":"Microsoft&#39;un xCloud&#39;unun Tarayıcı Sürümüne Göz Atın","content":"<p> xCloud tarayıcı bağlantı noktasıyla ilgili haberleri hevesle bekliyorsanız, bugün şanslı gününüz, çünkü gerçekte nasıl göründüğüne bir göz atabilirsiniz. </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> Test Ediciler, xCloud Tarayıcı Ekran Görüntülerini Ortaya Çıkardı </h2> <p> xCloud şu anda çeşitli cihazlarda kullanılabilir, ancak hala Microsoft&#39;un tarayıcı sürümünü resmi olarak yayınlamasını bekliyoruz. </p> <p> Detaylar oldukça yetersizdi... şimdiye kadar. tarafından hazırlanan bir rapora göre <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> Sınır </a> , &quot;Microsoft&#39;un Xbox planlarına aşina olan kaynaklar&quot;, &quot;çalışanların artık genel bir önizlemeden önce xCloud&#39;un bir web sürümünü test ettiğini&quot; iddia ediyor. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> İşte Microsoft&#39;un web için xCloud&#39;una ilk bakış <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> — Sınır (@verge) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> 15 Şubat 2021 </a></blockquote>  <p> Unutmayın, bunlar yalnızca test kullanıcılarından alınan görüntülerdir, yani Microsoft, pek olası olmasa da, xCloud tarayıcı sürümünün görünümünü tamamen değiştirebilir. </p> <p> Ekran görüntülerinden, xCloud&#39;un akıllı telefonlarda ve tabletlerde bulunan Android sürümüne çok benzediği görülüyor. </p> <p> Ekran görüntüsünün üst kısmında yeni eklenen oyunları ve ardından &quot;Yakında&quot; bölümünü görebilirsiniz. Bunun altında, sayfanın alt kısmında bulunan tam xCloud oyun kitaplığı ile seçtiğiniz bir oyun türünü seçmek için çeşitli seçenekleriniz var. </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> Tarayıcınızda xCloud&#39;a Nasıl Erişirsiniz? </h2> <p> Şu anda yapamazsınız. xCloud&#39;un web bağlantı noktasının genel sürümü henüz mevcut değil. Bu, tarayıcınız aracılığıyla xCloud&#39;a erişmek istiyorsanız biraz daha beklemeniz gerektiği anlamına gelir. İddiaya göre Microsoft, hizmeti 2021&#39;in ikinci çeyreğinde kamuya açıklamayı planlıyor. </p> <p> O zamana kadar xCloud&#39;a erişmek için başka yöntemler bulmanız gerekecek. Şu anda bulut oyun hizmetine yalnızca Android cihazlarda erişebilirsiniz (iOS&#39;ta oynamak için tarayıcı sürümüne ihtiyacınız var, <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple ve Microsoft arasında bir tartışma </a> ). </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> xCloud Games&#39;e Başka Bir Şekilde Erişebilir misiniz? </h2> <p> Evet ve hayır. Tabiri caizse xCloud&#39;da hiçbir başlığa erişemezsiniz. Bunu yapmak için bir Android cihazı ve resmi Game Pass uygulamasını kullanmadığınız sürece olmaz. </p> <p> Ancak Microsoft&#39;un bulut oyun hizmetinde bulunan oyunların tümü Game Pass&#39;te mevcuttur. Aslında, Game Pass Ultimate aboneliğinin bir parçası olarak xCloud&#39;a erişim elde edersiniz. Böylece bu oyunlara Xbox&#39;ınız veya Windows PC&#39;niz aracılığıyla erişebilirsiniz. </p> <p> Yani, tek kelimeyle, evet. Bu oyunlara başka bir yoldan erişebilirsiniz. Android sürümüne erişiminiz yoksa xCloud kullanmamanız yeterlidir. </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud: Yakında Bir iOS Aygıtına Geliyor </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> Microsoft&#39;un bulut oyun platformunu ele geçirene kadar uzun süre beklemeniz gerekmez. xCloud testten geçtikten sonra, Microsoft hepimizin bir göz atmasına izin vermeden önce gerekli değişiklikleri yapacak ve umarız çok geçmeden üzerinde de bir oyun oynayacaktır. </p>"}