{"title":"Masaüstü Simülatöründe Kendi Masa Oyununuzu Nasıl Yapabilirsiniz?","content":"<p> Hiç arkadaşlarınızla Tabletop Simulator&#39;da (TTS) oynamak için bir oyun yaratmayı düşündünüz mü? Veya belki de oyunların prototipini yapmak ve bunları çevrimiçi olarak test etmek isteyen bir masa üstü oyun geliştiricisisiniz. </p> <p> TTS&#39;nin çok yönlü oyun ortamından yararlanmak için daha iyi bir zaman olmamıştı. Bugün size bunu nasıl yapacağınızı öğreteceğiz. </p> <h2 id=\"what-is-tabletop-simulator\"> Masaüstü Simülatörü Nedir? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Bilmeyenler için, Tabletop Simulator (TTS), yerel veya çevrimiçi masaüstü oyunları oynamak için 3D bir ortam sağlar. için harika bir yol haline geldi <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> arkadaşlarınla ​​çevrimiçi masa oyunları oyna </a> . </p> <p> TTS&#39;deki oynanabilir oyunlar arasında poker, dama, Dungeons &amp; Dragons, mini golf ve hatta en yeni masa oyunlarından her şey bulunur. Oynamak istediğiniz herhangi bir oyun, genellikle DLC olarak veya topluluk atölyesinde bulunur. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> Neden Masaüstü Simülatörü Kullanmalısınız? </h2> <p> Daha önce fiziksel bir masa oyunu yaratmayı denediyseniz, sadece oyun öğeleri oluşturmanın değil, aynı zamanda oyunu ince ayar yapmaya veya gözden geçirmeye karar verdiğinizde bunları değiştirmenin veya değiştirmenin ne kadar zaman alıcı olabileceğini bilirsiniz. </p> <p> TTS&#39;de, bir nesnenin renginden ağırlığına kadar her şey bir fare tıklamasıyla değiştirilebilir, bu da revizyon sürecini sorunsuz ve ağrısız hale getirir. </p> <p> Ek olarak, oyununuzu canlı olarak yayınlamak ve sosyal medyada ve akış platformlarında göstermek kolaydır. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> Başlamak için Neye İhtiyacınız Var? </h2> <p> Başlamadan önce aşağıdakilere ihtiyacınız olacak: </p> <ul> <li> Steam kullanıcı hesabı </li> <li> PC&#39;nizde yüklü olan Masaüstü Simülatörü </li> <li> Pano ve kart tasarımlarınızın JPG görüntüleri </li> </ul> <p> <strong> İndir: </strong> Masaüstü Simülatörü açık <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> Buhar </a> (19,99 $) </p> <p> Oyun öğelerini tasarlamak en iyi şekilde yazılımları açıklayarak veya daha önce yapmış olduğunuz fiziksel kartların görüntülerini tarayarak yapılır. Sadece JPG uzantılarına sahip olduklarından ve ayrı ayrı kaydedildiklerinden emin olun. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Tahtalar ve Oyuncu Paspasları Oluşturma </h2> <p> Panolarınızı ve diğer 2B nesneleri tasarlarken, çözünürlüğün, kaliteden ödün vermeden doğru boyutlandırabilmeniz için yeterince yüksek olduğundan emin olun. TTS, içe aktardığınızda otomatik olarak boyutlandıracak ve tam olarak istediğiniz gibi yeniden boyutlandırabileceksiniz. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Kart Oluşturma </h2> <p> TTS&#39;deki kartların üç yönü vardır: kart yüzü, kart arkası ve gizli kart (kartın bir oyuncunun elindeki diğerlerine nasıl görüneceği). Bunların her biri için tasarımlara ihtiyacınız olacak, ancak bunun yerine gizli kartı basitçe kartın arkası yapma seçeneğiniz var. </p> <h3 id=\"create-and-arrange-card-faces\"> Kart Yüzleri Oluşturun ve Düzenleyin </h3> <p> Her kartı tek tek içe aktarmak yerine, kartlarınızın tümünü veya çoğunu tek bir deste olarak içe aktarmak en iyisidir. </p> <p> Bir deste oluşturmak için her tasarımı kopyalayıp 7x10&#39;luk bir kart sayfasına yapıştırın. Aşağıdaki gibi bir şablon kullanmak başlamanıza yardımcı olacaktır. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> Şablon, destenizdeki her kart için yuvaları tanımlayarak bir seferde 69&#39;a kadar kartı içe aktarmanıza olanak tanır. Bu kadar çok ihtiyacınız yoksa, yuvaları boş bırakabilirsiniz ve daha fazlasına sahipseniz, içe aktardıktan sonra desteleri birleştirebilir veya kartları kopyalayabilirsiniz. </p> <p> Ancak, bu şablonu kullanmak zorunda değilsiniz. Bir kart sayfası aslında herhangi bir boyutta olabilir ve TTS bunu otomatik olarak 7x10&#39;luk bir ızgaraya böler. </p> <p> Size kolaylık sağlamak için, yukarıdaki şablon ve bir kare kart şablonu, TTS yerel dosya dizininizde mevcuttur. </p> <p> Yerel dosyalarınızın nerede olduğundan emin değilseniz, onları Steam kitaplığınızdan aşağıdaki dosyayı açarak bulabilirsiniz. <strong> Özellikleri </strong> TTS için menü. seçin <strong> Yerel dosyalar </strong> sekmesini ve tıklayın <strong> Araştır </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Kart Arkaları </h3> <p> Tüm destenin arkası için yalnızca bir tasarım istiyorsanız, ihtiyacınız olan tek şey tasarımın tek bir JPG görüntüsüdür; kart sayfası gerekli olmayacaktır. </p> <p> Destenizin birden fazla benzersiz arka yüzü olacaksa, ilk kart sayfanızdaki yüz tasarımlarına karşılık gelen arka tasarımları olan ek bir kart sayfası oluşturmanız gerekir. Birinci yuvadaki yüz tasarımı için, belirtilen arka yüzü arka sayfanızdan birinci yuvaya yerleştirin. İkinci yüz için, arkasını ikinci yuvaya yerleştirin ve bu şekilde devam edin. </p> <h3 id=\"hidden-cards\"> Gizli Kartlar </h3> <p> Şablonda &quot;Diğer Oyunculara Gizli Kart&quot; etiketli kart sayfasının 70 numaralı yuvasına, bu destedeki kartlar oyuncunun elindeyken rakiplerin görmesini istediğiniz tasarımı yerleştirin. Bu, geleneksel olarak düz siyah veya beyazdır veya güvertenin arka tasarımına sahiptir. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Öğeleri İçe Aktarma </h2> <p> Artık tahtalarınızı ve destelerinizi oluşturduğunuza göre, içe aktarmaya başlamaya hazırsınız. </p> <p> Oyununuzla birlikte bir sunucu barındırmadan önce, tek oyunculu bir oyun başlatmak ve öğeleri önceden içe aktarmak faydalı olacaktır. Ardından kurulumu kaydedebilir ve oyuncular geldiğinde hemen başlamaya hazır olabilirsiniz. </p> <p> TTS&#39;yi başlatın ve tıklayın <strong> Oluşturmak </strong> öğesini seçin ve ardından <strong> Tek oyuncu </strong> ortamı yaratmak için. TTS tarafından oluşturulan tüm öğeleri silin ve oyununuzun oynanmasını istediğiniz masayı seçin. </p> <p> Ortam hazır olduğunda, tıklayın <strong> nesneler </strong> üst menüdeki düğmesine basın ve ardından <strong> özel </strong> kategori. </p> <h3 id=\"boards-and-player-mats\"> Tahtalar ve Oyuncu Paspasları </h3> <p> Seç <strong> Yazı tahtası </strong> itibaren <strong> özel </strong> menüsünü seçin ve panonun görünmesini istediğiniz yeri tıklayın. Pano içe aktarma iletişim kutusunu açmak için herhangi bir yeri sağ tıklayın. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Pano resminize göz atın ve TTS bunu Steam Cloud hesabınıza yüklemek mi yoksa yerel bir dosya tutmak mı istediğinizi soracaktır. Oyununuzu çevrimiçi veya farklı bir cihazda oynamayı planlıyorsanız, dosyaları buluta yükleyin. </p> <p> İsteğe bağlı olarak resimlerinizi Dropbox, Photobucket veya Imgur gibi başka bir ana bilgisayara yükleyebilir ve URL&#39;yi buraya yapıştırabilirsiniz. Ancak harici ana bilgisayarlar daha az güvenilirdir ve önerilmez. </p> <p> Steam Bulutunuza yüklediğinizde, TTS sizden ona bir dosya adı vermenizi isteyecektir. Yükleme bittiğinde, tıklayın <strong> İthalat </strong> . </p> <p> İçe aktarılan pano ile artık panoyu küçültebilir veya büyütebilirsiniz. <strong> - </strong> ve <strong> + </strong> klavyenizdeki tuşlar. Oyun sırasında yanlışlıkla hareket etmemesi için yerine kilitlemek için tahtaya sağ tıklayın ve altında <strong> geçiş yapar </strong> , Tıklayın <strong> Kilit </strong> . </p> <h3 id=\"card-decks\"> Kart Desteleri </h3> <p> İçinde <strong> Özel Nesne </strong> menü, tıklayın <strong> Güverte </strong> . Destenin görünmesini istediğiniz masada herhangi bir yere tıklayın ve ardından içe aktarmayı başlatmak için sağ tıklayın. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Ayarları aşağıdaki gibi yapın: </p> <ul> <li> <strong> Tür: </strong> Normal bir yuvarlak köşeli dikdörtgen kart dışında belirli bir şekliniz varsa bunu değiştirin. </li> <li> <strong> Yüz: </strong> Tıkla <strong> Yerel Dosyalara Göz Atın </strong> düğmesine basın ve yüz kartı sayfanızı bulun. Yine, yerel dosyalar veya dışarıdaki ana bilgisayarlar yerine Steam Bulut seçeneğini öneriyoruz. </li> <li> <strong> Eşsiz Sırtlar: </strong> Destenizin birden fazla arka tasarımı olacaksa bu seçeneği işaretleyin ve ardından arka kart sayfanızı <strong> Geri </strong> Kutu. Tüm güverte için tek bir tasarım kullanıyorsanız, bunun yerine arka tasarımınızı yükleyin. </li> <li> <strong> Genişlik ve yükseklik: </strong> Standart dikdörtgen kart 10x7&#39;den farklı bir oran kullandıysanız bunu ayarlayın. </li> <li> <strong> Numara: </strong> Bunun, içe aktardığınız kart sayısıyla eşleştiğinden emin olun. </li> <li> <strong> Yan yan: </strong> Bu, oryantasyonu değiştirir <strong> Alternatif Yakınlaştırma </strong> TTS&#39;de işlev. Kartın yan görünmesini istemiyorsanız, işaretlemeden bırakın. </li> <li> <strong> Arka Gizli: </strong> Kartlarınızın gizli görünümünün sadece kartların arka yüzü olmasını istiyorsanız bunu işaretleyin. </li> </ul> <p> Ayarlarınız doğru olduğunda, tıklayın <strong> İthalat </strong> . Desteniz masada görünecek ve karıştırmaya ve dağıtmaya başlayabilirsiniz. </p> <p> Kartlarınızın sıralamaya yardımcı olacak adlara sahip olmasını istiyorsanız, tek bir karta sağ tıklayın ve <strong> isim </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Diğer Oyun Öğelerini İçe Aktarma </h2> <p> Diğer 2B nesneleri içe aktarmak, panoları içe aktarma işlemine benzer. TTS&#39;nin zar ve figürinler gibi birçok ortak oyun öğesinde kullanıma hazır olduğunu unutmayın. <strong> nesneler </strong> Menü. </p> <p> Kullanmak istediğiniz özel 3B öğeleriniz varsa, <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> TTS&#39;nin 3B modelleri içe aktarma kılavuzu </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Tam Bir Oyunu Kaydetme </h2> <p> Bileşenleri ilk kurulum durumunda düzenledikten sonra, <strong> Oyunlar </strong> üst menüdeki düğmesine basın. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Seç <strong> Kaydet ve Yükle </strong> ve tıklayın <strong> Oyunu kaydet </strong> buton. Bir isim verin ve tıklayın <strong> Kayıt etmek </strong> . Artık, ne zaman oyunlara ev sahipliği yapsanız, mükemmel kurulumda şuraya erişerek yeniden yükleyebilirsiniz: <strong> Kaydet ve Yükle </strong> Menü. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Özel Masaüstü Oyunlarından En İyi Şekilde Yararlanma </h2> <p> Nasıl yapılacağını öğrendikten sonra, Tabletop Simulator&#39;da özel oyunlar tasarlamak ve oynamak kolaydır. Arkadaşlarınızı davet edin ya da hazır ve istekli oyun testçilerini arayın. <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> TTS topluluğu </a> . Artık özel oyununuzu başkalarına gösterebilirsiniz! </p>"}