{"title":"MTA-STS Nedir ve E-postalarınızı Nasıl Korur?","content":"<p> E-posta, çoğu siber saldırının arkasındaki en büyük suçludur. Kötü amaçlı yazılım, reklam yazılımı, spam ve kimlik avı için kolay bir erişim noktasıdır ve tehdit aktörlerinin kişisel bilgilerinizi ele geçirmesi için sonsuz fırsatlar sunar. </p> <p> Bu tehditleri azaltmak için hem bireysel hem de iş e-posta hesapları için sıkı güvenlik önlemleri alınmalıdır. </p> <h2 id=\"email-security-and-encryption\"> E-posta Güvenliği ve Şifreleme </h2> <p> Diğer iletişim modlarının popülaritesine rağmen, e-posta mesajlaşma, herhangi bir kişi veya kuruluş için hala aktarılan en büyük veri biçimidir. E-posta içeriğinizin güvenliğini sağlamak hayati bir gerekliliktir. </p> <p> E-posta güvenliği, gelen ve giden tüm e-posta trafiğinin denetlenmesini ve şifrelenmesini gerektirir. Şifreleme, güvenli SMTP (Basit Posta Aktarım Protokolü) bağlantıları sağlayarak e-posta içeriğinin gizliliğinin korunmasında hayati bir rol oynar. </p> <p> Yakın zamana kadar şifreleme, SMTP için yalnızca isteğe bağlı bir gereklilikti. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> E-posta Şifreleme Nasıl Çalışır? </h2> <p> E-posta şifreleme, mesaj içeriğinize şifre veya kod parçası ekleyerek onu çözülemez hale getirme işlemidir. E-posta verilerinin koda dönüştürülmesiyle, içerikler yetkisiz erişime karşı korunur. Basitçe söylemek gerekirse, e-postanız şifreli. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> Ek bir güvenlik olarak, şifreleme işlemi, kodlanmış e-postaları kilitlemek ve kilidini açmak için şifrelenmiş anahtarların değiştirildiği genel ve özel anahtarları kullanır. Gönderici, e-postayı açık anahtarlı şifreleme kullanarak şifreler ve ardından alıcı, alınan mesajı deşifre etmek için özel bir anahtar kullanır. </p> <p> Şifreleme, baştan sona bir e-posta yolculuğunun tamamına uygulanır. En iyi uygulama olarak, yalnızca hassas bilgiler taşıyanlar değil, tüm gelen ve giden e-postalar şifrelenmelidir. Bu, tehdit aktörlerinin sisteminize herhangi bir giriş noktası kazanmasını engeller. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> SMTP ile İlgili Arka Plan ve Sorunlar </h2> <p> SMTP protokolü 1982&#39;de ortaya çıktığında, e-posta şifreleme yaygın bir uygulama değildi ve varsayılan olarak e-postalar düz metin olarak gönderilip alındı. Taşıma düzeyinde güvenliği sağlamak için, 1990&#39;ların sonlarında, şifreleme seçeneği sunan STARTTLS komutu eklendi. <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> TLS (Taşıma Katmanı Güvenliği) protokolü </a> . </p> <p> TLS yükseltmesi kulağa ne kadar umut verici gelse de, iki güvenlik boşluğunu olduğu gibi bıraktı: </p> <ol> <li> Şifreleme seçeneği şuydu: <strong> isteğe bağlı </strong> . Güvenli olmayan e-postalar hâlâ yaygındı ve siber saldırılarda ani bir artışa neden oluyordu. </li> <li> STARTTLS yerinde olsa bile, SMTP sunucuları sertifikaları doğrulamadığından gönderenin sunucusunun kimliğini doğrulamanın bir yolu yoktu. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> MTA-STS&#39;nin Gelişi </h2> <p> 2019&#39;da Google nihayet üstünü çizdi ve yeni MTA-STS (Posta Aktarım Aracısı/Strict Transport Security) standardının benimsendiğini duyurdu ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> Bu, posta hizmeti sağlayıcılarına SMTP bağlantılarının güvenliğini sağlamak için TLS uygulama olanağı sağlar ve ayrıca güvenilir bir sunucu sertifikasıyla TLS sunmayan MX ana bilgisayarlarına e-posta teslimini reddetme seçeneği sunar. </p> <p> MTA-STS, iletişim halindeki SMTP sunucuları arasında şifrelemeyi zorlayarak, SMTP ile ilgili önceki tüm sorunları nihayet halleder. Ama aslında nasıl çalışıyor? Hadi bulalım! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> MTA-STS Nasıl Çalışır? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS, bir SMTP sunucusuna yalnızca iki koşulda başka bir SMTP sunucusuyla iletişim kurma talimatı vererek çalışmaya başlar: </p> <ol> <li> SMTP sunucusu <strong> zorunlu </strong> şifreli olmak. </li> <li> Sunucunun sertifikasındaki alan adı, politikadaki alanla eşleşir ve sertifikalar günceldir. </li> </ol> <p> MTA-STS, bir ilke yayınlamak için DNS ve HTTPS&#39;nin bir kombinasyonunu kullanarak, gönderen tarafa şifreli bir iletişim kanalı başlatılamıyorsa nasıl devam edeceğini bildirir. </p> <p> MTA-STS&#39;yi alıcı tarafında uygulamak kolaydır, ancak gönderen için aşağıdaki gibi destekleyici bir posta sunucusu yazılımı vardır: <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> kullanılmalıdır. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> MTA-STS Ne Tür Saldırıları Azaltır? </h2> <p> E-posta iletişimlerinize MTA-STS uygulanırsa, aşağıdaki tehditler doğrudan karşılanır: </p> <p> <strong> Ortadaki Adam (MITM) Saldırıları: </strong> Bu saldırı, bir saldırgan, verileri çalmak veya değiştirmek için iki taraf arasındaki iletişimin ortasında araya girdiğinde gerçekleştirilir. Bir e-posta söz konusu olduğunda, bu genellikle iletişim halindeki iki SMTP sunucusu anlamına gelir. MTA-STS kullanılarak bu saldırılar kolayca önlenebilir. </p> <p> <strong> Sürüm Düşürme Saldırıları: </strong> Bir tehdit aktörü, bir ağ kanalını güvenli olmayan bir veri iletim moduna geçmeye zorlar. Örnek olarak, bu saldırı bir web sitesi ziyaretçisini bir sitenin HTTPS sürümünden bir HTTP sürümüne yönlendirebilir. MTA-STS, yetkisiz erişimi engelleyerek bu saldırılarla mücadeleye yardımcı olur. </p> <p> <strong> DNS Spoofing Saldırıları: </strong> Bu kurnaz saldırılar, kullanıcının hedeflediği yerin DNS kayıtlarını değiştirir ve onları meşru bir siteyi veya etki alanını ziyaret ettiklerine inandırır. MTA-STS&#39;yi uygulamak, bu saldırıların hafifletilmesine büyük ölçüde yardımcı olur. </p> <p> </p> <p> Artık MTA-STS&#39;ye aşina olduğumuza göre, TLS raporlaması olarak bilinen SMTP için yeni bir raporlama standardıyla temele dokunmanın zamanı geldi. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> SMTP TLS Raporlaması (TLS-RPT) nedir? </h2> <p> MTA-STS gibi, TLS-RPT de gönderen uygulamalar arasındaki bağlantı sorunlarını ve tutarsızlıkları algılayan bir raporlama standardıdır. Etkinleştirildiğinde, size e-posta gönderirken harici sunucuların yaşadığı bağlantı sorunlarıyla ilgili günlük raporlar gönderir. </p> <p> Bunu, raporların olası sorunları ve yapılandırma sorunlarını ölçmek ve önceliklendirmek için kullanılabileceği bir sorun giderme aracı olarak düşünün. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> TLS-RPT Ne Tür Sorunları Çözüyor? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Teşhis Raporlaması: </strong> TLS raporlaması, teslim sorunlarıyla karşılaşan tüm gelen e-postalarla ilgili kapsamlı ayrıntıları içeren JSON dosya biçiminde tanılama raporları sunar. Ayrıca, örneğin bir sürüm düşürme saldırısı nedeniyle geri dönen veya teslim edilmeyen e-postaları da algılar. </p> <p> <strong> Geliştirilmiş Görünürlük: </strong> TLS-RPT&#39;yi etkinleştirerek tüm e-posta kanallarınızdaki görünürlüğü artırabilirsiniz. Bu, yolunuza çıkan ve başarısız mesajları da içeren tüm verilere göz kulak olmanızı sağlar. </p> <p> <strong> Günlük raporlar: </strong> Teşhis raporları, MTA-STS politikalarını derinlemesine kapsamak ve gözlemlemek için günde en az bir kez gönderilir. Raporlar ayrıca trafik istatistiklerini ve hatalar ve başarısız teslimatlarla ilgili ayrıntılı bilgileri içerir. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Diğer Her Şey Başarısız Olduğunda, Şifreleme Geçerli Olur </h2> <p> Siber tehditlerin sürekli gelişen doğası nedeniyle, güvenli ve güvenli e-posta teslimi için sıkı güvenlik önlemleri ve kriptografi olmazsa olmazlardır. </p> <p> Güçlü şifreleme özellikleri ve MTA-STS standartları sunan çeşitli e-posta sağlayıcıları sayesinde, tamamen güvenli e-posta aktarımları artık uzak bir gerçeklik değil. </p>"}