{"title":"Microsoft, iPad için Yeni Office Uygulamasını Yayınladı","content":"<p> Microsoft, Apple tablet için birleşik Office uygulamasını yayınladı. Bununla birlikte, Word, Excel ve PowerPoint artık iPhone ve iPad&#39;de tek bir indirme olarak mevcut. <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> Uygulama mağazası </a> . Microsoft, bu iPad uygulamalarını bağımsız indirmeler olarak sunmaya devam etmektedir. </p> <h2 id=\"better-late-than-never\"> Geç olsun güç olmasın </h2> <p> Microsoft, indirmeye eşlik eden sürüm notlarında &quot;Bildiğiniz Word, Excel ve PowerPoint uygulamalarını iPadOS için optimize edilmiş tek bir uygulamada birleştiriyoruz&quot; dedi. Office kullanıyorsanız ve hareket halindeyken çalışmak istiyorsanız bu harika bir haber. arayanlar için <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> iPad&#39;lerini bir dizüstü bilgisayar değişimine dönüştürün </a> , bu çok önemli bir sürüm. </p> <p> Uygulamalar ücretsiz olarak sunulur, ancak düzenleme ve diğer gelişmiş işlevler için Office 365 aboneliği gerekir. Merak edenler için Microsoft, aylık 6,99 dolardan başlayan çeşitli uygulama içi abonelik seçenekleri sunuyor. </p> <p> İPad&#39;inizde yalnızca bir kelime işlemciye ihtiyacınız varsa, alternatifleri düşünmek daha iyi bir fikir olabilir. <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> MUO&#39;nun iPad için en iyi kelime işlemci uygulamaları özeti </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> Birleşik Mobil Ofis Deneyimi </h2> <p> Açık olmak gerekirse, bu yepyeni bir sürüm değil, mevcut iOS için Office güncellemesidir. <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> hepsi bir arada Office uygulaması iPhone&#39;da ilk kez sahneye çıktı </a> ve Android Şubat 2020&#39;de. Microsoft&#39;un iPad için optimize edilmiş Word, Excel ve PowerPoint sürümlerini karışıma eklemesinin tam bir yılını neyin aldığı belli değil, ancak geç olması hiç olmamasından iyidir. </p> <p> </p> <p> Bugünden önce, pakete dahil olan üretkenlik uygulamaları, eskiden pencereli modda çalıştıkları için iPad&#39;de ortalamanın altında bir deneyim sağlıyordu. Ancak şu anda mevcut olan en son güncellemeyle, Apple müşterileri artık ekran boyutundan bağımsız olarak iPhone, iPad veya iPod touch&#39;larında yerel Office deneyimine sahip olabilir. </p> <p> </p> <h2 id=\"ipad-specific-features\"> iPad&#39;e Özgü Özellikler </h2> <p> Microsoft, mobil Office tekliflerine düzenli olarak yeni, tablet için optimize edilmiş özellikler ekliyor. Örnek olarak, Word, Excel ve PowerPoint&#39;in mobil sürümleri yakın zamanda fare ve izleme dörtgeni hareketleri için destek aldı. Uygulamalar ayrıca iOS&#39;un Bölünmüş Görünümü yan yana çoklu görev özelliğini de destekler. </p> <p> Office&#39;in mobil ve masaüstü sürümleri aynı özelliklerin tümüne sahip olmasa da yeni iOS için Office birkaç yeni özellik sunar. Bunlar, Apple Kurşun Kaleminiz veya parmağınızla belgeleri imzalamanıza, belgelerinizden hızla PDF&#39;ler oluşturmanıza, görüntüleri metne ve tablolara dönüştürmenize vb. izin verir. </p> <p> </p> <p> Ayrıca artık PDF&#39;lere kolayca tarih, şekil, resim ve not ekleyebilirsiniz. Uzman kullanıcılara gelince, artık Office&#39;in görüntü tabanlı eylemlerine (PPT Oluştur, PDF Oluştur ve daha fazlası gibi) iOS&#39;un çok amaçlı Paylaş menüsü aracılığıyla erişebilirler. Şirket, &quot;Ayrıca, Office uygulamasını açtığınızda yeni ekran görüntüleri varsa, bunlar PDF veya PPT&#39;ye dönüştürmek için bir öneri olarak ortaya çıkıyor&quot; diyor. </p> <p> Microsoft, Mac ve Windows için Office paketinde de bazı değişiklikler yapacak. Windows üreticisine göre, 2021&#39;de masaüstü için Office&#39;te yapılacak güncellemeler, diğer geliştirmelerin yanı sıra kalıcı lisanslar içerecek. </p>"}