{"title":"Microsoft&#39;un Edge Tarayıcısı, Gizli Nintendo Oyun Emülatörlerine Ev Sahipliği Yaptı","content":"<p> Microsoft, Microsoft Edge tarayıcı uzantıları mağazasında saklanan bir dizi yasa dışı oyun öykünücüsünü kaldırdı. Microsoft Edge uzantıları mağazası, kullanıcıların hiçbiri yasal olarak mağazaya gönderilmeyen birkaç ikonik oyunu oynamasını sağlayan onlarca öykünücüye ev sahipliği yaptı. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft, Yasadışı Kenar Uzantı Emülatörlerini Kaldırıyor </h2> <p> Microsoft Edge eklentileri mağazasında, Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2 ve hatta Minecraft dahil olmak üzere tüm zamanların en ikonik oyunlarından bazıları vardı. Her oyun tarayıcıda bir öykünücü penceresinde başlatıldı ve kullanıcıların her bir başlığı tam olarak oynamasına izin verdi. </p> <p> Bununla birlikte, klasik oyunların hiçbiri Nintendo, Sega, Atari ve evet, hatta Microsoft gibi resmi oyun geliştiricilerini listelemedi. Listelenen geliştiricilerin isimleri Gamelands, Kday ve StayReal&#39;i içeriyordu ve bunların hepsi tamamen kurgusal ve orijinal geliştiricilerle hiçbir bağlantısı yok. </p> <p> Garip bir şekilde, resmi Microsoft Edge Development Twitter hesabı, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , tarayıcı uzantı mağazasında bulunan oyunları tanıtmak için görünen emülatörler hakkında yayınladı. Öykünücüleri tanıtan orijinal tweet&#39;i yakalayamadık, ancak bir kopyası şu adresten edinilebilir: <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Resetera </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> Emülatörler Yasadışı mı? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Emülatörler, farklı yazılımları çalıştırmanıza izin verir </a> bilgisayarınızda. Eski oyunları oynamak için bir emülatör de kullanabilirsiniz. </p> <p> Emülatörlerin kendileri yasa dışı olmasa da, bir öykünücüde oynamak için telif hakkı içeriği indirmek yasaktır. Resmi Microsoft Edge Development hesabından gelen tweet, öykünücüler kullanıcının oynaması için oyun ROM&#39;unun yeni bir kopyasını indirdiği için garip bir hareketti. </p> <p> Terk edilmiş yazılım konusu da biraz gri bir alandır. Terk edilmiş yazılım oyunları artık yayınlanmamaktadır ve artık çevrimiçi olarak veya bir mağazada satılmamaktadır. Bununla birlikte, çoğu durumda, bu oyunların telif hakkı sona ermemiştir, ancak telif hakkı sahibi haklarını aktif olarak uygulamıyor. </p> <p> </p> <p> Çoğu durumda, terk edilmiş yazılımlar yasa dışıdır. Yine de, terk edilmiş bir yazılımla ilgili hiçbir dava yok veya en azından eski bir oyun geliştiricisinin, bir terk edilmiş yazılım başlığını indirdiği için birisini kovuşturmasıyla ilgili hiçbir dava yok. </p> <p> Bu tam örnekte, bu eski oyunların bir web tarayıcısında öykünmesi yasa dışıdır. Ayrıca Nintendo, fikri mülkiyetini çoğaltmaya veya yeniden dağıtmaya çalışan herhangi bir site veya hizmeti kaldırmasıyla ünlüdür. </p> <p> Şu anda oyunlar Microsoft Edge uzantı deposundan kaldırılmıştır. Ayrıca, öykünülmüş oyunların uzantı mağazasında nasıl sona erdiği veya onları oraya kimin koyduğu henüz bilinmiyor. Söylemeye gerek yok, geri dönmeleri pek mümkün değil. </p>"}