{"title":"Microsoft, HPE&#39;nin Spaceborne Computer-2 ile Azure&#39;ı Uzaya Sunuyor","content":"<p> Microsoft, dünya dışı hizmetler sağlamak için gezegenin sınırlarının ötesine ulaşıyor. Şirket, Azure platformu aracılığıyla Uluslararası Uzay İstasyonu (ISS) üzerindeki bir bilgisayara bağlanmak için Hewlett Packard Enterprises ile birlikte çalışacak. </p> <p> Spaceborne Computer-2, NASA ve HPE yer istasyonları aracılığıyla Azure&#39;a bağlanacak ve uzay istasyonuna çok büyük veri işleme gücü sağlayacak. </p> <h2 id=\"azure-heads-into-space\"> Azure Uzaya Gidiyor </h2> <p> Bildirildiği gibi <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Azure Blogu </a> , Spaceborne Computer-2 (SBC-2), ISS astronotlarına karasal muadillerine daha yakın teknolojiler sağlayacaktır. </p> <p> Umut, ISS ile Dünya arasında veri aktarımı için gereken süreyi büyük ölçüde azaltmasının yanı sıra işleme ve analiz için gereken bant genişliği miktarını azaltmasıdır. </p> <blockquote> <p> Astronotlar ve uzay kaşifleri, en iyi bulut bilişim teknolojilerine ve en üst düzeyde gelişmiş işlemeye erişimi hak ediyor. Bazen analiz, her geçen anın önemli olduğu uçta hemen yapılmalıdır ve diğer zamanlarda analiz o kadar karmaşıktır ki, yalnızca hiper ölçekli bulutun gücüyle gerçekleştirilebilir. </p> </blockquote> <p> Spaceborne Computer-2, Hewlett Packard Enterprises&#39;ın &quot;zorlu uç ortamları için özel olarak tasarlanmış&quot; Edgeline Converged Edge sistemini kullanıyor ve ISS&#39;ye çok sayıda Azure işlevselliği getirecek. </p> <p> Bağlantı kurulduğunda SBC-2, gelecekteki Mars misyonları için hava durumu modellemesi, uzayda gıda ve mahsul büyümesini desteklemek için bitki ve hidroponik analiz ve ISS&#39;nin kendisinde tıbbi görüntüleme (astronot sağlık hizmetlerini desteklemek için) dahil olmak üzere alanlarda araştırmalara olanak sağlayacak ). </p> <p> HPE&#39;de Converged Edge Systems Çözüm Mimarı ve Spaceborne Computer-2 Baş Araştırmacısı Dr. Mark Fernandez şunları söyledi: </p> <blockquote> <p> HPE&#39;nin gelişmiş uç bilgi işlem ve AI yetenekleri için HPE Edgeline Converged Edge sistemine dayalı Spaceborne Computer-2&#39;yi buluta bağlanmak için Microsoft Azure ile bir araya getirerek, uzay kaşiflerinin büyük veri kümelerini sorunsuz bir şekilde iletmesine olanak sağlıyoruz Dünya ve uçtan buluta bir deneyimden yararlanın </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> Microsoft&#39;un Azure Uzay Girişiminin Sonraki Aşaması </h2> <p> Microsoft&#39;un duyurusu, onun için ileriye doğru bir başka adımdır. <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Azure Alanı </a> Ekim 2020&#39;de başlattığı girişim. </p> <p> Azure Space girişimi, Microsoft&#39;un Azure bulut bilişim platformunu uzaya taşıyan &quot;bulut bilişimde bir sonraki dev adımı&quot; atma çabasıdır. </p> <p> </p> <p> Azure Space, daha önce Azure Modüler Veri Merkezine (MDC) uydu geniş bant sağlamak için SpaceX Starlink projesiyle birlikte çalıştı ve uydu teknolojisini kullanarak bulut veri merkezleri arasındaki bağlantıyı genişletecek olan Azure Orbital projesi üzerindeki çalışmalarını sürdürüyor. </p>"}