{"title":"Microsoft, Pinterest&#39;i Satın Almaya Çalıştı, Ama Anlaşma Kapandı... Şimdilik","content":"<p> Microsoft kısa süre önce Pinterest&#39;e Redmond&#39;un şimdiye kadarki en büyük satın almalarından biri olabilecek potansiyel bir devralma anlaşması için yaklaştı. Şu anda görüşmeler aktif değil, ancak önerilen birleşmenin ölçeği, Microsoft&#39;un büyüme planlarını daha da belirginleştiriyor. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft, Pinterest&#39;i Satın Almak İstiyor </h2> <p> tarafından bildirildiği gibi <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Finansal Zamanlar </a> , Microsoft, dünyanın en büyük hobi panosu olan Pinterest&#39;i satın almaya çalıştı. </p> <p> Pinterest şu anda yaklaşık 51 milyar dolar değerinde ve COVID-19 salgını boyunca insanlar karantina sırasında internete girdikçe piyasa değeri yüzde 600&#39;den fazla arttı. Muhtemel devralma anlaşması haberleri, 11 Şubat Perşembe günü piyasalar açılmadan önce Pinterest&#39;in hisse senetlerini yüzde 7 artırdı. </p> <p> Bu hareket, Pinterest&#39;i Microsoft&#39;un sürekli büyüyen büyük teknoloji satın almaları istikrarına getirecekti. 2016&#39;da Microsoft, LinkedIn&#39;i 26 milyar dolarlık bir anlaşmayla satın aldı ve ardından 2018&#39;de Github&#39;ı 7.5 milyar dolara satın aldı. </p> <p> Microsoft&#39;un Minecraft&#39;a sahip olduğundan, 2014&#39;te 2,5 milyar dolar satın aldığından ve büyük oyun holding şirketi ZeniMax&#39;in 7,5 milyar dolara devam eden satın alımından bahsetmiyoruz. ZeniMax, Bethesda Softworks, id Software, Alpha Dog Games ve Tango Gameworks gibi oyun stüdyolarının ana şirketidir. </p> <p> Ayrıca, bir <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> TikTok&#39;u satın alma girişimi başarısız oldu </a> 2020&#39;nin ortalarında Kuzey Amerika, Avustralya ve Yeni Zelanda varlıkları. Anlaşma sonunda suya düştü, ancak değeri 20-30 milyar dolar arasındaydı ve eski Başkan&#39;ın ardından geldi. <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Trump yasaklamakla tehdit etti </a> tamamen ABD&#39;den video paylaşım sosyal ağı. </p> <p> Pinterest anlaşması devam etmiş olsaydı veya gerçekten de daha sonraki bir tarihte sonuçlandırılırsa, Microsoft&#39;un bugüne kadarki en büyük satın alımı olacaktır. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> Microsoft Neden Bu Kadar Çok Teknoloji Şirketini Satın Aldı? </h2> <p> Microsoft nakit sıkıntısı çekmiyor ve imparatorluğunu genişletmek istiyor. Kendi hissesi, COVID-19 salgınının başlangıcından bu yana yaklaşık yüzde 80 arttı ve son zamanlarda rekor kıran karlarını açıkladı. </p> <p> </p> <p> Pinterest gibi başka bir platformun satın alınması, Microsoft&#39;un diğer hizmetleri için verilere bir bilettir. LinkedIn gibi platformlar tarafından üretilen çok büyük veri hacmi, AI teknolojilerini eğitmek için mükemmel bir araçtır. Ayrıca, Pinterest gibi muazzam bir çevrimiçi hizmeti üstlenmek ve yönetmek, Azure platformu için bir reklam görevi görür. </p> <p> Financial Times raporunun da ima ettiği gibi, iki teknoloji şirketi arasındaki bu kadar büyük bir birleşmeden bahsetmek, Başkan Biden&#39;ın yönetimini de teste tabi tutacaktır. Yeni yönetim, Microsoft, Google ve Facebook gibi teknoloji devlerinin rekabeti satın almasına izin vermekten mutlu mu? Sadece zaman gösterecek. </p>"}