{"title":"Netflix Kurucu Ortağı Apple TV+ Video Stratejisini Eleştirdi","content":"<p> Eski Netflix şefi Marc Randolph, Apple&#39;ın video stratejisini eleştirdi ve Apple TV+&#39;ın şirketin ücretsiz teklifleri ve ilgi çekici içerik eksikliği nedeniyle rekabetin gerisinde kaldığını söyledi. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple &quot;İki Ayakla&quot; Yayında Değil </h2> <p> Eski Netflix CEO&#39;su ve kurucu ortağı Marc Randolph&#39;a sorarsanız, Apple TV, hizmetin Netflix, Disney+ ve diğer başarılı akış hizmetlerine kıyasla anemik büyümesine katkıda bulunan bir ücretsiz yükleme sorunuyla boğuştu. </p> <p> Ile konuşmak <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Yahoo Finans </a> , Apple TV+&#39;nın promosyonlar ve ücretsiz teklifler için enerjisini boşa harcadığını, ancak değeri artırmak için daha kaliteli içerik eklemeye odaklanması gerektiğini söyledi. </p> <blockquote> <p> Apple, eşantiyonlarda olduğu kadar içeriğe dörtte bir zaman harcasaydı, gerçekten oynayabilirlerdi. Hiçbir mazeretleri yok [ve] hala iki ayağıyla da değiller. Gerçekten girişimcilik işini yapmak ve uçurumun kenarına kadar yürümek ve atlamak zorundalar. </p> </blockquote> <p> Apple TV+, Disney&#39;in pazar gücünden ve Netflix&#39;in marka bilinirliğinden yoksun olduğu için uçurumun kenarından atlamak yapmaktan daha kolay olabilir. Şu anda, her şey hakkında <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney+ ve Netflix </a> ve hangi akış hizmetinin potansiyel müşterilere paranızın karşılığını en iyi şekilde sunduğu. </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV+ En Yüksek Kayıp Oranına Sahip </h2> <p> Randolph, akış pazarındaki eşantiyonlara ve promosyonlara karşı tavır alarak Apple TV+‌&#39;nin başlıca hizmetler arasında &quot;en yüksek kayıp oranına&quot; sahip olduğunu öne sürüyor. </p> <blockquote> <p> İnsanları değiştirmeye devam edemezsin. Onlara kalmaları için bir sebep vermelisin. </p> </blockquote> <p> MoffettNathanson-HarrisX, ücretsiz olarak kaydolanların yüzde 29&#39;unun ücretsiz deneme süreleri sona erdikten sonra yeniden abone olmayı planlamadığını tespit etti. <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> Çeşitlilik </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> Ücretsiz Apple TV+ Fırsatları </h2> <p> Apple, şirketten yeni bir iPhone gibi uygun yeni bir cihaz satın alan herkese 12 aylık ücretsiz Apple TV+ hizmeti sunuyor. Bu arada, <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple, ücretsiz yıllık abonelikleri uzattı </a> 2019&#39;da kaydolanlar için iki kez. </p> <p> </p> <p> Bu, Apple&#39;ın hizmetin aylık 5 ABD doları fiyatını haklı çıkarmak için yeterli içerik sağladığına inanmadığının açık bir işaretidir. Başka bir açıdan bakın: Apple TV+ dahili tahminleri aşmış olsaydı, Apple zaten abone sayılarıyla övünecekti. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney+ ve Netflix Ciddi Bir Rekabet Sağlıyor </h2> <p> Apple TV+, Kasım 2019&#39;da piyasaya çıkalı sadece 15 ay oldu. Bunu kısa süre sonra Disney+ izledi. Apple, Apple TV+&#39;ın ödeme yapan abone sayısını açıklamıyor, ancak Disney 94 milyon aboneyi geçti ve kendi beklentilerini bile aştı. </p> <p> Karşılaştırıldığında, Netflix 2020&#39;nin sonunda 204 milyon ödeme yapan müşteri saydı. Disney, aboneler açısından sadece 12 ay içinde Netflix&#39;le eşleşebileceğini umuyor. </p> <p> </p> <p> Randolph, Disney+&#39;ın içerik sayesinde &quot;gerçekten güçlü bir konuma gelmek için mücadele ettiğini&quot; söylüyor. &quot;Bu gerçekten içeriği kimin hazırlamaya hazır olduğuna dair bir savaş&quot; diye ekledi. </p> <blockquote> <p> Oyunun yeni kurallarının geliştiğini görüyoruz. Bu sadece duyuru yapmak değil, bu sadece bir promosyon yapmak değil --- göstermeniz gereken içerik, içerik, içeriğe sahip olduğunuzu göstermeniz. </p> </blockquote> <p> Aslında, oyun içerikle ilgilidir. Örneğin, ana hatlarıyla belirtildiği gibi <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> 2021 için planları </a> , Netflix yıl boyunca her hafta yeni bir orijinal film yayınlayacak. Buna karşılık, Apple TV+&#39;da Tom Hanks&#39;in oynadığı 2. Dünya Savaşı draması Greyhound (gerçek olaylara dayanan), Justin Timberlake&#39;in oynadığı orijinal drama Palmer ve Sofia Coppola&#39;nın On The Rocks gibi birkaç film bulunuyor. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> Apple&#39;ın Yavaş Yakma Yaklaşımı </h2> <p> Randolph&#39;un kabul etmediği şey, Netflix ve Disney+&#39;ın ilk günden itibaren muazzam miktarda içeriğe sahip olduğu, buna karşın Apple TV+&#39;ın içerik kitaplığını sıfırdan oluşturduğudur. </p> <p> Apple, Disney+ ve Netflix&#39;e göre gösterilerin azlığının kanıtladığı gibi, açıkça yavaş yanan bir yaklaşım seçti. Nereden bakarsanız bakın, Apple TV+ ile stratejisi, hizmetin ücretsiz müşterileri ücretli abonelere dönüştürmek için yeterli kalitede içerik toplaması umuduyla insanları ücretsiz tekliflerle cezbetmeyi gerektiriyor gibi görünüyor. </p>"}