{"title":"Üçüncü Boyuta Girin: Adobe After Effects&#39;te 3B İş Akışlarıyla Çalışma","content":"<p> Adobe After Effects iş akışınızı geliştirmek istiyorsanız, sonunda bir nesnenin 3B derinliğini değiştirmenize olanak tanıyan Z ekseni ile ilgilenmeye başlamanız gerekir. </p> <p> Bu, birlikte çalışmanız için bir dizi yeni görsel ve stil sunar, ancak aynı zamanda kendi sınırlamalarını ve değerlendirmelerini de yaratır. </p> <p> Bu makalede, 3B katmanların nasıl etkinleştirileceğini ve bunlarla çalışılacağını ve ayrıca dinamik hareketler oluşturmak için 3B kameraların nasıl ekleneceğini ve canlandırılacağını ele alacağız. Metni 3B alanda canlandırdığımız ve hareket ettirdiğimiz bir senaryo da incelenecektir. </p> <p> Hadi atlayalım! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> 3D Katmanlar Nasıl Etkinleştirilir ve Hareket ettirilir </h2> <p> Kompozisyonunuz içinde, katmanlarınızı 3B olarak etkinleştirmek için zaman çizelgenizde değiştirebilirsiniz. </p> <p> Bu çok basit bir işlemdir. Basitçe bulun <strong> Küp </strong> zaman çizelgenizdeki katmanlarınız için simgeyi seçin ve o katman için 3B&#39;yi etkinleştirmek için altındaki kutuyu tıklayın. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> Bu yapıldıktan sonra, büyük olasılıkla herhangi bir ani değişiklik görmeyeceksiniz. Ancak, katmanınızdaki konum, ölçek ve döndürme parametrelerinize giderseniz, üçüncü bir ayarlanabilir sayı kümesinin göründüğünü görürsünüz. </p> <p> Bu yeni sayılar artık 3B alanda Z ekseninde dönüşünüzü, konumunuzu ve ölçeğinizi belirler. Tıpkı diğer parametrelerinizde olduğu gibi, animasyon ve manipülasyona izin vermek için ana kareler olabilirler. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> Örnek olarak, bazı kelimelerle bir kompozisyon ve bir metin katmanı oluşturalım. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Bu yapıldıktan sonra, 3B katmanı etkinleştirin. kullanmayı planlıyorsanız unutmayın. <strong> hizala </strong> aracı, katmanınızın mükemmel şekilde ortalanmasını sağlamak için kullanırsanız, bunu 3D&#39;yi etkinleştirmeden önce yapmanız gerekir. Bunun nedeni, <strong> hizala </strong> araç yalnızca 2B katmanlarda çalışır. </p> <p> Artık metin katmanımız bir 3B katman olduğuna göre, onu 3B uzayda Z Ekseni boyunca hareket ettirebiliriz. Öyleyse metnin &quot;ekrana doğru&quot; hareket etmesini sağlayalım. </p> <p> İlk önce Z-Ekseni parametremizi ayarlayacağız. Varsayılan olarak, sıfıra ayarlanmıştır. hadi ayarla <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Şimdi, zaman çizelgemizde iki saniye aşağı ineceğiz ve Z ekseni değerimizi <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> Bu değişiklikle artık metnin ekrana &quot;doğru&quot; hareket ettiğini görmeliyiz. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> 3D Kameralar Nelerdir? </h2> <p> After Effects&#39;te 3B alanda bir nesneyi başarıyla canlandırdık. Peki ya birden fazla nesneniz varsa ve izleyicinin onlara doğru veya onlardan uzaklaştığı hissi yaratmak istiyorsanız? </p> <p> Size doğru hareket etmesi için her bir öğeyi basitçe canlandırabilirsiniz, ancak bu oldukça zaman alıcı olur ve özellikle verimli olmaz. Burası bir 3D kamera kullanacağınız yer. </p> <p> </p> <p> Cinema 4D veya Blender gibi 3D yazılım kullanıyorsanız, muhtemelen daha önce 3D kamera kullanmışsınızdır. Daha önce bir bilgisayar oyunu oynadıysanız, görüşünüzü 3B bir dünyada hareket ettiren bir 3B kamera da deneyimlemişsinizdir. </p> <p> Bunların hepsi ilk başta karmaşık görünebilir, ancak 3D kameralar tıpkı gerçek bir kamera gibi çalışır. Size 3 boyutlu bir alanda manipüle edilebilecek ve hareket ettirilebilecek bir görüş alanı sağlarlar. </p> <p> Bir örnek üzerinde çalışalım. </p> <h3 id=\"setting-up-a-3d-camera\"> 3D Kamera Ayarlama </h3> <p> Başlamak için birkaç 3B metin katmanı oluşturun ve bunları Z Ekseni boyunca sıralı olarak konumlandırın. </p> <p> Bu örnekte, bir boşluk <strong> 3.000 piksel </strong> Her katman arasında kullanılmıştır. İlk katman sıfırda, sonraki katman 3.000&#39;de, sonraki katman 6.000&#39;de vb. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Şimdi, tıklayarak bir 3D kamera oluşturma zamanı <strong> Katman </strong> &gt; <strong> Yeni </strong> &gt; <strong> Kamera </strong> , üzerine yeni kamera katmanınız için ayarları yapmak için bir pencere göreceksiniz. Bunlar iki tipte gelir: <strong> Bir Düğüm </strong> ve <strong> İki Düğüm </strong> . </p> <p> <strong> Tek Düğüm </strong> kamera, gerçek dünyadaki bir kamerayı mümkün olduğunca yakından çalıştırmak ve taklit etmek için tasarlanmıştır ve odak noktası kameranın hareketi ile manuel olarak belirlenir. </p> <p> bir <strong> İki Düğümlü </strong> kamera tek bir ilgi noktasını takip edecek şekilde tasarlanmıştır, bu da onu hareket halindeki bir nesneyi yörüngede döndürmek veya takip etmek için ideal hale getirir. </p> <p> Bu senaryoda, <strong> Tek Düğüm </strong> kamera kullanılacaktır. Pencerede aşağıdakiler gibi bir dizi ek ayar fark edeceksiniz. <strong> yakınlaştır </strong> , <strong> Bakış açısı </strong> , <strong> Alan Derinliğini Etkinleştir </strong> , ve <strong> Odak uzaklığı </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Bunlar, gerçek dünyadaki kamera ayarlarını yansıtmak için tasarlanmıştır. Bunların nasıl çalıştığı konusunda bilgiliyseniz, onlarla oynamaktan çekinmeyin. Değilse, sağ üst köşede bir dizi ön ayar seçebilirsiniz. </p> <p> seçeceğiz <strong> 35 mm </strong> şimdilik önceden ayarlanmış. Artık kamera katmanımız kurulduğuna ve sahnede, ilk başta pek bir fark görmeyeceksiniz. </p> <h3 id=\"using-3d-camera-navigation\"> 3D Kamera Navigasyonunu Kullanma </h3> <p> Kameranın görünümünü ayarlayabileceğiniz ve canlandırabileceğiniz iki yöntem vardır. En doğru olanı, farklı giriş yapmaktır. <strong> Durum </strong> içindeki değerler <strong> dönüştürmek </strong> kamera katmanı için ayarlar. Ardından, başka bir katmanı canlandırırken yaptığınız gibi animasyon karesi oluşturabilirsiniz. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> Kamerayı hareket ettirdikçe, sahnenizdeki diğer tüm 3B nesnelerin ona göre hareket edeceğini fark edeceksiniz. Dikkat edin, kamera <strong> 2B katmanları etkilemez </strong> . </p> <p> Öyleyse, kameramızı dört saniyelik bir aralıkta Z ekseninde sıfırdan 9.000&#39;e hareket edecek şekilde ayarlayalım ve hareketimizi ana kareye koyalım. </p> <p> İşte aldın! Doğru şekilde ayarladıysanız, kelimeler size &quot;doğru&quot;, görüş alanından &quot;geçmeli&quot; ve izleyicinin &quot;arkasına&quot; gelmelidir. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> 3D Kamerayı Taşımanın Diğer Yolları </h3> <p> Kameranızla biraz daha deneysel ve daha az sayı odaklı olmayı tercih ediyorsanız, hareket etmek, gezinmek ve ayarlamak için başka yollar da vardır. <strong> yörünge </strong> , <strong> Tava </strong> , ve <strong> bebek </strong> araç çubuğunun üst kısmındaki araçlar bunu yapmanızı sağlar. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> Bunları kullanarak, bir yandan diğer yana hareket etmek için tıklayıp sürükleyebilirsiniz ( <strong> Tava) </strong> , etrafında dön ( <strong> yörünge </strong> ) ve yakınlaştırıp uzaklaştırın ( <strong> bebek </strong> ). Bu kontroller, sayıları girmekten daha az doğrudur, ancak kaba kamera hareketlerinizi ve animasyonlarınızı planlamak için mükemmeldir. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> Uygulama Mükemmelliğe Yol Açar </h2> <p> Artık Z ekseni boyunca 3B katmanlar oluşturup canlandırabilmeli ve ayrıca birden fazla 3B nesneyle gezinmek için 3B kameralarla çalışabilmelisiniz. </p> <p> Bir 3B alanda çalışmaktan hoşlanıyorsanız, Blender gibi daha özel bir 3B yazılım parçasının sunabileceği daha gelişmiş olanakları keşfetmek isteyebilirsiniz. </p>"}