{"title":"PS5&#39;te Oyun Süresi İstatistiklerinizi Nasıl Görebilirsiniz?","content":"<p> Oyun oynamak için ne kadar zaman harcadığınızı görmekten hoşlanıyorsanız, PS5&#39;in sizin için gizli ama kullanışlı bir özelliği var. Sistemde oyun oynamak için ne kadar zaman harcadığınızı takip eder. </p> <p> PlayStation 5 oyunlarını oynamak için ne kadar zaman harcadığınızı nasıl kontrol edeceğiniz aşağıda açıklanmıştır. Hangisi sizi teşvik edebilir <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> PS5&#39;inizi kapatın </a> daha sık. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> PlayStation 5&#39;te Oyun Süresi İstatistiklerinizi Nasıl Kontrol Edebilirsiniz? </h2> <p> PS5&#39;inizin ana ekranında sağ üstteki profil simgenizi seçin. basabilirsin <strong> Üçgen </strong> Seçimi ekranın o alanına hızlı bir şekilde taşımak için Bu menüyü açtıktan sonra, <strong> Profil </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Şimdi, geçiş yapın <strong> Oyunlar </strong> sekme. Burada PlayStation hesabınızda oynadığınız tüm oyunları göreceksiniz. Her biri oyunu en son ne zaman oynadığınızı ve toplam oyun saatlerinizi gösterir. Ancak dakikası için doğru değil. Oynatma süresinin saate yuvarlandığını göreceksiniz. </p> <p> PS5&#39;te oynamamış olsanız bile burada PS4 oyunlarınızın oynatma süresini göreceksiniz. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> Bildiğimiz kadarıyla bu oyun süresi, yalnızca aktif olarak oynadığınız zamanı değil, oyunun çalıştığı tüm zamanları içerir. Bu, bir telefon görüşmesi yaparken veya bir şeyler yemek yerken oyunu duraklatma menüsünde bırakırsanız, o süre toplama dahil edilecektir. Bu yüzden süper doğru olmayabilir, ancak en azından size her bir başlığı ne kadar süre oynadığınız hakkında bir fikir verecektir. </p> <p> </p> <p> Merak ediyorsanız, arkadaşlarınızın oyun süresi istatistiklerini de görebilirsiniz. seçin <strong> Arkadaşlar </strong> sekmesine gidin ve hakkında daha fazla bilgi edinmek istediğiniz arkadaşınızı seçin. Bu size aynı menüde oyunlarında ne kadar zaman harcadıklarını gösterecektir. </p> <p> Oynatma süresi bilgilerinizin diğer oyuncular tarafından görünmesini istemiyorsanız, sağa kaydırın ve <strong> Gizlilik ayarları </strong> . Bu menüde, altında <strong> aktiviteniz </strong> bölümünde, seçeneğini değiştirin <strong> Oyun geçmişinizi kimler görebilir? </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Bazı Oyunlar Kendi Oynama Sürelerini de İzler </h2> <p> Bunun gibi verilerle ilgileniyorsanız, favori oyunlarınızı açtığınızdan emin olun ve oynamak için ne kadar zaman harcadığınızı takip edip etmediklerini görün. Çok sayıda başlık, kaydetme dosyanızdaki, duraklatma menüsündeki veya benzerlerindeki toplam oynatma süresini içerir. </p> <p> Bu, oyunlar arasında tutarlı olmasa ve duraklatıldığında harcanan süreyi içerebilir veya içermeyebilir, ancak daha fazla bilgi edinmek istediğiniz bir oyun hakkında size daha fazla fikir verebilir. Overwatch gibi bazı çevrimiçi oyunlar, modlar arasında her bir kahramanla geçirdiğiniz zamanı bile takip eder. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Gerçekten Ne Kadar Oynadığınızı Görün </h2> <p> PS5, oyun oynamak için ne kadar zaman harcadığınızı görmeyi kolaylaştırır. PS4 bu verileri kolayca erişilebilir hale getirmediği için küçük ama çok takdir edilen bir özellik. </p> <p> Bu arada, oyununuzu konsolun dışında da yönetmenin daha fazla yolu var. </p> <p> <small> Resim Kredisi: LightField Stüdyoları/ <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}