{"title":"Parler, Bir Aylık Kapatmanın Ardından Tekrar Çevrimiçi Oldu","content":"<p> Parler, Big Tech tarafından kapatıldıktan sonra nihayet web&#39;de yeniden ortaya çıktı. &quot;Konuşma özgürlüğü&quot; platformuna artık mevcut kullanıcılar erişebiliyor ve önümüzdeki haftalarda yeni kullanıcı kayıtlarını kabul etmeye başlayacak. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler, Büyük Teknoloji Karartmasının Ardından Yeniden Ortaya Çıkıyor </h2> <p> Parler, uzun bir elektrik kesintisinin ardından geri döndü. Alternatif sosyal ağ, siyasi muhafazakarlar arasında çekiş kazanıyor ve <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> Amazon Web Services (AWS), Google ve Apple tarafından başlatıldı </a> Capitol isyanlarından sonra. Parler, şiddet içerikli içeriği denetlemek için yeterince çaba göstermemekle suçlandı ve bunun sonucunda bu içerik uygulama mağazalarından ve web&#39;den kaldırıldı. </p> <p> AWS yerine, Parler artık SkySilk adlı bir ana bilgisayar kullanıyor. Site ayrıca alan adını Gab gibi diğer &quot;özgür konuşma&quot; ağlarına hizmet veren bir kayıt şirketi olan Epik&#39;e kaydetti. </p> <p> Parler&#39;ın yaptığı tek değişiklik yeni bir ana makine ve etki alanı kayıt şirketi değil; Parler, yeni bir geçici CEO ile yeniden bir araya geldi. Bu sonra gelir <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> Parler ekibinin, kurucu ortak John Matze&#39;yi kovduğu iddia edildi </a> . </p> <p> Mark Meckler, geçici olarak Matze&#39;nin CEO olarak yerini alacak ve daha önce sağcı Tea Party Patriots grubunun kurucu ortağı olacak. tarafından elde edilen bir açıklamada <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> Tepe </a> , Meckler, Parler&#39;ın uzun zamandır beklenen dönüşünü duyurdu ve şunları söyledi: </p> <blockquote> <p> Parler, on milyonlarca Amerikalıyı susturmak isteyenler tarafından Ocak ayında çevrimdışına alındığında, ekibimiz bir araya geldi ve son derece bağlı topluluğumuza her zamankinden daha güçlü döneceğimize dair sözümüzü tutmaya karar verdi. Herkesi tekrar ağırlamaktan heyecan duyuyoruz. </p> </blockquote> <p> Meckler sözlerine devam ederek, Parler&#39;ın &quot;ifade özgürlüğü, mahremiyet ve medeni diyaloga&quot; bağlı kalacağını belirtti. Ayrıca kullanıcılara &quot;Parler&#39;ın deneyimli bir ekip tarafından yönetildiği ve burada kalacağına&quot; dair güvence verdi. </p> <p> Platformdaki eski hesaplar yedeklenmiş olsa da, eski gönderiler (veya &quot;görüşmeler&quot;) geri yüklenmedi. Parler&#39;da zaten bir hesabınız varsa, siteyi kullanmaya devam edebilirsiniz. Aksi takdirde, kaydolmak için yaklaşık bir hafta beklemeniz gerekecek. </p> <p> Ancak halihazırda bir Parler hesabınız olsa bile platformu kullanırken bazı teknik zorluklarla karşılaşabilirsiniz. Hizmet henüz tam olarak geri yüklenmemiş gibi görünüyor. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> Parler Uygulaması Hala Limbo&#39;da Kalıyor </h2> <p> Parler, kullanıcı tabanına ciddi şekilde zarar verebilecek Google Play Store ve Apple App Store&#39;dan hala yasaklanmıştır. Halihazırda platform, bilinmeyen bir süre boyunca mobil cihazlarda kullanılamayabilir. </p> <p> Denetleme politikalarını değiştirmediği sürece büyük olasılıkla Play Store veya App Store&#39;a geri dönemeyecektir. Bu, Parler&#39;ın büyük olasılıkla reddedeceği bir şeydir. </p>"}