{"title":"PS4 Denetleyici Çalışmıyor mu? En Sık Karşılaşılan Sorunlar Nasıl Düzeltilir","content":"<p> Çoğu zaman, PlayStation 4 kontrol cihazınız muhtemelen iyi çalışıyor. Ancak DualShock 4&#39;ünüz rastgele bağlanmayı bıraktığında veya bağlantısı kesildiğinde sinir bozucu oluyor. </p> <p> Oynamaya geri dönebilmeniz için PS4 denetleyicinizin çalışmadığı zamanlar için düzeltmelere bakalım. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> PS4 Denetleyici Eşleşmiyor veya Bağlanmıyor </h2> <p> Normalde, düğmesine bastığınızda <strong> PS Düğmesi </strong> denetleyicinizde, açılmalı ve sisteminize bağlanmalıdır. Ancak, bağlanmadığında, bunun yerine kontrol cihazınızdaki ışık çubuğunun bir süre yanıp söndüğünü ve ardından kapandığını göreceksiniz. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Bu genellikle DualShock 4&#39;ünüzü başka bir cihazla kullandıysanız olur. Örneğin, eğer <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> PS4 denetleyicinizi PC&#39;nizle eşleştirin </a> veya bir arkadaşınızın konsolu, o cihazı ileriye doğru hatırlayacaktır. </p> <p> Bu durumlarda DualShock 4&#39;ünüzü kendi PS4&#39;ünüzle yeniden eşleştirmeniz gerekir. Bunu yapmak için kontrol cihazınızı bir mikro USB kablosu kullanarak PS4&#39;ünüze bağlayın. Düzgün çalıştığını bildiğiniz yüksek kaliteli bir kablo kullandığınızdan emin olun. </p> <p> </p> <p> basın <strong> PS Düğmesi </strong> bir an için kumandanızda ve ışık maviye dönmeden önce kısa bir süre yanıp sönmelidir. Bu, kontrol cihazınızın başarıyla eşlendiğini ve bağlandığını gösterir. </p> <p> DualShock 4&#39;ünüzü telefonunuz veya PlayStation 5 gibi yakındaki başka bir cihazla eşleştirdiyseniz, bunu yapmak büyük olasılıkla açılır ve kumandayı o cihaza bağlar. Bu nedenle, önce DualShock 4&#39;ünüzün bağlı olduğu cihazı kapatmalı ve fişini çekmelisiniz. </p> <p> Denetleyicinizi yeniden eşleştirdikten sonra, USB kablosunu çıkarabilir ve denetleyicinizi normal şekilde kablosuz olarak kullanabilirsiniz. PS4&#39;ünüz, gelecekte denetleyiciyi başka bir cihazla eşleştirene kadar bunu hatırlayacaktır. </p> <p> PS4&#39;e aynı anda bağlayabileceğiniz maksimum DualShock 4 denetleyici sayısının dört olduğunu unutmayın. Zaten bağlı dört denetleyiciniz varsa, daha fazlasına yer açmak için birinin bağlantısını kesmeniz gerekir. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> PS4 Denetleyici Sürekli Bağlantıyı Kesiyor </h2> <p> DualShock 4&#39;ünüzün bağlantısı oynarken rastgele kopuyorsa deneyebileceğiniz birkaç çözüm vardır. </p> <p> İlk olarak, kontrol cihazınızın pilinin dolu olduğundan emin olun. Kulağa basit geliyor, ancak kontrol cihazınızdaki pil neredeyse bitmişse bağlantısı kesilebilir. Kumandanızın pil ömrünü kontrol etmek için, <strong> PS Düğmesi </strong> Ekranın sol tarafında Hızlı Menüyü getirmek için Altta pil ekranlı bir denetleyici simgesi göreceksiniz. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Kontrol cihazınızı PS4&#39;ünüze takın ve pil şarj animasyonunu gördüğünüzden emin olmak için Hızlı Menü&#39;yü tekrar ziyaret edin. Kontrol cihazınız bir süre şarj olduktan sonra normal şekilde kullanmayı deneyin. </p> <p> Sorununuz pil değilse, kontrol cihazınızı sisteminizden çok uzakta kullanmaya çalışmadığınızdan emin olun. Tipik Bluetooth menzili yaklaşık 30 fittir; kurulumunuza bağlı olarak, kontrol cihazınızı bundan daha fazla kullanabilir veya daha yakın kullanmakla sınırlandırılmış olabilirsiniz. </p> <p> Bundan bahsetmişken, denetleyiciniz ve konsolunuz arasındaki paraziti en aza indirmeye çalışmalısınız. Sinyali engelleyebilecek raflar veya dizüstü bilgisayarlar gibi ikisi arasındaki metal nesneleri kaldırın. Ayrıca daha iyi sinyal iletimi ve alımı için PS4&#39;ünüzü içinde bulunduğu herhangi bir kapalı alandan çıkarmalısınız. </p> <p> Son olarak, PS4&#39;ün bir süre boşta kaldıktan sonra denetleyicileri kapatan bir ayarı olduğunu unutmayın. YouTube gibi medya uygulamalarını izlerken PS4 kumandanızın kapanmasını istemiyorsanız, şuraya gidin: <strong> Ayarlar &gt; Güç Tasarrufu Ayarları &gt; Denetleyiciler Kapanana Kadar Süreyi Ayarla </strong> ve Seç <strong> Asla </strong> . Bunun, siz boştayken bile pili tüketeceğini unutmayın. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> PlayStation 4 Kontrol Cihazını Düzeltmek İçin Genel İpuçları </h2> <p> Yukarıda birkaç yaygın DualShock 4 sorunu için belirli düzeltmelere baktık. Ardından, PS4 denetleyicileriyle ilgili sorunlara yönelik daha genel çözümlere bakalım. Daha fazla yardıma ihtiyacınız varsa bunları gözden geçirin. </p> <h3 id=\"restart-your-console\"> 1. Konsolunuzu Yeniden Başlatın </h3> <p> Denetleyici sorunlarının çoğu denetleyicinin kendisinden kaynaklansa da, sorunu yaşayanın PS4&#39;ünüzde olma ihtimali vardır. Bunu ekarte etmek için, daha fazla sorun gidermeden önce konsolunuzu yeniden başlatmalısınız. </p> <p> Kontrol cihazınız menülere erişmek için yeterince çalışıyorsa, <strong> PS Düğmesi </strong> Hızlı Menüyü açmak için, ardından <strong> Güç &gt; PS4&#39;ü yeniden başlatın </strong> sisteminizi yeniden başlatmak için. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> Kumandanızın işbirliği yapmaması durumunda, tuşuna basın ve basılı tutun. <strong> Güç </strong> iki bip sesi duyana kadar PS4 konsolunuzdaki düğmesine basın. Bu, cihazı tamamen kapatacaktır (önde ışık yoktur) - kapandığında, düğmesine basın. <strong> Güç </strong> tekrar açmak için düğmesine tekrar basın. </p> <p> Yeniden başlattıktan sonra denetleyicinizi tekrar kullanmayı deneyin ve bunun yardımcı olup olmadığına bakın. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. PS4 Denetleyicinizi Unutun ve Yeniden Eşleştirin </h3> <p> İkinci bir PS4 denetleyiciniz (veya bir PS Move denetleyiciniz) varsa, sorunu olan denetleyiciyi kaldırmanıza izin veren bir menüye erişmek için bunu kullanabilirsiniz. Başlamak <strong> Ayarlar &gt; Cihazlar &gt; Bluetooth Cihazları </strong> ve seçin <strong> DualShock 4 </strong> giriş—yanında yeşil ışık olmayan giriş. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> Çıkan menüde, düğmesine basın. <strong> Seçenekler </strong> kumandanızdaki düğmesine basın ve seçin <strong> Cihazı Unut </strong> . Bu, PS4&#39;ünüzün onu bellekten kaldırmasına neden olur, böylece yeniden eşleştirmeniz gerekir. </p> <p> Bu, biraz farklı bir eşleştirme yöntemini denemek için iyi bir zamandır: başlangıçta yeniden eşleştirmesini sağlamak. Bunu yapmak için PS4&#39;ünüzü kapatın (daha önce açıklandığı gibi). Kapatıldıktan sonra, sorunlu denetleyiciyi bir USB kablosuyla konsolunuza bağlayın. I vur <strong> PS Düğmesi </strong> Denetleyicinizi tek bir işlemde açmayı ve eşleştirmeyi umuyoruz. </p> <p> Bu işe yaramazsa, PS4&#39;ünüzü tekrar açın ve yukarıdaki gibi normal şekilde eşleştirmeyi deneyin. </p> <h3 id=\"hard-reset-your-controller\"> 3. Denetleyicinizi Sert Sıfırlayın </h3> <p> Denetleyiciyi çıkarmak ve yeniden eşleştirmek işe yaramadıysa, daha sonra DualShock 4 için tam sıfırlama prosedürünü deneyebilirsiniz. Bunu yapmak için bükülmüş bir ataş veya bir SIM kart çıkarma aracı gibi küçük sivri uçlu bir nesneye ihtiyacınız olacaktır. . </p> <p> PS4&#39;ünüzü kapatın, ardından kontrol cihazınızı ters çevirin. L2 düğmesinin yanındaki vidanın yanında küçük bir delik göreceksiniz (ters çevrildiğinde kumandanın sağ tarafında). Bu deliğin içindeki düğmeyi yaklaşık beş saniye basılı tutmak için sivri uçlu aletinizi kullanın. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> Bunu yaptıktan sonra, kontrol cihazınızı USB kablosuyla tekrar PS4&#39;ünüze bağlayın ve başarılı bir şekilde eşleşip eşleşmediğine bakın. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Denetleyiciyi Başka Bir Yerde Deneyin </h3> <p> Bu noktada, henüz yapmadıysanız, başka bir cihazda sorun yaşayan denetleyiciyi kullanmayı denemelisiniz. Bir arkadaşınızın PS4&#39;ünde veya PC&#39;nizde benzer sorunlar yaşıyorsanız, kumandanız büyük olasılıkla arızalıdır. </p> <p> Mümkünse konsolunuzla başka bir PS4 denetleyicisi denemek de iyi bir fikirdir. Düzgün çalıştığını bildiğiniz bir arkadaşınızın DualShock 4&#39;ünü ödünç alırsanız ve sisteminizde sorun olduğunu fark ederseniz, muhtemelen PS4&#39;ünüzün kablosuz bağlantısında bir sorun vardır. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Denetleyiciyi Kablolu Modda Kullanın </h3> <p> Denetleyiciden vazgeçmeden önce, bir USB kablosuyla kalıcı olarak bağlıyken oynamayı denemelisiniz. Ancak bunun yalnızca gözden geçirilmiş PS4 denetleyicileri modeli için geçerli olduğunu unutmayın. Kontrol cihazınızın önündeki dokunmatik yüzeyin içinde bir ışık çubuğu varsa, bu modele sahip olduğunuzu anlayacaksınız. Değilse, kablolu iletişimi zorlayamazsınız. </p> <p> Henüz sahip değilseniz, uzun bir kablo satın alın, böylece koltukta oyun oynamanın keyfini çıkarabilirsiniz. <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Ailun üçlü paket </a> 10 fitlik mikro USB kabloları, uygun maliyetli iyi bir seçenektir. </p> <p> PS4&#39;ünüzü kontrol cihazlarını USB üzerinden bağlamaya zorlamak için şuraya gidin: <strong> Ayarlar &gt; Cihazlar &gt; Denetleyiciler &gt; İletişim Yöntemi </strong> ve Seç <strong> USB Kablosunu Kullan </strong> . Bu, DualShock 4&#39;ün USB üzerinden bağlansa bile Bluetooth kullanmasını önleyecektir. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> DualShock 4 Donanım Düzeltme Seçenekleri </h2> <p> Çoğu donanım gibi, DualShock 4 kontrol cihazlarının da bir yıllık garantisi vardır. PS4 denetleyicinizi geçen yıl içinde satın aldıysanız ve yukarıdaki tüm ipuçlarıyla düzeltemezseniz, şu adresi ziyaret etmelisiniz: <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation&#39;ın Onar ve Değiştir sayfası </a> kontrol cihazınıza onarım talebinde bulunmak için. </p> <p> Aksi takdirde, denetleyicinizi açarak donanım düzeltmelerini kendi başınıza deneyebilirsiniz. Ancak belirli konuya bağlı olarak, bu zor veya imkansız olabilir. Bunu kendiniz yapmak konusunda kendinizi rahat hissetmiyorsanız, yerel bir onarım teknisyeni ile konuşmanızı öneririz. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> PS4 Denetleyici Sorunları, Yamalı </h2> <p> Artık en yaygın PS4 denetleyici sorunlarını nasıl çözeceğinizi biliyorsunuz. Çalışmayı durduran bir düğme gibi daha spesifik sorunlar maalesef yukarıda belirtilen donanım düzeltme çözümlerinin kapsamına girer. </p> <p> Umarım sorununuz kolay çözülmüştür. Ancak değilse ve yeni bir PS4 denetleyicisi almanız gerekiyorsa, birçok harika seçeneğiniz var. </p> <p> <small> Resim Kredisi: Joeri Mostmans / <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}