{"title":"PS5&#39;inizi Dikeyden Yataya Nasıl Çevirirsiniz (veya Tam tersi)","content":"<p> PlayStation 5, dikey veya yatay kurulumda çalışır. Tercih ettiğiniz yön konusunda fikrinizi değiştirirseniz, PS5&#39;inizi dikeyden yataya (veya tam tersi) taşımak oldukça kolaydır. </p> <p> PS5&#39;inizi dikey bir yönelimden yan tarafında yatay konuma nasıl güvenli bir şekilde taşıyacağınıza ve tekrar geriye doğru nasıl hareket ettireceğinize bakalım. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> İlk: PS5&#39;inizi Kapatın ve Fişini Çıkarın </h2> <p> PlayStation 5&#39;inizi fiziksel olarak hareket ettirmek için herhangi bir iş yapmadan önce, onu kapatmanız ve her şeyin fişini çekmeniz önemlidir. Bu, açıkken hareket ettirirseniz oluşabilecek sisteme zarar gelmesini önleyecektir. </p> <p> PS5&#39;inizi tamamen kapatmalısınız. Bunu yapmak için, <strong> PS Düğmesi </strong> Ekranın altındaki hızlı menüyü getirmek için kumandanızda. Seç <strong> Güç </strong> sağda ve seç <strong> PS5&#39;i Kapatın </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Konsolunuzun ışıkları kapanana kadar bekleyin, ardından güç kablosunu, HDMI kablosunu ve sisteme bağladığınız diğer her şeyi çıkarın. Artık PS5&#39;inizin yönünü değiştirmeye hazırsınız. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Stand Vidasını Çıkarın </h2> <p> PS5&#39;inizi dikey olarak kurduğunuzda, tabandaki bir bölmeden ürünle birlikte verilen bir vidayı çıkarmanız ve dikey olarak oturduğunda tabanı konsola sabitlemek için kullanmanız gerekiyordu. Sonuç olarak, bu vidayı çıkarmak, konsolunuzun yönünü değiştirmek için ilk adımınızdır. </p> <p> Alttaki standa erişebilmek için PS5&#39;inizi yavaşça yan çevirin. Tabanı sisteme tutan tek gümüş vidayı çıkarmak için düz uçlu bir tornavida, madeni para veya benzerini kullanın. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Vida gevşediğinde, taban serbest kalacaktır. Tabanda vidayı koyabileceğiniz küçük bir bölme var. Oradaki yerine oturtun, ardından sabitlemek için küçük deliğe kaydırın. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> Ayrıca bu bölmede küçük bir siyah tıpa bulacaksınız (ilk kurulum sırasında oraya koyduğunuz sürece). Bu durdurucuyu çıkarın ve vidayı çıkardığınız PS5&#39;in altındaki deliği kapatmak için kullanın. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Tabanı Döndür </h2> <p> Şimdi, tabanı döndürmek isteyeceksiniz, böylece yatay yönde konsola sığacak. Bu aynı zamanda vidayı yerleştirdiğiniz küçük bölmeyi de kapatarak daha fazla sabitler. </p> <p> Tabana yukarıdan bakarken döndürmelisiniz (vidayı az önce yerleştirdiğiniz yerin tersi). Standın yükseltilmiş kısmını &quot;kuzey&quot; olarak değerlendirirseniz, aşağıda gösterildiği gibi standın dış parçasını &quot;kuzeybatıya&quot; döndürmeniz gerekir. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Bu, standı yatay olarak kullanmak için doğru yöndür. Doğru noktaya getirdiğinizde tıklayacak ve yavaşça duracaktır. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Standı Yatay Pozisyonda Takın </h2> <p> Artık standı yatay olarak otururken PS5&#39;inize bağlayabilirsiniz. Sistemin doğru şekilde oturduğundan emin olun --- PS logosu yukarı bakmalıdır. </p> <p> Sisteminizin arkasında, iki USB bağlantı noktasının altında ve yakınında, konsolda basılmış bazı PlayStation denetleyici sembollerini göreceksiniz. Tabanın (az önce döndürdüğünüz) dış kollarını, bu desenin her iki tarafta bittiği yerin etrafındaki sisteme kaydırın. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Klipsleri sabitlemek için itin, ancak bu konumda standın tam olarak yerine oturmadığını (dikey olarak yerleştirildiğinde vidada olduğu gibi) unutmayın. Sistemi yere bırakırken nazik olun ve çekerseniz ayağın kayabileceğini unutmayın. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Artık PS5&#39;inizi yatay yönde kullanmaya hazırsınız. Tüm kabloları tekrar takın ve oynamaya geri dönmek için çalıştırın. Standart PS5&#39;iniz varsa, diskleri bu yönde yüzleri yukarı bakacak şekilde yerleştirirsiniz. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> PS5&#39;inizi Yataydan Dikeye Nasıl Değiştirirsiniz? </h2> <p> PS5&#39;iniz için dikey bir oryantasyona geri dönmek mi istiyorsunuz, yoksa belki PS5&#39;inizi başlangıçta yatay biçimde kurdunuz ve şimdi dikey gitmek mi istiyorsunuz? Her iki durumda da, yukarıdaki işlemi ters sırayla yapmak kolaydır. Şu anda açıksa veya Dinlenme modundaysa, önce PS5&#39;inizi kapattığınızdan ve fişini çektiğinizden emin olun. </p> <p> </p> <p> Dikey yönlendirmeye geçmek için önce PS5&#39;inizi kaldırın ve ayaklığı sistemden yavaşça çekerek çıkarın. Ardından, tabanın dış kolunu döndürmelisiniz. Üstten bakıldığında, kol, yükseltilmiş kısım ile aynı hizada &quot;kuzey&quot; olmalıdır. Nazik tıklamayı hissettiğinizden emin olun, böylece doğru yerde olduğunu bilirsiniz. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> PS5&#39;inizi tabana erişebilecek şekilde konumlandırın, ardından ortadaki delikten siyah durdurucuyu çıkarın; kabaca havalandırma deliklerinin ortasında bulunur. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Bu siyah durdurucuyu, tabanın alt tarafındaki bölmedeki küçük deliğin içine yerleştirin. Stoper tam yerine oturmalıdır. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> Ardından, tabandaki aynı bölmedeki vidayı çıkarın. Şimdi, standı uygun konuma takmanız gerekecek. Bunu yapmak için, aşağıda gösterildiği gibi konsolun arkası yukarı bakacak şekilde PS5&#39;inizi yukarı kaldırın. </p> <p> Standı alın ve vida deliği, durdurucuyu az önce çıkardığınız vida deliği ile aynı hizaya gelecek şekilde yerleştirin. Klipsleri, sisteminizin arkasındaki tabanın kolundaki güç konektörünün altına yerleştirin. Stand kolayca hizalanmalıdır. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Şimdi vidayı sıkmak için bir tornavida veya benzeri bir alet kullanın. İşiniz bittiğinde ve stand sıkıca takıldığında, PS5&#39;inizi dikey olarak kullanmaya hazırsınız demektir. İşi tamamlamak için tüm kabloları tekrar takın. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> PS5&#39;inizi Dikey mi yoksa Yatay Olarak mı Durdurmalısınız? </h2> <p> Sony, PS5&#39;inizi hem dikey hem de yatay olarak kullanmayı destekler, bu nedenle sisteminiz yeterli hava akışı sağladığı sürece bunu yapmanın doğru veya yanlış bir yolu yoktur. Hangi yönü kullanmanız gerektiği ihtiyaçlarınıza bağlıdır. </p> <p> </p> <p> Çok fazla alanınız varsa ve PS5&#39;in çok fazla yatay alan kaplamasına aldırış etmiyorsanız, yatay görünüm şıktır. Standart PS5 modeline sahip olanlar için, etiketin her zaman yukarı bakması gerektiğinden, diskleri yerleştirme işlemini de biraz daha kolaylaştırır. Disk etiketinin sola bakması gereken dikey yönlendirme ile bunu hatırlamak biraz daha zordur. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> Ancak, eğlence sisteminizin içinde yatay kuruluma uyum sağlayacak alanınız olmayabilir. Bu durumlarda, dikey gitmek en iyi seçeneğinizdir. PS5 her iki durumda da büyük bir konsol, ancak dikey olarak yerleştirildiğinde TV standınızın veya benzerinin yanına güzel bir şekilde oturuyor. Aşağıdaki resimde gösterildiği gibi kullandığım kurulum bu. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> PS5&#39;iniz için hangi yönü seçerseniz seçin, standı kullandığınızdan emin olun. Sistemi yerden uzak tutar, bu da hava akışını iyileştirir. Stand ayrıca PS5&#39;i sabitleyerek devrilmeyi ve potansiyel olarak ona zarar vermeyi zorlaştırır. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> PS5&#39;inizi Kurun ve Oynamaya Başlayın </h2> <p> Artık PS5&#39;inizi sadece birkaç dakika içinde dikeyden yataya ve tekrar geriye nasıl değiştireceğinizi biliyorsunuz. Sisteminiz kurulduktan sonra çalıştırın ve PS5&#39;in en iyi oyunlarından bazılarının keyfini çıkarın. </p> <p> PS4&#39;ün kitaplığının neredeyse tamamının PS5&#39;te de çalıştığını ve size çok daha fazlasının keyfini çıkaracağını unutmayın. </p> <p> <small> İmaj Kredisi: Alex Van Aken/ <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}