{"title":"Roku, Şarj Edilebilir Kumandasıyla Düşüncelerinizi İstiyor","content":"<p> Roku, şarj edilebilir pile sahip yeni bir uzaktan kumandayı (Roku Voice Remote Pro olarak adlandırılır) test etmek için Erken Erişim Programına katılmaları için bazı kişileri işe alıyor. </p> <p> Sarf malzemeleri tükenene kadar sınırlı bir süre teklif, ancak yine de uzaktan kumanda için ödeme yapmanız gerekiyor. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> Roku Voice Remote Pro Nedir? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> Sonunda şarj edilebilir pilli bir uzaktan kumanda </a> itibaren <a href=\"https://www.reddit.com/r/Roku/\"> Roku </a> </blockquote>  <p> Kingtut206 kullanıcısı tarafından ilk kez görüldüğü gibi <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , Roku, Roku Voice Remote Pro adlı yeni bir uzaktan kumandayı test etmek için insanları Erken Erişim Programına alıyor. </p> <p> Yeni uzaktan kumanda, şarj edilebilir bir pil, kayıp bir uzaktan kumanda bulucu (örneğin, &quot;Hey Roku, uzaktan kumandamı bul&quot; diyebilirsiniz), eller serbest ses ve standart markalı düğmelerin yanı sıra kişisel kısayol düğmeleri içerir. </p> <p> tarafından bildirildiği gibi <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> Sınır </a> , uzak üstün USB-C yerine mikro USB üzerinden şarj olur. Belki Erken Erişim Programı aracılığıyla toplanan geri bildirimler bunu kabul edecektir. </p> <p> Programa katılım, sizi nitelikli yapan şeyin ne olduğu bilinmemekle birlikte, yalnızca davetiye ile mümkündür. </p> <p> Uzaktan kumandanın fiyatı 29,99 $ ve 19 Şubat 2021&#39;de gönderilmesi bekleniyor. </p> <p> Yalnızca 2.000 birim satılacak ve Roku, uzaktan kumandayla ilgili deneyiminiz hakkında geri bildirim toplayacak. Bu süreden sonra, genel satışa sunulmadan önce uzaktan kumandanın rafine edileceğini varsayabiliriz. </p>"}