{"title":"Rapor: Android 12, Tek Elle Kullanım Moduna Sahip Olacak","content":"<p> Android 12 söylentilerinin tam olarak ortaya çıkmaya başladığı Android 11&#39;in yaşam döngüsü aşamasına resmi olarak ulaştık. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> XDA Geliştiricileri </a> Google&#39;ın Android 12 için telefonda tek elle gezinmeyi çok daha kolay hale getirecek tek el modu üzerinde çalıştığını bildirdi. Elleriniz ister büyük ister küçük olsun, bu Android cihazınızla etkileşim kurmanın yepyeni bir yolunu açabilir. </p> <p> Elbette birçok cihaz üreticisi ve <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> yazılım geliştiriciler, tek elle kullanılabilirliği geliştirmek için çözümler sundu </a> . Yine de, doğrudan işletim sistemine entegre edildiğinde onu kullanmak çok daha keyifli olacak. </p> <h2 id=\"android-12-s-one-handed-mode\"> Android 12&#39;nin Tek El Modu </h2> <p> Rapora göre Google, herhangi bir yazılım üreticisinin cihazlarında kullanabileceği açık kaynaklı Android sürümü olan AOSP&#39;ye tek elle kullanım özelliğini eklemeyi planlıyor. Bu aynı zamanda, henüz kendi tek el modunu geliştirmemiş olan OEM&#39;lerin, bu özelliği cihazlarına uygulamanın kolay bir yoluna sahip olacağı anlamına gelir. </p> <p> Raporun belirtmediği şey, Google&#39;ın telefon üreticilerinin Android 12&#39;nin tek elli özelliğini kullanmasını mı gerektireceği yoksa isteğe bağlı mı olacağıydı. </p> <p> Henüz çok erken olduğu için Android 12&#39;nin tek el modunun nasıl çalışacağını tam olarak bilmiyoruz. Google&#39;ın geçmişte işletim sistemine özellik ekleme yeteneği herhangi bir gösterge ise, şirketin uygulama konusunda iyi bir iş çıkarmasını bekleriz. Google, kolay erişim için tüm ekranı cihazın bir köşesine küçültmeyi seçebilir. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> Rapor ayrıca, Android 12 tek elle modunun, daha yeni hareketle gezinme moduyla birlikte geleneksel üç düğmeli modu kullanarak onu tetikleyecek bir yola sahip olacağını gösteriyor. </p> <p> Belirtildiği gibi, birçok akıllı telefon OEM&#39;i, bu özelliği kendi değiştirilmiş Android sürümlerine zaten uygulamıştır. Örneğin, Huawei aslında özellik sürümünü AOSP&#39;ye göndermeye çalıştı, ancak Google bunu reddetti. Belki de şirket, özelliğin kendi sürümünü getirmeyi planladığını bildiği için Google bunu geri çevirdi. </p> <p> Bu sızıntı çok erken olduğu için henüz hiçbir fotoğraf özelliği göstermiyor, bu yüzden Android 12&#39;nin piyasaya sürülmesine yaklaşana kadar beklememiz gerekecek. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Android 12 Ne Zaman Çıkacak? </h2> <p> Ne yazık ki, Android 12&#39;nin ne zaman piyasaya sürüleceğini tam olarak bilmiyoruz (bir süreliğine olmayacak olsa da). Ayrıca bu özelliğin geliştiricilere veya Beta veya Kararlı Android sürümlerine tam olarak ne zaman çıkacağını da bilmiyoruz. </p> <p> Yeni Android özelliklerinde her zaman olduğu gibi, işletim sistemine gelip gelmediğini bekleyip görmemiz gerekecek. </p>"}