{"title":"Sony FX3 Kamera Twitter Sızıntısıyla Ortaya Çıktı","content":"<p> Sony, 30 fps&#39;ye kadar 50 MP görüntü yakalayabilen bir 8.6K kamera olan Sony A1&#39;in piyasaya sürüldüğünü duyurmasının üzerinden yalnızca iki hafta geçti. Ama şirket biraz daha fazlasını mı karıştırıyor? </p> <p> Şu anda elimizdeki tek şey sadece spekülasyon, ancak Sony, FX serisine yeni, şık ve kompakt bir fotoğraf makinesi ekliyor olabilir. </p> <h2 id=\"a-preview-of-the-sony-fx3\"> Sony FX3&#39;ün Önizlemesi </h2> <p> Çarşamba günü, Nokiashita, Canon&#39;un EOS C70 ve Blackmagic Design&#39;ın Pocket Cinema 6K&#39;sına meydan okumak isteyebilecek bir kamera olan Sony FX3&#39;ün bir görüntüsünü tweetledi. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> ソニーFX3の画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> #噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> — 軒下デジカメ情報局 (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> 10 Şubat 2021 </a></blockquote>  <p> Nokishita, yakında çıkacak olan fotoğraf ve video ekipmanlarının erken ve doğru sızıntılarıyla ün salmış bir Japon teknoloji blogudur. Herhangi bir optik ürün şirketi için resmi bir kaynak olmamasına rağmen, bazı kişiler Nokishita tarafından paylaşılan bilgilerin doğrulanabileceğini söyleyecek kadar ileri gidiyor. </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> Teknoloji Radarı </a> bir zamanlar Nokishita&#39;yı &quot;kamera dedikodularının Noel Baba&#39;sı&quot; olarak adlandırmıştı. Yukarıdaki tweet&#39;e yanıt olarak Twitter kullanıcısı @miemelaar, &quot;Bu gerçek mi, yoksa bir kavram mı?&quot; diye sordu. ve @rauuru_san, &quot;Nokishita yayınlarsa, gerçek anlaşma bu&quot; yanıtını verdi. </p> <p> Ancak sızıntının doğru olduğunu varsaysak bile, bu bize gerçekten ne kadar bilgi bırakıyor? </p> <p> Adından dolayı FX3&#39;ün FX serisinin bir parçası olduğunu varsayabiliriz, ancak kamera birçok spekülatörün kafasını karıştıran bir sembol taşıyor. Fotoğraf makinesinin ön yüzündeki beyaz Alfa işareti (α) size tanıdık geliyorsa, bunun nedeni aynısını Sony&#39;nin aynasız fotoğraf makinelerinde bulabilmenizdir. </p> <p> Peki FX3 bir sinema kamerası mı, aynasız bir kamera mı yoksa bir tür DSLR tarzı hibrit mi? Daha fazla detayın ortaya çıkması için beklememiz gerekecek. O zamana kadar şu konudaki makalemizi okumayı düşünün: <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> aynasız fotoğraf makineleri, DSLR&#39;ler ve video kameralar arasındaki temel farklar </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> Sony FX3 Masaya Ne Getirecek? </h2> <p> Nokiashita&#39;nın tweet&#39;i düştüğünden beri, kameranın iddia edilen ürün özellikleri internette dolaşıyor. Yine de, eşit derecede saygın herhangi bir kaynaktan henüz bir şey yok. </p> <p> Neyse ki önümüzdeki haftalarda Sony FX3 hakkında daha fazla bilgi edineceğiz. Japonya&#39;nın en büyük fotoğraf etkinliği olan CP+ 2021, 25-28 Şubat&#39;ta geliyor. </p>"}