{"title":"Surface Pro Tablette Ekran Görüntüsü Nasıl Alınır","content":"<p> Ekran görüntüsü almak, herhangi bir cihazda basit ama gerekli bir beceridir. Surface Pro Tablet&#39;te klavye kısayollarını, ekran görüntüsü alma aracını ve hatta Xbox Game Bar&#39;ı kullanarak ekran görüntüsü alabilirsiniz. Surface cihazınızda ekran görüntüsü veya hatta ekran kaydı almak için tüm bu yöntemleri nasıl kullanacağınızı göstereceğiz. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Düğme Kombinasyonlarını Kullanarak Ekran Görüntüsü Alma </h2> <p> Surface Pro serisi cihazlarda, düğme kombinasyonlarını kullanarak ekran görüntüsü almak hızlı ve kolaydır. Ekran görüntüsü almak için <strong> Güç </strong> ve <strong> Sesi aç </strong> aynı anda anahtar. Ekran yanıp sönmeli ve ekran görüntüsü, cihazınızdaki Resimler altındaki ekran görüntüsü klasörüne kaydedilmelidir. </p> <p> Bu yöntem, en son Surface Pro serisi cihazlar (yani, Surface Pro 7+, Pro X), The Surface Go, Surface Go 2 ve Surface Book serisi cihazlar için çalışır. </p> <p> Surface&#39;ınız daha eski bir modelse (Surface 3 veya daha eski), düğme kombinasyonu biraz farklıdır. tuşuna basmalısın <strong> Windows Düğmesi </strong> (klavyenizdeki Windows Tuşu değil) ve <strong> Sesi kıs </strong> düğmesine aynı anda basın. Cihaz, ekran görüntünüzü Fotoğraflar altındaki Ekran Görüntüleri Klasörünüze kaydeder. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> Benzer şekilde, Surface Duo&#39;nuzda ekran görüntüsü almak için <strong> Güç </strong> düğmesi ve <strong> Sesi kıs </strong> anahtar. Ekran görüntüsü, cihazınızın galerisine Ekran Görüntüleri altında kaydedilmelidir. Alternatif olarak, sadece düğmesini basılı tutabilirsiniz. <strong> Güç </strong> tuşuna basın ve tıklayın <strong> Ekran görüntüsü </strong> ekrandaki düğmesine basın. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> Klavye Kısayollarını Kullanarak Surface Pro Ekran Görüntüsü Nasıl Çekilir </h2> <p> Klavye kısayolları, ekranınızdakileri yakalamanın başka bir yoludur. </p> <p> Bu klavye kısayolları tüm Windows cihazlarında çalışır, bu yüzden kontrol edin <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows 10&#39;daki diğer ekran görüntüsü alma yöntemleri </a> . Klavye kısayolları, Surface Laptop ve Surface Book serisi cihazlarda en iyi şekilde çalışır, ancak elbette Surface Pro veya Go cihazınız için klavye eklentiniz varsa, bu kısayollar da çalışır. </p> <h3 id=\"print-screen-methods\"> Baskı Ekranı Yöntemleri </h3> <p> Print Screen yöntemini kullanarak ekran görüntüsü almak için <strong> PrtScn </strong> klavyenizdeki düğme. Bu, tüm masaüstünüzün ekran görüntüsünü alacaktır. Bunun ekran görüntüsünü Yüzeyinize kaydetmeyeceğini, ancak panonuza ekleyeceğini unutmayın. Ekran görüntüsünü yapıştırmak için Microsoft Paint gibi bir program kullanmanız gerekir. </p> <p> presleme <strong> Alt + PrtScn </strong> yalnızca geçerli pencerenizin ekran görüntüsünü alır ve benzer şekilde ekran görüntüsünü panonuza ekler. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Al ve Eskiz </h3> <p> Bu, Surface cihazınızda ekran görüntüsü almanın açık ara en kolay yöntemidir. </p> <p> Snip and Sketch&#39;i açmak için <strong> Windows Tuşu + Üst Karakter + S, </strong> ve ekranınızda bir kaplama görünmelidir. Tam ekran görüntüsü almak için kaplamanın üst kısmındaki Tam Ekran düğmesine basın. Yalnızca geçerli pencerenizin ekran görüntüsünü almak için Tam Ekran düğmesinin yanındaki Pencere Alıntısı düğmesine basın. </p> <p> Ayrıca ekranınızın belirli bir alanının ekran görüntüsünü de alabilirsiniz. Varsayılan olarak, Snip ve Sketch, Dikdörtgen Snip&#39;e sahiptir. Dokunmatik ekranınızı veya izleme dörtgeninizi kullanarak ekran görüntüsünü almak istediğiniz kısmı sürüklemeniz yeterlidir. </p> <p> Snip ve Sketch, ekran görüntünüzün panonuza kopyalandığını bildirmek için bildirim panelinizde size bir bildirim verecektir. Üzerine tıklarsanız, isterseniz bir ekran görüntüsü çizebilir ve çizebilirsiniz. </p> <p> Dosyalarınıza kaydetmek için şunu kullanın: <strong> Ctrl + S </strong> veya ekran görüntünüzü belirli bir klasöre kaydetmek için sağ üst köşedeki Kaydet düğmesine basın. </p> <h3 id=\"xbox-game-bar\"> Xbox Oyun Çubuğu </h3> <p> Xbox Game Bar&#39;ı kullanarak ekran görüntüsü almak için <strong> Windows Tuşu + G </strong> açmak için. </p> <p> Buradan, Yakalamalar sekmesine ve Kamera Düğmesine tıklayabilirsiniz. Bu yöntem aynı zamanda ekranınızın sesli bir videosunu çekmenize de olanak tanır. Kaydedilen yakalamalarınız, Videolar klasörü ve Yakalamalar alt klasörünün altında görünecektir. Bir Xbox&#39;ta, benzer şekilde yapabilirsiniz <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> ekran yakalama ve kayıtları yakalama </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Surface Kalemini Kullanarak Surface Pro Ekran Görüntüsü Alma </h2> <p> Surface Pen&#39;i kullanarak ekran görüntüsü almak için, silgiye Çift Tıklamanız yeterlidir; cihazınız, tüm pencerenizin Snip ve Sketch&#39;ini getirmelidir. Buradan ekran görüntünüzü çizebilir ve dışa aktarabilirsiniz. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> Buna, dock&#39;unuzda Windows Ink Workspace&#39;i arayarak da erişebilirsiniz. Buradan Tam Ekran Alıntısı&#39;nı seçin. Windows Ink Çalışma Alanı Ayarları&#39;nı arayarak ve Windows Ink Çalışma Alanı&#39;na kaydırarak Surface Pen&#39;inizin düğme kısayollarının ne yaptığını değiştirebilirsiniz. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Yüzeyde Ekran Görüntüsü Alma, Basitleştirilmiş </h2> <p> Artık Surface cihazınızda ekran görüntüsü alma veya ekran kaydı almanın çeşitli yöntemlerini biliyorsunuz. Surface Pro veya Surface Go kullanıyorsanız ekran görüntüsü almanın en iyi dokunsal yolu düğme kombinasyonlarıdır, ancak klavye kısayolları da kolaydır. </p>"}