{"title":"Surface Duo, İngiltere Çıkış Tarihi ve Fiyat Düşüşü Aldı","content":"<p> Microsoft&#39;un Surface Duo&#39;su bu kadar harika bir çıkış resepsiyonuna sahip değildi, ancak şirket ABD dışında daha iyi ilk izlenimler bırakmak istiyor gibi görünüyor. Şirket sadece Surface Duo&#39;nun fiyatını düşürmekle kalmıyor, aynı zamanda İngiltere pazarı için onaylanmış bir çıkış tarihine de sahip. </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> Microsoft&#39;un Surface Duo için Son Yurtdışı Hazırlıkları </h2> <p> Bu haber bize <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . Hatırlarsanız, Surface Duo piyasaya sürüldüğünde, <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> harika eleştiriler almadı </a> . Bir merkezi yapışma noktası, Duo&#39;nun işletim sisteminin ne kadar sorunlu olduğuydu, ancak bir diğeri, 1399.99 $ &#39;lık göz alıcı fiyat noktasıydı. </p> <p> Microsoft, incelemecilerin bulduğu önemli sorunları düzeltmek için çok uğraştı, ancak yüksek fiyat etiketi olduğu yerde kaldı. Ancak Microsoft, Surface Duo&#39;ya 999,99 dolara önemli bir fiyat düşüşü vermeyi planlıyor. </p> <p> Dünya çapındaki eleştirmenler Surface Duo&#39;yu santim santim parçalamaya hazırlanırken, bu düşüşün muhtemelen yurtdışında piyasaya sürülmesi için hazırlık niteliğinde. Bu indirimli fiyat noktası ve Surface Duo&#39;nun işletim sisteminin son düzeltmeleri ile çift ekranlı harika, yurtdışında olumlu bir izlenim bırakabilir. </p> <p> Microsoft ayrıca İngiltere hayranlarının Surface Duo&#39;yu kendileri deneyebileceklerini de onayladı. Birleşik Krallık&#39;taysanız 18 Şubat 2021&#39;deki elektronik perakendecilerine göz atın. </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> Microsoft&#39;un Yurtdışı Planlarının Yüzeyini Çizmek </h2> <p> Surface Duo ABD&#39;de iyi bir izlenim bırakmak için mücadele ederken, denizaşırı ülkelerde hala umut olabilir. Bu fiyat düşüşüyle ​​birlikte Surface Duo&#39;nun işletim sistemindeki tüm düzeltmelerle birlikte, çimler diğer tarafta daha yeşil olabilir. </p> <p> Microsoft&#39;un Surface Duo için ne tür yamalar uyguladığını bilmek istiyorsanız, şirket kısa süre önce Duo&#39;nun uluslararası çıkışından önce hataları gidermek için bazı kararlılık güncellemeleri yayınladı. </p> <p> <small> İmaj Kredisi: Jack Skeens / <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}