{"title":"Sosyal Medya Yeni Bir Dil Öğrenmenize Yardımcı Olabilir 8 Yol","content":"<p> Hala okulda aldığınız İspanyolca ders kitaplarının ve kötü öğretilen Fransızca derslerinin kabuslarını görüyor musunuz? Korkma. İnternet sayesinde bu günlerde yeni bir dil öğrenmek hem eğlenceli hem de erişilebilir olabilir. </p> <p> Özellikle sosyal medya, dünya çapında milyonlarca dil öğrenen kişinin birbirine bağlanmasına yardımcı oldu. İster Almanca gibi popüler bir şey öğreniyor olun, ister Faroe dili gibi daha belirsiz bir şey öğreniyor olun, yolculuğunuzda size yardımcı olacak çok çeşitli kaynaklar bulacaksınız. </p> <p> İşte bir sonraki yabancı dilinizi öğrenmek için sosyal medyayı kullanmanın bazı yolları. </p> <h2 id=\"join-facebook-groups\"> 1. Facebook Gruplarına Katılın </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> Facebook&#39;ta akla gelebilecek hemen hemen her dil için gruplar bulacaksınız. Becerilerini geliştirmek isteyen yeni taşınmış gurbetçilerin topluluklarının yanı sıra dünya çapında öğrenenler için gruplar bulacaksınız. Deneyiminizden en iyi şekilde yararlanmak için her ikisine de katılmalısınız. </p> <p> Doğru Facebook gruplarını bulmak için basit bir çevrimiçi arama yapabilirsiniz. Alternatif olarak, aradığınızı Facebook&#39;tan da bulabilirsiniz. Bunu yapmak için Gruplar&#39;a gidin ve dilinizi arayın. Daha sonra bu ihtiyaçlara uyan toplulukların bir listesini alacaksınız. </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> Yerel bir dil okulunda okuyorsanız, sınıf arkadaşlarınızla bağlantı kurmak için kendi grubunuzu da oluşturabilirsiniz. Bunu yapmak için, <strong> Gruplar &gt; Yeni Grup Oluştur&#39;a gidin </strong> . Ardından ayarları düzenleyebilir ve üye davet etmeye başlayabilirsiniz. </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2. Reddit&#39;ten Yararlanın </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit, dil öğrenenler için altın madeni olan popüler bir çevrimiçi forumdur. Hem belirli diller hem de genel dil öğrenimi için alt dizinler bulacaksınız. </p> <p> Bir alt diziye katıldığınızda, yolunuza çıkan diğer öğrencilerden birçok faydalı ipucu ve ipucu keşfedeceksiniz. Ayrıca, şüphesiz ilgili olacağınız birçok mem bulacaksınız. </p> <p> Bir alt dizin bulmak için üstteki arama çubuğuna gidin ve dilinizi yazın. Sonuçlar yüklendikten sonra, yerel gelenekler hakkında daha fazla bilgi edinmek için hem öğrenmeye özel gruplara hem de kültürel gruplara katılmaya değer. </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. Yerel Hoparlörlerle Bağlanın </h2> <p> Bir dili hızlı öğrenmenin en iyi yolu, o dili zaten konuşan insanlarla konuşmaktır. Ve sosyal medya bu konuşmacıları bulmak için harika bir yer olabilir. Birkaç kişiye ulaşmanız gerekebilir, ancak sonunda size yardım etmek için biraz zaman ayırmaya istekli birini bulacaksınız. </p> <p> Sosyal medyada anadili İngilizce olan kişilerle bağlantı kurarken, önce bir arkadaşlık kurmaya odaklanın. Onlarla aynı şehirdeyseniz, onlarla tanışmayı teklif edin ve bir kahve için para ödeyin. Daha uzakta olanlar için, halihazırda konuştuğunuz dillerden birini öğrenmelerine yardımcı olmayı teklif edin. </p> <p> Bunlar için adımlar her sosyal medya platformunda benzerdir. Instagram veya Twitter&#39;da onları takip edin ve bir mesaj gönderin (gizlilik ayarları izin veriyorsa). Facebook&#39;ta da benzer bir yaklaşım sergileyebilirsiniz, ancak bazı insanlar tanımadıkları kişilerden gelen arkadaşlık isteklerini kabul etmeye daha az istekli olabilir. </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. Kendi Sosyal Medya İçeriğinizi Oluşturun </h2> <p> Kendinize bir dil öğrenmenize yardımcı olmak için sadece sosyal medyayı tüketmeniz gerekmez. Kendi gönderilerinizi de oluşturmayı deneyin. Bunu yapmak sadece konuşma ve yazma pratiği yapmanıza yardımcı olmayacak; ayrıca pratik yapmak için yeni kullanıcılar keşfedebilirsiniz. </p> <p> İçerik oluşturmaya gelince birçok seçeneğiniz var. Twitter&#39;da sohbetlere katılabilir veya bazı tweet&#39;lerinizi hedef dilinizde yazabilirsiniz. Instagram ile başlıklar yazabilir, grafikler oluşturabilir ve konuşurken kendinizi kaydedebilirsiniz. </p> <p> Kendi sosyal medya içeriğinizi oluşturduğunuzda, ana dili İngilizce olan kişilerden de geri bildirim alacaksınız. Bunun yanı sıra portföyünüzü büyütebilir ve birkaç faydalı yeni beceri öğrenebilirsiniz. </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. Uygulamalarınızı Öğrendiğiniz Dile Ayarlayın </h2> <p> Telefon ayarlarınızı değiştirmek, hedef dilinizde düşünmenizi ve onu rahat bir şekilde okumanızı sağlamanın kolay bir yoludur. Ayrıca kelime dağarcığınıza onlarca yeni kelime ekleyeceksiniz. </p> <p> </p> <p> Tüm büyük sosyal medya ağlarında, dilinizi değiştirebileceğiniz uygulama içi ayarlar bulunur. Örneğin Instagram&#39;da şu adrese gidin: <strong> Hesap &gt; Dil </strong> . Ardından, kullanabileceğiniz tüm dillerin bir açılır listesini göreceksiniz. </p> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (2 Resim) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> Genişlet <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <p> Ayrıca, telefon ayarlarınızı kullanarak tüm uygulamalarınızın dillerini aynı anda değiştirebilirsiniz. git <strong> Ayarlar </strong> &gt; <strong> Genel &gt; Dil ve Bölge </strong> . Oradan, mevcut her dilin bir listesini göreceksiniz. Daha küçük diller için hesabınızı optimize edemeyebileceğinizi unutmayın. </p> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (2 Resim) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> Genişlet <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. Hashtag&#39;lerden En İyi Şekilde Yararlanın </h2> <p> Hashtag&#39;leri kullanmak ve bunlarla arama yapmak, öğrenmekte olduğunuz dilde daha fazla kullanıcı bulmanın güçlü bir yoludur. Çeşitliliği kullanarak, hem anadili hem de diğer öğrencilerle bağlantı kurabilir ve içeriklerini tüketebilirsiniz. </p> <p> Aradığınız içerik türünü bulmak için diğer öğrencilerin ne kullanacağını düşünün. Herhangi bir ülkedeki mevcut konuları arayarak da anadili İngilizce olan kişilerin içeriğini bulabilirsiniz. Bunları genellikle trend olan gönderilerde ve makalelerde bulabilirsiniz. </p> <p> Hashtag&#39;leri aramak için, kullandığınız sosyal medya uygulamasındaki arama işlevini kullanın. Ayrıca bunları kullanan gönderilere tıklayabilir ve tüm sonuçları ortaya koyabilirsiniz. </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. Hedef Dilinizdeki Hesapları Takip Edin </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> İngilizce takip ettiğiniz her ilginç hesabın muhtemelen hedef dilinizde bir karşılığı vardır. Bunlar devasa yayınlar olabilir veya ana dillerinde iş yaratma konusunda daha rahat olan günlük konuşmacılar olabilir. </p> <p> </p> <p> Favori dergilerinizin, spor takımlarınızın ve müzik sanatçılarınızın hedef dilinizde hesapları olup olmadığını da görmelisiniz. Örneğin, dünyanın en büyük spor kulüplerinin birçoğunun İngilizce, İspanyolca ve daha birçok dilde hesapları vardır. </p> <p> Öğrenmek istediğiniz dilde hesapları takip ederken, iyi bir kural, yalnızca İngilizce içeriklerini aynı derecede ilginç bulursanız takip etmektir. Aksi takdirde, onları daha sonra tekrar görmezden gelir ve takibi bırakırsınız. </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. Sosyal Medyada Dil Öğrenme Uygulamalarını Takip Edin </h2> <p> <strong class=\"gallery__section-title\"> Resim Galerisi (2 Resim) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> Genişlet <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> Genişlet </p> <p> Kapat </p> <p> Dil öğrenme uygulamaları genellikle aktif sosyal medya profillerine de sahiptir. Bunlar, ister Norveççe ister Japonca öğreniyor olsunlar, herkesin karşılaştığı ortak mücadelelerle ilgili genel ipuçları almak için harikadır. </p> <p> Takip etmeye değer bazı hesaplar Babbel, Busuu ve Duolingo&#39;dur. </p> <p> Yine de, bu uygulamaları yalnızca tüketim için kullanmanız gerekmez. Düşüncelerinizi yorumlara eklemekten çekinmeyin. Sizden tamamen farklı bir dil öğreniyor olsalar bile, yeni arkadaşlar bile edinebilirsiniz. </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> Sosyal Medya ile Dil Öğrenmeyi Eğlenceli Hale Getirin </h2> <p> Yani, işte buradasın. Artık dil öğrenme yolculuğunuzu eğlenceli hale getirmek için sosyal medyayı kullanma fikriniz var. Ders kitabı çalışması hala önemli olsa da, tek seçeneğiniz bu olmamalıdır. </p> <p> Uygulamayı hedef dilinize göre optimize edemeseniz bile, bağlantı kurabileceğiniz çok sayıda anadili ve öğrenci bulacaksınız. </p> <p> Sosyal medya ile dil öğrenmenin anahtarı hem etkileşimde bulunmak hem de tüketmektir. Bunu yaptığınızda, deneyiminizi daha tatmin edici bulacak ve ders kitaplarının size asla öğretmediği kelimeleri öğreneceksiniz. </p>"}