{"title":"Twitter, Devlet Yetkililerinin Kişisel Hesaplarını Etiketleyecek","content":"<p> Twitter yakında devlet yetkililerinin kişisel hesaplarına etiketler yerleştirmeye başlayacak. Etiketlerin, kullanıcıların hükümetle ilişkili herhangi birini kolayca tanımlamasına yardımcı olması gerekiyor. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Daha Fazla Devlet Yetkilisi Twitter&#39;da Etiket Alacak </h2> <p> Bir gönderiye göre <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> Twitter Blogu </a> , platform 17 Şubat 2021&#39;de &quot;devlet başkanlarının&quot; kişisel hesaplarını etiketlemeye başlayacak. Devlete bağlı medyayla ilişkili hesaplara da etiket yapıştıracak. </p> <p> Twitter ayrıca daha fazla ülkedeki hükümet yetkililerini kapsayacak şekilde etiketlerinin erişimini genişletiyor. Bu konumlar arasında Kanada, Küba, Ekvador, Mısır, Almanya, Honduras, Endonezya, İran, İtalya, Japonya, Suudi Arabistan, Sırbistan, İspanya, Tayland, Türkiye ve Birleşik Arap Emirlikleri yer alıyor. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Resim Kredisi: Twitter </p> <p> Platform, bu etiketlerin kullanıcıların &quot;Twitter&#39;da daha bilinçli bir deneyim yaşamalarına&quot; yardımcı olacağını umuyor ve ayrıca &quot;bireyler ve kurumlar arasında ayrım yaparak&quot; etiket metnini &quot;daha fazla özgünlük katacak&quot; şekilde düzenlemeyi planlıyor. </p> <p> Twitter&#39;ın devlet bağlantılı hesaplar için ilk etiket dalgası Ağustos 2020&#39;de kullanıma sunuldu. Başlangıçta, bu etiketler yalnızca Birleşmiş Milletler Güvenlik Konseyi&#39;ndeki beş ülkeyle ilişkili yetkililer için geçerliydi ve bu yetkililerin kişisel hesaplarını içermiyordu. </p> <p> Bununla birlikte, bu etiketler bir <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> yanlış bilgilendirmeye açık sözlülük </a> , ancak yine de kullanıcıların okudukları ve kimden geldiği hakkında daha fazla bağlam elde etmelerine yardımcı olurlar. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter Etiketlerini Genişletmeye Devam Edecek </h2> <p> Blog gönderisinin sonunda Twitter, etiketlerini &quot;zaman içinde ek ülkelere&quot; genişletmeyi umduğunu belirtti. Etiket, bir kişinin Twitter profilinde soluk gri bir bayrak olarak görünüyor ve önümüzdeki haftalarda muhtemelen daha sık karşılaşacaksınız. </p>"}