{"title":"VW, Apple&#39;ın Otomobil Endüstrisinde Kolay Bir Sürüşe Sahip Olmayacağını İddia Ediyor","content":"<p> Volkswagen Group&#39;un CEO&#39;su Herbert Diess, VW&#39;nin Project Titan&#39;dan &quot;korkmadığını&quot; söyleyerek Apple Car&#39;ın otomobil endüstrisi üzerindeki olası etkisini küçümsedi. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW Bir Apple Arabasından &quot;Korkmuyor&quot; </h2> <p> Diess, Apple markalı bir otomobilin gerçekten mantıklı olabileceğini kabul etse de, yoğun rekabet nedeniyle Apple&#39;ın otomobil yapma ortamına &quot;bir gecede&quot; hakim olabileceğini düşünmüyor. Çelik kesmek ve titiz tüketicilere araba satmak, içinde bulunulması zor bir iş, diye ima etti ve bunun herhangi bir şirketin &quot;tek hamlede devralabileceği&quot; bir alan olmadığını da sözlerine ekledi. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> Diess&#39;in bir röportajda Frankfurter Allgemeine Sonntagszeitung&#39;a söylediklerini aktarıyor: </p> <blockquote> <p> Otomobil endüstrisi, tek hamlede devralabileceğiniz tipik bir teknoloji sektörü değil. Apple bunu bir gecede başaramayacak. Yine de korkmuyoruz. </p> </blockquote> <p> Yönetici, yine de Apple markalı bir aracın piller, yazılım, endüstriyel tasarım ve görünüşte sonsuz kaynakları gibi Apple&#39;ın yetkinlikleri göz önüne alındığında mantıklı olacağını ekledi. Apple, otomobille ilgili herhangi bir ürün sunmaz. <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> CarPlay gösterge paneli yazılımı </a> Bu, bir araba radyosu veya ana ünitenin bir iPhone için bir ekran ve bir kontrolör görevi görmesini sağlar. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> Endüstrinin En Kötü Saklanan Sırrı </h2> <p> Project Titan (bir Apple Car&#39;ın dahili kod adı) için planlar, son zamanlarda ortaya çıkan söylentilere rağmen hala halka açık değil. <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple, Hyundai/Kia ile ortak olmak istiyordu </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple&#39;ın diğer otomobil şirketleriyle konuştuğu söyleniyor </a> ve sözleşmeli üreticiler --- Magna, Nissan ve Foxconn dahil --- otonom tahrikli aracını inşa etmekle ilgili. Kaynaklar, bir Apple Car&#39;da direksiyon simidi bulunmadığını, çünkü başlangıçta <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> gıda dağıtımına ve robotaksi operasyonlarına odaklanmak </a> tüketicilere satılmadan önce. </p> <p> </p> <p> Herbert&#39;in yorumundan çıkarılacak en büyük çıkarım, otomobil endüstrisinin Project Titan&#39;a yakından ilgi göstermesi olacaktır. Açıkçası, Apple&#39;ın bu sektöre girmesi düşüncesi, bazı üst düzey yöneticileri tedirgin ediyor. Bununla birlikte, tarih, yeni bir ürün kategorisine girdiği için Apple ile alay etmekten daha iyi bilmesi gereken insanlarla dolu. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Palm CEO&#39;su iPhone&#39;a Nasıl Güldü? </h2> <p> Bunun en iyi örneği eski Palm CEO&#39;su Ed Colligan&#39;dır. 2007&#39;deki orijinal iPhone tanıtımından sadece haftalar önce Colligan, güzel bilgisayarlar tasarlamasıyla tanınan bir şirketin rekabetçi akıllı telefon sektöründe müşteri kazanabileceği fikrine gülerek şöyle dedi: </p> <blockquote> <p> Birkaç yıl boyunca burada iyi bir telefonun nasıl yapılacağını öğrendik ve mücadele ettik. PC adamları bunu sadece çözmeyecekler. Sadece içeri girmeyecekler. </p> </blockquote> <p> Colligan&#39;ın Apple&#39;ı &quot;PC adamları&quot; olarak tanımlamasına benzer şekilde, Volkswagen patronu bir teknoloji şirketinin araba yapım işinde müşteri kazanabileceği fikrini küçümsemeye çalışıyor. Tarih, Herbert&#39;in yorumunun Colligan&#39;ınkinden daha iyi yaşlanıp yaşlanmayacağını gösterecek. </p>"}