{"title":"Volkswagen, Otonom Araçlarda Microsoft Azure Kullanacak","content":"<p> Microsoft, sürücüsüz otomobil pazarına girmek istiyor ancak otomobil tasarlama ve üretme konusunda herhangi bir uzmanlığa sahip değil. Bununla birlikte, akıllı bir arabanın arkasındaki beyinleri sağlayabilir ve Volkswagen, Microsoft&#39;un hizmetlerini kendi araçları için kullanmakla ilgileniyor. </p> <h2 id=\"microsoft-and-volkswagen-s-partnership-for-automatic-cars\"> Microsoft ve Volkswagen&#39;in Otomatik Otomobiller için Ortaklığı </h2> <p> Bu ortaklığın haberi patladı <a href=\"https://www.reuters.com/article/us-microsoft-volkswagen/volkswagen-taps-microsofts-cloud-to-develop-self-driving-software-idUSKBN2AB0SZ\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> . Volkswagen, kendi kendini süren otomobil dünyasına girmesine yardımcı olmak için Microsoft&#39;u getiriyor. </p> <p> Volkswagen aslında Audi, Porshe ve Lamborghini gibi birkaç farklı otomobil şirketine sahip. Sorun şu ki, her şirketteki mühendisler birbirleriyle bilgi paylaşmak yerine kendi kendine giden bir araba tasarlamak için kendi rotasını çiziyordu. </p> <p> Bunu çözmek için Volkswagen, tüm sürücüsüz otomobil mühendislerini Car.Software adı verilen büyük bir gruba yerleştirdi. Buradaki fikir, grubun birleşip Volkswagen&#39;in tüm arabaları için kullanabileceği tek bir akıllı araba platformu oluşturabilmesiydi. </p> <p> Ancak, Car.Software içindeki farklı mühendislerin kodlarını geliştirmek için hala farklı platformlar kullandığı ortaya çıktı. Bu nedenle, Volkswagen, herkese çalışması için bir temel platform sağlamaya yardımcı olmak için Microsoft&#39;a döndü. </p> <p> Bu, Volkswagen&#39;in arabalarında Windows 10&#39;un bittiği anlamına gelmiyor. Microsoft&#39;un Azure adlı, Nesnelerin İnterneti (IoT) cihazlarını bağlamak için tasarlanmış başka bir platformu var. </p> <p> Bu tanıdık geliyorsa, bunun nedeni aynı hizmet olmasıdır. <a href=\"https://www.makeuseof.com/microsoft-powered-self-driving-car/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft, sürücüsüz arabaları için Cruise&#39;a teklifte bulundu </a> . Şimdi, Cruise anlaşmasının tek seferlik bir anlaşma olmadığı açık; Microsoft, araçların Azure&#39;da çalıştırılması konusunda ciddi. </p> <p> Azure&#39;ın Microsoft için ne kadar iyi performans gösterdiği göz önüne alındığında, yazılım devinin demir sıcakken grev yapmak istemesi şaşırtıcı değil. Microsoft&#39;un Azure ve Xbox hizmetlerinin kombinasyonu, <a href=\"https://www.makeuseof.com/microsoft-reveals-record-profits/\" target=\"_blank\" rel=\"nofollow noopener\"> pandemi sırasında şirkete düzenli bir kâr sağladı </a> . </p> <p> Bu nedenle, Azure&#39;a akıllı cihazlar dünyasında daha da büyük bir varlık kazandırmak için kendi kendini süren arabalara almak için büyük bir teşvik var. Azure&#39;ın akıllı araba dünyasında önemli bir oyuncu olup olmayacağı ise henüz belli değil. </p> <p> </p> <h2 id=\"starting-the-engine-for-microsoft-azure\"> Microsoft Azure için Altyapıyı Başlatma </h2> <p> Microsoft Azure, teknoloji devi için şimdiden büyük bir para üreticisidir, bu da şirketin yeni bölgelere açılmak için mükemmel bir konumda olduğu anlamına gelir. Hem Cruise hem de Volkswagen&#39;in sürücüsüz otomobilleri, temelleri olarak Microsoft Azure&#39;u kullanacak ve bu, otomobillerin geleceğinde potansiyel olarak önemli bir oyuncu haline gelebilir. </p> <p> Kaderin tuhaf bir cilvesiyle, Microsoft ve Apple arasındaki eski rekabet, akıllı arabalar dünyasına yayılıyor. Apple, otomobil üreticilerine yalnızca &quot;akıllı&quot; parça tedarik etmek yerine, 2024 yılına kadar eksiksiz &quot;Apple Cars&quot; üretmeyi planlıyor. </p> <p> <small> Resim Kredisi: Andrey Suslov / <a href=\"https://www.shutterstock.com/image-vector/autonomous-smart-car-scans-road-operates-635238704\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}