{"title":"Windows 10&#39;da VIDEO_TDR_FAILURE BSOD Nasıl Onarılır","content":"<p> VIDEO_TDR_FAILURE hatası, grafik kartınızın arızalı olduğunu veya ekran sürücülerinin eski/arızalı olabileceğini belirtir. Ancak bileşenlerin aşırı ısınması veya bozuk sistem dosyaları gibi başka nedenler de olabilir. TDR&#39;nin kısaltması <strong> Zaman Aşımı, Algılama ve Kurtarma </strong> , Windows tarafından arızalı yazılım bileşenlerini belirlemek ve düzeltmek için kullanılan bir yöntem. </p> <p> Bu hatayla karşılaşıyorsanız korkmayın çünkü aşağıdaki yöntemler VIDEO_TDR_FAILURE hatasını beklediğinizden daha hızlı düzeltecektir. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Ekran Sürücülerini Güncelleyin ve Yeniden Yükleyin </h2> <p> Yukarıda belirtildiği gibi, hata genellikle hatalı çalışan veya güncel olmayan ekran sürücülerinden kaynaklanır. Bu nedenle, grafik kartı sürücülerinizi güncellemelisiniz. Bu sorunu çözmezse, onları yeniden yükleyin. Grafik kartınıza bağlı olarak hataya ait farklı dosya adlarıyla karşılaşabilirsiniz. </p> <ol> <li> Nvidia kullanıcıları için, <strong> nvlddmkm.sys </strong> . Nvidia kullanıcısıysanız, işte burada <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Hatayı düzeltmenin 5 kolay yolu. </a> </li> <li> AMD kullanıcıları için hata şu şekilde görünür: <strong> atikmpag.sys </strong> . </li> <li> Intel HD kullanıcıları için hata şudur: <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> Ekran Sürücüleri Nasıl Güncellenir </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> Basın <strong> Windows Tuşu + R </strong> Çalıştır komutunu açmak için Yazın <strong> devmgmt.msc </strong> ve Enter&#39;a basın. </li> <li> İçinde <strong> Aygıt Yöneticisi </strong> pencere, şuraya git <strong> Ekran adaptörleri </strong> ve genişletin. </li> <li> Görüntü bağdaştırıcınıza sağ tıklayın, ardından <strong> Sürücüyü güncelle </strong> . </li> <li> Seç <strong> Güncellenmiş sürücü yazılımını otomatik olarak arayın </strong> . </li> <li> Windows otomatik olarak web&#39;de arama yapacak ve gerekli sürücüleri indirecektir. Lütfen bunu yaparken aktif bir internet bağlantınız olduğundan emin olun. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> Ekran Sürücüleri Nasıl Yeniden Yüklenir </h3> <p> Görüntü sürücülerini güncelledikten sonra video tdr hatası BSOD devam ederse, bu sürücüleri yeniden yüklemek en iyisidir. Windows güvenli modda başlatılırken bunu yapmanız önerilir. Ancak bunu yapmadan önce, grafik kartı üreticinizin web sitesine gitmeli ve grafik sürücülerinin en son sürümünü indirmelisiniz. </p> <p> En yaygın imalatlar şunlardır: <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> , ve <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intel </a> . </p> <p> Güvenli modda önyükleme yapmak için şu adımları izleyin: </p> <ol> <li> Basın <strong> Windows Tuşu + R, </strong> ve Çalıştır iletişim kutusuna şunu yazın <strong> msconfig, </strong> ve Enter&#39;a basın. </li> <li> İçinde <strong> Sistem yapılandırması </strong> pencere, üzerine tıklayın <strong> Çizme </strong> sekme. </li> <li> Şimdi işaretleyin <strong> Güvenli mod </strong> altına doğru yerleştirilmiş onay kutusu. </li> <li> Ayarları uygulayın ve bilgisayarınızı yeniden başlatın. </li> </ol> <p> Güvenli modda önyükleme yaptıktan sonra ekran sürücülerini yeniden yüklemenin zamanı geldi. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> Başlat menüsü arama çubuğuna şunu yazın <strong> Aygıt Yöneticisi </strong> ve açın. </li> <li> Aramak <strong> Ekran adaptörleri </strong> ve menüyü genişletin. </li> <li> GPU&#39;nuza sağ tıklayın ve tıklayın <strong> Cihazı kaldır </strong> . </li> <li> Kaldırma sihirbazında, kontrol ettiğinizden emin olun. <strong> Bu aygıtın sürücü yazılımını silin </strong> Kutu. </li> <li> Windows&#39;un aygıtı kaldırmasını ve bilgisayarınızı yeniden başlatmasını bekleyin. </li> <li> Şimdi, daha önce indirdiğiniz grafik sürücülerini yeniden yükleyin. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Sistem Dosyalarını Taramak ve Düzeltmek için SFC&#39;yi Kullanın </h2> <p> SFC, bozuk sistem dosyalarını taramak ve düzeltmek için kullanılabilen yerleşik bir Windows yardımcı programıdır. Bir BSOD söz konusu olduğunda, bazı sistem dosyalarının bozuk olması çok olasıdır, bu nedenle bu yardımcı programı çalıştırmak zorunludur. Bu sadece bir tanesi <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> birkaç yararlı yardımcı program mevcut </a> bir Windows kullanıcısının emrinde. </p> <p> SFC&#39;yi çalıştırmak için şu adımları uygulamanız yeterlidir: </p> <ol> <li> Başlat menüsü arama çubuğuna şunu yazın <strong> cmd </strong> . </li> <li> sağ tıklayın <strong> Komut istemi </strong> ve seçin <strong> Yönetici olarak çalıştır </strong> . </li> <li> Konsolda şunu yazın <strong> sfc /scannow </strong> ve Enter&#39;a basın. </li> <li> Tarama ve onarım işlemi tamamlandıktan sonra bilgisayarınızı yeniden başlatın. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Başlangıç ​​Onarımını Çalıştırın </h2> <p> Windows 10&#39;u başlatır başlatmaz veya oturum açtıktan kısa bir süre sonra hatayı alan kullanıcılar için Başlangıç ​​onarımı bir nimettir. Bu Windows özelliği, başlatma sırasında anormallikleri kontrol eder ve bunları hemen düzeltir. </p> <p> Bu bölüm, bilgisayarları hata nedeniyle kullanılamaz hale gelen, yani açamayan kullanıcılara yönelik olduğundan <strong> Ayarlar </strong> , Windows Kurtarma Ortamı&#39;na (winRE) girmek için yeniden başlatmaları gerekir. </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Windows Kurtarma Ortamı&#39;na önyükleme yapmak için şu adımları izleyin: </p> <ol> <li> Bilgisayarınız kapanana kadar Güç düğmesini basılı tutun. </li> <li> PC&#39;nizi başlatmak için Güç düğmesine tekrar basın. </li> <li> Bilgisayar Kurtarma moduna girene kadar birinci ve ikinci adımları tekrarlayın. Mavi ekran olacak. </li> <li> Kurtarma ekranında, üzerine tıklayın. <strong> Gelişmiş tamir seçeneklerini görüntüle </strong> . </li> <li> Bir sonraki ekranda, üzerine tıklayın <strong> Sorun giderme </strong> </li> <li> Tıklamak <strong> Gelişmiş seçenekler </strong> </li> <li> Tıklamak <strong> Başlangıç ​​onarımı </strong> ve istendiğinde kimlik bilgilerinizi girin. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Güç Yönetimi Ayarlarınızı Değiştirin </h2> <p> Windows güç yönetimi ayarları genellikle iyi optimize edilmiştir, ancak bazen bilgisayarınızın grafikleri işleme şeklini etkileyebilirler. Bu, özellikle bilgisayarın gizli bir GPU&#39;su olduğunda geçerlidir. VIDEO_TDR_FAILURE BSOD almaktan kaçınmak için en uygun ayarlar aşağıda verilmiştir: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> Başlat menüsü arama çubuğuna şunu yazın <strong> Kontrol Paneli </strong> ve açın. </li> <li> Denetim Masası arama çubuğuna &quot;güç seçenekleri&quot; girin ve Enter&#39;a basın. </li> <li> Tıklamak <strong> Güç seçenekleri, </strong> ve kullandığınız güç planının yanındaki simgesine tıklayın. <strong> Plan ayarlarını değiştirin. </strong> </li> <li> Tıklamak <strong> Gelişmiş güç ayarlarını değiştirin. </strong> </li> <li> Aramak <strong> PCI E </strong><strong> xpress </strong> ve genişletin. </li> <li> çevir <strong> Bağlantı Durumu Güç Yönetimi </strong> ayarlamak <strong> Kapalı </strong> . </li> <li> Değişiklikleri kaydedin ve bilgisayarınızı yeniden başlatın. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Bilgisayarınızı Temizleyin </h2> <p> Aşırı ısınma asla iyi bir şey değildir ve genellikle bunun nedeni toz birikmesidir. Kullanıcıların bilgisayar bileşenlerini her ay tozdan temizlemeleri önerilir. Ama dikkat et. Nazikçe yapılmalıdır. </p> <p> Grafik kartınızın, CPU fanının, güç kaynağı ünitesinin ve kabin fanlarının üstlerini temizlediğinizden emin olun. Sonuç olarak, kaçındığınızdan emin olun <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> pahalı bileşenlere zarar verebilecek bakım hataları. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Donanım Bileşenlerini Kontrol Edin </h2> <p> Yukarıda listelenen her şeyi denedikten sonra hata hala görünüyorsa, donanımın kendisinde bir arıza olabilir. Özel bir grafik kartına sahip kullanıcılar, kartı çıkarmalı ve bilgisayarı başlatmalıdır. Hata çözülürse, GPU&#39;nun kendisinde bir donanım hatası vardır. Üreticiyle iletişim kurmayı deneyebilir ve ünitenizi değiştirmeyi deneyebilirsiniz. </p> <p> </p> <p> Yerleşik grafikleri kullanırken, bunları devre dışı bırakıp yeniden başlatmayı deneyin. Bunları devre dışı bırakmak için şu adımları izleyin: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> Basın <strong> Windows Tuşu + R, </strong> tip <strong> devmgmt.msc </strong> Çalıştır metin kutusuna girin ve Enter&#39;a basın. </li> <li> İçinde <strong> Aygıt Yöneticisi </strong> , aramak <strong> Ekran adaptörleri </strong> ve menüyü genişletin. </li> <li> Yerleşik GPU&#39;nuza sağ tıklayın ve tıklayın <strong> Cihazı devre dışı bırak </strong> . </li> <li> Bilgisayarı yeniden başlatın ve hatanın çözülüp çözülmediğini kontrol edin. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> &quot;Video TDR Hatası&quot; Hatası Başarıyla Çözüldü </h2> <p> Çoğu kullanıcı için, ekran sürücülerinin basit bir güncellemesi veya yeniden yüklenmesi sorunu çözecektir. Ancak daha da kötüye giderse, bilgisayarınızı sıfırlamanız veya bazı donanımları değiştirmeniz gerekebilir. </p>"}