{"title":"Windows 10&#39;da Kötü Amaçlı Yazılımdan Koruma Hizmeti Yürütülebilir Yüksek CPU Kullanımı Nasıl Onarılır","content":"<p> Bilgisayarınız yavaşlıyor veya yanıt vermiyorsa, bazı işlemlerin belleğe ve CPU&#39;ya işleyip işlemediğini kontrol etmek en iyisidir. İşlemin, Kötü Amaçlı Yazılımdan Koruma Hizmeti Yürütülebilir Dosyası olması muhtemeldir. Bu yaygın sorun, Windows Defender düzgün yapılandırılmadığında veya sisteminizde çalışmasını engelleyen kötü amaçlı yazılım olduğunda ortaya çıkar. </p> <p> Windows 10&#39;da Kötü Amaçlı Yazılımdan Koruma Hizmeti Yürütülebilir yüksek CPU kullanımı hatasını nasıl düzelteceğiniz aşağıda açıklanmıştır. </p> <h2 id=\"optimize-windows-defender-scheduling-options\"> 1. Windows Defender Zamanlama Seçeneklerini Optimize Edin </h2> <p> Kötü Amaçlı Yazılımdan Koruma Hizmeti Yürütülebilir Dosyası, sisteminizin düzenli aralıklarla tam taramasını çalıştırması planlandığında yüksek CPU kullanımına neden olur. Bu taramaları, CPU&#39;nun yoğun olduğu görevleri deneme veya belki de bilgisayarınızı hiç kullanma olasılığınız daha düşük olan bir zamana yeniden planlamak en iyisidir. </p> <p> Windows Defender&#39;ın zamanlamasını nasıl değiştireceğiniz aşağıda açıklanmıştır: </p> <ol> <li> Başlat menüsü arama çubuğuna &quot;görev zamanlayıcı&quot; yazın ve <strong> Görev Zamanlayıcısı </strong> . </li> <li> Soldaki gezinme bölmesinde şuraya gidin: <strong> Görev Zamanlayıcı Kitaplığı &gt; Microsoft &gt; Windows &gt; Windows Defender </strong> . Bunu, yukarıda belirtilen kitaplıkların her birini genişleterek yapabilirsiniz. </li> <li> İçinde <strong> Windows Defender </strong> kütüphane, üzerine çift tıklayın <strong> Windows Defender Zamanlanmış Tarama </strong> orta bölmede. </li> <li> Altında <strong> Koşullar </strong> sekmesinde, tüm seçeneklerin işaretini kaldırın ve Tamam&#39;a tıklayın. Bu, tüm zamanlanmış taramaları kaldırır. </li> </ol> <p> <img alt=\"Windows Defender Scheduled scan entry in Task Scheduler\" src=\"images/windows-defender-scheduled-scans-807.jpg\" loading=\"lazy\"> </p> <h3 id=\"create-new-scheduled-scans\"> Yeni Zamanlanmış Taramalar Oluşturun </h3> <p> Kullanıcılar, bilgisayarlarının korunmaya devam etmesi için yeni zamanlanmış taramalar oluşturmalıdır. İhtiyaçlarınıza göre kişiselleştirmek en iyisidir. CPU&#39;nun ağır görevlerini yapmayacağınızı bildiğiniz zamanlarda bunları programlayabilirsiniz. Ancak sıklık en az haftada bir olmalıdır. </p> <p> Yeni bir Windows Defender programı oluşturmak için şu adımları izleyin: </p> <ol> <li> Açık <strong> Görev Zamanlayıcısı </strong> ve bir kez daha şuraya gidin: <strong> Görev Zamanlayıcı Kitaplığı &gt; Microsoft &gt; Windows &gt; Windows Defender </strong> </li> <li> Çift tıklama <strong> Windows Defender Planlandı </strong><strong> Tarama </strong> . </li> <li> Altında <strong> tetikleyiciler </strong> sekmesi, tıklayın <strong> Yeni </strong> . </li> <li> Burada taramanın ne sıklıkla çalışacağını seçebilirsiniz. </li> <li> Ayarları uygulayın ve çıkın. </li> </ol> <p> <img alt=\"Adding a new trigger toWindows Defender Scheduled scan using Task Scheduler\" src=\"images/new-trigger-defender-513.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-windows-defender-to-its-own-exclusion-list\"> 2. Windows Defender&#39;ı Kendi Dışlama Listesine Ekleyin </h2> <p> Tam sistem taraması yaparken, Windows Defender sisteminizdeki her bir dosyayı tek tek inceler. Bu, bazı sorunlara yol açabilecek kendini de içerir - en yaygın olarak yavaş sistem performansı. Kullanıcılar, Windows Defender&#39;ın dışlama listesine Yürütülebilir Kötü Amaçlı Yazılımdan Koruma Hizmeti&#39;ni ekleyerek bunu önleyebilir. </p> <p> Bu, aşağıdaki adımları izleyerek yapılabilir: </p> <ol> <li> Basın <strong> CTRL + Üst Karakter + ESC </strong> başlatmak için <strong> Görev Yöneticisi </strong> . </li> <li> Altında <strong> süreçler </strong> sekme ara <strong> Kötü Amaçlı Yazılımdan Koruma Hizmeti Yürütülebilir. </strong> Sağ tıklayın ve seçin <strong> Dosya konumunu aç </strong> . </li> <li> Windows Gezgini&#39;nde en üstte bulunan adres çubuğunda dosya yolunu (CTRL + C) kopyalayın. </li> <li> Başlat menüsü arama çubuğuna &quot;Windows Güvenliği&quot; yazın ve uygulamayı açın. Mavi bir kalkan simgesi vardır. </li> <li> Tıklamak <strong> Virüs ve tehdit koruması </strong> ve ardından üzerine tıklayın <b> Ayarları yönet </b> . </li> <li> bulana kadar aşağı kaydırın <strong> İstisnalar </strong> ve ardından üzerine tıklayın <strong> Hariç tutulanları ekle veya kaldır </strong> . </li> <li> Tıklamak <strong> Bir hariç tutma ekle </strong> ardından Dosya&#39;ya tıklayın. </li> <li> Dosya Gezgini penceresinin adres çubuğuna, daha önce kopyaladığınız yolu yapıştırın (CTRL + V). </li> <li> Aramak <strong> MsMpEng.exe </strong> ve aç&#39;ı tıklayın. </li> <li> Dosya artık gelecekteki tüm Windows Defender taramalarından hariç tutulacaktır. </li> </ol> <p> <img alt=\"Adding an entry to windows defender exclusion list\" src=\"images/windows-defender-exclusion-add-843.jpg\" loading=\"lazy\"> </p> <p> </p> <p> </p> <h2 id=\"repair-corrupt-windows-defender-files-using-sfc\"> 3. SFC Kullanarak Bozuk Windows Defender Dosyalarını Onarın </h2> <p> SFC, hasarlı sistem dosyalarını otomatik olarak tarayan ve düzelten yerleşik bir Windows yardımcı programıdır. Bu, bozuk Windows Defender dosyalarının onarılmasına yardımcı olacak şeydir. </p> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-224.jpg\" loading=\"lazy\"> </p> <p> Bunu kullanmak için aşağıdakileri yapın: </p> <ol> <li> Başlat menüsü arama çubuğuna şunu yazın <strong> cmd </strong> ve aç <strong> Komut istemi </strong> . </li> <li> Konsolda şunu yazın <strong> sfc /scannow </strong> ve Enter&#39;a basın. </li> <li> Windows&#39;un Windows Defender&#39;ınkiler de dahil olmak üzere bozuk sistem dosyalarını taraması ve onarması biraz zaman alacaktır. </li> </ol> <p> </p> <h2 id=\"disable-windows-defender\"> 4. Windows Defender&#39;ı Devre Dışı Bırakın </h2> <p> Her şey başarısız olduğunda, Windows Defender&#39;ı tamamen devre dışı bırakmanın zamanı geldi. Bunu yapmadan önce mutlaka <a href=\"https://www.makeuseof.com/tag/best-antivirus-for-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> üçüncü taraf virüsten koruma yazılımı indirin ve yükleyin </a> Bilgisayarınızı güvende tutmak için. </p> <p> Windows Defender&#39;ı devre dışı bırakmak için şu adımları izleyin: </p> <ol> <li> Başlat menüsü arama çubuğuna Windows Güvenliği yazın ve açın. </li> <li> Kontrol panelinde, üzerine tıklayın <strong> Virüs ve tehdit koruması </strong> ve ardından üzerine tıklayın <strong> Ayarları Yönet </strong> . </li> <li> Değiştirmek <strong> Gerçek zamanlı koruma </strong> Kapalı&#39;ya. </li> <li> Çıkın ve bilgisayarınızı yeniden başlatın. </li> </ol> <p> <img alt=\"Disable Windows Defender Protection Temporarily\" src=\"images/disable-windows-defender-protection-temporarily-744.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-clean-boot-to-check-whether-a-third-party-app-may-be-responsible\"> 5. Üçüncü Taraf Bir Uygulamanın Sorumlu Olup Olmadığını Kontrol Etmek için Temiz Önyükleme kullanın      </h2> <p> Bazen üçüncü taraf uygulamalar sistem süreçlerine müdahale edebilir. Üçüncü taraf yazılımın kötü amaçlı yazılım olarak yanlış okunması da mümkündür. Sorunun nedeni olarak üçüncü taraf uygulamaları ekarte etmek için kullanıcıların temiz bir önyükleme yapması gerekir. </p> <p> İşte bunun nasıl yapılacağına dair adımlar: </p> <ol> <li> Basın <strong> Windows Tuşu + R </strong> Çalıştır komutunu açmak için Tür <strong> msconfig </strong> ve Enter&#39;a basın. </li> <li> İçinde <strong> Sistem yapılandırması </strong> pencere, git <strong> </strong><strong> Hizmetler </strong> . </li> <li> kontrol edin <strong> Bütün Microsoft Servisleri&#39;ni gizle </strong> seçenek. Ardından listedeki tüm hizmetleri kontrol etmeye devam edin. </li> <li> Tıklamak <strong> Hepsini etkisiz hale getir </strong> . </li> <li> Kaydet ve çık. </li> <li> Şimdi aç <strong> Görev Yöneticisi </strong> basarak <strong> CTRL + Üst Karakter + ESC </strong> . </li> <li> Altında <strong> Başlamak </strong> sekmesinde, her hizmeti tek tek tıklayın ve <strong> devre dışı bırak </strong> . </li> <li> Çıkın ve bilgisayarınızı yeniden başlatın. </li> </ol> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-853.png\" loading=\"lazy\"> </p> <p> Bilgisayar şimdi tüm üçüncü taraf uygulamaları devre dışı bırakılarak açılacaktır. Kullanıcılar, sorunun hala devam edip etmediğini kontrol etmelidir ve değilse, suçlu oldukları için yakın zamanda yüklenen uygulamaları kaldırmak en iyisidir. </p> <p> </p> <h2 id=\"check-for-malware-using-third-party-antivirus\"> 6. Üçüncü Taraf Antivirüs Kullanarak Kötü Amaçlı Yazılımları Kontrol Edin </h2> <p> Windows Defender&#39;ı doğrudan etkileyen virüsler vardır ve bunlar ya işleyişini bozabilir ya da tamamen devre dışı bırakabilir. Bu gibi durumlarda tek çözüm, bilgisayarı üçüncü taraf virüsten koruma yazılımı kullanarak taramaktır. </p> <p> Ancak önce, Windows Defender&#39;ın gerçekten virüslü olduğundan emin olmak için, Gerçek zamanlı korumanın otomatik olarak devre dışı bırakılıp bırakılmadığını kontrol edin ve görün. Unutmayın, bunu her zaman sağlamalısınız. <a href=\"https://www.makeuseof.com/easy-ways-boost-security-microsoft-defender-and-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows Defender, maksimum potansiyeliyle çalışıyor. </a> </p> <p> Bazı durumlarda kullanıcılar, Windows Defender&#39;ı kullanarak virüslü dosyaları (Windows Defender&#39;ın kendisi tarafından algılanır) kaldıramadıklarını bildirdi. </p> <p> <img alt=\"Windows Defender dashboard displaying current threats\" src=\"images/current-threats-windows-defender-707.jpg\" loading=\"lazy\"> </p> <p> Bu sorunu kontrol etmek için aşağıdaki adımları uygulamanız yeterlidir: </p> <ol> <li> Başlat menüsü arama çubuğuna şunu yazın <strong> Windows Güvenliği </strong> ve uygulamayı başlatın. </li> <li> Kontrol panelinde, üzerine tıklayın <strong> Virüs ve tehdit koruması </strong> . </li> <li> Altında <strong> Mevcut Tehditler, </strong> tıklamak <strong> Koruma </strong><strong> Tarih </strong> . </li> <li> Altında <strong> karantinaya alınan tehditler </strong> , tıklamak <strong> Tam geçmişi görün </strong> . </li> <li> Şimdi listeden herhangi bir tehdide tıklayın ve <strong> Kaldırmak </strong> . </li> <li> Windows Defender dosyayı kaldırırsa, her şey yolundadır, ancak dosyayı kaldıramazsa veya sonsuz bir bekleme animasyonu varsa, Windows Defender&#39;a virüs bulaşmış demektir. </li> </ol> <p> </p> <p> </p> <h2 id=\"fixing-the-antimalware-service-executable-high-cpu-usage-bug\"> Kötü Amaçlı Yazılımdan Koruma Hizmeti Yürütülebilir Yüksek CPU Kullanımı Hatasını Düzeltme </h2> <p> Yukarıdaki ipuçlarını kullanmak, bilgisayarınızın performansını ve yanıt verme hızını artıracaktır. Bilgisayarınızın hiçbir zaman kötü amaçlı yazılımlara karşı korumasız kalmadığından emin olun. Windows Defender&#39;ı devre dışı bırakmadan önce başka bir virüsten koruma yazılımı indirmeniz önerilir. </p>"}