{"title":"Windows 10&#39;un İndirilen Dosyalarınızı Engellemesini Nasıl Durdurursunuz?","content":"<p> Bir dosyayı açmaya çalıştığınızda Windows 10, dosyayı doğrudan açmanızı engelleyebilir. Dosyanın bilinmeyen bir kaynaktan geldiğine ve güvensiz olabileceğine dair bir güvenlik uyarısı gösterecektir. Bu, Ek Yöneticisi adlı bir Windows 10 özelliği, PC&#39;niz için güvenli olmadığını düşündüğü dosyaları engellediğinde gerçekleşir. </p> <p> Her bir dosyanın engellemesini manuel olarak kaldırabilseniz de, özellikle de indirdiğiniz hemen hemen her dosya için bunu yapmanız gerekiyorsa, bu yorucu bir süreç olabilir. Bu makalede, Windows 10&#39;un indirdiğiniz dosyaları engellemesini nasıl durdurabileceğinizi göstereceğiz. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> Windows 10&#39;da Ek Yöneticisi nedir? </h2> <p> Windows 10&#39;da, güvenli olmayan dosyaları açmanızı engelleyen Ek Yöneticisi adlı bir güvenlik özelliği vardır. Bunlar, indirdiğiniz dosyalar veya <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows&#39;un güvenli olmayan e-posta ekleri olarak tanımladığı dosyalar </a> . Ek Yöneticisi bir dosyanın güvenli olmadığını düşünürse, Windows 10&#39;un dosyayı açmasını engeller ve bir uyarı mesajı görüntüler. Ek Yöneticisi, indirdiğiniz dosyaları dosya türüne ve dosya adı uzantısına göre sınıflandırır. </p> <p> Windows Ek Yöneticisi, dosya türünü, dosya ilişkilendirmesini bulmak ve yapılacak en uygun eylemi belirlemek için IAttachmentExecute uygulama programlama arabirimini (API) kullanır. Dosyaları indirip diskinize kaydettiğinizde, Windows bu dosyalara belirli meta veriler ekler. Bu meta veriler ek olarak kabul edilir. Windows, indirme dosyalarına ek olarak meta veriler eklediğinde, buna Bölge Bilgileri denir. </p> <p> Şimdi <strong> Bölge Bilgileri </strong> meselenin kökü burada yatıyor. Dosya Gezgini bir dosyayı açtığında, aynı yerde saklanan ekli Bölge bilgilerini okur ve dosyanın bilinmeyen bir kaynaktan gelip gelmediğini kontrol eder. Windows, dosyanın tanınmadığını veya bilinmeyen kaynaklardan geldiğini tespit ederse, dosyayı açmanızı engeller. </p> <p> Aşağıdakileri belirten bir Windows SmartScreen uyarısı görünecektir: </p> <blockquote> <p> Windows SmartScreen, tanınmayan bir uygulamanın başlatılmasını engelledi. Bu uygulamayı çalıştırmak PC&#39;nizi riske atabilir. </p> </blockquote> <p> Engellenen bir dosyayı manuel olarak açmak istiyorsanız, indirilen dosyaya sağ tıklayın ve ardından <strong> Özellikleri </strong> . Genel sekmesinde, <strong> engeli kaldırmak </strong> , Tıklayın <strong> Uygulamak </strong> ve ardından tıklayın <strong> TAMAM MI </strong> . </p> <p> Ancak, bir dosyayı her indirdiğinizde bunu yapmanız gerektiğini düşünün; bu can sıkıcı ve zaman alıcı olabilir. İnternetten sık sık dosya indiriyorsanız veya e-posta eki olarak dosya alıyorsanız, bilgisayarınızın dosyalarınızı engellemesini tamamen durdurmak isteyebilirsiniz. </p> <p> Windows 10&#39;un dosyalarınızı açmanızı engellemesini durdurmak için, indirdiğiniz dosyalara Bölge Bilgileri eklemesini engellemeniz gerekir. Bunu, Yerel Grup İlkesi Düzenleyicisi&#39;ni veya Kayıt Defteri Düzenleyicisi&#39;ni kullanarak Ek Yöneticisi&#39;ni manuel olarak yapılandırarak yapabilirsiniz. </p> <p> Bunu nasıl yapabileceğinize dair adımlar sağlayacağız. Yönetici olarak oturum açmalısınız veya <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> yönetici hakları iste </a> indirilen dosyaların engellenmesini durdurabilmek için. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Kayıt Defteri Düzenleyicisini Kullanarak Ek Yöneticisini Yapılandırın </h2> <p> basın <strong> Windows Tuşu + R </strong> Kayıt Defteri Düzenleyicisi&#39;ni açmak için. Oradan &quot;Regedit&quot; yazın ve tıklayın <strong> Giriş </strong> . Bir Kullanıcı Hesabı Denetimi istemi açılacaktır. Bu istem göründüğünde, <strong> Evet </strong> devam etmek için düğmesine basın. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Kayıt Defteri Düzenleyicisi&#39;ndeki Ekler anahtarına gidin: <strong> HKEY_CURRENT_USER &gt; Yazılım &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; İlkeler &gt; Ekler </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> İlkeler anahtarında Ekler anahtarı yoksa, onu oluşturmanız gerekir. Bunu yapmak için sağ tıklayın <strong> Politikalar </strong> anahtar, tıklayın <strong> Yeni </strong> , Tıklayın <strong> Anahtar </strong> . Bu, daha sonra &quot;Ekler&quot; olarak adlandırmanız gereken yeni bir anahtar oluşturacaktır. Ekler anahtarının zaten mevcut olduğunu fark ederseniz, sonraki adıma geçebilirsiniz. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> üzerine sağ tıklayın <strong> ekler </strong> anahtar, tıklayın <strong> Yeni </strong> ve sonra seçin <strong> DWORD (32-bit) Değeri </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Bu yeni oluşturulan DWORD değerini adlandırmanız istenecektir. &quot;SaveZoneInformation&quot; olarak adlandırın ve tıklayın <strong> Giriş </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> Son olarak, Windows 10&#39;da Ek Yöneticisini devre dışı bırakmak için, yeni oluşturulan dosyaya çift tıklayın. <strong> SaveZoneInformation </strong> değer ve değer verisini 1 olarak değiştirin. <strong> TAMAM MI </strong> bitirmek için. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Bu adımları tamamladığınızda, Kayıt Defteri Düzenleyicisi&#39;ni kapatın ve değişiklikleri uygulamak için bilgisayarınızı yeniden başlatın. Buradan itibaren, indirdiğiniz herhangi bir dosya artık dosyanın alternatif veri akışına Bölge Bilgisi eklemeyecektir. Bu, dosyalarınızı herhangi bir zorluk çekmeden açmanıza izin verecektir. </p> <p> Geri dönüp Ek Yöneticisini etkinleştirmek isterseniz, bunu Kayıt Defteri Düzenleyicisi&#39;ndeki Ekler anahtarına giderek yapabilirsiniz: <strong> HKEY_CURRENT_USER &gt; Yazılım &gt; Microsoft &gt; Windows &gt; CurrentVersion &gt; İlkeler &gt; Ekler </strong> . Buradan, sağ tarafta, üzerine çift tıklayın. <strong> SaveZoneInformation </strong> değer ve değer verilerini 3 olarak değiştirin. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Yerel Grup İlkesi Düzenleyicisini Kullanarak Ek Yöneticisini Yapılandırma </h2> <p> Yerel Grup İlkesi Düzenleyicisi yalnızca Windows 10 Enterprise, Education ve Pro sürümlerinde mevcuttur. Sonuç olarak, Windows 10 Home sürümüne sahipseniz bu yöntem geçerli değildir. Bilgisayarınız Windows 10 Home sürümünde çalışıyorsa Ek Yöneticisini Kayıt Defteri Düzenleyicisi aracılığıyla yapılandırmanız gerekir. </p> <p> Yerel Grup İlkesi Düzenleyicisine sahip bir Windows 10 sürümü kullanıyorsanız, burada belirtilen adımları kullanarak Ek Yöneticisi&#39;ni yapılandırabilirsiniz. </p> <p> Başlamak için, <strong> Windows Tuşu + R </strong> , &quot;gpedit.msc&quot; yazın ve tıklayın <strong> Giriş </strong> Yerel Grup İlkesi Düzenleyicisini açmak için </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Ek Yöneticisine gidin: <strong> Kullanıcı Yapılandırması &gt; Yönetim Şablonları &gt; Windows Bileşenleri &gt; Ek Yöneticisi </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> Ek Yöneticisinin sağ bölmesinde, <strong> Dosya eklerinde bölge bilgilerini saklamayın </strong> Bölge Bilgisi ayarlarını düzenleme politikası. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> Ek Yöneticisinin Bölge Bilgilerini koruyup korumayacağını seçebileceğiniz bir pencere açılacaktır. </p> <p> Tıklayın <strong> Etkin </strong> Ek Yöneticisinin Bölge Bilgilerini saklamamasına izin vermek için. Bu, Windows&#39;un dosyalarınızı her açtığınızda engellememesini sağlar. Tıkla <strong> Uygulamak </strong> değişiklikleri kaydetmek için düğmesine ve ardından <strong> TAMAM MI </strong> . </p> <p> Bitirdiğinizde, Yerel Grup İlkesi Düzenleyicisini kapatın ve değişiklikleri kaydetmek için bilgisayarınızı yeniden başlatın. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows Artık Dosyalarınızı Engellemeyecek </h2> <p> Daha önce indirdiğiniz dosyaların çoğunun engelini manuel olarak kaldırmak zorunda kalsaydınız, bu işlemin ne kadar yorucu olabileceğini fark etmişsinizdir. Bu ipuçlarını uyguladığınızda, tüm dosyalarınızı kolaylıkla açma özgürlüğüne sahip olacaksınız. </p> <p> Dosyaları indirir ve güvenilirliklerinden bir şekilde şüphe ederseniz, PC&#39;nizin ve verilerinizin güvende olduğundan emin olmak için bunları her zaman güvenli yalıtılmış ortamlarda açabilirsiniz. </p>"}