{"title":"Yine Resmi Olmayan Bir PS5 Faceplate Markası Sahnede","content":"<p> Çeşitli cihazlar için kaplamalar, ekranlar ve kılıflar üreten dbrand, Sony-baiting&#39;e katıldı ve kendi resmi olmayan PS5 ön yüzünü piyasaya sürdü. </p> <h2 id=\"dbrand-releases-darkplates\"> dbrand Darkplates&#39;i Piyasaya Sürüyor </h2> <p> PS5&#39;inizi kişiselleştirmek istiyorsanız, dbrand, yeni nesil konsol için resmi olmayan üçüncü taraf ön yüzleri sunan en son şirkettir. Siyah koruyucu oldukları için onlara Darkplates diyorlar. </p> <p> Plakaları şuradan kontrol edebilirsiniz: <a href=\"https://dbrand.com/shop/special-edition/ps5\" target=\"_blank\" rel=\"nofollow noopener\"> marka mağazası </a> , mat siyah ön yüzleri 49,00 $ karşılığında satın alabileceğiniz yer (yazarken). </p> <p> Ayrıca, dbrand&#39;ın &quot;orta ten&quot; dediği, PS5&#39;teki yüksek parlaklıkta, siyah, orta panelin üzerinden geçen bir vinil çıkartma olan şeyi de alabilirsiniz. Bu ekstra 11,95 $&#39;a mal oluyor ve çeşitli renk ve tasarımlarda mevcut. </p> <p> <img alt=\"dbrand shell texture detail\" src=\"images/dbrand-shell-texture-detail-544.png\" loading=\"lazy\"> </p> <p> Ayrıca ön yüz dokusuyla övündüğünü fark edeceksiniz. Bu şuna benzer <a href=\"https://www.makeuseof.com/sony-how-ps5-controller-textured-playstation-symbols/\" target=\"_blank\" rel=\"nofollow noopener\"> DualSense&#39;te bulacağınız küçük PlayStation sembolleri </a> , diğer resmi PS5 aksesuarları ve satın aldığınızda konsola bağlı olarak gelen birinci taraf ön yüzleri. Benzer, ama onlar kadar etkileyici mi? </p> <p> </p> <h2 id=\"will-dbrand-last\"> dbrand Sürecek mi? </h2> <p> şüphesiz bizimkileri gördün <a href=\"https://www.makeuseof.com/cmp-shells-ps5-faceplate-colors/\" target=\"_blank\" rel=\"nofollow noopener\"> CMP Kabukları ile ilgili ön yüz kapağı kapsamı </a> , bu da Sony yasağından sonra oldukça başarılı bir dönüş yaptı. Bazıları, yeni koruyucu çerçevelerini yasal olarak dokunulmaz ilan ettiği için geri dönüşünün kibirli olduğunu söyleyebilir. Göreceğiz. </p> <p> </p> <p> Bu, dbrand&#39;ın neden rahatsız olduğunu merak etmenizi sağlar. kategorik olarak Sony <strong> yapmadı </strong> CMP Shells&#39;e nazik davranın, çünkü eski marka adı PlayStation&#39;a (PlateStation) çok benziyordu. </p> <p> Ardından Sony, ön panellerin konsol tasarımının bir parçası olduğuna karar verdiği için konuyu ele aldı ve bu nedenle bunları kopyalamanın fikri mülkiyet ihlali olduğuna karar verdi. Yasak tokmağının vuruşunu işaretleyin. CMP Shells, yeni haliyle yeniden ortaya çıkmadan önce tüm siparişleri iptal ederek üretimi sonlandırdı. </p> <p> dbrand, satış öncesi potansiyel olarak karşılanmamış müşterilerin dördüncü dalgasındadır, bu nedenle özel ön yüzlerden birini almak istiyorsanız hızlı olmalısınız. Plakaların gerçekten üretime ulaşıp ulaşmayacağı başka bir konudur. Sony tokmağı tekrar indirebilir. </p> <p> </p> <h2 id=\"should-you-buy-a-dbrand-faceplate\"> Bir dbrand Faceplate satın almalı mısınız? </h2> <p> CMP Shells destanında olduğu gibi, PS5 ön yüzlerini özelleştirmekle ilgilenen herkese dikkatli olmalarını tavsiye ediyoruz. Bunlar üçüncü taraf ürünlerdir ve bu nedenle kalitelerini markanın size söyledikleri dışında teyit etmenin bir yolu yoktur. </p> <p> Ayrıca, Sony&#39;nin PlateStation&#39;ın (şimdi CMP Shells) üretimi durdurmak zorunda kalması konusundaki ısrarı göz önüne alındığında, dbrand&#39;ın davasına da girmek için avukatlarını hızlı aramaması sürpriz olmayacaktır. </p> <p> Kısacası, yüz plakalarınızı özelleştirmek istiyorsanız dikkatli olun. CMP Shells ilk defa tüm müşterilerine para iadesi yaptı. Ancak bu, başka bir markanın yapacağı anlamına gelmez. </p> <p> </p> <h2 id=\"do-you-really-need-to-customize-your-ps5\"> PS5&#39;inizi Gerçekten Özelleştirmeniz Gerekiyor mu? </h2> <p> <img alt=\"ps5\" src=\"images/ps5-183.jpg\" loading=\"lazy\"> </p> <p> PS5&#39;inizin görünümünden memnun değilseniz, onu her zaman başka (önemli ölçüde daha ucuz) yollarla değiştirebilirsiniz. Farklı görünmesini istiyorsanız, konsola her zaman bir vinil kaplama ekleyebilirsiniz. </p> <p> PS5 yalnızca Kasım 2020&#39;de piyasaya sürüldü. Konsolunuzun kozmetik görünümünü değiştirmek için karşı konulmaz bir dürtü hissetmeden önce belki de üzerinde birkaç oyun oynamayı deneyin. </p>"}