{"title":"Yakında Epic&#39;in Metaİnsan Karakterleriyle Oyun Oynayacaksınız","content":"<p> Oyunların şimdi gerçekçi göründüğünü düşünüyorsanız, Epic Games&#39;in Unreal Engine&#39;i ile yaptığı işlerin bir kısmını görene kadar bekleyin. Aklını uçurmaya hazırlanın. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games Yeni MetaHumans&#39;ı Tanıttı </h2> <p> Muhtemelen nasıl bir dünyadan bahsettiğimizi merak ediyorsundur. MetaHuman Creator, Epic Games&#39;in Unreal Engine&#39;e eklediği en son özelliktir; oyun geliştiricilerin başlıklarını oluşturmak için kullanabilecekleri bir yazılım geliştirme ortamı. </p> <p> bir göre <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Unreal Engine blog yazısı </a> heyecan verici yeni geliştirme aracını duyurarak: </p> <blockquote> <p> MetaHuman Creator, kaliteden ödün vermeden gerçek zamanlı dijital insan yaratmayı haftalar veya aylardan bir saatten daha kısa bir süreye çekmek için tasarlanmış, bulutta yayın yapan bir uygulamadır. </p> </blockquote> <p> Bu nedenle, oyun geliştiricisinin inanılmaz derecede gerçekçi insan kopyaları oluşturmasının bir yoludur. Hızlı. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> MetaHuman Creator Geliştiriciler İçin Ne İfade Eder? </h2> <p> </p> <p> Bunun yazılım geliştirme üzerindeki etkileri oyunun değişmesidir (punto amaçlı). Geliştiricilerin MetaHuman Creator kullanarak oyun dünyalarını NPC&#39;lerle ne kadar hızlı dolduracağını hayal edin. Sadece bu değil, dijital insanlar da inanılmaz görünüyor. </p> <p> Bu aynı zamanda geliştiricilerin oyunları daha hızlı bitirebilecekleri anlamına gelir, böylece sayısız gecikmeyi beklemek zorunda kalmazsınız. MetaHuman Creator, geliştiricilerin NPC popülasyonlarını hızlı bir şekilde oluşturmalarına olanak tanıyarak diğer, daha acil konulara zaman bırakır. </p> <p> Ama neden bu araca ihtiyaç var? Epic Games&#39;in açıklaması: </p> <blockquote> <p> Tek bir yüksek kaliteli dijital insan yaratmak zor ve zaman alıcıdır. Yeni nesil platformların ve üst düzey sanal üretimin gerektirdiği kalitede çok sayıda farklı dijital insan yaratma çabasını ölçeklendirmek gerçekten de zorlu bir iştir. </p> </blockquote> <p> Yani dediğimiz gibi; araç zamandan tasarruf sağlar ve iş akışını iyileştirerek geliştiricilerin yeni nesil konsollara hak ettikleri oyunları vermelerine olanak tanır. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> MetaHuman Creator Oyunları Nasıl Etkileyecek? </h2> <p> Eh, MetaHuman Creator sayesinde, oyunlar başlangıç ​​için çok daha hızlı çıkış görebilir. Geliştiriciler, ellerinde bunun gibi güçlü araçlarla oyun mekaniklerini geliştirebilir veya bozuk bir oyun yayınlamadan önce hataları düzeltmek için daha fazla zaman harcayabilir... </p> <p> Her neyse, acı bir yana, Epic&#39;in geliştirme aracı oyunların daha iyi görünmesini sağlayacak bir şeye benziyor. Dijital insanların gerçekte ne kadar nefes kesici olduğunu görmek için renderlere bakmanız yeterli. Onları oyunlarda gördüğümüzde, gerçek sihir gerçekleşecek. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> MetaHumans&#39;ı Oyunlarda Ne Zaman Göreceğiz? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> Bunu söylemek zor. Şu anda Epic, Creator yazılımını &quot;önümüzdeki birkaç ay&quot; içinde erken erişim testi için sabitledi. Yani yakın zamanda herhangi bir MetaHuman görmeyeceksiniz. </p> <p> Kendi dijital insanınızı yaratmayı seviyorsanız, Unreal Engine&#39;in MetaHuman Creator&#39;ını kullanmak istiyorsanız beklemelisiniz. Birini başka bir programda bir araya getirmeyi her zaman deneyebilirsiniz, ancak kesinlikle bir saatten az sürmez! </p>"}