{"title":"Yeni Araştırma, Android Kullanıcılarının iPhone Kullanıcılarından Daha İyi Ortaklar Olduğunu Söylüyor","content":"<p> iPhone ve Android akıllı telefon kullanıcıları arasında bitmeyen bir savaş sürüyor. Savaşa katılmayanlar bile sadece akıllı telefonlarını seçerek taraf seçtiler. </p> <p> Savaşta yeni bir kırışıklık var, <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> KarşılaştırMyMobile </a> iPhone veya Android kullanıcılarının daha iyi ilişki ortakları olup olmadığı konusunda yakın zamanda bir araştırma yaptı. Görünen o ki, iPhone kullanıcıları Android kullanıcılarından daha fazla sinir bozucu telefon alışkanlıklarına sahipler ve bu da Android kullanıcılarının daha iyi iş ortakları olduğu sonucuna yol açıyor. </p> <p> Tabii ki, verilerde bu basit sonuçtan daha fazlası var, o yüzden biraz daha derine inelim ve bir göz atalım. </p> <h2 id=\"iphone-and-android-relationship-study\"> iPhone ve Android İlişki Çalışması </h2> <p> Çalışmanın genel sonucu, Android kullanıcılarının iPhone kullanıcılarından daha iyi ortaklar olduğu, ancak sonuçların bu yüzeysel sonuçtan çok daha derine indiği yönünde. Toplamda, çalışma 2.000&#39;den fazla kullanıcıyı araştırdı, bu nedenle oldukça büyük bir örneklem büyüklüğü sunuyor. </p> <p> En sinir bozucu akıllı telefon alışkanlıklarına bakıldığında, çalışma, iPhone kullanıcılarının Android sahibi meslektaşlarına göre suç işleme olasılığının yüzde 12 daha fazla olduğunu buldu. Aslında, iPhone kullanıcıları, anketin her bir kategorisinde Android kullanıcılarından daha fazla telefon kullanımı vahşeti gerçekleştirdi. </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> Can sıkıcı suçların bazı örnekleri arasında, partnerini okumaya devam etmek, bir film sırasında telefonlarını kullanmak ve hatta araba kullanırken telefonlarını kullanmak (ki bu sadece can sıkıcı değil, aynı zamanda inanılmaz derecede tehlikelidir) sayılabilir. iPhone kullanıcılarının telefonlarını düşürme ve kırma olasılıkları, gerçekten şaşırtıcı bir istatistik olan Android kullanıcılarına göre daha fazladır. </p> <p> Diğer bazı can sıkıcı alışkanlıklar şunları içerir: <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> diğer insanların sosyal medya profillerinde sürünen </a> , fotoğraflarda aşırı filtreler kullanmak, birden fazla tek satırlık mesaj göndermek (bunu çok fazla yaptığımı biliyorum) ve sohbet ederken telefonlarını kullanmak. </p> <p> İlginç bir şekilde, çalışma aynı zamanda erkeklerin rahatsız edici (ve bazı durumlarda düpedüz güvensiz) alışkanlıkların çoğunu kadınlardan daha fazla gerçekleştirme olasılığının daha yüksek olduğunu buldu. </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> Ancak Apple Kullanıcıları Daha Fazla Tarih Alır </h2> <p> CompareMyMobile tarafından yayınlanan başka bir araştırmaya göre, iPhone kullanıcılarının çevrimiçi flört uygulamalarında randevu alma olasılığı daha yüksek. 50.000&#39;den fazla kaydırmayı inceleyen çalışma, bir flört uygulaması aracılığıyla konuşurken iPhone kullanıcılarının randevu alma olasılığının Android ahizesi olan birine göre yüzde 76 daha fazla olduğunu buldu. </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> İlk araştırmaya inanılırsa, iPhone kullanıcısının sürüş sırasında diğer sosyal medya profillerine girmesi ve mesajlaşması nedeniyle ilişki yürümeyebilir. Yine de, önceki ilişki yürümediğinde bir sonraki ortaklarını bulma olasılıkları daha yüksektir. </p> <p> Sonunda, flört asla kolay değildir. Bu yüzden telefonunuzun iyi bir şeyi öldüren cihaz olmasını önlemek için elinizden gelenin en iyisini yapın! </p>"}