{"title":"Yeni Microsoft Teams Pro&#39;yu Ücretsiz Olarak Alabilirsiniz","content":"<p> Kısa bir süre önce, yazılım için ek özelliklerin kilidini açacak olan &quot;Teams Pro&quot; adlı Microsoft Teams için planlanmış bir abonelik hizmetini ele aldık. Ancak Microsoft, bazı kişilerin mevcut planlarına ek ücret ödemeden Teams Pro alacağını söylemek için kayda geçti. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Microsoft&#39;un Ücretsiz Teams Pro Aboneliklerine İlişkin Açıklaması </h2> <p> Hatırlatmaya ihtiyacınız olursa, bu konuyu daha önce başlıklı yazımızda ele almıştık. <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro, hizmete web seminerleri ekliyor </a> . </p> <p> Şimdi, bir makale <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> aynı konuda o zamandan beri Microsoft&#39;tan bir açıklama aldı. Açıklama, web seminerleri için fazladan ödeme yapmaktan endişe duyan insanlar için iyi bir haber: </p> <blockquote> <p> 9 Şubat&#39;ta yeni Teams Pro hizmet planıyla ilgili bir MC gönderisi yayınladık. Açıklığa kavuşturmak gerekirse, bu yeni hizmet planının eklenmesiyle mevcut ürün lisanslarında herhangi bir değişiklik yoktur. Bunun yerine hizmet planı, Microsoft 365 ve Office 365 E5/E3/A5/A3 ve Microsoft 365 Business Standard/Business Premium lisanslarına otomatik olarak eklenecek ve bu SKU&#39;lar için lisanslanan kullanıcıların, Takımlar yakın zamanda. </p> </blockquote> <p> Microsoft, yöneticilerin bu yeni özellikleri etkinleştirmek için hiçbir şey yapmalarına gerek olmadığını belirtiyor. Ayrıca, yukarıda listelendiği gibi uyumlu bir lisansa sahip olan herkes, bu parlak yeni özellikleri hiçbir ek ücret ödemeden alacak. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Microsoft Teams ile Aynı Şeye Daha Fazlasını Elde Edin </h2> <p> Microsoft, web seminerlerinin ve daha fazlasının kilidini açan yeni bir Teams Pro abonelik planı sunuyor, ancak herkesin bunun için fazladan ödeme yapması gerekmeyecek. Yukarıdaki lisanslardan birine abone olduysanız, tüm Teams Pro özelliklerini ekstra hiçbir şey ödemeden almayı dört gözle bekleyebilirsiniz. </p> <p> Bu, Teams Pro&#39;ya sahip olmayan kişilerin gölgede kalacağı anlamına gelmez. Örneğin, herkes yakında Microsoft Teams&#39;deki kullanışlı bir özet özelliğine erişebilecek. </p> <p> <small> İmaj Kredisi: Postmodern Stüdyo / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}