{"title":"10 речей, про які ви не знали, Документи Google могли б зробити","content":"<p> Документ Google може здаватися базовим на перший погляд, але інструмент хмарної продуктивності має багато пропущених функцій, які можуть допомогти вам зробити більше на роботі. </p> <p> У цій статті ми розглянемо кілька функцій Google Doc, про які ви, мабуть, не знали, та те, як ви можете використовувати їх, щоб заощадити час на створення вмісту. </p> <p> Зверніть увагу, що ці функції в основному доступні у настільній версії інструмента Google Docs. Будуть вказані ті, які також можна використовувати в мобільній версії. </p> <h2 id=\"voice-typing\"> 1. Голосовий ввід </h2> <p> Щоб скористатися функцією голосового введення, відкрийте документ і натисніть <strong> Інструменти </strong> з рядка меню у верхній частині сторінки. Виберіть <strong> Голосовий ввід </strong> зі спадного меню. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> На екрані з’явиться мікрофон із меню мови, де ви зможете вибрати бажану мову розмови. Коли ви будете готові вимовити текст, клацніть мікрофон або натисніть <strong> Cmd + Shift + S </strong> (якщо ви використовуєте Mac) або <strong> Ctrl + Shift + S </strong> (якщо ви використовуєте ПК з ОС Windows), щоб розпочати запис. </p> <p> Щоб додати розділові знаки між текстом, скажіть назву пунктуаційного знака, який потрібно додати, наприклад „крапка”, „кома” або „знак запитання”. Ви можете дати вказівки щодо форматування, наприклад „новий рядок” або „новий абзац”, або „припинити прослуховування”, якщо хочете зробити перерву в голосовому наборі тексту, і „відновити”, коли будете готові продовжити. </p> <p> Знайдіть із цього пункту додаткові команди редагування <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> список команд </a> на сторінці підтримки Google. </p> <p> Ви також можете використовувати цю функцію для транскрипції будь-якого аудіо. Просто відтворіть аудіо (із телефону або будь-якого іншого пристрою) на перетворення голосу в текст, і він повинен це ввести для вас. Можливо, вам доведеться зробити кілька редагувань, але ви заощадили б багато часу. </p> <p> </p> <p> Функція голосового набору доступна лише на робочому столі, але вона працює лише в браузері Chrome. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Редагування в автономному режимі </h2> <p> Багато людей люблять Документи Google за миттєву функцію збереження в хмарі, але це може бути незручно, якщо у вас якийсь час немає доступу до Інтернету. Хороша новина полягає в тому, що ви все ще можете отримувати доступ до файлів і редагувати їх у режимі офлайн. </p> <p> Ця функція доступна лише в Google Chrome, і вам потрібно буде встановити та активувати <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Розширення Google Docs офлайн для Chrome </a> . Також переконайтеся, що ви не переглядаєте дані в приватному режимі. </p> <p> Цю функцію потрібно встановити, коли ви в Інтернеті, але коли це буде зроблено, ви зможете писати та редагувати текст в автономному режимі, і тоді вони зберігатимуться у хмарі, коли ви отримаєте доступ до Інтернету. Ось як. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> Щоб зробити можливим <strong> відкривати та зберігати файли Документів Google в автономному режимі </strong> , слідуйте <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> ці інструкції </a> . Ця функція доступна на ПК, iOS та Android. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Відстеження / відновлення історії версій документа </h2> <p> Якщо ви працюєте над документом самостійно або з іншими, ви можете відстежувати зміни в документі за допомогою функції Історія версій. </p> <p> Ви також можете тимчасово або назавжди відновити документ до попередньої версії; функція, яка може стати порятунком, якщо ви випадково видалите частини документа і не можете використовувати <strong> Скасувати </strong> , щоб відновити їх. </p> <p> Щоб скористатися функцією історії версій, натисніть <strong> Файл </strong> у рядку меню та виберіть <strong> Історія версій </strong> зі спадного меню. Ви побачите, що ви також можете назвати версію, тому ви можете використовувати її для відстеження постійних змін у документі, особливо якщо інші користувачі вносять зміни до цього самого документа. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Ця функція доступна лише на робочому столі. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Режим пропозиції та перегляду </h2> <p> Хоча чудово співпрацювати з іншими та редагувати документ разом, буває важко (і брудно) відстежувати зміни, які вніс кожен. </p> <p> Функція &quot;Пропонування&quot; дозволяє вам просто пропонувати зміни, якщо ви не хочете змінювати документ взагалі. Ваші пропозиції з’являться у редакторі як коментарі на бічній панелі, і редактор може негайно вносити зміни, приймаючи пропозицію. Ви також можете продовжувати ланцюжки розмов за допомогою <strong> Відповісти </strong> , тому ви можете надсилати та отримувати відгуки прямо на сторінці документа, не надсилаючи електронних листів туди-сюди. </p> <p> Щоб запропонувати зміни, клацніть на піктограму олівця для режиму редагування у верхньому правому куті вашого відкритого документа, а потім виберіть <strong> Підказуючи </strong> . </p> <p> Щоб переглянути документ без пропозицій, натисніть <strong> Перегляд </strong> . Ви зможете читати без закреслення та спливаючих вікон. </p> <p> Щоб заощадити час, ви можете одночасно прийняти або відхилити всі пропозиції. Клацніть <strong> Інструменти </strong> , потім виберіть <strong> Перегляньте запропоновані редагування </strong> . Клацніть <strong> Прийміть усіх </strong> або <strong> Відхилити все </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Ця функція доступна лише на робочому столі. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Додайте шрифти </h2> <p> Якщо ти коли-небудь захочеш <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> стилізуйте текст </a> щоб відповісти вашому повідомленню, ви можете зробити це і за допомогою Документів Google. Окрім 24 шрифтів за замовчуванням, які вже запрограмовані в інструменті Google Docs, ви можете додати кілька цікавих шрифтів на ваш вибір для візуального підсилення тексту. </p> <p> Щоб додати шрифти, просто натисніть на <strong> Шрифти </strong> у рядку меню та виберіть <strong> Більше шрифтів </strong> . Виберіть із запропонованої колекції скільки завгодно шрифтів. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Ця функція доступна лише на робочому столі. </p> <p> </p> <h2 id=\"compare-documents\"> 6. Порівняйте документи </h2> <p> Це ще одна функція, за допомогою якої ви можете відстежувати зміни, внесені в документ самостійно або співавтором. Це особливо корисно для великих документів, і, як випливає з назви, ви можете порівняти два документи, щоб переглянути відмінності між ними. </p> <p> Щоб скористатися цією функцією, відкрийте базовий документ, для якого потрібно зробити порівняння, а потім натисніть на <strong> Інструменти </strong> і виберіть <strong> Порівняйте документи </strong> . </p> <p> У діалоговому вікні, що з’явиться, виберіть на Диску документ, з яким ви хочете порівняти його, і натисніть <strong> Порівняйте </strong> . В <strong> Віднести відмінності до </strong> поле, введіть ім’я співавтора, який буде автором запропонованих редагувань у кінцевому документі. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> Відмінності будуть показані так само, як і в <strong> Підказуючи </strong> ми обговорили вище, і ви також можете прийняти або відхилити зміни. </p> <p> Ця функція доступна лише на робочому столі. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Знайти та замінити </h2> <p> Якщо вам коли-небудь доведеться замінити кілька випадків помилки у вашому тексті, Документи Google спрощують це за допомогою функції Знайти та замінити. </p> <p> Для користувачів, які знайомі з функцією Знайти та замінити в Microsoft Word, це працює точно так само. </p> <p> Щоб знайти певне слово чи фразу у вашому документі, скористайтесь комбінацією клавіш <strong> Ctrl + F </strong> на ПК з ОС Windows або <strong> Command + F </strong> на Mac. Введіть слово в поле &quot;Знайти в документі&quot;. </p> <p> Щоб замінити знайдений текст, клацніть на три крапки праворуч і виберіть <strong> Знайти та замінити </strong> . </p> <p> Потім введіть текст у <strong> Знайдіть </strong> поле та текст заміни в <strong> Замінити </strong> поле. Прокрутіть текстові екземпляри курсором вгору та вниз і натисніть <strong> Замінити </strong> обміняти їх окремо. Або натисніть <strong> Замінити все </strong> щоб замінити весь виділений текст одночасно. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Використовуйте словник </h2> <p> Щоб допомогти вам зосередитись і уникнути необхідності перемикатися між вкладками, коли ви шукаєте значення слова, Документи Google мають словник, що продається в додатку. </p> <p> Коли ви вводите текст і вам потрібно знайти слово, виділіть його, клацніть правою кнопкою миші та виберіть <strong> Визначте </strong> з меню. Інструмент &quot;Словник&quot; буде шукати визначення слова в Інтернеті, і воно з’явиться в правій частині екрана. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Додайте мовні наголоси </h2> <p> Попрощайтеся із запам’ятовуванням акцентованих комбінацій клавіш або копіюванням / вставленням наголошених букв з інших документів. </p> <p> Щоб використовувати букви з наголосом, вам доведеться завантажити <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> доповнення &quot;Легкі акценти&quot; </a> . Це дозволяє вставляти акценти для 20 різних мов безпосередньо з бічної панелі у вашому документі. </p> <p> Завантажте надбудову Google Doc, відкривши <strong> Інструменти </strong> меню, потім натисніть на <strong> Додатки </strong> і <strong> Отримайте доповнення </strong> . У вікні Google Marketplace, що з’явиться, знайдіть <strong> Легкі наголоси </strong> та натисніть синю кнопку встановлення, щоб додати її до своєї колекції надбудов Google Docs. </p> <p> Після встановлення натисніть на <strong> Додатки </strong> меню, щоб вибрати надбудову Easy Accents і розпочати додавати правильні наголоси для всіх ваших іноземних слів. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Це доповнення доступне лише на робочому столі, але мобільні клавіатури, як правило, підтримують мовні акценти, тому ви зможете писати текст із позначками наголосу на телефоні без надбудови. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Створіть власні ярлики </h2> <p> Більшість людей знайомі з <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Ярлики Microsoft Word </a> , але ви також можете створити власні ярлики в Документах Google. Щоб створити власні ярлики, натисніть <strong> Інструменти&gt; Налаштування&gt; Заміна. </strong> Ви виявите, що вже існує кілька ярликів для дробу та символів (як, наприклад, зміна 3/4 на 3/4), але сміливо додайте деякі свої. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Ця функція доступна лише на робочому столі. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Зробіть більше за допомогою Документів Google </h2> <p> Тепер, коли ви вивчили ці інструменти Google Docs, ви можете використовувати їх під час створення наступного документа. Сподіваємось, вони полегшать вам справи! </p>"}