{"title":"5 речей, які можуть назавжди заборонити вам користуватися Facebook","content":"<p> Facebook не такий відомий як Twitter для видалення облікових записів. Однак є деякі заборонені правопорушення, на які Facebook реагує не лише попереджувальним ярликом. </p> <p> Тут ми досліджуємо умови використання Facebook і те, де компанія підводить межу, переглядаючи історичні приклади користувачів, які Facebook «деформував» за свою поведінку. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> Позиція Facebook щодо постійних заборон </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> На відміну від інших сайтів у соціальних мережах, Facebook не перелічує багато правопорушень, наслідком яких є постійна заборона. Натомість він вказує на першочергові злочини, а не на тяжкість злочинів. В результаті, теоретично, будь-яке порушення Facebook, яке повторюється досить часто, може призвести до блокування профілю. </p> <p> Однак невелика кількість дій призводить до повної заборони, і Facebook напрочуд в&#39;ялий з деякими визнаними незаконними діями. Наприклад, продавати &quot;контрольовані товари&quot;, такі як зброю та марихуану, заборонено на Marketplace Facebook, але Facebook не вважає це забороненим злочином. </p> <p> Facebook воліє позначати або видаляти вміст поштою, на відміну від видалення профілів. Однак є винятки. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Зловживання інструментами та даними </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> Умови використання Facebook викладають три заборонені правопорушення. Перший - це збірник дій, який далі розглядається детальніше. Другий та третій є більш конкретними та пов’язані із зловживанням інструментами та даними Facebook. </p> <p> Цей загальноприйнятий термін використання забороняє доступ та використання частин сайту, які передбачається зарезервувати для розробників. Він також забороняє використовувати інструменти загальнодоступних сайтів навмисно зловмисно, як наприклад, використання Facebook для розповсюдження вірусів та шкідливих програм. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Загрози громадській безпеці </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Одним з єдиних випадків, коли Facebook заявляє, що відключає облікові записи, є &quot;справжній ризик нанесення фізичної шкоди або прямих загроз громадській безпеці&quot;. Facebook також видаляє профілі, які &quot;проголошують насильницьку місію або беруть участь у насильстві&quot;. </p> <p> Це було підставою для безстрокової заборони тодішнього президента Дональда Трампа після заворушень у Капітолії США в січні 2021 року. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Асоціація з насильницькими групами </h2> <p> Facebook висловив свою позицію щодо шкідливого та загрозливого вмісту до асоціативного рівня в жовтні 2020 року, коли видалив профілі, пов&#39;язані зі змовою QAnon, навіть якщо окремі профілі не мали насильницького вмісту. З 2016 року група змови призвела до жорстоких епізодів. </p> <p> </p> <p> Facebook також заборонив музичну групу Trapt за публікації, що посилаються на групу ненависті Гордих хлопчиків. Екстремістська політична організація бере участь у насильстві на вулиці в США та Канаді з 2016 року. </p> <p> Компанія також залишає за собою право вимкнути акаунти, якщо ці акаунти становлять юридичний ризик для Facebook. Більше того, Facebook більш рішуче, ніж інші платформи соціальних медіа, стосується співпраці з правоохоронними та пропагандистськими організаціями, коли стикається з таким вмістом. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Порушення безпеки інших рахунків </h2> <p> Ще одним із рідкісних списків Facebook, які можна заборонити, є &quot;погіршення безпеки інших облікових записів та наших служб&quot;. Порушення безпеки послуг Facebook багато в чому схоже на зловмисне програмне забезпечення та зловживання, згадані в умовах надання послуг. Однак ідея компрометувати безпеку інших рахунків вказує на доксинг. </p> <p> </p> <p> Doxxing - це випуск конфіденційної реальної інформації користувача соціальних мереж, яка може включати домашню або робочу адресу, приватний номер телефону або фізичне місцезнаходження в реальному часі. Така практика часто проводиться з метою нанести цій людині шкоду. </p> <p> </p> <h2 id=\"misinformation\"> 5. Дезінформація </h2> <p> </p> <p> Офіційні вказівки Facebook говорять, що Facebook не видаляє дезінформацію, натомість вибираючи її маркування, щоб вона могла брати участь у діалогах, не вводячи інших в оману. Однак низка призупинених власників облікових записів заявляє, що їх видалення було результатом того, що Facebook називає &quot;Фальшивими новинами&quot;. </p> <p> Існує низка причин, що це трапляється. У деяких випадках Facebook визначає, що неправдиві новини також шкідливі для особистого чи громадського здоров’я. </p> <p> Це було <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> Пояснення Facebook щодо усунення теоретика змови Девіда Айке </a> за твердження, серед іншого, що Інтернет 5G викликає Covid-19. Facebook також повідомив, що Ікке &quot;неодноразово порушував&quot; політику. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Політика Facebook та ваш рахунок </h2> <p> Здебільшого Facebook не сприймає вас, якщо ви не використовуєте платформу з метою заподіяння шкоди іншим. Однак є певні проблеми, коли компанія проводить лінію на піску. </p> <p> Якщо ви не порушуєте ці умови обслуговування, вам слід захищатись від постійної заборони Facebook. </p>"}