{"title":"8 способів соціальних медіа можуть допомогти вам вивчити нову мову","content":"<p> Вам все ще сняться кошмари з підручників іспанської мови та погано викладаних уроків французької мови, які ви отримували в школі? Не бійся. Завдяки Інтернету вивчення нової мови в наші дні може бути як веселим, так і доступним. </p> <p> Зокрема, соціальні медіа допомогли зв’язати мільйони тих, хто вивчає мову, у всьому світі. Незалежно від того, чи вивчаєте ви щось популярне, наприклад, німецьку, або більш незрозуміле, як фарерська, ви знайдете широкий спектр ресурсів, які допоможуть вам у вашій подорожі. </p> <p> Ось кілька способів використання соціальних мереж для вибору наступної іноземної мови. </p> <h2 id=\"join-facebook-groups\"> 1. Приєднуйтесь до груп Facebook </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> У Facebook ви знайдете групи майже для будь-якої мови, яку тільки можна собі уявити. Ви знайдете спільноти нещодавно переселених емігрантів, які прагнуть вдосконалити навички, а також групи для учнів, які навчаються по всьому світу. Щоб отримати максимум від свого досвіду, вам слід приєднатися до обох. </p> <p> Щоб знайти потрібні групи Facebook, ви можете здійснити простий пошук в Інтернеті. Крім того, ви можете знайти те, що шукаєте, у Facebook. Для цього перейдіть до Групи та знайдіть свою мову. Потім ви отримаєте список спільнот, які відповідають цим потребам. </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> Якщо ви навчаєтесь у місцевій мовній школі, ви також можете створити власну групу для спілкування з однокласниками. Зробити це, <strong> Перейдіть до Групи&gt; Створити нову групу </strong> . Потім ви можете відредагувати налаштування та почати запрошувати учасників. </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2. Зробити Використання Reddit </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit - це популярний онлайн-форум, який є золотим копалином для тих, хто вивчає мову. Ви знайдете subreddits для обох мов конкретних і спільної мови навчання. </p> <p> Коли ви приєднаєтесь до subreddit, ви дізнаєтесь багато корисних порад та підказок від інших учнів, які пройшли ваш шлях. Ви також знайдете багато мемів, до яких, без сумніву, будете ставитися. </p> <p> Щоб знайти підредагування, перейдіть у рядок пошуку вгорі та введіть своєю мовою. Після того, як завантажили результати, це варто приєднатися як навчання специфічних груп і культурних з них, щоб дізнатися більше про місцеві звичаї. </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. Зв’яжіться з носіями мови </h2> <p> Кращий спосіб вивчити мову швидко це, розмовляючи з людьми, які вже говорять це. І соціальні медіа можуть бути чудовим місцем, щоб знайти ці колонки. Можливо, вам доведеться звернутися до кількох людей, але врешті-решт ви знайдете когось, хто готовий виділити трохи часу, щоб допомогти вам. </p> <p> При спілкуванні з носіями мови в соціальних мережах, зосередьтеся на спочатку побудові дружби. Якщо ви перебуваєте в одному місті з ними, запропонуйте зустрітися з ними та заплатити за каву. Для тих, хто знаходиться далі, запропонуйте допомогти їм вивчити одну з мов, на якій ви вже говорите. </p> <p> Кроки для них подібні на кожній платформі соціальних мереж. В Instagram або Twitter підпишіться за ними та надішліть повідомлення (якщо це дозволяють налаштування конфіденційності). Ви можете застосувати подібний підхід у Facebook, хоча деякі люди можуть бути менш охочими приймати запити друзів від тих, кого вони не знають. </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. Створіть свій власний Соціальний медіа-контент </h2> <p> Вам не просто потрібно споживати в соціальних мережах, щоб допомогти собі вивчити мову. Спробуйте також створити власні публікації. Це не лише допоможе вам потренуватися у розмові та письмі; Ви також можете виявити нових користувачів, щоб потренуватися. </p> <p> У вас є багато варіантів щодо створення контенту. У Twitter ви можете приєднуватися до бесід або писати деякі твіти на вашій мові перекладу. За допомогою Instagram ви можете писати підписи, створювати графіку та записувати себе під час розмови. </p> <p> При створенні власного контенту соціальної медіа, ви також отримати зворотній зв&#39;язок від носіїв мови. Крім того, ви також можете виростити свій портфель і дізнатися кілька нових корисних навичок. </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. Встановіть для своїх програм мову, яку ви вивчаєте </h2> <p> Зміна налаштувань телефону - це простий спосіб змусити себе мислити цільовою мовою та комфортно читати її. Ви також додасте десятки нових слів до свого словникового запасу. </p> <p> </p> <p> Усі великі мережі соціальних мереж мають налаштування в додатку, де ви можете змінити мову. Наприклад, в Instagram перейдіть на <strong> Обліковий запис&gt; Мова </strong> . Потім ви побачите спадне меню всіх мов, якими ви можете користуватися. </p> <p> <strong class=\"gallery__section-title\"> Галерея зображень (2 зображення) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> Розгорнути <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <p> Ви також можете змінити всі мови своїх програм одночасно за допомогою налаштувань телефону. Йти до <strong> Налаштування </strong> &gt; <strong> Загальне&gt; Мова та регіон </strong> . Звідти ви побачите список усіх доступних мов. Зверніть увагу, що для менших мов можливо не вдасться оптимізувати свій обліковий запис. </p> <p> <strong class=\"gallery__section-title\"> Галерея зображень (2 зображення) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> Розгорнути <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. Максимально використовуйте хештеги </h2> <p> Використання та пошук за допомогою хеш-тегів - це потужний спосіб знайти більше користувачів мовою, яку ви вивчаєте. Використовуючи різноманітність, ви можете спілкуватися та споживати вміст як носіїв мови, так і інших учнів. </p> <p> Щоб знайти тип вмісту, який ви шукаєте, подумайте, чим користуватимуться інші учні. Ви також можете знайти вміст носіїв мови, шукаючи існуючі теми в будь-якій країні. Часто ви можете знайти їх у популярних публікаціях та статтях. </p> <p> Щоб шукати хештеги, використовуйте функцію пошуку в будь-якій програмі соціальних мереж, яку ви використовуєте. Ви також можете натиснути на публікації, які їх використовують, і знайти всі викладені результати. </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. Дотримуйтесь облікових записів на вашій мові перекладу </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> Кожен цікавий акаунт, яким ви підписуєтесь англійською мовою, також, ймовірно, має еквівалент на вашій цільовій мові. Це можуть бути масові публікації, або вони можуть бути щоденними ораторами, яким зручніше створювати роботу рідною мовою. </p> <p> </p> <p> Ви також повинні перевірити, чи мають ваші улюблені журнали, спортивні команди та музичні виконавці облікові записи вашою мовою перекладу. Наприклад, у багатьох найбільших спортивних клубах світу є рахунки англійською, іспанською тощо. </p> <p> Коли ви стежите за обліковими записами на тій мові, яку ви хочете вивчити, правильним правилом є дотримуватися тих, лише якщо вам здається, що їх англомовний вміст настільки ж цікавий. Інакше згодом ви знову їх ігноруєте та скасуєте. </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. Дотримуйтесь додатків для вивчення мови в соціальних мережах </h2> <p> <strong class=\"gallery__section-title\"> Галерея зображень (2 зображення) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> Розгорнути <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <p> Додатки для вивчення мови також часто мають активні профілі в соціальних мережах. Вони чудово підходять для підбору загальних порад та відношення до загальної боротьби, з якою стикаються всі - незалежно від того, вивчають вони норвезьку чи японську мови. </p> <p> Деякі акаунти, на які варто стежити, - це Babbel, Busuu та Duolingo. </p> <p> Однак вам не потрібно просто використовувати ці програми для споживання. Не соромтеся додавати свої думки в коментарях. Ви навіть можете завести нових друзів, навіть якщо вони вивчають зовсім іншу мову від вас. </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> Зробіть вивчення мови цікавим за допомогою соціальних медіа </h2> <p> Отже, ось вам. Тепер у вас більше ідеї використання соціальних мереж, щоб зробити вашу подорож вивчення мови цікавою. Хоча робота з підручниками все ще важлива, це не може бути вашим єдиним варіантом. </p> <p> Навіть якщо ви не можете оптимізувати додаток до цільової мови, ви все одно знайдете багато носіїв мови та однокласників, з якими можна зв’язатися. </p> <p> Ключем до вивчення мови за допомогою соціальних мереж є як залучення, так і споживання. Коли ви це зробите, ви побачите, що ваш досвід є більш повноцінним, і підберете слова, яким підручники вас ніколи не навчили. </p>"}