{"title":"Величезне оновлення Microsoft Edge йде на ваш бік","content":"<p> Microsoft дуже наполегливо працює над тим, щоб зробити свій інтернет-браузер Edge найкращим, що він може бути. Зараз компанія додає до неї три суттєві особливості, і все дивиться на майбутнє Edge. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Що Microsoft запланувала для Edge </h2> <p> Велике оновлення бампера було спіймано <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows Останні </a> . Три функції планується випустити в одному великому оновленні, тож найближчим часом варто стежити за Edge. </p> <p> По-перше, Microsoft Edge отримує підтримку веб-віджетів. Ці віджети - це зручний спосіб швидко побачити життєво важливу інформацію протягом дня. Програмний гігант хоче експериментувати з віджетами будь-якої форми та розміру, але він вирішив почати з віджета новин, щоб розпочати справу. </p> <p> Далі Microsoft Edge отримує функцію пошуку по вкладках. Якщо це звучить вам знайомо, це, мабуть, тому, що ви прочитали <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> початкові спекуляції на тому, що Edge отримує інструмент пошуку вкладок </a> . На щастя, ці спекуляції стали реальністю, і Microsoft планує внести функцію Chrome в Edge. </p> <p> Нарешті, ви зможете керувати всіма своїми розширеннями Edge з одного меню. Він відображатиметься як фрагмент головоломки на панелі завдань вашого браузера, і коли ви клацнете на ньому, він відображатиме всі встановлені вами розширення разом із швидким способом увімкнення та вимкнення кожного з них. </p> <p> Невпевнено, коли саме вийде це оновлення, але Windows Latest закріпила його за &quot;наступним великим оновленням&quot;. Таким чином, це не пройде надто довго, поки Microsoft Edge не стане привабливим вибором для людей, які шукають щось нове. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: Наступна велика річ? </h2> <p> Дуже довго браузери Microsoft розглядалися як вдосконалені менеджери завантажень для встановлення Chrome або Firefox. З тих пір, як Microsoft прийняла базу коду Chromium для свого браузера, вона вже перетворилася на сміх у світі браузерів. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCounter </a> перелічує Microsoft Edge як другий за частотою використання браузер Windows у США на момент написання статті. Ми вже знали, що Firefox залишається в пилу від Edge, але з тих пір розрив лише збільшився. </p> <p> Зараз Edge становить 5,25 відсотка частки ринку США у порівнянні з 3,35 відсотками, якими володіє Firefox. Обидва вони далекі від 45,83 відсотків Chrome, але це початок. </p> <p> Таким чином, якщо ви раніше закрутили ніс у браузері Microsoft, зараз сприятливий час надати йому другий шанс. Хто знає, вас може завоювати найкращий браузер Microsoft за всю історію! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Підштовхуючи браузер до краю </h2> <p> Якщо ви раніше не були фанатом браузерів Microsoft, настав час заскочити і подивитися, у чому суєта. Велике оновлення зараз у розробці, і воно лише покращиться звідси. </p> <p> Microsoft знає, що це за переможною формулою. Насправді компанія нещодавно повідомила, що 600 мільйонів людей у ​​всьому світі зараз використовують Edge для перегляду веб-сторінок. </p> <p> <small> Кредит зображення: DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}