{"title":"Їжа для мозку, що має розмір укусу: 5 сайтів, щоб коротко та цікаво дізнатися про нові речі","content":"<p> Документальні фільми тривалістю менше хвилини. Епізоди подкастів лише 60 секунд. Анімована інфографіка для пояснення складних тем. Тут ви можете дізнатися більше про світ за допомогою швидких капсул залучення знань. </p> <p> В епоху короткої уваги та 280 оновлень персонажів навіть навчання повинно бути в малих дозах. Ось чому є творці контенту, які спеціалізуються на створенні інформаційних та розважальних творів, які майже не забирають часу в нашому насиченому житті. Від міні-документальних фільмів про захоплюючих людей та сюжети до путівників у соціальних мережах на актуальні теми, дайте своєму розуму трохи їжі для мозку, яку можна пережовувати. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 60 секундних документів </a> (Інтернет): Профілі цікавих людей та тем за 60 секунд </h2> <p> </p> <p> Маєш хвилину? 60 Second Docs має круту історію, яка розповість вам про цікаву людину, і, в свою чергу, круту тему. Кожен документальний фільм триває лише 60 секунд, але він охоплює найкращі речі, які потрібно знати про тему. </p> <p> Найкрутіша частина полягає в тому, що 60 Second Docs зосереджується на профілях реальних людей, а не на концепціях чи тенденціях. Зазвичай ця людина робить щось унікальне, незалежно від того, починає вона новий тренд, досліджує нову тему чи певним чином розсуває межі. Складаючи розповідь про людину, ви не тільки отримуєте більше розуміння людського аспекту унікальної теми, але й відчуваєте себе більш реальним та емоційним. </p> <p> Усі 60 секундних документів доступні на їхньому каналі YouTube або в соціальних мережах. Бажано стежити за ними в будь-якій соціальній мережі, яку ви часто відвідуєте, переглядаючи кожне нове відео в цілому, щоразу, коли вони публікують оновлення. </p> <p> Якщо ви любите довші документальні фільми, перевірте <strong> Офіційний відбір </strong> на веб-сайті 60 Second Docs. Тут редактори вибирають 10-20-хвилинні документальні фільми, які інші знімали, на теми, які, на їх думку, вам слід дивитись. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Отже, ви хочете поговорити про </a> (Instagram): Міні-путівники з політичних та соціальних тем </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> Хто знав, що у світі авторитетних автопортретів та рекламованих брендів хештегов Instagram забезпечить платформу для навчання? Отже, ви хочете поговорити про це (Sywtta) використовує формати публікацій із кількома зображеннями в Instagram для створення міні-путівників про політичні та соціальні теми. </p> <p> Предмети, які обирає Sywtta, зазвичай займаються такими актуальними темами, як скасування позики на навчання, права чорношкірих та історія, логічні помилки, вакцини проти COVID-19 та багато іншого. Кожен слайд використовує красиво відформатовану типографіку, щоб навчити вас предмету, і, крім того, кожен слайд - це як міні-урок сам по собі. Кожен посібник стає швидким та інформативним курсом збою, не надто обтяжуючи даними. </p> <p> У той час, коли потрібно бути пильним <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> необ&#39;єктивні або фейкові новини </a> , також важливо відзначити філософію того, що ви читаєте. Що стосується політики, Sywtta пропагує погляди прогресивної та лівої політики. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> 60-секундна наука </a> (Подкаст): Короткі звукові пояснення науки, охорони здоров’я та технологій </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Якщо ви віддаєте перевагу слухати свою інформацію, ніж читати чи дивитись, перегляньте 60-секундний науковий подкаст. Цей щоденний подкаст, створений командою Scientific American, торкається тем у галузі науки, медицини та технологій та коротко викладає одну з тем. Хоча він більше не обмежується обмеженням у хвилини, кожен епізод все ще перебуває менше п&#39;яти хвилин. </p> <p> Кожен подкаст має різних ведучих від команди Scientific American, які охоплюють такі теми, як COVID, тварини та птахи, ДНК та медицина, екологічні науки тощо. Вони насолоджуються високими виробничими цінностями, включаючи реальні звуки про тему дискусії та часто додаючи голосові кліпи від експертів. </p> <p> Щоб переглянути архів минулих епізодів, перейдіть на офіційний веб-сайт 60-секунди Science. Тут ви можете відфільтрувати епізоди за темами (здоров’я, розум, стійкість, технології, науки). Якщо ви не хочете отримувати інформацію короткими серіями, спробуйте повноформатний підкаст Science Talk. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Анімаграфи </a> (Інтернет): Якісна анімована інфографіка для пояснення речей </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> Як працює криптовалюта? Які є тонкощі і переваги автострахування? Як ви робите місячний похід? Дизайнер і аніматор Джейкоб О&#39;Ніл розбиває складні теми на прості пояснення та малює високоякісні анімовані інфографіки для їх ілюстрації. </p> <p> Animagraffs - це колекція коротких пояснень через візуальні путівники з використанням анімованих GIF-файлів. Джейкоб використовує різні дизайнерські прийоми, такі як поперечні перерізи, щоб проілюструвати кожну частину інструменту, або великі зображення з рухомими частинами, де ви можете збільшувати та зменшувати масштаб, як Google Maps. Кожен стиль відповідає предмету, про який ви дізнаєтесь. </p> <p> Тематика також має широкий діапазон, включаючи те, як біжить гепард, як працюють електромобілі, як динамік видає звук тощо. Ви також повинні переглянути розділ &quot;Робота з клієнтами&quot;, де Джейкоб демонструє оплачені завдання для брендів. Не хвилюйтеся, хоч вони і рекламні, вони тим не менше інформативні та веселі. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Велика Велика Історія </a> (YouTube): Захоплюючі та цікаві справжні короткі документальні фільми </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> &quot;Велика велика історія&quot; завершила свою діяльність наприкінці 2020 року, але не раніше, ніж залишити п&#39;ять років чудових короткометражних документальних фільмів. Пориньте в архіви, щоб знайти приблизно 5-хвилинні відео на цілу низку цікавих тем та захоплюючих людей з усього світу. </p> <p> Від кінофільму, який грають в індійському театрі протягом 24 років, до дивовижного турецького морозива, яке не тане, кожне коротке відео - це якісний та добре досліджений погляд на цю тему. На зміну більшості інших таких відео, творці відео Great Big Story часто подорожують світом, щоб поставити себе в середину історії. Сортуйте за найпопулярнішими або використовуйте різні власні списки відтворення, рекомендовані творцями. </p> <p> На каналі ви також знайдете кілька довших відео, тривалістю від 10 до 15 хвилин. Зазвичай це списки та компіляції, які включають кілька фрагментів із коротших відеороликів. Якщо у вас є час, щоб дізнатися більше про навколишній світ, ви не можете помилитися з ними. Навіть знявши ставні, Велика Велика Історія є однією з найбільш <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> захоплюючі та освітні канали на YouTube </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Використовуйте крапельне навчання, щоб підкорити великі предмети </h2> <p> Ці веб-сайти та подкасти зосереджуються на перетворенні кожної нової теми в компактний та розважальний пакет інформації. Це приємний спосіб пізнавати нове, маленькими укусами. Але ви також можете застосувати ту саму філософію до вивчення більш складних та великих предметів. </p> <p> Все частіше краплинне навчання або мікронавчання є популярним способом здобуття освіти. Отримавши <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> уроки розміром з укус щодня </a> , ви можете вирішувати такі теми, як програмування, дизайн, розробка додатків, управління продуктами тощо. Швидкий пошук в Інтернеті повинен допомогти вам знайти крапельну версію того, з чого ви хочете навчитися. </p>"}