{"title":"BitPay приносить біткойн Apple Pay","content":"<p> Користувачі BitPay в США тепер можуть додавати свої передоплачені біткойн-картки в програму Apple Wallet і <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> використовуйте його для оплати речей за допомогою Apple Pay </a> . Клієнти, що не належать Apple, незабаром зможуть додати свої картки BitPay з фірмовою карткою MasterCard до Google Pay і Samsung Pay. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> Як додати свою карту BitPay до гаманця Apple </h2> <p> Щоб додати свою карту BitPay на пристрій Apple, відкрийте програму Wallet на своєму iPhone і торкніться «+» у верхньому правому куті, а потім дотримуйтесь інструкцій на екрані, щоб закінчити додавання картки. </p> <p> За допомогою BitPay у додатку Wallet ви можете додати картку в Apple Pay, перейшовши на <strong> Налаштування&gt; Гаманець та Apple Pay </strong> , а потім торкніться опції з написом &quot;Додати картку&quot;. Щоб стати користувачем BitPay та замовити свою передплачену картку, завантажте програму BitPay Wallet із <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> Магазин додатків </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Новий спосіб витратити за допомогою Apple Pay </h2> <p> Допис на <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> Блог BitPay </a> каже, що додавання картки BitPay до Apple Pay є зручним способом витрачати криптовалюти в більшій кількості місць, ніж раніше. &quot;У нас є тисячі клієнтів додатків BitPay Wallet, які використовують карту BitPay, і які завжди шукають нові місця та способи витратити свою криптовалюту&quot;, - сказав генеральний директор BitPay Стівен Пейр у <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> прес-реліз </a> . </p> <p> </p> <p> За допомогою Apple Pay власники карток BitPay можуть робити безпечні безконтактні покупки у фізичних магазинах, додатках, що підтримують Apple Pay, та в Інтернеті. Компанія зазначає, що клієнти, які чекають на доставку пластикової картки, можуть додати свій віртуальний аналог до Apple Wallet через офіційний додаток BitPay Wallet. Це дозволить вам негайно розпочати витрати. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> Що таке карта BitPay? </h2> <p> Передплачена картка, яка використовує мережу Mastercard, карта BitPay дозволяє легко здійснювати безконтактні платежі та платежі за допомогою PIN-коду, а також знімати готівку з будь-якого сумісного банкомату. За допомогою програми клієнти можуть переглядати свій баланс, запитувати новий PIN-код, миттєво перезавантажувати, а також конвертувати криптовалюту у фіатну валюту (яка потім завантажується на карту, готова до витрачання в будь-якому місці, де дебетові картки Mastercard приймаються в усьому світі). </p> <blockquote> <p> Для потужних користувачів блокчейну програма BitPay Wallet підтримує безліч варіантів придбання та зберігання криптовалют та здійснення онлайн-платежів. Користувачі можуть миттєво придбати подарункові картки у сотень провідних роздрібних торговців у магазині та в Інтернеті. </p> </blockquote> <p> Картка має мікросхему EMV і може бути заблокована у випадку надзвичайної ситуації за допомогою програми. </p> <p> За словами компанії, підтримка Google Pay і Samsung Pay планується &quot;пізніше цього кварталу&quot;. Що стосується програми BitPay, вона в даний час підтримує Bitcoin, Bitcoin Cash та Ether, а також чотири прив&#39;язані до долара стабільні монети, криптовалюти USDC, GUSD, PAX та BUSD. </p>"}