{"title":"Комп’ютерні RPG проти класичних RPG: що означає CRPG у 2021 році?","content":"<p> Історія комп’ютерних рольових ігор така ж довга, як і історія самих відеоігор, що розвиваються та зростаються з роками. І подібно до того, як CRPG розвивалися, вдосконалюючи графіку, додаючи або відмовляючись від механіки ігрового процесу, так само змінювалося значення та термінологія, використовувана для їх опису. </p> <p> Скорочення CRPG, що традиційно позначало комп’ютерну рольову гру, з часом розширило своє значення, включаючи RPG для різних платформ. Тепер воно набуло нового значення. Хоча його нове значення не зовсім відрізняється від оригінального, зараз воно описує конкретний піджанр RPG. </p> <h2 id=\"the-history-of-crpgs\"> Історія CRPG </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> Історія CRPG почалася в 1970-х роках з випуску найдавнішої адаптації відеоігор настільної RPG Dungeons &amp; Dragons, Dungeon. Спочатку гра була доступна на Atari (ви можете грати через <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, послуга потокової передачі ігор на Plex </a> ). </p> <p> Хоча ігровий процес Dungeon в основному був заснований на тексті, він повністю описував рухи вашої багатозначної партії у фантастичній обстановці, реалізуючи більшість основних принципів Dungeons &amp; Dragons. </p> <p> Тоді ми називали їх комп’ютерними RPG, щоб виділити їх серед своїх настільних аналогів, які на той час були набагато популярнішими, і ми просто знали їх як RPG. </p> <p> До 1990-х років CRPG, коли вони повністю розквітли, тепер можуть відображати фантастичний світ у повному обсязі, принаймні у перспективі зверху вниз або в ізометричному вигляді. Так було з Ultima VII, однією з найбільш інтерактивних CRPG, яку грав цей письменник. </p> <p> Майже все, що ви бачите, ви можете пересувати або взаємодіяти: Ви можете створювати зброю, грати на інструментах і навіть виносити свого мертвого члена партії з підземелля аж до царської тронної кімнати, щоб вони воскресли! </p> <p> Ворота Балдура були одними з тих, хто найбільш точно наслідував досвід настільної RPG. Він адаптував набір правил Dungeons &amp; Dragons 2nd Edition (AKA Advanced Dungeons &amp; Dragons) до ізометричної <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> CRPG у реальному часі з можливістю зупинки </a> . Ці види CRPG наголошували на тактиці бою, прогресуванні характеру, прийнятті рішень та заохочували дослідження. </p> <p> </p> <p> Сьогодні у світі, де консолі домінують на ринку, рольові відеоігри стали більш популярними, ніж настільні RPG. У тій мірі, якою в сучасних умовах скорочення RPG більше стосується його версії відеоігор. Ви б назвали Dungeon&#39;s &amp; Dragons настільною RPG, а не просто RPG. </p> <p> З розвитком графіки механіка ігрового процесу CRPG адаптується до сучасних графічних стандартів. Серії CRPG, такі як The Elder Scrolls, Gothic або The Witcher, зробили революцію в жанрі, представивши деякі нові механіки гри, покинувши інші. </p> <p> Ці RPG є більш орієнтованими на дії та швидкими темпами, розміщуючи себе дещо, хоча і не повністю, в піджанрі hack and slash (хоча це все ще тверді RPG!) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Нова хвиля CRPG </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> Проте, суперечивши тенденції сьогоднішньої індустрії відеоігор йти до графічного реалізму, прийшла нова хвиля CRPG. Олдскульні або класичні RPG сильно впливають на ці ігри, і вони роблять акцент на механіці ігрового процесу та зануренні, а не на візуальні ефекти. </p> <p> Це, як правило, ізометричні ігри, з можливістю зупинки в реальному часі або покрокові тактичні бої. Ці CRPG також роблять все можливе, щоб бути максимально захоплюючим, надаючи вам дещо великі блоки добре продуманої прози та надійну історію. </p> <p> Більшість з них для більшості діалогів покладаються на текст, а не на озвучку, подібно до CRPG старої школи. Деякі з цих CRPG включають &quot;Стовпи вічності&quot;, &quot;Божество: первородний гріх&quot; або &quot;Виявник шляху: Цар-творець&quot;. </p> <p> Ці ігри також наголошують на тактиці бою, прогресуванні характеру, прийнятті рішень та заохочують дослідження, як це робили старі шкільні CRPG. З цих причин ми вважаємо їх більш тісно пов’язаними з класичними RPG, ніж з більшістю сучасних RPG. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> Що означає CRPG у 2021 році </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> Починаючи з 2000-х років, RPG стала стандартним терміном для позначення будь-якої рольової відеоігри. Але приблизно в 2015 році вони випустили Divinity: Original Sin і Pillars of Eternity. </p> <p> Ці RPG були відходом від орієнтованих на дії сучасних RPG, хоча були дуже схожими на старі назви як в естетиці, так і в механіці ігрового процесу. Приблизно в цей час виникла необхідність у новому терміні, щоб виділити ці RPG окремо від сучасних RPG. </p> <p> Хоча люди роками кидали в Інтернеті терміни &quot;стара школа&quot; та &quot;Класична RPG&quot;, щоб описати ці ігри, остання застрягла. Подібно до того, як сучасні рольові відеоігри вимагають скорочення RPG для себе, зараз люди називають старі шкільні RPG &quot;CRPG&quot;. </p>"}