{"title":"Canon запускає програму для видалення фотографій, яка знаходить ваші найкращі знімки","content":"<p> Майже за кожною ідеальною фотографією стоїть фотокамера, повна інших фотографій, які схожі майже на неї. Нерідкі випадки, коли фотографи майже завжди тримають натиснутою кнопку спуску затвора, боячись, що вони можуть упустити швидкоплинний момент. </p> <p> Перегляд десятків, а може навіть сотень фотографій, щоб вибрати улюблене та звільнити місце для зберігання, може бути довгим і неприємним процесом. На щастя, Canon випустила нову програму, яка автоматично робить це за вас. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> Легко зробіть рулон фотографій до найкращого </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon США </a> випустив програму вибору фотографій на <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> Магазин додатків </a> що дозволяє швидко та легко знайти найкращі фотографії. Сама програма безкоштовна, але для того, щоб користуватися нею, вам доведеться отримати підписку за $ 14,99 / рік або $ 2,99 / місяць. Обидва варіанти підписки мають триденну пробну версію. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> Виконавчий віце-президент Canon США Тацуро &quot;Тоні&quot; Кано пояснює: </p> <blockquote> <p> У сучасному мінливому та переважному світі, де тисячі фотографій захоплюються та зберігаються на смартфоні людини, споживачі потребують експертного, надійного та інтуїтивно зрозумілого інструменту для фотозйомки, який допоможе їм вибрати найкращі фотографії на основі багаторічних надійних знань та технологій. </p> </blockquote> <p> Додаток Canon, яке просто називається Photo Culling, працює на ШІ, який називається Learning Intelligence Learning або скорочено PHIL. PHIL пропонує, які фотографії слід зберігати, а які видаляти, виходячи з того, який із двох вибраних варіантів вибракування фотографій. </p> <p> Перший варіант, <strong> Ціле вибракування </strong> , чудово підходить для <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> краще портретна фотографія </a> . Коли вибрано цей параметр, PHIL визначатиме ваші найкращі фотографії, оцінюючи їх на основі чотирьох факторів: різкості, шуму, емоцій та того, чи закриваються очі суб’єкта (якщо це можливо). </p> <p> Тим часом, <strong> Подібне вибракування </strong> варіант вибирає найкращі кадри, порівнюючи бали між подібними фото. Наприклад, припустимо, ви зробили купу фотографій хмар, а потім купу фотографій деяких квітів. Додаток розділить хмарні фотографії та квіткові фотографії на окремі групи. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Який би варіант вибракування ви не вибрали, якщо оцінка фотографії перевищує встановлений вами цільовий бал, фотографія вважається зберігачем. Потім PHIL запропонує видалити решту фотографій, які не набрали достатньо високих балів. Якщо ви не згодні з PHIL, не хвилюйтеся. Ви все ще повністю контролюєте всі свої знімки. </p> <p> </p> <p> Інші функції програми включають кількість фотографій та інформацію про відображення місця для зберігання, фотоальбоми, налаштування параметрів для оцінок фотографій та можливість використання темного режиму. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> Ви завантажите програму Canon Culling Photo? </h2> <p> Здавалося б, програма відбору фотографій Canon має все необхідне, щоб зробити процес вибору найкращих фотографій менш нудним. Однак, наприкінці дня, вам вирішувати, чи ненавидите ви вибивання фотографій настільки, щоб виправдати оплату того, що ви могли зробити самі (хоча, мабуть, дуже повільно і нудно з глузду). </p> <p> На момент написання статті додаток недоступний для Android, але, можливо, Canon має це на картках на майбутнє. </p>"}