{"title":"Чи можете ви отримати Netflix на своєму комутаторі Nintendo?","content":"<p> Здається, ви можете отримати Netflix на будь-якій платформі. Незалежно від того, це ваш телевізор, приставка чи телефон, найпопулярніша у світі послуга потокового передавання доступна скрізь, де вам це потрібно. Або це? </p> <p> Якщо у вас є комутатор Nintendo, можливо, вам цікаво, чи можна дивитись на ньому Netflix. Давай дізнаємось... </p> <h2 id=\"can-you-watch-netflix-on-the-nintendo-switch\"> Чи можете ви дивитись Netflix на комутаторі Nintendo? </h2> <p> <a href=\"https://www.makeuseof.com/nintendo-switch-streaming-services/\" target=\"_blank\" rel=\"nofollow noopener\"> Nintendo Switch підтримує декілька потокових служб </a> але Netflix не є одним з них. Принаймні офіційно. </p> <p> Це означає, що ви не можете зайти в інтернет-магазин і завантажити додаток Netflix. Насправді на момент написання статті послуги потокового передавання, які Nintendo Switch пропонує через eShop, обмежувалися Hulu, YouTube та Funimation. </p> <p> Ви також не можете використовувати веб-браузер консолі для перегляду Netflix. Це не спрацює. </p> <p> Однак ви можете встановити Android на свій комутатор Nintendo, а Netflix доступний на Android. Це складний процес, який не підтримується Nintendo. Це призведе до втрати вашої гарантії, і її повинні брати на себе лише користувачі, які розуміють процес та наслідки. </p> <p> Для більшості людей найкраще сподіватися, що Netflix в майбутньому офіційно підтримуватиме комутатор Nintendo. </p> <p> В інтерв’ю 2017 року с <a href=\"https://www.washingtonpost.com/news/the-switch/wp/2017/03/08/nintendos-u-s-ceo-responds-to-our-biggest-gripes-with-the-switch/\" target=\"_blank\" rel=\"nofollow noopener\"> The Washington Post </a> , Тодішній президент Nintendo з Америки Реджі Філс-Ейм заявив, що Nintendo розмовляла з Netflix - звичайно, з тих пір минуло багато часу, і нічого не вийшло. </p> <p> </p> <h2 id=\"can-you-watch-netflix-on-other-nintendo-consoles\"> Чи можете ви дивитись Netflix на інших консолях Nintendo? </h2> <p> І Nintendo Wii, і Nintendo Wii U раніше мали спеціальні програми Netflix. </p> <p> Однак з 31 грудня 2020 року додаток Netflix більше не був доступним для завантаження новими користувачами з Інтернет-магазину. </p> <p> 30 червня 2021 року додаток Netflix повністю закриється для існуючих користувачів. На той момент жодна консоль Nintendo не підтримуватиме Netflix. </p> <p> Наразі вам просто доведеться насолоджуватися обмеженими параметрами потокового відео, які підтримує комутатор, і дивитися Netflix на іншому пристрої. </p>"}