{"title":"Ознайомтесь із браузерною версією Microsoft xCloud","content":"<p> Якщо ви з нетерпінням чекали новин у порту браузера xCloud, то сьогодні ваш щасливий день, адже ви можете підглянути, як це насправді виглядає. </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> Тестери виявляють знімки екрана браузера xCloud </h2> <p> На даний момент xCloud доступний на різних пристроях, але ми все ще чекаємо, поки Microsoft офіційно випустить версію браузера. </p> <p> Подробиць було досить мізерно ... дотепер. Згідно з повідомленням <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> Грань </a> , &quot;джерела, знайомі з планами Microsoft Xbox&quot; стверджують, що &quot;працівники зараз тестують веб-версію xCloud перед загальнодоступним попереднім переглядом&quot;. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Ось перший погляд на веб-сайт xCloud від Microsoft <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> - The Verge (@verge) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> 15 лютого 2021 року </a></blockquote>  <p> Не забувайте, це лише зображення тестувальників, тобто, хоча це і малоймовірно, Microsoft може повністю змінити вигляд версії браузера xCloud. </p> <p> Зі скріншотів схоже, що xCloud налаштований подібно до версії Android, яка доступна на смартфонах і планшетах. </p> <p> Ви можете побачити нещодавно додані ігри у верхній частині скріншота, а потім розділ &quot;Скоро&quot;. Нижче у вас є різні варіанти вибору вибраного вами жанру гри, а повна бібліотека ігор xCloud доступна внизу сторінки. </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> Як отримати доступ до xCloud у своєму браузері? </h2> <p> Наразі ви не можете. Публічна версія веб-порту xCloud поки недоступна. Це означає, що вам потрібно почекати трохи довше, якщо ви хочете отримати доступ до xCloud через ваш браузер. Нібито, Microsoft планує публічно розкрити цю послугу у другому кварталі 2021 року. </p> <p> До цього часу вам доведеться знайти інші методи доступу до xCloud. На даний момент ви можете отримати доступ до хмарної ігрової служби лише на пристроях Android (вам потрібна версія браузера для відтворення на iOS, завдяки <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> суперечка між Apple та Microsoft </a> ). </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> Чи можете ви отримати доступ до ігор xCloud будь-яким іншим способом? </h2> <p> Ну, так і ні. Ви не можете отримати доступ до жодних заголовків на xCloud, так би мовити. Тільки якщо ви не використовуєте для цього пристрій Android та офіційний додаток Game Pass. </p> <p> Однак ігри, доступні на хмарних сервісах Microsoft, доступні на Game Pass. Насправді ви отримуєте доступ до xCloud як частина передплати на Game Pass Ultimate. Таким чином, ви все одно можете отримати доступ до цих ігор через Xbox або ПК з Windows. </p> <p> Отже, одним словом, так. Ви можете отримати доступ до цих ігор іншим способом. Просто не використовуючи xCloud, якщо у вас немає доступу до версії Android. </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud: Незабаром до пристрою iOS поруч із вами </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> Вам не слід довго чекати, поки ви зможете заволодіти хмарною ігровою платформою Microsoft. Після того, як xCloud пройде тестування, Microsoft внесе всі необхідні зміни, перш ніж дозволить нам всім переглянутись, і, сподіваємось, незабаром після цього ми також його розглянемо. </p>"}