{"title":"Дісней + має близько 100 мільйонів передплатників","content":"<p> Ніколи не недооцінюйте Діснея. Хоча Disney + був запущений в США лише в листопаді 2019 року, потокова послуга зараз може похвалитися майже 100 мільйонами передплатників. Це зростання, якого навіть компанія не очікувала. </p> <h2 id=\"how-many-customers-does-disney-have\"> Скільки клієнтів у Disney +? </h2> <p> Як було оголошено в <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Звіт про прибутки Disney Q1 за 2021 рік </a> , Станом на 2 січня 2021 року Disney + має 94,9 мільйона передплатників у всьому світі. </p> <p> Це означає, що цифра не враховує підписників, отриманих завдяки успішному випуску WandaVision. Не буде несправедливо припустити, що зараз у Disney + понад 100 мільйонів підписників. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Останні цифри були повідомлені в грудні 2020 року, коли Дісней оголосив, що набрав 86 мільйонів передплатників за свою титульну послугу потокового передавання. Стрибок з тих пір, швидше за все, можна пояснити сильним ексклюзивним вмістом, таким як другий сезон повнометражного фільму &quot;Мандалоріани&quot; та Піксара &quot;Душа&quot;. </p> <p> Середньомісячний дохід на одного абонента знизився з 5,56 дол. США рік тому до 4,04 дол. США сьогодні, що головним чином пояснюється зниженням вартості послуги в Індії та Індонезії. </p> <p> Hulu та ESPN +, потокові сервіси, що також належать Діснею, також зафіксували значне зростання. Перший зріс за рік на 30% - до 39,4 млн. Абонентів, тоді як другий виріс на 83% у порівнянні з попереднім роком, загалом на 12,1 млн. Передплатників. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Нещодавно Дісней випустив пакет, що поєднує всі його потокові послуги </a> , тому очевидно, що компанія продовжує підтримувати всі три. </p> <p> Незабаром Star також має бути запущений у багатьох регіонах, що забезпечить величезний приріст кількості фільмів та телешоу, які пропонує Disney +. </p>"}