{"title":"DeviantArt додає бічну панель та групи до свого мобільного додатка","content":"<p> Кожен художник-візуаліст має свій власний унікальний творчий процес, але загальноприйнято - особливо в сучасну епоху цифрових технологій - останнім кроком у цьому процесі є передача готового твору в Інтернеті. </p> <p> Давно минули часи, коли вам доводиться знаходити музеї, де будуть робити ваші картини чи фотографії, щоб люди їх бачили. Натомість виберіть платформу, яка вам найбільше подобається, і відправте повідомлення! </p> <p> Заснована в 2000 році, DeviantArt - одна з найстаріших мистецьких спільнот в Інтернеті. DeviantArt запустив свій мобільний додаток у 2017 році, і його останнє оновлення невелике, але значне. </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt для мобільних пристроїв покращує навігацію </h2> <p> DeviantArt покращив користувальницький інтерфейс свого мобільного додатка, додавши бічну панель, дуже схожу на ту, що на веб-сайті DeviantArt. Бічна панель забезпечує швидкий доступ до домашньої сторінки, девіантів (виконавців), за якими ви стежите, та груп. </p> <p> <strong class=\"gallery__section-title\"> Галерея зображень (2 зображення) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> Розгорнути <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <p> Доступ до останнього елемента в цьому списку особливо помітний, оскільки до цього оновлення групи DeviantArt були доступні лише на веб-сайті. Групи DeviantArt функціонують подібно до <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> Групи у Facebook </a> —Колекції користувачів, які об’єдналися на платформі зі спільними інтересами або цілями. </p> <p> На бічній панелі ви можете торкнутися <strong> Мої групи </strong> щоб переглянути всі групи, до яких ви входите, або <strong> Рекомендовані групи </strong> для перегляду груп, які, на думку DeviantArt, підходять вам. Ви також можете закріпити свої улюблені групи у верхній частині бічної панелі для зручності доступу. </p> <p> Якщо ви керуєте власною групою, вона може з’явитися в рекомендованому розділі для інших девіантів, які можуть зацікавитись приєднатися. Якщо вас не цікавить група, торкніться трьох крапок праворуч від її назви, щоб видалити рекомендацію. </p> <p> Відвідавши групу в додатку, ви побачите як її відхилення (подання), так і публікації. Адміністратори групи можуть публікувати оновлення для своєї групи у стрічці повідомлень. </p> <p> <strong> Завантажити: </strong> DeviantArt для <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> (Безкоштовно) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> Де ви ділитесь своїми творами в Інтернеті? </h2> <p> Якщо ви художник, дизайнер або фотограф, який вже давно в Інтернеті, швидше за все, ви колись були на DeviantArt. Здається, громада не настільки жвава, як на початку 2000-х, але обсяг надісланих робіт останнім часом зростав. </p> <p> З такою активною базою користувачів для DeviantArt має стати надзвичайно важливим вдосконалення свого мобільного додатка. На момент написання статті додаток отримало рейтинг 2,6 / 5,0 в App Store та 3,2 / 5,0 в Google Play. </p>"}