{"title":"Введіть третій вимір: Робота з робочими процесами 3D у програмі Adobe After Effects","content":"<p> Якщо ви хочете вдосконалити робочий процес Adobe After Effects, з часом вам доведеться розпочати роботу з віссю Z, що дозволить вам управляти глибиною 3D об’єкта. </p> <p> Це відкриває низку нових візуальних ефектів та стилів для роботи, але також створює власні набори обмежень та міркувань. </p> <p> У цій статті ми розглянемо, як увімкнути та працювати з 3D-шарами, а також як додати та анімувати 3D-камери для створення динамічних рухів. Також буде розглянуто сценарій, коли ми анімуємо та переміщуємо текст у тривимірному просторі. </p> <p> Давай заскочимо! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> Як увімкнути та анімувати 3D-шари </h2> <p> У межах вашої композиції ви можете перемикати шари на часовій шкалі, щоб увімкнути їх як 3D. </p> <p> Це дуже простий процес. Просто знайдіть <strong> Куб </strong> піктограми для ваших шарів на часовій шкалі та клацніть поле під нею, щоб увімкнути 3D для цього шару. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> Після цього ви, швидше за все, не побачите негайних змін. Однак, якщо ви перейдете до свого положення, масштабу та параметрів обертання у своєму шарі, ви побачите, що з’явився третій набір регульованих чисел. </p> <p> Тепер ці нові цифри диктують ваше обертання, положення та масштаб на осі Z у тривимірному просторі. Як і у випадку з іншими параметрами, вони можуть бути ключовими кадрами для анімації та маніпуляцій. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> Як приклад, давайте створимо композицію та текстовий шар з деякими словами. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Після цього ввімкніть 3D-шар. Зверніть увагу, що якщо ви плануєте використовувати <strong> Вирівняти </strong> інструмент, щоб переконатися, що ваш шар ідеально відцентрований, вам потрібно буде зробити це перед увімкненням 3D. Це тому, що <strong> Вирівняти </strong> інструмент працює лише на 2D-шарах. </p> <p> Тепер, коли наш текстовий шар є 3D-шаром, ми можемо переміщати його в 3D-просторі вздовж Z-осі. Отже, давайте змусимо текст рухатися &quot;на екран&quot;. </p> <p> Спочатку ми встановимо наш параметр Z-Axis. За замовчуванням це значення дорівнює нулю. Давайте встановимо це <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Тепер ми перемістимося за дві секунди за нашою шкалою часу і встановимо для нашого значення осі Z значення <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> З цією зміною ми повинні бачити, як текст рухається &quot;назустріч&quot; екрану. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> Що таке 3D-камери? </h2> <p> Ми успішно анімували об’єкт у тривимірному просторі в After Effects. Але що, якщо у вас є кілька об’єктів, і ви хочете створити відчуття того, як глядач рухається до них або від них? </p> <p> Ви можете просто анімувати кожен окремий елемент, щоб рухатися до вас, але це буде значно трудомістким і не особливо ефективним. Тут ви б використовували 3D-камеру. </p> <p> </p> <p> Якщо ви використовуєте програмне забезпечення 3D, таке як Cinema 4D або Blender, швидше за все, ви вже використовували 3D-камери раніше. Якщо ви коли-небудь грали в комп’ютерну гру, ви також відчували 3D-камеру, яка рухає ваш погляд у 3D-світі. </p> <p> Спочатку все це може здатися складним, але 3D-камери функціонують так само, як справжня камера. Вони дають вам поле зору, яким можна маніпулювати та переміщати його у тривимірному просторі. </p> <p> Давайте попрацюємо на прикладі. </p> <h3 id=\"setting-up-a-3d-camera\"> Налаштування 3D-камери </h3> <p> Для початку створіть кілька 3D-текстових шарів і розмістіть їх послідовно вниз по осі Z. </p> <p> У цьому прикладі розрив <strong> 3000 пікселів </strong> між кожним шаром. Перший шар сидить на нулі, наступний на 3000, наступний на 6000 і так далі. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Тепер настав час створити 3D-камеру, натиснувши <strong> Шар </strong> &gt; <strong> Новий </strong> &gt; <strong> Камера </strong> , на якому ви побачите вікно для налаштування параметрів для нового шару камери. Вони бувають двох типів: <strong> Один вузол </strong> і <strong> Два Вузли </strong> . </p> <p> <strong> Одновузольний </strong> Камера призначена для роботи та імітації реальної камери якомога ближче, а точка фокусування визначається вручну рухом камери. </p> <p> A <strong> Двовузловий </strong> Камера розроблена таким чином, щоб слідувати одній визначній точці, що робить її ідеальною для орбіти або слідування за об’єктом, що рухається. </p> <p> У цьому випадку сценарій <strong> Одновузольний </strong> буде використана камера. У вікні ви помітите ряд додаткових налаштувань, таких як <strong> Збільшити </strong> , <strong> Кут зору </strong> , <strong> Увімкнути Глибину різкості </strong> , і <strong> Фокусна відстань </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Вони призначені для відображення реальних налаштувань камери. Якщо ви підковані в тому, як вони працюють, сміливо пограйте з ними. Якщо ні, ви можете вибрати серію попередньо встановлених налаштувань у верхньому правому куті. </p> <p> Ми збираємось вибрати <strong> 35мм </strong> наперед встановлений. Тепер, коли наш шар камери налаштований і на сцені, спочатку ви не побачите особливої ​​різниці. </p> <h3 id=\"using-3d-camera-navigation\"> Використання навігації 3D-камери </h3> <p> Існує два методи, за допомогою яких ви можете налаштувати та анімувати вигляд камери. Найточнішим є введення різних <strong> Позиція </strong> значення в <strong> Трансформувати </strong> налаштування для шару камери. Потім ви можете зробити ключовий кадр, як це було б під час анімації будь-якого іншого шару. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> Під час переміщення камери ви помітите, що всі інші тривимірні об’єкти на вашій сцені рухатимуться по відношенню до неї. Зверніть увагу, що камера буде <strong> не впливає на 2D-шари </strong> . </p> <p> Отже, давайте налаштуємо нашу камеру на переміщення по осі Z від нуля до 9000 за інтервал у чотири секунди, і визначимо наш рух. </p> <p> Ось вам! Якщо ви правильно налаштували його, слова повинні штовхати &quot;назустріч&quot; вам, &quot;через&quot; поле зору та &quot;позаду&quot; глядача. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> Інші способи переміщення 3D-камери </h3> <p> Якщо ви віддаєте перевагу трохи більше експериментувати і менше керувати цифрами за допомогою камери, є інші способи переміщення, навігації та налаштування. <strong> Орбіта </strong> , <strong> Пан </strong> , і <strong> Доллі </strong> інструменти у верхній частині панелі інструментів дозволяють вам це зробити. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> Використовуючи їх, ви можете натискати та перетягувати, щоб переходити з боку в бік ( <strong> Панорама) </strong> , обертати навколо ( <strong> Орбіта </strong> ), а також збільшувати та зменшувати ( <strong> Доллі </strong> ). Ці елементи управління менш точні, ніж введення цифр, але вони чудово підходять для планування ваших грубих рухів камери та анімації. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> Практика веде до досконалості </h2> <p> Тепер ви повинні мати можливість створювати та анімувати 3D-шари вздовж осі Z, а також працювати з 3D-камерами для навігації з кількома 3D-об’єктами. </p> <p> Якщо вам подобається працювати в тривимірному просторі, можливо, ви захочете вивчити більш розширені можливості, які може запропонувати більш спеціальна програма 3D, така як Blender. </p>"}