{"title":"Марк Цукерберг у Фейсбуці взяв особисту конфіденційність Apple","content":"<p> Як повідомляється, генеральний директор Facebook Марк Цукерберг сказав співробітникам Facebook, що &quot;нам потрібно завдавати біль&quot; Apple за те, що він так погано ставиться до гіганта соціальних мереж <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> Wall Street Journal </a> звітів. </p> <p> Цукерберг нібито прокоментував це у 2018 році після того, як головні виконавчі директори Apple та Facebook вдарили головами через скандал Cambridge Analytica, в якому особисті дані мільйонів користувачів Facebook отримували доступ без їхньої згоди на політичну рекламу. </p> <h2 id=\"apple-vs-facebook\"> Apple проти Facebook </h2> <p> Тоді генерального директора Apple Тіма Кука в одному з інтерв’ю запитували, як він реагуватиме, якщо опиниться в ситуації Цукерберга, стикаючись із кризою. &quot;Я б не потрапив у цю ситуацію&quot;, - сказав Кук. </p> <p> The Wall Street Journal стверджує, що, хоча Цукерберг коментував, що слова Кука були &quot;надзвичайно примхливими&quot; і &quot;зовсім не відповідали істині&quot;, за лаштунками він був значно жорсткішим у своїх оцінках. </p> <p> З тих пір відносини між двома технологічними компаніями не покращилися. Apple подвоїла свою позицію, орієнтовану на конфіденційність, і Кук проголосив конфіденційність однією з них <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> найбільш актуальні проблеми у світі </a> . iOS 14 містить безліч функцій, пов’язаних із конфіденційністю, з якими Facebook вирішив проблему, стверджуючи, що вони можуть зашкодити малому бізнесу. </p> <p> Під час останнього щоквартального дзвінка інвестора від Facebook Цукерберг назвав Apple &quot; <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> один з найбільших конкурентів [Facebook] </a> &quot;в результаті цих нових заходів щодо захисту конфіденційності.&quot; Apple може сказати, що вони роблять це, щоб допомогти людям, але ці кроки чітко відстежуються з урахуванням їх конкурентних інтересів &quot;, - сказав Цукерберг. </p> <p> </p> <p> Facebook нібито готує антимонопольну справу проти Apple, яка перетворить снайперство між двома титанами Силіконової долини на повну юридичну боротьбу. У звіті Wall Street Journal зазначається, що &quot;потенційні регуляторні врегулювання та юридичні рішення, ймовірно, вплинуть на сотні мільйонів телефонів споживачів у найближчі роки&quot;. </p> <p> </p> <h2 id=\"different-approaches\"> Різні підходи </h2> <p> Представник Facebook Дані Левер заявив Wall Street Journal, що &quot;Apple стверджує, що це стосується конфіденційності, але справа стосується прибутку, і ми приєднуємося до інших, щоб вказати на їх перевагу та антиконкурентну поведінку&quot;. Вона зазначила, що Facebook &quot;навмисно протистоїть Apple&quot; від імені менших підприємств та розробників, яких зачіпає функція Apple Privacy Privacy. </p> <p> Хоча Левер заперечував, що битва між двома компаніями є особистою, це абсолютно виходить за рамки лише кількох суперечок між двома великими технологічними компаніями. Фінансова модель реклами, на якій працює Facebook, надзвичайно відрізняється від моделі, що фінансується апаратним забезпеченням, яка забезпечує Apple. Жодна з двох компаній - або їх лідерів - швидше за все не відступиться від своїх основних переконань щодо того, як будувати майбутнє технологій. </p> <p> Той факт, що генеральний директор Apple Тім Кук обговорює конфіденційність у моральному плані, свідчить про те, наскільки це дійсно особисте, на одному рівні. </p> <p> <small> Кредит зображення: Вікіпедія / <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Ентоні Кінтано CC </a></small> </p>"}