{"title":"Google додає підтримку ідентифікатора обличчя до Chrome для iOS","content":"<p> Google тестує нову функцію безпеки в Chrome 89 для iOS, яка використовує біометричну автентифікацію iPhone для захисту ваших вкладок приватного перегляду. Наразі це обмежено для користувачів бета-каналу Chrome, це дозволить вам заблокувати вкладки анонімного перегляду за допомогою Face ID або Touch ID. </p> <h2 id=\"even-more-private-private-browsing\"> Ще більше приватного приватного перегляду </h2> <p> Будь-які вкладки анонімного перегляду, захищені Face або Touch ID, розмиті в перемикачі вкладок. Заблоковані вкладки знову стають видимими після підтвердження за допомогою біометричної автентифікації «iPhone». </p> <p> Ця корисна функція не тільки покращує вашу конфіденційність, але й підвищує вашу безпеку під час багатозадачності між програмами на вашому iPhone або iPad. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> зазначає, що не всі користувачі бета-версії можуть отримати доступ до нової опції блокування через компонент на стороні сервера. </p> <p> </p> <h2 id=\"how-s-this-useful\"> Чим це корисно? </h2> <p> Це також корисно в ті часи, коли друг може попросити позичити ваш iPhone, щоб швидко знайти щось в Інтернеті. Завдяки захисту Face ID для режиму приватного перегляду Chrome вони не зможуть бачити ваші відкриті веб-сайти в режимі інкогніто під час перемикання між вкладками. </p> <p> </p> <p> &quot;Інкогніто&quot; - це маркетингова назва режиму приватного перегляду Chrome. У режимі анонімного перегляду ви можете переглядати веб-сторінки, не зберігаючи Chrome жодної інформації про сеанс. Коли ви закриваєте вікно анонімного перегляду, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> вся інформація про цю сесію зникає </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> Як увімкнути Face або Touch ID у Chrome </h2> <p> Цю нову функцію потрібно вручну ввімкнути в розділі Конфіденційність налаштувань додатка Chrome. Подібний блокування конфіденційності є в інших програмах Google. </p> <p> Наприклад, у власному додатку Пошук біометрична автентифікація iPhone підтверджує вашу особу при поверненні до сеансу анонімного перегляду через 15 хвилин. На Google Диску також доступна додаткова автентифікація Face або Touch ID для захисту ваших файлів під час виходу з програми. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> Коли функція вийде офіційно? </h2> <p> Поки що немає жодної інформації про те, коли нова опція блокування може запуститися для всіх, але Chrome 89, як очікується, вийде для загального споживання наступного місяця. Google також може вирішити взагалі не випускати цю функцію, незважаючи на те, що вона вказана в офіційних примітках до випуску. </p>"}