{"title":"Як зробити власну настільну гру в настільному симуляторі","content":"<p> Ви коли-небудь думали про те, щоб створити гру, щоб грати з друзями на Tabletop Simulator (TTS)? Або, можливо, ви розробник настільних ігор, які бажаєте прототипувати ігри та тестувати їх в Інтернеті. </p> <p> Ніколи не було кращого часу, щоб скористатися різноманітним ігровим середовищем TTS. Сьогодні ми навчимо вас, як саме це робити. </p> <h2 id=\"what-is-tabletop-simulator\"> Що таке настільний симулятор? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Для тих, хто не знає, Tabletop Simulator (TTS) надає тривимірне середовище для гри в настільні ігри, як локально, так і онлайн. Це стало чудовим способом <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> грати в настільні ігри онлайн з друзями </a> . </p> <p> Ігри, що відтворюються на TTS, включають все: від покеру, шашок, підземель та драконів, міні-гольфу та навіть найновіших настільних ігор. Будь-яка гра, в яку ви хочете зіграти, зазвичай доступна як DLC або в майстерні спільноти. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> Навіщо використовувати настільний симулятор? </h2> <p> Якщо ви коли-небудь намагалися створити фізичну настільну гру, ви знаєте, наскільки це може зайняти багато часу, не лише для створення елементів гри, але й для модифікації або заміни, коли ви вирішите налаштувати або переглянути гру. </p> <p> У TTS все, від кольору до ваги предмета, можна змінити клацанням миші, що робить процес перегляду плавним і безболісним. </p> <p> Крім того, легко транслювати в реальному часі свій геймплей та демонструвати його в соціальних медіа та на потокових платформах. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> Що потрібно для початку </h2> <p> Перш ніж почати, вам знадобиться наступне: </p> <ul> <li> Обліковий запис користувача Steam </li> <li> Настільний симулятор, встановлений на вашому ПК </li> <li> JPG-зображення вашого дизайну дошки та картки </li> </ul> <p> <strong> Завантажити: </strong> Настільний симулятор увімкнено <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> Пар </a> (19,99 дол. США) </p> <p> Розробляти ігрові елементи найкраще за допомогою ілюстрації програмного забезпечення або сканування зображень фізичних карток, які ви вже зробили. Просто переконайтеся, що вони мають розширення JPG та зберігаються окремо. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Створення дощок та плеєрів гравців </h2> <p> Коли ви проектуєте свої дошки та інші 2D-об’єкти, переконайтеся, що роздільна здатність достатньо висока, щоб ви могли правильно її розмірити, не втрачаючи якості. TTS автоматично розмірюватиме його під час імпортування, і ви зможете змінювати його розмір саме так, як вам подобається. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Створення карток </h2> <p> Карти в TTS мають три аспекти: обличчя картки, тильна сторона картки та прихована карта (як карта буде виглядати для інших в руці гравця). Вам потрібно мати дизайни для кожного з них, хоча у вас є можливість просто зробити приховану картку на звороті картки. </p> <h3 id=\"create-and-arrange-card-faces\"> Створіть та впорядкуйте обличчя карт </h3> <p> Замість того, щоб імпортувати кожну карту по одному, найкраще імпортувати всі або більшість своїх карток як одну колоду. </p> <p> Щоб створити колоду, скопіюйте та вставте кожен дизайн на аркуш картки розміром 7x10. Використання такого шаблону, як наведений нижче, допоможе вам розпочати роботу. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> Шаблон окреслює слоти для кожної картки у вашій колоді, що дозволяє імпортувати до 69 карток одночасно. Якщо вам не потрібно так багато, ви можете залишити слоти невикористаними, а якщо у вас більше, ви можете об&#39;єднати колоди або дублікати карт після імпорту. </p> <p> Однак вам не потрібно використовувати цей шаблон. Насправді аркуш картки може бути будь-якого розміру, і TTS автоматично розділить його на сітку 7x10. </p> <p> Для вашої зручності наведені вище шаблони та шаблони квадратних карток доступні у вашому локальному каталозі файлів TTS. </p> <p> Якщо ви не впевнені, де знаходяться ваші локальні файли, ви можете знайти їх у своїй бібліотеці Steam, відкривши <strong> Властивості </strong> меню для TTS. Виберіть <strong> Локальні файли </strong> та натисніть <strong> Перегляньте </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Картки </h3> <p> Якщо вам потрібен лише один дизайн задньої частини всієї колоди, тоді вам знадобиться лише одне зображення дизайну у форматі JPG; не потрібен аркуш картки. </p> <p> Якщо ваша колода буде мати кілька унікальних спинок, вам потрібно буде створити додатковий аркуш карт із дизайном спинок, що відповідає малюнкам обличчя на вашому першому аркуші карт. Для оформлення обличчя в прорізі один помістіть його призначену спинку в проріз одного із задніх сторінок. Для обличчя два покладіть його спинку у проріз два тощо. </p> <h3 id=\"hidden-cards\"> Приховані картки </h3> <p> У слот 70 аркуша картки, позначений на шаблоні як «Прихована карта для інших гравців», розмістіть будь-який дизайн, який ви хочете, щоб його бачили суперники, коли карти в цій колоді знаходяться в руці гравця. Це традиційно однотонний чорний або білий колір, або має задню конструкцію колоди. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Імпорт елементів </h2> <p> Тепер, коли ви створили свої дошки та колоди, ви готові розпочати імпорт. </p> <p> Перш ніж фактично розмістити сервер у своїй грі, корисно розпочати гру для одного гравця та імпортувати елементи заздалегідь. Потім ви можете зберегти налаштування і бути готовими до негайного запуску, коли прибудуть гравці. </p> <p> Запустіть TTS і натисніть <strong> Створити </strong> , а потім виберіть <strong> Один гравець </strong> створити середовище. Видаліть будь-які елементи, створені TTS, і виберіть таблицю, на якій ви хочете грати у вашу гру. </p> <p> Коли середовище готове, натисніть на <strong> Об&#39;єкти </strong> у верхньому меню, а потім виберіть <strong> На замовлення </strong> категорії. </p> <h3 id=\"boards-and-player-mats\"> Дошки та килимки гравців </h3> <p> Виберіть <strong> Дошка </strong> від <strong> На замовлення </strong> меню та клацніть де завгодно на столі, де ви хочете, щоб дошка відображалася. Клацніть правою кнопкою миші в будь-якому місці, щоб відкрити діалогове вікно імпорту дошки. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Перейдіть до свого зображення дошки, і TTS запитає, чи хочете ви завантажити його у свій обліковий запис Steam Cloud або зберегти локальний файл. Завантажте файли в хмару, якщо плануєте коли-небудь грати у свою гру онлайн або на іншому пристрої. </p> <p> Ви можете за бажанням завантажити свої зображення на інший хост, наприклад Dropbox, Photobucket або Imgur, і вставити сюди URL-адресу. Зовнішні хости менш надійні, однак і не рекомендуються. </p> <p> Коли ви завантажуєте його у свою хмару Steam, TTS попросить вас дати йому ім’я файлу. Після завершення завантаження натисніть <strong> Імпорт </strong> . </p> <p> З імпортованою дошкою тепер ви можете зменшити або збільшити її за допомогою <strong> - </strong> і <strong> + </strong> клавіші на клавіатурі. Щоб зафіксувати його на місці, щоб він випадково не перемістився під час гри, клацніть правою кнопкою миші на дошці та під <strong> Перемикачі </strong> , натисніть <strong> Замок </strong> . </p> <h3 id=\"card-decks\"> Колоди карт </h3> <p> В <strong> Спеціальний об&#39;єкт </strong> меню, натисніть <strong> Колода </strong> . Клацніть де завгодно на столі, де ви хочете, щоб колода з&#39;явилася, а потім клацніть правою кнопкою миші, щоб розпочати імпорт. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Налаштуйте параметри наступним чином: </p> <ul> <li> <strong> Тип: </strong> Змініть це, якщо ви маєте на увазі конкретну форму, крім звичайної прямокутної картки з круглим кутом. </li> <li> <strong> Обличчя: </strong> Клацніть на <strong> Перегляньте локальні файли </strong> і знайдіть аркуш вашої особи. Знову ж таки, ми рекомендуємо опцію Steam Cloud над локальними файлами або зовнішніми хостами. </li> <li> <strong> Унікальні спинки: </strong> Позначте цей параметр, якщо ваша колода матиме кілька конструкцій спинки, а потім завантажте аркуш задньої картки в <strong> Назад </strong> коробці. Якщо ви використовуєте єдиний дизайн для цілої колоди, просто завантажте задній дизайн. </li> <li> <strong> Ширина та висота: </strong> Відрегулюйте це, якщо ви використовували коефіцієнт, відмінний від стандартної прямокутної картки, 10x7. </li> <li> <strong> Кількість: </strong> Переконайтеся, що це збігається з кількістю карток, які ви імпортуєте. </li> <li> <strong> Убік: </strong> Це змінює орієнтацію для <strong> Alt Zoom </strong> функція в TTS. Залиште це позначеним, якщо тільки ви не хочете, щоб картка відображалася збоку. </li> <li> <strong> Назад приховано: </strong> Поставте цей прапорець, якщо ви хочете, щоб прихований вигляд ваших карток був просто тильним боком карт. </li> </ul> <p> Коли ваші налаштування будуть правильними, натисніть <strong> Імпорт </strong> . Ваша колода з’явиться на столі, і ви можете почати перетасовувати і ділитися. </p> <p> Якщо ви хочете, щоб ваші картки мали імена, які допоможуть у сортуванні, клацніть правою кнопкою миші на одній картці та клацніть <strong> Ім&#39;я </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Імпорт інших елементів гри </h2> <p> Імпорт інших 2D-об&#39;єктів схожий на процес імпорту плат. Не забувайте, що TTS має багато загальних ігрових елементів, таких як кістки та фігурки, готові до використання в <strong> Об&#39;єкти </strong> меню. </p> <p> Якщо у вас є власні 3D-елементи, які ви хочете використовувати, дотримуйтесь <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> Посібник TTS з імпорту 3D-моделей </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Збереження повної гри </h2> <p> Після розташування компонентів у початковому стані налаштування клацніть на <strong> Ігри </strong> у верхньому меню. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Виберіть <strong> Зберегти та завантажити </strong> і натисніть на <strong> Зберегти гру </strong> кнопку. Дайте йому ім’я та натисніть <strong> Зберегти </strong> . Тепер, коли ви розміщуєте ігри, ви можете перезавантажити його в ідеальному налаштуванні, відкривши <strong> Зберегти та завантажити </strong> меню. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Максимально використайте настільні ігри на замовлення </h2> <p> Створення та гра на замовлення ігор є простими у Tabletop Simulator, коли ви знаєте, як це зробити. Запросіть своїх друзів або шукайте готових і охочих учасників театру <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> спільнота TTS </a> . Тепер ви можете показати свою власну гру іншим! </p>"}