{"title":"HBO Max розпочне свою роботу в Латинській Америці в червні","content":"<p> HBO Max, послуга потокової передачі від WarnerMedia, запускається в Латинській Америці та Карибському басейні в червні 2021 року. Ця послуга вперше буде доступна за межами США. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> Де запуск програми HBO Max в Латинській Америці? </h2> <p> На даний момент HBO Max доступний лише в США. Прийде наприкінці червня 2021 року, він буде доступний у багатьох країнах Латинської Америки та Карибського басейну. Новину було оголошено в <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> Прес-реліз WarnerMedia </a> . </p> <p> Зокрема, такими країнами є: Ангілья, Антигуа, Аргентина, Аруба, Британські Віргінські острови, Багами, Барбадос, Беліз, Болівія, Бразилія, Кайманові острови, Чилі, Колумбія, Коста-Ріка, Кюрасао, Домініка, Домініканська Республіка, Еквадор, Сальвадор , Гренада, Гватемала, Гайана, Гаїті, Гондурас, Ямайка, Мексика, Монтсеррат, Нікарагуа, Панама, Парагвай, Перу, Сент-Кітс і Невіс, Сент-Люсія, Сент-Вінсент, Суринам, Тринідад і Тобаго, Теркс і Кайкос, Уругвай та Венесуела. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> Що запропонує HBO Max у Латинській Америці? </h2> <p> </p> <p> Існуючі абоненти HBO GO, які платять безпосередньо або через &quot;відповідних партнерів&quot;, отримають миттєвий доступ до HBO Max. Потім HBO GO буде поступово припинено по регіонах. </p> <p> Детальна інформація про ціни не повідомляється, хоча це обіцяють у найближчі місяці, а також інформацію про новий вміст та рекламні пропозиції. </p> <p> Як і в США, HBO Max запропонує різноманітні пакети передплати та пристрої підтримки, такі як смартфони, планшети та інші інтелектуальні платформи. </p> <p> </p> <p> У трейлері, що повідомляє про новини, можна побачити кліпи із таких серіалів, як &quot;Гра престолів та друзів&quot;, а також такі фільми, як &quot;Матриця&quot; та &quot;Касабланка&quot;. Однак наприкінці з&#39;являється невелике повідомлення, яке попереджає, що &quot;не всі заголовки [будуть] доступні при запуску&quot;. </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> Коли HBO Max буде доступний у всьому світі? </h2> <p> Минулого року Warner Bros. суперечливо оголосила, що планує випустити весь свій театральний лист до 2021 року на HBO Max. Це викликало режисер <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Крістофер Нолан назвав HBO Max &quot;найгіршою послугою потокового передавання&quot; </a> . </p> <p> Тим не менше, хоча деякі представники кіноіндустрії можуть і стогнати, це чудовий крок для вибору для споживачів. </p> <p> Таким чином, представники країн Латинської Америки та Карибського басейну, мабуть, будуть раді запуску HBO Max, сподіваючись, що угода стосується і них. </p> <p> Що стосується решти світу? Жодних фірмових дат не встановлено, але WarnerMedia показала, що пізніше цього року планується модернізація країн Північної Європи, Іспанії, Центральної Європи та Португалії до рівня HBO Max. </p> <p> Йоханнес Ларчер, керівник HBO Max International, сказав: </p> <blockquote> <p> Ми в захваті від запуску HBO Max у Латинській Америці та Карибському басейні, що є першим кроком до надання послуги WarnerMedia Direct-to-Consumer споживачам за межами США та у всьому світі. </p> </blockquote>"}