{"title":"Як захистити свої особисті дані від роботодавців","content":"<p> Технологія спостереження широко поширена всередині та поза офісом. Багато роботодавців використовують засоби управління мобільними пристроями для пристроїв, що випускаються компанією, таких як телефони, ноутбуки та планшети. Вони містять програми, призначені для захисту бізнесу від крадіжок, корпоративного шпигунства або зловмисних намірів. </p> <p> Однак, хоча все це чудово захищає вашу компанію, вони не зовсім найкращі для вас. Це вже не питання <strong> якщо </strong> ваша компанія відстежує вас; наступне, що вам потрібно запитати, - скільки даних можуть насправді знайти компанії? Дивно, але багато. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> Що можуть бачити роботодавці на фірмових Wi-Fi та віддалених пристроях? </h2> <p> Більшість людей не усвідомлюють, наскільки компанії мають доступ до своїх даних або скільки з них вони підписують, використовуючи корпоративні пристрої. Ось кілька прикладів. </p> <h3 id=\"location\"> Розташування </h3> <p> Багато співробітників вважають, що використання віртуальної приватної мережі (VPN) достатньо, щоб їхні роботодавці повірили, що вони знаходяться там, де вони повинні бути. </p> <p> Хоча існують способи приховати своє справжнє місцезнаходження на персональному пристрої, це не зовсім надійно, особливо коли ви ввійшли в будь-яку програму чи веб-сайт із електронною адресою компанії або номером мобільного телефону. </p> <p> </p> <p> Можливо, майже неможливо приховати своє справжнє місцезнаходження під час використання пристроїв, що випускаються компанією. Наприклад, телекомунікаційні компанії можуть виявити, коли ви встановили зв’язок з будь-яким із їхніх роумінгових партнерів. </p> <p> Крім того, корпоративні VPN відрізняються від комерційних VPN, шлюзи яких контролюються внутрішніми ІТ-групами. </p> <h3 id=\"notes-documents-and-emails\"> Примітки, документи та електронні листи </h3> <p> Якщо ви вважаєте, що ніхто не знає, що ви використовували службовий Wi-Fi для пошуку наступної роботи, ви помиляєтесь. Навіть якщо ви не використовуєте корпоративну адресу електронної пошти, багато підприємств мають попередньо встановлені програми на портативних комп’ютерах, які включають журнали активності в режимі реального часу, оновлення історії перегляду та скріншоти відкритих документів та електронних листів за часом. </p> <p> Базуючись на захисті від можливих порушень даних, багато компаній також використовують їх як механізми звітування або відстеження продуктивності. </p> <p> </p> <h3 id=\"online-messaging-history\"> Історія обміну повідомленнями в Інтернеті </h3> <p> Незважаючи на зростання зашифрованих платформ, реальність полягає в тому, що ваші повідомлення не є повністю приватними на корпоративних пристроях. Використовуючи платформи обміну повідомленнями, компанії можуть не бачити точних деталей ваших бірж, але, ймовірно, все одно зможуть розпізнати метадані такого розміру та типу. </p> <p> Якщо ви вирішите надсилати PDF-файли великих розмірів через такий додаток, як WhatsApp, система виявлення вторгнень у вашу компанію, швидше за все, позначить вас за підозрілу поведінку. Відповідно до корпоративних вказівок, вони можуть попросити вас довести, що ваші дії не були зловмисними, і, можливо, доведеться вимагати виходу з керівництва для отримання дозволу. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> Як уникнути обміну особистими даними з роботодавцем </h2> <p> Немає абсолютного способу тримати вашу особисту інформацію, розмови та дії повністю недоступними в будь-який час. Однак існує кілька способів зменшити ризики. </p> <p> Ми не схвалюємо приховування даних від ваших роботодавців; насправді вони мають право збирати інформацію про своїх працівників, навіть будучи <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> зможете відстежити вас легально </a> . Але потрібно знати, коли доречно тримати речі при собі, і це залежить від окремих компаній. </p> <h3 id=\"read-company-policies\"> Прочитайте політику компанії </h3> <p> Перш ніж ви можете сперечатися щодо прозорості даних, ви також повинні зрозуміти, яку інформацію ви свідомо надаєте своєму роботодавцю, працюючи на них. Тільки коли ви знаєте, що очікується, ви можете встановити відповідні професійні межі. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Прагніть зрозуміти політику та процедури збору даних компанії до їх збирання. З цього моменту ви можете ефективно скласти план відмови від надання більше інформації, ніж потрібно. </p> <h3 id=\"use-personal-gadgets\"> Використовуйте особисті гаджети </h3> <p> Незважаючи на те, що завжди хочеться використовувати корпоративні пристрої, щоб заощадити гроші, насправді нічого не буває справді безкоштовним. Інвестуйте в ноутбуки, мобільні телефони та планшети для особистого користування. </p> <p> Наявність окремих персональних пристроїв - це також чудовий спосіб встановити межі, особливо при віддаленій роботі. </p> <p> Використання власного пристрою дає вам можливість встановлювати та керувати різними методами безпеки, необхідними для захисту ваших даних від сторонніх очей. Це може здатися непотрібною витратою, але це триває довгий шлях, щоб зберегти ваш душевний спокій. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Використовуйте гостьові профілі на особистих пристроях </h3> <p> Підключення до будь-якої мережі, що не є власною, завжди є загрозою безпеці, навіть якщо вона знаходиться у робочих приміщеннях. Вхід у мережу Wi-Fi компанії надає вашому роботодавцю доступ до всього, від метаданих ваших повідомлень до журналів історії перегляду. </p> <p> Якщо вам абсолютно потрібно використовувати свій персональний ноутбук у мережах компанії, ви можете вибрати гостьовий профіль, щоб зменшити обсяг даних, до якого вони можуть отримати віддалений доступ. Крім того, ви можете підключитися до тарифного плану свого персонального мобільного телефону або портативного пристрою Wi-Fi. </p> <h3 id=\"keep-your-passwords-safe\"> Бережіть свої паролі </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Створення надійних паролів </a> недостатньо. Потрібно переконатися, що ваші паролі не зберігаються на корпоративних пристроях. Збереження особистих паролів для банківських рахунків в Інтернеті, особистих електронних листів або державних веб-сайтів у гаджетах, якими ви не володієте, піддає ваші дані безпосередньому ризику, якщо ваша компанія базується на компрометації. </p> <p> Використовуйте лише свій особистий мобільний телефон або ноутбук для доступу до важливих рахунків, особливо до тих, де йдеться про гроші. По можливості вмикайте двофакторну автентифікацію. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> Відокремте свою роботу та особисте життя </h2> <p> Роботодавці мають право віддалено отримати доступ до пристрою, який випускає ваша компанія, якщо вони підозрюють, що ви берете участь у будь-якій формі незаконної діяльності, ставите інформацію про компанію під загрозу або вимагаєте від правоохоронних органів для розслідування. </p> <p> Однак це відрізняється від персональних пристроїв. </p> <p> Ваша безпека настільки ж міцна, як і люди, з якими ви контактуєте - включаючи вашого роботодавця. Зберігання персональних та робочих пристроїв - це лише один крок до децентралізації даних. Практикуючи суворі заходи безпеки, ви можете обмежити кількість точок доступу, які хакери мають для документів, електронної пошти та мереж. </p> <p> Децентралізація персональних даних необхідна, оскільки вона захищає вас, як приватну особу, так і вашу компанію від крадіжок, шахрайства та інших форм кіберзлочинності. </p>"}