{"title":"Як користуватися програмою Apple Watch Workout","content":"<p> Краще зрозуміти свій прогрес у фітнесі - це лише кілька кроків від Apple Watch. </p> <p> Ми розглядаємо все, що може запропонувати додаток Apple Watch Workout, включаючи те, як працює програма, які типи тренувань вона може відстежувати та як переглянути всю інформацію, яку вона збирає. </p> <h2 id=\"getting-started-with-the-workout-app\"> Початок роботи з програмою Workout </h2> <p> Програму Workout на Apple Watch можна відкрити різними способами. По-перше, просто натисніть один раз на <strong> Цифрова корона </strong> щоб переглянути список програм на годиннику. Потім виберіть <strong> Тренування </strong> . </p> <p> Ще швидшим способом є просто використовувати Siri, або тривалим натисканням <strong> Цифрова корона </strong> або підняття годинника до рота. Тоді просто скажіть &quot;Відкрити програму тренування&quot;. </p> <p> Після відкриття програми ви побачите найрізноманітніші типи тренувань - від стрільби з лука до йоги та всього іншого. </p> <p> Основний екран вибору тренування виділений найбільш популярними опціями. Прокрутіть до кінця списку та виберіть <strong> Додати тренування </strong> щоб переглянути список інших типів тренувань. Якщо з якихось причин ви не бачите тип тренування, ви також можете вибрати <strong> Інший </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> Ви можете вибрати <strong> три крапки </strong> ( <strong> ... </strong> ) на кожному типі тренування встановити певну мету - відстань, спалені калорії чи час. Якщо будь-яка з цих цілей вас не цікавить, просто натисніть назву тренування, щоб негайно розпочати. </p> <p> На екрані буде три секунди зворотний відлік до початку відстеження. </p> <p> Усі функції програми Workout доступні без iPhone поблизу або лише за допомогою Apple Watch, підключеного до Wi-Fi або стільникового сигналу. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Зрозумійте програму Workout </h2> <p> У додатку є три основні екрани. Ви можете переключатися між ними, проводячи пальцем вліво або вправо. </p> <p> На головному екрані буде показано весь ваш прогрес у вибраному типі тренування. Ви побачите час тренування, активні калорії, загальну калорію та поточний пульс. Залежно від типу тренування, ви також можете побачити пройдену відстань. </p> <p> Якщо у вас Apple Watch Series 5 або новішої версії, а постійно ввімкнений дисплей увімкнено, ви завжди можете побачити статистику тренувань. Кожен, хто має стару модель, повинен буде підняти екран або торкнутися його, щоб побачити цю інформацію. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Коли ви біжите або гуляєте, Apple Watch забезпечить легкий поштовх на кожній милі або кілометрі та покаже оновлення з інформацією про темп. Велосипедне повторення та простукування відбуватиметься кожні п’ять миль або кілометрів. </p> <p> Якщо ви робите тренування Apple Fitness +, ви можете бачити дані як у програмі Workout, так і на екрані iPhone, iPad або Apple Watch. </p> <p> </p> <p> Проводячи пальцем праворуч від головного екрана, ви побачите чотири різні варіанти - <strong> Замок </strong> , <strong> Новий </strong> , <strong> Кінець </strong> , і <strong> Пауза </strong> . </p> <p> Вибір <strong> Замок </strong> заблокує екран, щоб уникнути випадкових натискань. Можна розгорнути цифрову корону, щоб розблокувати екран. Зазначимо, ця опція автоматично вмикається під час будь-якого типу тренування для плавання, щоб запобігти випадковому постукуванню від крапель води. </p> <p> Як ви могли здогадатися, <strong> Новий </strong> закінчує поточне тренування і дозволяє вибрати новий тип вправи, щоб розпочати знову. Вибір <strong> Кінець </strong> завершить поточне тренування. </p> <p> Якщо вас коли-небудь перебивали, ви можете вибрати <strong> Пауза </strong> кнопку. Повторне натискання почне відстеження тренування. Ви також можете зробити це, одночасно натиснувши кнопку Digital Crown і Side. </p> <p> Проводячи пальцем ліворуч від головного екрану тренування, відображаються елементи керування відтворенням мультимедіа. Це простий спосіб отримати доступ до своєї музики або будь-чого іншого, що ви слухаєте під час тренування. Ви можете пропускати доріжки, відтворювати, призупиняти та зменшувати гучність. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Автоматичні нагадування про тренування </h2> <p> Не потрібно хвилюватися, якщо ви забудете розпочати тренування. Поки у вас є watchOS 5 або пізнішої версії, Apple Watch може автоматично розпізнавати, коли ви тренуєтесь. Він постукає вас по зап’ясті і запитає, чи хочете ви записати тренування, дозволяючи змінити тип тренування, вимкнути ці сповіщення на день або просто відхилити це сповіщення. </p> <p> Незважаючи на те, що сповіщення з’явиться може знадобитися кілька хвилин, усі кредити на тренування все одно зберігаються. </p> <p> Ви можете отримувати нагадування про тренування для таких типів тренувань: прогулянка в приміщенні, прогулянка на свіжому повітрі, пробіжка в приміщенні, пробіжка на відкритому повітрі, еліптична, веслувальник, плавання в басейні та плавання на відкритій воді. </p> <p> Щоб увімкнути або вимкнути функцію, перейдіть до <strong> Налаштування&gt; Тренування&gt; Почати нагадування про тренування </strong> на вашому Apple Watch. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> Apple Watch також може відчути, коли тренування завершена. Після натискання ви побачите екранне сповіщення з опціями завершення або призупинення тренування. Ви також можете повністю відхилити сповіщення та продовжити тренування. </p> <p> Увімкніть або вимкніть цю функцію, перейшовши на свій Apple Watch і перейшовши на <strong> Налаштування&gt; Тренування&gt; Нагадування про закінчення тренування </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Налаштуйте дані, показані в програмі Workout </h2> <p> У поданні Apple Watch Workout ви можете налаштувати інформацію, що відображається на екрані, для багатьох різних типів тренувань. </p> <p> Для початку відкрийте додатковий додаток Watch на вашому iPhone. В <strong> Мій годинник </strong> виберіть вкладку <strong> Тренування </strong> . Тоді вибирай <strong> Вид тренування </strong> . У верхній частині сторінки ви можете вибрати, чи відображати на екрані одну або кілька метрик під час тренування. Якщо ви виберете <strong> Одинарна метрика </strong> , просто прокрутіть цифрову корону, щоб побачити більше даних на вашому Apple Watch. </p> <p> <strong class=\"gallery__section-title\"> Галерея зображень (3 зображення) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <p> Під цим ви також можете побачити ряд різних типів тренувань, де ви можете редагувати інформацію, що відображається на екрані. Виберіть тип тренування, а потім виберіть <strong> Редагувати </strong> у верхньому правому куті екрана, щоб налаштувати, що відображатиметься на екрані та в якому порядку. </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Перегляд даних про тренування в додатку Фітнес </h2> <p> Після того, як ви закінчите тренування, усі дані залишаться на декількох натисканнях на вашому iPhone. </p> <p> Щоб побачити це, відкрийте <strong> Фітнес </strong> додаток. </p> <p> <strong class=\"gallery__section-title\"> Галерея зображень (2 зображення) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <p> Під <strong> Резюме </strong> вкладку, виберіть <strong> Тренування </strong> . Ви побачите інформацію про всі свої тренування. Дані також доступні в <strong> Здоров&#39;я </strong> додаток. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Розбийте піт за допомогою програми Apple Watch Workout </h2> <p> Як бачите, додаток Apple Watch Workout - це чудовий спосіб допомогти відстежувати всі різні показники фітнесу, роблячи все, від плавання до танців та багато іншого. </p> <p> І коли ви готові назвати це на ніч і лягти спати, ваш Apple Watch все одно може допомогти вбудованій функції відстеження сну. </p>"}