{"title":"Як зупинити Windows 10 від блокування завантажених файлів","content":"<p> При спробі відкрити файл Windows 10 може перешкодити вам відкрити його безпосередньо. Він покаже вам попередження про безпеку, що файл походить з невідомого джерела і може бути небезпечним. Це трапляється, коли функція Windows 10 під назвою Attachment Manager блокує файли, які, на її думку, небезпечні для вашого ПК. </p> <p> Хоча ви можете розблокувати кожен файл вручну, це може бути втомливим процесом, особливо якщо вам доводиться робити це майже для кожного завантаженого файлу. У цій статті ми покажемо, як ви можете перешкодити Windows 10 блокувати завантажені файли. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> Що таке диспетчер вкладень у Windows 10? </h2> <p> У Windows 10 існує функція безпеки, яка називається Диспетчер вкладених файлів, яка блокує відкриття небезпечних файлів. Це можуть бути файли, які ви завантажили або <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> файли, які Windows визначає як небезпечні вкладення електронної пошти </a> . Якщо диспетчер вкладених файлів вважає файл небезпечним, він заважає Windows 10 відкрити його та відображає попереджувальне повідомлення. Менеджер вкладень класифікує завантажені файли на основі типу файлу та розширення імені файлу. </p> <p> Менеджер вкладених файлів Windows використовує інтерфейс прикладного програмування (API) IAttachmentExecute, щоб знайти тип файлу, асоціацію файлів та визначити найбільш відповідні дії. Коли ви завантажуєте файли та зберігаєте їх на своєму диску, Windows додає до них певні метадані. Ці метадані вважаються вкладеннями. Коли Windows додає метадані до файлів для завантаження як вкладення, це відомо як інформація про зону. </p> <p> Тепер, <strong> Інформація про зону </strong> саме там лежить корінь справи. Коли Провідник файлів відкриває файл, він зчитує вкладену інформацію про зону, що зберігається в тому ж місці, і перевіряє, чи файл надійшов з невідомого джерела чи ні. Якщо Windows виявить, що файл нерозпізнаний або надійшов з невідомих джерел, це заважає вам відкрити його. </p> <p> З&#39;явиться попередження Windows SmartScreen із зазначенням: </p> <blockquote> <p> Windows SmartScreen запобігла запуску невпізнаної програми. Запуск цієї програми може загрожувати вашому ПК. </p> </blockquote> <p> Якщо ви хочете вручну відкрити заблокований файл, клацніть правою кнопкою миші на завантаженому файлі та виберіть <strong> Властивості </strong> . На вкладці Загальні натисніть <strong> Розблокувати </strong> , натисніть <strong> Подати заявку </strong> а потім клацніть <strong> гаразд </strong> . </p> <p> Але, уявіть, ви повинні робити це щоразу, коли завантажуєте файл - це може дратувати і забирати багато часу. Якщо ви часто завантажуєте файли з Інтернету або отримуєте їх як вкладення електронної пошти, можливо, вам доведеться повністю зупинити ваш ПК від блокування ваших файлів. </p> <p> Щоб Windows 10 не заблокував вам відкриття файлів, потрібно запобігти додаванню інформації про зону до завантажуваних файлів. Це можна зробити, налаштувавши диспетчер вкладень вручну за допомогою редактора локальної групової політики або редактора реєстру. </p> <p> Ми надамо інструкції щодо того, як це можна зробити. Ви повинні увійти як адміністратор, або ви повинні <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> запитувати права адміністратора </a> щоб зупинити блокування завантажених файлів. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Налаштування диспетчера вкладень за допомогою редактора реєстру </h2> <p> Натисніть кнопку <strong> Клавіша Windows + R </strong> відкрити редактор реєстру. Звідти введіть &quot;Regedit&quot; і натисніть <strong> Введіть </strong> . З&#39;явиться запит на керування обліковим записом користувача. Коли з&#39;явиться це запит, клацніть на <strong> Так </strong> , щоб продовжити. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Перейдіть до ключа вкладень у редакторі реєстру: <strong> HKEY_CURRENT_USER&gt; Програмне забезпечення&gt; Microsoft&gt; Windows&gt; CurrentVersion&gt; Політика&gt; Вкладені файли </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> Якщо ключ вкладень відсутній у ключі Політики, вам доведеться його створити. Для цього клацніть правою кнопкою миші на <strong> Політика </strong> клацніть, натисніть <strong> Новий </strong> , натисніть <strong> Ключ </strong> . Це створить новий ключ, який потім слід назвати &quot;Вкладені файли&quot;. Якщо ви виявите, що клавіша вкладень вже присутня, можна перейти до наступного кроку. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> Клацніть правою кнопкою миші на <strong> Вкладення </strong> клацніть, натисніть <strong> Новий </strong> а потім виберіть <strong> Значення DWORD (32-біт) </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Вам буде запропоновано назвати це нещодавно створене значення DWORD. Назвіть його &quot;SaveZoneInformation&quot; і натисніть <strong> Введіть </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> Нарешті, щоб вимкнути диспетчер вкладень у Windows 10, двічі клацніть на щойно створеному <strong> SaveZoneInformation </strong> значення та змініть його дані значення на 1. Клацніть <strong> гаразд </strong> закінчувати. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Завершивши ці кроки, закрийте редактор реєстру та перезавантажте комп&#39;ютер, щоб застосувати зміни. Відтепер будь-який завантажений файл більше не буде додавати інформацію про зону до альтернативного потоку даних файлу. Це дозволить вам без особливих труднощів відкривати файли. </p> <p> Якщо ви хочете повернутися назад і ввімкнути диспетчер вкладених файлів, ви можете зробити це, перейшовши до клавіші вкладень в редакторі реєстру: <strong> HKEY_CURRENT_USER&gt; Програмне забезпечення&gt; Microsoft&gt; Windows&gt; CurrentVersion&gt; Політика&gt; Вкладені файли </strong> . Звідси, праворуч, двічі клацніть на <strong> SaveZoneInformation </strong> значення та змініть його значення значення на 3. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Налаштуйте диспетчер вкладень за допомогою редактора локальної групової політики </h2> <p> Редактор локальної групової політики доступний лише у виданнях Windows 10 Enterprise, Education та Pro. Як результат, цей метод не застосовується, якщо ви є власником видання Windows 10 Home. Якщо ваш ПК працює на версії Windows 10 Home, вам потрібно буде налаштувати диспетчер вкладень за допомогою редактора реєстру. </p> <p> Якщо ви використовуєте випуск Windows 10 із редактором локальної групової політики, ви можете налаштувати диспетчер вкладених файлів, виконавши вказані тут дії. </p> <p> Для початку натисніть <strong> Клавіша Windows + R </strong> , введіть &quot;gpedit.msc&quot; і натисніть <strong> Введіть </strong> відкрити редактор локальної групової політики. </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Перейдіть до Менеджера вкладень: <strong> Конфігурація користувача&gt; Адміністративні шаблони&gt; Компоненти Windows&gt; Менеджер вкладень </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> На правій панелі диспетчера вкладень двічі клацніть на <strong> Не зберігайте інформацію про зону у вкладеннях файлів </strong> політика редагування налаштувань інформації про зону. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> З&#39;явиться вікно, де ви зможете вибрати, чи повинен менеджер вкладень зберігати інформацію про зону. </p> <p> Клацніть <strong> Увімкнено </strong> щоб дозволити диспетчеру вкладень не зберігати інформацію про зону. Це гарантуватиме, що Windows не блокує ваші файли щоразу, коли ви їх відкриваєте. Клацніть на <strong> Подати заявку </strong> , щоб зберегти зміни, а потім натисніть <strong> гаразд </strong> . </p> <p> Після завершення закрийте редактор локальної групової політики та перезавантажте ПК, щоб зберегти зміни. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows більше не блокуватиме ваші файли </h2> <p> Якщо раніше вам доводилося розблоковувати більшість завантажених файлів вручну, ви б зрозуміли, наскільки втомливим може бути цей процес. Застосувавши ці поради, ви зможете легко відкривати всі файли. </p> <p> Якщо ви завантажуєте файли і якимось чином сумніваєтесь у їх надійності, ви завжди можете відкрити їх в захищених ізольованих середовищах, щоб забезпечити безпеку свого ПК та даних. </p>"}