{"title":"Як перетворити ваш PS5 з вертикального на горизонтальний (або навпаки)","content":"<p> PlayStation 5 працює як у вертикальному, так і в горизонтальному режимі. Якщо ви передумаєте, обравши бажану орієнтацію, досить легко перемістити ваш PS5 з вертикальної в горизонтальну (або навпаки). </p> <p> Давайте розглянемо, як безпечно перемістити ваш PS5 з вертикальної орієнтації в горизонтальну сторону і назад. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> Перше: вимкніть і відключіть PS5 </h2> <p> Перш ніж виконувати будь-яку роботу з фізичного переміщення PlayStation 5, важливо вимкнути його та відключити все від мережі. Це запобіжить пошкодженню системи, яке може статися, якщо ви пересуваєте її, коли вона увімкнена. </p> <p> Вам слід повністю вимкнути ваш PS5. Для цього натисніть клавішу <strong> Кнопка PS </strong> на контролері, щоб відкрити швидке меню внизу екрана. Виберіть <strong> Потужність </strong> праворуч і виберіть <strong> Вимкніть PS5 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Зачекайте, поки світло консолі не вимкнеться, потім від&#39;єднайте кабель живлення, кабель HDMI та все інше, що ви підключили до системи. Тепер ви готові змінити орієнтацію PS5. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Зніміть гвинт підставки </h2> <p> Коли ви встановлюєте ваш PS5 вертикально, вам потрібно було вийняти включений гвинт із відсіку в основі і використовувати його для закріплення основи на консолі, коли вона сидить вертикально. Як результат, видалення цього гвинта - це ваш перший крок у зміні орієнтації консолі. </p> <p> Акуратно переверніть ваш PS5 на бік, щоб ви могли отримати доступ до підставки внизу. За допомогою плоскої викрутки, монети або подібного зніміть одинарний срібний гвинт, що тримає основу до системи. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Як тільки гвинт буде ослаблений, основа звільниться. У підставі є невеликий відсік, де можна зберігати гвинт. Зафіксуйте його на місці, а потім засуньте в маленький отвір, щоб забезпечити безпеку. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> Також у цьому відсіку ви знайдете маленьку чорну пробку (якщо ви покладете її туди під час початкового налаштування). Зніміть цю пробку і за допомогою неї заткніть отвір у нижній частині PS5, де ви щойно вийняли гвинт. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Поверніть основу </h2> <p> Тепер вам потрібно буде повернути основу, щоб вона помістилася на консолі в горизонтальній орієнтації. Це також закриває невеликий відсік, де ви розмістили гвинт, додатково закріплюючи його. </p> <p> Вам слід повернути основу, дивлячись на неї зверху (навпроти місця, де ви щойно зберігали гвинт). Якщо ви розглядаєте підняту частину трибуни як «північну», вам потрібно буде повернути зовнішню частину трибуни на «північну західну», як показано нижче. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Це правильна орієнтація для використання підставки горизонтально. Він клацне і обережно зупиниться, коли ви опините його в потрібному місці. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Прикріпіть підставку в горизонтальному положенні </h2> <p> Тепер ви можете прикріпити підставку до PS5, сидячи горизонтально. Переконайтесь, що система сидить правильно - --- логотип PS повинен бути звернений вгору. </p> <p> На задній панелі системи, під двома портами USB і поруч із ними, ви побачите символи контролера PlayStation, відбиті на консолі. Насуньте зовнішні плечі основи (яку ви щойно обернули) на систему навколо місця, де цей візерунок закінчується з кожного боку. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Натисніть на затискачі, щоб закріпити їх, але пам’ятайте, що в такому положенні підставка не зафіксована повністю (як у гвинті, якщо вона розміщена вертикально). Будьте обережні, коли ви кладете систему вниз, і пам’ятайте, що підставка може зісковзнути, якщо ви натягнете її. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Тепер ви готові використовувати ваш PS5 у горизонтальній орієнтації. Вставте всі кабелі назад і запустіть, щоб повернутися до гри. Якщо у вас стандартний PS5, ви вставите диски догори в цій орієнтації. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> Як змінити свій PS5 з горизонтального на вертикальний </h2> <p> Хочете повернутися до вертикальної орієнтації для вашого PS5, або, можливо, ви спочатку налаштували ваш PS5 у горизонтальній формі і хочете перейти у вертикальну вертикаль зараз? У будь-якому випадку, легко пройти вищезгаданий процес у зворотному порядку. Переконайтеся, що спочатку вимкнули та відключили PS5, якщо він наразі увімкнений або в режимі відпочинку. </p> <p> </p> <p> Щоб змінити вертикальну орієнтацію, спершу підніміть PS5 і обережно витягніть підставку із системи, щоб зняти її. Далі слід повернути зовнішній плече основи. Дивлячись на нього зверху, рука повинна знаходитися на півночі, на одній лінії з піднятою частиною. Переконайтеся, що ви відчуваєте ніжний клацання, щоб ви знали, що він знаходиться у потрібному місці. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> Розташуйте ваш PS5 так, щоб ви могли отримати доступ до дна, а потім вийміть чорну пробку з отвору посередині - він розташований приблизно посередині вентиляційних отворів. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Помістіть цю чорну пробку всередину маленького отвору у відсіку на нижній стороні основи. Пробка повинна зафіксуватися прямо на своєму місці. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> Далі витягніть гвинт з того ж відділення в основі. Тепер вам потрібно буде прикріпити підставку у правильному положенні. Для цього поставте PS5 догори, щоб тильна сторона консолі була звернена догори, як показано нижче. </p> <p> Візьміть підставку та розмістіть її так, щоб отвір для гвинта вирівнювався з отвором для гвинта, з якого ви щойно зняли пробку. Розмістіть затискачі на плечі основи на задній панелі системи нижче роз&#39;єму живлення. Стійка повинна легко вибудовуватися. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Тепер закрутіть гвинт за допомогою викрутки або подібного. Після того, як ви закінчите, і підставка почуватиметься міцно закріпленою, ви готові використовувати ваш PS5 вертикально. Підключіть всі кабелі назад, щоб завершити роботу. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> Чи варто стояти PS5 вертикально чи горизонтально? </h2> <p> Sony підтримує використання вашого PS5 як вертикально, так і горизонтально, тому немає жодного правильного чи неправильного способу, якщо ваша система отримує достатньо повітряного потоку. Яку орієнтацію слід використовувати, залежить від ваших потреб. </p> <p> </p> <p> Якщо у вас багато місця, і ви не проти, щоб PS5 займав багато горизонтального простору, горизонтальний вигляд виглядає гладким. Для тих, хто має стандартну модель PS5, це також полегшує процес вставки дисків, оскільки етикетка завжди повинна бути звернена догори. Це трохи важче запам’ятати при вертикальній орієнтації, де мітка диска повинна бути звернена ліворуч. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> Однак у вашій розважальній системі у вас може не бути місця для горизонтального налаштування. У цих випадках найкращий вибір - вертикальний перехід. PS5 - це величезна консоль в будь-якому випадку, але, розмістивши її вертикально, вона прекрасно сидить поруч із підставкою для телевізора або подібною. Це налаштування, яке я використовую, як показано на малюнку нижче. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> Яку б орієнтацію ви не вибрали для свого PS5, обов’язково використовуйте підставку. Це утримує систему від землі, що покращує потік повітря. Стійка також кріпить PS5, ускладнюючи його перекидання та потенційне пошкодження. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> Налаштуйте свій PS5 і почніть грати </h2> <p> Тепер ви знаєте, як змінити ваш PS5 з вертикального на горизонтальний і назад за лічені хвилини. Після налаштування вашої системи запустіть її та насолоджуйтесь одними з найкращих назв PS5. </p> <p> Не забувайте, що майже вся бібліотека PS4 працює і на PS5, що дає вам набагато більше насолоди. </p> <p> <small> Кредит зображення: Алекс Ван Акен / <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}