{"title":"Як найкращі служби обміну миттєвими повідомленнями використовують наскрізне шифрування","content":"<p> Особисті дані важливі як ніколи. Уряди, компанії та кіберзлочинці прагнуть, щоб особисті дані людей відповідали їхнім інтересам. Різні платформи в Інтернеті спростили передачу особистих даних без нашого відома. </p> <p> З цієї причини важливо добре розуміти, як платформи, якими ви користуєтесь в Інтернеті, захищають вашу конфіденційність. Одним із ключових факторів, на який слід звертати увагу при розгляді заходів захисту програм обміну повідомленнями, є наскрізне шифрування. </p> <p> Визнаючи необхідність визначити пріоритет конфіденційності даних, більшість програм обміну повідомленнями зробили значні кроки для впровадження наскрізного шифрування. </p> <h2 id=\"what-is-end-to-end-encryption\"> Що таке наскрізне шифрування? </h2> <p> </p> <p> Наскрізне шифрування є <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> метод шифрування комунікацій </a> таким чином, щоб треті сторони не мали доступу до інформації, якою обмінюються люди, які обмінюються повідомленнями. </p> <p> При наскрізному шифруванні для приховування вмісту повідомлень використовується секретний код, а не звичайний текст. Це означає, що лише ті, хто спілкується на наскрізній зашифрованій платформі, можуть читати повідомлення, що передаються між собою. </p> <p> Давайте розглянемо, як три популярні служби безпечного обміну повідомленнями, Signal, WhatsApp та Telegram, використовують наскрізне шифрування. </p> <p> </p> <h2 id=\"signal\"> Сигнал </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signal вважається однією з найбільш безпечних програм обміну повідомленнями. Весь зв’язок на платформі за замовчуванням шифрується наскрізним способом. </p> <p> Signal не створює резервної копії повідомлень у хмарі, що зменшує ризики поганих акторів, використовуючи альтернативні методи отримання інформації. Він також шифрує метадані повідомлень, щоб місце та час обміну повідомленнями не відстежувалися. </p> <p> Завдяки механізму шифрування з відкритим кодом громадськість виграє завдяки вищому рівню прозорості технології, що лежить в основі їх обміну повідомленнями. Користувачі можуть уважніше розглянути технічні деталі, щоб краще зрозуміти методи, що використовуються для захисту їхньої приватності. </p> <p> Платформи з відкритим кодом можуть значно спростити та забезпечити безпеку використання в довгостроковій перспективі. Люди можуть не тільки краще зрозуміти, як працює програмне забезпечення, але вони також можуть спробувати створити власну версію програми, яка може бути більш підходящою для їхніх унікальних потреб безпеки. </p> <p> Signal використовує комбінацію OTR, яку називають багатостороннім незаписаним обміном повідомленнями, що дає можливість наскрізного шифрування повідомлень у групових чатах. Ризики порушення даних можуть зростати із збільшенням кількості учасників мережі. При наскрізному зашифрованому груповому чаті такі ризики значно зменшуються. </p> <p> </p> <h2 id=\"whatsapp\"> WhatsApp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp була однією з перших популярних програм обміну повідомленнями, яка дозволила наскрізне шифрування. Він використовує наскрізне шифрування повідомлень та дзвінків. </p> <p> WhatsApp використовує наскрізний протокол шифрування, розроблений Open Whisper Systems, командою Messenger messenger. Це є головним плюсом для програми, враховуючи, наскільки безпечним є протокол шифрування Signal. </p> <p> </p> <p> Використання власного власного розгортання WhatsApp означає, що його не може перевіряти так часто широке коло дослідників безпеки, як повністю відкрите програмне забезпечення Signal. </p> <p> Незважаючи на шифрування повідомлень, можна було б використати інші способи дізнатися більше про повідомлення, що надсилаються на WhatsApp, оскільки повідомлення можна резервно копіювати в хмарі, а метадані в додатку не шифруються. Це полегшує знання часу та місця надходження повідомлень. Крім того, з’явилися звіти про групові чати WhatsApp, проіндексовані в пошуку Google, що ставлять під сумнів безпеку своїх групових чатів. </p> <p> </p> <h2 id=\"telegram\"> Телеграма </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegram люблять за використання шифрування та саморуйнівних повідомлень. На жаль, у Telegram є кілька наскрізних проблем шифрування, які для багатьох користувачів можуть здатися не такими очевидними. </p> <p> У Telegram наскрізне шифрування не ввімкнено за замовчуванням. Пропонується лише тоді, коли користувачі переходять на секретні чати. Для користувачів, які не мають технічних схильностей, це створює ризики для безпеки, про які вони можуть навіть не знати. </p> <p> Telegram може отримувати доступ до повідомлень, що зберігаються на своїх серверах, і резервні копії яких зберігаються в хмарі. Деякі вважають, що це представляє додаткові вектори атаки, які можуть призвести до порушення особистих даних у випадках, коли кіберзлочинці намагаються викрасти дані обміну повідомленнями з програми. </p> <p> З огляду на це, усі секретні чати в Telegram специфічні для пристрою, а це означає, що повідомлення, які ви надсилаєте через секретні чати, можуть бути доступні лише з пристрою, з якого було надіслано. </p> <p> Хоча таємні чати Telegram шифруються наскрізним, групові - ні. Це означає, що користувачі можуть мати можливість використовувати кілька пристроїв для одного групового чату. Журнали чату користувачі можуть завантажувати на кілька пристроїв. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Секретні чати на <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> # Телеграма </a> означає, що ваші повідомлення захищені наскрізним шифруванням і видаляються через встановлений проміжок часу. <br><br> Ось як можна активувати цю функцію. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> - Касперський (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> 31 січня 2021 року </a></blockquote>  <p> Telegram створює попередній перегляд посилань на своїх віддалених серверах як із звичайних, так і з секретних чатів. Коли користувач вперше вводить посилання в секретному чаті, програма попереджає їх про те, що посилання будуть надіслані на віддалені сервери. Це вважається слабким місцем безпеки, оскільки надсилання посилань, що використовуються в приватному чаті, на віддалений сервер суперечить цілі наскрізного шифрування. </p> <p> Протокол шифрування Telegram, MTProto, призначений для доступу до серверного API із додатків на мобільних пристроях. Це власність і лише частково з відкритим кодом. Це ставить під сумнів, наскільки широкий контроль та розуміння має громадськість щодо методів шифрування, що використовуються для захисту своїх повідомлень. </p> <p> На щастя, програма обміну повідомленнями не зіткнулася з серйозними претензіями щодо порушення даних, але цікаво знати, що оператори можуть отримати доступ до ваших повідомлень. </p> <p> Незважаючи на занепокоєння, багатьох можуть заспокоїти різні юридичні обручі, які потрібно було б пропустити, щоб отримати доступ до повідомлень. У минулому Telegram чітко давав зрозуміти, наскільки людям важко отримати доступ до повідомлень на його платформі. Доступ до ключів повинен бути з різних юрисдикцій, що засмутить багатьох людей. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> Вибір найбільш безпечної програми обміну повідомленнями </h2> <p> Хоча Signal може бути не таким популярним, як WhatsApp, його протокол послужив важливим фактором, що сприяє успіху WhatsApp завдяки наскрізному шифруванню. Хоча його методи наскрізного шифрування подібні до WhatsApp, він вважається кращим, ніж WhatsApp, для наскрізного шифрування. Він вирізняється тим, що вживає додаткових заходів для захисту користувачів. </p> <p> Рішення Telegram не надавати пріоритет наскрізному шифруванню пояснюється перевагою зручності. Там, де йому бракує шифрування, він компенсує своїми непрямими методами захисту користувачів за допомогою хмарного шифрування та зберігання ключів у різних юридичних юрисдикціях. </p>"}