{"title":"Як цикл відео YouTube","content":"<p> Ви хочете прокрутити відео YouTube? Будь то ваша улюблена пісня чи кумедна збірка, вам не потрібно перезавантажувати сторінку, якщо ви хочете повторити відео YouTube. </p> <p> Ми покажемо вам, як прокрутити відео YouTube на настільному та мобільному пристроях. </p> <h2 id=\"how-to-loop-a-youtube-video-on-desktop\"> Як цикл відео YouTube на робочому столі </h2> <ol> <li> Перейдіть до відео, яке ви хочете прокрутити. </li> <li> <strong> Клацніть правою кнопкою миші </strong> відео (не навколо нього). Відкриється контекстне меню YouTube. </li> <li> Клацніть <strong> Петля </strong> . <p> <img alt=\"youtube video loop desktop\" src=\"images/youtube-video-loop-desktop-114.jpg\" loading=\"lazy\"> </p> </li> </ol> <p> Коли відео дійде до кінця, воно буде автоматично циклічне. Щоб підтвердити, що це ввімкнено, <strong> клацніть правою кнопкою миші </strong> відео, і ви побачите галочку біля <strong> Петля </strong> (яку ви можете натиснути ще раз, щоб вимкнути). </p> <p> </p> <p> </p> <h2 id=\"how-to-loop-a-youtube-video-on-mobile\"> Як цикл відео YouTube на мобільному </h2> <p> На жаль, цикл відео YouTube на мобільному додатку не настільки простий, як на настільному ПК. Натомість вам потрібно додати відео до списку відтворення. Ось як це зробити: </p> <ol> <li> Перейдіть до відео, яке ви хочете прокрутити. </li> <li> Під відео натисніть і утримуйте кнопку <strong> Зберегти </strong> кнопку. </li> <li> Торкніться <strong> Новий список відтворення </strong> . </li> <li> Введіть назву списку відтворення, виберіть a <strong> Конфіденційність </strong> і торкніться <strong> Створити </strong> . </li> <li> Торкніться <strong> Див. Список </strong> , щоб перейти до нового списку відтворення (або перейдіть на головний екран програми, торкніться <strong> Бібліотека </strong> у нижньому меню та введіть свій список відтворення). </li> <li> Торкніться значка <strong> Перемішати </strong> значок (дві переплетені стрілки). <p> <strong class=\"gallery__section-title\"> Галерея зображень (3 зображення) </strong> <img alt=\"youtube android save\" src=\"images/youtube-android-save-686.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"youtube android new playlist\" src=\"images/youtube-android-new-playlist-719.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"youtube android repeat playlist\" src=\"images/youtube-android-repeat-playlist-472.jpg\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> </li> <li> Відтворіть відео та торкніться стрілки в правому нижньому куті відео. Звідти торкніться значка <strong> Петля </strong> піктограми (дві стрілки, що утворюють прямокутник). </li> </ol> <p> Коли відео дійде до кінця, воно буде автоматично циклічне. Звичайно, ви також можете додати кілька відео до цього списку відтворення. </p> <p> </p> <h2 id=\"how-to-use-an-external-service-to-loop-a-youtube-video\"> Як використовувати зовнішню службу для циклу відео YouTube </h2> <p> Якщо ви не хочете використовувати вищевказані власні методи з будь-якої причини, ви також можете скористатися зовнішньою службою під назвою <a href=\"https://www.youtuberepeater.com\" target=\"_blank\" rel=\"nofollow noopener\"> Повторювач YouTube </a> . </p> <p> Щоб цим легко скористатися, перейдіть до відео YouTube, яке потрібно прокрутити. У рядку URL-адреси замініть <strong> youtube.com </strong> з <strong> youtuberepeater.com </strong> , а потім перейдіть за цією новою URL-адресою. </p> <p> Наприклад, якщо ви хотіли виконати цикл <strong> youtube.com/watch?v=n9xhJrPXop4 </strong> , ви б змінили його на <strong> youtuberepeater.com/watch?v=n9xhJrPXop4 </strong> . </p> <p> Це не спрацює на відео, де завантажувач не дозволив вбудовувати відео поза межами YouTube. Таким чином, ідеальним вибором є використання одного з двох вищезазначених методів. </p>"}