{"title":"Як покращити свої навички редагування Lightroom: 10 простих способів","content":"<p> Adobe Lightroom - одна з найвідоміших платформ для редагування фотографій на ринку. Це рішення популярне не тільки завдяки тому, що воно має стільки корисних функцій, але й завдяки своїй зручності для користування. </p> <p> Коли фотографи хочуть трохи серйозніше поставитись до своєї справи, перше, що вони зроблять, - це придбати програмне забезпечення для редагування. Але навіть якщо ви просто випадковий фотограф, Lightroom пропонує безліч способів вразити своїх друзів. </p> <p> У цьому посібнику ви знайдете кілька простих способів покращити свої фотографії у Lightroom. Ці поради працюють як для Lightroom Classic, так і для Lightroom Creative Cloud. </p> <h2 id=\"use-masking\"> 1. Використовуйте маскування </h2> <p> Якщо ви заточуєте фотографію за замовчуванням, ви додасте деталі до всього зображення - навіть до тих областей, які ви не хочете. Це може залишити вас багато зерна в небажаних місцях, таких як небо та вода. </p> <p> Ви також ризикуєте зробити свою фотографію більше схожою на малюнок, ніж на те, що ви зробили камерою. На щастя, є просте рішення. </p> <p> У програмі Lightroom прокрутіть униз до <strong> Деталь </strong> . Коли ви там, перейдіть до <strong> Заточка </strong> &gt; <strong> Маскування </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Прокручуйте повзунок, доки не будуть обрані частини зображення, які потрібно загострити. Щоб побачити, що ви маскуєте, натисніть клавішу <strong> Alt </strong> клавішу на клавіатурі одночасно. </p> <p> Після того, як ви замаскували потрібну область, прокрутіть повзунок загострення стільки, скільки вам потрібно. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Використовуйте профілі камери замість стандартних Adobe </h2> <p> Якщо ви завантажуєте зображення у форматі RAW, Adobe за умовчанням додасть один із своїх програмних профілів. І хоча в деяких випадках це може зробити ваш знімок кращим, вам часто краще вибрати саме камеру. </p> <p> Коли ви використовуєте профіль камери, зображення стане легшим для редагування залежно від того, що ви зробили з пристроєм. </p> <p> Щоб змінити профіль своєї фотографії, перейдіть до <strong> Профілі </strong> &gt; <strong> Відповідність камери </strong> . Потім ви можете вибрати <strong> Стандартний </strong> , <strong> Нейтральний </strong> , <strong> Пейзаж </strong> та інші погляди. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Запам’ятайте: </strong> ви не можете змінити профіль зображення на таку глибину, якщо ви берете лише JPEG. Отже, перед тим, як вийти на вулицю, щоб зробити кілька знімків, встановіть для камери будь-який з них <strong> СИЛИЙ </strong> або <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Проведіть пензлем частини зображення </h2> <p> Ви коли-небудь підвищували чіткість, насиченість або деталізацію всього свого малюнка, очікуючи шедевра, але замість цього отримуєте зображення, схоже на те, що воно було зроблено в мікрохвильовці? Якщо це так, то ви можете скористатися налаштуванням лише частин вашого зображення. </p> <p> У Lightroom ви можете отримати доступ до функції під назвою <strong> Щітка </strong> . Ви можете використовувати це, щоб &quot;намазати&quot; частину вашого зображення, залишаючи решту його в спокої. </p> <p> Щоб скористатися цим інструментом, перейдіть до <strong> Щітка </strong> значок у правій частині екрана. Ви можете зробити свій пензлик більшим або меншим, залежно від того, скільки малюнка ви хочете редагувати. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Перш ніж почати чистити щіткою, змініть характеристики зображення, які потрібно налаштувати. Наприклад, ви можете підняти повзунок чіткості вгору, якщо хочете зробити одну частину зображення чіткішою. </p> <p> Змінивши ці функції, проведіть пальцем по областях, які потрібно редагувати. Натисніть <strong> О </strong> на вашій клавіатурі, щоб побачити, де ви обмітали. </p> <p> Якщо ви перебрали занадто багато в певній області, натисніть і утримуйте <strong> Мінус </strong> ( <strong> - </strong> ) Клацніть і проведіть пальцем по цих частинах, щоб стерти ваші зміни. Знаючи <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> комбінації клавіш для Adobe Lightroom </a> стане в нагоді в цих ситуаціях, тому не забудьте розібратися з ними! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Захист фотографій </h2> <p> Іноді ваша камера робить фотографії, де краї мають неприродні кольори. Ви особливо це помітите, коли робите фотографії під суворим сонячним промінням. В основному вони бувають у відтінках зеленого та фіолетового. </p> <p> Щоб захистити свої фотографії, прокрутіть униз до <strong> Захист </strong> . Ви можете позбутися або фіолетової, або зеленої бахроми. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> Використовуйте <strong> Сума </strong> щоб вирішити, скільки захисту ви хочете додати. Пересувайте кольорову смужку, поки не будете задоволені результатами. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Використовуйте геометрію, щоб випрямити свої фотографії </h2> <p> Як би ви не старалися, тримати камеру прямо важко, якщо у вас немає штатива. Але завдяки магії програмного забезпечення для редагування виправити свої фотографії легко. </p> <p> У Lightroom ви можете автоматично виправити свої фотографії, перейшовши до <strong> Урожай, врожай </strong> розділ. Однак є більш точний спосіб досягти того самого результату. </p> <p> На правій вкладці виберіть верхній варіант. Потім прокрутіть вниз до <strong> Геометрія </strong> . Коли ви тут, перейдіть до <strong> Вертикально </strong> &gt; <strong> Рівень </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> Ви також можете малювати уздовж прямих ліній, щоб зробити фотографію максимально прямою. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Налаштуйте розмір області заточування </h2> <p> Тепер ви знаєте про маскування, але чи знали ви, що можете також заточити конкретні ділянки своєї фотографії? </p> <p> Щоб вибрати область на фотографії в масках, яку ви хочете збільшити, перейдіть до <strong> Заточка </strong> , утримуйте <strong> Alt </strong> клавішу і вирушайте до <strong> Радіус </strong> . Регулювання цього повзунка дозволяє збільшити або зменшити область заточування. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> Після цього підніміться на <strong> Заточка </strong> бар. Аналогічно утримуйте <strong> Alt </strong> клавішу та посуньте повзунок праворуч. Це полегшить вам різкість різної області фотографії, а не всього зображення. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Використовуйте криві Color Point </h2> <p> Якщо колір вашого зображення виглядає неправильно навіть після налаштування балансу білого, ви можете перевірити криві кольорових точок у Lightroom. Ви можете використовувати їх для налаштування певних кольорів на зображенні. </p> <p> У додатку ви знайдете три панелі кольорових кривих: червону, синю та зелену. </p> <p> Щоб дістатися до цих кольорових кривих, прокрутіть униз до <strong> Точкова крива </strong> . Потім натисніть на колір, який потрібно змінити. Потім ви можете пограти з кольорами так само, як і на стандартних <strong> Точкова крива </strong> вкладку. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Введіть число для кожного повзунка та відповідно налаштуйте </h2> <p> Часто нових фотографів хвилює кількість доступних для них варіантів редагування. Коли вони відкриють Lightroom, вони ковзають кожну планку занадто далеко в будь-який бік. Але замість того, щоб покращувати свій імідж, вони закінчуються завищеною безладдю. </p> <p> Під час редагування фотографій ключовим є внесення невеликих змін. Швидше за все, ви вже хороший фотограф, і зроблений вами знімок просто потребує невеликого доопрацювання. </p> <p> </p> <p> Замість вільного переміщення кожного повзунка спробуйте змінити номер на ділянках, на які ви хочете змінити <strong> +10 </strong> або <strong> -10 </strong> . Якщо ви вважаєте, що потрібно більше роботи, повторіть процес. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Коли вам здається, що ви поруч, повільно рухайте кожен повзунок вліво або вправо, доки не зрадієте. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Обріжте свої фотографії </h2> <p> Обрізання може здатися очевидним, але багато фотографів все ще недостатньо використовують цю функцію. Також важливо обрізати зображення залежно від того, де ви збираєтеся їх використовувати. В іншому випадку вони будуть спотворені. </p> <p> Щоб обрізати фотографії, перейдіть до <strong> Урожай, врожай </strong> значок. Це друге місце за верхом. Йти до <strong> Співвідношення сторін </strong> щоб змінити розмір, і перетягніть кути, щоб позбутися від небажаних предметів. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> Закінчивши обрізання, натисніть <strong> Введіть </strong> на комп&#39;ютері, і зміни вступлять в силу. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Використовуйте гістограму </h2> <p> Гістограму Lightroom легко ігнорувати, але важливо знати. Цей невеликий графік покаже вам, де кольори та освітлення нерівні на вашому зображенні, що дозволяє вам зробити більш чітке редагування. </p> <p> Як правило, добре відредагована фотографія матиме кілька шипів на гістограмі. Іноді цього не уникнути. Але загалом, ви повинні прагнути зробити графік якомога рівномірнішим. </p> <p> Залежно від використовуваної версії Lightroom, ви можете більш-менш безпосередньо маніпулювати гістограмою. У Lightroom Classic ви можете натиснути на гістограму та вирівняти речі, просунувши певні розділи. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> У Creative Cloud гістограма так само видно у верхньому правому куті, але для переміщення гістограми потрібно змінити повзунки самостійно. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> В обох версіях платформи гістограма доступна у верхній частині екрана над функціями редагування. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> Чудове редагування - це не лише для професіоналів </h2> <p> Lightroom - відмінне програмне забезпечення для редагування для тих, хто хоче перенести свої фотографії на новий рівень. І навіть якщо ви ніколи раніше не користувались платформою, вам не потрібно хвилюватися, оскільки це легко навчитися. </p> <p> Редагуючи фотографії в Lightroom, пам’ятайте, що менше - це часто більше. Разом з розглядом цих порад непогано відступити назад після редагування та повернутися пізніше, щоб перевірити, чи вони настільки добре відредаговані, як ви думали. </p>"}