{"title":"Як переглянути статистику часу відтворення на PS5","content":"<p> Якщо вам подобається бачити, скільки часу ви витратили на ігри, PS5 має для вас приховану, але корисну функцію. Він відстежує, скільки часу ви витратили на ігри в системі. </p> <p> Ось як перевірити, скільки часу ви витратили на ігри PlayStation 5. Що може вас спонукати <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> вимкніть ваш PS5 </a> частіше. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> Як перевірити статистику часу відтворення на PlayStation 5 </h2> <p> На головному екрані PS5 виберіть значок профілю вгорі праворуч. Можна натиснути <strong> Трикутник </strong> щоб швидко перемістити виділення в ту область екрана. Відкривши це меню, виберіть <strong> Профіль </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Тепер перейдіть до <strong> Ігри </strong> вкладку. Тут ви побачите всі ігри, які ви грали у своєму обліковому записі PlayStation. Кожен показує останній раз, коли ви грали у гру, а також загальний час гри. Однак це не точно до хвилини. Ви побачите час гри, округлений до години. </p> <p> Тут ви також побачите час відтворення ваших назв PS4, навіть якщо ви ще не грали їх на PS5. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> Наскільки нам відомо, цей час гри включає весь час, протягом якого гра тривала, а не лише тоді, коли ви активно грали. Це означає, що якщо ви залишили гру в меню паузи під час телефонного дзвінка чи чогось їсти, цей час буде включено до загальної суми. Тож це може бути не надто точно, але принаймні дасть вам уявлення про те, як довго ви грали кожен заголовок. </p> <p> </p> <p> Якщо вам цікаво, ви також можете переглянути статистику часу відтворення для своїх друзів. Виберіть <strong> Друзі </strong> на одному екрані та виберіть друга, про якого хочете дізнатись більше. Це покаже вам, скільки часу вони провели у своїх іграх в однаковому меню. </p> <p> Якщо ви не хочете, щоб інформація про час відтворення була видимою для інших гравців, прокрутіть праворуч і виберіть <strong> Налаштування конфіденційності </strong> . У цьому меню під <strong> Ваша активність </strong> розділ, змініть параметр для <strong> Хто може бачити вашу історію ігор </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Деякі ігри також відстежують власний час гри </h2> <p> Якщо вас цікавлять такі дані, не забудьте відкрити свої улюблені ігри та перевірити, чи відстежують вони, скільки часу ви витратили на гру. Значна кількість заголовків включає загальний час відтворення файлу збереження, всередині меню паузи тощо. </p> <p> Хоча це не узгоджується в іграх і може включати чи не включати час, проведений під час паузи, це може дати вам більше розуміння гри, про яку ви хочете дізнатися більше. Деякі онлайн-ігри, такі як Overwatch, навіть відстежують час, проведений з кожним героєм у різних режимах. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Подивіться, скільки ви насправді гри </h2> <p> PS5 дозволяє легко зрозуміти, скільки часу ви витратили на ігри. Це невелика, але дуже вдячна функція, оскільки PS4 не зробив ці дані легкодоступними. </p> <p> Тим часом існує більше способів керувати своєю грою за межами самої консолі. </p> <p> <small> Кредит зображення: LightField Studios / <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}