{"title":"Як виправити &quot;ВИКЛИК РОБОТИ СИСТЕМИ, НЕ ОБРУЧЕНИЙ&quot; Код зупинки BSOD у Windows 10","content":"<p> «ВИКЛИЧЕННЯ СИСТЕМНОЇ РІЗБИ, НЕ ОБРУЧЕНО» - це поширена помилка Windows 10, яка виникає головним чином через застарілий або несумісний драйвер. </p> <p> Вирішити проблему складніше, ніж інші BSOD, - це те, що причиною проблеми може бути кілька драйверів, і іноді ваш комп’ютер може не виявити їх усіх. Ось чому першим кроком, який повинні зробити користувачі при вирішенні цієї помилки, є пошук точного драйвера, який спричиняє проблему. </p> <p> Ось як виправляється помилка винятків системного потоку, не оброблена в Windows 10. </p> <h2 id=\"boot-into-safe-mode\"> 1. Завантажте в безпечний режим </h2> <p> Першим кроком, який повинні зробити користувачі перед спробою вирішити цю проблему, є завантаження комп’ютера в безпечний режим. Залежно від ваших уподобань та того, чи зможете ви завантажити комп’ютер на екран входу, це можна зробити кількома способами: </p> <h3 id=\"boot-into-safe-mode-via-settings\"> Завантажте в безпечний режим через Налаштування </h3> <ol> <li> Клацніть на <strong> Почніть </strong> , а потім виберіть <strong> Налаштування </strong> . </li> <li> Перейдіть до <strong> Оновлення та безпека </strong> потім натисніть на <strong> Одужання </strong> . </li> <li> Під <strong> Розширений запуск, </strong> натисніть на <strong> Перезапустіть зараз. </strong> </li> <li> Коли ваш ПК перезавантажує <strong> Виберіть варіант </strong> повинен з&#39;явитися екран. </li> <li> Звідси перейдіть до <strong> Виправлення неполадок&gt; Додаткові параметри&gt; Налаштування запуску </strong> . Потім натисніть на <strong> Перезапустіть </strong> </li> <li> Коли ПК перезавантажиться, натисніть <strong> F5 </strong> для завантаження комп&#39;ютера в <strong> Безпечний режим з мережею </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> З екрана входу </h3> <ol> <li> Просто затримайте <strong> Shift </strong> і виберіть <strong> Потужність </strong> кнопку, а потім - <strong> Перезапустіть </strong> . </li> <li> Виконайте кроки 4, 5 та 6 з розділу вище. </li> </ol> <h3 id=\"from-a-blank-screen\"> З порожнього екрану </h3> <ol> <li> Якщо вам не вдається отримати доступ до екрана входу, виконайте такі дії. </li> <li> Утримуйте кнопку живлення на своєму пристрої протягом 10 секунд, щоб вимкнути його. </li> <li> Натисніть кнопку живлення ще раз, щоб завантажити її. </li> <li> Як тільки ваш ПК запуститься, тобто з’явиться логотип виробника, натисніть кнопку живлення ще раз на 10 секунд. </li> <li> Натисніть кнопку живлення, щоб запустити пристрій. </li> <li> Якщо все зроблено правильно, комп&#39;ютер завантажиться в <strong> Середовище відновлення Windows </strong> . </li> <li> Виконайте кроки 4, 5 та 6 з першого розділу. </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. Пошук відповідального водія </h2> <p> Оскільки помилка, швидше за все, спричинена несправним драйвером, ви можете використовувати журнал Windows, щоб дізнатися, який саме. </p> <p> Для цього просто виконайте такі дії: </p> <ol> <li> Натисніть <strong> Клавіша Windows + R </strong> і в <strong> Біжи </strong> діалогове вікно, введіть <strong> eventvwr. </strong> </li> <li> Перейдіть до <strong> Журнали Windows </strong> меню та розгорніть його, а потім виберіть <strong> Система. </strong> </li> <li> Шукайте журнал з іменем <strong> system_thread_exception_not_handled </strong> і натисніть на нього, щоб з’ясувати, який драйвер спричиняє проблему. </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> Зазвичай пов&#39;язаний драйвер буде драйвером дисплея або мережевим драйвером, оскільки вони відомі причиною цього BSOD. Якщо пов&#39;язаний файл виявляється <strong> nvlddmkm.sys </strong> , Ви можете поглянути на <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> кілька простих способів це виправити. </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. Відкат або оновлення драйверів </h2> <p> Залежно від того, який драйвер відповідає за помилку, з якою не обробляється виняток системного потоку, вам може знадобитися оновити або перевстановити відповідні драйвери. </p> <p> Якщо драйвер тривалий час не оновлювався, то оновлення драйвера, швидше за все, вирішить проблему. Якщо драйвер був оновлений нещодавно, можливо, найкраще відкотити драйвер або перевстановити оновлення. </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> Як оновити драйвери в Windows 10 </h3> <ol> <li> Натисніть <strong> Клавіша Windows + R </strong> і введіть <strong> devmgmt.msc </strong> щоб відкрити <strong> Диспетчер пристроїв </strong> . </li> <li> Перейдіть до відповідного пристрою та розгорніть меню. Наприклад, якщо помилку спричинив драйвер дисплея, вам доведеться розширити <strong> Відеоадаптери </strong> варіант. </li> <li> Клацніть правою кнопкою миші на драйвері та натисніть <strong> Драйвер оновлення </strong> . </li> <li> У діалоговому вікні, що відкриється, натисніть <strong> Шукати автоматично оновлене програмне забезпечення драйверів </strong> . </li> <li> Потім Windows автоматично здійснить пошук в Інтернеті останніх драйверів та встановить їх. </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> Як здійснити відкат драйверів у Windows 10 </h3> <ol> <li> відчинено <strong> Диспетчер пристроїв </strong> та перейдіть до відповідного водія. </li> <li> Розгорніть меню та клацніть правою кнопкою миші на драйвері. </li> <li> Натисніть на <strong> Властивості </strong> . </li> <li> Під <strong> Водій </strong> , натисніть на <strong> Відкат драйвера </strong> . </li> <li> Windows автоматично повернеться до останньої доступної версії драйвера. </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. Перейменуйте дефектний файл </h2> <p> Отримавши ім’я файлу, пов’язане з помилкою, з якою не обробляється виняток системного потоку, користувачі повинні перейменувати файл. Це призведе до того, що Windows створить нову копію та переінсталює її. Файли драйверів знаходяться за адресою <strong> C: \\ Windows \\ System32 \\ драйвери </strong> </p> <p> Для перейменування файлу виконайте такі дії: </p> <ol> <li> відчинено <strong> Провідник файлів </strong> і перейти до <strong> C: \\ Windows \\ System32 \\ драйвери </strong> </li> <li> Шукайте постраждалого водія </li> <li> Клацніть на нього і натисніть <strong> F2. </strong> </li> <li> Замініть розширення імені файлу на <strong> .стар </strong> . </li> <li> Натисніть Enter і перезавантажте комп&#39;ютер. </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. Використовуйте SFC та DISM для відновлення системних файлів </h2> <p> SFC та DISM - це два потужні інструменти, доступні кожному користувачеві Windows. У поєднанні вони можуть знаходити та виправляти майже будь-які системні помилки. Вони також досить прості у виконанні. </p> <p> </p> <p> Будь ласка, не забудьте створити точку відновлення системи, оскільки ці команди змінюють системні файли. </p> <h3 id=\"how-to-use-dism\"> Як використовувати DISM </h3> <ol> <li> Біжи <strong> Командний рядок </strong> як адміністратор </li> <li> На консолі введіть <strong> DISM / Online / Cleanup-Image / ScanHealth </strong> і натисніть Enter. </li> <li> Зачекайте, поки Windows закінчить сканування. Потім наберіть <strong> DISM / Online / Cleanup-image / RestoreHealth </strong> </li> <li> Windows відновить усі проблеми, виявлені під час сканування. </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> Як користуватися SFC </h3> <ol> <li> У рядку пошуку меню «Пуск» введіть <strong> cmd </strong> потім клацніть правою кнопкою миші <strong> Командний рядок </strong> і запустіть його як адміністратор. </li> <li> На консолі введіть <strong> sfc / scannow </strong> </li> <li> Наберіться терпіння, оскільки Windows знадобиться час на сканування та заміну пошкоджених системних файлів. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. Використовуйте функцію відновлення системи для відновлення ПК </h2> <p> Якщо проблема все ще залишається невирішеною, то вам доведеться скористатися функцією відновлення системи в крайньому випадку. Відновлення системи - це функція, яка відновлює Windows до попереднього стану. Ці точки відновлення створюються періодично та під час встановлення нового програмного забезпечення. Крім того, ви можете встановити <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows для створення точки відновлення щодня </a> </p> <h3 id=\"how-to-use-system-restore\"> Як використовувати відновлення системи </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> У рядку пошуку меню «Пуск» введіть <strong> Панель управління </strong> і натисніть відкрити. </li> <li> На панелі пошуку панелі керування введіть <strong> Одужання </strong> і відкрийте його з результатів. </li> <li> Натисніть на <strong> Відкрийте відновлення системи </strong> . </li> <li> Натисніть на <strong> Далі </strong> і виберіть зі списку точку відновлення. </li> <li> Натисніть на <strong> Готово. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> Оброблено виняток </h2> <p> Поради, перераховані вище, забезпечують легке вирішення неприємностей, пов’язаних із BSOD, як-от system_thread_exception_not_handled. Найкраще те, що більшість порад можна використовувати для діагностики багатьох інших поширених помилок синього екрану смерті (BSOD) також у Windows. </p>"}