{"title":"Як побачити, хто стежить за вами у Facebook","content":"<p> Якщо ви дбаєте про те, щоб отримати більше підписників на Facebook настільки, наскільки вам подобається рости друзями на Facebook, тоді ви можете побачити, хто слідкує за вами на Facebook. Ви можете легко зробити це як на настільному ПК, так і на мобільному. </p> <p> Ось як дізнатись, скільки підписників у вас у Facebook. </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-desktop\"> Як побачити, хто стежить за вами у Facebook (на робочому столі) </h2> <p> На робочому столі ви можете бачити, хто підписується на вас у Facebook, але не кількість підписників. Однак мобільний додаток Facebook дозволяє побачити, хто стежить за вами та кількість ваших підписників. </p> <p> <img alt=\"Facebook profile interface with friends\" src=\"images/click-more-and-select-followers-786.jpg\" loading=\"lazy\"> </p> <p> Спочатку увійдіть у свій <a href=\"https://web.facebook.com\" target=\"_blank\" rel=\"nofollow noopener\"> Обліковий запис у Facebook </a> через браузер і скористайтеся наступними інструкціями, щоб побачити своїх підписників на Facebook: </p> <ol> <li> Після входу натисніть кнопку <strong> невеликий малюнок значок </strong> біля вашого імені на бічній панелі. </li> <li> У меню Профіль натисніть <strong> Друзі </strong> . </li> <li> У меню Друзі натисніть <strong> Більше </strong> спадне меню праворуч. </li> <li> У спадному списку виберіть <strong> Послідовники </strong> , щоб переглянути всіх своїх послідовників у Facebook. </li> </ol> <p> </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-mobile\"> Як побачити, хто стежить за вами у Facebook (для мобільних пристроїв) </h2> <p> Як ми вже заявляли раніше, мобільний додаток Facebook дозволяє отримати доступ до списку та кількості людей, які підписуються на вас у Facebook. </p> <p> <strong class=\"gallery__section-title\"> Галерея зображень (3 зображення) </strong> <img alt=\"Facebook profile about info menu\" src=\"images/tap-see-your-about-info-732.png\" loading=\"lazy\"> Розгорнути <img alt=\"Mobile Facebook interface displaying Facebook followers\" src=\"images/tap-see-all-to-load-a-list-of-your-followers-895.png\" loading=\"lazy\"> Розгорнути <img alt=\"Mobile Facebook page displaying a list of followers and their numbers\" src=\"images/look-to-the-upper-right-corner-to-see-the-number-of-followers-677.png\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <p> Увійдіть у свій обліковий запис Facebook через мобільний додаток. Тоді дотримуйтесь цих вказівок: </p> <ol> <li> На домашній сторінці мобільного додатка торкніться круглого значка зображення поруч із <strong> Що у вас на думці? </strong> рядок пошуку для завантаження вашого профілю. </li> <li> У меню профілю натисніть <strong> Перегляньте інформацію про вашу інформацію </strong> . </li> <li> Прокрутіть до кінця сторінки. Потім під <strong> Послідовники </strong> , торкніться <strong> Бачити все </strong> щоб завантажити список усіх своїх підписників на Facebook. </li> <li> Подивіться на правий верхній кут сторінки (навпроти <strong> Послідовники </strong> ), щоб побачити кількість людей, які стежать за вами у Facebook. </li> </ol> <p> Ви не отримаєте можливість перевірити своїх підписників на Facebook, якщо у вас їх немає. Як результат, виконання наведених вище кроків не дозволить вам перевірити своїх підписників, оскільки таких немає. </p> <p> Ви також можете не отримати цю опцію, якщо ваш обліковий запис Facebook новий, оскільки у вас, ймовірно, ще немає підписників. Або вам може знадобитися <a href=\"https://www.makeuseof.com/tag/quickly-switch-facebook-profiles/\" target=\"_blank\" rel=\"nofollow noopener\"> перейти на інший обліковий запис Facebook </a> . Або ж ваш обліковий запис може бути не налаштований так, щоб дозволити людям стежити за вами у Facebook - нижче ми пояснимо, як це змінити. </p> <p> </p> <p> </p> <h2 id=\"how-to-give-the-public-access-to-follow-you-on-facebook\"> Як надати загальнодоступний доступ до вас у Facebook </h2> <p> Іноді, якщо ви заборонили публіці стежити за вами, це обмежує шанси отримати більше підписників на Facebook. </p> <p> Це тому, що люди, яких немає у вашому списку друзів, не можуть стежити за вами у Facebook, якщо ви їм цього не дозволяєте. Тим не менш, ви можете встановити параметри підписки як &quot;Загальнодоступні&quot;, щоб будь-хто міг стежити за вами, а не лише ваші друзі. </p> <p> <strong> Для цього на робочому столі: </strong> </p> <p> <img alt=\"Facebook privacy settings page\" src=\"images/click-on-public-post-and-change-who-can-follow-you-to-public-880.jpg\" loading=\"lazy\"> </p> <ol> <li> Перейдіть у свій профіль. </li> <li> Клацніть на <strong> круглий випадаючий значок </strong> у верхньому правому куті рядка меню. </li> <li> Зі списку виберіть <strong> Налаштування та конфіденційність </strong> . </li> <li> Клацніть <strong> Налаштування </strong> . </li> <li> На бічній панелі меню Налаштування натисніть <strong> Публічні повідомлення </strong> . </li> <li> Подивіться праворуч від <strong> Хто може піти за мною </strong> і натисніть на <strong> Друзі </strong> спадне меню. </li> <li> Виберіть <strong> Громадський </strong> надавати доступ для перегляду будь-кому, включаючи тих, хто не є вашими друзями на Facebook. </li> </ol> <p> <strong> Для цього в мобільному додатку Facebook: </strong> </p> <p> <strong class=\"gallery__section-title\"> Галерея зображень (3 зображення) </strong> <img alt=\"Facebook menu list\" src=\"images/tap-the-three-menu-bars-and-go-to-settings-170.png\" loading=\"lazy\"> Розгорнути <img alt=\"Facebook settings list\" src=\"images/scroll-down-and-select-public-posts-754.png\" loading=\"lazy\"> Розгорнути <img alt=\"Facebook followers settings page\" src=\"images/tick-the-public-option-under-who-can-follow-728.png\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <ol> <li> Відкрийте мобільний додаток Facebook і торкніться значка <strong> три горизонтальні рядки меню </strong> праворуч від домашньої сторінки. </li> <li> Прокрутіть вниз і виберіть <strong> Налаштування </strong> . </li> <li> Торкніться <strong> Публічні повідомлення </strong> . </li> <li> Під <strong> Хто може піти за мною </strong> , галочку <strong> Громадський </strong> . </li> </ol> <p> </p> <h2 id=\"keep-control-over-your-facebook-followers\"> Зберігайте контроль над своїми послідовниками у Facebook </h2> <p> Якщо ви використовуєте Facebook для просування свого бренду або бізнесу, необхідно стежити за своїми послідовниками. Це хороший спосіб модерувати те, що люди можуть побачити про вас. </p> <p> Якщо ви хочете отримати більше контролю над своїми друзями та послідовниками на Facebook, вам слід подумати про те, щоб приховати їх із вашої стрічки. </p>"}