{"title":"Як скинути свої рекомендації Apple Music","content":"<p> Apple Music раніше мав легко доступний спосіб переробити ваші музичні рекомендації, вибравши улюблених виконавців та музичні жанри. На жаль, під час оновлення програми Apple видалила цей спосіб оновлення кулінарної роботи з музикою. </p> <p> Не бійтеся, ось посібник із альтернативних способів зупинки або скидання ваших автопропозицій Apple Music. </p> <h2 id=\"apple-music-recommendations-explained\"> Пояснення рекомендацій Apple Music </h2> <p> Коли ви вперше запускаєте свій обліковий запис Apple Music вперше, він просить вас вибрати улюблене з широкого списку музичних жанрів та виконавців. Ця курація - це те, як Apple Music запропонує плейлисти, альбоми, виконавців та пісні, що рухаються вперед. </p> <p> Наприклад, якби ви вибрали Classic Rock, New Rock та Foo Fighters як один із своїх улюблених варіантів музики, Apple Music, швидше за все, запропонує дуже схожі станції прослуховування та сприятиме нещодавно виданій рок-музиці. </p> <p> Зміни в додатку означають, що тепер ви можете підбирати свої музичні уподобання лише під час початкового створення облікового запису, ви не можете скинути їх пізніше - хоча Apple Music і надалі буде змінювати свої пропозиції на основі ваших звичок прослуховування. </p> <p> Це лише одне з кількох корисних <a href=\"https://www.makeuseof.com/tag/apple-music-features-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> Функції Apple Music для використання </a> . </p> <p> Не хвилюйтеся, є ще кілька способів скинути курацію Apple Music, вимкнувши налаштування Apple ID або видаливши та відтворивши обліковий запис Apple Music. </p> <p> Обидва варіанти мають як переваги, так і мінуси, тож давайте з’ясуємо, який для вас найкращий варіант. </p> <p> </p> <h2 id=\"turn-off-personalized-recommendations\"> Вимкніть персоналізовані рекомендації </h2> <p> Вимкнення персоналізованих рекомендацій для вашого ідентифікатора Apple - хороший спосіб перестати бачити будь-які нові пропозиції вперед. </p> <p> Вимкнення цієї опції не призведе до видалення наявних даних про курацію, тобто програма продовжуватиме створювати пропозиції на основі вашого використання. Ви просто більше їх не побачите. Вимкнення персоналізованих рекомендацій також вплине на ваші рекомендації в інших сервісних програмах Apple, таких як Apple Books. </p> <p> Ось як вимкнути персоналізовані рекомендації на iPhone: </p> <ol> <li> Відкрийте <strong> Apple Music </strong> додаток. </li> <li> Перейдіть до <b> Слухай зараз </b> вкладку. </li> <li> Відкрийте свій профіль Apple Music, вибравши круговий значок із силуетом людини у верхньому правому куті екрана. Якщо ви раніше завантажили зображення як особисте зображення профілю, воно відображатиметься замість силуету. </li> <li> Виберіть <b> Переглянути Apple ID </b> який можна знайти, прокрутивши до нижньої частини <b> Рахунок </b> сторінки. </li> <li> Вимкнути <b> Персоналізовані рекомендації </b> . </li> <li> Виберіть <b> Готово </b> у верхньому правому куті, і ви закінчили. </li> </ol> <p> <strong class=\"gallery__section-title\"> Галерея зображень (3 зображення) </strong> <img alt=\"Apple Music Lisen Now featuring Halle x Chloe\" src=\"images/apple-music-listen-now-page-713.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"Apple Music Account Options Screenshot\" src=\"images/apple-music-account-page-914.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"Apple ID Options Screenshot\" src=\"images/apple-id-account-page-817.jpg\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <p> Після цього будь-який новий пошук, завантаження чи проходження музики в Apple Music більше не впливатиме на ваші автоматичні пропозиції. Це не призведе до автоматичного видалення попередніх пошукових запитів, а значить, може знадобитися трохи часу, щоб помітити ефекти цього методу. </p> <p> </p> <h2 id=\"delete-your-apple-music-profile\"> Видаліть свій профіль Apple Music </h2> <p> Якщо вам потрібен повний макіяж Apple Music зі свіжими музичними пропозиціями, найкращим варіантом буде видалення та відтворення вашого профілю Apple Music. </p> <p> Важливо зазначити, що видалення вашого профілю повністю видалить вашу поточну музичну бібліотеку. Створення нового профілю дозволить вам вибрати абсолютно нову музику та жанрові уподобання, але також повністю видалить будь-яку попередню історію Apple Music. </p> <p> </p> <p> Якщо вас цікавить абсолютно новий профіль Apple Music із нещодавно вибраними вибраними, виконайте такі дії, щоб створити такий: </p> <ol> <li> Від <strong> Слухай зараз </strong> , перейдіть до Apple Music <strong> Рахунок </strong> та виберіть <b> Перегляд профілю </b> . </li> <li> Виберіть <b> Редагувати </b> в центрі екрана під вашим іменем. </li> <li> Прокрутіть унизу екрана та виберіть <b> Видалити профіль </b> . Зауважте, це остаточне видалення, яке потребує скидання облікового запису. </li> <li> Налаштуйте для себе новий профіль Apple Music, який тепер вільний від ваших старих виборів. Якщо ви вимкнули персоналізовані рекомендації, як описано у наведеному вище розділі, ви більше не будете отримувати спеціальних пропозицій щодо музики. Залишаючи <strong> Персоналізовані рекомендації </strong> on призведе до того, що Apple Music запропонує музику на основі ваших нових звичок прослуховування. </li> <li> Вільно переглядайте та насолоджуйтесь широким спектром нещодавно вибраних звукових опцій. </li> </ol> <p> <strong class=\"gallery__section-title\"> Галерея зображень (2 зображення) </strong> <img alt=\"Apple Music Profile feat Halle x Chloe\" src=\"images/apple-music-profile-page-771.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"Apple Music Profile Options Screenshot\" src=\"images/apple-music-edit-profile-page-450.jpg\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <p> </p> <h2 id=\"spotify-s-recommendations-might-be-better\"> Рекомендації Spotify можуть бути кращими </h2> <p> Якщо ви все ще не задоволені рекомендаціями Apple Music навіть після створення нового профілю, можливо, настав час замінити платформи для потокового передавання музики. Apple Music та Spotify мають багато дуже подібних функцій, але багато людей вважають, що Spotify набагато перевершує пропонування нової музики. </p> <p> Звичайно, при виборі між Apple Music та Spotify також слід враховувати безліч інших факторів. </p>"}