{"title":"Як отримати доступ до своєї статистики геймплея PS4 та PS5 на 2020 рік","content":"<p> Sony випустила підсумкову програму PlayStation, яка дозволяє розмірковувати про вашу подорож PlayStation за останній рік. </p> <p> Ми розповімо вам, як отримати доступ до цього досвіду, та поінформуємо вас про кілька вимог. </p> <h2 id=\"what-is-playstation-wrap-up\"> Що таке підсумок PlayStation? </h2> <p> Як ми повідомляли, <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> Підсумок PlayStation - це підсумок вашого останнього року ігор </a> . </p> <p> Це персоналізована сторінка, на якій детально описуються ваші ігрові звички для PS4 та PS5, зокрема, скільки ігор ви зіграли, скільки часу витратили на них та скільки трофеїв ви заробили в дорозі. </p> <p> Ви також можете отримати безкоштовну динамічну тему з фігурами PlayStation. Заплутано, це доступно лише для PS4, а не нещодавно випущеної PS5. </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> Як отримати доступ до підсумкового запису PlayStation </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> Щоб переглянути звіт, перейдіть до <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> Веб-сайт із підсумками PlayStation </a> . Вам потрібно буде увійти до свого облікового запису Sony, якщо ви цього ще не зробили. Опинившись на сторінці, ви можете прокрутити вниз, щоб переглянути статистику та використати тему PS4. </p> <p> Підведення підсумків буде доступне лише до 2 березня 2021 р. Як такий, не зволікай, якщо хочеш взяти участь. </p> <p> Існують умови, яким ви повинні відповідати, щоб використовувати підсумок PlayStation: </p> <ul> <li> Майте зареєстрований рахунок PSN у вашому регіоні. </li> <li> Бути віком від 18 років. </li> <li> Грали в ігри щонайменше 10 годин на консолі PS4 з 1 січня 2020 року по 31 грудня 2020 року. </li> </ul> <p> Крім того, користувачі в Європі, на Близькому Сході, в Африці, Австралії, Індії та Росії повинні включити колекцію <strong> Додаткові дані </strong> . Ви можете включити це на PS4 через <strong> Налаштування </strong> &gt; <strong> Дані пристрою / Здоров’я та безпека </strong> &gt; <strong> Дані пристрою </strong> . </p> <p> Нарешті, ви можете отримати електронний лист, що містить ваш підсумок PlayStation. Однак ви, мабуть, вибрали отримання маркетингових електронних листів, які ви можете робити через <strong> Налаштування сповіщень </strong> у вашому обліковому записі PSN. </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> Чи буде підведення підсумків до 2021 року? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> Це вже другий рік поспіль, коли Sony використовує досвід підведення підсумків. Оскільки це лише аналіз даних за 2020 рік, він більше фокусується на PS4. </p> <p> Сподіваємось, Sony зробить це знову наступного року, коли PS5 вийде довше і випустить більше ігор. </p>"}