{"title":"Як створити або редагувати візерунок в Adobe Illustrator","content":"<p> Створіть візерунок в Adobe Illustrator, і ви зможете швидко застосувати його до фігур, штрихів і навіть тексту. Ви можете зробити щось просте, наприклад візерунок з крапок, або зробити щось більш складне. Ви навіть можете використовувати частину існуючої векторної графіки, а також перетворити це на візерунок. </p> <p> Візерунки чудово підходять для фонів, фактур тощо. Ось як користуватися інструментами шаблонів Illustrator, а також створювати та редагувати власні шаблони. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Використання шаблонів за замовчуванням в Adobe Illustrator </h2> <p> Illustrator поставляється з декількома шаблонами, вбудованими прямо в нього. Окрім того, що вони корисні самі по собі, вони також є хорошим способом побачити, як працюють шаблони. Ці візерунки також дадуть вам уявлення про те, як використовувати власні візерунки після їх створення. </p> <p> </p> <p> Ви можете знайти візерунки у вікні зразків. Якщо він ще не відкритий, перейдіть до <strong> Вікно&gt; Зразки </strong> у верхньому меню. На додаток до однотонних кольорів, у вікні зразків вже можуть бути деякі шаблони, але це не єдині шаблони, які має Illustrator. </p> <p> Клацніть на <strong> Бібліотека зразків </strong> у нижньому лівому куті вікна зразка. Наведіть курсор миші на <strong> Візерунок </strong> , а потім виберіть одну з бібліотек зразків шаблонів. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Тепер ви можете застосувати ці зразки, як і до однотонних кольорів. Тут ви можете побачити візерунки з <strong> Природа_листя </strong> Бібліотека застосовується як заливки та штрихи, а також як текст. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> Як зробити базовий повторюваний візерунок в Illustrator </h2> <p> Ви можете перетворити будь-який вектор на зразок, будь то щось, що ви вже створили, або щось, що ви створюєте з урахуванням цього конкретного наміру. Ви можете зробити це з цілою векторною графікою, одним шаром або чим-небудь між ними. </p> <p> Все, що вам потрібно зробити, це вибрати, що ви хочете перетворити на шаблон, а потім перетягнути його у вікно зразків. Наприклад, ви можете перетягнути око цього кота у свої зразки. Це створило б зразок шаблону, який ви могли б потім використовувати для заповнення прямокутника або будь-якої іншої фігури. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> Як варіант, ви можете зробити те саме з усім вектором. У будь-якому випадку Illustrator зробить візерунок з того, що ви перетягнете у вікно зразків. Ви можете просто застосувати зразок, як і будь-який звичайний зразок кольору. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Якщо ви двічі клацнете зразок зразка у вікні Зразки, він відкриє вікно <strong> Параметри візерунка </strong> вікно. Ви також можете відкрити це безпосередньо з <strong> Windows&gt; Параметри шаблону </strong> у верхньому меню. </p> <p> Тут ви можете додатково відредагувати свій шаблон, зокрема, як він повторюється, і наскільки великі проміжки між кожною ітерацією вашого зображення. Ви також можете редагувати дизайн вашого шаблону безпосередньо тут. Версію зображення, що не є затемненою, можна редагувати як зазвичай. Ви можете змінювати кольори, переміщати шари тощо. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> За допомогою вікна «Параметри візерунка» можна робити різні дії. Наприклад, ви можете повторити своє зображення в шаховому макеті цегли та зменшити зазор між кожною частиною візерунка. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> З’єднайте частини вашого малюнка досить близько один до одного, і ви зможете зробити так, щоб вони збігалися. Роблячи це, ви можете створити такий собі черепичний візерунок, як показано нижче. Спробуйте всі різні параметри накладання в параметрах шаблону, щоб знайти щось, що вам підходить. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> Як створити безшовний візерунок в Adobe Illustrator </h2> <p> Якщо ви хочете створити безшовний геометричний візерунок, вам потрібно переконатись, що у вашому дизайні є симетрія. Наприклад, рядок, що починається на 10 пікселів вгору з лівого боку вашого шаблону, повинен закінчуватися на 10 пікселів угору з правого боку. Коли це повториться, ці пункти потрібно буде об’єднати. </p> <p> Для цього створіть новий документ із квадратними розмірами. Увімкніть накладання сітки, натиснувши <strong> Ctrl + &quot; </strong> ( <strong> Cmd + &quot; </strong> на Mac). Розумні путівники також корисні - увімкніть їх за допомогою <strong> Ctrl + U </strong> ( <strong> Cmd + U </strong> на Mac). Якщо ваші лінійки не видно, натисніть <strong> Ctrl + R </strong> ( <strong> Cmd + R </strong> на Mac), щоб увімкнути їх. </p> <p> Ви також можете знайти ці налаштування в розділі <strong> Переглянути </strong> у верхньому меню, але ми рекомендуємо використовувати <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Комбінації клавіш Illustrator </a> де можна заощадити час. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Розкладіть свій дизайн на площі. Будь-які деталі, які йдуть по краях, потрібно буде вишикувати з іншого боку. <strong> Вирівняти </strong> інструмент ( <strong> Вікно&gt; Вирівняти </strong> ) може допомогти вам правильно навести один одного між собою. Клацніть і перетягніть лінійки, щоб створити власні напрямні там, де вони вам потрібні. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> Важливо також мати колір фону, навіть якщо він білий. Переконайтесь, що це ідеально підходить до країв монтажної області, оскільки це потрібно для обрізки зайвого матеріалу. </p> <p> Виберіть все за допомогою <strong> Ctrl + A </strong> ( <strong> Cmd + A </strong> на Mac), а потім натисніть <strong> Shift + M </strong> щоб активувати <strong> Конструктор фігур </strong> інструмент. Це також можна знайти в наборі інструментів. Постривай <strong> Alt </strong> ( <strong> Варіант </strong> на Mac). Це ставить <strong> Конструктор фігур </strong> інструмент у режим віднімання. </p> <p> Наводячи курсор на частини вашого дизайну за допомогою цього інструменту, ви бачите, як вони трохи змінюють колір. Клацніть на області, які ви не хочете, і Illustrator видалить ці частини, залишивши лише ті біти, які перекриваються фоновим квадратом. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> Після цього виділіть все і перетягніть його у зразки, щоб перетворити на зразок. Щоб використовувати шаблон у новому документі, ви можете зберегти його у бібліотеці зразків або скористатися бібліотекою Adobe Cloud. </p> <p> Крім того, ви можете просто скопіювати його з цього вікна зразка та вставити в інше вікно зразка в іншому документі. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Тепер ви можете застосувати цей шаблон, як і будь-який інший. Якщо ви все зробили правильно, все повинно вишикуватися без пробілів. Зробіть коригування у своєму документі зразка, якщо вам потрібно. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> Коли слід використовувати візерунки в Adobe Illustrator? </h2> <p> Найбільш очевидне використання візерунків - це створення повторюваних плиток для фонів, але ви можете використовувати їх для заповнення фігур, щоб надати їм текстуру. Текст, заповнений візерунками, є ще одним корисним використанням, який може зробити вашу типографіку справді помітною. </p> <p> Якщо ви хочете, ви навіть можете створювати власні шаблони вручну, копіюючи та вставляючи одне і те ж зображення знову і знову. Можуть бути випадки, коли вам захочеться це зробити, але здебільшого здатність Illustrator автоматизувати створення шаблонів буде правильним шляхом. </p> <p> Це лише один із багатьох способів, як Illustrator може полегшити ваше життя, надаючи вам більше часу для роботи над вашими проектами. </p>"}