{"title":"Як встановити розумний контролер гаражних дверей","content":"<p> Ви хочете керувати своїми гаражними воротами за допомогою смартфона або планшета? Розумний контролер - чудовий варіант, якщо у вас удома вже встановлений відкривач гаражних дверей. </p> <p> Ми покажемо вам, як встановити розумний контролер гаражних воріт. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Відмінності між відкривачем та контролером </h2> <p> Існують дві основні відмінності між розумним відкриванням гаражних дверей та контролером. Перший - це розмір. </p> <p> Більшість сошників є великими і кріпляться до стелі вашого гаража. Вони використовують механічну доріжку, щоб відкрити і закрити двері. Навпаки, контролер гаражних воріт - це невеликий електронний блок, який дозволяє управляти сошником за допомогою програми на інтелектуальному пристрої. </p> <p> Друга відмінність між цими двома продуктами - ціна. Відкривачки гаражних дверей можуть коштувати близько 300 доларів. Встановлення цих сошників зазвичай вимагає допомоги професійного монтажника. </p> <p> Однак контролер, як правило, не потребує професійної установки. Натомість контролер функціонує як доповнення до вашого існуючого сошника. </p> <p> Це означає, що за частку ціни на новий сошник ви можете досягти тієї ж функціональності, просто використовуючи контролер. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> Які переваги розумних гаражних дверей? </h2> <p> Є три основні переваги наявності розумних гаражних воріт. </p> <ul> <li> <strong> Безпека </strong> - Розумні гаражні ворота дозволяють відкривати та закривати двері практично з будь-якого місця. </li> <li> <strong> Безпека </strong> —Большість розумних відкривачів та контролерів гаражних дверей попереджають вас, коли ваш гараж був відкритий протягом певного періоду часу. </li> <li> <strong> Зручність </strong> —Якщо вам коли-небудь доводилося повертатися додому, щоб закрити гаражні ворота, тоді наявність розумного додатку для гаражних дверей економить час. Замість того, щоб їхати додому, просто витягніть телефон. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> Як встановити розумний контролер гаражних дверей </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Якщо ви вирішили, що розумний контролер гаражних воріт підходить саме вам, тоді цей посібник покаже вам, як його встановити. У цій демонстрації, a <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meross MSG100 </a> використовується, але цей процес подібний, якщо використовується інша марка. Для отримання детальної інформації зверніться до документації вашого контролера. </p> <h3 id=\"what-you-ll-need\"> Що вам знадобиться </h3> <ul> <li> Розумний контролер гаража </li> <li> Штапельні кріплення для пістолета або дроту </li> <li> Гаражні двері з встановленим автовідмикачем </li> <li> Philips та щілинні викрутки </li> <li> Сходи </li> </ul> <h3 id=\"plan-the-installation\"> 1. Сплануйте установку </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Перш ніж встановлювати свій контролер, вам доведеться розвідати кілька місць у вашому гаражі. Перший - це джерело живлення для контролера. Другий - це провідна дорога від контролера до вмонтованого у двері датчика, що входить до вашого комплекту. І третє - розташування магнітного датчика. </p> <p> Цей магнітний датчик дозволяє контролеру знати, коли двері відкриваються або закриваються. </p> <p> Більшість контролерів використовують велику довжину дроту для підключення до датчика дверей. Вам потрібно буде прокласти цей провід через стелю або вниз по стіні, щоб не протягнути провід. </p> <p> Запланувавши встановлення, протестуйте провід датчика від контролера до місця розташування датчика. Ця перевірка відповідає тому, що провід датчика досягає контролера. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Відключіть живлення відчинявача дверей гаража </h3> <p> Більшість гаражних воріт підключені до мережі десь на стелі. Для цих сошників потрібно переконатися, що вони відключені від мережі, перш ніж продовжувати. </p> <p> Якщо ваш сошник не має штекера, а замість цього прикріплений до проводки, що виходить зі стелі, то вам потрібно буде знайти свою коробку вимикача та відключити там живлення сошника. </p> <p> <strong> Примітка: </strong> Домашній струм 120 вольт може спричинити серйозні травми. Якщо вам неприємно працювати з електрикою, зупиніться зараз і проконсультуйтеся з професійним монтажником гаражних воріт та / або електриком. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Підключіть включені дроти до контролера </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> На блоці Meross є набір синіх і коричневих проводів, які повинні бути встановлені в контролер для підключення до відкривання гаражних воріт. Відкрийте пластикову кришку на контролері, і ви побачите дві гвинтові клеми. </p> <p> За допомогою маленької шліцевої викрутки відкрутіть гвинти на кожній клемі. Вставте дроти і затягніть гвинти. Не має значення, який дріт куди йде. </p> <p> Легко потягніть дроти, щоб переконатися, що вони надійно захищені. Потім встановіть кришку контролера. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Встановіть контролер гаражних дверей </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Оскільки ви запланували свої місця, зараз саме час встановити ваш контролер. Переконайтеся, що контролер знаходиться в такому місці, де він може отримати доступ до необхідного живлення, не напружуючи жодної проводки. </p> <p> Далі зніміть липку підкладку з контролера та натисніть на місце. Якщо у вас є контролер із гвинтовим кріпленням, використовуйте викрутку, щоб закріпити контролер у своєму положенні. </p> <h3 id=\"mount-the-sensor\"> 5. Встановіть датчик </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> Далі вам потрібно буде встановити датчик для дверей. Рекомендується розміщувати датчик там, де він не перешкоджає шляху дверей. </p> <p> Також у вас може виникнути спокуса встановити датчик біля землі. Це не рекомендується, оскільки вода, що неодноразово потрапляє безпосередньо на датчик, може пошкодити його. Помістивши датчик, закріпіть його двостороннім скотчем або гвинтами, що додаються. </p> <p> На фотографії вище, чорний датчик був встановлений поруч із гаражними воротами, а частина магніту встановлена ​​на самі двері. Цей датчик використовує двосторонній скотч для кріплення. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Підключіть дроти датчика </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Тепер настав час підключити дроти до датчика і контролера. Використовуючи план, який ви склали на першому кроці, прокладіть дроти та за допомогою скріплювального пістолета закріпіть дроти на стіні або стелі. </p> <p> Не затискайте і не перекручуйте дроти, оскільки це може пошкодити їх. Коли вони будуть прокладені, підключіть червоний гніздо на задній панелі контролера до червоного гнізда на кінці дроту датчика. </p> <p> Далі вам потрібно буде відкрити кришку вашої відкривачки гаражних воріт. Повинні бути присутні чотири дроти, два регулюючі живлення і загальні для пристрою, і два керують кнопкою на стіні. </p> <p> </p> <p> Зазвичай ці дроти виходять зі стелі і повинні мати обтиснуті лопатові клеми, що кріплять їх до блоку відкривання дверей гаража. Якщо ви не можете визначити, які це дроти, зупиніться та ознайомтеся з інструкцією власника вашої машини для відкривання гаражних дверей або зверніться до сертифікованого електрика. </p> <p> Якщо ви знайшли дроти, підключіть коричневий і синій дроти від контролера до клем на сошники, які підключені до настінної кнопки. На фотографії вище, дроти контролера вставлені в два крайні ліві клеми. </p> <p> Коли ви закінчите, до кожного терміналу настінної кнопки слід прикріпити два дроти. Знову закріпіть кришку вашої відкривачки гаражних дверей, підключіть контролер і сошник, і установка повинна бути завершена. </p> <p> На наступному кроці ви підключите контролер до бездротової мережі. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Підключіть контролер до Wi-Fi </h3> <p> <strong class=\"gallery__section-title\"> Галерея зображень (3 зображення) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <p> Для налаштування з’єднання Wi-Fi ми використовували додаток Meross. Він доступний для <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> і <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . Цей процес майже завжди складається з відкриття програми, ідентифікації вашого продукту, підключення програми до вашого Wi-Fi, відкриття екрана налаштувань та надання доступу контролеру до вашої мережі. </p> <p> Тут відкрийте програму, а потім натисніть <strong> Розумний відкривач дверей гаража </strong> і потім <strong> Почніть </strong> . Виберіть виробника та модель сошника для гаражних воріт, який ви використовуєте з контролером. Обов’язково дотримуйтесь інструкцій, що стосуються вашого додатка. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Встановіть інтервал синхронізації відкриття / закриття </h3> <p> <strong class=\"gallery__section-title\"> Галерея зображень (3 зображення) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Розгорнути <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Розгорнути </p> <p> Закрити </p> <p> Одне, що важливо встановити перед тестуванням нового контролера, - це час відкривання гаражних воріт. У додатку Meross ви можете вибрати від 10 секунд до 40 секунд з інтервалом у п’ять секунд, або ви можете додати власні налаштування для дверей, для закриття яких потрібно парна кількість секунд. </p> <p> Встановити терміни для ваших дверей легко, але ви повинні правильно це зробити. Занадто короткий інтервал залишатиме дверцята частково відкритими, а занадто довга установка може спричинити надмірне напруження на двигуні відкривання гаражних воріт. </p> <p> Щоб встановити інтервал, вам знадобляться годинник із секундною стрілкою або секундомір. Ви також можете використовувати вбудований у ваш телефон таймер. Готуйте свій таймер і станьте біля кнопки відкривання дверей гаража. Потім натисніть кнопку одночасно з натисканням кнопки &quot;Пуск&quot; на секундомірі або вказівкою часу на секундомір. </p> <p> Зачекайте, поки ваші гаражні ворота не перестануть рухатися, і запишіть час. Це ваш інтервал. Передайте цю інформацію в програму, і налаштування інтервалу завершено. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Перевірте контролер гаражних дверей </h3> <p> За допомогою програми кілька разів відкривайте та закривайте двері, щоб переконатися, що все працює. Тепер ви можете використовувати кнопку стіни або додаток, щоб відкрити свої гаражні ворота. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Насолоджуйтесь своїм розумним контролером дверей гаража </h2> <p> Піднесення вашої технології розумного будинку до гаражних воріт не повинно коштувати цілих багатств. </p> <p> Встановлення нового розумного контролера гаражних воріт забезпечує вам та вашій родині більшу гнучкість, безпеку, безпеку та зручність для вашого будинку. Це також забезпечує душевний спокій, який забезпечується знанням того, що вашими гаражними дверима можна керувати практично з будь-якого місця. </p>"}