{"title":"Як зробити знімок екрана на планшеті Surface Pro","content":"<p> Зробити скріншот - це проста, але необхідна навичка на будь-якому пристрої. На планшеті Surface Pro ви можете робити знімки екрана за допомогою комбінацій клавіш, інструмента обрізки або навіть ігрової панелі Xbox. Ми покажемо вам, як використовувати всі ці методи, щоб зробити знімок екрана або навіть записати екран на своєму пристрої Surface. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Знімок екрана за допомогою комбінацій кнопок </h2> <p> У лінійці пристроїв Surface Pro зробити знімок екрана за допомогою комбінацій кнопок швидко і легко. Щоб зробити знімок екрана, натисніть і утримуйте <strong> Потужність </strong> і <strong> Збільшення гучності </strong> клавішу одночасно. Екран повинен блимати, а знімок екрана слід зберегти у папці знімка екрана в розділі Картинки на вашому пристрої. </p> <p> Цей метод працює для останньої лінійки пристроїв Surface Pro (тобто Surface Pro 7+, Pro X), Surface Go, Surface Go 2 та лінійки пристроїв Surface Book. </p> <p> Якщо ваша Surface є старшою моделлю (Surface 3 або старшою), комбінація кнопок трохи відрізняється. Ви повинні натиснути <strong> Кнопка Windows </strong> (не клавішу Windows на клавіатурі) та <strong> Зменшення гучності </strong> одночасно. Пристрій збереже ваш знімок екрана у папці скріншотів у розділі Фото. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> Подібним чином, щоб зробити знімок екрана на Surface Duo, утримуйте клавішу <strong> Потужність </strong> і <strong> Зменшення гучності </strong> ключ. Знімок екрана слід зберегти в галереї вашого пристрою в розділі Знімки екрана. Крім того, ви можете просто утримувати кнопку <strong> Потужність </strong> і натисніть клавішу <strong> Знімок екрана </strong> на екрані. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> Як зробити знімок екрана Surface Pro за допомогою комбінацій клавіш </h2> <p> Комбінації клавіш - це ще один спосіб, як ви можете зафіксувати те, що на екрані. </p> <p> Ці комбінації клавіш працюють на всіх пристроях Windows, тому перевірте <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> інші методи скріншотів у Windows 10 </a> . Комбінації клавіш найкраще працюють на лінійках пристроїв Surface Laptop і Surface Book, але, звичайно, якщо у вас є приєднання клавіатури для вашого пристрою Surface Pro або Go, ці ярлики також працюють. </p> <h3 id=\"print-screen-methods\"> Методи друку на екрані </h3> <p> Щоб зробити знімок екрана за допомогою методу Print Screen, просто натисніть <strong> PrtScn </strong> на клавіатурі. Це зробить знімок екрана всього робочого столу. Зверніть увагу, що це не збереже знімок екрана у вашій Surface, але додасть його у ваш буфер обміну. Вам потрібно скористатися такою програмою, як Microsoft Paint, щоб вставити знімок екрана. </p> <p> Натискання <strong> Alt + PrtScn </strong> зробить знімок екрана лише вашого поточного вікна, і аналогічним чином додасть знімок екрана у ваш буфер обміну. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Сніп та ескіз </h3> <p> Це, безумовно, найпростіший спосіб зробити знімок екрана на своєму пристрої Surface. </p> <p> Щоб відкрити Snip and Sketch, натисніть <strong> Клавіша Windows + Shift + S, </strong> і на екрані має з’явитися накладення. Щоб зробити повний знімок екрана, натисніть кнопку повноекранного режиму у верхній частині накладеного зображення. Щоб зробити знімок екрана лише поточного вікна, натисніть кнопку «Віконний знімок» поруч із кнопкою Повноекранний режим. </p> <p> Ви також можете зробити знімок екрана певної області екрана. За замовчуванням Snip and Sketch має прямокутний фрагмент. Просто перетягніть частину, яку ви хочете зробити на скріншоті, за допомогою сенсорного екрану або сенсорної панелі. </p> <p> Snip and Sketch дасть вам сповіщення на панелі сповіщень про те, що ваш знімок екрана скопійовано у ваш буфер обміну. Якщо натиснути на неї, ви можете намалювати та намалювати скріншот, якщо потрібно. </p> <p> Щоб зберегти його у файлах, використовуйте <strong> Ctrl + S </strong> або кнопку Зберегти у верхньому правому куті, щоб зберегти знімок екрана у певній папці. </p> <h3 id=\"xbox-game-bar\"> Ігрова панель Xbox </h3> <p> Щоб зробити знімок екрана за допомогою ігрової панелі Xbox, натисніть клавішу <strong> Клавіша Windows + G </strong> щоб відкрити його. </p> <p> Звідти ви можете перейти на вкладку &quot;Зйомки&quot; та натиснути кнопку &quot;Камера&quot;. Цей метод також дозволить вам зробити відеозйомку екрану зі звуком. Збережені знімки з’являться у папці Відео та підпапці Знімки. На Xbox ви можете подібно <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> захоплюйте захоплення екрану та записи </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Зробіть знімок екрана Surface Pro за допомогою ручки Surface </h2> <p> Щоб зробити знімок екрана за допомогою Surface Pen, просто двічі клацніть гумку, і на вашому пристрої з’явиться Snip and Sketch для всього вашого вікна. Звідси ви можете намалювати та експортувати свій знімок екрана. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> Ви також можете отримати доступ до цього, шукаючи Windows Ink Workspace на док-станції. Звідси виберіть Повноекранний фрагмент. Ви можете змінити те, що роблять ярлики кнопок вашого Surface Pen, шукаючи Параметри робочої області Windows Ink і прокручуючи вниз до Windows Ink Workspace. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Знімок екрану на поверхні, зроблений просто </h2> <p> Тепер ви знаєте всі різні способи зробити знімок екрана або записати екран на своєму пристрої Surface. Комбінації кнопок - найкращий тактильний спосіб зробити знімок екрана, якщо ви використовуєте Surface Pro або Surface Go, але комбінації клавіш також прості. </p>"}