{"title":"Як виконати чисте завантаження в Windows 10","content":"<p> На вашому комп’ютері з ОС Windows, ймовірно, встановлено безліч сторонніх програм. Не хвилюйтеся, більшість людей так і роблять. </p> <p> Від виконання основних завдань, таких як перегляд веб-сторінок, до виведення складних рядків коду, люди воліють використовувати альтернативні програми, аніж вбудовані в Windows. Хоча ці програми полегшують наше життя, вони іноді заважають роботі систем. Вони можуть варіюватися від незначних випадків до критичних помилок та BSOD. </p> <p> Тут чисте завантаження входить у картину. </p> <h2 id=\"what-is-a-windows-clean-boot-anyway\"> Що взагалі таке &quot;Чисте завантаження Windows&quot;? </h2> <p> Чисте завантаження Windows 10 дозволяє користувачам виключити сторонні програми як причину помилки. Це робиться простим завантаженням пристрою, коли всі сторонні програми відключені. І хоча назва звучить так, ніби це вбудована функція Windows, це не так. Вам потрібно вручну очистити завантажувальний комп’ютер. </p> <p> Переваги чистого завантаження не обмежуються лише діагностуванням помилок. Відомо, що він допомагає коли <a href=\"https://www.makeuseof.com/tag/fix-windows-update-error-0x80070057/\" target=\"_blank\" rel=\"nofollow noopener\"> Оновлення Windows не встановлюються належним чином </a> . Це також особливо корисно, коли ваша ОС відчуває себе млявою, і ви хочете перевірити, що може спричинити проблему. </p> <p> </p> <p> </p> <h2 id=\"how-to-clean-boot-and-fix-errors\"> Як очистити завантаження та виправити помилки </h2> <p> Чисте завантаження - це відносно простий процес, коли користувачі спробували його кілька разів. </p> <p> Перш ніж перерахувати кроки, користувачі повинні знати, що деякі дії вимагають прав адміністратора. Ваш комп’ютер також може працювати не так, як ви звикли, але не потрібно його потіти. Це трапляється тому, що іноді користувачі навіть не підозрюють про те, що за якісь загальні завдання піклується сторонне програмне забезпечення. </p> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-128.png\" loading=\"lazy\"> </p> <p> Ось кроки щодо очищення завантажувальної Windows 10: </p> <ol> <li> У рядку пошуку меню «Пуск» введіть <strong> sysconfig </strong> і натисніть на <strong> Системна конфігурація </strong> . </li> <li> В <strong> Системна конфігурація </strong> вікно, перейдіть до <strong> Послуги </strong> вкладку. </li> <li> Перевірте <strong> Сховати всі служби Microsoft </strong> коробці. </li> <li> Перевірте всі послуги у списку та натисніть <strong> Відключити все </strong> розташована внизу праворуч, потім збережіть і вийдіть. </li> <li> Тепер відкрийте <strong> Диспетчер завдань </strong> . Ви можете зробити це, клацнувши правою кнопкою миші на панелі завдань та вибравши <strong> Диспетчер завдань </strong> або використовуючи <strong> Ctrl + Alt + Видалити </strong> . </li> <li> В <strong> Диспетчер завдань </strong> вікно, перейдіть до <strong> Стартап </strong> вкладку. </li> <li> Виберіть усі послуги по черзі та натисніть <strong> Вимкнути </strong> . </li> <li> Вихід <strong> Диспетчер завдань </strong> і <strong> Перезапустіть </strong> комп&#39;ютера. </li> </ol> <p> <img alt=\"Startup tab in the task manager\" src=\"images/startup-tab-task-manager-383.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"fixing-errors-with-clean-boot\"> Виправлення помилок за допомогою чистого завантаження </h2> <p> Після виконання перелічених вище кроків, ваш <a href=\"https://www.makeuseof.com/tag/clean-computer-original-state-reinstalling-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> ПК завантажиться в чистий стан. </a> Перше, що повинні зробити користувачі, це зачекати та перевірити, чи не повторюється та сама помилка. Іноді джерелом помилки можуть бути системні файли Windows, і в цьому випадку помилка з&#39;являється, але це може зайняти більше часу, ніж це відбувається під час звичайного завантаження. </p> <p> Якщо помилка не з’являється, настав час звузити підозрюваних. Це дещо нудне завдання, але, на жаль, також найкращий спосіб його виконати. Щоб звузити список, виконайте такі дії: </p> <ol> <li> У чистому стані завантаження відкрийте <strong> Системна конфігурація </strong> . </li> <li> Під <strong> Послуги </strong> виберіть верхню половину списку та натисніть <strong> Увімкнути </strong> . Переконайтеся, що <strong> Сховати всі служби Microsoft </strong> позначено. </li> <li> Тепер відкрийте <strong> Диспетчер завдань </strong> і перейдіть до <strong> Стартап </strong> вкладку. </li> <li> Подібним чином увімкніть верхню половину служб і перезавантажте комп’ютер. </li> </ol> <p> Після перезавантаження, якщо помилка не з’являється, ви можете виключити вибране програмне забезпечення та послуги зі списку винних. Вам доведеться повторювати ці дії, поки не знайдете програму чи службу відповідальною та не видалите їх. </p> <p> </p> <h2 id=\"clean-boot-windows-10-to-isolate-errors\"> Очистіть завантажувальну Windows 10, щоб виділити помилки </h2> <p> Тепер прийшов час перезавантажити Windows 10 як стандарт. Просто відкрийте <strong> Системна конфігурація </strong> і <strong> Диспетчер завдань </strong> і включити всі послуги та програми. Користувачам рекомендується виконати чисте завантаження, перш ніж вдаватися до вдосконалених виправлень, коли Windows аварійно завершує роботу або відображає BSOD. </p>"}