{"title":"Як виправити BSOD VIDEO_TDR_FAILURE у Windows 10","content":"<p> Помилка VIDEO_TDR_FAILURE означає, що ваша відеокарта несправна або драйвери дисплея можуть бути застарілими / несправними. Але можуть бути й інші причини, такі як перегрів компонентів або пошкодження системних файлів. TDR - це скорочення від <strong> Час очікування, виявлення та відновлення </strong> , метод, який використовується Windows для виявлення та виправлення несправних компонентів програмного забезпечення. </p> <p> Якщо ви зіткнулися з цією помилкою, не бійтеся, оскільки наступні методи виправлять помилку VIDEO_TDR_FAILURE швидше, ніж ви очікували. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Оновіть та перевстановіть драйвери дисплея </h2> <p> Як зазначалося вище, помилка, як правило, є наслідком несправності або застарілих драйверів дисплея. Таким чином, слід оновити драйвери відеокарти. Якщо це не виправляє ситуацію, переінсталюйте їх. Залежно від вашої відеокарти, ви можете зустріти різні імена файлів, що стосуються помилки. </p> <ol> <li> Для користувачів Nvidia це так <strong> nvlddmkm.sys </strong> . Якщо ви випадково користувач Nvidia, ось <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 простих способів виправити помилку. </a> </li> <li> Для користувачів AMD помилка відображається як <strong> atikmpag.sys </strong> . </li> <li> Для користувачів Intel HD помилка полягає в <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> Як оновити драйвери дисплея </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> Натисніть <strong> Клавіша Windows + R </strong> щоб відкрити команду Виконати. Введіть <strong> devmgmt.msc </strong> і натисніть Enter. </li> <li> В <strong> Диспетчер пристроїв </strong> вікно, перейдіть до <strong> Відеоадаптери </strong> і розширити його. </li> <li> Клацніть правою кнопкою миші адаптер дисплея, а потім виберіть <strong> Драйвер оновлення </strong> . </li> <li> Виберіть <strong> Шукати автоматично оновлене програмне забезпечення драйверів </strong> . </li> <li> Windows автоматично здійснить пошук в Інтернеті та завантажить необхідні драйвери. Будь ласка, переконайтесь, що у вас є активне з’єднання з Інтернетом. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> Як перевстановити драйвери дисплея </h3> <p> Якщо після оновлення драйверів дисплея збій BSOD відео tdr не зникає, краще перевстановити ці драйвери. Бажано це робити під час завантаження Windows у безпечний режим. Але перед цим слід зайти на веб-сайт виробника відеокарти та завантажити останню версію графічних драйверів. </p> <p> Найпоширенішими виробниками є <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> , і <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intel </a> . </p> <p> Для завантаження в безпечному режимі виконайте такі дії: </p> <ol> <li> Натисніть <strong> Клавіша Windows + R, </strong> і в діалоговому вікні Виконати введіть <strong> msconfig, </strong> і натисніть Enter. </li> <li> В <strong> Системна конфігурація </strong> вікно, натисніть на <strong> Завантаження </strong> вкладку. </li> <li> Тепер поставте галочку <strong> Безпечний режим </strong> розташована внизу. </li> <li> Застосуйте налаштування та перезавантажте комп&#39;ютер. </li> </ol> <p> Після завантаження в безпечний режим настав час перевстановити драйвери дисплея. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> У рядку пошуку меню «Пуск» введіть <strong> Диспетчер пристроїв </strong> і відкрийте його. </li> <li> Шукати <strong> Відеоадаптери </strong> і розгорніть меню. </li> <li> Клацніть правою кнопкою миші на графічному процесорі та натисніть на <strong> Видаліть пристрій </strong> . </li> <li> У майстрі видалення не забудьте перевірити <strong> Видаліть програмне забезпечення драйвера для цього пристрою </strong> коробці. </li> <li> Зачекайте, поки Windows видалить пристрій і перезавантажте комп&#39;ютер. </li> <li> Тепер переінсталюйте графічні драйвери, які ви завантажили раніше. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Використовуйте SFC для сканування та виправлення системних файлів </h2> <p> SFC - це вбудована утиліта Windows, яку можна використовувати для сканування та виправлення пошкоджених системних файлів. У випадку з BSOD дуже ймовірно, що деякі системні файли пошкоджені, тому запуск цієї утиліти є обов’язковим. Це лише один із <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> кілька корисних утиліт </a> у розпорядженні користувача Windows. </p> <p> Щоб запустити SFC, просто виконайте такі дії: </p> <ol> <li> У рядку пошуку меню «Пуск» введіть <strong> cmd </strong> . </li> <li> Клацніть правою кнопкою миші <strong> Командний рядок </strong> і виберіть <strong> Запустити від імені адміністратора </strong> . </li> <li> На консолі введіть <strong> sfc / scannow </strong> і натисніть Enter. </li> <li> Після завершення процесу сканування та відновлення перезавантажте комп&#39;ютер. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Запустіть відновлення автозавантаження </h2> <p> Для користувачів, які отримують помилку відразу після завантаження Windows 10 або незабаром після входу в систему, відновлення запуску є знахідкою. Ця функція Windows перевіряє наявність аномалій під час запуску та негайно їх виправляє. </p> <p> Оскільки цей розділ орієнтований на користувачів, чиї комп’ютери стали непридатними через помилку, тобто вони не можуть відкритись <strong> Налаштування </strong> , їм доведеться жорстко перезавантажитися, щоб увійти до середовища відновлення Windows (winRE). </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Для завантаження в середовищі відновлення Windows виконайте такі дії: </p> <ol> <li> Натисніть і утримуйте кнопку живлення, доки ПК не вимкнеться. </li> <li> Ще раз натисніть кнопку живлення, щоб завантажити ПК. </li> <li> Повторюйте перший та другий кроки, доки ПК не завантажиться в режим відновлення. Це буде синій екран. </li> <li> На екрані відновлення натисніть <strong> Див. Додаткові варіанти ремонту </strong> . </li> <li> На наступному екрані натисніть <strong> Усунення несправностей </strong> </li> <li> Натисніть на <strong> Розширені опції </strong> </li> <li> Натисніть на <strong> Ремонт запуску </strong> та введіть свої дані, коли з’явиться відповідний запит. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Змініть налаштування керування живленням </h2> <p> Налаштування керування живленням Windows, як правило, добре оптимізовані, але іноді вони можуть заважати роботі комп&#39;ютера з графікою. Це особливо актуально, коли комп&#39;ютер має дискретний графічний процесор. Оптимальні налаштування, щоб уникнути отримання BSOD VIDEO_TDR_FAILURE, наведені нижче: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> У рядку пошуку меню «Пуск» введіть <strong> Панель управління </strong> і відкрийте його. </li> <li> На панелі пошуку на панелі керування введіть &quot;параметри живлення&quot; та натисніть клавішу Enter. </li> <li> Натисніть на <strong> Параметри живлення, </strong> і поруч із планом живлення, який ви використовуєте, натисніть на <strong> Змінити налаштування плану. </strong> </li> <li> Натисніть на <strong> Змініть розширені налаштування живлення. </strong> </li> <li> Шукати <strong> PCI E </strong><strong> xpress </strong> і розширити його. </li> <li> Поверніть <strong> Зв&#39;язок управління енергоспоживанням </strong> встановивши на <strong> Вимкнено </strong> . </li> <li> Збережіть зміни та перезавантажте комп’ютер. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Очистіть свій комп’ютер </h2> <p> Перегрів ніколи не є хорошою справою, і, як правило, причиною цього є скупчення пилу. Користувачам рекомендується щомісяця очищати компоненти ПК від будь-якого пилу. Але будьте обережні. Це слід робити обережно. </p> <p> Обов’язково почистіть верхівки відеокарти, вентилятора процесора, блоку живлення та вентиляторів корпусу. Загалом, обов’язково уникайте <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> помилки в обслуговуванні, які можуть пошкодити дорогі компоненти. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Перевірте апаратні компоненти </h2> <p> Якщо помилка все-таки з&#39;являється після спроби всього перерахованого вище, можливо, несправність самого обладнання. Користувачі, у яких є спеціальна відеокарта, повинні вийняти її та завантажити комп&#39;ютер. Якщо помилка усунена, то це апаратна помилка самого GPU. Ви можете спробувати зв’язатися з виробником і спробувати замінити пристрій. </p> <p> </p> <p> Використовуючи вбудовану графіку, спробуйте вимкнути її та завантажити. Щоб їх вимкнути, виконайте такі дії: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> Натисніть <strong> Клавіша Windows + R, </strong> типу <strong> devmgmt.msc </strong> у текстовому полі Виконати та натисніть клавішу Enter. </li> <li> В <strong> Диспетчер пристроїв </strong> , шукати <strong> Відеоадаптери </strong> і розгорніть меню. </li> <li> Клацніть правою кнопкою миші на вбудованому графічному процесорі та натисніть на <strong> Вимкнути пристрій </strong> . </li> <li> Перезавантажте комп&#39;ютер і перевірте, чи помилка усунена. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> Помилка &quot;Помилка відео TDR&quot; вирішена успішно </h2> <p> Для більшості користувачів проблему вирішить просте оновлення або перевстановлення драйверів дисплея. Але якщо погане погіршується, можливо, доведеться перезавантажити ПК або замінити деяке обладнання. </p>"}