{"title":"Як керувати групами користувачів за допомогою Groupadd на Linux","content":"<p> Керування користувачами є досить простим, якщо ви використовуєте Linux на своєму персональному комп’ютері. Але для тих, у кого є сервер з тисячами користувачів, управління стає серйозною проблемою, про яку слід подбати. </p> <p> На щастя, операційні системи, засновані на Linux, надають вам можливість контролювати та керувати користувачами у вашій системі. Ви можете створювати групи та додавати до них користувачів. Потім, замість того, щоб призначати дозволи кожному користувачеві системи, ви можете легко авторизувати групи користувачів, надаючи їм привілеї, пов’язані з робочим процесом системи. </p> <h2 id=\"create-user-groups-on-linux\"> Створіть групи користувачів на Linux </h2> <p> Linux постачається із командою за замовчуванням для створення груп користувачів. Ви можете використовувати <strong> groupadd </strong> команда, щоб додати нові групи до вашої системи. Основний синтаксис команди: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> Щоб створити нову групу користувачів &quot;автори&quot;: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> Запуск вищезазначеної команди додасть новий запис до <strong> / etc / group </strong> і <strong> / etc / gshadow </strong> файли у вашій системі. Ви можете перевірити новий запис групи у файлах, набравши <strong> cat / etc / group </strong> і <strong> cat / etc / gshadow </strong> у своєму терміналі. </p> <p> Зверніть увагу, що лише користувачі з адміністративними дозволами можуть створювати групи користувачів. Не забудьте перейти на суперкористувача перед виконанням команди groupadd. </p> <p> Якщо ви спробуєте створити групу з іменем, яке вже існує, ви побачите повідомлення про помилку: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> Однак ви можете усунути помилку, використовуючи <strong> -f </strong> або <strong> --силу </strong> прапор із командою. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Створюйте групи користувачів за допомогою унікального GID </h3> <p> Коли ви створюєте нову групу користувачів, система автоматично присвоює їй ідентифікатор групи або GID. Якщо ви хочете, щоб ваша група мала конкретний ідентифікатор групи, ви можете зробити це, використовуючи <strong> -г </strong> або <strong> - жорсткий </strong> прапор. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Якщо ви спробуєте призначити ідентифікатор групи, який уже взяли, трапиться така помилка. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Хоча це не рекомендується, але ви можете додати <strong> -o </strong> або <strong> --не унікальний </strong> прапорець для примусового присвоєння ідентифікатора групи. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Створюйте групи користувачів за допомогою пароля </h3> <p> Хоча ви можете додати пароль до своїх груп, вони практично не корисні для користувача. <strong> -с </strong> flag дозволяє вказати пароль для вашої групи користувачів. </p> <pre><code class=\"hljs\">groupadd -p secretpassword writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Створення системних груп у Linux </h3> <p> Існує невелика різниця між системними групами та звичайними групами. Системні групи - це спеціальні групи, що включають користувачів, які відповідають за виконання системних операцій, таких як резервне копіювання та обслуговування. </p> <p> Використовувати <strong> -r </strong> або <strong> --система </strong> прапор для створення системної групи в Linux: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Отримати список членів групи користувачів </h3> <p> Щоб дізнатись, скільки членів входить до певної групи, ви можете скористатися <strong> гетент </strong> з вашого терміналу. Наступна команда покаже список усіх членів, присутніх у групі &quot;письменників&quot;: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Додавання користувачів до груп </h2> <p> Тепер, коли ви створили групу користувачів у вашій системі, настав час додати до неї кількох користувачів. Usermod - це потужна утиліта командного рядка, яка містить різні опції, пов&#39;язані з керуванням та модеруванням користувачів. Це також дозволяє легко додавати користувачів до своєї групи. Основний синтаксис команди: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Додавання існуючого користувача до груп </h3> <p> Якщо ви хочете додати існуючого користувача до своєї групи, <strong> -а </strong> і <strong> -G </strong> прапори - це те, що вам потрібно. <strong> -G </strong> прапор означає групи, тоді як <strong> -а </strong> розшифровується як додавання, додавання або додавання. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> Ви також можете додати користувача до декількох груп. Все, що вам потрібно зробити, це ввести імена груп, розділені комами. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Додавання нового користувача до групи </h3> <p> Ви можете використовувати <strong> useradd </strong> команда, коли ви хочете <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> додати нового користувача до вашої системи Linux </a> . Useradd надає вам спосіб призначити групу користувачеві під час її створення. <strong> -G </strong> прапор дозволяє вказати групу користувачеві. </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> Додавати користувача до декількох груп також легко. Просто передайте імена груп, розділені символом коми, у команді за замовчуванням. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Видалення користувачів із групи </h2> <p> Ви також можете видалити користувачів із групи за допомогою <strong> usermod </strong> . Майте на увазі, що в системі Linux користувачеві можна призначити кілька груп. Одна з цих груп оголошена Первинною групою, тоді як інші називаються вторинними групами. </p> <p> Якщо ви намагаєтеся видалити користувача з групи, переконайтеся, що він має принаймні одну основну групу після видалення. Наприклад, користувач &quot;випадковий&quot; є частиною груп адміністратора, авторів та редакторів; де admin - це основна група, а решта - вторинні групи. </p> <p> Ви можете вилучити користувача лише з редакторів та редакторів груп. І для цього вам потрібно передати ім’я групи, учасником якої ви хочете, щоб користувач залишався. Це означає, що для видалення користувача &quot;random&quot; із редакторів групи використовується наступна команда: </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> Зверніть увагу, що вам потрібно було лише зняти <strong> додати прапор (-a) </strong> з команди, яку ви використовуєте для додавання користувача до групи. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Видалити групи в Linux </h2> <p> Якщо ви більше не хочете зберігати групу користувачів у своїй системі, ви можете видалити групу за допомогою <strong> груповий </strong> команди. Синтаксис команди: </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> Щоб видалити групу користувачів &quot;письменники&quot;: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Якщо ви спробуєте видалити групу, яка не існує, ви отримаєте повідомлення про помилку: </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Управління групами користувачів на Linux </h2> <p> Керування користувачами може бути жорстким, якщо ви не знаєте про команди Linux, які вам потрібно використовувати. Це стає по-справжньому легким, коли ви дізнаєтеся про введення та виведення команд, пов’язаних із модеруванням та управлінням. </p> <p> Адміністратори серверів повинні намагатися використовувати дистрибутиви Linux, які підходять для їх потреб. Таким чином, вони одразу отримають усі інструменти та утиліти, необхідні для управління сервером. </p>"}