{"title":"iPhone 13 може похвалитися дисплеєм &quot;Завжди увімкнено&quot;","content":"<p> Apple представила свій &quot;постійно включений&quot; дисплей для Apple Watch Series 5 в 2019 році. Через кілька років його можна буде придбати на iPhone, за словами репортера Макса Вайнбаха, який поділився інформацією з каналом YouTube <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> EverythingApplePro </a> . </p> <p> У звіті стверджується, що iPhone 13 - якщо це саме те, що Apple дійсно вирішила назвати - --- буде постійно освітлено деякі розділи екрана, щоб відображати певні деталі. </p> <h2 id=\"how-always-on-display-will-work\"> Як працюватиме дисплей &quot;Завжди включено&quot; </h2> <p> Ці деталі можуть включати піктограми годинника та батареї. Вони залишаться видимими навіть тоді, коли iPhone заблоковано, а це означає, що користувач активно не використовує його. Сповіщення, такі як повідомлення про нові повідомлення, будуть підсвічуватися лише тимчасово. </p> <p> Це буде перший раз, коли iPhone поставляється з технологією &quot;завжди включеного&quot; дисплея. Однак це далеко не перший раз, коли подібні технології пробилися до смартфона. Nokia представила функцію &quot;постійно ввімкнено&quot; ще в 2009 році. Нещодавно вона стала широко доступною функцією на різних телефонах Android - включаючи моделі Huawei, Motorola, Samsung, Google та інших. </p> <p> Велика, очевидна перевага &quot;завжди увімкнено&quot; полягає в тому, що користувач не вимагає пробудження або розблокування свого телефону для доступу до інформації, навіть якщо це щось таке незначне, як перевірка часу. </p> <p> Недоліком є ​​те, що він витрачає додатковий час автономної роботи, що вже може бути щось на зразок преміум-класу для смартфонів. Однак дисплеї AMOLED можуть зменшити вплив батареї, активуючи лише ті пікселі на дисплеї, які потрібні для відображення інформації. </p> <p> Іншими словами, цей &quot;постійно включений&quot; дисплей завжди ввімкнений у технічному сенсі - хоча більшість екранів вимкнено, і лише кілька частин залишаються підсвіченими весь час. Це означає, що вплив на час автономної роботи не такий серйозний, як може бути в іншому випадку. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> Чого чекати від iPhone 13 </h2> <p> IPhone наступного покоління, швидше за все, надійде у вересні 2021 року. За словами Вайнбаха, він матиме той самий загальний дизайн шасі, що і iPhone 12 серії, хоча відбудуться деякі модернізації. </p> <p> Сюди входять сильніші магніти MagSafe, вдосконалена система камер для зйомки місяця і зірок, надширокий об&#39;єктив камери по всій лінійці iPhone, відео в портретному режимі (а не просто нерухомі зображення), витончена матова задня частина та покращений чіп серії. Попередній звіт стверджував, що Apple може <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> представити сенсорний ID на дисплеї </a> як альтернативу Face ID. </p> <p> Враховуючи, що до цього ще більше півроку, може з’явитися багато нових деталей, перш ніж Apple продемонструє свій наступний iPhone у третьому кварталі. Тим не менше, схоже, чутка вже починає діяти. Дивіться цей простір! </p>"}