{"title":"JPG проти JPEG: Яка різниця між цими форматами файлів зображень?","content":"<p> Не всі формати файлів зображень зрівняні. Насправді багато з них були створені для вирішення проблеми, яку вже існуючий формат не міг вирішити. Наприклад, JPEG з’явився через те, що розміри файлів зображень поглинали занадто багато місця для зберігання. </p> <p> Вірте чи ні, але розширення файлів JIF, JPEG та JPG більш-менш стосуються одного і того ж. Щоб зрозуміти, чому формат файлу має стільки назв, нам потрібно розгадати трохи заплутаної історії. </p> <h2 id=\"what-is-a-jpeg\"> Що таке JPEG? </h2> <p> Абревіатура JPEG розшифровується як Joint Photographic Experts Group - тип файлу був названий на честь підкомітету, який допоміг створити стандарт JPEG Interchange Format (JIF). Вперше він був виданий Міжнародною організацією зі стандартизації (ISO) у 1992 році. </p> <p> JPEG - це 24-бітові нерухомі растрові зображення, по 8 бітів у кожному каналі кольорової моделі RGB. Це не залишає місця для альфа-каналу, а це означає, що, хоча JPEG можуть підтримувати понад 16 мільйонів кольорів, вони не можуть підтримувати прозорість. </p> <p> Коли зображення зберігається у форматі JPEG, частина його даних відкидається в процесі, який називається втратою <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> стиснення файлів </a> . У свою чергу, зображення займає на 50-75 відсотків менше місця для зберігання (у порівнянні зі старими форматами, такими як BMP), з незначною або незначною втратою якості зображення. </p> <p> Стиснення JPEG базується на техніці стиснення зображень із втратами, яка називається дискретним косинус-перетворенням (DCT), яка була вперше запропонована інженером-електриком Насіром Ахмедом у 1972 році. </p> <h3 id=\"what-is-a-jif\"> Що таке JIF? </h3> <p> Ви можете уявити собі файл JIF як JPEG у &quot;найчистішому&quot; вигляді. Однак формат вже не використовується багато, оскільки він має деякі неприємні обмеження. Наприклад, визначення кольору та пікселів у форматі JIF викликало проблеми сумісності між кодерами та декодерами (переглядачами). </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> На щастя, пізніше ці проблеми були вирішені іншими &quot;додатковими&quot; стандартами, що базуються на JIF. Першим із них був формат обміну файлами JPEG (JFIF), а пізніше - <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Змінний формат файлу зображення </a> (Exif) та кольорові профілі ICC. </p> <p> JPEG / JFIF на сьогодні є найбільш популярним форматом для зберігання та передачі фотографічних зображень в Інтернеті, тоді як JPEG / Exif - для цифрових камер та інших пристроїв захоплення зображень. Більшість людей не розрізняють різницю між цими варіаціями, а просто називають їх обома просто JPEG. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> Що таке JPG2 або JPF? </h3> <p> У 2000 році група JPEG випустила ще один формат файлу зображень, який називається JPEG 2000 (розширеннями файлів є JPG2 та JPF). Він мав стати наступником JPEG, але був далеко не таким популярним. Навіть коли його вдосконалений метод кодування часто призводив до покращення якості зображень. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Кредит зображення: Dake / <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Вікісховище </a> </p> <p> Формат файлу JPEG 2000 провалився з невеликої кількості причин. З одного боку, він базувався на абсолютно новому коді і, отже, не був сумісним із JPEG. Крім того, для обробки файлів JPEG 2000 було потрібно більше пам’яті для обробки, що на той час було певним рушієм. Зрештою, середній комп’ютер того часу мав лише 64 Мб пам’яті. </p> <p> JPEG 2000 трохи пожвавився зараз, коли комп’ютерне обладнання загалом значно покращилося за останні 20 років, але формат файлів все ще дуже мало використовується. Єдиним веб-браузером, який підтримував файли JPEG 2000 на момент написання статті, є Safari. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG проти JPG </h3> <p> Ранні версії Windows (зокрема, файлові системи MS-DOS 8.3 та FAT-16) мали максимум 3 літери, коли мова йшла про довжину розширень файлів. JPEG довелося скоротити до JPG, щоб не перевищувати ліміт. На комп’ютерах Mac та Linux ніколи такого не було, і тому користувачі продовжуватимуть зберігати зображення у форматі JPEG. </p> <p> </p> <p> Популярні програми для редагування зображень, які працювали в різних операційних системах, таких як Photoshop і <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> Gimp </a> —Решті встановили б розширення файлу JPEG за замовчуванням на JPG, намагаючись мінімізувати плутанину. </p> <p> І ось у нас вийшло два розширення файлів для одного формату: JPEG та JPG. Вибираючи, як зберегти зображення, між ними немає різниці. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG проти PNG: Що краще? </h2> <p> </p> <p> JPEG і PNG були випущені протягом одного десятиліття, причому кожен формат файлу вирішував різні проблеми цифрових зображень, з якими тоді стикався світ технологій. Можна сказати, що цілком природно, що їх постійно порівнюють ... і є, навіть донині. Який формат файлів зображень панує між JPEG та PNG? </p> <p> Цілком чесно, відповідь залежить від того, який образ ви зберігаєте. </p> <p> JPEG-файли краще підходять для фотографій, оскільки вони використовують стиснення з втратами, щоб зберегти належний розмір файлу. Фотографії - це такі великі, деталізовані зображення, що артефакти стиснення (тонкі спотворення зображення, спричинені стисненням) на них не дуже помітні. </p> <p> З іншого боку, зображення з різкими точками, чіткими краями та великими одноколірними ділянками (наприклад, векторні логотипи, піксельні малюнки тощо) виглядають не зовсім правильно, коли зберігаються у форматі JPEG. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Кредит зображення: Аксель Гримард / <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Вікісховище </a> </p> <p> Тут може з’явитися файл портативної мережевої графіки (PNG). Розроблений Групами розробників PNG через чотири роки після випуску JPEG, PNG підтримує стиснення та прозорість даних без втрат. Таким чином, PNG часто використовуються, якщо якість зображення повинна зберігатися, а розмір файлу не є проблемою. </p> <p> Хорошим правилом є збереження JPEG для фотографій та збереження PNG для зображень із прозорістю та нефотографічних зображень. Щоб отримати докладнішу інформацію про різні типи файлів (не тільки зображень), перегляньте наш посібник <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> знаючи, коли використовувати який формат файлу. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG та JPG - це однаковий формат файлу </h2> <p> Незважаючи на плутанину, яку JPEG спричинив своїми численними оновленнями та варіаціями, можливий потік цифрових зображень в Інтернеті в середині 90-х, безсумнівно, був спричинений головним чином його випуском. </p> <p> Наступного разу, коли ви будете готові експортувати фотографію із редактора зображень і перед вами з’явиться довгий список доступних форматів, просто пам’ятайте: JPEG та JPG - це одне і те ж. </p>"}