{"title":"Довгоочікувані повітряні теги можуть нарешті дебютувати в березні","content":"<p> Повідомляється, що Apple AirTags, мініатюрний відстежувач місцеположення ключів та інших дрібних предметів, починає з 2019 року. Однак через шість тижнів 2021 року Apple ще не оголосила про них - не кажучи вже про те, щоб розпочати доставку для клієнтів. </p> <p> Це може змінитися наступного місяця, на думку багаторічного підписувача Apple, Джона Проссера. У своєму твіті, надісланому в п&#39;ятницю, 12 лютого, Проссер стверджував, що &quot;AirTags все ще працюють на березень. Цього разу не чув про подальші затримки&quot;. </p> <h2 id=\"what-to-expect-from-airtags\"> Чого очікувати від AirTags </h2> <p> Проссер має на увазі попередню затримку, про яку він повідомляв наприкінці минулого року, до медіа-події Apple 13 жовтня. У той час Проссер зазначав <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800\" target=\"_blank\" rel=\"nofollow noopener\"> Twitter </a> що він чув від своїх (здавалося б, добре розташованих) джерел, що &quot;Apple відсунула оголошення та запуск AirTags до березня 2021 року&quot;. Через півроку, схоже, подальші затримки не зупинять випуск AirTags. Можна було б сподіватися, принаймні. </p> <p> Як повідомляється, AirTags використовуватиме надширокосмугову технологію Apple, щоб дозволити iPhone визначити своє точне місце розташування з високим ступенем точності. Вони нібито використовуватимуть як звукові сигнали, так і розширений віртуальний маркер, щоб точно показати, де знаходиться об&#39;єкт, прикріплений до AirTags. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Повітряні теги досі працюють у березні. <br><br> Цього разу не чув про подальші затримки. 🤞 </p> - Джон Проссер (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1360265330296250377?ref_src=twsrc%5Etfw\"> 12 лютого 2021 року </a></blockquote>  <p> Знайдеться окремі AirTags <a href=\"https://www.makeuseof.com/apple-find-my-items-hidden-tab/\" target=\"_blank\" rel=\"nofollow noopener\"> здійснюється через додаток iOS &quot;Знайти мене&quot; </a> , який також дозволяє користувачам відстежувати свої iPhone, iPad, Macs та інші пристрої Apple. AirTags стане конкурентом Apple популярним продуктам відстеження Bluetooth таких компаній, як Tile. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Отже, про AirTags. <br><br> Цей болить моє серце ... <br><br> Мені повідомляють, що Apple відсунула анонс та запуск AirTags до березня 2021 року. 😳 <a href=\"https://t.co/xtUvCAFmoE\"> https://t.co/xtUvCAFmoE </a> <a href=\"https://t.co/DIUlcp01Xy\"> pic.twitter.com/DIUlcp01Xy </a></p> - Джон Проссер (@jon_prosser) <a href=\"https://twitter.com/jon_prosser/status/1314480615476129800?ref_src=twsrc%5Etfw\"> 9 жовтня 2020 р </a></blockquote>  <p> Apple ще не оголосила спеціальну подію в березні, на якій можуть бути оголошені AirTags. Однак, якщо він все-таки приймає такий, який буде відповідати останнім рокам. Протягом шести з останніх 10 років Apple проводила подію в березні, на якій демонструвала нові продукти. </p> <p> Минулого року про цю подію ходили чутки, але вона не відбулася, швидше за все, через початок пандемії COVID-19 в США та інших регіонах. Однак, коли Apple перейшла на віртуальні події, це не завадить їй організувати іншу подію наступного місяця. Крім того, Apple може оголосити AirTags через прес-реліз. </p> <p> </p> <h2 id=\"expect-a-new-ipad-pro-as-well\"> Очікуйте також новий iPad Pro </h2> <p> Можливо, це також не єдиний новий продукт Apple наступного місяця. Проссер додатково відповів на запитання про наступний iPad Pro від Apple, сказавши, що він &quot;також [призначений] на березень, наскільки мені відомо&quot;. </p> <p> Хоча Проссер раніше помилявся, він має загальний вражаючий рекорд, коли справа доходить до точних оголошень Apple. Чи будуть серед них AirTags та iPad Pro наступного покоління? Недовго чекати, поки ми це дізнаємось. </p> <p> <small> Кредит зображення: iphonedigital / <a href=\"https://www.flickr.com/photos/137872055@N03/22522566994/\" target=\"_blank\" rel=\"nofollow noopener\"> Flickr </a></small> </p>"}