{"title":"LastPass обмежить вас одним типом пристрою, якщо ви не заплатите","content":"<p> LastPass, популярний менеджер паролів, зазнає значних змін. Незабаром ті, хто користується послугою безкоштовно, зможуть це робити лише на комп’ютерах або мобільних телефонах, але не в обох - якщо вони не заплатять. </p> <p> Це означає, що LastPass більше не є привабливим вибором як безкоштовний менеджер паролів. У світі, де ми постійно перемикаємось між комп’ютерами та мобільними телефонами, мати менеджер паролів, який працює лише для одного типу пристрою, марно. </p> <h2 id=\"what-s-changing-in-lastpass-free\"> Що змінюється у програмі LastPass Free? </h2> <p> Як було оголошено на <a href=\"https://blog.lastpass.com/2021/02/changes-to-lastpass-free/\" target=\"_blank\" rel=\"nofollow noopener\"> Блог LastPass </a> , відбудуться зміни щодо безкоштовної версії менеджера паролів. </p> <p> Наразі LastPass Free дозволяє користуватися послугою на всіх своїх пристроях. Незалежно від того, чи будете ви використовувати LastPass на комп’ютері, планшеті чи мобільному пристрої, неважливо. Все це безкоштовно. Це має змінитися 16 березня 2021 року. </p> <p> Відтоді LastPass Free включатиме необмежену кількість пристроїв одного типу: комп’ютери чи мобільні телефони. </p> <p> Для LastPass комп&#39;ютери класифікуються як будь-який настільний комп&#39;ютер або ноутбук, тоді як мобільні - мобільні телефони, планшети та розумні годинники. </p> <p> Коли ви вперше входите в систему LastPass 16 березня, вам потрібно буде встановити активний тип пристрою. </p> <p> <img alt=\"lastpass device support\" src=\"images/lastpass-device-support-250.png\" loading=\"lazy\"> </p> <p> Наприклад, якщо ви вибрали комп’ютери як тип пристрою, ви зможете використовувати LastPass на настільних і портативних пристроях. Однак, якщо ви хочете використовувати LastPass на будь-якому мобільному пристрої, вам доведеться оновити до LastPass Premium. </p> <p> Певним чином, це повернення до останнього LastPass. Можливість безкоштовно використовувати LastPass на настільних комп’ютерах та мобільних пристроях з’явилася лише в 2015 році. До цього вам потрібно було заплатити за мобільну підтримку. </p> <p> </p> <h2 id=\"lastpass-support-is-also-changing\"> Підтримка LastPass також змінюється </h2> <p> LastPass також змінює спосіб надання підтримки. З 17 травня 2021 року підтримка електронною поштою буде доступна лише для клієнтів Premium і Family. </p> <p> Безкоштовні користувачі застряжуть у довідкових статтях, доступних на веб-сайті підтримки LastPass, або вони можуть звернутися за допомогою до спільноти LastPass. </p> <p> <a href=\"https://www.makeuseof.com/tag/reasons-use-password-manager/\" target=\"_blank\" rel=\"nofollow noopener\"> Кожен повинен використовувати менеджер паролів </a> . Швидше за все, вам потрібно використовувати його на настільному та мобільному пристроях. LastPass це знає і робить ставку на оновлення користувачів до платної послуги, яка наразі знижується на 25% за $ 27 / рік. </p> <p> </p> <h2 id=\"is-it-time-to-change-password-manager\"> Чи час міняти менеджер паролів? </h2> <p> Якщо ви використовуєте LastPass Free, швидше за все, це змусило вас розглянути можливість переключення. Якщо так, то існує багато інших чудових менеджерів паролів, якими ви можете користуватися на всіх своїх пристроях безкоштовно. </p> <p> З іншого боку, можливо, ви вважаєте справедливим, що ви платите невелику суму LastPass на підтримку послуги, яку вона надає. </p>"}