{"title":"Останнє оновлення WatchOS захищає від помилки Apple Watch-Bricking","content":"<p> Останнє оновлення від AppleOS, версія програмного забезпечення 7.3.1, включає дуже важливе виправлення - усунення помилки, через яку деякі пристрої Apple Watch Series 5 та Apple Watch SE не заряджаються, коли вони переходять у режим Power Reserve. </p> <p> Компанія також запустила нову безкоштовну програму ремонту постраждалих пристроїв, які потрапили в пастку в цьому режимі низької потужності і не можуть вийти з неї. Ця помилка, по суті, &quot;цегли&quot; їх Apple Watch, роблячи її непрацездатною. </p> <h2 id=\"the-power-reserve-mode-bug\"> Помилка режиму енергозбереження </h2> <p> Режим енергозбереження запускається, коли Apple Watch розряджається. Це зупиняє взаємодію Apple Watch з вашим iPhone. Це також заважає користувачам отримувати доступ до інших функцій Apple Watch. Щоб вийти з режиму Power Reserve, користувачам потрібно зарядити Apple Watch. </p> <p> На <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> Сторінка підтримки про програму помилок та виправлення </a> від 15 лютого Apple починає із зазначення: </p> <blockquote> <p> Дуже невелика кількість клієнтів моделей Apple Watch Series 5 або Apple Watch SE, що працюють на watchOS 7.2 або 7.3, зіткнулася з проблемою, коли їх годинник не заряджається після входу в Power Reserve. </p> </blockquote> <p> Щоб дізнатись, чи є у вас модель Apple Watch, Apple рекомендує помістити годинник на зарядний пристрій і почекати принаймні 30 хвилин. Якщо плата не стягуватиметься, зв’яжіться зі службою підтримки Apple, і вони організують безкоштовний ремонт поштою. </p> <p> Годинники будуть перевірені, щоб перевірити, чи відповідають вони вимогам, і, за умови, що вони є, ремонт буде здійснено безкоштовно, а відремонтований годинник повернеться власникові. </p> <p> Неясно точно, скільки годинників Apple серйозно постраждали від помилки. Однак, схоже, проблема стосується лише підмножини моделей Apple Watch Series 5 або Apple Watch SE, а також жодних інших моделей. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> Як оновити до WatchOS 7.3.1 </h2> <p> Тим, хто не випробував цю помилку, все ж варто оновити її до останньої версії watchOS, щоб захистити себе від того, що це потенційно може статися. </p> <p> Важливість виправлення помилки вказує той факт, що Apple негайно витіснила watchOS 7.3.1 для всіх користувачів. Це на відміну від того, як зазвичай видає оновлення програмного забезпечення, роблячи їх спочатку доступними для розробників для бета-тестування. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple випустила watchOS 7.3 </a> наприкінці січня. </p> <p> Користувачі можуть завантажити watchOS 7.3.1 за допомогою програми Apple Watch на iPhone. Для цього вони повинні піти до <strong> Загальне&gt; Оновлення програмного забезпечення </strong> . Для оновлення ваш Apple Watch повинен мати принаймні 50 відсотків заряду акумулятора. Він також повинен знаходитися в безпосередній близькості від вашого iPhone. </p>"}