{"title":"Веб-переглядач Microsoft Edge був власником секретних емуляторів ігор Nintendo","content":"<p> Microsoft зняла серію нелегальних емуляторів ігор, які ховаються у своєму магазині розширень браузера Microsoft Edge. У магазині розширень Microsoft Edge було розміщено десятки емуляторів, що дозволило користувачам грати в кілька знакових ігор, жодна з яких не була розміщена в магазині законно. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft видаляє незаконні емулятори розширення краю </h2> <p> У магазині розширень Microsoft Edge опинилися одні з найбільш знакових ігор усіх часів, включаючи Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2 і навіть Minecraft. Кожна гра, запущена у браузері у вікні емулятора, і дозволяла користувачам повністю переглядати кожну назву. </p> <p> Однак жоден з класичних назв не вказав офіційних розробників ігор, таких як Nintendo, Sega, Atari та так, навіть Microsoft. Перелічені імена розробників включали Gamelands, Kday та StayReal, всі вони є повністю вигаданими та не мають посилань на оригінальних розробників. </p> <p> Як не дивно, але офіційний обліковий запис Microsoft Edge Development Twitter, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , розміщений про емулятори, що з&#39;являються для просування ігор, доступних у магазині розширень браузера. Ми не знайшли оригінального твіту, що рекламує емулятори, але копія доступна через <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Ресетера </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> Чи емулятори нелегальні? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Емулятори дозволяють запускати різне програмне забезпечення </a> на вашому комп’ютері. Ви також можете використовувати емулятор для відтворення старих ігор. </p> <p> Хоча самі емулятори не є незаконними, завантаження вмісту, захищеного авторським правом, для відтворення на емуляторі є. Твіт з офіційного облікового запису Microsoft Edge Development був дивним кроком, оскільки емулятори завантажили свіжу копію ігрового ПЗ для користувача. </p> <p> Тема відмови від програм також є дещо сірою зоною. Ігри, від яких відмовляються, більше не публікуються і більше не доступні для продажу в Інтернеті чи в магазині. Однак у багатьох випадках авторські права на ці ігри не втратили чинність, але власник авторських прав не активно застосовує свої права. </p> <p> </p> <p> У багатьох випадках відмова від програмного забезпечення є незаконною. Тим не менше, немає судових справ, пов’язаних із abandonware, або, принаймні, жодного, що стосується старого розробника гри, який переслідував когось за завантаження заголовка abandonware. </p> <p> У цьому точному прикладі емуляція цих старих ігор у веб-браузері є незаконною. Крім того, Nintendo відомий видаленням будь-яких сайтів або служб, які намагаються відтворити або перерозподілити його інтелектуальну власність. </p> <p> Наразі ігри вилучено з магазину розширень Microsoft Edge. Більше того, поки невідомо, як емульовані ігри потрапляли в магазин розширень або хто їх там розміщував. Що й казати, вони навряд чи повернуться. </p>"}