{"title":"Microsoft запускає Azure у космос за допомогою космічного комп’ютера-2 HPE","content":"<p> Microsoft виходить за межі планети, щоб надавати позаземні послуги. Компанія співпрацюватиме з Hewlett Packard Enterprises для підключення до ПК на Міжнародній космічній станції (МКС) через свою платформу Azure. </p> <p> Космічний комп’ютер-2 під’єднається до Azure через наземні станції NASA та HPE, забезпечуючи космічній станції значну потужність для обробки даних. </p> <h2 id=\"azure-heads-into-space\"> Лазурні голови у космос </h2> <p> Як повідомлялося далі <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> блог Microsoft Azure </a> , космічний комп’ютер-2 (SBC-2) забезпечить астронавтів МКС технологіями, більш схожими на їхні наземні аналоги. </p> <p> Сподіваємося, що це різко зменшить кількість часу, необхідного для передачі даних між МКС і Землею, а також зменшить пропускну здатність, необхідну для обробки та аналізу. </p> <blockquote> <p> Космонавти та дослідники космосу заслуговують на доступ до найкращих технологій хмарних обчислень та вдосконаленої обробки на найвищому рівні. Іноді аналіз потрібно робити негайно на краю, де враховується кожен момент, а інколи аналіз настільки масивно складний, що його можна виконати лише за допомогою потужності гіпермасштабної хмари. </p> </blockquote> <p> Spaceborne Computer-2 використовує систему Edgeline Converged Edge від Hewlett Packard Enterprises, яка &quot;спеціально розроблена для суворих крайових умов&quot; і забезпечить купу функціональних можливостей Azure на МКС. </p> <p> Коли зв&#39;язок буде встановлений і запущений, SBC-2 дозволить проводити дослідження в районах, включаючи моделювання погоди для майбутніх місій на Марсі, аналіз рослин та гідропоніки для підтримки росту їжі та врожаю в космосі та медичну візуалізацію на самій МКС (для підтримки охорони здоров&#39;я космонавтів) ). </p> <p> Доктор Марк Фернандес, архітектор рішень систем збіжних країв у HPE та головний дослідник космічного комп&#39;ютера-2, сказав: </p> <blockquote> <p> Об’єднавши космічний комп’ютер-2 HPE, який базується на системі Converge Edge HPE Edgeline для вдосконалених обчислень краю та можливостей штучного інтелекту, та Microsoft Azure для підключення до хмари, ми даємо можливість космічним дослідникам безперешкодно передавати великі набори даних до та з Земля та вигода від досвіду від хмари </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> Наступна фаза ініціативи Microsoft Azure Space </h2> <p> Оголошення Microsoft - ще один крок вперед для цього <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Azure Space </a> ініціатива, яку вона розпочала у жовтні 2020 року. </p> <p> Ініціатива Azure Space - це зусилля Microsoft зробити &quot;наступний гігантський стрибок у хмарних обчисленнях&quot;, вивівши в космос свою платформу хмарних обчислень Azure. </p> <p> </p> <p> Раніше Azure Space працював із проектом SpaceX Starlink для доставки супутникової широкосмугової мережі до свого Модульного центру обробки даних (MDC) і продовжує роботу над проектом Azure Orbital, який розширить зв&#39;язок між своїми хмарними центрами обробки даних за допомогою супутникової технології. </p>"}