{"title":"Microsoft намагалася придбати Pinterest, але угода вимкнена ... Поки що","content":"<p> Нещодавно Microsoft звернулася до Pinterest щодо потенційної угоди про поглинання, яка могла б стати одним з найбільших придбань Редмонда. В даний час переговори не ведуться, але масштаби пропонованого злиття ще більше позначають плани Microsoft щодо зростання. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft хоче придбати Pinterest </h2> <p> Як повідомляє <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Financial Times </a> , Microsoft зробила спробу придбати Pinterest, найбільший у світі фанат для любителів. </p> <p> В даний час Pinterest оцінюється приблизно в 51 млрд доларів, а його ринкова вартість зросла більш ніж на 600 відсотків за всю пандемію COVID-19, оскільки люди переходять в Інтернет під час блокування. Новини про потенційну угоду про поглинання збільшили акції Pinterest на 7 відсотків до відкриття ринків у четвер, 11 лютого. </p> <p> Цей крок призвів би Pinterest до постійно зростаючої стабільності основних технологічних поглинань. У 2016 році Microsoft придбала LinkedIn за угодою на 26 мільярдів доларів, а потім придбанням Github за 7,5 мільярда доларів у 2018 році. </p> <p> Це не кажучи вже про те, що Microsoft володіє Minecraft, придбала 2,5 мільярда доларів у 2014 році, і поточне придбання великого ігрового холдингу ZeniMax на 7,5 мільярда доларів. ZeniMax є материнською компанією таких ігрових студій, як Bethesda Softworks, id Software, Alpha Dog Games та Tango Gameworks. </p> <p> Крім того, існував <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> невдала спроба придбання TikTok&#39;s </a> Активи Північної Америки, Австралії та Нової Зеландії в середині 2020 року. Врешті-решт угода провалилася, але її вартість становила від 20 до 30 мільярдів доларів і відбулася після екс-президента <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Трамп погрожував забороною </a> соціальна мережа для обміну відео з США. </p> <p> Якщо угода з Pinterest пішла вперед або, якщо вона завершиться пізніше, це стане найбільшим придбанням Microsoft на сьогодні. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> Чому Microsoft скуповує стільки технічних компаній? </h2> <p> У Microsoft не вистачає грошей і хоче розширити свою імперію. Власні акції зросли приблизно на 80 відсотків з початку пандемії COVID-19 і нещодавно показали свої рекордні прибутки. </p> <p> </p> <p> Придбання іншої платформи, наприклад Pinterest, є квитком на дані для інших служб Microsoft. Величезний обсяг даних, що генеруються такими платформами, як LinkedIn, є ідеальним інструментом для навчання технологіям ШІ. Крім того, використання та управління такою величезною Інтернет-службою, як Pinterest, також служить рекламою для своєї платформи Azure. </p> <p> Як також натякає звіт Financial Times, розмови про таке величезне злиття між двома технологічними компаніями також поставлять на випробування адміністрацію президента Байдена. Чи рада нова адміністрація дозволити таким гігантам, як Microsoft, Google і Facebook, скуповувати конкуренцію? Тільки час покаже. </p>"}