{"title":"Microsoft випускає свій новий додаток Office для iPad","content":"<p> Microsoft випустила уніфіковану програму Office для планшета Apple. Завдяки цьому Word, Excel та PowerPoint тепер доступні як одне завантаження для iPhone та iPad у <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> Магазин додатків </a> . Корпорація Майкрософт все ще надає ці програми для iPad як самостійні програми для завантаження. </p> <h2 id=\"better-late-than-never\"> Краще пізно, ніж ніколи </h2> <p> &quot;Ми поєднуємо відомі вам програми Word, Excel та PowerPoint в єдину програму, оптимізовану для iPadOS&quot;, - пише Microsoft у примітках до випуску, що додаються до завантаження. Це чудова новина, якщо ви використовуєте Office і хочете працювати в дорозі. Для тих, хто хоче <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> перетворити їх iPad на заміну ноутбука </a> , це вирішальний випуск. </p> <p> Додатки доступні безкоштовно, але для редагування та інших розширених функцій потрібна передплата на Office 365. Тим, хто цікавиться, Microsoft пропонує різні варіанти підписки на додатки, починаючи з $ 6,99 на місяць. </p> <p> Якщо вам потрібен лише текстовий процесор на вашому iPad, можливо, краще розглянути альтернативні варіанти в <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> Огляд найкращих програм обробки текстів для iPad від MUO </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> Уніфікований досвід роботи з мобільним офісом </h2> <p> Щоб зрозуміти, це оновлення існуючого Office для iOS, а не абсолютно новий випуск. <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> все-в-одному додаток Office дебютувало на iPhone </a> та Android у лютому 2020 року. Незрозуміло, на що пішов Microsoft протягом цілого року, щоб додати в суміш оптимізовані для iPad версії Word, Excel та PowerPoint, але краще пізно, ніж ніколи. </p> <p> </p> <p> Раніше програми для продуктивності, що входили до набору, забезпечували додатковий досвід роботи на iPad, оскільки раніше працювали у віконному режимі. Але завдяки останньому оновленню, яке тепер доступне, клієнти Apple тепер можуть мати власний досвід роботи з Office на своїх iPhone, iPad або iPod touch незалежно від розміру екрана. </p> <p> </p> <h2 id=\"ipad-specific-features\"> Особливості iPad </h2> <p> Microsoft регулярно додає нові функції, оптимізовані для планшетів, до своїх мобільних пропозицій Office. Наприклад, мобільні версії Word, Excel та PowerPoint нещодавно отримали підтримку жестів миші та трекпада. Додатки також підтримують паралельну багатозадачність iOS `` Split View &#39;&#39;. </p> <p> Хоча мобільні та настільні видання Office не мають однакових функцій, новий Office для iOS пропонує кілька нових функцій. Вони дозволяють робити такі речі, як підписувати документи за допомогою Apple Pencil або пальця, швидко створювати PDF-файли з документів, перетворювати зображення в текст і таблиці тощо. </p> <p> </p> <p> Крім того, тепер ви можете легко вставляти дату, форму, зображення та нотатки в PDF-файли. Що стосується досвідчених користувачів, вони тепер можуть отримати доступ до дій Office на основі зображень (наприклад, Створити PPT, Створити PDF тощо) за допомогою багатоцільового меню спільного доступу iOS. &quot;Крім того, якщо під час відкриття програми Office з’являються нещодавні знімки екрана, вони з’являються як пропозиція перетворити їх у PDF або PPT&quot;, - зазначає компанія. </p> <p> Microsoft також внесе деякі зміни в свій пакет Office для Mac і Windows. За словами виробника Windows, майбутні оновлення Office для настільних ПК у 2021 році, крім інших удосконалень, матимуть безстрокові ліцензії. </p>"}