{"title":"Нове дослідження говорить, що користувачі Android роблять кращих партнерів, ніж користувачі iPhone","content":"<p> Між користувачами смартфонів iPhone та Android триває безперервна битва. Навіть ті, хто не бере участі в битві, вибрали сторону, лише вибравши свій смартфон. </p> <p> У битві є нова зморшка, як <a href=\"https://www.comparemymobile.com/features/phone-alone\" target=\"_blank\" rel=\"nofollow noopener\"> Порівняйте MyMobile </a> нещодавно провів дослідження щодо того, чи покращують стосунки користувачі iPhone або Android. Як виявляється, користувачі iPhone, як правило, мають більш дратує телефонні звички, ніж користувачі Android, що призводить до висновку, що користувачі Android роблять кращих партнерів. </p> <p> Звичайно, у даних є щось більше, ніж цей простий висновок, тому давайте заглибимось трохи глибше і подивимось. </p> <h2 id=\"iphone-and-android-relationship-study\"> Дослідження стосунків iPhone та Android </h2> <p> Загальний висновок дослідження полягає в тому, що користувачі Android роблять кращих партнерів, ніж користувачі iPhone, але результати набагато глибші, ніж цей поверхневий висновок. Загалом дослідження обстежило понад 2000 користувачів, тому воно пропонує досить великий обсяг вибірки. </p> <p> Розглядаючи найбільш надокучливі звички смартфонів, дослідження показало, що користувачі iPhone мали на 12 відсотків більше шансів вчинити правопорушення, ніж їх колеги, що володіють Android. Насправді користувачі iPhone здійснювали більше жорстокості щодо використання телефону, ніж користувачі Android, у кожній окремій категорії опитування. </p> <p> <img alt=\"Phone Alone study\" src=\"images/phone-alone-study-478.png\" loading=\"lazy\"> </p> <p> Деякі приклади прикрих правопорушень включають залишення партнера читати, користування телефоном під час кінофільму та навіть використання телефону під час руху (що не тільки дратує, але й неймовірно небезпечно). Користувачі iPhone навіть частіше падають і ламають свої телефони, ніж користувачі Android, що є справді дивовижною статистикою. </p> <p> Деякі інші прикрі звички включають <a href=\"https://www.makeuseof.com/tag/social-media-detox/\" target=\"_blank\" rel=\"nofollow noopener\"> повзаючи по профілях соціальних мереж інших людей </a> , використання надмірних фільтрів на фотографіях, надсилання кількох однорядкових повідомлень (я знаю, що я роблю це занадто багато) та використання їх телефону під час розмови. </p> <p> Цікаво, що дослідження також виявило, що чоловіки частіше виконують більшість настирливих (а в деяких випадках і зовсім небезпечних) звичок, ніж жінки. </p> <p> </p> <h2 id=\"but-apple-users-get-more-dates\"> Але користувачі Apple отримують більше дат </h2> <p> Згідно з іншим дослідженням, опублікованим компанією CompareMyMobile, користувачі iPhone частіше отримують побачення в додатках для знайомств в Інтернеті. Дослідження, в якому було розглянуто понад 50 000 ударів, показало, що користувачі iPhone мають на 76 відсотків більше шансів отримати побачення, ніж ті, хто має телефон Android, коли розмовляють через програму знайомств. </p> <p> <img alt=\"Phone Alone Study 2\" src=\"images/phone-alone-study-2-423.png\" loading=\"lazy\"> </p> <p> Якщо вірити першому дослідженню, стосунки можуть не скластись через те, що користувач iPhone закрадає інші профілі соціальних мереж і надсилає текстові повідомлення під час руху. І все-таки вони частіше знаходять свого наступного партнера, коли попередні стосунки не склалися. </p> <p> Зрештою, побачення ніколи не бувають простими. Тож робіть все можливе, щоб телефон не перетворився на пристрій, що вбиває добру річ! </p>"}