{"title":"Співзасновник Netflix критикує стратегію Apple TV + Video","content":"<p> Екс-керівник Netflix Марк Рендолф порушив відео стратегію Apple, заявивши, що Apple TV + відстає від конкуренції через безкоштовні пропозиції компанії та відсутність переконливого контенту. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple не в потоковому ефірі &quot;З обома ногами&quot; </h2> <p> Якщо запитати колишнього генерального директора Netflix і співзасновника Марка Рендольфа, Apple TV страждає від проблеми з завантажувачем, яка сприяла анемічному зростанню служби порівняно з Netflix, Disney + та іншими успішними потоковими службами. </p> <p> Розмовляючи з <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Yahoo Finance </a> , він сказав, що Apple TV + витрачає енергію на рекламні акції та безкоштовні пропозиції, тоді як йому слід зосередитись на додаванні більш якісного контенту для підвищення вартості. </p> <blockquote> <p> Якби Apple витратила на чверть стільки часу на вміст, скільки вони витрачають на роздачі, вони справді могли б грати. У них немає виправдання [і] вони все ще не входять обома ногами. Їм справді доводиться робити підприємницьку справу і підніматися до краю скелі і стрибати. </p> </blockquote> <p> Стрибнути з обриву може бути простіше сказати, ніж зробити, оскільки Apple TV + не має ринкової сили Діснея та визнання бренду Netflix. Зараз це все про <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Дісней + проти Netflix </a> і яка послуга потокового передавання пропонує найкраще співвідношення ціни та якості для потенційних клієнтів. </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV + має найвищий показник відтоку </h2> <p> Рендольф виступає проти роздач та акцій на потоковому ринку, припускаючи, що Apple TV + ‌ має &quot;найвищий показник відтоку&quot; серед основних послуг. </p> <blockquote> <p> Ви не можете продовжувати замінювати людей. Ви повинні дати їм причину залишитися. </p> </blockquote> <p> MoffettNathanson-HarrisX виявив, що 29 відсотків тих, хто підписався через безкоштовну програму, не планують переписуватись, коли закінчується їх безкоштовна пробна версія, як повідомляє <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> Різноманітність </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> Безкоштовні пропозиції Apple TV + </h2> <p> Apple пропонує 12 місяців безкоштовного обслуговування Apple TV + усім, хто придбає у компанії новий пристрій, подібний до нового iPhone. Тим часом, <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple продовжила безкоштовну річну підписку </a> двічі для тих, хто підписався у 2019 році. </p> <p> </p> <p> Це явний сигнал, що сама компанія Apple не вважає, що служба надає достатньо вмісту, щоб виправдати ціну, яка вимагається в розмірі 5 доларів на місяць. Подивіться на це по-іншому: якби Apple TV + перевищив внутрішні прогнози, Apple вже похвалилася б номерами абонентів. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney + та Netflix забезпечують серйозну конкуренцію </h2> <p> Лише 15 місяців тому Apple TV + дебютував у листопаді 2019 року. Незабаром після цього з’явився Disney +. Apple не повідомляє, скільки платних підписників має Apple TV +, але Disney щойно перевищив 94 мільйони передплатників, що значно перевершило навіть власні очікування. </p> <p> Для порівняння, наприкінці 2020 року Netflix нарахував 204 мільйони платіжних клієнтів. Дісней сподівається, що лише за 12 місяців він зможе зрівнятися з Netflix за кількістю передплатників. </p> <p> </p> <p> Рендольф каже, що Disney + &quot;пробився до справді міцної позиції&quot; завдяки вмісту. &quot;Це справді війна того, хто готовий робити вміст&quot;, - додав він. </p> <blockquote> <p> Ми бачимо, як розробляються нові правила гри. Це не просто оголошення, це не просто просування по службі - вам потрібно продемонструвати, що у вас є вміст, контент, контент. </p> </blockquote> <p> Дійсно, гра стосується змісту. Наприклад, як зазначено в <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> свої плани на 2021 рік </a> , Netflix запускатиме новий оригінальний фільм щотижня протягом року. На відміну від них, на Apple TV + є кілька таких фільмів, як драма &quot;Грейхаунд&quot;, знята Томом Хенксом (за мотивами справжніх подій), оригінальна драма &quot;Палмер&quot; у головній ролі з Джастіном Тімберлейком та &quot;На скелях&quot; Софії Копполи. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> Повільний підхід Apple </h2> <p> Чого Рандольф не визнає, так це те, що Netflix і Disney + мали величезну кількість вмісту з першого дня, тоді як Apple TV + створює свою бібліотеку вмісту з нуля. </p> <p> Apple, очевидно, зупинила свій вибір на підході повільного горіння, про що свідчить нестача шоу щодо Disney + та Netflix. Як би ви на це не дивились, його стратегія з Apple TV +, схоже, вимагає заманювання людей безкоштовними пропозиціями, сподіваючись, що послуга накопичує достатньо якісного вмісту, щоб перетворити безкоштовних клієнтів на платних абонентів. </p>"}