{"title":"Parler повертається в Інтернет після місячного вимкнення","content":"<p> Після відключення від Big Tech Парлер нарешті з’явився в Інтернеті. Платформа &quot;вільного слова&quot; тепер доступна існуючим користувачам і незабаром почне приймати реєстрації нових користувачів найближчими тижнями. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler відновлюється після великого технічного затемнення </h2> <p> Парлер повернувся після тривалого затемнення. Альтернативна соціальна мережа набирала популярності серед політичних консерваторів і була такою <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> завантажується Amazon Web Services (AWS), Google і Apple </a> після Капітолійських заворушень. Парлера звинуватили в тому, що він не робив достатньо для модерування насильницького вмісту, що призвело до його видалення з магазинів додатків та Інтернету. </p> <p> Замість AWS Parler зараз використовує хост SkySilk. Сайт також зареєстрував своє доменне ім&#39;я в Epik, реєстраторі, який обслуговує інші види мереж &quot;вільного слова&quot;, таких як Gab. </p> <p> Новий реєстратор хостів та доменів - не єдині зміни, які Parler вніс - Parler навіть з’явився з новим тимчасовим генеральним директором. Це відбувається після <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> команда Parler нібито звільнила співзасновника Джона Матце </a> . </p> <p> Марк Меклер тимчасово замінить Матце на посаді генерального директора, а раніше був співзасновником правої групи &quot;Патріоти чаювання&quot;. У заяві, отриманій <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> Пагорб </a> , Меклер оголосив про довгоочікуване повернення Парлера, сказавши: </p> <blockquote> <p> Коли в січні Парлер був відключений від мережі тим, хто бажає замовкнути десятки мільйонів американців, наша команда зібралася, рішуча виконати обіцянку нашій високозаангажованій спільноті, що ми повернемося сильнішими, ніж будь-коли. Ми раді вітати всіх. </p> </blockquote> <p> Меклер продовжив далі, зазначивши, що Парлер і надалі буде відданий &quot;свободі слова, конфіденційності та громадянському діалогу&quot;. Він також запевнив користувачів, що &quot;Parler управляється досвідченою командою, і він тут, щоб залишитися&quot;. </p> <p> Незважаючи на те, що старі облікові записи на платформі створюються резервні копії, старіші публікації (або &quot;парлеї&quot;) не були відновлені. Якщо у вас вже є обліковий запис у Parler, ви можете продовжувати користуватися сайтом. В іншому випадку вам доведеться почекати близько тижня, поки зможете зареєструватися. </p> <p> Але навіть якщо у вас вже є обліковий запис Parler, ви можете зіткнутися з деякими технічними труднощами під час використання платформи. Здається, сервіс ще не відновлений повністю. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> Додаток Parler все ще залишається в Лімбо </h2> <p> Parler все ще заборонений у магазинах Google Play та Apple App Store, що може серйозно зашкодити його базі користувачів. В даний час платформа може залишатися недоступною для мобільних пристроїв протягом невідомої кількості часу. </p> <p> Швидше за все, він не зможе повернутися до Play Store або App Store, якщо не змінить свою політику модерування, що Parler, швидше за все, відмовиться робити. </p>"}