{"title":"Контролер PS4 не працює? Як виправити найпоширеніші проблеми","content":"<p> Здебільшого ваш контролер PlayStation 4, ймовірно, працює нормально. Але коли ваш DualShock 4 перестає підключатися або випадково відключається, це засмучує. </p> <p> Давайте розглянемо виправлення, коли ваш контролер PS4 не працює, щоб ви могли повернутися до гри. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> Контролер PS4 не буде з&#39;єднуватися в пару або підключатися </h2> <p> Зазвичай, коли ви натискаєте <strong> Кнопка PS </strong> на вашому контролері, він повинен увімкнутись і підключитися до вашої системи. Однак, коли він не підключається, ви натомість трохи побачите світлову панель на контролері, а потім вимкнетесь. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Зазвичай це трапляється, якщо ви використовували DualShock 4 з іншим пристроєм. Наприклад, якщо ви <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> з&#39;єднайте свій контролер PS4 з ПК </a> або консоль друга, вона запам&#39;ятає цей пристрій вперед. </p> <p> У цих випадках вам потрібно буде повторно створити пару DualShock 4 із власною PS4. Для цього підключіть контролер до PS4 за допомогою кабелю micro-USB. Переконайтеся, що ви використовуєте високоякісний кабель, який, на вашу думку, працює належним чином. </p> <p> </p> <p> Натисніть кнопку <strong> Кнопка PS </strong> на мить на вашому контролері, і світло повинно коротко блимати, перш ніж посиніти. Це означає, що ваш контролер успішно створив пару та підключився. </p> <p> Якщо ваш DualShock 4 у парі з іншим поруч пристроєм, наприклад телефоном або PlayStation 5, це, швидше за все, увімкне і підключить контролер до цього пристрою. Таким чином, вам слід вимкнути та відключити будь-який пристрій, до якого ваш DualShock 4 підключений спочатку. </p> <p> Після повторного з&#39;єднання контролера ви можете від&#39;єднати USB-кабель і використовувати контролер бездротовим способом, як зазвичай. Ваш PS4 запам’ятає його, доки в майбутньому ви не з’єднаєте контролер з іншим пристроєм. </p> <p> Майте на увазі, що максимальну кількість контролерів DualShock 4, які ви можете підключити до PS4 одночасно, становить чотири. Якщо у вас вже підключено чотири контролери, вам доведеться від’єднати один, щоб звільнити місце для нових. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> Контролер PS4 продовжує відключатися </h2> <p> Якщо ваш DualShock 4 випадково відключається під час гри, є кілька засобів, які ви можете спробувати. </p> <p> Спочатку переконайтеся, що акумулятор контролера заряджений. Це звучить просто, але якщо акумулятор у вашому контролері майже розряджений, він може від’єднатися. Щоб перевірити час автономної роботи контролера, утримуйте кнопку <strong> Кнопка PS </strong> щоб відкрити швидке меню в лівій частині екрана. Внизу ви побачите піктограму контролера з дисплеєм батареї. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Підключіть свій контролер до PS4 і знову відвідайте швидке меню, щоб переконатися, що ви бачите анімацію заряду акумулятора. Після того, як контролер зарядиться деякий час, спробуйте використовувати його як зазвичай. </p> <p> Якщо акумулятор не був вашою проблемою, переконайтеся, що ви не намагаєтесь використовувати контролер занадто далеко від системи. Типовий діапазон Bluetooth становить близько 30 футів; залежно від налаштувань, ви можете використовувати контролер далі, ніж цей, або обмежитися його використанням ближче. </p> <p> Говорячи про це, спробуйте мінімізувати перешкоди між контролером та консоллю. Видаліть між ними будь-які металеві предмети, такі як стелажі або ноутбуки, які можуть перешкоджати сигналу. Вам також слід вийняти PS4 з будь-якого закритого простору, де він знаходиться, для кращої передачі та прийому сигналу. </p> <p> Нарешті, пам’ятайте, що PS4 має налаштування, що вимикають контролери після того, як вони деякий час не працюють. Якщо ви не хочете, щоб контролер PS4 вимикався під час перегляду медіа-програм, таких як YouTube, перейдіть до <strong> Налаштування&gt; Налаштування енергозбереження&gt; Встановити час, поки контролери не вимкнуться </strong> і вибрати <strong> Ніколи </strong> . Зауважте, що це зарядить акумулятор навіть у режимі очікування. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> Загальні поради щодо виправлення контролера PlayStation 4 </h2> <p> Вище ми розглянули конкретні виправлення кількох поширених проблем DualShock 4. Далі, давайте розглянемо більш загальні способи вирішення проблем з контролерами PS4. Пройдіть їх, якщо вам потрібна додаткова допомога. </p> <h3 id=\"restart-your-console\"> 1. Перезапустіть консоль </h3> <p> Хоча більшість проблем з контролером пов&#39;язані з самим контролером, існує ймовірність, що проблема у вашому PS4. Щоб виключити це, слід перезапустити консоль перед подальшим усуненням несправностей. </p> <p> Якщо ваш контролер працює достатньо для доступу до меню, утримуйте клавішу <strong> Кнопка PS </strong> щоб відкрити швидке меню, а потім перейдіть до <strong> Живлення&gt; Перезапустіть PS4 </strong> перезавантажити систему. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> Якщо ваш контролер не співпрацює, натисніть і утримуйте <strong> Потужність </strong> на консолі PS4, доки не пролунає два звукові сигнали. Це повністю вимкне його (спереду жодних ліхтарів) - після вимкнення натисніть кнопку <strong> Потужність </strong> ще раз, щоб увімкнути його знову. </p> <p> Спробуйте використовувати контролер ще раз після перезавантаження та перевірте, чи це допомагає. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. Забудьте та повторно підключіть свій контролер PS4 </h3> <p> Якщо у вас є другий контролер PS4 (або контролер PS Move), ви можете використовувати його для доступу до меню, яке дозволяє видалити контролер, що має проблему. Направлятися до <strong> Налаштування&gt; Пристрої&gt; Пристрої Bluetooth </strong> і виберіть <strong> DualShock 4 </strong> запис - це той, у якого поруч немає зеленого світла. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> У меню, що вийшло, натисніть <strong> Варіанти </strong> кнопку на контролері та виберіть <strong> Забути пристрій </strong> . Це призведе до того, що ваш PS4 вилучить його з пам’яті, тому вам доведеться повторно створити пару. </p> <p> Це сприятливий час, щоб спробувати дещо інший метод сполучення: повторно створити пару під час запуску. Для цього вимкніть PS4 (як пояснювалося раніше). Після вимкнення підключіть проблемний контролер до консолі за допомогою кабелю USB. Хіт <strong> Кнопка PS </strong> сподіваємось, увімкнути та з&#39;єднати контролер в один процес. </p> <p> Якщо це не допомогло, увімкніть PS4 знову та спробуйте створити пару, як описано вище. </p> <h3 id=\"hard-reset-your-controller\"> 3. Апаратно скиньте контролер </h3> <p> Якщо видалення та повторне з&#39;єднання контролера не спрацювало, ви можете спробувати виконати повну процедуру скидання для DualShock 4. Для цього вам знадобиться невеликий загострений предмет, наприклад, зігнута скріпка або інструмент для виймання SIM-картки. . </p> <p> Вимкніть PS4, а потім переверніть контролер. Поруч із гвинтом кнопкою L2 ви побачите маленький отвір (з правого боку контролера при перевертанні). За допомогою гострого інструменту натисніть і утримуйте кнопку всередині цього отвору приблизно п’ять секунд. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> Після цього знову підключіть контролер до PS4 за допомогою USB-кабелю та перевірте, чи він успішно поєднується. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Спробуйте контролер в іншому місці </h3> <p> На цьому етапі, якщо ви цього ще не зробили, спробуйте використати контролер, який має проблеми з іншим пристроєм. Якщо у вас є подібні проблеми на PS4 друга або на вашому ПК, то ваш контролер, ймовірно, несправний. </p> <p> Також є гарна ідея спробувати інший контролер PS4 за допомогою консолі, якщо це можливо. Якщо ви позичите подругу DualShock 4, яка, на вашу думку, працює належним чином, і виявите, що у неї проблеми з вашою системою, можливо, щось не так з бездротовим підключенням вашого PS4. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Використовуйте контролер у дротовому режимі </h3> <p> Перш ніж відмовитися від контролера, спробуйте пограти з ним, постійно підключеним за допомогою кабелю USB. Однак майте на увазі, що це працює лише для оновленої моделі контролерів PS4. Ви знаєте, що у вас є ця модель, якщо всередині сенсорної панелі на передній панелі контролера є світла смуга. Якщо ні, ви не можете примусити дротовий зв&#39;язок. </p> <p> Якщо у вас його ще немає, придбайте довгий кабель, щоб ви все ще могли насолоджуватися іграми з дивана. <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Айлун три упаковки </a> 10-футових кабелів micro-USB є хорошим економічним варіантом. </p> <p> Щоб змусити ваш PS4 підключати контролери через USB, перейдіть до <strong> Налаштування&gt; Пристрої&gt; Контролери&gt; Метод зв&#39;язку </strong> і вибрати <strong> Використовуйте USB-кабель </strong> . Це не дозволить DualShock 4 використовувати Bluetooth, навіть коли він підключений через USB. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> Параметри виправлення апаратного забезпечення DualShock 4 </h2> <p> Як і більшість апаратних засобів, контролери DualShock 4 мають річну гарантію. Якщо ви придбали свій контролер PS4 протягом останнього року і не можете виправити його за допомогою всіх вищевказаних порад, вам слід відвідати <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> Сторінка виправлення та заміни PlayStation </a> надіслати запит на ремонт вашого контролера. </p> <p> В іншому випадку ви можете самостійно спробувати виправити апаратне забезпечення, відкривши контролер. Але залежно від конкретного питання це може бути важко або неможливо. Ми рекомендуємо звернутися до місцевого майстра з ремонту, якщо вам неприємно це робити самостійно. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> Проблеми з контролером PS4, виправлені </h2> <p> Тепер ви знаєте, як виправити найпоширеніші проблеми з контролером PS4. Більш конкретні проблеми, такі як кнопка, яка перестає працювати, на жаль, потрапляють до вищезазначених рішень апаратного виправлення. </p> <p> Сподіваємось, вашу проблему було легко виправити. Але якщо ні, і вам потрібно взяти новий контролер PS4, у вас є безліч чудових варіантів. </p> <p> <small> Кредит зображення: Joeri Mostmans / <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}