{"title":"Roku бажає ваших думок на своєму акумуляторному пульті дистанційного керування","content":"<p> Roku наймає деяких людей для участі в Програмі дочасного доступу, щоб протестувати новий пульт дистанційного керування (який називається Roku Voice Remote Pro) з акумуляторною батареєю. </p> <p> Пропозиція обмежена в часі до закінчення витрат, хоча вам все одно доведеться платити за пульт. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> Що таке Roku Voice Remote Pro? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> Нарешті пульт з акумуляторною батареєю </a> від <a href=\"https://www.reddit.com/r/Roku/\"> Року </a> </blockquote>  <p> Як вперше помітив користувач Kingtut206 на <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , Roku набирає людей до своєї Програми раннього доступу, щоб протестувати новий пульт, який називається Roku Voice Remote Pro. </p> <p> Новий пульт оснащений акумуляторною батареєю, загубленим пультом пошуку (наприклад, ви можете сказати &quot;Гей Року, знайди мій пульт&quot;), голосом гучного зв&#39;язку та особистими кнопками швидкого доступу поряд із стандартними фірмовими кнопками. </p> <p> Як повідомляв <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> Грань </a> , пульт дистанційного керування заряджається через micro-USB, а не набагато вищий USB-C. Можливо, відгуки, зібрані в рамках Програми раннього доступу, це підтвердять. </p> <p> Участь у програмі відбувається лише за запрошеннями, хоча невідомо, що робить вас кваліфікованим. </p> <p> Пульт коштує $ 29,99, і очікується, що його поставлять 19 лютого 2021 року. </p> <p> Буде продано лише 2000 одиниць, і Roku буде збирати відгуки про ваш досвід роботи з пультом дистанційного керування. Після цього ми можемо припустити, що пульт буде вдосконалений перед тим, як потенційно буде проданий у загальному продажу. </p>"}