{"title":"Звіт: Android 12 матиме одноручний режим","content":"<p> Ми офіційно дійшли до фази життєвого циклу Android 11, коли чутки про Android 12 починають виходити в повну силу. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> Розробники XDA </a> повідомив, що Google працює над режимом однієї руки для Android 12, що значно полегшить навігацію по телефону однією рукою. Незалежно від того, чи є у вас великі чи маленькі руки, це може відкрити абсолютно новий спосіб взаємодії з вашим пристроєм Android. </p> <p> Звичайно, багато виробників пристроїв і <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> розробники програмного забезпечення представили рішення для покращення зручності користування однією рукою </a> . Тим не менш, буде набагато приємніше використовувати його, коли він буде інтегрований безпосередньо в операційну систему. </p> <h2 id=\"android-12-s-one-handed-mode\"> Одноручний режим Android 12 </h2> <p> Згідно з повідомленням, Google планує додати функцію однієї руки до AOSP, що є відкритою версією Android, яку будь-які розробники програмного забезпечення можуть використовувати на своїх пристроях. Це також означає, що виробники, які ще не розробили власний режим однією рукою, матимуть простий спосіб впровадити цю функцію у свої пристрої. </p> <p> У звіті не вказувалося, чи вимагатиме Google від виробників телефонів використовувати функцію однієї руки Android 12, чи це буде необов’язково. </p> <p> Оскільки все ще неймовірно рано, ми точно не знаємо, як працюватиме режим однієї руки Android 12. Якщо колишня здатність Google додавати функції в операційну систему є свідченням, ми сподіваємось, що компанія добре виконає цю роботу. Google може вирішити зменшити весь екран до кута пристрою для зручного доступу. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> У звіті також зазначається, що режим однієї руки Android 12 матиме можливість активувати його, використовуючи традиційний режим із трьома кнопками, поряд із новим режимом жестової навігації. </p> <p> Як уже згадувалося, багато виробників смартфонів вже впровадили цю функцію у власну модифіковану версію Android. Наприклад, Huawei насправді намагався подати свою версію функції в AOSP, але Google відхилив її. Можливо, Google відмовився від цього, оскільки компанія знала, що має намір запропонувати власну версію функції. </p> <p> Оскільки цей витік є настільки раннім, жодна фотографія ще не демонструє цю функцію, тому нам доведеться почекати, поки Android 12 наблизиться до виходу. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Коли вийде Android 12? </h2> <p> На жаль, ми не знаємо точно, коли Android 12 буде представлений для широкої публіки (хоча це не буде деякий час). Ми також не знаємо точно, коли ця функція вийде для розробників або до бета-версій або стабільних версій Android. </p> <p> Як це завжди буває з новими функціями Android, нам доведеться почекати і перевірити, чи йдеться взагалі про ОС. </p>"}