{"title":"Смарт-картка здоров’я проти цифрового паспорта щеплень: в чому велика різниця?","content":"<p> Пандемія COVID-19 спричинила погіршення стану систем охорони здоров&#39;я. Зараз перспективи цифрових медичних паспортів та інтелектуальних медичних карток набирають темпів, коли уряди та бізнес намагаються повернутися до звичного стану. </p> <p> Отже, що таке розумна медична картка і чи це те саме, що паспорт здоров’я? </p> <h2 id=\"what-is-a-smart-health-card\"> Що таке Smart Health Card? </h2> <p> Смарт-карта здоров’я - це тонкий пластик із вбудованою мікросхемою інтегральної мікросхеми, що містить зашифровані дані. </p> <p> Розумним стає чіп, який діє як суперкомп’ютер. Мікросхема може бути запрограмована на виконання різних дій з численними програмами, тоді як зчитувачі, підключені до комп&#39;ютерної системи, можуть отримувати доступ до даних мікросхеми або оновлювати їх. </p> <p> Це може виглядати як кредитна картка, але функціонує по-різному. Інтелектуальна медична картка, що використовується у багатьох країнах Європи та у всьому світі, зберігає інформацію про охорону здоров’я, страхове покриття та інші життєво важливі медичні дані. </p> <p> </p> <h2 id=\"advantages-of-using-a-smart-health-card\"> Переваги використання смарт-картки здоров’я </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Охорона здоров’я у Франції: що таке &quot;Carte Vitale&quot;? <a href=\"https://t.co/5VVcTjZyxh\"> https://t.co/5VVcTjZyxh </a> <a href=\"https://t.co/6I0TCy70wg\"> pic.twitter.com/6I0TCy70wg </a></p> - FrenchEntrée (@FrenchEntree) <a href=\"https://twitter.com/FrenchEntree/status/738646709308379136?ref_src=twsrc%5Etfw\"> 3 червня 2016 р </a></blockquote>  <p> Серед багатьох інших переваг використання цієї системи, найважливішим є покращення критичної або невідкладної допомоги. Смарт-картки охорони здоров’я забезпечують негайний доступ до даних про стан здоров’я пацієнта або медичних карток у надзвичайних ситуаціях. </p> <p> Наприклад, аварійно-рятувальний персонал із портативним пристроєм для зчитування карток матиме негайну інформацію про пацієнта, який перебуває в машині швидкої допомоги до лікарні. Це ще важливіше, коли пацієнт втрачає свідомість, не реагує або просто не може повідомити респонденту інформацію про своє здоров&#39;я. </p> <p> Уявіть собі відповідача, який може переслати важливі дані про пацієнтів працівникам невідкладної допомоги до приїзду швидкої допомоги. Це допоможе співробітникам невідкладної допомоги підготувати необхідне для лікування пацієнта ще до прибуття. </p> <p> Швидка та ефективна передача даних про пацієнта під час критичної допомоги може значно покращити час реакції, тим самим врятувавши життя. </p> <h3 id=\"seamless-transfer-of-data\"> Безшовна передача даних </h3> <p> Використання цієї системи також забезпечує більш точну та плавну передачу інформації про пацієнта від персоналу невідкладної допомоги до медичних працівників у стаціонарній допомозі. </p> <p> Лікарям не доведеться покладатися на пам&#39;ять пацієнта <a href=\"https://www.makeuseof.com/tag/google-store-medical-data-cloud/\" target=\"_blank\" rel=\"nofollow noopener\"> отримати критичні медичні дані </a> , що зменшує ймовірність помилки. Окрім цього, система інтелектуальних карток здоров’я пропонує безперебійний обмін інформацією про пацієнтів між лікарями. </p> <p> Це зменшує ймовірність витоку важливих даних про пацієнта (які можуть бути використані для <a href=\"https://www.makeuseof.com/tag/the-10-pieces-of-information-identity-thieves-are-looking-for/\" target=\"_blank\" rel=\"nofollow noopener\"> крадіжки особистих даних </a> ). Це часто трапляється, коли інформація про пацієнта передається факсом, телефоном або електронною поштою. </p> <h3 id=\"easier-storage-and-retrieval-of-medical-records\"> Спрощення зберігання та отримання медичних записів </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"it\" dir=\"ltr\"> Tessera sanitaria: come richiederne un duplicato <a href=\"https://t.co/2GrFWpanC2\"> https://t.co/2GrFWpanC2 </a> <a href=\"https://t.co/JKR6ampnXq\"> pic.twitter.com/JKR6ampnXq </a></p> - CataniaToday (@CataniaToday) <a href=\"https://twitter.com/CataniaToday/status/1359189830937300995?ref_src=twsrc%5Etfw\"> 9 лютого 2021 року </a></blockquote>  <p> Система надає пацієнтам зручний, безпроблемний спосіб перенесення результатів лабораторних досліджень або записів лікаря. </p> <p> Це все одно, що мати базу даних медичної інформації - попередні тести, лікування та файли для страхового покриття - на невеликій картці в гаманці пацієнта. Більше не потрібно тягати папірці на прийом до лікаря. </p> <h3 id=\"reduces-medical-errors-and-duplicate-testing\"> Зменшує медичні помилки та повторюване тестування </h3> <p> Державна система охорони здоров’я може навіть отримати від цього вигоду, оскільки лікарські помилки та уникнення повторних тестів. За допомогою цієї системи можна мінімізувати медичні помилки, спричинені неправильним введенням даних, мовними бар&#39;єрами або порушенням комунікації. </p> <p> Помилка людини іноді може спричинити невідповідність пацієнтів та записів. Наявність інтелектуальної медичної карти дозволяє медичним працівникам легко зіставити пацієнта з правильними медичними картами. Це зменшує шанси мати дублікати записів або декілька надлишкових тестів, що може коштувати великих грошей. Це може заощадити системі охорони здоров’я зайві витрати. </p> <h3 id=\"more-accurate-verification-of-insurance-coverage\"> Більш точна перевірка страхового покриття </h3> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Сіті-брейк? Робоча поїздка? Свята? Для спокою завжди носіть свою європейську карту медичного страхування! <a href=\"https://t.co/31zoREZAEy\"> https://t.co/31zoREZAEy </a> <a href=\"https://twitter.com/hashtag/EHIC?src=hash&ref_src=twsrc%5Etfw\"> #EHIC </a> <a href=\"https://t.co/o05Jx8aIwq\"> pic.twitter.com/o05Jx8aIwq </a></p> - Європейська комісія 🇪🇺 (@EU_Commission) <a href=\"https://twitter.com/EU_Commission/status/893485278114992128?ref_src=twsrc%5Etfw\"> 4 серпня 2017 р </a></blockquote>  <p> Крадіжка медичної інформації стала серйозною проблемою в останні роки. Злочин передбачає шахрайське використання інформації про медичне страхування для доступу до медичних послуг або отримання відшкодування. Простіше кажучи, особа, на яку не діє поліс, може вкрасти чужу інформацію про медичне страхування, щоб отримати пільги. </p> <p> Порушення системи охорони здоров’я або медичного страхування часто витікає конфіденційну особисту інформацію, яку хакери можуть продати в темній мережі. ІПІ може включати інформацію про медичне страхування. </p> <p> Це те, що злодії використовують для доступу до медичних послуг, до яких вони не повинні мати доступу. Вони можуть придбати ліки, що відпускаються за рецептом, або подати шахрайські страхові вимоги за процедури, які ніколи не виконувались. </p> <p> Система інтелектуальних карток здоров’я може запобігти цьому, оскільки більшість використовують протоколи автентифікації та безпеки. Деякі можуть використовувати 2-факторну автентифікацію (2FA) або багатофакторну автентифікацію (MFA), тоді як інші мають біометричну функцію, яка перевіряє наявність відбитків пальців пацієнта для підтвердження своєї ідентичності. </p> <p> </p> <h2 id=\"disadvantages-of-using-a-smart-health-card-system\"> Недоліки використання системи смарт-карток здоров’я </h2> <p> Проблеми конфіденційності залишаються найбільшою проблемою, яка стримує користувачів від адаптації технологій для медичних цілей. Багато людей висловлювали занепокоєння щодо надання людям легкого доступу до безлічі конфіденційних даних, таких як лікування, записи про хвороби та ліки. І оскільки новини про те, що системи охорони здоров’я та страхування стають жертвами порушення даних, ці занепокоєння не зовсім безпідставні. </p> <p> Наявність усіх записів в одному місці може бути зручним, але єдиним <a href=\"https://www.makeuseof.com/tag/healthcare-new-attack-vector-scammers-id-thieves/\" target=\"_blank\" rel=\"nofollow noopener\"> порушення даних </a> може передати чутливі дані в чужі руки. </p> <h3 id=\"creating-digital-divide\"> Створення цифрового розділення </h3> <p> Тоді є питання створення цифрового розриву. Багато хто стверджує, що інтелектуальними картками здоров’я можуть користуватися лише лікарні та громади, які мають доступ до системи. Щоб скористатися цією технологією, лікарняна машина повинна підтримувати те саме програмне забезпечення, інтерфейс зчитувача смарт-карток і повинна підтримувати необхідне обладнання. </p> <p> Якщо говорити про обладнання, то тут також питання додаткових витрат. Обладнання для системи, програмне забезпечення для зчитувача та мережа з базою даних можуть коштувати мільйони, а їх обслуговування може коштувати ще більше. Навіть самі пластикові картки коштують грошей на виготовлення. </p> <p> Хто збирається сплатити початкові інвестиції? Крім того, як довго до того, як ці початкові інвестиції принесуть користь уряду та його громадянам? </p> <h3 id=\"bugs-and-power-failures\"> Помилки та відключення живлення </h3> <p> Звичайно, цей тип технології не захищений від помилок та збоїв або кібератак, які можуть спричинити витік даних. Один невідпакований пристрій у системі може стати шлюзом для зловмисного програмного забезпечення, яке може завдати шкоди мережі та базі даних. </p> <p> Також є занепокоєння щодо відключення електроенергії. Як це можна підтримати в громадах з обмеженою владою чи проблемами енергетичної інфраструктури? Навіть найскладніші енергосистеми можуть вийти з ладу під час великих катастроф. Уявіть, що під час катастрофи у вас немає доступу до медичних даних. </p> <p> </p> <h2 id=\"smart-healthcare-vs-digital-vaccination-passport\"> Smart Healthcare Vs. Паспорт цифрової вакцинації </h2> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Великі імена в галузі техніки та охорони здоров&#39;я, включаючи клініку Майо, Cigna&#39;s Evernorth та Microsoft, об&#39;єднуються для створення цифрового паспорта щеплень проти COVID-19. <a href=\"https://t.co/KgTVjq9lUe\"> https://t.co/KgTVjq9lUe </a> <a href=\"https://t.co/ZiJIE8xoTY\"> pic.twitter.com/ZiJIE8xoTY </a></p> - Здоров’я щогли (@MastAnalytics) <a href=\"https://twitter.com/MastAnalytics/status/1351683116990164993?ref_src=twsrc%5Etfw\"> 20 січня 2021 року </a></blockquote>  <p> Були розмови про цифровий паспорт вакцинації для поїздок та доступу до концертів або зборів після Covid. Незважаючи на те, що цифровий медичний паспорт може здатися схожим на розумні медичні картки, що використовуються в таких країнах, як Німеччина, Франція та Австрія, є ключові відмінності. </p> <p> </p> <p> По-перше, цифровий паспорт вакцини проти COVID-19 надаватиметься у формі цифрового сертифіката, завантаженого на телефон людини. Цифровий сертифікат або паспорт вакцини Covid - це пропуск із зазначенням імені та даних про вакцину Covid (дата введення, виробник вакцини, місце вакцинації). Це цифровий документ на одній сторінці зі штрих-кодом або QR-кодом, який можна сканувати в місцях входу. </p> <p> На відміну від інтелектуальної медичної картки, цифровий медичний паспорт не призначений як фізична пластикова картка. </p> <p> У ньому буде лише інформація, що стосується тестів на людину COVID-19, записів про щеплення та медичних закладів, де проводились ці щеплення та тести. Він не матиме всієї історії хвороби пацієнта. </p> <p> Ці цифрові паспорти здоров’я дадуть людям доступ до таких зборів, як концерти та робочі місця, де вони будуть контактувати з багатьма людьми, або дозволять їм в’їжджати до країн, коли подорожі отримають відчуття нормальності. Люди, у яких немає смартфона, можуть роздрукувати свої коди, відскановані в точці входу. </p> <h3 id=\"breach-of-privacy-and-curtailment-of-human-rights\"> Порушення конфіденційності та обмеження прав людини </h3> <p> Хоча багато хто прагне отримати удар, завантажити цифровий паспорт щеплень і повернутися до норми, деякі б&#39;ють на сполох щодо можливих наслідків впровадження цієї технології. Експерти та захисники прав людини застерігають розробників звертатися до потенційних питань конфіденційності даних та прав людини, які може мати паспорт вакцинації. </p> <p> Дослідження, опубліковані <a href=\"https://socialsciences.exeter.ac.uk/media/universityofexeter/collegeofsocialsciencesandinternationalstudies/lawimages/research/Policy_brief_-_Digital_Health_Passports_COVID-19_-_Beduschi.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Юридичний факультет Університету Ексетера </a> попереджає, як цей паспорт може обмежити основні права людини, включаючи право на приватне життя, свободу пересування та мирні зібрання. </p> <p> Згідно з повідомленням, проблема походить від використання в паспорті конфіденційної особистої інформації про здоров’я (як вона буде зберігатися, хто матиме до неї доступ?) Та як це може створити новий розрив між людьми залежно від їх стану здоров’я. </p> <p> Паспорт також може потенційно визначати або обмежувати ступінь користування особою правами і свободами. Експерти попереджають, що використання цифрових паспортів охорони здоров’я може поглибити нерівність між громадами, які мають негайний доступ до вакцин чи паспортів, та тими, хто їх не має. </p> <p> </p> <h2 id=\"future-of-healthcare\"> Майбутнє охорони здоров’я </h2> <p> Такі країни, як Франція, використовують розумні картки охорони здоров’я з 90-х років, а інші країни наслідували цей приклад на початку 2000-х. </p> <p> Впровадження цієї технології відбувалося досить повільно в таких країнах, як США, і основними проблемами були проблеми конфіденційності. Хоча прийняття цієї системи має багато переваг, є також кілька недоліків, які вимагають ретельного розгляду. </p>"}