{"title":"Камера Sony FX3 виявлена ​​через Twitter Leak","content":"<p> Минуло лише два тижні, як Sony оголосила про випуск Sony A1, камери 8,6 К, яка може захоплювати 50 Мп зображення зі швидкістю до 30 кадрів в секунду. Але хіба компанія трохи ще щось підбурює? </p> <p> Зараз у нас є лише припущення, але Sony може додати нову гладку і компактну камеру до своєї серії FX. </p> <h2 id=\"a-preview-of-the-sony-fx3\"> Попередній перегляд Sony FX3 </h2> <p> У середу Nokishita написав твіт із зображенням Sony FX3, камери, яка, можливо, хоче поставити виклик Canon EOS C70 та Pocket Cinema 6K від Blackmagic Design. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> ソ ニ ー FX3 の 画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> # 噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> - 軒 下 デ ジ カ メ 情報 局 (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> 10 лютого 2021 року </a></blockquote>  <p> Nokishita - японський технічний блог, який сумно відомий ранньою точною витоком майбутніх фото- та відеоапаратури. Незважаючи на те, що це не офіційне джерело жодної компанії з виробництва оптичних виробів, деякі люди доходять до того, що кажуть, що інформація, якою ділиться Нокісіта, також може бути підтверджена. </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> TechRadar </a> колись називав Нокісіту &quot;Дідом Морозом від камерних чуток&quot;. У відповідь на твіт вище, користувач Twitter @miemelaar запитав &quot;[це] це реально чи концепція?&quot; а @rauuru_san відповів: &quot;якщо Nokishita опублікує це, це справжня угода&quot;. </p> <p> Але навіть якби ми вважали, що витік даних відповідає дійсності, скільки інформації насправді залишає нам? </p> <p> Ми могли б припустити, що FX3 є частиною лінійки FX через свою назву, але камера має символ, який змушує багатьох спекулянтів розгубитись. Якщо ця біла позначка Альфа (α) на лицьовій стороні камери здається вам знайомою, це було б тому, що ви можете знайти ту саму таку саму на беззеркальних камерах Sony. </p> <p> То FX3 - це кінокамера, бездзеркальна камера чи якийсь гібрид у стилі дзеркальної камери? Доведеться чекати, поки з’являться більше деталей. До тих пір прочитайте нашу статтю на тему <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> ключові відмінності між дзеркальними камерами, дзеркальними дзеркальними фотокамерами та відеокамерами </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> Що принесе Sony FX3 до столу? </h2> <p> Відколи твіт Нокісіти впав, передбачувані технічні характеристики камери розлітаються по Інтернету. Поки що нічого з жодних джерел, які настільки ж авторитетні. </p> <p> На щастя, ми повинні дізнатись більше про Sony FX3 найближчими тижнями. Найбільша фотоподія в Японії, CP + 2021, відбудеться 25-28 лютого. </p>"}