{"title":"Twitter для позначення особистих рахунків державних службовців","content":"<p> Незабаром Twitter почне розміщувати ярлики на особистих рахунках державних службовців. Етикетки повинні допомогти користувачам легко ідентифікувати всіх, хто пов&#39;язаний з урядом. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Більше урядовців отримають ярлик у Twitter </h2> <p> Відповідно до повідомлення на <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> блог Twitter </a> , платформа розпочне маркування особистих рахунків &quot;глав держав&quot; 17 лютого 2021 року. Вона також буде наклеювати ярлики на акаунти, пов&#39;язані з афілійованими ЗМІ. </p> <p> Twitter також розширює охоплення своїх лейблів, щоб охопити урядовців у більшості країн. До них належать Канада, Куба, Еквадор, Єгипет, Німеччина, Гондурас, Індонезія, Іран, Італія, Японія, Саудівська Аравія, Сербія, Іспанія, Таїланд, Туреччина та Об’єднані Арабські Емірати. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Кредит зображення: Twitter </p> <p> Платформа сподівається, що ці ярлики допоможуть користувачам &quot;мати більш обізнаний досвід роботи в Twitter&quot;, а також планує допрацювати текст лейбла, щоб &quot;додати більше конкретності&quot; шляхом &quot;розмежування між особами та установами&quot;. </p> <p> Перша хвиля ярликів Twitter для облікових записів, пов’язаних з урядом, була розповсюджена в серпні 2020 року. Спочатку ці ярлики стосувались лише посадових осіб, пов’язаних із п’ятьма країнами Ради Безпеки ООН, і не включали особисті рахунки цих чиновників. </p> <p> Тим не менш, ці ярлики не є <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> відвертий удар через дезінформацію </a> , але вони все одно допоможуть користувачам отримати більше інформації про те, що вони читають, і від кого це походить. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter буде продовжувати лише розширювати свої етикетки </h2> <p> Наприкінці публікації у своєму блозі Twitter зазначив, що сподівається розширити свої етикетки на &quot;додаткові країни з часом&quot;. Етикетка відображається у вигляді блідо-сірого прапора в профілі людини в Twitter, і найімовірніше, ви будете стикатися з цим частіше в найближчі тижні. </p>"}