{"title":"Surface Duo отримує дату випуску у Великобританії та зниження ціни","content":"<p> Microsoft Surface Duo не мав такого фантастичного випуску, але, схоже, компанія прагне зробити перші враження за межами США. Компанія не тільки знижує ціни на Surface Duo, але і має підтверджену дату виходу на ринок Великобританії. </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> Підсумкові зарубіжні підготовки Microsoft до Surface Duo </h2> <p> Ця новина приходить до нас з <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . Якщо ви, можливо, пам’ятаєте, коли запускався Surface Duo, <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> він не отримав чудових відгуків </a> . Однією з основних проблем було те, наскільки глючить операційна система Duo, а іншим - її приваблива ціна - 1399,99 доларів. </p> <p> Microsoft наполегливо працювала над вирішенням основних проблем, які виявили рецензенти, але її висока ціна все ще залишалася там, де була. Однак Microsoft планує дати Surface Duo значне зниження ціни до $ 999,99. </p> <p> Це падіння, ймовірно, готується до виходу за кордон, оскільки критики у всьому світі готуються розбивати Surface Duo дюйм за дюймом. Завдяки цій зниженій ціновій точці, а також останнім виправленням операційної системи Surface Duo, подвійне екранування диво ще може зробити позитивне враження за кордоном. </p> <p> Microsoft також підтвердила, коли британські вболівальники можуть спробувати Surface Duo для себе. Якщо ви перебуваєте у Великобританії, стежте за роздрібними магазинами електроніки 18 лютого 2021 року. </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> Подряпина поверхні планів Microsoft за кордоном </h2> <p> Незважаючи на те, що Surface Duo намагався справити хороше враження в США, все ще може бути надія на це за кордоном. З усіма виправленнями операційної системи Surface Duo у поєднанні з цим падінням ціни, трава може виявитися зеленішою з іншого боку. </p> <p> Якщо ви хочете дізнатись, які виправлення Microsoft висунула для Surface Duo, нещодавно компанія випустила деякі оновлення стабільності, щоб виправити помилки перед міжнародним дебютом Duo. </p> <p> <small> Кредит зображення: Джек Скінс / <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}