{"title":"Уряд США хоче знати про точність міток конфіденційності додатків","content":"<p> За допомогою ярликів конфіденційності додатків iOS 14 у App Store, Apple надає користувачам новий спосіб отримати більше можливостей, отримавши більше знань про програми, якими вони користуються - і про те, як ці програми можуть їх відстежувати. </p> <p> Але, здається, це також потенційно відкрило для себе консервну базу для хробаків, оскільки Apple зараз змушена поручитися за точність цих міток, які розробники почали подавати Apple ще в грудні. </p> <h2 id=\"concerns-over-accuracy\"> Побоювання щодо точності </h2> <p> Як зазначає <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumors </a> , Apple отримала <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> лист </a> від Комітету Палати Міністрів США з питань енергетики та торгівлі з проханням пояснити інформацію про точність поданих розробником міток конфіденційності додатків. </p> <p> Ці ярлики - це довгоочікувана функція iOS 14, яка змушує інших боятися, що змусить розробників бути більш відкритими щодо того, як їх програми взаємодіють із користувацькими даними. Це означає, що користувачі зможуть прийняти більш обґрунтоване рішення, коли мова зайде про переваги та недоліки використання певних програм. </p> <p> </p> <p> У своєму листі Комітет Палати Міністрів США з питань енергетики та комерції запитує Apple щодо звітів, які вказують, що певні ярлики конфіденційності програм можуть надавати користувачам &quot;оманливу та неправдиву&quot; інформацію. Це ґрунтується на звіті, опублікованому минулого місяця, в якому стверджується, що багато програм, які отримують чистий стан здоров’я, можуть бути не такими невинними, як вони вважають. </p> <p> Потенційна проблема функції iOS 14 полягає в тому, що вона покладається на чесність розробника, щоб сказати, як збираються дані, а також підтвердити, що ця інформація є точною. Сама компанія Apple зазначає, що інформація &quot;не перевірена компанією Apple&quot;. </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Запит на відповідь від Apple </h2> <p> Хоча здається ймовірним, що більшість розробників будуть грати чесно і дотримуватися системи честі, це не те, що можна сприймати як само собою зрозуміле. Apple регулярно перевірятиме надіслану інформацію. Однак величезна кількість програм в App Store робить Apple неможливою особисто перевіряти кожен окремий список. </p> <p> Лист Комітету Палати Міністрів США з питань енергетики та торгівлі продовжує, що: </p> <blockquote> <p> &quot;Ми закликаємо Apple покращити дію своїх ярликів конфіденційності додатків, щоб забезпечити споживачам значущу інформацію про практику даних своїх додатків та щоб ці потенційно оманливі практики не завдавали шкоди споживачам&quot;. </p> </blockquote> <p> Комітет попросив Apple надати більше деталей щодо свого процесу аудиту, чи будуть виправлені ярлики конфіденційності додатків, якщо вони будуть визнані неправдивими, подробиці про те, що відбувається, коли розробники надають неточну інформацію тощо. </p> <p> Вони просять Apple відповісти інформацією, запитаною до 23 лютого. </p> <p> <small> Кредит зображення: Джейсон Дент / <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Unsplash CC </a></small> </p>"}