{"title":"VW заявляє, що Apple не виграє легкої поїздки в автомобільній промисловості","content":"<p> Герберт Дісс, генеральний директор Volkswagen Group, применшив будь-який потенційний вплив Apple Car на автомобільну промисловість, заявивши, що VW &quot;не боїться&quot; проекту Titan. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW &quot;Не боїться&quot; автомобіля Apple </h2> <p> Незважаючи на те, що Дісс визнає, що автомобіль під брендом Apple дійсно може мати сенс, він не вважає, що Apple може домінувати у виробництві автомобілів &quot;за одну ніч&quot; через сильну конкуренцію. Різати сталь та продавати машини вигадливим споживачам - важка справа, - натякнув він, додавши, що це не сфера, яку будь-яка компанія може просто &quot;взяти на себе одним ударом&quot;. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> передає те, що Дісс розповіла Frankfurter Allgemeine Sonntagszeitung в одному з інтерв&#39;ю: </p> <blockquote> <p> Автомобільна промисловість - це не типовий сектор техніки, який ви могли б взяти на себе одним рухом. Apple не впорається з цим за одну ніч. І все-таки ми не боїмося. </p> </blockquote> <p> Тим не менше, бренд від Apple мав би сенс, враховуючи компетенцію Apple у галузі акумуляторів, програмного забезпечення, промислового дизайну та, здавалося б, нескінченних ресурсів, додав керівник. Apple не пропонує жодних продуктів, пов&#39;язаних з автомобілями, крім <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Програмне забезпечення приладової панелі CarPlay </a> що дозволяє автомагнітолі або головному пристрою виконувати функцію дисплея та контролера для iPhone. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> Найгірша таємниця галузі </h2> <p> Плани Project Titan (внутрішнє кодове ім&#39;я для автомобіля Apple) досі не відомі, незважаючи на шквал останніх чуток <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple прагнула співпрацювати з Hyundai / Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Кажуть, що Apple розмовляла з іншими автомобільними компаніями </a> та укладати контракти з виробниками - включаючи Magna, Nissan та Foxconn - про створення свого автономного автомобіля. Джерела стверджують, що Apple Car може не мати керма, оскільки спочатку це може бути <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> зосередити увагу на доставці їжі та операціях роботокси </a> перед продажем споживачам. </p> <p> </p> <p> Найбільшим виводом з коментаря Герберта було б те, що автомобільна промисловість приділяла пильну увагу Project Titan. Очевидно, що сама думка про вступ Apple до цього сектору нервує деяких топ-менеджерів. Тим не менш, історія повна людей, які повинні були знати краще, ніж висміювати Apple про входження в нову категорію товарів. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> Як генеральний директор Palm сміявся з iPhone </h2> <p> Найкращий приклад тому - колишній генеральний директор Palm Ед Колліган. Лише за кілька тижнів до оригінального представлення iPhone в 2007 році Колліган засміявся з думки, що компанія, відома розробкою симпатичних комп&#39;ютерів, може завоювати клієнтів у конкурентному секторі смартфонів, сказавши: </p> <blockquote> <p> Ми кілька років навчились і боролись тут, з’ясовуючи, як зробити гідний телефон. Хлопці з ПК не збираються просто з’ясовувати це. Вони не збираються просто входити. </p> </blockquote> <p> Подібно до того, як Колліган описував Apple як &quot;хлопців з ПК&quot;, начальник Volkswagen намагається применшити уявлення про те, що технологічна компанія може завоювати клієнтів у виробництві автомобілів. Історія покаже, чи буде коментар Герберта старіти краще, ніж коментар Коллігана. </p>"}