{"title":"Що таке MTA-STS і як він захищає ваші електронні листи?","content":"<p> Електронна пошта є найбільшим винуватцем більшості кібератак. Це проста точка доступу для зловмисного програмного забезпечення, рекламного програмного забезпечення, спаму та фішингу та забезпечує безмежні можливості для суб’єктів загроз отримати вашу особисту інформацію. </p> <p> Щоб пом&#39;якшити ці загрози, слід застосовувати жорсткі заходи безпеки як для індивідуальних, так і для ділових облікових записів електронної пошти. </p> <h2 id=\"email-security-and-encryption\"> Безпека та шифрування електронної пошти </h2> <p> Незважаючи на популярність інших способів спілкування, обмін повідомленнями електронною поштою все ще є найбільшою формою передачі даних для будь-якої особи чи організації. Захист вмісту електронної пошти є життєво необхідною. </p> <p> Безпека електронної пошти передбачає перевірку та шифрування всього вхідного та вихідного електронного трафіку. Шифрування відіграє важливу роль у збереженні конфіденційності вмісту електронної пошти, забезпечуючи безпечне з&#39;єднання SMTP (Simple Mail Transfer Protocol). </p> <p> Донедавна шифрування було лише необов’язковою вимогою для SMTP. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> Як працює шифрування електронної пошти? </h2> <p> Шифрування електронної пошти - це процес додавання шифру або шматка коду до вмісту вашого повідомлення, що робить його нерозбірним. Перетворюючи дані електронної пошти в код, вміст захищається від несанкціонованого впливу. Простіше кажучи, ваша електронна пошта зашифрована. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> Як додаткову безпеку в процесі шифрування використовуються відкриті та приватні ключі, де зашифровані ключі обмінюються для блокування та розблокування закодованих електронних листів. Відправник шифрує електронне повідомлення за допомогою криптографії з відкритим ключем, а згодом одержувач використовує приватний ключ для розшифровки отриманого повідомлення. </p> <p> Шифрування застосовується до всієї подорожі електронного листа від початку до кінця. Як найкраща практика, усі вхідні та вихідні електронні листи повинні бути зашифровані, а не лише ті, що несуть конфіденційну інформацію. Це заважає учасникам загроз отримати будь-яку точку входу у вашу систему. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> Передумови та проблеми з SMTP </h2> <p> Коли в 1982 році з’явився протокол SMTP, шифрування електронної пошти не було звичайною практикою, і за замовчуванням електронні листи надсилалися та отримувались у звичайному тексті. Щоб запровадити безпеку на транспортному рівні, наприкінці 1990-х була додана команда STARTTLS, яка пропонувала опцію шифрування через <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> Протокол TLS (Transport Layer Security) </a> . </p> <p> Як би багатообіцяльно не звучало оновлення TLS, воно залишило цілими дві лазівки у безпеці: </p> <ol> <li> Варіант шифрування був якраз таким: <strong> за бажанням </strong> . Незахищені електронні листи все ще були широко поширеними, що спричинило сплеск кібератак. </li> <li> Навіть із встановленим STARTTLS не було можливості автентифікувати ідентифікацію сервера відправника, оскільки сервери SMTP не перевіряють сертифікати. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> Прибуття MTA-STS </h2> <p> У 2019 році Google нарешті вийшов назустріч і оголосив про прийняття нового стандарту MTA-STS (Mail Transfer Agent / Strict Transport Security) ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> Це надає провайдерам поштових послуг можливість нав&#39;язувати TLS для захисту SMTP-з&#39;єднань, а також пропонує можливість заборонити доставку електронної пошти хостам MX, які не пропонують TLS із надійним сертифікатом сервера. </p> <p> MTA-STS нарешті опікується всіма попередніми проблемами з SMTP, застосовуючи шифрування між SMTP-серверами, що спілкуються. Але як це насправді працює? Давай дізнаємось! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> Як працює MTA-STS? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS приступає до роботи, доручаючи SMTP-серверу взаємодіяти з іншим SMTP-сервером лише за двох умов: </p> <ol> <li> Сервер SMTP <strong> повинен </strong> бути зашифрованим. </li> <li> Доменне ім’я у сертифікаті сервера відповідає домену в політиці, і сертифікати оновлені. </li> </ol> <p> Використовуючи комбінацію DNS і HTTPS для публікації політики, MTA-STS повідомляє відправляючій сторону, як діяти, якщо зашифрований канал зв&#39;язку не може бути ініційований. </p> <p> Легко впровадити MTA-STS на кінці одержувача, але для відправника - допоміжне програмне забезпечення поштового сервера, таке як <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> слід використовувати. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> Який тип атак пом’якшує MTA-STS? </h2> <p> Наступні загрози виконуються безпосередньо, якщо MTA-STS застосовано до ваших електронних повідомлень: </p> <p> <strong> Атаки &quot;Людина посеред&quot; (MITM): </strong> Ця атака здійснюється, коли зловмисник втручається в середині спілкування двох сторін з метою викрадення або зміни даних. У випадку електронної пошти це зазвичай означає два SMTP-сервери, що обмінюються даними. Використовуючи MTA-STS, ці атаки можна легко запобігти. </p> <p> <strong> Атаки зниження рівня: </strong> Актор загрози змушує мережевий канал перейти на незахищений режим передачі даних. Як приклад, ця атака може перенаправити відвідувача веб-сайту з версії HTTPS сайту на версію HTTP. MTA-STS допомагає боротися з цими атаками, запобігаючи несанкціонованому доступу. </p> <p> <strong> Атаки підміни DNS: </strong> Ці хитрі атаки змінюють записи DNS призначеного користувачем призначення і обманюють їх, вважаючи, що вони відвідують законний сайт або домен. Впровадження MTA-STS дуже допомагає пом&#39;якшити ці атаки. </p> <p> </p> <p> Тепер, коли ми знайомі з MTA-STS, настав час доторкнутися до нового стандарту звітності для SMTP, відомого як звіт TLS. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> Що таке SMTP TLS Reporting (TLS-RPT)? </h2> <p> Як і MTA-STS, TLS-RPT - це стандарт звітування, який виявляє проблеми з підключенням та розбіжності між надсиланням програм. Після увімкнення він щодня надсилає звіти про будь-які проблеми з підключенням, з якими стикаються зовнішні сервери під час надсилання вам електронних листів. </p> <p> Подумайте про це як про засіб усунення несправностей, за допомогою якого звіти можна використовувати для оцінки та аналізу потенційних проблем та проблем конфігурації. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> Який тип питань вирішує TLS-RPT? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Діагностична звітність: </strong> Звіти TLS пропонують діагностичні звіти у форматі файлу JSON, що містять вичерпну інформацію про будь-які вхідні електронні листи, що стикаються з проблемами доставки. Він також виявляє електронні листи, які відскакували або не надходили, наприклад, через атаку зниження версії. </p> <p> <strong> Покращена видимість: </strong> Увімкнувши TLS-RPT, ви можете покращити видимість усіх своїх електронних каналів. Це дозволяє стежити за усіма даними, які рухаються в ваш бік, що також включає невдалі повідомлення. </p> <p> <strong> Щоденні звіти: </strong> Діагностичні звіти надсилаються принаймні один раз на день для детального висвітлення та дотримання політики MTA-STS. Звіти також включають статистику руху, а також детальну інформацію про помилки та невдалі доставки. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Коли все інше не вдається, шифрування переважає </h2> <p> Зважаючи на постійно розвивається характер кіберзагроз, суворі заходи безпеки та криптографія є необхідними для безпечної та надійної доставки електронної пошти. </p> <p> Завдяки різноманітним провайдерам електронної пошти, що пропонують потужні можливості шифрування та стандартам MTA-STS, повністю безпечні передачі електронної пошти вже не є надуманою реальністю. </p>"}