{"title":"Яка різниця між локальною мережею та глобальною мережею в мережі?","content":"<p> Якщо ти засунув ніс у комп’ютерні мережі, є велика ймовірність, що ти натрапив на терміни „LAN” та „WAN”. Однак що означає кожен із них і які відмінності при порівнянні локальної мережі та глобальної мережі? </p> <p> Давайте вивчимо обидві ці технології та те, де кожна з них сяє. </p> <h2 id=\"what-does-lan-stand-for\"> Що означає &quot;локальна мережа&quot;? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> Кредит зображення: Drug Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Локальна мережа - це &quot;Локальна мережа&quot;. Цей термін описує мережу, де всі підключені пристрої знаходяться близько один до одного. Усі вони перебувають у &quot;місцевій місцевості&quot;, звідси і назва. </p> <p> Коли комп&#39;ютер підключається до локальної мережі, він отримує адресу локального протоколу Інтернету (IP). Це працює подібно до IP-адреси, яку ви отримуєте, коли ви входите в Інтернет. Однак локальна IP-адреса працює лише для інших комп’ютерів у тій самій локальній мережі, що і ви. Наприклад, ви не можете використовувати локальний IP для підключення до ПК через Інтернет. </p> <p> Фізичний кордон вашої домашньої локальної мережі, ймовірно, не покине ваш будинок. Звичайно, якщо ви винесете телефон або ноутбук у свій сад на свіже повітря, це все одно в локальній мережі. Однак у більшості випадків усі підключені до мережі пристрої надійно перебувають у чотирьох стінах вашого будинку. </p> <p> Компанії та інститути також роблять локальні мережі. Наприклад, університет може підключити всі ПК у своїй бібліотеці до мережі, щоб вони могли спілкуватися між собою. Бізнес також любить використовувати локальні мережі, оскільки це дозволяє працівникам надсилати файли та кореспонденцію один одному без необхідності виходити в Інтернет. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> Що означає &quot;WAN&quot;? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Кредит зображення: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> З іншого боку, ми маємо Wide Area Network, або WAN. Якщо ви читаєте цю статтю, ви вже підключені до глобальної мережі - ми любимо називати це Інтернетом. </p> <p> &quot;Широка&quot; мережа широкого простору дуже мінлива. Якщо ви підключаєтеся до зовнішнього сервера в тому ж місті, що і ви, це WAN. Також WAN вважається, якщо ви підключаєтеся до сервера в країні на іншій стороні планети. </p> <p> Таким чином, глобальна мережа зазвичай використовується для опису будь-якої мережі, до якої ви підключаєтесь, яка існує після вашого маршрутизатора. Не має значення, чи знаходиться сервер за милю, чи від континенту; вона все ще &quot;широка&quot;. </p> <p> Інтернет - це не єдиний WAN. Підприємства добре використовують глобальну мережу для підключення офісів, що знаходяться в різних країнах. Наприклад, якщо компанія має офіс у Нью-Йорку, Токіо та Сіднеї, вона може найняти власну систему WAN, щоб дозволити їм спілкуватися між собою. </p> <p> Але почекайте хвилинку; чому компанії роблять власні WAN, коли вони можуть просто підключити все до Інтернету? Проблема цього рішення полягає в тому, що компанії доведеться платити збори провайдерів, і якщо щось піде не так, їм доведеться боротися із зазначеним провайдером, щоб це виправити. </p> <p> Мало того, Інтернет розроблений для підключення до багатьох ПК по всьому світу. Якщо компанія хоче лише, щоб її ПК підключалися до інших офісних ПК, вони можуть використовувати власну глобальну мережу, щоб захиститися від інтернет-загроз. Це називається &quot;інтрамережею&quot;. </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> Коли використовувати локальну мережу проти глобальної мережі </h2> <p> Якщо ви хочете підключитися до іншого власного пристрою, ви можете зробити це через LAN або WAN. Але в чому переваги та недоліки кожного з них, і які слід використовувати? </p> <p> Скажімо, у вас є новий бездротовий жорсткий диск, який підключається до вашого маршрутизатора, і у вас є можливість дозволити з’єднання з Інтернету (WAN) або зберегти його лише локальним (LAN). Який з них вибрати, залежить від того, що ви хочете від жорсткого диска. </p> <p> Надання можливостей глобальної мережі на жорсткому диску є фантастичним для зручності. Це робить його в Інтернеті, а це означає, що ви можете підключитися до нього з будь-якої точки світу. Таким чином, ви ніколи більше не застрягнете без своїх файлів; вони просто не матимуть з’єднання з Інтернетом. </p> <p> Однак з&#39;єднання WAN також дозволяють іншим людям отримати доступ до ваших пристроїв. Якщо безпека вашого жорсткого диска не до кінця, хакери можуть використовувати той самий шлях, що і ви, щоб переглянути всі ваші дані та скопіювати або видалити важливі речі. </p> <p> З іншого боку, переведення жорсткого диска в режим лише локальної мережі захищає його від деяких шляхів, які може зламати хакер. Це не непроникно. Наприклад, хтось може використовувати ваш ПК, щоб отримати доступ до жорсткого диска. Однак це набагато безпечніше, ніж трансляція жорсткого диска через глобальну мережу щодня та вночі. </p> <p> Якщо ви дійсно, дуже хочете посилити безпеку, ви можете розірвати жорсткий диск. Повітряний проміжок означає, що він і кожен ПК в одній мережі на ньому не підключені до глобальної мережі, як, наприклад, до Інтернету. </p> <p> Ан <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> комп’ютер із повітряним проміжком не є повністю захищеним від інтернет-загроз </a> , але це різко знижує ймовірність нападу. Хакери повинні маніпулювати людьми, щоб робити свої накази, щоб атакувати пристрій із повітряним проміжком, використовуючи тактику соціальної інженерії, щоб отримати свій шлях. </p> <p> Таким чином, вибираючи між тим, як перевести пристрій в Інтернет або заблокувати його в домашній локальній мережі, вам слід врахувати, чи будете ви насправді підключатися до нього через Інтернет. Якщо ви не думаєте, що хочете, найкраще вимкнути можливості WAN і тримати хакерів на відстані. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> Чи перетворює підключення до Інтернету локальну мережу в глобальну мережу? </h2> <p> Скажімо, у вас налаштована локальна мережа, де всі ваші пристрої підключені до маршрутизатора. Вам нудно, тож ви сідаєте на комп’ютер і прямуєте до Netflix. Тепер ваш ПК підключений до глобальної мережі: Інтернет. </p> <p> Однак, оскільки ваш ПК підключений до глобальної мережі, це означає, що він більше не є частиною локальної мережі? На щастя, пристрій може бути одночасно частиною локальної мережі та глобальної мережі. </p> <p> Пам&#39;ятаєте, як ми говорили, що пристрої локальної мережі мають власну локальну IP-адресу? Це не означає, що він також не може отримати IP-адресу в Інтернеті. Насправді, якщо ви читаєте цю статтю на пристрої, підключеному до маршрутизатора, він матиме обидва! </p> <p> Якщо ви хочете перевірити самі, ми розглянули <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> Як перевірити свою IP-адресу в Windows </a> . Якщо ви користуєтеся мобільним телефоном, все одно можете <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> знайти свої IP-адреси на Android або iPhone </a> . </p> <p> Коли у вас буде статистика, ви побачите дві IP-адреси. Перший почнеться з &quot;192.168&quot; - це ваша локальна IP-адреса. Ви використовуєте цей, якщо хочете підключитися до поточного пристрою з іншого в тій же мережі. </p> <p> Другий буде виглядати одним із двох напрямків, залежно від того, перебуваєте ви на IPv4 або IPv6. Якщо ви користуєтеся версією v4, вона повинна виглядати як ваша локальна IP-адреса, але вона не починатиметься з &quot;192.168&quot;. Якщо це IPv6, це має бути безлад букв і цифр, розділений двома двокрапками на вісім блоків. </p> <p> У будь-якому випадку, ця адреса є вашою IP-адресою в Інтернеті. Це використовується при підключенні до іншого сервера в Інтернеті, щоб він міг спілкуватися з вами; наприклад, щоб надіслати вам телевізійне шоу, яке ви дивитесь на Netflix. </p> <p> Певним чином, ви можете уявити Інтернет як величезну мережу локальних мереж. Коли ви дивитесь Netflix, ваш ПК (у вашій особистій локальній мережі) отримує дані із серверів Netflix (який знаходиться у власній локальній мережі). Кожна локальна мережа схожа на будинок у місті, тоді як підключення до Інтернету схоже на дороги та вулиці, які з’єднують їх між собою. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> Усунення плутанини локальної мережі та глобальної мережі </h2> <p> Мережі локальної мережі та глобальні мережі часто працюють в тандемі, але працюють по-різному. Тепер ви знаєте різницю між ними та час використання кожного з них. </p> <p> Чи знали ви, що можете налаштувати гру локальної мережі, щоб люди в одній мережі могли грати один з одним? Це чудовий спосіб провести час з друзями без проблем із затримками, які іноді виникають в іграх в Інтернеті. </p> <p> <small> Кредит зображення: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}