{"title":"Ще одна неофіційна торгова марка PS5 виходить на сцену","content":"<p> dbrand, який виготовляє обшивки, екрани та футляри для різних пристроїв, приєднався до Sony-baiting та випустив власну неофіційну передню панель PS5. </p> <h2 id=\"dbrand-releases-darkplates\"> dbrand випускає Darkplates </h2> <p> Якщо ви хочете налаштувати свій PS5, то dbrand - це остання компанія, яка пропонує неофіційні сторонні панелі для консолі нового покоління. Вони називають їх Темними табличками, тому що це чорні лицеві панелі. </p> <p> Ви можете перевірити таблички на <a href=\"https://dbrand.com/shop/special-edition/ps5\" target=\"_blank\" rel=\"nofollow noopener\"> dbrand магазин </a> , де ви можете придбати матові чорні лицьові панелі за 49,00 доларів (на момент написання статті). </p> <p> Ви також можете підібрати те, що dbrand називає &quot;середньою шкірою&quot;, це вінілова наклейка, яка переходить над чорною центральною панеллю на PS5 з високим блиском. Це коштує додатково 11,95 доларів і доступне в різних кольорах та дизайнах. </p> <p> <img alt=\"dbrand shell texture detail\" src=\"images/dbrand-shell-texture-detail-544.png\" loading=\"lazy\"> </p> <p> Ви також помітите, що він може похвалитися своєю фактурою передньої панелі. Це схоже на <a href=\"https://www.makeuseof.com/sony-how-ps5-controller-textured-playstation-symbols/\" target=\"_blank\" rel=\"nofollow noopener\"> крихітні символи PlayStation, які ви знайдете на DualSense </a> , інші офіційні аксесуари для PS5 та сторонні панелі, які прикріплюються до консолі під час її придбання. Подібні, але чи такі вони вражаючі? </p> <p> </p> <h2 id=\"will-dbrand-last\"> Чи триватиме dbrand? </h2> <p> Ви, без сумніву, бачили наш <a href=\"https://www.makeuseof.com/cmp-shells-ps5-faceplate-colors/\" target=\"_blank\" rel=\"nofollow noopener\"> покриття передньої стійки щодо оболонок CMP </a> , що зробило цілком тріумфальне повернення після заборони Sony. Хтось може сказати, що його повернення було зарозумілим, оскільки він оголосив свої нові панелі юридично недоторканними. Ми побачимо. </p> <p> </p> <p> Це змушує задуматися, чому dbrand взагалі турбує. Sony категорично <strong> не </strong> сприйміть люб’язно CMP Shells, по-перше, тому що його колишня марка була занадто схожа на PlayStation (PlateStation). </p> <p> Потім Sony вирішила проблему, оскільки вирішила, що панелі панелей є частиною дизайну консолі, і тому їх копіювання є порушенням інтелектуальної власності. Наведіть на стук заборонного молотка. CMP Shells припинила виробництво, скасувавши всі замовлення перед тим, як знову з’явитися в новому вигляді. </p> <p> dbrand вже на четвертій хвилі потенційно невиконаних клієнтів передпродажних продажів, тому ви повинні бути швидкими, якщо хочете захопити одну зі спеціальних панелей. Інша справа - чи дійсно плити досягнуть виробництва. Sony могла б знову збити молоток. </p> <p> </p> <h2 id=\"should-you-buy-a-dbrand-faceplate\"> Чи варто купувати dbrand передню панель? </h2> <p> Як і у випадку з сагою CMP Shells, ми радимо всім, хто зацікавлений у налаштуванні своїх лицьових панелей PS5, проявити обережність. Це сторонні товари, і тому ви не можете підтвердити їх якість, крім того, що повідомляє вам бренд. </p> <p> Крім того, враховуючи наполягання Sony на тому, що PlateStation (нині CMP Shells) довелося припинити виробництво, це не стане несподіванкою, якщо вона не пришвидшить набір своїх юристів, щоб також взяти участь у справі dbrand. </p> <p> Коротше кажучи, будьте обережні, якщо хочете налаштувати свої лицьові панелі. CMP Shells повернула кошти всім своїм клієнтам вперше. Але це не означає, що буде інша марка. </p> <p> </p> <h2 id=\"do-you-really-need-to-customize-your-ps5\"> Вам справді потрібно налаштувати ваш PS5? </h2> <p> <img alt=\"ps5\" src=\"images/ps5-183.jpg\" loading=\"lazy\"> </p> <p> Якщо ви не задоволені зовнішнім виглядом вашого PS5, ви завжди можете змінити його іншими (значно дешевшими) способами. Ви завжди можете додати на консоль вінілову обшивку, якщо хочете, щоб вона виглядала інакше. </p> <p> PS5 вийшов на ринок лише в листопаді 2020 року. Можливо, спробуйте зіграти на ньому кілька ігор, перш ніж відчуєте непереборний бажання змінити косметичний вигляд консолі. </p>"}