{"title":"Ви можете безкоштовно придбати нову програму Microsoft Teams Pro","content":"<p> Трохи тому ми охопили заплановану послугу передплати для Microsoft Teams під назвою &quot;Teams Pro&quot;, яка відкриє додаткові функції для програмного забезпечення. Однак тоді Microsoft заявила, що деякі люди отримуватимуть Teams Pro безкоштовно за їхні поточні плани. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Заява Microsoft про безкоштовні підписки Teams Pro </h2> <p> Якщо вам потрібно нагадування, ми вже висвітлювали цю тему в нашому матеріалі <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro додає вебінари до служби </a> . </p> <p> Тепер стаття від <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> з тієї ж теми з тих пір отримав заяву від Microsoft. Заява є гарною новиною для людей, яких турбує додаткова плата за вебінари: </p> <blockquote> <p> 9 лютого ми опублікували пост MC про новий план обслуговування Teams Pro. Щоб пояснити, не існує змін до існуючих ліцензій на продукцію з додаванням цього нового плану обслуговування. Швидше, план обслуговування буде автоматично доданий до ліцензій Microsoft 365 та Office 365 E5 / E3 / A5 / A3 та Microsoft 365 Business Standard / Business Premium, і дозволить користувачам, які мають ліцензію на ці SKU, автоматично отримувати можливості, що розгортаються до Команди найближчим часом. </p> </blockquote> <p> Microsoft продовжує стверджувати, що адміністраторам не потрібно нічого робити для активації цих нових функцій. Крім того, кожен, хто має сумісну ліцензію, перераховану вище, отримає ці блискучі нові функції без додаткової плати. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Отримати більше того ж із командами Microsoft </h2> <p> Microsoft випускає новий план передплати Teams Pro, який розблоковує вебінари та багато іншого, але не кожному доведеться доплачувати за це. Якщо ви # підписалися на одну з вищезазначених ліцензій, ви можете з нетерпінням чекати отримання всіх функцій Teams Pro без зайвих додаткових виплат. </p> <p> Це не означає, що люди без Teams Pro залишаться в тіні. Наприклад, незабаром усі отримають доступ до зручної функції підведення підсумків у Microsoft Teams. </p> <p> <small> Кредит зображення: Postmodern Studio / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}