{"title":"Незабаром ви почнете грати в ігри з персонажами Epic&#39;s MetaHuman","content":"<p> Якщо ви вважаєте, що ігри зараз виглядають реалістично, то почекайте, поки ви вловите навантаження того, що Epic Games набуло результатів роботи з його Unreal Engine. Підготуйся до того, щоб твій розум роздувся. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games представляє нових MetaHumans </h2> <p> Вам, мабуть, цікаво, про яку землю ми говоримо. MetaHuman Creator - це остання функція, яку Epic Games додала до Unreal Engine; середовище розробки програмного забезпечення, яке розробники ігор можуть використовувати для створення своїх назв. </p> <p> Відповідно до <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Повідомлення в блозі Unreal Engine </a> анонсуючи захоплюючий новий інструмент розробки: </p> <blockquote> <p> MetaHuman Creator - це хмарний додаток, призначений для передачі цифрового людського творіння в режимі реального часу від тижнів або місяців до менш ніж години, без шкоди для якості. </p> </blockquote> <p> Отже, це по суті спосіб для розробника ігор створити неймовірно реалістичні людські факсиміле. Швидко. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> Що означає MetaHuman Creator для розробників? </h2> <p> </p> <p> Наслідки цього для розробки програмного забезпечення полягають у зміні гри (каламбур). Уявіть, як швидко розробники заповнять свої ігрові світи NPC, використовуючи MetaHuman Creator. Мало того, але й цифрові люди виглядають неймовірно. </p> <p> Це також, очевидно, означатиме, що розробники можуть закінчувати заголовки швидше, тому вам не доведеться чекати незліченні затримки. MetaHuman Creator дозволяє розробникам швидко побудувати свою популяцію NPC, залишаючи час для інших, більш актуальних питань. </p> <p> Але навіщо потрібен цей інструмент? Epic Games пояснює: </p> <blockquote> <p> Створення однієї високоякісної цифрової людини є складним і трудомістким. Масштабувати ці зусилля, щоб створити багато різноманітних цифрових людей, якість потрібна платформам наступного покоління та віртуальному виробництву високого класу, є справді грізним завданням. </p> </blockquote> <p> Отже, як ми вже говорили; інструмент економить час і покращує робочий процес, дозволяючи розробникам надавати консолям нового покоління ігри, на які вони заслуговують. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> Як MetaHuman Creator вплине на ігри? </h2> <p> Ну, завдяки MetaHuman Creator, для початку ігри можуть вийти набагато швидше. Завдяки таким потужним інструментам, як цей, розробники можуть відточити механіку гри або витратити більше часу на виправлення помилок, перш ніж випустити зламану гру ... </p> <p> У будь-якому випадку, окрім гіркоти, інструмент розробки Epic здається чимось, що також покращить ігри. Потрібно лише поглянути на рендери, щоб побачити, наскільки захоплюють дух цифрові люди насправді. Однак, коли ми бачимо їх в іграх, тоді настає справжня магія. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> Коли ми побачимо MetaHumans в іграх? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> Це важко сказати. Наразі Epic встановила програмне забезпечення Creator для раннього тестування доступу протягом «наступних кількох місяців». Тож ви скоро не побачите жодного MetaHumans. </p> <p> Якщо ви хочете створити власну цифрову людину, вам слід почекати, якщо ви хочете використовувати MetaHuman Creator Unreal Engine. Ви завжди можете спробувати скласти одне в іншій програмі, але це точно не займе менше години! </p>"}