{"title":"10 điều bạn chưa biết Google Documents có thể làm","content":"<p> Google Doc bề ngoài có vẻ cơ bản nhưng công cụ năng suất đám mây có nhiều tính năng bị bỏ qua có thể giúp bạn làm được nhiều việc hơn trong công việc. </p> <p> Trong bài viết này, chúng ta sẽ xem xét một số tính năng của Google Tài liệu mà bạn có thể chưa biết và cách bạn có thể sử dụng chúng để tiết kiệm thời gian tạo nội dung. </p> <p> Xin lưu ý rằng hầu hết các tính năng này đều có thể truy cập được trên phiên bản dành cho máy tính để bàn của công cụ Google Tài liệu. Những cái cũng có thể được sử dụng trên phiên bản di động sẽ được chỉ định. </p> <h2 id=\"voice-typing\"> 1. Nhập liệu bằng giọng nói </h2> <p> Để sử dụng tính năng nhập liệu bằng giọng nói, hãy mở một tài liệu và nhấp vào <strong> Công cụ </strong> từ thanh menu ở đầu trang. Lựa chọn <strong> Nhập liệu bằng giọng nói </strong> từ trình đơn thả xuống. </p> <p> <img alt=\"Google Docs voice typing\" src=\"images/google-docs-voice-typing-173.png\" loading=\"lazy\"> </p> <p> Một micrô sẽ bật lên trên màn hình của bạn, với menu ngôn ngữ nơi bạn có thể chọn ngôn ngữ nói ưa thích của mình. Khi bạn đã sẵn sàng nói văn bản của mình, hãy nhấp vào micrô hoặc nhấn <strong> Cmd + Shift + S </strong> (nếu bạn đang sử dụng máy Mac) hoặc <strong> Ctrl + Shift + S </strong> (nếu bạn đang sử dụng PC Windows) để bắt đầu ghi. </p> <p> Để thêm dấu câu vào giữa văn bản, hãy nói tên của dấu câu bạn muốn thêm, chẳng hạn như &#39;dấu chấm&#39;, &#39;dấu phẩy&#39; hoặc &#39;dấu chấm hỏi&#39;. Bạn có thể đưa ra hướng dẫn định dạng như &quot;dòng mới&quot; hoặc &quot;đoạn mới&quot; hoặc &quot;ngừng nghe&quot; nếu bạn muốn tạm dừng nhập liệu bằng giọng nói và &quot;tiếp tục&quot; khi bạn đã sẵn sàng tiếp tục. </p> <p> Tra cứu các lệnh chỉnh sửa nâng cao từ cái này <a href=\"https://support.google.com/docs/answer/4492226?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> danh sách các lệnh </a> trên Trang hỗ trợ của Google. </p> <p> Bạn cũng có thể sử dụng tính năng này để phiên âm bất kỳ âm thanh nào. Chỉ cần phát âm thanh (từ điện thoại của bạn hoặc bất kỳ thiết bị nào khác) sang giọng nói thành văn bản và nó sẽ gõ ra cho bạn. Bạn có thể phải thực hiện một vài chỉnh sửa, nhưng bạn đã tiết kiệm được rất nhiều thời gian. </p> <p> </p> <p> Tính năng nhập liệu bằng giọng nói chỉ có trên máy tính để bàn nhưng nó chỉ hoạt động trên trình duyệt Chrome. </p> <p> </p> <h2 id=\"offline-editing\"> 2. Chỉnh sửa ngoại tuyến </h2> <p> Nhiều người yêu thích Google Tài liệu vì tính năng lưu ngay lập tức vào đám mây của nó, nhưng điều này có thể gây bất tiện nếu bạn không có quyền truy cập Internet trong một thời gian. Tin tốt là bạn vẫn có thể truy cập và chỉnh sửa tệp của mình ngoại tuyến. </p> <p> Tính năng này chỉ khả dụng trên Google Chrome và bạn cần cài đặt và kích hoạt <a href=\"https://chrome.google.com/webstore/detail/google-docs-offline/ghbmnnjooekpmoecnnnilnnbdlolhkhi\" target=\"_blank\" rel=\"nofollow noopener\"> Tiện ích mở rộng Google Documents ngoại tuyến của Chrome </a> . Ngoài ra, hãy đảm bảo rằng bạn không duyệt web ở chế độ riêng tư. </p> <p> Tính năng này cần được cài đặt khi bạn trực tuyến, nhưng sau khi hoàn tất, bạn có thể viết và chỉnh sửa văn bản ngoại tuyến, sau đó chúng sẽ được lưu vào đám mây khi bạn truy cập Internet. Đây là cách thực hiện. </p> <p> <img alt=\"Google Docs offline mode\" src=\"images/google-docs-offline-mode-settings-552.png\" loading=\"lazy\"> </p> <p> Để làm cho nó có thể <strong> mở và lưu tệp Google Tài liệu ngoại tuyến </strong> , theo <a href=\"https://www.makeuseof.com/tag/access-google-drive-files-offline/\" target=\"_blank\" rel=\"nofollow noopener\"> những hướng dẫn này </a> . Tính năng này khả dụng trên PC, iOS và Android. </p> <p> </p> <h2 id=\"track-restore-document-version-history\"> 3. Theo dõi / Khôi phục Lịch sử Phiên bản Tài liệu </h2> <p> Nếu bạn đang làm việc trên một tài liệu một mình hoặc với những người khác, bạn có thể theo dõi các thay đổi đối với tài liệu bằng tính năng Lịch sử Phiên bản. </p> <p> Bạn cũng có thể khôi phục tài liệu về phiên bản trước đó tạm thời hoặc vĩnh viễn; một tính năng có thể là cứu cánh nếu bạn vô tình xóa các phần tài liệu của mình và không thể sử dụng <strong> Hoàn tác </strong> để khôi phục chúng. </p> <p> Để sử dụng tính năng lịch sử phiên bản, hãy nhấp vào <strong> Tập tin </strong> từ thanh menu và chọn <strong> Lịch sử phiên bản </strong> từ trình đơn thả xuống. Bạn sẽ thấy rằng bạn cũng có thể đặt tên cho một phiên bản, vì vậy bạn có thể sử dụng tên đó để theo dõi các thay đổi liên tục trong tài liệu, đặc biệt nếu những người dùng khác đang thực hiện chỉnh sửa cho cùng một tài liệu. </p> <p> <img alt=\"google docs version history view\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs1-191.png\" loading=\"lazy\"> </p> <p> Tính năng này chỉ khả dụng trên máy tính để bàn. </p> <p> </p> <h2 id=\"suggesting-and-review-mode\"> 4. Chế độ đề xuất và xem xét </h2> <p> Mặc dù thật tuyệt khi cộng tác với những người khác và chỉnh sửa tài liệu cùng nhau, nhưng có thể khó (và lộn xộn) để theo dõi những thay đổi mà mỗi người đã thực hiện. </p> <p> Tính năng Đề xuất cho phép bạn chỉ cần đề xuất các chỉnh sửa nếu bạn không muốn thay đổi toàn bộ tài liệu. Đề xuất của bạn sẽ bật lên trình chỉnh sửa dưới dạng nhận xét trên thanh bên và trình chỉnh sửa có thể thực hiện các thay đổi tức thì bằng cách chấp nhận đề xuất. Bạn cũng có thể tiếp tục các cuộc trò chuyện với <strong> Đáp lại </strong> , vì vậy bạn có thể đưa và nhận phản hồi ngay trên trang tài liệu mà không cần phải gửi email qua lại. </p> <p> Để đề xuất các chỉnh sửa, hãy nhấp vào biểu tượng bút chì cho chế độ Chỉnh sửa ở góc trên cùng bên phải của tài liệu đang mở, sau đó chọn <strong> Đề nghị </strong> . </p> <p> Để xem tài liệu mà không có gợi ý, hãy nhấp vào <strong> Đang xem </strong> . Bạn sẽ có thể đọc mà không có gạch ngang và cửa sổ bật lên nhận xét. </p> <p> Để tiết kiệm thời gian, bạn có thể chấp nhận hoặc từ chối tất cả các đề xuất cùng một lúc. Nhấp chuột <strong> Công cụ </strong> , sau đó chọn <strong> Xem lại các chỉnh sửa được đề xuất </strong> . Nhấp chuột <strong> Chấp nhận tất cả </strong> hoặc là <strong> Từ chối tất cả </strong> . </p> <p> <img alt=\"Google Docs Tools dropdown menu with cursor on Review Suggested Edits\" src=\"images/screenshot_2021-02-05-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs17-e1612565877303-874.png\" loading=\"lazy\"> </p> <p> Tính năng này chỉ khả dụng trên máy tính để bàn. </p> <p> </p> <h2 id=\"add-fonts\"> 5. Thêm Phông chữ </h2> <p> Nếu bạn muốn <a href=\"https://www.makeuseof.com/tag/free-fonts-sites-where-find-them/\" target=\"_blank\" rel=\"nofollow noopener\"> cách điệu văn bản của bạn </a> để phù hợp với thông điệp của bạn, bạn cũng có thể làm điều đó với Google Tài liệu. Ngoài 24 phông chữ mặc định đã được lập trình trong công cụ Google Tài liệu, bạn có thể thêm một số phông chữ thú vị mà bạn chọn để tăng cường văn bản của mình một cách trực quan. </p> <p> Để thêm phông chữ, chỉ cần nhấp vào <strong> Phông chữ </strong> trên thanh menu và chọn <strong> Thêm phông chữ </strong> . Chọn bao nhiêu phông chữ bạn muốn từ bộ sưu tập được cung cấp. </p> <p> <img alt=\"pop-up box showing fonts in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs-860.png\" loading=\"lazy\"> </p> <p> Tính năng này chỉ khả dụng trên máy tính để bàn. </p> <p> </p> <h2 id=\"compare-documents\"> 6. So sánh tài liệu </h2> <p> Đây là một tính năng khác mà bạn có thể sử dụng để theo dõi các thay đổi do chính bạn hoặc cộng tác thực hiện đối với tài liệu. Nó đặc biệt hữu ích cho các tài liệu lớn và như tên cho thấy, bạn có thể so sánh hai tài liệu để xem sự khác biệt giữa chúng. </p> <p> Để sử dụng tính năng này, hãy mở tài liệu cơ sở mà bạn muốn so sánh, sau đó nhấp vào <strong> Công cụ </strong> và chọn <strong> So sánh tài liệu </strong> . </p> <p> Trong hộp thoại bật lên, hãy chọn tài liệu mà bạn muốn so sánh với nó từ Drive của bạn và nhấp vào <strong> Đối chiếu </strong> . bên trong <strong> Sự khác biệt về thuộc tính đối với </strong> , nhập tên của cộng tác viên sẽ là tác giả của các chỉnh sửa được đề xuất trong tài liệu cuối cùng. </p> <p> <img alt=\"goggle docs compare documents dashboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs6-301.png\" loading=\"lazy\"> </p> <p> Sự khác biệt sẽ hiển thị theo cách tương tự như trong <strong> Đề nghị </strong> chúng tôi đã thảo luận ở trên và bạn cũng có thể chấp nhận hoặc từ chối các chỉnh sửa. </p> <p> Tính năng này chỉ khả dụng trên máy tính để bàn. </p> <p> </p> <h2 id=\"find-and-replace\"> 7. Tìm và thay thế </h2> <p> Nếu bạn cần thay thế nhiều trường hợp lỗi trong văn bản của mình, Google Tài liệu sẽ giúp bạn dễ dàng thực hiện việc đó với tính năng Tìm và Thay thế. </p> <p> Đối với những người dùng đã quen thuộc với tính năng Tìm và Thay thế trong Microsoft Word, tính năng này hoạt động tương tự. </p> <p> Để tìm một từ hoặc cụm từ cụ thể trong tài liệu của bạn, hãy sử dụng phím tắt <strong> Ctrl + F </strong> trên PC Windows hoặc <strong> Lệnh + F </strong> trên máy Mac. Nhập từ vào trường &quot;Tìm trong tài liệu&quot;. </p> <p> Để thay thế văn bản tìm thấy, hãy nhấp vào ba dấu chấm ở phía bên phải và chọn <strong> Tìm và thay thế </strong> . </p> <p> Sau đó, nhập văn bản vào <strong> Tìm thấy </strong> và văn bản thay thế trong <strong> Thay bằng </strong> cánh đồng. Cuộn qua các phiên bản văn bản bằng con trỏ lên và xuống, và nhấp vào <strong> Thay thế </strong> để hoán đổi chúng riêng lẻ. Hoặc bấm vào <strong> Thay thế tất cả </strong> để thay thế tất cả văn bản đã chọn cùng một lúc. </p> <p> <img alt=\"find and replace pop-up box in google docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs2-774.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-a-dictionary\"> 8. Sử dụng từ điển </h2> <p> Để giúp bạn tập trung và tránh phải chuyển đổi giữa các tab khi bạn đang tìm kiếm nghĩa của một từ, Google Tài liệu có một từ điển trong ứng dụng. </p> <p> Khi bạn đang nhập và cần tra cứu một từ, hãy đánh dấu từ đó, sau đó nhấp chuột phải và chọn <strong> Định nghĩa </strong> từ menu. Công cụ Từ điển sẽ tìm kiếm định nghĩa của từ trên internet và nó sẽ xuất hiện ở bên phải màn hình của bạn. </p> <p> <img alt=\"google docs dictionary showing the meaning of a highlighted word\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs3-123.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"add-language-accents\"> 9. Thêm trọng âm ngôn ngữ </h2> <p> Tạm biệt để ghi nhớ các phím tắt có dấu hoặc sao chép / dán các chữ cái có dấu từ các tài liệu khác. </p> <p> Để sử dụng các chữ cái có dấu, bạn sẽ phải tải xuống <a href=\"https://chrome.google.com/webstore/detail/easy-accents/njbfdnnpglelehliilonpfcbckcdhnid\" target=\"_blank\" rel=\"nofollow noopener\"> tiện ích bổ sung &quot;Dấu trọng âm dễ dàng&quot; </a> . Nó cho phép bạn chèn dấu cho 20 ngôn ngữ khác nhau trực tiếp từ một thanh bên trong tài liệu của bạn. </p> <p> Tải xuống tiện ích bổ sung Google Tài liệu bằng cách mở <strong> Công cụ </strong> menu, sau đó nhấp vào <strong> Bổ trợ </strong> và <strong> Nhận tiện ích bổ sung </strong> . Trong hộp Google Marketplace bật lên, hãy tìm kiếm <strong> Trọng âm dễ dàng </strong> và nhấp vào nút cài đặt màu xanh lam để thêm nó vào bộ sưu tập tiện ích bổ sung Google Tài liệu của bạn. </p> <p> Sau khi cài đặt, hãy nhấp vào <strong> Bổ trợ </strong> để chọn tiện ích bổ sung Easy Accents và bắt đầu thêm trọng âm chính xác vào tất cả các từ nước ngoài của bạn. </p> <p> <img alt=\"Google Docs Easy Accents add-on dahboard\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs4-248.png\" loading=\"lazy\"> </p> <p> Tiện ích bổ sung này chỉ khả dụng trên máy tính để bàn, nhưng bàn phím di động thường hỗ trợ dấu ngôn ngữ nên bạn có thể viết văn bản có dấu trọng âm trên điện thoại của mình mà không cần tiện ích bổ sung. </p> <p> </p> <h2 id=\"create-custom-shortcuts\"> 10. Tạo lối tắt tùy chỉnh </h2> <p> Hầu hết mọi người đều quen thuộc với <a href=\"https://www.makeuseof.com/microsoft-word-windows-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> Các phím tắt của Microsoft Word </a> , nhưng bạn cũng có thể tạo các phím tắt của riêng mình trong Google Tài liệu. Để tạo các phím tắt tùy chỉnh, hãy nhấp vào <strong> Công cụ&gt; Tùy chọn&gt; Thay thế. </strong> Bạn sẽ thấy rằng đã có một số phím tắt dành cho phân số và ký hiệu, (như thay đổi 3/4 thành ¾), nhưng hãy thoải mái thêm một số phím tắt của riêng bạn. </p> <p> <img alt=\"Adding customized shortcuts in Google Docs\" src=\"images/screenshot_2021-02-06-10-things-you-didn%E2%80%99t-know-you-could-do-with-google-docs5-922.png\" loading=\"lazy\"> </p> <p> Tính năng này chỉ khả dụng trên máy tính để bàn. </p> <p> </p> <h2 id=\"do-more-with-google-docs\"> Làm được nhiều việc hơn với Google Tài liệu </h2> <p> Bây giờ bạn đã học các công cụ Google Tài liệu này, bạn có thể sử dụng chúng trong khi tạo tài liệu tiếp theo của mình. Hy vọng rằng, họ làm cho mọi thứ dễ dàng hơn cho bạn! </p>"}