{"title":"5 điều có thể khiến bạn bị cấm vĩnh viễn khỏi Facebook","content":"<p> Facebook không nổi tiếng như Twitter về việc xóa tài khoản. Tuy nhiên, có một số hành vi vi phạm có thể bị cấm mà Facebook phản ứng với nhiều hơn là một nhãn cảnh báo. </p> <p> Ở đây, chúng tôi khám phá các điều khoản và điều kiện của Facebook và nơi công ty rút ra ranh giới, xem xét các ví dụ lịch sử về những người dùng bị Facebook &quot;hủy bỏ nền tảng&quot; vì hành vi của họ. </p> <h2 id=\"facebook-s-stance-on-permanent-bans\"> Lập trường của Facebook về các lệnh cấm vĩnh viễn </h2> <p> <img alt=\"Facebook on removing accounts\" src=\"images/facebook-account-removal-951.jpg\" loading=\"lazy\"> </p> <p> Không giống như các trang mạng xã hội khác, Facebook không liệt kê nhiều hành vi vi phạm dẫn đến lệnh cấm vĩnh viễn. Thay vào đó, nó trích dẫn các hành vi tái phạm thay vì mức độ nghiêm trọng của hành vi vi phạm là yếu tố chính. Do đó, về lý thuyết, bất kỳ vi phạm nào của Facebook lặp đi lặp lại thường xuyên đều có thể dẫn đến việc chặn hồ sơ. </p> <p> Tuy nhiên, rất ít hoạt động dẫn đến lệnh cấm hoàn toàn và Facebook lại lỏng lẻo một cách đáng ngạc nhiên với một số hoạt động bất hợp pháp được công nhận. Ví dụ: bán &quot;hàng hóa được quản lý&quot; như súng và cần sa không được phép trên Thị trường của Facebook, nhưng Facebook không liệt kê đó là hành vi vi phạm có thể cấm. </p> <p> Facebook thích gắn cờ hoặc xóa nội dung trên cơ sở từng bài đăng thay vì gỡ bỏ hồ sơ. Tuy nhiên, vẫn có những trường hợp ngoại lệ. </p> <p> </p> <h2 id=\"misusing-tools-and-data\"> 1. Lạm dụng công cụ và dữ liệu </h2> <p> <img alt=\"Facebook's three bannable offenses\" src=\"images/facebook-terms-of-service-283.jpg\" loading=\"lazy\"> </p> <p> Điều khoản dịch vụ của Facebook đưa ra ba hành vi vi phạm bị cấm. Đầu tiên là một tập hợp các hành động, mà phần còn lại của bài viết này sẽ xem xét chi tiết hơn. Thứ hai và thứ ba cụ thể hơn và liên quan đến việc lạm dụng các công cụ và dữ liệu của Facebook. </p> <p> Điều khoản dịch vụ phổ biến này cấm truy cập và sử dụng các phần của trang web được cho là dành riêng cho các nhà phát triển. Nó cũng cấm sử dụng các công cụ trang web công cộng theo cách cố tình độc hại, như sử dụng Facebook để phát tán vi-rút và phần mềm độc hại. </p> <p> </p> <h2 id=\"threats-to-public-safety\"> 2. Đe doạ đối với an toàn công cộng </h2> <p> <img alt=\"Zuckerberg post trump removal facebook\" src=\"images/facebook-trump-removal-914.jpg\" loading=\"lazy\"> </p> <p> Một trong những trường hợp duy nhất Facebook nói rằng họ vô hiệu hóa tài khoản là do &quot;nguy cơ thực sự gây tổn hại về thể chất hoặc đe dọa trực tiếp đến an toàn công cộng&quot;. Facebook cũng xóa các hồ sơ &quot;tuyên bố một sứ mệnh bạo lực hoặc có hành động bạo lực&quot;. </p> <p> Đây là lý do cho việc cấm tổng thống Donald Trump vô thời hạn sau một cuộc bạo động tại Điện Capitol của Hoa Kỳ vào tháng 1 năm 2021. </p> <p> </p> <h2 id=\"association-with-violent-groups\"> 3. Liên kết với các nhóm bạo lực </h2> <p> Facebook đã đưa ra lập trường về nội dung có hại và đe dọa ở mức độ liên quan vào tháng 10 năm 2020 khi xóa các hồ sơ liên quan đến âm mưu QAnon ngay cả khi các hồ sơ cá nhân không có nội dung bạo lực. Nhóm âm mưu đã dẫn đến các tập phim bạo lực kể từ năm 2016. </p> <p> </p> <p> Facebook cũng cấm nhóm nhạc Trapt vì các bài đăng liên quan đến nhóm căm thù Proud Boys. Tổ chức chính trị cực đoan này đã tham gia vào các vụ bạo lực trên đường phố ở Mỹ và Canada kể từ năm 2016. </p> <p> Công ty cũng có quyền vô hiệu hóa tài khoản nếu những tài khoản đó gây rủi ro pháp lý cho Facebook. Hơn nữa, Facebook tỏ ra cứng rắn hơn các nền tảng truyền thông xã hội khác về việc hợp tác với các tổ chức thực thi pháp luật và tiếp cận cộng đồng khi gặp loại nội dung này. </p> <p> </p> <h2 id=\"compromising-the-security-of-other-accounts\"> 4. Tăng cường tính bảo mật của các tài khoản khác </h2> <p> Một trong những hành vi vi phạm hiếm hoi có thể cấm khác mà Facebook liệt kê là &quot;xâm phạm tính bảo mật của các tài khoản khác và dịch vụ của chúng tôi&quot;. Việc tăng cường bảo mật cho các dịch vụ của Facebook nghe rất giống phần mềm độc hại và việc lạm dụng được đề cập trong điều khoản dịch vụ. Tuy nhiên, ý tưởng về việc xâm phạm tính bảo mật của các tài khoản khác lại hướng tới doxxing. </p> <p> </p> <p> Doxxing là việc phát hành thông tin nhạy cảm trong thế giới thực của người dùng mạng xã hội, có thể bao gồm địa chỉ nhà riêng hoặc cơ quan, số điện thoại cá nhân hoặc vị trí thực tế trong thời gian thực của họ. Hành động này thường được thực hiện với mục đích gây tổn hại cho người đó. </p> <p> </p> <h2 id=\"misinformation\"> 5. Thông tin sai lệch </h2> <p> </p> <p> Hướng dẫn chính thức của Facebook nói rằng Facebook không xóa thông tin sai lệch, thay vào đó họ chọn cách gắn nhãn thông tin đó để có thể đóng góp vào các cuộc đối thoại mà không gây hiểu lầm cho người khác. Tuy nhiên, một số chủ tài khoản bị đình chỉ nói rằng việc họ bị xóa là do Facebook gọi là &quot;Tin tức sai&quot;. </p> <p> Có một số lý do khiến điều này xảy ra. Trong một số trường hợp, Facebook xác định rằng tin tức sai sự thật cũng có hại cho sức khỏe cá nhân hoặc cộng đồng. </p> <p> Đây là <a href=\"https://www.bbc.com/news/technology-52501453\" target=\"_blank\" rel=\"nofollow noopener\"> Lời giải thích của Facebook về việc loại bỏ nhà lý thuyết âm mưu David Icke </a> vì tuyên bố, trong số những thứ khác, rằng Internet 5G gây ra Covid-19. Facebook cũng nói rằng Icke đã &quot;nhiều lần vi phạm&quot; các chính sách. </p> <p> </p> <h2 id=\"facebook-policies-and-your-account\"> Chính sách Facebook và Tài khoản của bạn </h2> <p> Phần lớn, Facebook không đặt vấn đề với bạn miễn là bạn không lạm dụng nền tảng này để gây hại cho người khác. Tuy nhiên, có một số vấn đề mà công ty vẽ một đường trên cát. </p> <p> Nếu bạn không vi phạm các điều khoản dịch vụ này, bạn nên giữ an toàn trước lệnh cấm vĩnh viễn của Facebook. </p>"}