{"title":"8 cách mạng xã hội có thể giúp bạn học một ngôn ngữ mới","content":"<p> Bạn có còn gặp ác mộng về những cuốn sách giáo khoa tiếng Tây Ban Nha và những lớp học tiếng Pháp kém chất lượng mà bạn nhận được ở trường không? Đừng sợ. Nhờ có internet, việc học một ngôn ngữ mới ngày nay có thể vừa thú vị vừa dễ tiếp cận. </p> <p> Đặc biệt, mạng xã hội đã giúp kết nối hàng triệu người học ngôn ngữ trên khắp thế giới. Cho dù bạn đang học thứ gì đó phổ biến như tiếng Đức hay khó hiểu hơn như tiếng Faroese, bạn sẽ tìm thấy rất nhiều nguồn tài liệu để giúp bạn trong hành trình của mình. </p> <p> Dưới đây là một số cách bạn có thể sử dụng mạng xã hội để học ngoại ngữ tiếp theo của mình. </p> <h2 id=\"join-facebook-groups\"> 1. Tham gia nhóm Facebook </h2> <p> <img alt=\"Facebook Group Search\" src=\"images/facebook-groups-178.png\" loading=\"lazy\"> </p> <p> Trên Facebook, bạn sẽ tìm thấy các nhóm cho hầu hết mọi ngôn ngữ có thể tưởng tượng được. Bạn sẽ tìm thấy các cộng đồng người nước ngoài mới chuyển đến, những người đang tìm cách cải thiện kỹ năng, cũng như các nhóm dành cho người học trên toàn thế giới. Để tận dụng tối đa trải nghiệm của mình, bạn nên tham gia cả hai. </p> <p> Để tìm đúng nhóm Facebook, bạn có thể thực hiện tìm kiếm trực tuyến đơn giản. Ngoài ra, bạn có thể tìm thấy những gì bạn đang tìm kiếm từ trong Facebook. Để thực hiện việc này, hãy vào Nhóm và tìm kiếm ngôn ngữ của bạn. Sau đó, bạn sẽ nhận được danh sách các cộng đồng phù hợp với những nhu cầu này. </p> <p> <img alt=\"Create FB Language Group\" src=\"images/facebook-language-group-119.png\" loading=\"lazy\"> </p> <p> Nếu bạn học tại một trường ngôn ngữ địa phương, bạn cũng có thể tạo nhóm của riêng mình để kết nối với các bạn cùng lớp. Để làm điều này, <strong> Đi tới Nhóm&gt; Tạo nhóm mới </strong> . Sau đó, bạn có thể chỉnh sửa cài đặt và bắt đầu mời thành viên. </p> <p> </p> <h2 id=\"make-use-of-reddit\"> 2. Sử dụng Reddit </h2> <p> <img alt=\"Facebook Search for Language\" src=\"images/language-search-reddit-980.png\" loading=\"lazy\"> </p> <p> Reddit là một diễn đàn trực tuyến nổi tiếng, là mỏ vàng cho những người học ngoại ngữ. Bạn sẽ tìm thấy các subreddits cho cả ngôn ngữ cụ thể và học ngôn ngữ chung. </p> <p> Khi bạn tham gia một subreddit, bạn sẽ khám phá ra rất nhiều mẹo và gợi ý hữu ích từ những người học khác đã đi trên con đường của bạn. Bạn cũng sẽ tìm thấy rất nhiều meme mà bạn chắc chắn sẽ liên quan đến. </p> <p> Để tìm một subreddit, hãy chuyển đến thanh tìm kiếm ở trên cùng và nhập ngôn ngữ của bạn. Sau khi kết quả được tải, bạn nên tham gia cả nhóm học cụ thể và nhóm văn hóa để tìm hiểu thêm về phong tục địa phương. </p> <p> </p> <h2 id=\"connect-with-native-speakers\"> 3. Kết nối với người nói bản ngữ </h2> <p> Cách tốt nhất để học nhanh một ngôn ngữ là nói chuyện với những người đã nói được ngôn ngữ đó. Và mạng xã hội có thể là một nơi tuyệt vời để tìm những diễn giả này. Bạn có thể cần tiếp cận với một vài người, nhưng cuối cùng, bạn sẽ tìm thấy ai đó sẵn sàng dành ra một chút thời gian để giúp bạn. </p> <p> Khi kết nối với người bản xứ trên mạng xã hội, hãy tập trung vào việc xây dựng tình bạn trước. Nếu bạn ở cùng thành phố với họ, hãy đề nghị gặp họ và trả tiền khi đi uống cà phê. Đối với những người ở xa hơn, hãy đề nghị giúp họ học một trong những ngôn ngữ bạn đã nói. </p> <p> Các bước cho những điều này tương tự trên mỗi nền tảng truyền thông xã hội. Trên Instagram hoặc Twitter, hãy theo dõi họ và gửi tin nhắn (nếu cài đặt quyền riêng tư của họ cho phép). Bạn có thể thực hiện một cách tiếp cận tương tự trên Facebook, mặc dù một số người có thể ít sẵn sàng chấp nhận lời mời kết bạn từ những người mà họ không biết. </p> <p> </p> <h2 id=\"create-your-own-social-media-content\"> 4. Tạo nội dung truyền thông xã hội của riêng bạn </h2> <p> Bạn không chỉ cần sử dụng mạng xã hội để giúp mình học ngoại ngữ. Hãy thử tạo các bài đăng của riêng bạn. Làm như vậy sẽ không chỉ giúp bạn luyện nói và viết; bạn cũng có thể khám phá những người dùng mới để thực hành cùng. </p> <p> Bạn có rất nhiều lựa chọn khi tạo nội dung. Trên Twitter, bạn có thể tham gia các cuộc trò chuyện hoặc viết một số tweet của mình bằng ngôn ngữ mục tiêu của bạn. Với Instagram, bạn có thể viết chú thích, tạo đồ họa và ghi lại cuộc nói chuyện của chính mình. </p> <p> Khi bạn tạo nội dung truyền thông xã hội của riêng mình, bạn cũng sẽ nhận được phản hồi từ người bản xứ. Bên cạnh đó, bạn cũng có thể phát triển danh mục đầu tư của mình và học một vài kỹ năng mới hữu ích. </p> <p> </p> <h2 id=\"set-your-apps-to-the-language-you-re-learning\"> 5. Đặt ứng dụng của bạn thành ngôn ngữ bạn đang học </h2> <p> Thay đổi cài đặt điện thoại là một cách dễ dàng để khiến bản thân suy nghĩ bằng ngôn ngữ mục tiêu và cảm thấy thoải mái khi đọc nó. Bạn cũng sẽ thêm hàng tá từ mới vào vốn từ vựng của mình. </p> <p> </p> <p> Tất cả các mạng xã hội lớn đều có cài đặt trong ứng dụng để bạn có thể thay đổi ngôn ngữ của mình. Trên Instagram, chẳng hạn, hãy truy cập <strong> Tài khoản&gt; Ngôn ngữ </strong> . Sau đó, bạn sẽ thấy danh sách thả xuống của tất cả các ngôn ngữ bạn có thể sử dụng. </p> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (2 Hình ảnh) </strong> <img alt=\"IG Language Settings\" src=\"images/instagram_change_settings-104.jpeg\" loading=\"lazy\"> Mở rộng <img alt=\"IG Languages iPhone\" src=\"images/ig_language-644.jpeg\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> Bạn cũng có thể thay đổi tất cả các ngôn ngữ của ứng dụng cùng một lúc bằng cách sử dụng cài đặt điện thoại của bạn. Đi đến <strong> Cài đặt </strong> &gt; <strong> Chung&gt; Ngôn ngữ &amp; Khu vực </strong> . Từ đó, bạn sẽ thấy danh sách mọi ngôn ngữ có sẵn. Lưu ý rằng đối với các ngôn ngữ nhỏ hơn, bạn có thể không tối ưu hóa được tài khoản của mình. </p> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (2 Hình ảnh) </strong> <img alt=\"iPhone Settings\" src=\"images/iphone_language-752.jpeg\" loading=\"lazy\"> Mở rộng <img alt=\"iPhone Language Change Settings\" src=\"images/iphone_language_change-904.jpeg\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> </p> <h2 id=\"make-the-most-of-hashtags\"> 6. Tận dụng tối đa Hashtags </h2> <p> Sử dụng và tìm kiếm bằng thẻ bắt đầu bằng # là một cách hiệu quả để tìm thêm người dùng bằng ngôn ngữ bạn đang học. Bằng cách sử dụng nhiều loại, bạn có thể kết nối và tiếp thu nội dung của cả người bản ngữ và những người học khác. </p> <p> Để tìm loại nội dung bạn đang tìm kiếm, hãy nghĩ về những gì người học khác sẽ sử dụng. Bạn cũng có thể tìm thấy nội dung của người bản ngữ bằng cách tìm kiếm các chủ đề hiện có ở bất kỳ quốc gia nhất định nào. Thông thường, bạn có thể tìm thấy những thứ này trên các bài viết và bài viết thịnh hành. </p> <p> Để tìm kiếm thẻ bắt đầu bằng #, hãy sử dụng chức năng tìm kiếm trên bất kỳ ứng dụng mạng xã hội nào bạn đang sử dụng. Bạn cũng có thể nhấp vào các bài đăng sử dụng chúng và tìm thấy tất cả các kết quả. </p> <p> </p> <h2 id=\"follow-accounts-in-your-target-language\"> 7. Theo dõi tài khoản bằng ngôn ngữ mục tiêu của bạn </h2> <p> <img alt=\"Social Media Spanish Account\" src=\"images/twitter_profile_spanish-408.png\" loading=\"lazy\"> </p> <p> Mọi tài khoản thú vị mà bạn theo dõi bằng tiếng Anh cũng có khả năng tương đương với ngôn ngữ mục tiêu của bạn. Đây có thể là những ấn phẩm khổng lồ, hoặc họ có thể là những diễn giả hàng ngày cảm thấy thoải mái hơn khi tạo ra công việc bằng ngôn ngữ mẹ đẻ của họ. </p> <p> </p> <p> Bạn cũng nên xem các tạp chí, đội thể thao và nghệ sĩ âm nhạc yêu thích của mình có tài khoản bằng ngôn ngữ mục tiêu của bạn hay không. Ví dụ, nhiều câu lạc bộ thể thao lớn nhất thế giới có tài khoản bằng tiếng Anh, tiếng Tây Ban Nha và hơn thế nữa. </p> <p> Khi theo dõi các tài khoản bằng ngôn ngữ bạn muốn học, một nguyên tắc chung là chỉ theo dõi những tài khoản đó nếu bạn thấy nội dung bằng tiếng Anh của họ cũng thú vị. Nếu không, bạn sẽ bỏ qua và hủy theo dõi lại sau đó. </p> <p> </p> <h2 id=\"follow-language-learning-apps-on-social-media\"> 8. Theo dõi các ứng dụng học ngôn ngữ trên mạng xã hội </h2> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (2 Hình ảnh) </strong> <img alt=\"Babbel IG Page\" src=\"images/babbel_instagram-887.jpeg\" loading=\"lazy\"> Mở rộng <img alt=\"Babbel IG Comments\" src=\"images/babbel_comments-234.jpg\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> Các ứng dụng học ngôn ngữ cũng thường có hồ sơ truyền thông xã hội hoạt động. Đây là những mẹo tuyệt vời để chọn ra những mẹo chung và liên quan đến những khó khăn chung mà mọi người phải đối mặt - cho dù họ đang học tiếng Na Uy hay tiếng Nhật. </p> <p> Một số tài khoản đáng theo dõi là Babbel, Busuu và Duolingo. </p> <p> Tuy nhiên, bạn không chỉ cần sử dụng các ứng dụng này để tiêu dùng. Vui lòng thêm suy nghĩ của bạn trong các bình luận. Bạn thậm chí có thể kết bạn với một số người bạn mới, ngay cả khi họ đang học một ngôn ngữ hoàn toàn khác với bạn. </p> <p> </p> <h2 id=\"make-learning-a-language-fun-with-social-media\"> Làm cho việc học một ngôn ngữ trở nên thú vị với phương tiện truyền thông xã hội </h2> <p> Vì vậy, bạn có nó. Giờ đây, bạn đã có thêm ý tưởng sử dụng mạng xã hội để giúp hành trình học ngoại ngữ của mình trở nên thú vị. Mặc dù công việc sách giáo khoa vẫn quan trọng, nhưng nó không phải là lựa chọn duy nhất của bạn. </p> <p> Ngay cả khi bạn không thể tối ưu hóa ứng dụng cho ngôn ngữ mục tiêu của mình, bạn vẫn sẽ tìm thấy rất nhiều người bản ngữ và bạn học để kết nối. </p> <p> Chìa khóa để học một ngôn ngữ với phương tiện truyền thông xã hội là cả thu hút và sử dụng. Khi bạn làm vậy, bạn sẽ thấy trải nghiệm của mình hoàn thiện hơn và học được những từ mà sách giáo khoa chưa bao giờ dạy bạn. </p>"}