{"title":"Bản cập nhật Microsoft Edge khổng lồ được hướng tới theo cách của bạn","content":"<p> Microsoft đang làm việc rất chăm chỉ để tạo ra trình duyệt Internet của mình, Edge, trình duyệt tốt nhất có thể. Giờ đây, công ty đang mang đến ba tính năng quan trọng cho nó và mọi thứ đang có vẻ khả quan cho tương lai của Edge. </p> <h2 id=\"what-microsoft-has-planned-for-edge\"> Những gì Microsoft đã lên kế hoạch cho Edge </h2> <p> Bản cập nhật đệm lớn đã bị bắt bởi <a href=\"https://www.windowslatest.com/2021/02/15/microsoft-edge-for-windows-10-is-getting-web-widgets-support-and-more/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows mới nhất </a> . Ba tính năng này dự kiến ​​sẽ xuất hiện trong một bản cập nhật lớn, vì vậy bạn nên để mắt đến Edge trong tương lai gần. </p> <p> Đầu tiên, Microsoft Edge đang được hỗ trợ widget web. Những tiện ích này là một cách tiện dụng để xem nhanh thông tin quan trọng trong suốt cả ngày của bạn. Gã khổng lồ phần mềm muốn thử nghiệm với các widget ở mọi hình dạng và kích cỡ, nhưng họ đã quyết định bắt đầu với một widget tin tức để khởi động mọi thứ. </p> <p> Tiếp theo, Microsoft Edge sẽ có tính năng tìm kiếm theo tab. Nếu điều này nghe quen thuộc với bạn, có thể là do bạn đã đọc <a href=\"https://www.makeuseof.com/microsoft-edge-chrome-tab-search/\" target=\"_blank\" rel=\"nofollow noopener\"> suy đoán ban đầu về việc Edge nhận được một công cụ tìm kiếm tab </a> . May mắn thay, suy đoán này đã trở thành hiện thực và Microsoft có kế hoạch đưa tính năng Chrome vào Edge. </p> <p> Cuối cùng, bạn sẽ có thể quản lý tất cả các tiện ích mở rộng Edge của mình từ một menu duy nhất. Nó sẽ xuất hiện dưới dạng một mảnh ghép trên thanh tác vụ của trình duyệt và khi bạn nhấp vào nó, nó sẽ hiển thị cho bạn mọi tiện ích mở rộng bạn đã cài đặt cùng với một cách nhanh chóng để bật và tắt từng tiện ích mở rộng. </p> <p> Không chắc khi nào chính xác bản cập nhật này sẽ phát hành, nhưng Windows Latest đã ghim nó cho &quot;bản cập nhật lớn tiếp theo&quot;. Như vậy, sẽ không quá lâu cho đến khi Microsoft Edge trở thành một lựa chọn hấp dẫn cho những người đang tìm kiếm một cái gì đó mới. </p> <p> </p> <h2 id=\"microsoft-edge-the-next-big-thing\"> Microsoft Edge: Điều lớn tiếp theo? </h2> <p> Trong một thời gian rất dài, các trình duyệt của Microsoft được coi là trình quản lý tải xuống tiên tiến để cài đặt Chrome hoặc Firefox. Tuy nhiên, kể từ khi Microsoft áp dụng cơ sở mã Chromium cho trình duyệt của mình, nó đã trở thành trò cười của thế giới trình duyệt. </p> <p> <a href=\"https://gs.statcounter.com/browser-market-share/all/united-states-of-america\" target=\"_blank\" rel=\"nofollow noopener\"> StatCounter </a> liệt kê Microsoft Edge là trình duyệt Windows được sử dụng nhiều thứ hai ở Hoa Kỳ vào thời điểm viết bài. Chúng ta đã biết rằng Firefox đã bị Edge bỏ lại trong bụi, nhưng kể từ đó, khoảng cách ngày càng rộng hơn. </p> <p> Giờ đây, Edge chiếm 5,25% thị phần tại Mỹ, so với 3,35% mà Firefox sở hữu. Cả hai đều khác xa so với 45,83% của Chrome, nhưng đó là một bước khởi đầu. </p> <p> Như vậy, nếu trước đây bạn đã chú ý đến trình duyệt của Microsoft, thì bây giờ là thời điểm tốt để cho nó cơ hội thứ hai. Biết đâu, bạn có thể bị trình duyệt tốt nhất của Microsoft chiến thắng! </p> <p> </p> <h2 id=\"pushing-the-browser-to-the-edge\"> Đẩy trình duyệt sang cạnh </h2> <p> Nếu bạn không phải là một fan hâm mộ của các trình duyệt của Microsoft trong quá khứ, thì đây là thời điểm tốt để tham gia và xem những gì rắc rối đang xảy ra. Một bản cập nhật lớn đang được thực hiện và nó chỉ sẽ trở nên tốt hơn từ đây. </p> <p> Microsoft biết rằng đó là một công thức chiến thắng. Trên thực tế, công ty gần đây đã báo cáo rằng 600 triệu người trên thế giới hiện đã sử dụng Edge để duyệt web. </p> <p> <small> Tín dụng hình ảnh: DANIEL CONSTANTE / <a href=\"https://www.shutterstock.com/image-photo/smart-phone-computer-new-microsoft-edge-1629340549\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}