{"title":"Thực phẩm bổ não có kích thước nhỏ: 5 trang web để học những điều mới trong những cách ngắn và thú vị","content":"<p> Phim tài liệu kéo dài chưa đầy một phút. Các tập podcast chỉ 60 giây. Infographics hoạt hình để giải thích các chủ đề phức tạp. Đây là nơi bạn có thể tìm hiểu thêm về thế giới trong những viên kiến ​​thức hấp dẫn nhanh chóng. </p> <p> Trong thời đại chỉ có khoảng thời gian chú ý ngắn và 280 bản cập nhật nhân vật, ngay cả việc học cũng cần phải được thực hiện với liều lượng rất nhỏ. Đó là lý do tại sao có những người sáng tạo nội dung chuyên tạo ra những tác phẩm mang tính thông tin và giải trí mà hầu như không mất nhiều thời gian trong cuộc sống bận rộn của chúng ta. Từ những bộ phim tài liệu nhỏ về những người và chủ đề hấp dẫn đến những hướng dẫn trên mạng xã hội về các chủ đề thịnh hành, hãy cung cấp cho tâm trí bạn một số thức ăn cho não nhỏ để nhai. </p> <h2 id=\"60-second-docs-web-profiles-of-interesting-people-and-topics-in-60-seconds\"> 1. <a href=\"https://www.60secdocs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> 60 tài liệu giây </a> (Web): Hồ sơ của những người và chủ đề thú vị trong 60 giây </h2> <p> </p> <p> Rảnh không? 60 Second Docs có một câu chuyện thú vị để kể cho bạn nghe về một người thú vị và đến lượt nó, một chủ đề thú vị. Mỗi bộ phim tài liệu chỉ dài 60 giây, nhưng nó bao gồm những điều tốt nhất bạn cần biết về chủ đề này. </p> <p> Phần thú vị nhất là 60 Second Docs tập trung vào hồ sơ của những người thực thay vì các khái niệm hoặc xu hướng. Thông thường, người đó đang làm điều gì đó độc đáo, cho dù đó là bắt đầu một xu hướng mới, khám phá một chủ đề mới hoặc đẩy ranh giới theo một cách nào đó. Bằng cách viết về con người, bạn không chỉ có được cái nhìn sâu sắc hơn về khía cạnh con người của chủ đề độc đáo mà còn cảm thấy chân thực và giàu cảm xúc hơn. </p> <p> Tất cả 60 Tài liệu thứ hai đều có sẵn trên kênh YouTube hoặc các trình xử lý phương tiện truyền thông xã hội của họ. Bạn nên theo dõi họ trên bất kỳ mạng xã hội nào mà bạn thường xuyên, xem toàn bộ video mới bất cứ khi nào họ đăng cập nhật. </p> <p> Nếu bạn thích phim tài liệu dài hơn, hãy kiểm tra <strong> Lựa chọn chính thức </strong> trên trang web 60 Second Docs. Ở đây, các biên tập viên chọn những đoạn phim tài liệu dài 10-20 phút mà những người khác đã quay, về những chủ đề mà họ nghĩ rằng bạn nên xem. </p> <p> </p> <h2 id=\"so-you-want-to-talk-about-instagram-mini-guides-to-political-and-social-topics\"> 2. <a href=\"https://www.instagram.com/soyouwanttotalkabout/?hl=en\" target=\"_blank\" rel=\"nofollow noopener\"> Vì vậy, bạn muốn nói về </a> (Instagram): Hướng dẫn nhỏ về các chủ đề chính trị và xã hội </h2> <p> <img alt=\"So You Want To Talk About offers mini-guides on Instagram to trending political and social issues\" src=\"images/short-mini-brain-food-so-you-want-to-talk-about-868.jpg\" loading=\"lazy\"> </p> <p> Ai biết rằng trong một thế giới ảnh tự chụp của người có ảnh hưởng và thẻ bắt đầu bằng # được quảng bá thương hiệu, Instagram sẽ cung cấp một nền tảng để giáo dục? So You Want To Talk About (Sywtta) sử dụng các định dạng bài đăng nhiều hình ảnh của Instagram để tạo các hướng dẫn nhỏ về các chủ đề chính trị và xã hội. </p> <p> Các chủ đề mà Sywtta chọn thường liên quan đến các chủ đề thịnh hành như hủy bỏ khoản vay của sinh viên, quyền và lịch sử của người da đen, ngụy biện logic, vắc xin COVID-19, v.v. Mỗi trang trình bày sử dụng kiểu chữ được định dạng đẹp mắt để giáo dục bạn về chủ đề này và hơn thế nữa, mỗi trang trình bày giống như một bài học nhỏ. Mỗi hướng dẫn trở thành một khóa học nhanh chóng và đầy đủ thông tin, mà không quá nặng về dữ liệu. </p> <p> Vào thời điểm mà bạn cần phải cảnh giác <a href=\"https://www.makeuseof.com/apps-read-objective-news-articles-and-find-biased-or-fake-news/\" target=\"_blank\" rel=\"nofollow noopener\"> tin tức thiên vị hoặc giả mạo </a> , cũng cần lưu ý những triết lý của những gì bạn đang đọc. Khi nói đến chính trị, Sywtta tuyên truyền quan điểm của các chính sách tiến bộ và cánh tả. </p> <p> </p> <h2 id=\"60-second-science-podcast-short-audio-explanations-of-science-health-and-technology\"> 3. <a href=\"https://www.scientificamerican.com/podcast/60-second-science\" target=\"_blank\" rel=\"nofollow noopener\"> Khoa học 60 giây </a> (Podcast): Giải thích bằng âm thanh ngắn về Khoa học, Sức khỏe và Công nghệ </h2> <p> <img alt=\"60 Second Science is a podcast that talks about one topic in science, medicine, or technology in a short episode of less than 5 minutes \" src=\"images/short-mini-brain-food-60-second-science-podcast-908.jpg\" loading=\"lazy\"> </p> <p> Nếu bạn thích nghe thông tin của mình hơn là đọc hoặc xem, hãy xem podcast Khoa học 60 giây. Được thực hiện bởi nhóm tại Scientific American, podcast hàng ngày này đề cập đến các chủ đề trong khoa học, y học và công nghệ, đồng thời giải thích một chủ đề trong thời gian ngắn. Mặc dù nó không còn giới hạn thời gian dài một phút, nhưng mỗi tập vẫn có thời lượng dưới năm phút. </p> <p> Mỗi podcast có những người dẫn chương trình khác nhau từ nhóm Scientific American, bao gồm các chủ đề như COVID, động vật và chim, DNA và y học, khoa học môi trường, v.v. Chúng có giá trị sản xuất cao, kết hợp âm thanh thực tế về điểm thảo luận và thường thêm đoạn thoại từ các chuyên gia. </p> <p> Để duyệt qua kho lưu trữ của các tập trước, hãy truy cập trang web chính thức của Khoa học 60 giây. Tại đây, bạn có thể lọc các tập theo chủ đề (sức khỏe, tâm trí, tính bền vững, công nghệ, khoa học). Nếu bạn không muốn thông tin thành từng đoạn ngắn, hãy thử podcast Science Talk có thời lượng đầy đủ. </p> <p> </p> <h2 id=\"animagraffs-web-high-quality-animated-infographics-to-explain-things\"> 4. <a href=\"https://animagraffs.com/\" target=\"_blank\" rel=\"nofollow noopener\"> Animagraffs </a> (Web): Đồ họa thông tin động chất lượng cao để giải thích mọi thứ </h2> <p> <img alt=\"Animagraffs explains complex topics in short animated infographic GIFs\" src=\"images/short-mini-brain-food-animagraffs-194.jpg\" loading=\"lazy\"> </p> <p> Tiền điện tử hoạt động như thế nào? Bảo hiểm ô tô có những nội dung nào? Làm thế nào để bạn thực hiện một cuộc đi dạo trên mặt trăng? Nhà thiết kế kiêm nhà làm phim hoạt hình Jacob O&#39;Neal chia các chủ đề phức tạp thành những lời giải thích đơn giản và vẽ đồ họa thông tin hoạt hình chất lượng cao để minh họa chúng. </p> <p> Animagraffs là một bộ sưu tập các lời giải thích ngắn gọn thông qua các hướng dẫn trực quan, sử dụng các ảnh GIF động. Jacob sử dụng nhiều kỹ thuật thiết kế khác nhau, chẳng hạn như mặt cắt ngang để minh họa mọi bộ phận của dụng cụ hoặc hình ảnh lớn với các bộ phận chuyển động mà bạn có thể phóng to và thu nhỏ như Google Maps. Mỗi phong cách phù hợp với chủ đề bạn đang học. </p> <p> Các chủ đề cũng có phạm vi rộng, bao gồm cách một con báo gêpa chạy, cách ô tô điện hoạt động, cách loa tạo ra âm thanh, v.v. Bạn cũng nên xem phần &quot;Công việc khách hàng&quot;, nơi Jacob giới thiệu các nhiệm vụ được trả tiền cho các thương hiệu. Đừng lo lắng, mặc dù chúng là quảng cáo, nhưng chúng vẫn mang lại nhiều thông tin và thú vị. </p> <p> </p> <h2 id=\"great-big-story-youtube-fascinating-and-interesting-true-short-documentaries\"> 5. <a href=\"https://www.youtube.com/channel/UCajXeitgFL-rb5-gXI-aG8Q\" target=\"_blank\" rel=\"nofollow noopener\"> Câu chuyện lớn tuyệt vời </a> (YouTube): Phim tài liệu ngắn có thật hấp dẫn và thú vị </h2> <p> <img alt=\"Great Big Story makes mini documentaries of 5 minutes on fascinating people, world facts, and interesting information\" src=\"images/short-mini-brain-food-great-big-story-youtube-358.jpg\" loading=\"lazy\"> </p> <p> Great Big Story kết thúc hoạt động vào cuối năm 2020, nhưng không phải trước khi để lại những bộ phim tài liệu ngắn thú vị có giá trị 5 năm. Đi sâu vào kho lưu trữ để tìm các video dài khoảng 5 phút về một loạt các chủ đề thú vị và những người hấp dẫn từ khắp nơi trên thế giới. </p> <p> Từ một bộ phim chiếu trong rạp chiếu ở Ấn Độ trong 24 năm đến món kem Thổ Nhĩ Kỳ tuyệt vời không tan chảy, mỗi video ngắn là một cái nhìn chất lượng cao và được nghiên cứu kỹ lưỡng về chủ đề này. Trong một sự thay đổi so với hầu hết các video như vậy, những người tạo video của Great Big Story thường đi khắp thế giới để đưa mình vào giữa câu chuyện. Sắp xếp theo phổ biến nhất hoặc sử dụng các danh sách phát tùy chỉnh khác nhau do người sáng tạo đề xuất. </p> <p> Trên kênh, bạn cũng sẽ tìm thấy một số video dài hơn, có độ dài khoảng 10 đến 15 phút. Đây thường là danh sách và tổng hợp, bao gồm một vài clip từ các video ngắn hơn. Nếu bạn có thời gian để tìm hiểu thêm về thế giới xung quanh chúng ta, bạn không thể sai lầm với những điều này. Ngay cả sau khi đóng cửa chớp, Great Big Story vẫn là một trong những câu chuyện <a href=\"https://www.makeuseof.com/tag/fascinating-educational-youtube-channels/\" target=\"_blank\" rel=\"nofollow noopener\"> các kênh hấp dẫn và giáo dục trên YouTube </a> . </p> <p> </p> <h2 id=\"use-drip-learning-to-conquer-large-subjects\"> Sử dụng phương pháp học nhỏ giọt để chinh phục các đối tượng lớn </h2> <p> Các trang web và podcast này tập trung vào việc biến mỗi chủ đề mới thành một gói thông tin nhỏ gọn và giải trí. Đó là một cách hay để học những điều mới trong những khoảnh khắc nhỏ. Nhưng bạn cũng có thể áp dụng triết lý tương tự để học về các chủ đề phức tạp hơn và lớn hơn. </p> <p> Càng ngày, học tập nhỏ giọt hoặc đào tạo vi mô là một cách phổ biến để có được nền giáo dục. Bằng cách nhận <a href=\"https://www.makeuseof.com/tag/reap-benefits-microlearning-bite-size-lessons-every-day/\" target=\"_blank\" rel=\"nofollow noopener\"> bài học nhỏ mỗi ngày </a> , bạn có thể giải quyết các chủ đề như lập trình, thiết kế, phát triển ứng dụng, quản lý sản phẩm, v.v. Tìm kiếm nhanh trên web sẽ giúp bạn tìm thấy phiên bản học tập nhỏ giọt của bất kỳ thứ gì bạn đang tìm kiếm để tự đào tạo. </p>"}