{"title":"BitPay mang Bitcoin cho Apple Pay","content":"<p> Người dùng BitPay ở Hoa Kỳ hiện có thể thêm thẻ bitcoin trả trước của họ vào ứng dụng Wallet của Apple và <a href=\"https://www.makeuseof.com/tag/use-apple-pay-buy-things-iphone/\" target=\"_blank\" rel=\"nofollow noopener\"> sử dụng nó để thanh toán mọi thứ bằng Apple Pay </a> . Những khách hàng không phải của Apple sẽ sớm có thể thêm thẻ BitPay mang thương hiệu MasterCard của họ vào Google Pay và Samsung Pay. </p> <h2 id=\"how-to-add-your-bitpay-card-to-apple-wallet\"> Cách thêm thẻ BitPay của bạn vào Apple Wallet </h2> <p> Để thêm thẻ BitPay của bạn vào thiết bị Apple, hãy mở ứng dụng Wallet trên iPhone của bạn và nhấn vào &quot;+&quot; ở góc trên cùng bên phải, sau đó làm theo hướng dẫn trên màn hình để hoàn tất việc thêm thẻ. </p> <p> Với BitPay của bạn trong ứng dụng Wallet, bạn có thể thêm thẻ vào Apple Pay bằng cách truy cập <strong> Cài đặt&gt; Wallet &amp; Apple Pay </strong> , sau đó nhấn vào tùy chọn có nhãn &quot;Thêm thẻ&quot;. Để trở thành người dùng BitPay và đặt mua thẻ trả trước của bạn, hãy tải xuống ứng dụng Ví BitPay từ <a href=\"https://apps.apple.com/app/bitpay-secure-bitcoin-wallet/id1149581638\" target=\"_blank\" rel=\"nofollow noopener\"> Cửa hàng ứng dụng </a> . </p> <p> </p> <h2 id=\"a-new-way-to-spend-with-apple-pay\"> Một cách mới để chi tiêu với Apple Pay </h2> <p> Một bài đăng trên <a href=\"https://bitpay.com/blog/the-bitpay-prepaid-mastercard-r-supports-apple-pay-r-for-an-easy-shopping-experience/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog BitPay </a> cho biết thêm thẻ BitPay vào Apple Pay là một cách thuận tiện để chi tiêu tiền điện tử ở nhiều nơi hơn trước đây. &quot;Chúng tôi có hàng nghìn khách hàng sử dụng ứng dụng Ví BitPay sử dụng Thẻ BitPay, những người luôn tìm kiếm các địa điểm và cách mới để chi tiêu tiền điện tử của họ&quot;, Giám đốc điều hành BitPay Stephen Pair cho biết trong một <a href=\"https://www.businesswire.com/news/home/20210212005047/en/BitPay-Card-Adds-Support-for-Apple-Pay\" target=\"_blank\" rel=\"nofollow noopener\"> thông cáo báo chí </a> . </p> <p> </p> <p> Với Apple Pay, chủ sở hữu thẻ BitPay có thể mua hàng an toàn không tiếp xúc tại các cửa hàng thực, ứng dụng hỗ trợ Apple Pay và trên web. Công ty lưu ý rằng khách hàng đang chờ giao thẻ nhựa có thể thêm đối tác ảo của mình vào Apple Wallet thông qua ứng dụng BitPay Wallet chính thức. Làm như vậy sẽ cho phép bạn bắt đầu chi tiêu ngay lập tức. </p> <p> </p> <h2 id=\"what-is-the-bitpay-card\"> Thẻ BitPay là gì? </h2> <p> Là thẻ trả trước sử dụng mạng Mastercard, thẻ BitPay giúp dễ dàng thực hiện cả thanh toán không tiếp xúc và thanh toán bằng mã PIN, cũng như rút tiền mặt từ bất kỳ máy ATM tương thích nào. Với ứng dụng này, khách hàng có thể thực hiện những việc như xem số dư của mình, yêu cầu mã PIN mới, tải lại ngay lập tức, cũng như chuyển đổi tiền điện tử thành tiền tệ fiat (sau đó được nạp vào thẻ, sẵn sàng chi tiêu ở bất kỳ nơi nào chấp nhận ghi nợ Mastercard trên toàn cầu). </p> <blockquote> <p> Đối với người dùng blockchain mạnh mẽ, ứng dụng BitPay Wallet hỗ trợ một loạt các tùy chọn để mua và lưu trữ tiền điện tử cũng như thanh toán trực tuyến. Người dùng có thể mua ngay thẻ quà tặng từ hàng trăm nhà bán lẻ hàng đầu tại cửa hàng và trực tuyến. </p> </blockquote> <p> Thẻ có chip EMV và có thể được khóa trong trường hợp khẩn cấp bằng ứng dụng. </p> <p> Theo công ty, hỗ trợ cho Google Pay và Samsung Pay được lên kế hoạch cho &quot;cuối quý này&quot;. Đối với ứng dụng BitPay, nó hiện hỗ trợ Bitcoin, Bitcoin Cash và Ether, cũng như bốn loại tiền mã hóa được chốt bằng đô la, USDC, GUSD, PAX và BUSD. </p>"}