{"title":"Kiểm tra Phiên bản Trình duyệt của Microsoft &amp; # 039; s xCloud","content":"<p> Nếu bạn đã háo hức chờ đợi tin tức trên cổng trình duyệt xCloud, thì hôm nay là ngày may mắn của bạn vì bạn có thể xem qua nó thực sự trông như thế nào. </p> <h2 id=\"testers-reveal-xcloud-browser-screenshots\"> Người kiểm tra tiết lộ ảnh chụp màn hình trình duyệt xCloud </h2> <p> xCloud hiện có sẵn trên một loạt thiết bị, nhưng chúng tôi vẫn đang chờ Microsoft phát hành phiên bản trình duyệt chính thức. </p> <p> Thông tin chi tiết khá ít ỏi ... cho đến nay. Theo một báo cáo của <a href=\"https://www.theverge.com/2021/2/15/22283739/microsoft-xcloud-web-screenshots-cloud-gaming-streaming-browser-features\" target=\"_blank\" rel=\"nofollow noopener\"> The Verge </a> &quot;Các nguồn tin quen thuộc với các kế hoạch Xbox của Microsoft&quot; khẳng định &quot;các nhân viên hiện đang thử nghiệm một phiên bản web của xCloud trước khi xem trước công khai&quot;. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Đây là cái nhìn đầu tiên về xCloud của Microsoft cho web <a href=\"https://t.co/kIjB9tIGoQ\"> https://t.co/kIjB9tIGoQ </a> <a href=\"https://t.co/4i2yGPxkru\"> pic.twitter.com/4i2yGPxkru </a></p> - The Verge (@verge) <a href=\"https://twitter.com/verge/status/1361276592052449280?ref_src=twsrc%5Etfw\"> Ngày 15 tháng 2 năm 2021 </a></blockquote>  <p> Đừng quên, đây chỉ là những hình ảnh từ những người thử nghiệm, có nghĩa là — trong khi điều đó khó xảy ra — Microsoft có thể thay đổi hoàn toàn giao diện của phiên bản trình duyệt xCloud. </p> <p> Từ ảnh chụp màn hình, có vẻ như xCloud được thiết lập giống như phiên bản Android, có sẵn trên điện thoại thông minh và máy tính bảng. </p> <p> Bạn có thể thấy các trò chơi được thêm gần đây ở đầu ảnh chụp màn hình, theo sau là phần &quot;Sắp ra mắt&quot;. Bên dưới đó, bạn có nhiều tùy chọn khác nhau để chọn thể loại trò chơi mà bạn chọn, với thư viện trò chơi xCloud đầy đủ có sẵn ở cuối trang. </p> <p> </p> <h2 id=\"how-do-you-access-xcloud-in-your-browser\"> Làm cách nào để bạn truy cập xCloud trong trình duyệt của mình? </h2> <p> Hiện tại, bạn không thể. Phiên bản công khai của cổng web của xCloud chưa khả dụng. Có nghĩa là bạn phải đợi thêm một thời gian nữa nếu muốn truy cập xCloud thông qua trình duyệt của mình. Theo cáo buộc, Microsoft có kế hoạch tiết lộ dịch vụ công khai vào quý 2 năm 2021. </p> <p> Cho đến lúc đó, bạn sẽ phải tìm các phương pháp truy cập xCloud khác. Hiện tại, bạn chỉ có thể truy cập dịch vụ trò chơi đám mây trên thiết bị Android (bạn cần phiên bản trình duyệt để chơi trên iOS, nhờ <a href=\"https://www.makeuseof.com/microsoft-plans-sneak-xcloud-around-apples-rules/\" target=\"_blank\" rel=\"nofollow noopener\"> cuộc tranh cãi giữa Apple và Microsoft </a> ). </p> <p> </p> <h2 id=\"can-you-access-xcloud-games-any-other-way\"> Bạn có thể truy cập trò chơi xCloud bằng bất kỳ cách nào khác không? </h2> <p> Vâng, có và không. Bạn không thể truy cập bất kỳ tiêu đề nào trên xCloud, có thể nói như vậy. Không trừ khi bạn sử dụng thiết bị Android và ứng dụng Game Pass chính thức để làm như vậy. </p> <p> Tuy nhiên, các trò chơi có sẵn trên dịch vụ trò chơi đám mây của Microsoft đều có trên Game Pass. Trên thực tế, bạn có quyền truy cập vào xCloud như một phần của đăng ký Game Pass Ultimate. Vì vậy, bạn vẫn có thể truy cập các trò chơi đó qua Xbox hoặc PC Windows. </p> <p> Vì vậy, trong một từ, có. Bạn có thể truy cập các trò chơi đó theo cách khác. Chỉ không sử dụng xCloud, trừ khi bạn có quyền truy cập vào phiên bản Android. </p> <p> </p> <h2 id=\"xcloud-coming-soon-to-an-ios-device-near-you\"> xCloud: Sắp có thiết bị iOS gần bạn </h2> <p> <img alt=\"Project xCloud on multiple devices\" src=\"images/xcloud-stick-reveal-featured-931.jpg\" loading=\"lazy\"> </p> <p> Bạn sẽ không phải đợi lâu cho đến khi có thể nắm bắt được nền tảng trò chơi đám mây của Microsoft. Khi xCloud đã trải qua quá trình thử nghiệm, Microsoft sẽ thực hiện bất kỳ thay đổi cần thiết nào trước khi cho phép tất cả chúng ta xem xét và hy vọng không lâu sau đó, họ cũng sẽ chơi thử. </p>"}