{"title":"Canon ra mắt ứng dụng Photo Culling giúp tìm kiếm những bức ảnh đẹp nhất của bạn","content":"<p> Đằng sau hầu hết mọi bức ảnh hoàn hảo là một cuộn camera chứa đầy những bức ảnh khác trông giống hệt như nó. Không có gì lạ khi các nhiếp ảnh gia hầu như luôn giữ nút chụp của họ ở chế độ thấp, sợ rằng họ có thể bỏ lỡ một khoảnh khắc thoáng qua. </p> <p> Xem qua hàng chục hoặc thậm chí có thể hàng trăm bức ảnh để chọn ảnh yêu thích của bạn và xóa dung lượng lưu trữ có thể là một quá trình dài và khó chịu. Rất may, Canon đã phát hành một ứng dụng mới tự động làm điều đó cho bạn. </p> <h2 id=\"easily-take-a-roll-of-photos-down-to-the-best-few\"> Dễ dàng tổng hợp các bức ảnh xuống một vài bức ảnh đẹp nhất </h2> <p> <a href=\"https://www.usa.canon.com/internet/portal/us/home/explore/solutions-services/mobile-apps/photo-culling-app\" target=\"_blank\" rel=\"nofollow noopener\"> Canon Hoa Kỳ </a> đã khởi chạy một ứng dụng tuyển chọn ảnh trên <a href=\"https://apps.apple.com/us/app/photo-culling/id1522370889\" target=\"_blank\" rel=\"nofollow noopener\"> Cửa hàng ứng dụng </a> cho phép bạn nhanh chóng và dễ dàng tìm thấy những bức ảnh đẹp nhất của mình. Bản thân ứng dụng này miễn phí, nhưng để sử dụng, bạn sẽ phải đăng ký với giá 14,99 USD / năm hoặc 2,99 USD / tháng. Cả hai tùy chọn đăng ký đều có bản dùng thử ba ngày. </p> <p> <img alt=\"An example of photo culling in the Canon app\" src=\"images/canon-photo-culling-example-842.png\" loading=\"lazy\"> </p> <p> Phó chủ tịch điều hành Canon Hoa Kỳ Tatsuro &quot;Tony&quot; Kano, giải thích: </p> <blockquote> <p> Trong thế giới luôn thay đổi và choáng ngợp ngày nay, nơi hàng nghìn bức ảnh được chụp và lưu trữ trong điện thoại thông minh của một người, người tiêu dùng cần một công cụ ảnh chuyên nghiệp, đáng tin cậy và trực quan để giúp họ quyết định những bức ảnh đẹp nhất dựa trên nhiều năm kiến ​​thức và công nghệ đáng tin cậy. </p> </blockquote> <p> Ứng dụng của Canon, có tên đơn giản là Photo Culling, hoạt động dựa trên một AI có tên gọi là Photography Intelligence Learning hay viết tắt là PHIL. PHIL gợi ý ảnh nào bạn nên giữ và ảnh nào bạn nên xóa dựa trên tùy chọn lọc ảnh nào bạn chọn. </p> <p> Tùy chọn đầu tiên, <strong> Toàn bộ Culling </strong> , thật tuyệt vời cho <a href=\"https://www.makeuseof.com/tag/14-tips-better-group-portrait-photographs/\" target=\"_blank\" rel=\"nofollow noopener\"> chụp ảnh chân dung tốt hơn </a> . Khi tùy chọn này được chọn, PHIL sẽ xác định những bức ảnh đẹp nhất của bạn bằng cách cho điểm chúng dựa trên bốn yếu tố: độ sắc nét, độ nhiễu, cảm xúc và liệu đối tượng của bạn có nhắm mắt hay không (nếu có). </p> <p> Trong khi đó, <strong> Tương tự Culling </strong> tùy chọn chọn những bức ảnh đẹp nhất của bạn bằng cách so sánh điểm số giữa các bức ảnh tương tự. Ví dụ: giả sử bạn đã chụp một loạt ảnh về những đám mây, và sau đó là một loạt ảnh về một số bông hoa. Ứng dụng sẽ tách ảnh đám mây và ảnh hoa thành các nhóm riêng biệt. </p> <p> <img alt=\"An example of photo score comparison in the Canon app\" src=\"images/canon-photo-scoring-example-921.png\" loading=\"lazy\"> </p> <p> Cho dù bạn chọn tùy chọn chọn lọc nào, nếu điểm của ảnh cao hơn điểm mục tiêu mà bạn đã đặt, thì ảnh đó được coi là người giữ. Sau đó PHIL sẽ đề xuất xóa các ảnh còn lại không đạt điểm đủ cao. Trong trường hợp bạn không đồng ý với PHIL, đừng lo lắng. Bạn vẫn có toàn quyền kiểm soát tất cả các cảnh quay của mình. </p> <p> </p> <p> Các tính năng khác của ứng dụng bao gồm số lượng ảnh và thông tin hiển thị không gian lưu trữ, album ảnh, cài đặt thông số cho điểm ảnh và tùy chọn sử dụng chế độ tối. </p> <p> </p> <h2 id=\"will-you-download-canon-s-photo-culling-app\"> Bạn sẽ tải xuống ứng dụng Photo Culling của Canon chứ? </h2> <p> Có vẻ như ứng dụng tuyển chọn ảnh của Canon có mọi thứ bạn cần để làm cho quá trình chọn những bức ảnh đẹp nhất của bạn bớt tẻ nhạt hơn. Tuy nhiên, vào cuối ngày, bạn sẽ quyết định xem liệu bạn có ghét việc kiểm duyệt ảnh đến mức đủ để biện minh cho việc trả tiền cho một việc mà bạn có thể tự làm hay không (mặc dù có thể rất chậm và khiến bạn cảm thấy nhàm chán). </p> <p> Tại thời điểm viết bài, ứng dụng này không có sẵn cho Android, nhưng có lẽ Canon có điều đó trong các thẻ cho tương lai. </p>"}