{"title":"Game nhập vai trên máy tính so với game nhập vai cổ điển: CRPG có ý nghĩa gì vào năm 2021?","content":"<p> Lịch sử của Game nhập vai trên máy tính cũng lâu dài như lịch sử của chính trò chơi điện tử, cùng nhau phát triển và phát triển qua nhiều năm. Và cũng giống như CRPG phát triển, cải thiện đồ họa, thêm hoặc bỏ cơ chế chơi trò chơi, thì ý nghĩa và thuật ngữ được sử dụng để mô tả chúng cũng vậy. </p> <p> Từ viết tắt CRPG, theo truyền thống là viết tắt của Game Nhập vai Máy tính, đã mở rộng ý nghĩa của nó theo thời gian để bao gồm các game nhập vai cho các nền tảng khác nhau. Bây giờ, nó đã được áp dụng một ý nghĩa mới. Mặc dù ý nghĩa mới của nó không hoàn toàn khác với ý nghĩa ban đầu, nhưng giờ đây nó mô tả một thể loại phụ RPG cụ thể. </p> <h2 id=\"the-history-of-crpgs\"> Lịch sử của CRPG </h2> <p> <img alt=\"tabletop-rpg\" src=\"images/tabletop-rpg-242.jpg\" loading=\"lazy\"> </p> <p> Lịch sử của CRPG bắt đầu từ những năm 1970 với sự ra đời của trò chơi điện tử chuyển thể sớm nhất của tựa game nhập vai trên bàn Dungeons &amp; Dragons, Dungeon. Trò chơi ban đầu có sẵn trên Atari (bạn có thể chơi nó qua <a href=\"https://www.makeuseof.com/what-is-plex-arcade-how-it-works/\" target=\"_blank\" rel=\"nofollow noopener\"> Plex Arcade, một dịch vụ phát trực tuyến trò chơi trên Plex </a> ). </p> <p> Mặc dù lối chơi của Dungeon chủ yếu dựa trên văn bản, nhưng nó đã mô tả đầy đủ các chuyển động của nhóm nhiều nhân vật của bạn trong bối cảnh giả tưởng đồng thời thực hiện hầu hết các nguyên lý cơ bản của Dungeons &amp; Dragons. </p> <p> Hồi đó, chúng tôi gắn nhãn chúng là Game nhập vai trên máy tính để tạo sự khác biệt với các game nhập vai trên bàn, vốn phổ biến hơn rất nhiều vào thời điểm đó và chúng tôi chỉ đơn giản biết chúng là game nhập vai. </p> <p> Vào những năm 1990, các CRPG đang nở rộ, giờ đây có thể hiển thị một cách đầy đủ thế giới giả tưởng, ít nhất là ở góc nhìn từ trên xuống hoặc chế độ xem đẳng áp. Đó là trường hợp của Ultima VII, một trong những CRPG tương tác nhất mà người viết này đã chơi. </p> <p> Hầu hết mọi thứ bạn có thể nhìn thấy bạn đều có thể di chuyển hoặc tương tác: Bạn có thể chế tạo vũ khí, chơi nhạc cụ và thậm chí mang thành viên đã chết của mình ra khỏi ngục tối đến tận phòng ngai vàng của nhà vua để họ hồi sinh! </p> <p> Baldur&#39;s Gate là một trong những trò chơi mô phỏng gần nhất trải nghiệm RPG trên bàn. Nó đã điều chỉnh bộ quy tắc của Dungeons &amp; Dragons Phiên bản thứ 2 (AKA Advanced Dungeons &amp; Dragons) thành một isometric <a href=\"https://www.makeuseof.com/what-are-rtwp-games/\" target=\"_blank\" rel=\"nofollow noopener\"> CRPG có thể tạm dừng thời gian thực </a> . Những loại CRPG này nhấn mạnh vào chiến thuật trong trận chiến, sự tiến triển của nhân vật, ra quyết định và khuyến khích khám phá. </p> <p> </p> <p> Ngày nay, trong một thế giới mà máy chơi game đang thống trị thị trường, trò chơi điện tử nhập vai đã trở nên phổ biến hơn so với các trò chơi nhập vai trên bàn. Trong phạm vi sử dụng ngày nay, từ viết tắt RPG đề cập đến phiên bản trò chơi điện tử của nó nhiều hơn. Bạn sẽ gọi Dungeon &amp; Dragons là một game nhập vai trên bàn, thay vì chỉ là một game nhập vai. </p> <p> Với sự phát triển của đồ họa, cơ chế gameplay của CRPG đã được điều chỉnh theo các tiêu chuẩn đồ họa hiện đại. Loạt CRPG như The Elder Scrolls, Gothic hoặc The Witcher đã cách mạng hóa thể loại này, giới thiệu một số cơ chế gameplay mới trong khi loại bỏ những thứ khác. </p> <p> Những game nhập vai này thiên về hành động và nhịp độ nhanh hơn, mặc dù không phải hoàn toàn, nhưng phần nào của bản thân nó cũng nằm trong phân nhánh hack và slash (mặc dù đây vẫn là những game nhập vai vững chắc!) </p> <p> </p> <h2 id=\"a-new-wave-of-crpgs\"> Một làn sóng CRPG mới </h2> <p> <img alt=\"kyn-rpg\" src=\"images/kyn-rpg-408.jpg\" loading=\"lazy\"> </p> <p> Tuy nhiên, đi ngược lại xu hướng trong ngành công nghiệp trò chơi điện tử ngày nay là đi theo chủ nghĩa đồ họa hiện thực, đã xuất hiện một làn sóng CRPG mới. Các game nhập vai theo trường phái cổ điển hay Cổ điển ảnh hưởng rất nhiều đến các trò chơi này và chúng tập trung vào cơ chế chơi và nhập vai hơn là hình ảnh. </p> <p> Chúng thường là các trò chơi đẳng áp, với các trận chiến chiến thuật theo lượt có thể tạm dừng trong thời gian thực. Các CRPG này cũng cố gắng hết sức để trở nên nhập vai nhất có thể, cung cấp cho bạn những khối văn xuôi hơi lớn được trau chuốt kỹ lưỡng và một cốt truyện chắc chắn. </p> <p> Hầu hết chúng dựa vào văn bản hơn là lồng tiếng cho hầu hết các cuộc đối thoại, giống như các CRPG cũ. Một số CRPG này bao gồm Pillars of Eternity, Divinity: Original Sin hoặc Pathfinder: Kingmaker. </p> <p> Những trò chơi này cũng nhấn mạnh vào chiến thuật chiến đấu, tiến trình của nhân vật, ra quyết định và khuyến khích khám phá, giống như các CRPG cũ đã làm. Vì những lý do này, chúng tôi coi chúng có liên quan mật thiết với các game nhập vai cổ điển hơn là hầu hết các game nhập vai hiện đại. </p> <p> </p> <h2 id=\"what-crpg-means-in-2021\"> CRPG có ý nghĩa gì vào năm 2021 </h2> <p> <img alt=\"\" src=\"images/new-classic-rpg-torment-featured-173.jpg\" loading=\"lazy\"> </p> <p> Kể từ những năm 2000, RPG đã trở thành thuật ngữ tiêu chuẩn khi đề cập đến bất kỳ trò chơi điện tử nhập vai nào. Nhưng vào khoảng năm 2015, họ đã phát hành Divinity: Original Sin và Pillars of Eternity. </p> <p> Những game nhập vai này là sự khởi đầu từ lối chơi hành động theo định hướng của game nhập vai hiện đại, đồng thời rất giống với những tựa game cũ hơn về cả tính thẩm mỹ và cơ chế chơi. Vào khoảng thời gian này, nhu cầu đã xuất hiện cho một thuật ngữ mới để đặt các game nhập vai này khác biệt với các game nhập vai hiện đại. </p> <p> Mặc dù mọi người đã ném các thuật ngữ &quot;trường học cũ&quot; và &quot;RPG cổ điển&quot; trên mạng trong nhiều năm để mô tả những trò chơi này, nhưng trò chơi sau mới là thứ bị mắc kẹt. Cũng giống như các trò chơi điện tử nhập vai hiện đại đã tuyên bố tên viết tắt RPG cho chính họ, mọi người đang gọi các game nhập vai cũ là &quot;CRPG&quot;. </p>"}