{"title":"Disney + đạt gần 100 triệu người đăng ký","content":"<p> Đừng bao giờ đánh giá thấp Disney. Trong khi Disney + chỉ mới ra mắt tại Mỹ vào tháng 11 năm 2019, dịch vụ phát trực tuyến hiện có gần 100 triệu người đăng ký. Đó là mức tăng trưởng mà ngay cả công ty cũng không mong đợi. </p> <h2 id=\"how-many-customers-does-disney-have\"> Disney + có bao nhiêu khách hàng? </h2> <p> Như đã thông báo trong <a href=\"https://thewaltdisneycompany.com/app/uploads/2021/02/q1-fy21-earnings.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> Báo cáo thu nhập quý 1 năm 2021 của Disney </a> , Disney + có 94,9 triệu người đăng ký trên toàn cầu, tính đến ngày 2 tháng 1 năm 2021. </p> <p> Có nghĩa là con số này không tính đến số người đăng ký đạt được thông qua việc phát hành thành công WandaVision. Sẽ không công bằng nếu cho rằng Disney + hiện có hơn 100 triệu người đăng ký. </p> <p> <img alt=\"mandalorian season 2\" src=\"images/mandalorian-season-2-450.jpg\" loading=\"lazy\"> </p> <p> Các số liệu cuối cùng được báo cáo vào tháng 12 năm 2020, khi Disney thông báo họ đã đạt được 86 triệu người đăng ký cho dịch vụ phát trực tuyến tiêu chuẩn của mình. Sự tăng vọt kể từ đó có thể là do nội dung độc quyền mạnh mẽ như phần hai của The Mandalorian và phim truyện Soul của Pixar. </p> <p> Doanh thu trung bình hàng tháng trên mỗi người đăng ký giảm từ 5,56 đô la một năm trước xuống còn 4,04 đô la ngày nay, có thể được tính phần lớn là do chi phí dịch vụ rẻ hơn ở Ấn Độ và Indonesia. </p> <p> Hulu và ESPN +, các dịch vụ phát trực tuyến cũng thuộc sở hữu của Disney, cũng chứng kiến ​​sự tăng trưởng mạnh mẽ. Dịch vụ đầu tiên đã tăng 30% so với cùng kỳ năm ngoái lên 39,4 triệu người đăng ký, trong khi cái thứ hai tăng 83% so với cùng kỳ năm ngoái với tổng số 12,1 triệu người đăng ký. </p> <p> <a href=\"https://www.makeuseof.com/disney-plus-hulu-espn-bundle-available/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney gần đây đã tung ra một gói kết hợp tất cả các dịch vụ phát trực tuyến của mình </a> , vì vậy rõ ràng là công ty tiếp tục hỗ trợ cả ba. </p> <p> Star cũng sẽ sớm ra mắt ở nhiều khu vực, điều này sẽ tạo ra một sự thúc đẩy lớn cho số lượng phim và chương trình truyền hình mà Disney + cung cấp. </p>"}