{"title":"DeviantArt thêm thanh bên và nhóm vào ứng dụng di động của nó","content":"<p> Mỗi nghệ sĩ thị giác đều có quy trình sáng tạo độc đáo của riêng họ, nhưng điều phổ biến — đặc biệt là trong thời đại kỹ thuật số ngày nay — bước cuối cùng trong quy trình đó là chia sẻ tác phẩm hoàn chỉnh của bạn trực tuyến. </p> <p> Đã qua rồi cái thời bạn phải tìm những viện bảo tàng sẽ đưa những bức tranh hoặc ảnh của bạn cho mọi người xem. Thay vào đó, hãy chọn một nền tảng thu hút bạn nhất và đăng đi! </p> <p> Được thành lập vào năm 2000, DeviantArt là một trong những cộng đồng nghệ thuật lâu đời nhất trên internet. DeviantArt đã ra mắt ứng dụng dành cho thiết bị di động vào năm 2017 và bản cập nhật mới nhất của nó tuy nhỏ nhưng rất quan trọng. </p> <h2 id=\"deviantart-for-mobile-improves-its-navigation\"> DeviantArt cho điện thoại di động cải thiện điều hướng của nó </h2> <p> DeviantArt đã cải thiện giao diện người dùng của ứng dụng dành cho thiết bị di động của mình, thêm một thanh bên rất giống với thanh bên trên trang web DeviantArt. Thanh bên cho phép bạn truy cập nhanh vào trang chủ, các nghệ sĩ (nghệ sĩ) mà bạn theo dõi và các nhóm. </p> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (2 Hình ảnh) </strong> <img alt=\"The popup you get upon opening the DeviantArt app after the update\" src=\"images/deviantart-sidebar-1-667.png\" loading=\"lazy\"> Mở rộng <img alt=\"Screenshot of the DeviantArt mobile app sidebar\" src=\"images/deviantart-sidebar-2-911.png\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> Quyền truy cập vào mục cuối cùng trong danh sách đó là đặc biệt đáng chú ý vì trước bản cập nhật này, các nhóm DeviantArt chỉ có sẵn trên trang web. Nhóm DeviantArt hoạt động tương tự như <a href=\"https://www.makeuseof.com/facebook-bring-related-group-discussions-news-feed/\" target=\"_blank\" rel=\"nofollow noopener\"> Nhóm Facebook </a> —Tập hợp những người dùng đã kết hợp lại với nhau trên nền tảng có chung sở thích hoặc mục tiêu. </p> <p> Trên thanh bên, bạn có thể nhấn vào <strong> Nhóm của tôi </strong> để xem tất cả các nhóm mà bạn là thành viên, hoặc <strong> Nhóm được đề xuất </strong> để xem các nhóm mà DeviantArt tin rằng sẽ phù hợp với bạn. Bạn cũng có thể ghim các nhóm yêu thích của mình lên đầu thanh bên để truy cập dễ dàng hơn. </p> <p> Nếu bạn điều hành nhóm của riêng mình, nó có thể hiển thị trong phần được đề xuất cho những người khác có thể muốn tham gia. Nếu không quan tâm đến một nhóm, bạn có thể nhấn vào ba dấu chấm ở bên phải tên của nhóm đó để xóa đề xuất. </p> <p> Khi bạn truy cập một nhóm trong ứng dụng, bạn sẽ thấy cả độ lệch của nhóm đó (bài gửi) và bài đăng. Quản trị viên nhóm có thể xuất bản cập nhật cho nhóm của họ từ nguồn cấp dữ liệu bài đăng. </p> <p> <strong> Tải xuống: </strong> DeviantArt cho <a href=\"https://apps.apple.com/us/app/deviantart/id925219396\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> | <a href=\"https://play.google.com/store/apps/details?id=com.deviantart.android.damobile\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> (Miễn phí) </p> <p> </p> <h2 id=\"where-do-you-share-your-creations-online\"> Nơi bạn chia sẻ sáng tạo của mình trực tuyến? </h2> <p> Nếu bạn là một nghệ sĩ, nhà thiết kế hoặc nhiếp ảnh gia đã sử dụng Internet trong một thời gian dài, rất có thể bạn đã tham gia DeviantArt vào một thời điểm nào đó. Cộng đồng dường như không còn sôi động như hồi đầu những năm 2000, nhưng số lượng tác phẩm gửi đến đã bùng nổ trong những năm gần đây. </p> <p> Với cơ sở người dùng tích cực như vậy, điều quan trọng nhất là DeviantArt phải cải thiện ứng dụng dành cho thiết bị di động của mình. Tại thời điểm viết bài, ứng dụng được xếp hạng 2,6 / 5,0 trên App Store và 3,2 / 5,0 trên Google Play. </p>"}