{"title":"Nhập thứ nguyên thứ ba: Làm việc với quy trình công việc 3D trong Adobe After Effects","content":"<p> Nếu bạn đang tìm cách cải thiện quy trình làm việc của Adobe After Effects, cuối cùng bạn sẽ cần bắt đầu xử lý trục Z, cho phép bạn thao tác chiều sâu 3D của đối tượng. </p> <p> Điều này mở ra một loạt hình ảnh và phong cách mới để bạn làm việc, nhưng cũng tạo ra những hạn chế và cân nhắc riêng. </p> <p> Trong bài viết này, chúng tôi sẽ đề cập đến cách bật và làm việc với các lớp 3D, cũng như cách thêm và tạo hoạt ảnh cho máy ảnh 3D để tạo ra các chuyển động động. Một kịch bản trong đó chúng ta tạo hoạt ảnh và di chuyển văn bản trong không gian 3D cũng sẽ được kiểm tra. </p> <p> Hãy nhảy vào! </p> <h2 id=\"how-to-enable-and-animate-3d-layers\"> Cách bật và tạo hoạt ảnh cho các lớp 3D </h2> <p> Trong bố cục của mình, bạn có thể chuyển đổi các lớp trong dòng thời gian để kích hoạt chúng dưới dạng 3D. </p> <p> Đây là một quá trình rất đơn giản. Đơn giản chỉ cần tìm <strong> Khối lập phương </strong> biểu tượng cho các lớp của bạn trong dòng thời gian và nhấp vào hộp bên dưới nó để bật 3D cho lớp đó. </p> <p> <img alt=\"Toggle 3D layers in After Effects\" src=\"images/aftereffects_3d_toggle-258.jpg\" loading=\"lazy\"> </p> <p> Khi điều này đã được thực hiện, bạn có thể sẽ không thấy bất kỳ thay đổi nào ngay lập tức. Tuy nhiên, nếu bạn điều hướng đến các thông số vị trí, tỷ lệ và xoay trong lớp của mình, bạn sẽ thấy rằng bộ số có thể điều chỉnh thứ ba đã xuất hiện. </p> <p> Những con số mới này hiện quyết định vòng quay, vị trí và tỷ lệ của bạn trên trục Z trong không gian 3D. Cũng giống như các thông số khác của bạn, chúng có thể là khung hình chính để cho phép tạo hoạt ảnh và thao tác. </p> <p> <img alt=\"After Effects Z Data \" src=\"images/aftereffects_3d_zdata-759.jpg\" loading=\"lazy\"> </p> <p> Ví dụ, hãy tạo một thành phần và một lớp văn bản với một số từ. </p> <p> <img alt=\"After Effects Text \" src=\"images/aftereffects_3d_text-228.jpg\" loading=\"lazy\"> </p> <p> Sau khi hoàn tất, hãy bật lớp 3D. Lưu ý rằng nếu bạn định sử dụng <strong> Căn chỉnh </strong> để đảm bảo lớp của bạn được căn giữa một cách hoàn hảo, bạn sẽ cần làm điều này trước khi bật 3D. Điều này là bởi vì <strong> Căn chỉnh </strong> công cụ chỉ hoạt động trên các lớp 2D. </p> <p> Bây giờ lớp văn bản của chúng ta là một lớp 3D, chúng ta có thể di chuyển nó trong không gian 3D dọc theo Trục Z. Vì vậy, hãy để văn bản di chuyển &quot;về phía màn hình.&quot; </p> <p> Đầu tiên, chúng ta sẽ đặt tham số Z-Axis. Theo mặc định, nó được đặt thành 0. Hãy đặt nó thành <strong> 200 </strong> . </p> <p> <img alt=\"Setting Z coordinates in After Effects\" src=\"images/setting_z_dimension-848.jpg\" loading=\"lazy\"> </p> <p> Bây giờ, chúng tôi sẽ điều hướng hai giây xuống dòng thời gian và đặt giá trị trục Z của chúng tôi thành <strong> –200 </strong> . </p> <p> <img alt=\"Setting Z Dimension to -200\" src=\"images/setting_z_dimension_2-561.jpg\" loading=\"lazy\"> </p> <p> Với thay đổi này, bây giờ chúng ta sẽ thấy văn bản di chuyển &quot;về phía&quot; màn hình. </p> <p> </p> <h2 id=\"what-are-3d-cameras\"> Máy ảnh 3D là gì? </h2> <p> Chúng tôi đã tạo hoạt ảnh thành công cho một đối tượng trong không gian 3D trong After Effects. Nhưng điều gì sẽ xảy ra nếu bạn có nhiều đối tượng và muốn tạo cảm giác người xem đang hướng tới hoặc rời xa chúng? </p> <p> Bạn có thể chỉ cần tạo hiệu ứng cho từng phần tử riêng lẻ để di chuyển về phía bạn, nhưng điều đó sẽ tốn nhiều thời gian và không đặc biệt hiệu quả. Đây là nơi bạn sẽ sử dụng máy ảnh 3D. </p> <p> </p> <p> Nếu bạn sử dụng phần mềm 3D như Cinema 4D hoặc Blender, có khả năng bạn đã sử dụng máy ảnh 3D trước đó. Nếu bạn đã từng chơi một trò chơi trên máy tính, bạn cũng đã từng trải nghiệm một chiếc máy ảnh 3D di chuyển tầm nhìn của bạn trong một thế giới 3D. </p> <p> Tất cả điều này thoạt nghe có vẻ phức tạp, nhưng máy ảnh 3D hoạt động giống như một máy ảnh thực. Chúng cung cấp cho bạn một trường nhìn có thể được thao tác và di chuyển trong không gian 3D. </p> <p> Hãy làm một ví dụ. </p> <h3 id=\"setting-up-a-3d-camera\"> Thiết lập máy ảnh 3D </h3> <p> Để bắt đầu, hãy tạo một số lớp văn bản 3D và định vị chúng tuần tự theo Trục Z. </p> <p> Trong ví dụ này, khoảng cách <strong> 3.000 pixel </strong> giữa mỗi lớp đã được sử dụng. Lớp đầu tiên ở mức 0, lớp tiếp theo ở mức 3.000, lớp tiếp theo ở mức 6.000, v.v. </p> <p> <img alt=\"Images in a 3D space stacked own top of each other\" src=\"images/images_stacked-893.jpg\" loading=\"lazy\"> </p> <p> Bây giờ, đã đến lúc tạo một máy ảnh 3D bằng cách nhấp vào <strong> Lớp </strong> &gt; <strong> Mới </strong> &gt; <strong> Máy ảnh </strong> , trên đó bạn sẽ thấy một cửa sổ để điều chỉnh cài đặt cho lớp máy ảnh mới của mình. Chúng có hai loại: <strong> Một nút </strong> và <strong> Hai nút </strong> . </p> <p> Các <strong> Một nút </strong> máy ảnh được thiết kế để vận hành và mô phỏng máy ảnh trong thế giới thực càng gần càng tốt và điểm lấy nét được chỉ định thủ công bằng chuyển động của máy ảnh. </p> <p> A <strong> Hai nút </strong> máy ảnh được thiết kế để theo dõi một điểm ưa thích, lý tưởng cho việc quay quanh hoặc theo dõi một đối tượng đang chuyển động. </p> <p> Trong trường hợp này, <strong> Một nút </strong> máy ảnh sẽ được sử dụng. Bạn sẽ nhận thấy một số cài đặt bổ sung trong cửa sổ, chẳng hạn như <strong> Thu phóng </strong> , <strong> Góc nhìn </strong> , <strong> Bật độ sâu trường </strong> và <strong> Tiêu cự </strong> . </p> <p> <img alt=\"Camera settings in AE\" src=\"images/camera_settings-566.jpg\" loading=\"lazy\"> </p> <p> Những thứ này nhằm phản ánh cài đặt máy ảnh trong thế giới thực. Nếu bạn hiểu rõ về cách thức hoạt động của chúng, hãy thoải mái chơi với chúng. Nếu không, bạn có thể chọn một loạt cài đặt trước ở góc trên cùng bên phải. </p> <p> Chúng tôi sẽ chọn <strong> 35mm </strong> đặt trước cho bây giờ. Bây giờ lớp máy ảnh của chúng ta đã được thiết lập và trong cảnh, bạn sẽ không thấy nhiều sự khác biệt lúc đầu. </p> <h3 id=\"using-3d-camera-navigation\"> Sử dụng Điều hướng máy ảnh 3D </h3> <p> Có hai phương pháp mà bạn có thể điều chỉnh và tạo hiệu ứng cho chế độ xem của máy ảnh. Chính xác nhất là bằng cách nhập <strong> Chức vụ </strong> giá trị trong <strong> Biến đổi </strong> cài đặt cho lớp camera. Sau đó, bạn có thể tạo khung hình chính như khi tạo hoạt ảnh cho bất kỳ lớp nào khác. </p> <p> <img alt=\"Setting text keyframes\" src=\"images/setting_text_keyframes-870.jpg\" loading=\"lazy\"> </p> <p> Khi bạn di chuyển máy ảnh, bạn sẽ nhận thấy rằng tất cả các đối tượng 3D khác trong cảnh của bạn sẽ di chuyển tương ứng với nó. Lưu ý rằng máy ảnh sẽ <strong> không ảnh hưởng đến các lớp 2D </strong> . </p> <p> Vì vậy, hãy đặt máy ảnh của chúng ta di chuyển trên trục Z từ 0 đến 9.000 trong khoảng thời gian bốn giây và lập khung hình chính cho chuyển động của chúng ta. </p> <p> Đây là bạn có nó! Nếu bạn đã thiết lập đúng, các từ sẽ đẩy &quot;về phía&quot; bạn, &quot;qua&quot; trường xem và &quot;phía sau&quot; người xem. </p> <p> </p> <h3 id=\"other-ways-to-move-the-3d-camera\"> Các cách khác để di chuyển máy ảnh 3D </h3> <p> Nếu bạn muốn thử nghiệm hơn một chút và ít sử dụng máy ảnh của mình hơn, thì có những cách khác để di chuyển, điều hướng và điều chỉnh. Các <strong> Quỹ đạo </strong> , <strong> Pan </strong> và <strong> Dolly </strong> các công cụ ở đầu thanh công cụ cho phép bạn thực hiện việc này. </p> <p> <img alt=\"Camera tools for navigation\" src=\"images/camera_tools-959.jpg\" loading=\"lazy\"> </p> <p> Sử dụng những thứ này, bạn có thể nhấp và kéo để di chuyển từ bên này sang bên kia ( <strong> Pan) </strong> , xoay xung quanh ( <strong> Quỹ đạo </strong> ), và phóng to và thu nhỏ ( <strong> Dolly </strong> ). Các điều khiển này kém chính xác hơn so với việc nhập số, nhưng chúng rất tốt để lập kế hoạch cho các chuyển động và hình ảnh động máy ảnh thô của bạn. </p> <p> </p> <h2 id=\"practice-leads-to-perfection\"> Thực hành dẫn đến sự hoàn hảo </h2> <p> Giờ đây, bạn có thể tạo và tạo hoạt ảnh cho các lớp 3D dọc theo trục Z và cũng có thể làm việc với máy ảnh 3D để điều hướng với nhiều đối tượng 3D. </p> <p> Nếu bạn thích làm việc trong không gian 3D, bạn có thể muốn khám phá những khả năng nâng cao hơn mà một phần mềm 3D chuyên dụng hơn, chẳng hạn như Blender, có thể cung cấp. </p>"}