{"title":"Mark Zuckerberg của Facebook đã giành quyền riêng tư của Apple trên phương diện cá nhân","content":"<p> Giám đốc điều hành Facebook Mark Zuckerberg được cho là đã nói với các nhân viên của Facebook rằng, &quot;Chúng tôi cần phải gây đau đớn&quot; cho Apple vì đã đối xử quá tệ với gã khổng lồ truyền thông xã hội, <a href=\"https://www.wsj.com/articles/facebook-meets-apple-in-clash-of-the-tech-titanswe-need-to-inflict-pain-11613192406\" target=\"_blank\" rel=\"nofollow noopener\"> Tạp chí Phố Wall </a> báo cáo. </p> <p> Zuckerberg được cho là đã đưa ra bình luận vào năm 2018 sau khi giám đốc điều hành của Apple và Facebook nói về vụ bê bối Cambridge Analytica, trong đó dữ liệu cá nhân của hàng triệu người dùng Facebook bị truy cập mà không có sự đồng ý của họ cho quảng cáo chính trị. </p> <h2 id=\"apple-vs-facebook\"> Apple so với Facebook </h2> <p> Vào thời điểm đó, Giám đốc điều hành của Apple, Tim Cook, đã được hỏi trong một cuộc phỏng vấn rằng ông sẽ phản ứng như thế nào nếu ở trong hoàn cảnh của Zuckerberg, đối mặt với khủng hoảng. &quot;Tôi sẽ không ở trong tình huống này&quot;, Cook nói. </p> <p> Tờ Wall Street Journal tuyên bố rằng, trong khi Zuckerberg nhận xét rằng những lời của Cook là &quot;cực kỳ lóng ngóng&quot; và &quot;hoàn toàn không phù hợp với sự thật&quot;, thì đằng sau hậu trường, anh lại khắt khe hơn trong đánh giá của mình. </p> <p> Kể từ đó, mối quan hệ giữa hai công ty công nghệ không hề trở nên tốt đẹp hơn. Apple đã tăng gấp đôi lập trường định hướng về quyền riêng tư của mình, với Cook tuyên bố quyền riêng tư là một trong những <a href=\"https://www.makeuseof.com/tim-cook-privacy-most-important-issues/\" target=\"_blank\" rel=\"nofollow noopener\"> mối quan tâm cấp bách nhất của thế giới </a> . iOS 14 chứa nhiều tính năng liên quan đến quyền riêng tư, mà Facebook đã đề cập đến vấn đề này, cho rằng chúng có khả năng gây hại cho các doanh nghiệp nhỏ. </p> <p> Trong cuộc gọi nhà đầu tư hàng quý mới nhất của Facebook, Zuckerberg đã dán nhãn Apple &quot; <a href=\"https://www.makeuseof.com/mark-zuckerberg-apple-biggest-competitors/\" target=\"_blank\" rel=\"nofollow noopener\"> một trong những đối thủ cạnh tranh lớn nhất của [Facebook] </a> &quot;kết quả của các biện pháp bảo vệ quyền riêng tư mới này.&quot; Apple có thể nói rằng họ đang làm điều này để giúp đỡ mọi người, nhưng các động thái rõ ràng theo dõi lợi ích cạnh tranh của họ &quot;, Zuckerberg nói. </p> <p> </p> <p> Facebook được cho là đã sẵn sàng một vụ kiện chống độc quyền chống lại Apple sẽ biến vụ bắn tỉa giữa hai gã khổng lồ ở Thung lũng Silicon thành một cuộc chiến pháp lý toàn diện. Báo cáo của Tạp chí Phố Wall lưu ý rằng, &quot;Các thỏa thuận pháp lý và các quyết định pháp lý tiềm năng có thể ảnh hưởng đến hàng trăm triệu điện thoại của người tiêu dùng trong những năm tới.&quot; </p> <p> </p> <h2 id=\"different-approaches\"> Phương pháp tiếp cận khác nhau </h2> <p> Người phát ngôn của Facebook, Dani Lever, nói với Wall Street Journal rằng, &quot;Apple tuyên bố đây là về quyền riêng tư, nhưng đó là về lợi nhuận và chúng tôi đang tham gia cùng những người khác để chỉ ra hành vi tự thích, phản cạnh tranh của họ.&quot; Cô ấy nói rằng Facebook đang &quot;cố tình đứng lên chống lại Apple&quot; thay mặt cho các doanh nghiệp nhỏ hơn và các nhà phát triển, những người bị tổn thương bởi tính năng App Privacy của Apple. </p> <p> Trong khi Lever phủ nhận rằng cuộc chiến giữa hai công ty là cá nhân, nó hoàn toàn vượt ra ngoài một vài điểm tranh cãi giữa hai công ty công nghệ lớn. Mô hình kinh doanh do Facebook tài trợ quảng cáo hoạt động cực kỳ khác với mô hình tài trợ phần cứng mà Apple cung cấp. Cả hai công ty --- hoặc các nhà lãnh đạo của họ --- đều không có khả năng từ chối niềm tin cốt lõi của họ về cách xây dựng tương lai của công nghệ. </p> <p> Việc CEO Tim Cook của Apple thảo luận về quyền riêng tư trên phương diện đạo đức cho thấy điều này thực sự mang tính cá nhân như thế nào. </p> <p> <small> Tín dụng hình ảnh: Wikipedia / <a href=\"https://en.wikipedia.org/wiki/Mark_Zuckerberg#/media/File:Mark_Zuckerberg_F8_2019_Keynote_(32830578717)_(cropped).jpg\" target=\"_blank\" rel=\"nofollow noopener\"> Anthony Quintano CC </a></small> </p>"}