{"title":"Google đang thêm hỗ trợ Face ID vào Chrome dành cho iOS","content":"<p> Google đang thử nghiệm một tính năng bảo mật mới trong Chrome 89 dành cho iOS sử dụng xác thực sinh trắc học của iPhone để bảo vệ các tab duyệt web riêng tư của bạn. Hiện giới hạn cho những người trên kênh beta của Chrome, điều này sẽ cho phép bạn khóa các tab Ẩn danh của mình bằng Face ID hoặc Touch ID. </p> <h2 id=\"even-more-private-private-browsing\"> Duyệt web riêng tư nhiều hơn nữa </h2> <p> Mọi tab ẩn danh được bảo vệ bằng Face hoặc Touch ID đều bị mờ trong trình chuyển đổi tab. Các tab đã khóa sẽ hiển thị trở lại sau khi được xác nhận bằng xác thực sinh trắc học của ‌iPhone‌. </p> <p> Tính năng hữu ích này không chỉ tăng cường quyền riêng tư của bạn mà còn tăng cường bảo mật khi bạn thực hiện đa nhiệm trên các ứng dụng trên iPhone hoặc iPad của mình. <a href=\"https://9to5google.com/2021/02/11/chrome-lock-touch-face-id/\" target=\"_blank\" rel=\"nofollow noopener\"> 9to5Google </a> lưu ý rằng không phải tất cả người dùng beta đều có thể truy cập tùy chọn khóa mới do thành phần phía máy chủ. </p> <p> </p> <h2 id=\"how-s-this-useful\"> Điều này hữu ích như thế nào? </h2> <p> Nó cũng hữu ích cho những trường hợp khi một người bạn có thể hỏi mượn iPhone của bạn để tra cứu nhanh nội dung trực tuyến. Với tính năng bảo vệ Face ID cho chế độ duyệt web riêng tư của Chrome, họ sẽ không thể nhìn thấy các trang web Ẩn danh đang mở của bạn khi chuyển đổi các tab. </p> <p> </p> <p> &quot;Ẩn danh&quot; là tên tiếp thị cho chế độ duyệt web riêng tư của Chrome. Trong khi ở chế độ ẩn danh, bạn có thể duyệt web mà không cần Chrome lưu bất kỳ thông tin nào về phiên. Khi bạn đóng cửa sổ ẩn danh, <a href=\"https://www.makeuseof.com/tag/chrome-guest-mode-incognito-mode/\" target=\"_blank\" rel=\"nofollow noopener\"> tất cả thông tin về phiên đó biến mất </a> . </p> <p> </p> <h2 id=\"how-to-enable-face-or-touch-id-in-chrome\"> Cách bật Face hoặc Touch ID trong Chrome </h2> <p> Tính năng mới sắp ra mắt này phải được bật theo cách thủ công trong phần Bảo mật của cài đặt trong ứng dụng của Chrome. Một khóa bảo mật tương tự cũng có trong các ứng dụng khác của Google. </p> <p> Ví dụ: trong ứng dụng Tìm kiếm gốc, xác thực sinh trắc học của iPhone xác nhận danh tính của bạn khi quay lại phiên Ẩn danh sau 15 phút. Xác thực Face hoặc Touch ID tùy chọn cũng có sẵn trong Google Drive để bảo vệ tệp của bạn khi bạn thoát ứng dụng. </p> <p> </p> <h2 id=\"when-will-the-feature-release-officially\"> Khi nào tính năng sẽ chính thức phát hành? </h2> <p> Vẫn chưa có thông tin nào về thời điểm tùy chọn khóa mới có thể ra mắt cho mọi người, nhưng Chrome 89 dự kiến ​​sẽ phát hành cho công chúng vào tháng tới. Google cũng có thể quyết định không phát hành tính năng này mặc dù đã được liệt kê trong ghi chú phát hành chính thức. </p>"}