{"title":"Cách gửi và nhận tin nhắn văn bản trên iPad của bạn","content":"<p> Bạn cảm thấy mệt mỏi khi phải giữ iPhone bên mình để đảm bảo không bỏ lỡ bất kỳ tin nhắn văn bản quan trọng nào? May mắn thay, có một cách đơn giản để bạn có thể thiết lập iPad của mình để gửi và nhận tin nhắn văn bản. </p> <p> Sử dụng iCloud, Apple cung cấp một tùy chọn dễ dàng để đồng bộ hóa tin nhắn văn bản của bạn từ iPhone sang iPad, cho phép bạn gửi và nhận tin nhắn từ một trong hai thiết bị. Các bước sau đây sẽ giúp bạn thiết lập để thực hiện việc này ngay lập tức. </p> <h2 id=\"before-you-begin\"> Trước khi bắt đầu </h2> <p> Bạn cần đảm bảo rằng bạn có quyền truy cập vào cả hai thiết bị của mình, vì bạn sẽ cần điều chỉnh cài đặt để <a href=\"https://www.makeuseof.com/tag/how-to-sync-iphone-and-ipad/\" target=\"_blank\" rel=\"nofollow noopener\"> đồng bộ hóa iPhone và iPad của bạn với nhau </a> . </p> <p> Ngoài ra, iPhone của bạn sẽ cần được bật và kết nối với Wi-Fi hoặc mạng di động. Điều này là do các tin nhắn bạn gửi từ iPad sẽ chuyển qua iPhone. </p> <p> Bạn cũng cần đảm bảo rằng bạn đã đăng nhập vào iMessage bằng cùng một ID Apple trên cả hai thiết bị. Làm như vậy với các bước sau: </p> <ol> <li> Mở <strong> Cài đặt </strong> ứng dụng. </li> <li> Nhấn vào <strong> Đăng nhập vào [Thiết bị] của bạn </strong> . </li> <li> Nhập tên người dùng và mật khẩu Apple ID của bạn. </li> <li> Nếu được nhắc, hãy nhập <strong> mã xác minh sáu chữ số </strong> được gửi đến thiết bị hoặc số điện thoại đáng tin cậy của bạn và hoàn tất đăng nhập. </li> </ol> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (3 Hình ảnh) </strong> <img alt=\"Opening Settings on iPhone\" src=\"images/settings-icon-1-698.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"Signing into iCloud Account on iPhone\" src=\"images/sign-into-icloud-account-1-448.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"Apple ID Verification Code\" src=\"images/icloud-verification-code-400.jpg\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> Bây giờ bạn đã có thiết bị của mình và đăng nhập bằng cùng một ID Apple, bạn đã sẵn sàng để bắt đầu. </p> <p> </p> <p> </p> <h2 id=\"step-1-set-up-your-iphone\"> Bước 1. Thiết lập iPhone của bạn </h2> <p> Trước tiên, bạn phải đảm bảo rằng iPhone của bạn được cấu hình để cho phép chuyển tiếp tin nhắn. Đây là cách thực hiện: </p> <ol> <li> Mở <strong> Cài đặt </strong> trên iPhone của bạn. </li> <li> Lựa chọn <strong> Tin nhắn </strong> . </li> <li> Bật <strong> iMessage </strong> với nút chuyển đổi nếu nó chưa được bật. </li> <li> Lựa chọn tiếp theo <strong> Chuyển tiếp tin nhắn văn bản </strong> . </li> <li> Chọn cái nào <strong> thiết bị </strong> có thể gửi và nhận tin nhắn văn bản từ iPhone của bạn. </li> <li> Nếu bạn không sử dụng xác thực hai yếu tố cho Apple ID của mình, <strong> mã xác nhận </strong> xuất hiện trên từng thiết bị khác của bạn: nhập mã đó vào iPhone của bạn. Nếu bạn đang sử dụng xác thực hai yếu tố, bạn có thể bỏ qua bước này. </li> </ol> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (3 Hình ảnh) </strong> <img alt=\"Turn on Text Message Forwarding on iPhone\" src=\"images/iphone-imessage-to-icloud-1-438.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"Text Message Forwarding from an iPhone\" src=\"images/text-message-forwarding-from-iphone-234.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"Apple ID Verification Code\" src=\"images/icloud-verification-code-439.jpg\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> </p> <h2 id=\"step-2-set-up-your-ipad\"> Bước 2. Thiết lập iPad của bạn </h2> <p> Mọi tin nhắn bạn gửi và nhận trên iPad đều được lưu trong iCloud. Bạn phải đảm bảo rằng Tin nhắn cho iCloud đã được bật cho iPad của mình. Đây là cách làm như vậy: </p> <ol> <li> Mở <strong> Cài đặt </strong> trên iPad của bạn. </li> <li> Sự lựa chọn của bạn <strong> ID Apple </strong> tên tài khoản. </li> <li> Lựa chọn <strong> iCloud </strong> . </li> <li> Bật <strong> Tin nhắn </strong> . </li> </ol> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (2 Hình ảnh) </strong> <img alt=\"Opening iCloud Settings on iPad\" src=\"images/opening-apple-id-settings-on-ipad-295.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"Turn on Messages on iPad\" src=\"images/turn-on-messages-on-ipad-637.jpg\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> </p> <h2 id=\"texting-from-your-iphone-or-your-ipad-made-easy\"> Nhắn tin từ iPhone hoặc iPad của bạn thật dễ dàng </h2> <p> Bây giờ bạn đã thiết lập mọi thứ, tất cả những gì bạn cần làm là mở ứng dụng Tin nhắn trên iPad để xem tất cả các cuộc trò chuyện của bạn hoặc bắt đầu một cuộc trò chuyện mới như bạn thường làm trên iPhone. </p> <p> Không cần mang theo tất cả các thiết bị xung quanh để đảm bảo bạn không bỏ lỡ bất kỳ tin nhắn văn bản quan trọng nào, miễn là iPhone của bạn được bật và kết nối với Wi-Fi hoặc mạng di động. </p>"}