{"title":"Cách khắc phục VIDEO_TDR_FAILURE BSOD trong Windows 10","content":"<p> Lỗi VIDEO_TDR_FAILURE báo hiệu rằng cạc đồ họa của bạn bị lỗi hoặc trình điều khiển màn hình có thể đã lỗi thời / hoạt động sai. Nhưng có thể có những lý do khác, chẳng hạn như các thành phần quá nóng hoặc các tệp hệ thống bị hỏng. TDR là viết tắt của <strong> Thời gian chờ, phát hiện và phục hồi </strong> , một phương pháp được Windows sử dụng để xác định và sửa chữa các thành phần phần mềm bị trục trặc. </p> <p> Nếu bạn gặp phải lỗi này, đừng lo lắng vì các phương pháp sau sẽ khắc phục lỗi VIDEO_TDR_FAILURE nhanh hơn bạn mong đợi. </p> <h2 id=\"update-and-reinstall-display-drivers\"> 1. Cập nhật và cài đặt lại trình điều khiển hiển thị </h2> <p> Như đã đề cập ở trên, lỗi thường là kết quả của trình điều khiển màn hình bị trục trặc hoặc lỗi thời. Do đó, bạn nên cập nhật trình điều khiển cạc đồ họa của mình. Nếu điều đó không khắc phục được, hãy cài đặt lại chúng. Tùy thuộc vào cạc đồ họa của bạn, bạn có thể gặp các tên tệp khác nhau liên quan đến lỗi. </p> <ol> <li> Đối với người dùng Nvidia, nó là <strong> nvlddmkm.sys </strong> . Nếu bạn là người dùng Nvidia, đây là <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> 5 cách dễ dàng để sửa lỗi. </a> </li> <li> Đối với người dùng AMD, lỗi hiển thị dưới dạng <strong> atikmpag.sys </strong> . </li> <li> Đối với người dùng Intel HD, lỗi là <strong> igdmkd64.sys </strong> . </li> </ol> <h3 id=\"how-to-update-the-display-drivers\"> Cách cập nhật trình điều khiển hiển thị </h3> <p> <img alt=\"windows 10 device manager graphics card update\" src=\"images/windows-10-device-manager-graphics-card-update-775.png\" loading=\"lazy\"> </p> <ol> <li> nhấn <strong> Phím Windows + R </strong> để mở lệnh Run. Gõ vào <strong> devmgmt.msc </strong> và nhấn Enter. </li> <li> bên trong <strong> Quản lý thiết bị </strong> cửa sổ, điều hướng đến <strong> Bộ điều hợp hiển thị </strong> và mở rộng nó. </li> <li> Nhấp chuột phải vào bộ điều hợp hiển thị của bạn, sau đó chọn <strong> Cập nhật driver </strong> . </li> <li> Lựa chọn <strong> Tự động tìm kiếm phần mềm trình điều khiển được cập nhật </strong> . </li> <li> Windows sẽ tự động tìm kiếm trên web và tải xuống các trình điều khiển cần thiết. Hãy đảm bảo rằng bạn có kết nối internet đang hoạt động trong khi làm như vậy. </li> </ol> <h3 id=\"how-to-reinstall-the-display-drivers\"> Cách cài đặt lại trình điều khiển hiển thị </h3> <p> Nếu lỗi BSOD video tdr vẫn tiếp diễn sau khi cập nhật trình điều khiển hiển thị, tốt nhất bạn nên cài đặt lại các trình điều khiển này. Bạn nên làm như vậy trong khi Windows được khởi động ở chế độ an toàn. Nhưng trước khi làm điều đó, bạn nên truy cập trang web của nhà sản xuất cạc đồ họa của mình và tải xuống phiên bản mới nhất của trình điều khiển đồ họa. </p> <p> Các nhà sản xuất phổ biến nhất là <a href=\"https://www.nvidia.in/Download/index.aspx?lang=en-in\" target=\"_blank\" rel=\"nofollow noopener\"> Nvidia </a> , <a href=\"https://www.amd.com/en/support\" target=\"_blank\" rel=\"nofollow noopener\"> AMD </a> và <a href=\"https://downloadcenter.intel.com/product/80939/Graphics\" target=\"_blank\" rel=\"nofollow noopener\"> Intel </a> . </p> <p> Để khởi động vào chế độ an toàn, hãy làm theo các bước sau: </p> <ol> <li> nhấn <strong> Phím Windows + R, </strong> và trong hộp thoại Chạy, hãy nhập <strong> msconfig, </strong> và nhấn Enter. </li> <li> bên trong <strong> Cấu hình hệ thông </strong> cửa sổ, nhấp vào <strong> Khởi động </strong> chuyển hướng. </li> <li> Bây giờ đánh dấu vào <strong> Chế độ an toàn </strong> hộp kiểm nằm ở phía dưới cùng. </li> <li> Áp dụng các cài đặt và Khởi động lại máy tính của bạn. </li> </ol> <p> Sau khi khởi động vào chế độ an toàn, đã đến lúc cài đặt lại trình điều khiển màn hình. </p> <p> <img alt=\"Uninstalling Windows display driver using Device Manager\" src=\"images/uninstall-display-driver-731.jpg\" loading=\"lazy\"> </p> <ol> <li> Trong thanh tìm kiếm của menu Bắt đầu, hãy nhập <strong> Quản lý thiết bị </strong> và mở nó. </li> <li> Tìm kiếm <strong> Bộ điều hợp hiển thị </strong> và mở rộng menu. </li> <li> Nhấp chuột phải vào GPU của bạn và nhấp vào <strong> Gỡ cài đặt thiết bị </strong> . </li> <li> Trong trình hướng dẫn gỡ cài đặt, hãy nhớ kiểm tra <strong> Xóa phần mềm trình điều khiển cho thiết bị này </strong> cái hộp. </li> <li> Chờ Windows gỡ cài đặt thiết bị và khởi động lại máy tính của bạn. </li> <li> Bây giờ, hãy cài đặt lại trình điều khiển đồ họa bạn đã tải xuống trước đó. </li> </ol> <p> </p> <p> </p> <h2 id=\"use-sfc-to-scan-and-fix-system-files\"> 2. Sử dụng SFC để quét và sửa các tập tin hệ thống </h2> <p> SFC là một tiện ích Windows được tích hợp sẵn có thể được sử dụng để quét và sửa các tệp hệ thống bị hỏng. Trong trường hợp BSOD, rất có thể một số tệp hệ thống bị hỏng nên việc chạy tiện ích này là bắt buộc. Nó chỉ là một trong những <a href=\"https://www.makeuseof.com/difference-between-chkdsk-sfc-and-dism-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> một số tiện ích hữu ích có sẵn </a> theo ý của người dùng Windows. </p> <p> Để chạy SFC, chỉ cần làm theo các bước sau: </p> <ol> <li> Trong thanh tìm kiếm của menu Bắt đầu, hãy nhập <strong> cmd </strong> . </li> <li> Nhấp chuột phải vào <strong> Dấu nhắc lệnh </strong> và chọn <strong> Chạy như quản trị viên </strong> . </li> <li> Trong bảng điều khiển, hãy nhập <strong> sfc / scannow </strong> và nhấn Enter. </li> <li> Sau khi quá trình quét và sửa chữa hoàn tất, hãy khởi động lại máy tính của bạn. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-460.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"run-startup-repair\"> 3. Chạy Startup Repair </h2> <p> Đối với những người dùng gặp lỗi ngay khi khởi động Windows 10 hoặc ngay sau khi đăng nhập, sửa chữa Khởi động là một ơn trời. Tính năng này của Windows sẽ kiểm tra các điểm bất thường trong quá trình khởi động và ngay lập tức khắc phục chúng. </p> <p> Vì phần này nhắm đến những người dùng có máy tính không thể sử dụng được do lỗi, tức là họ không thể mở <strong> Cài đặt </strong> , họ sẽ phải khó khởi động lại để vào Môi trường Khôi phục Windows (winRE). </p> <p> <img alt=\"start repair boot up\" src=\"images/startup-repair-screenshot-1-837.png\" loading=\"lazy\"> </p> <p> Làm theo các bước sau để khởi động vào Môi trường Khôi phục Windows: </p> <ol> <li> Nhấn và giữ nút Nguồn cho đến khi PC của bạn tắt. </li> <li> Nhấn lại nút Nguồn để khởi động PC của bạn. </li> <li> Lặp lại bước đầu tiên và bước thứ hai cho đến khi PC khởi động vào chế độ Khôi phục. Nó sẽ là một màn hình màu xanh lam. </li> <li> Trên màn hình Khôi phục, nhấp vào <strong> Xem các tùy chọn, sửa chữa nâng cao </strong> . </li> <li> Trên màn hình tiếp theo, nhấp vào <strong> Khắc phục sự cố </strong> </li> <li> Bấm vào <strong> Tùy chọn nâng cao </strong> </li> <li> Bấm vào <strong> Bắt đầu sửa chữa </strong> và nhập thông tin đăng nhập của bạn khi được nhắc. </li> </ol> <p> </p> <h2 id=\"change-your-power-management-settings\"> 4. Thay đổi cài đặt quản lý nguồn của bạn </h2> <p> Cài đặt quản lý năng lượng của Windows thường được tối ưu hóa tốt, nhưng đôi khi chúng có thể ảnh hưởng đến cách máy tính của bạn xử lý đồ họa. Điều này đặc biệt đúng khi máy tính có GPU kín đáo. Các cài đặt tối ưu để tránh nhận được VIDEO_TDR_FAILURE BSOD được cung cấp bên dưới: </p> <p> <img alt=\"PCIE Advanced Power Settings\" src=\"images/pcie-power-settings-931.jpg\" loading=\"lazy\"> </p> <ol> <li> Trong thanh tìm kiếm của menu Bắt đầu, hãy nhập <strong> Bảng điều khiển </strong> và mở nó. </li> <li> Trong thanh tìm kiếm của Bảng điều khiển, nhập &quot;tùy chọn nguồn&quot; và nhấn Enter. </li> <li> Bấm vào <strong> Tùy chọn năng lượng, </strong> và bên cạnh gói điện bạn đang sử dụng, hãy nhấp vào <strong> Thay đổi cài đặt kế hoạch. </strong> </li> <li> Bấm vào <strong> Thay đổi cài đặt nguồn nâng cao. </strong> </li> <li> Tìm kiếm <strong> PCI E </strong><strong> xpress </strong> và mở rộng nó. </li> <li> Biến <strong> Liên kết quản lý quyền lực nhà nước </strong> thiết lập thành <strong> Tắt </strong> . </li> <li> Lưu các thay đổi và khởi động lại máy tính của bạn. </li> </ol> <p> </p> <h2 id=\"clean-out-your-computer\"> 5. Dọn dẹp máy tính của bạn </h2> <p> Quá nóng không bao giờ là một điều tốt, và thông thường, lý do đằng sau đó là sự tích tụ bụi. Người dùng khuyên người dùng nên lau chùi các bộ phận PC của họ khỏi bụi bẩn hàng tháng. Nhưng hãy cẩn thận. Nó nên được thực hiện một cách nhẹ nhàng. </p> <p> Đảm bảo làm sạch phần trên của cạc đồ họa, quạt CPU, bộ cấp nguồn và quạt tủ. Nói chung, hãy chắc chắn tránh <a href=\"https://www.makeuseof.com/tag/8-pc-maintenance-mistakes-kill-hardware-lifespan/\" target=\"_blank\" rel=\"nofollow noopener\"> sai lầm bảo trì có thể làm hỏng các thành phần đắt tiền. </a> </p> <p> </p> <h2 id=\"check-hardware-components\"> 6. Kiểm tra các thành phần phần cứng </h2> <p> Nếu lỗi vẫn xuất hiện sau khi thử mọi thứ được liệt kê ở trên, có thể có lỗi trong chính phần cứng. Người dùng có card đồ họa chuyên dụng nên tháo nó ra và khởi động máy tính. Nếu lỗi đã được giải quyết, thì đó là lỗi phần cứng trong chính GPU. Bạn có thể cố gắng liên hệ với nhà sản xuất và cố gắng thay thế thiết bị của bạn. </p> <p> </p> <p> Khi sử dụng đồ họa tích hợp, hãy thử tắt chúng và khởi động. Để tắt chúng, hãy làm theo các bước sau: </p> <p> <img alt=\"Device Manager windows disabling Intel HD Graphics\" src=\"images/disable-intelhd-graphics-device-manager-452.jpg\" loading=\"lazy\"> </p> <ol> <li> nhấn <strong> Phím Windows + R, </strong> kiểu <strong> devmgmt.msc </strong> trong hộp văn bản Chạy và nhấn Enter. </li> <li> Trong <strong> Quản lý thiết bị </strong> , tìm kiếm <strong> Bộ điều hợp hiển thị </strong> và mở rộng menu. </li> <li> Nhấp chuột phải vào GPU tích hợp của bạn và nhấp vào <strong> Tắt thiết bị </strong> . </li> <li> Khởi động lại máy tính và kiểm tra xem lỗi đã được giải quyết chưa. </li> </ol> <p> </p> <h2 id=\"error-video-tdr-failure-resolved-successfully\"> Đã giải quyết thành công lỗi &quot;Video TDR Failure&quot; </h2> <p> Đối với hầu hết người dùng, một bản cập nhật đơn giản hoặc cài đặt lại trình điều khiển màn hình của họ sẽ khắc phục được sự cố. Nhưng nếu tình trạng tồi tệ trở nên tồi tệ hơn, bạn có thể phải đặt lại PC hoặc thay thế một số phần cứng. </p>"}