{"title":"Cách truy cập số liệu thống kê về trò chơi PS4 và PS5 của bạn cho năm 2020","content":"<p> Sony đã ra mắt PlayStation Wrap-Up, cho phép bạn suy ngẫm về hành trình PlayStation của mình trong năm qua. </p> <p> Chúng tôi sẽ cho bạn biết cách truy cập trải nghiệm này và giúp bạn biết một số yêu cầu. </p> <h2 id=\"what-is-playstation-wrap-up\"> PlayStation Wrap-Up là gì? </h2> <p> Như chúng tôi đã báo cáo, <a href=\"https://www.makeuseof.com/playstation-wrap-ps4-ps5-stats-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> PlayStation Wrap-Up là bản tóm tắt về năm chơi game cuối cùng của bạn </a> . </p> <p> Đó là một trang được cá nhân hóa cung cấp thông tin chi tiết về thói quen chơi PS4 và PS5 của bạn, bao gồm số lượng trò chơi bạn đã chơi, thời gian bạn chơi chúng và số danh hiệu bạn kiếm được trong suốt quá trình. </p> <p> Bạn cũng có thể nhận được một chủ đề động miễn phí có các hình PlayStation. Thật khó hiểu, điều này chỉ có sẵn cho PS4 chứ không phải PS5 mới phát hành. </p> <p> </p> <h2 id=\"how-to-access-playstation-wrap-up\"> Cách truy cập PlayStation Wrap-Up </h2> <p> <img alt=\"playstation wrapped days played\" src=\"images/playstation-wrapped-days-played-268.png\" loading=\"lazy\"> </p> <p> Để xem báo cáo của bạn, hãy chuyển đến <a href=\"https://www.wrapup.playstation.com\" target=\"_blank\" rel=\"nofollow noopener\"> Trang web tổng hợp PlayStation </a> . Bạn sẽ cần đăng nhập vào tài khoản Sony của mình, nếu bạn chưa đăng nhập. Khi bạn đã ở trên trang, bạn có thể cuộn xuống để xem số liệu thống kê của mình và đổi chủ đề PS4. </p> <p> Trải nghiệm Kết thúc sẽ chỉ có sẵn cho đến ngày 2 tháng 3 năm 2021. Vì vậy, đừng trì hoãn nếu bạn muốn tham gia. </p> <p> Có những điều kiện mà bạn phải đáp ứng để sử dụng PlayStation Wrap-Up: </p> <ul> <li> Có một tài khoản PSN đã đăng ký trong khu vực của bạn. </li> <li> Từ 18 tuổi trở lên. </li> <li> Đã chơi trò chơi ít nhất 10 giờ trên bảng điều khiển PS4 trong khoảng thời gian từ ngày 1 tháng 1 năm 2020 đến ngày 31 tháng 12 năm 2020. </li> </ul> <p> Ngoài ra, người dùng ở Châu Âu, Trung Đông, Châu Phi, Úc, Ấn Độ và Nga phải bật bộ sưu tập <strong> Dữ liệu bổ sung </strong> . Bạn có thể bật tính năng này trên PS4 thông qua <strong> Cài đặt </strong> &gt; <strong> Dữ liệu thiết bị / Sức khỏe &amp; An toàn </strong> &gt; <strong> Dữ liệu thiết bị </strong> . </p> <p> Cuối cùng, bạn có thể nhận được một email có chứa PlayStation Wrap-Up của bạn. Tuy nhiên, bạn phải chọn nhận email tiếp thị, bạn có thể thực hiện việc này thông qua <strong> Cài đặt thông báo </strong> trong tài khoản PSN của bạn. </p> <p> </p> <h2 id=\"will-there-be-a-2021-wrap-up\"> Sẽ có một kết thúc năm 2021? </h2> <p> <img alt=\"A PS5 DualSense controller against a PS5 console that is blurred\" src=\"images/ps5-controller-blurred-background-792.jpg\" loading=\"lazy\"> </p> <p> Đây là năm thứ hai liên tiếp Sony chạy trải nghiệm Wrap-Up. Vì nó chỉ phân tích dữ liệu năm 2020 nên nó tập trung nhiều hơn vào PS4. </p> <p> Hy vọng rằng Sony sẽ làm lại điều đó vào năm sau, khi PS5 sẽ ra mắt lâu hơn và có nhiều trò chơi được phát hành hơn. </p>"}