{"title":"Cách giữ dữ liệu cá nhân của bạn an toàn trước nhà tuyển dụng","content":"<p> Công nghệ giám sát tràn lan trong và ngoài văn phòng. Nhiều nhà tuyển dụng sử dụng các sản phẩm quản lý di động cho các thiết bị do công ty phát hành như điện thoại, máy tính xách tay và máy tính bảng. Chúng chứa các chương trình được thiết kế để bảo vệ doanh nghiệp khỏi hành vi trộm cắp, gián điệp của công ty hoặc mục đích xấu. </p> <p> Tuy nhiên, mặc dù tất cả những điều này đều tuyệt vời để bảo vệ công ty của bạn, nhưng chúng không chính xác là điều tốt nhất cho bạn. Nó không còn là một câu hỏi về <strong> nếu </strong> công ty của bạn đang theo dõi bạn; điều tiếp theo bạn cần hỏi là, các công ty thực sự có thể tìm thấy bao nhiêu dữ liệu? Đáng ngạc nhiên, rất nhiều. </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> Nhà tuyển dụng có thể thấy gì trên Wi-Fi và Thiết bị Từ xa của Công ty? </h2> <p> Hầu hết mọi người không nhận ra mức độ mà các công ty có quyền truy cập vào dữ liệu của họ hoặc mức độ họ đăng nhập khi sử dụng các thiết bị của công ty. Dưới đây là một số ví dụ. </p> <h3 id=\"location\"> Vị trí </h3> <p> Nhiều nhân viên nghĩ rằng việc sử dụng Mạng riêng ảo (VPN) là đủ để khiến người sử dụng lao động của họ tin rằng họ đang ở đúng vị trí của họ. </p> <p> Mặc dù có nhiều cách để ẩn vị trí thực của bạn trên thiết bị cá nhân, nhưng nó không phải là cách hoàn toàn dễ bị đánh lừa, đặc biệt khi đăng nhập vào bất kỳ ứng dụng hoặc trang web nào bằng địa chỉ email hoặc số điện thoại do công ty cấp. </p> <p> </p> <p> Có thể gần như không thể che giấu vị trí thực của bạn khi sử dụng các thiết bị do công ty cấp. Ví dụ: các công ty viễn thông có thể phát hiện khi bạn đã kết nối với bất kỳ đối tác chuyển vùng nào của họ. </p> <p> Ngoài ra, VPN công ty khác với VPN thương mại với các cổng được giám sát bởi các nhóm CNTT nội bộ. </p> <h3 id=\"notes-documents-and-emails\"> Ghi chú, Tài liệu và Email </h3> <p> Nếu bạn nghĩ rằng không ai biết rằng bạn đang sử dụng Wi-Fi của công ty để tìm công việc tiếp theo thì bạn đã nhầm. Ngay cả khi bạn không sử dụng địa chỉ email công ty, nhiều doanh nghiệp đã cài đặt sẵn các chương trình trong máy tính xách tay của công ty bao gồm nhật ký hoạt động thời gian thực, cập nhật lịch sử duyệt web và ảnh chụp màn hình theo thời gian của các tài liệu và email đang mở. </p> <p> Trên cơ sở bảo vệ chống lại các vi phạm dữ liệu có thể xảy ra, nhiều công ty cũng sử dụng chúng làm cơ chế báo cáo hoặc theo dõi năng suất. </p> <p> </p> <h3 id=\"online-messaging-history\"> Lịch sử nhắn tin trực tuyến </h3> <p> Bất chấp sự gia tăng của các nền tảng mã hóa, thực tế là tin nhắn của bạn không hoàn toàn riêng tư trên các thiết bị của công ty. Khi sử dụng nền tảng nhắn tin, các công ty có thể không xem được chi tiết chính xác về trao đổi của bạn nhưng vẫn có thể nhận ra siêu dữ liệu về kích thước và loại tệp như vậy. </p> <p> Với điều này, nếu bạn quyết định gửi các tệp PDF có kích thước lớn thông qua một ứng dụng như WhatsApp, hệ thống phát hiện xâm nhập của công ty bạn có thể sẽ gắn cờ cho bạn về hành vi đáng ngờ. Theo nguyên tắc của công ty, họ có thể yêu cầu bạn chứng minh hành động của bạn không có ác ý và có thể phải yêu cầu ban lãnh đạo đăng ký để được thông qua. </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> Cách tránh chia sẻ dữ liệu cá nhân với nhà tuyển dụng của bạn </h2> <p> Không có cách nào tuyệt đối để giữ thông tin cá nhân, cuộc trò chuyện và hoạt động của bạn luôn nằm ngoài tầm với của bạn. Tuy nhiên, có một số cách mà bạn có thể giảm thiểu rủi ro. </p> <p> Chúng tôi không xác nhận việc ẩn dữ liệu từ các nhà tuyển dụng của bạn; trên thực tế, họ có quyền thu thập thông tin về nhân viên của mình — thậm chí là <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> có thể theo dõi bạn một cách hợp pháp </a> . Nhưng bạn cần biết thời điểm thích hợp để giữ mọi thứ cho riêng mình, và điều đó phụ thuộc vào từng công ty. </p> <h3 id=\"read-company-policies\"> Đọc Chính sách Công ty </h3> <p> Trước khi có thể tranh luận về tính minh bạch của dữ liệu, bạn cũng phải hiểu loại thông tin mà bạn đang cố ý cung cấp cho chủ nhân của mình khi làm việc cho họ. Chỉ khi bạn biết những gì được mong đợi, bạn mới có thể thiết lập ranh giới nghề nghiệp phù hợp. </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> Cố gắng hiểu các chính sách và thủ tục thu thập dữ liệu của công ty trước khi chúng được thu thập. Từ đó, bạn có thể lập kế hoạch từ chối cung cấp nhiều thông tin hơn mức cần thiết một cách hiệu quả. </p> <h3 id=\"use-personal-gadgets\"> Sử dụng Tiện ích Cá nhân </h3> <p> Mặc dù mọi người luôn có xu hướng sử dụng các thiết bị của công ty để tiết kiệm tiền, nhưng thực tế là không có gì thực sự miễn phí. Đầu tư vào máy tính xách tay, điện thoại di động và máy tính bảng để sử dụng cá nhân. </p> <p> Có các thiết bị cá nhân riêng biệt cũng là một cách tuyệt vời để thiết lập ranh giới, đặc biệt là khi làm việc từ xa. </p> <p> Sử dụng thiết bị của riêng bạn cho phép bạn thiết lập và quản lý các phương pháp bảo mật khác nhau cần thiết để giữ cho dữ liệu của bạn an toàn trước những con mắt tò mò. Nó có vẻ như là một khoản chi không cần thiết, nhưng nó sẽ giúp bạn giữ được sự yên tâm trong một chặng đường dài. </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> Sử dụng hồ sơ khách trên thiết bị cá nhân </h3> <p> Kết nối với bất kỳ mạng nào không phải của riêng bạn luôn là một rủi ro bảo mật, ngay cả khi nó ở cơ sở làm việc. Đăng nhập vào Wi-Fi của công ty cung cấp cho chủ nhân của bạn quyền truy cập mọi thứ từ siêu dữ liệu tin nhắn của bạn đến nhật ký lịch sử duyệt web. </p> <p> Nếu bạn thực sự cần sử dụng máy tính xách tay cá nhân của mình trên mạng công ty, bạn có thể chọn sử dụng hồ sơ khách để giảm lượng dữ liệu họ có thể truy cập từ xa. Ngoài ra, bạn có thể kết nối với gói dữ liệu của điện thoại di động cá nhân hoặc thiết bị Wi-Fi di động của mình. </p> <h3 id=\"keep-your-passwords-safe\"> Giữ mật khẩu của bạn an toàn </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> Tạo mật khẩu mạnh </a> là không đủ. Bạn cần đảm bảo rằng mật khẩu của mình không bị lưu trên các thiết bị của công ty. Lưu mật khẩu cá nhân cho tài khoản ngân hàng trực tuyến, email cá nhân hoặc trang web của chính phủ trên các tiện ích mà bạn không sở hữu sẽ khiến dữ liệu của bạn gặp rủi ro ngay lập tức nếu cơ sở dữ liệu công ty của bạn bị xâm phạm. </p> <p> Chỉ sử dụng điện thoại di động hoặc máy tính xách tay cá nhân của bạn để truy cập vào các tài khoản quan trọng, đặc biệt là những tài khoản có liên quan đến tiền. Bất cứ khi nào có thể, hãy bật xác thực hai yếu tố. </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> Tách biệt công việc và cuộc sống cá nhân của bạn </h2> <p> Nhà tuyển dụng có quyền truy cập từ xa vào thiết bị do công ty bạn cấp nếu họ nghi ngờ bạn đang tham gia vào bất kỳ hình thức hoạt động bất hợp pháp nào, khiến thông tin công ty gặp rủi ro hoặc bị cơ quan thực thi pháp luật yêu cầu điều tra. </p> <p> Tuy nhiên, điều này khác với các thiết bị cá nhân. </p> <p> Bảo mật của bạn chỉ mạnh mẽ như những người bạn đang liên hệ — bao gồm cả chủ nhân của bạn. Giữ thiết bị cá nhân và công việc của bạn tách biệt chỉ là một bước để phân cấp dữ liệu của bạn. Bằng cách thực hiện các biện pháp bảo mật mạnh mẽ, bạn có thể giới hạn số lượng điểm truy cập mà tin tặc có đối với tài liệu, email và mạng. </p> <p> Việc phân cấp dữ liệu cá nhân là cần thiết vì nó bảo vệ bạn, với tư cách cá nhân và công ty của bạn khỏi hành vi trộm cắp, gian lận và các hình thức tội phạm mạng khác. </p>"}