{"title":"Làm thế nào để biến PS5 của bạn từ dọc sang ngang (hoặc Phó bản)","content":"<p> PlayStation 5 hoạt động theo thiết lập dọc hoặc ngang. Nếu bạn thay đổi ý định về hướng ưa thích của mình, bạn sẽ dễ dàng di chuyển PS5 của mình từ chiều dọc sang chiều ngang (hoặc ngược lại). </p> <p> Hãy xem cách di chuyển PS5 của bạn một cách an toàn từ hướng thẳng đứng sang nằm ngang và quay lại một lần nữa. </p> <h2 id=\"first-shut-down-and-unplug-your-ps5\"> Đầu tiên: Tắt và rút phích cắm PS5 của bạn </h2> <p> Trước khi bạn thực hiện bất kỳ công việc nào để di chuyển PlayStation 5 về mặt vật lý, điều quan trọng là phải tắt nó và rút phích cắm mọi thứ. Điều này sẽ ngăn ngừa thiệt hại cho hệ thống có thể xảy ra nếu bạn di chuyển nó xung quanh trong khi nó được bật. </p> <p> Bạn nên tắt hoàn toàn PS5 của mình. Để làm điều này, hãy nhấn <strong> Nút PS </strong> trên bộ điều khiển của bạn để hiển thị menu nhanh ở cuối màn hình. Lựa chọn <strong> Quyền lực </strong> ở bên phải và chọn <strong> Tắt PS5 </strong> . </p> <p> <img alt=\"PS5 Power Menu\" src=\"images/ps5-power-menu-866.jpg\" loading=\"lazy\"> </p> <p> Chờ cho đến khi đèn của bảng điều khiển tắt, sau đó rút cáp nguồn, cáp HDMI và bất kỳ thứ gì khác mà bạn đã kết nối với hệ thống. Bây giờ bạn đã sẵn sàng để thay đổi hướng của PS5. </p> <p> <img alt=\"Unplug PS5 Cables\" src=\"images/01-unplug-ps5-cables-747.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"remove-the-stand-screw\"> Tháo vít đứng </h2> <p> Khi bạn thiết lập PS5 của mình theo chiều dọc, bạn phải lấy một con vít đi kèm ra khỏi một ngăn trong đế và sử dụng nó để cố định phần đế vào bảng điều khiển khi nó nằm theo chiều dọc. Do đó, việc tháo vít này là bước đầu tiên của bạn trong việc thay đổi hướng của bảng điều khiển. </p> <p> Nhẹ nhàng lật PS5 của bạn trên mặt của nó để bạn có thể tiếp cận giá đỡ ở phía dưới. Sử dụng tuốc nơ vít đầu dẹt, đồng xu, hoặc loại tương tự để tháo vít bạc duy nhất giữ đế vào hệ thống. </p> <p> <img alt=\"PS5 Remove Base Screw\" src=\"images/02-ps5-remove-base-screw-206.jpg\" loading=\"lazy\"> </p> <p> Khi vít bị lỏng, phần đế sẽ tự do. Có một ngăn nhỏ ở đế để bạn có thể cất vít. Đính nó vào vị trí ở đó, sau đó trượt nó vào lỗ nhỏ để giữ cố định. </p> <p> <img alt=\"PS5 Screw Compartment\" src=\"images/03-ps5-screw-compartment-266.jpg\" loading=\"lazy\"> </p> <p> Cũng trong ngăn này, bạn sẽ tìm thấy một nút nhỏ màu đen (miễn là bạn đặt nó ở đó trong quá trình thiết lập ban đầu). Tháo nút này và sử dụng nó để cắm lỗ trên đáy của PS5 nơi bạn vừa lấy vít ra. </p> <p> <img alt=\"PS5 Base Stopper Plug\" src=\"images/04-ps5-base-stopper-plug-837.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rotate-the-base\"> Xoay cơ sở </h2> <p> Bây giờ, bạn sẽ muốn xoay đế để nó phù hợp với bảng điều khiển theo hướng nằm ngang của nó. Thao tác này cũng đóng ngăn nhỏ nơi bạn đặt vít, giữ chặt hơn nữa. </p> <p> Bạn nên xoay phần đế khi nhìn từ trên xuống (đối diện với nơi bạn vừa cất ốc vít). Nếu bạn coi phần nâng lên của giá đỡ là &quot;phía bắc&quot;, bạn sẽ cần xoay phần bên ngoài của giá đỡ về phía &quot;tây bắc&quot;, như được hiển thị bên dưới. </p> <p> <img alt=\"PS5 Horizontal Stand Position\" src=\"images/05-ps5-horizontal-stand-position-566.jpg\" loading=\"lazy\"> </p> <p> Đây là hướng chính xác để sử dụng giá đỡ theo chiều ngang. Nó sẽ nhấp và nhẹ nhàng dừng lại khi bạn đặt nó vào đúng vị trí. </p> <p> </p> <h2 id=\"attach-the-stand-in-the-horizontal-position\"> Gắn chân đế ở vị trí nằm ngang </h2> <p> Bây giờ, bạn có thể gắn chân đế vào PS5 của mình khi nó đang nằm ngang. Đảm bảo rằng hệ thống đang hoạt động đúng cách --- logo PS phải hướng lên trên. </p> <p> Ở mặt sau hệ thống của bạn, bên dưới và gần hai cổng USB, bạn sẽ thấy một số ký hiệu bộ điều khiển PlayStation được in chìm trên bảng điều khiển. Trượt các cánh tay bên ngoài của đế (mà bạn vừa xoay) vào hệ thống xung quanh nơi mà mẫu này kết thúc ở mỗi bên. </p> <p> <img alt=\"PS5 Horizontal Base Position\" src=\"images/06-ps5-horizontal-base-position-657.jpg\" loading=\"lazy\"> </p> <p> Đẩy các kẹp để cố định chúng, nhưng lưu ý rằng ở vị trí này, chân đế không được khóa hoàn toàn vào vị trí (giống như với vít khi được đặt thẳng đứng). Hãy nhẹ nhàng khi bạn đặt hệ thống xuống và lưu ý rằng chân đế có thể bị trượt nếu bạn kéo mạnh. </p> <p> <img alt=\"PS5 Horizontal Stand Second Angle\" src=\"images/07-ps5-horizontal-stand-second-angle-909.jpg\" loading=\"lazy\"> </p> <p> Bây giờ bạn đã sẵn sàng để sử dụng PS5 của mình theo hướng ngang. Cắm lại tất cả các cáp và khởi động để chơi lại. Nếu bạn có PS5 tiêu chuẩn, bạn sẽ lắp đĩa úp theo hướng này. </p> <p> </p> <h2 id=\"how-to-change-your-ps5-back-from-horizontal-to-vertical\"> Làm thế nào để thay đổi PS5 của bạn trở lại từ ngang sang dọc </h2> <p> Bạn muốn quay lại hướng dọc cho PS5 của mình hoặc có thể ban đầu bạn thiết lập PS5 của mình ở dạng nằm ngang và bây giờ muốn quay theo chiều dọc? Dù bằng cách nào, thật dễ dàng để thực hiện quy trình trên theo thứ tự ngược lại. Trước tiên, hãy đảm bảo rằng bạn đã tắt và rút phích cắm của PS5 nếu nó hiện đang được bật hoặc ở chế độ Nghỉ. </p> <p> </p> <p> Để hoán đổi sang hướng thẳng đứng, trước tiên hãy nhấc PS5 của bạn lên và nhẹ nhàng kéo phần nổi ra khỏi hệ thống để tháo nó ra. Tiếp theo, bạn nên xoay cánh tay bên ngoài của đế. Khi nhìn từ trên xuống, cánh tay phải ở &quot;hướng bắc&quot;, thẳng hàng với phần nhô lên. Hãy chắc chắn rằng bạn cảm thấy nhấp chuột nhẹ nhàng để bạn biết nó đang ở đúng nơi. </p> <p> <img alt=\"PS5 Stand Vertical Position\" src=\"images/08-ps5-stand-vertical-position-545.jpg\" loading=\"lazy\"> </p> <p> Định vị PS5 của bạn để bạn có thể truy cập vào phía dưới, sau đó tháo nút màu đen khỏi lỗ ở giữa — nó nằm gần ở giữa lỗ thông hơi. </p> <p> <img alt=\"PS5 Plugged Screw Hole\" src=\"images/09-ps5-plugged-screw-hole-255.jpg\" loading=\"lazy\"> </p> <p> Đặt nút đen này vào bên trong lỗ nhỏ trong ngăn ở mặt dưới của đế. Nút phải bắt ngay vào vị trí của nó. </p> <p> <img alt=\"PS5 Base Plug Spot\" src=\"images/10-ps5-base-plug-spot-557.jpg\" loading=\"lazy\"> </p> <p> Tiếp theo, tháo vít khỏi cùng một ngăn trong đế. Bây giờ, bạn sẽ cần gắn chân đế vào đúng vị trí của nó. Để làm như vậy, hãy dựng PS5 của bạn lên sao cho mặt sau của bảng điều khiển hướng lên trên, như hình dưới đây. </p> <p> Lấy giá đỡ và đặt nó sao cho lỗ vít thẳng hàng với lỗ vít bạn vừa tháo nút. Đặt các kẹp trên tay đế ở phía sau hệ thống của bạn bên dưới đầu nối nguồn. Giá đỡ phải xếp hàng dễ dàng. </p> <p> <img alt=\"PS5 Attach Vertical Base\" src=\"images/11-ps5-attach-vertical-base-695.jpg\" loading=\"lazy\"> </p> <p> Bây giờ, sử dụng một tuốc nơ vít hoặc tương tự để siết chặt vít. Khi bạn đã hoàn tất và chân đế cảm thấy được gắn chắc chắn, bạn đã sẵn sàng sử dụng PS5 theo chiều dọc. Cắm lại tất cả các cáp để hoàn thành công việc. </p> <p> </p> <h2 id=\"should-you-stand-your-ps5-vertically-or-horizontally\"> Bạn nên đứng PS5 của mình theo chiều dọc hay chiều ngang? </h2> <p> Sony hỗ trợ sử dụng PS5 của bạn theo cả chiều dọc và chiều ngang, vì vậy không có cách nào đúng hay sai để làm điều đó, miễn là hệ thống của bạn có đủ luồng không khí. Bạn nên sử dụng định hướng nào tùy thuộc vào nhu cầu của bạn. </p> <p> </p> <p> Nếu bạn có nhiều không gian và không ngại PS5 chiếm nhiều không gian theo chiều ngang, thì kiểu dáng ngang sẽ rất đẹp. Đối với những người có mẫu PS5 tiêu chuẩn, nó cũng làm cho quá trình chèn đĩa dễ dàng hơn một chút, vì nhãn phải luôn hướng lên trên. Điều này khó nhớ hơn một chút với hướng dọc, nơi nhãn đĩa phải hướng về bên trái. </p> <p> <img alt=\"Horizontal PS5 Look\" src=\"images/12-horizontal-ps5-look-906.jpg\" loading=\"lazy\"> </p> <p> Tuy nhiên, bạn có thể không có không gian bên trong hệ thống giải trí của mình để phù hợp với thiết lập ngang. Trong những trường hợp này, đi theo chiều dọc là đặt cược tốt nhất của bạn. PS5 là một giao diện điều khiển khổng lồ, nhưng khi được đặt theo chiều dọc, nó sẽ nằm bên cạnh giá đỡ TV của bạn hoặc tương tự. Đây là thiết lập tôi sử dụng, như được hiển thị trong hình ảnh bên dưới. </p> <p> <img alt=\"PS5 Vertical by TV Stand\" src=\"images/13-ps5-vertical-by-tv-stand-905.jpg\" loading=\"lazy\"> </p> <p> Cho dù bạn chọn hướng nào cho PS5 của mình, hãy đảm bảo rằng bạn sử dụng chân đế. Nó giữ cho hệ thống không hoạt động, giúp cải thiện luồng không khí. Chân đế cũng giữ chặt PS5, giúp máy khó bị xô đổ hơn và có khả năng làm hỏng máy. </p> <p> </p> <h2 id=\"set-up-your-ps5-and-get-playing\"> Thiết lập PS5 của bạn và chơi </h2> <p> Bây giờ bạn đã biết cách thay đổi PS5 của mình từ dọc sang ngang và quay lại chỉ trong vài phút. Sau khi hệ thống của bạn được thiết lập, hãy kích hoạt nó và thưởng thức một số tựa game hay nhất của PS5. </p> <p> Đừng quên rằng gần như tất cả thư viện của PS4 cũng hoạt động trên PS5, mang lại cho bạn nhiều thứ hơn để thưởng thức. </p> <p> <small> Tín dụng hình ảnh: Alex Van Aken / <a href=\"https://www.shutterstock.com/image-photo/boulder-co-november-12-2020-tech-1860777502\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}