{"title":"Cách chụp ảnh màn hình trên máy tính bảng Surface Pro","content":"<p> Chụp ảnh màn hình là một kỹ năng đơn giản nhưng cần thiết trên mọi thiết bị. Trên Surface Pro Tablet, bạn có thể chụp ảnh màn hình bằng phím tắt, công cụ cắt hoặc thậm chí Xbox Game Bar. Chúng tôi sẽ chỉ cho bạn cách sử dụng tất cả các phương pháp này để chụp ảnh màn hình hoặc thậm chí là ghi màn hình trên thiết bị Surface của bạn. </p> <h2 id=\"taking-a-screenshot-using-button-combinations\"> Chụp ảnh màn hình bằng các tổ hợp nút </h2> <p> Trên dòng thiết bị Surface Pro, việc chụp ảnh màn hình bằng các tổ hợp nút rất nhanh chóng và dễ dàng. Để chụp ảnh màn hình, hãy nhấn giữ <strong> Quyền lực </strong> và <strong> Tăng âm lượng </strong> chìa khóa cùng một lúc. Màn hình sẽ nhấp nháy và ảnh chụp màn hình sẽ được lưu trong thư mục ảnh chụp màn hình bên dưới Ảnh trên thiết bị của bạn. </p> <p> Phương pháp này hoạt động cho dòng thiết bị Surface Pro mới nhất (tức là Surface Pro 7+, Pro X), Surface Go, Surface Go 2 và dòng thiết bị Surface Book. </p> <p> Nếu Surface của bạn là kiểu máy cũ hơn (Surface 3 trở lên), tổ hợp nút sẽ khác một chút. Bạn phải nhấn <strong> Nút Windows </strong> (không phải Phím Windows trên bàn phím của bạn) và <strong> Giảm âm lượng </strong> cùng một lúc. Thiết bị sẽ lưu ảnh chụp màn hình của bạn vào Thư mục Ảnh chụp màn hình trong Ảnh. </p> <p> <img alt=\"Buttons of the Microsoft Surface Pro circled\" src=\"images/surface-button-circled-891.jpg\" loading=\"lazy\"> </p> <p> Tương tự, để chụp ảnh màn hình trên Surface Duo của bạn, hãy nhấn giữ <strong> Quyền lực </strong> nút và <strong> Giảm âm lượng </strong> Chìa khóa. Ảnh chụp màn hình sẽ được lưu vào thư viện của thiết bị của bạn trong Ảnh chụp màn hình. Ngoài ra, bạn có thể chỉ cần nhấn giữ <strong> Quyền lực </strong> phím và nhấp vào <strong> Ảnh chụp màn hình </strong> trên màn hình. </p> <p> <img alt=\"Duo button combo highlight for screenshotting\" src=\"images/duo-screenshot-button-combo-820.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-take-a-surface-pro-screenshot-using-keyboard-shortcuts\"> Cách chụp ảnh màn hình Surface Pro bằng phím tắt </h2> <p> Phím tắt là một cách khác để bạn có thể nắm bắt nội dung trên màn hình của mình. </p> <p> Các phím tắt này hoạt động trên tất cả các thiết bị Windows, vì vậy hãy xem <a href=\"https://www.makeuseof.com/tag/3-ways-to-screenshot-on-windows-10-without-print-screen/\" target=\"_blank\" rel=\"nofollow noopener\"> các phương pháp chụp ảnh màn hình khác trên Windows 10 </a> . Các phím tắt hoạt động tốt nhất trên dòng thiết bị Surface Laptop và Surface Book, nhưng tất nhiên, nếu bạn có tệp đính kèm bàn phím cho thiết bị Surface Pro hoặc Go của mình, các phím tắt này cũng hoạt động. </p> <h3 id=\"print-screen-methods\"> Phương pháp màn hình in </h3> <p> Để chụp ảnh màn hình bằng phương pháp Print Screen, chỉ cần nhấn <strong> PrtScn </strong> trên bàn phím của bạn. Thao tác này sẽ chụp ảnh màn hình của toàn bộ màn hình của bạn. Lưu ý rằng điều này sẽ không lưu ảnh chụp màn hình vào Surface của bạn nhưng sẽ thêm nó vào khay nhớ tạm của bạn. Bạn phải sử dụng một chương trình như Microsoft Paint để dán ảnh chụp màn hình. </p> <p> Ép <strong> Alt + PrtScn </strong> sẽ chỉ chụp ảnh màn hình cửa sổ hiện tại của bạn và tương tự sẽ thêm ảnh chụp màn hình vào khay nhớ tạm của bạn. </p> <p> <img alt=\"print screen on MS Paint\" src=\"images/print-screen-on-microsoft-paint-922.jpg\" loading=\"lazy\"> </p> <h3 id=\"snip-and-sketch\"> Snip và Sketch </h3> <p> Đây là phương pháp dễ dàng nhất để chụp ảnh màn hình trên thiết bị Surface của bạn. </p> <p> Để mở Snip và Sketch, hãy nhấn <strong> Phím Windows + Shift + S, </strong> và một lớp phủ sẽ xuất hiện trên màn hình của bạn. Để chụp toàn màn hình, hãy nhấn nút Toàn màn hình ở trên cùng của lớp phủ. Để chỉ chụp ảnh màn hình của cửa sổ hiện tại của bạn, hãy nhấn nút Window Snip bên cạnh nút Toàn màn hình. </p> <p> Bạn cũng có thể chụp ảnh màn hình của một khu vực cụ thể trên màn hình của mình. Theo mặc định, Snip and Sketch có Rectangular Snip. Chỉ cần kéo qua phần bạn muốn chụp màn hình bằng màn hình cảm ứng hoặc bàn di chuột của bạn. </p> <p> Snip and Sketch sẽ cung cấp cho bạn một thông báo trong bảng thông báo cho biết ảnh chụp màn hình của bạn đã được sao chép vào khay nhớ tạm. Nếu bạn nhấp vào nó, bạn có thể vẽ và phác thảo trên ảnh chụp màn hình nếu muốn. </p> <p> Để lưu nó vào tệp của bạn, hãy sử dụng <strong> Ctrl + S </strong> hoặc nút Lưu ở góc trên cùng bên phải để lưu ảnh chụp màn hình của bạn vào một thư mục cụ thể. </p> <h3 id=\"xbox-game-bar\"> Thanh trò chơi Xbox </h3> <p> Để chụp ảnh màn hình bằng Xbox Game Bar, hãy nhấn <strong> Phím Windows + G </strong> mở nó ra. </p> <p> Từ đó, bạn có thể nhấp vào tab Chụp và nhấp vào Nút Máy ảnh. Phương pháp này cũng sẽ cho phép bạn quay video màn hình có âm thanh. Các bản chụp đã lưu của bạn sẽ xuất hiện trong thư mục Video và thư mục con Captures. Trên Xbox, bạn có thể tương tự <a href=\"https://www.makeuseof.com/capture-share-screenshots-videos-xbox-series-x/\" target=\"_blank\" rel=\"nofollow noopener\"> chụp ảnh màn hình và ghi âm </a> . </p> <p> <img alt=\"Xbox Game Bar Capture screen\" src=\"images/xbox-game-bar-on-windows-741.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-surface-pro-screenshot-using-the-surface-pen\"> Chụp ảnh màn hình Surface Pro bằng Surface Pen </h2> <p> Để chụp ảnh màn hình bằng Surface Pen, chỉ cần Nhấp đúp vào công cụ xóa và thiết bị của bạn sẽ hiển thị Snip và Sketch của toàn bộ cửa sổ của bạn. Từ đây, bạn có thể phác thảo và xuất ảnh chụp màn hình của mình. </p> <p> <img alt=\"Surface Pen eraser/button highlighted\" src=\"images/surface-pen-eraser-circled-902.jpg\" loading=\"lazy\"> </p> <p> Bạn cũng có thể truy cập phần này bằng cách tìm kiếm Windows Ink Workspace trên đế của bạn. Từ đây, chọn Toàn màn hình Snip. Bạn có thể thay đổi chức năng của các phím tắt trên Surface Pen bằng cách tìm kiếm Cài đặt không gian làm việc của Windows Ink và cuộn xuống Không gian làm việc của Windows Ink. </p> <p> <img alt=\"Windows ink workspace settings\" src=\"images/windows-ink-workspace-settings-799.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"taking-a-screenshot-on-surface-made-simple\"> Chụp ảnh màn hình trên bề mặt, được thực hiện đơn giản </h2> <p> Bây giờ bạn đã biết tất cả các phương pháp chụp ảnh màn hình hoặc quay phim màn hình khác nhau trên thiết bị Surface của mình. Các tổ hợp nút là cách tốt nhất để chụp ảnh màn hình nếu bạn đang sử dụng Surface Pro hoặc Surface Go, nhưng các phím tắt cũng dễ dàng. </p>"}