{"title":"Cách chuyển tiếp văn bản trên Android","content":"<p> Nếu bạn muốn chuyển tiếp một văn bản đến ai đó từ thiết bị Android của mình, bạn không cần phải nhập văn bản đó ra hoặc sao chép và dán. Thay vào đó, bạn có thể sử dụng chức năng chuyển tiếp. </p> <p> Quá trình này hơi khác một chút tùy thuộc vào ứng dụng nhắn tin bạn sử dụng. Điều đó nói rằng, các bước rất đơn giản và gần giống nhau. </p> <p> Chúng tôi sẽ hướng dẫn bạn cách chuyển tiếp một tin nhắn văn bản SMS trên ứng dụng Android Messages cổ phiếu và ứng dụng Samsung tương đương. </p> <h2 id=\"how-to-forward-a-text-on-android-stock\"> Cách chuyển tiếp văn bản trên Android (Stock) </h2> <ol> <li> Trong ứng dụng Android Messages có sẵn, hãy mở cuộc trò chuyện văn bản có chứa tin nhắn bạn muốn chuyển tiếp. </li> <li> <strong> nhấn và giữ </strong> trên tin nhắn. </li> <li> Chạm vào <strong> ba chấm dọc </strong> ở trên cùng bên phải. </li> <li> Từ danh sách, chọn người bạn muốn chuyển tiếp tin nhắn. Ngoài ra, để gửi nó cho người không có trong danh sách đó, hãy nhấn <strong> Tin nhắn mới </strong> . </li> <li> Tin nhắn được chuyển tiếp sẽ xuất hiện trong trường tin nhắn. Bạn có thể thêm hoặc sửa đổi thông báo này nếu cần. Khi đã sẵn sàng, hãy nhấn vào <strong> Nút gửi </strong> (mũi tên phải) để chuyển tiếp tin nhắn. </li> </ol> <p> </p> <h2 id=\"how-to-forward-a-text-on-samsung-phones\"> Cách chuyển tiếp văn bản trên điện thoại Samsung </h2> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (3 Hình ảnh) </strong> <img alt=\"forward message android\" src=\"images/forward-message-android-497.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"forward message android searching names\" src=\"images/forward-message-android-searching-names-240.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"forward message android multiple names selected\" src=\"images/forward-message-android-multiple-names-selected-924.jpg\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <ol> <li> Mở cuộc trò chuyện văn bản có chứa tin nhắn bạn muốn chuyển tiếp. </li> <li> <strong> nhấn và giữ </strong> trên tin nhắn. </li> <li> Nhấn vào <strong> Ở đằng trước </strong> . </li> <li> Tìm người nhận, thông qua <strong> Cuộc trò chuyện </strong> hoặc là <strong> Liên lạc </strong> chuyển hướng. Nhấn vào tên của họ. Bạn có thể chọn nhiều người nhận nếu muốn. </li> <li> Nhấn vào <strong> Làm xong </strong> . </li> <li> Tin nhắn được chuyển tiếp sẽ xuất hiện trong trường tin nhắn. Bạn có thể thêm hoặc sửa đổi thông báo này nếu cần. Khi đã sẵn sàng, hãy nhấn vào <strong> Nút gửi </strong> (mũi tên phải) để chuyển tiếp tin nhắn. </li> </ol> <p> </p> <p> </p> <h2 id=\"why-can-t-i-forward-a-text-on-android\"> Tại sao tôi không thể chuyển tiếp văn bản trên Android? </h2> <p> Nếu bạn không thể thấy tùy chọn chuyển tiếp, có thể là do bạn đã chọn toàn bộ cuộc trò chuyện hoặc nhiều văn bản. Không giống như một số <a href=\"https://www.makeuseof.com/tag/messaging-apps-phone-computer/\" target=\"_blank\" rel=\"nofollow noopener\"> ứng dụng nhắn tin tốt nhất </a> như WhatsApp, hầu hết các ứng dụng SMS không cho phép bạn chuyển tiếp nhiều văn bản cùng một lúc. Nếu bạn gặp sự cố này, hãy đảm bảo rằng bạn đang chọn một văn bản. </p> <p> </p> <h2 id=\"forward-your-calls-on-android\"> Chuyển tiếp cuộc gọi của bạn trên Android </h2> <p> Bạn có biết rằng tin nhắn văn bản không phải là thứ duy nhất bạn có thể chuyển tiếp trên Android? Bạn cũng có thể thiết lập chuyển tiếp cuộc gọi để có thể chuyển cuộc gọi của mình đến một số khác. </p>"}