{"title":"Cách sử dụng ứng dụng Apple Watch Workout","content":"<p> Hiểu rõ hơn về tiến trình thể chất của bạn chỉ bằng một cú chạm với Apple Watch. </p> <p> Chúng tôi đang xem xét mọi thứ mà ứng dụng Apple Watch Workout cung cấp, bao gồm cách ứng dụng hoạt động, loại hình tập luyện nào ứng dụng có thể theo dõi và cách xem tất cả thông tin mà ứng dụng thu thập. </p> <h2 id=\"getting-started-with-the-workout-app\"> Bắt đầu với ứng dụng Workout </h2> <p> Bạn có thể mở ứng dụng Workout trên Apple Watch theo một số cách. Đầu tiên, chỉ cần nhấp một lần vào <strong> Vương miện kỹ thuật số </strong> để hiển thị danh sách ứng dụng trên đồng hồ của bạn. Sau đó chọn <strong> Tập thể dục </strong> . </p> <p> Một cách thậm chí còn nhanh hơn chỉ là sử dụng Siri, bằng cách nhấn và giữ <strong> Vương miện kỹ thuật số </strong> hoặc nâng đồng hồ lên miệng. Sau đó, chỉ cần nói &quot;Mở ứng dụng Workout.&quot; </p> <p> Sau khi mở ứng dụng, bạn sẽ thấy nhiều loại hình tập luyện khác nhau — từ bắn cung đến yoga và mọi thứ khác. </p> <p> Màn hình lựa chọn tập luyện chính được làm nổi bật bởi các tùy chọn phổ biến nhất. Cuộn xuống cuối danh sách và chọn <strong> Thêm bài tập </strong> để xem danh sách các kiểu tập luyện khác. Nếu vì lý do nào đó mà bạn không thấy kiểu tập luyện của mình, bạn cũng có thể chọn <strong> Khác </strong> . </p> <p> <img alt=\"Apple Watch Workout options\" src=\"images/apple-watch-workout-options-267.jpg\" loading=\"lazy\"> </p> <p> Bạn có thể chọn <strong> Ba chấm </strong> ( <strong> ... </strong> ) trên mỗi loại hình tập luyện để đặt mục tiêu cụ thể về khoảng cách, lượng calo đốt cháy hoặc thời gian. Nếu bất kỳ mục tiêu nào trong số đó không làm bạn quan tâm, chỉ cần nhấn vào tên bài tập để bắt đầu ngay lập tức. </p> <p> Sẽ có ba giây đếm ngược trên màn hình trước khi bắt đầu theo dõi. </p> <p> Tất cả các tính năng của ứng dụng Workout đều khả dụng mà không cần iPhone ở gần hoặc chỉ sử dụng Apple Watch được kết nối với Wi-Fi hoặc tín hiệu di động. </p> <p> </p> <p> </p> <h2 id=\"understand-the-workout-app\"> Hiểu ứng dụng tập luyện </h2> <p> Có ba màn hình chính trong ứng dụng. Bạn có thể chuyển đổi giữa chúng bằng cách vuốt sang trái hoặc phải. </p> <p> Màn hình chính sẽ hiển thị tất cả tiến trình của bạn trong loại hình tập luyện bạn đã chọn. Bạn sẽ thấy thời gian tập luyện, lượng calo hoạt động, tổng lượng calo và nhịp tim hiện tại. Tùy thuộc vào loại hình tập luyện của bạn, bạn cũng có thể thấy khoảng cách đã di chuyển. </p> <p> Nếu bạn có Apple Watch Series 5 trở lên và bật màn hình luôn bật, bạn luôn có thể xem số liệu thống kê tập luyện của mình. Bất kỳ ai có kiểu máy cũ hơn sẽ cần phải nâng hoặc chạm vào màn hình để xem thông tin này. </p> <p> <img alt=\"Apple Watch Workout Main Screens\" src=\"images/apple-watch-workout-main-screens-130.jpg\" loading=\"lazy\"> </p> <p> Khi bạn đang chạy hoặc đi bộ, Apple Watch sẽ chạm nhẹ mỗi dặm hoặc km và hiển thị thông tin cập nhật về tốc độ. A cycling recap and tap will occur every five miles or kilometers. </p> <p> Nếu đang tập luyện Apple Fitness +, bạn có thể xem dữ liệu trên cả ứng dụng Workout và màn hình iPhone, iPad hoặc Apple Watch. </p> <p> </p> <p> Vuốt sang phải từ màn hình chính sẽ hiển thị cho bạn bốn tùy chọn khác nhau— <strong> Khóa </strong> , <strong> Mới </strong> , <strong> Kết thúc </strong> và <strong> Tạm ngừng </strong> . </p> <p> Lựa chọn <strong> Khóa </strong> sẽ khóa màn hình để tránh bất kỳ thao tác vô tình nào. Bạn có thể xoay Vương miện kỹ thuật số để mở khóa màn hình. Chỉ cần lưu ý, tùy chọn này sẽ tự động bật trong bất kỳ hình thức tập luyện bơi nào để ngăn các vòi nước vô tình rơi xuống. </p> <p> Như bạn có thể đoán, <strong> Mới </strong> kết thúc bài tập hiện tại và cho phép bạn chọn một loại bài tập mới để bắt đầu lại. Lựa chọn <strong> Kết thúc </strong> sẽ kết thúc quá trình tập luyện hiện tại. </p> <p> Nếu bạn bị gián đoạn, bạn có thể chọn <strong> Tạm ngừng </strong> cái nút. Nhấn nó một lần nữa sẽ bắt đầu theo dõi tập luyện. Bạn cũng có thể thực hiện việc này bằng cách nhấn đồng thời nút Digital Crown và Side Button. </p> <p> Vuốt sang trái từ màn hình tập luyện chính sẽ hiển thị các điều khiển phát lại phương tiện. Đó là một cách dễ dàng để truy cập âm nhạc của bạn hoặc bất kỳ thứ gì khác mà bạn đang nghe trong khi tập luyện. Bạn có thể bỏ qua các bản nhạc, phát, tạm dừng và tăng hoặc giảm âm lượng. </p> <p> </p> <h2 id=\"automatic-workout-reminders\"> Nhắc nhở tập luyện tự động </h2> <p> Không cần phải lo lắng nếu bạn quên bắt đầu tập luyện. Miễn là bạn có watchOS 5 trở lên, Apple Watch có thể tự động nhận ra khi bạn đang tập luyện. Nó sẽ gõ vào cổ tay bạn và hỏi bạn có muốn ghi lại một bài tập luyện hay không, cho phép bạn thay đổi loại bài tập, tắt tiếng các thông báo này trong ngày hoặc chỉ loại bỏ thông báo này. </p> <p> Mặc dù có thể mất vài phút để thông báo xuất hiện, nhưng tất cả tín dụng tập luyện vẫn được lưu. </p> <p> Bạn có thể nhận được lời nhắc tập luyện cho các loại hình tập luyện sau: đi bộ trong nhà, đi bộ ngoài trời, chạy trong nhà, chạy ngoài trời, chạy elip, chèo thuyền, bơi trong hồ bơi và bơi ngoài trời. </p> <p> Để bật hoặc tắt tính năng này, hãy đi tới <strong> Cài đặt&gt; Bài tập&gt; Bắt đầu lời nhắc tập luyện </strong> trên Apple Watch của bạn. </p> <p> <img alt=\"Apple Watch Workout Reminder\" src=\"images/apple-watch-workout-reminder-776.jpg\" loading=\"lazy\"> </p> <p> Đồng hồ Apple cũng có thể cảm nhận khi quá trình tập luyện hoàn tất. Sau một lần nhấn, bạn sẽ thấy thông báo trên màn hình với các tùy chọn kết thúc hoặc tạm dừng bài tập. Bạn cũng có thể loại bỏ hoàn toàn thông báo và tiếp tục tập luyện. </p> <p> Chuyển đổi tính năng này bằng cách đi tới Apple Watch của bạn và đi tới <strong> Cài đặt&gt; Tập luyện&gt; Lời nhắc kết thúc tập luyện </strong> . </p> <p> </p> <h2 id=\"customize-the-data-shown-in-the-workout-app\"> Tùy chỉnh dữ liệu được hiển thị trong ứng dụng tập luyện </h2> <p> Trong giao diện Apple Watch Workout, bạn có thể tùy chỉnh thông tin hiển thị trên màn hình cho nhiều kiểu tập luyện khác nhau. </p> <p> Để bắt đầu, hãy mở ứng dụng Đồng hồ đồng hành trên iPhone của bạn. bên trong <strong> Đồng hồ của tôi </strong> chọn tab <strong> Tập thể dục </strong> . Sau đó chọn <strong> Chế độ xem tập luyện </strong> . Ở đầu trang, bạn có thể chọn hiển thị một hoặc nhiều chỉ số trên màn hình trong khi tập luyện. Nếu bạn chọn <strong> Chỉ số duy nhất </strong> , chỉ cần cuộn Digital Crown để xem thêm dữ liệu trên Apple Watch của bạn. </p> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (3 Hình ảnh) </strong> <img alt=\"Apple Watch app workout\" src=\"images/apple-watch-app-workout-155.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"apple watch workout metrics\" src=\"images/apple-watch-workout-metrics-334.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"apple watch metrics\" src=\"images/apple-watch-metrics-496.jpg\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> Bên dưới đó, bạn cũng có thể thấy một số kiểu tập luyện khác nhau, nơi bạn có thể chỉnh sửa thông tin hiển thị trên màn hình. Chọn một loại hình tập luyện và sau đó chọn <strong> Biên tập </strong> ở trên cùng bên phải của màn hình để tùy chỉnh nội dung hiển thị trên màn hình và theo thứ tự. </p> <p> </p> <h2 id=\"viewing-workout-data-in-the-fitness-app\"> Xem dữ liệu tập luyện trong ứng dụng thể dục </h2> <p> Sau khi bạn hoàn thành bài tập, tất cả dữ liệu chỉ còn vài thao tác trên iPhone của bạn. </p> <p> Để xem nó, hãy mở <strong> Sự khỏe khoắn </strong> ứng dụng. </p> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (2 Hình ảnh) </strong> <img alt=\"Apple Watch Fitness Rundown\" src=\"images/apple-watch-fitness-rundown-440.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"Apple Watch Workout info\" src=\"images/apple-watch-workout-info-739.jpg\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> Phía dưới cái <strong> Tóm lược </strong> tab, chọn <strong> Tập luyện </strong> . Bạn sẽ thấy thông tin về tất cả các bài tập của mình. Dữ liệu cũng có sẵn trong <strong> Sức khỏe </strong> ứng dụng. </p> <p> </p> <h2 id=\"break-a-sweat-with-the-apple-watch-workout-app\"> Đổ mồ hôi với ứng dụng Apple Watch Workout </h2> <p> Như bạn có thể thấy, ứng dụng Apple Watch Workout là một cách tuyệt vời để giúp theo dõi tất cả các chỉ số thể dục khác nhau của bạn trong khi thực hiện mọi thứ từ bơi lội đến khiêu vũ và hơn thế nữa. </p> <p> Và khi bạn đã sẵn sàng gọi nó là một đêm và đi ngủ, Apple Watch của bạn vẫn có thể là một trợ giúp lớn với tính năng theo dõi giấc ngủ được tích hợp sẵn. </p>"}