{"title":"Cách tạo trò chơi board của riêng bạn trong Tabletop Simulator","content":"<p> Bạn đã bao giờ nghĩ đến việc tạo một trò chơi để chơi với bạn bè của mình trên Tabletop Simulator (TTS) chưa? Hoặc có thể bạn là một nhà phát triển trò chơi trên bàn đang tìm kiếm các trò chơi nguyên mẫu và chơi thử chúng trực tuyến. </p> <p> Chưa bao giờ có thời điểm tốt hơn để tận dụng môi trường chơi game linh hoạt của TTS. Hôm nay, chúng tôi sẽ hướng dẫn bạn cách thực hiện điều đó. </p> <h2 id=\"what-is-tabletop-simulator\"> Tabletop Simulator là gì? </h2> <p> <img alt=\"Game of Chess in Tabletop Simulator\" src=\"images/tabletop-simulator-chess-game-531.png\" loading=\"lazy\"> </p> <p> Đối với những ai chưa biết, Tabletop Simulator (TTS) cung cấp môi trường 3D để chơi các trò chơi trên bàn, cục bộ hoặc trực tuyến. Nó trở thành một cách tuyệt vời để <a href=\"https://www.makeuseof.com/tag/play-board-games-online/\" target=\"_blank\" rel=\"nofollow noopener\"> chơi trò chơi board trực tuyến với bạn bè </a> . </p> <p> Các trò chơi có thể chơi trên TTS bao gồm mọi thứ từ poker, cờ caro, Dungeons &amp; Dragons, mini-gôn và thậm chí cả các trò chơi trên bàn mới nhất. Bất kỳ trò chơi nào bạn muốn chơi thường có sẵn dưới dạng DLC ​​hoặc trong hội thảo cộng đồng. </p> <p> </p> <h2 id=\"why-use-tabletop-simulator\"> Tại sao sử dụng Tabletop Simulator? </h2> <p> Nếu bạn đã từng cố gắng tạo một trò chơi trên bàn vật lý, bạn sẽ biết nó có thể tốn thời gian như thế nào, không chỉ để xây dựng các yếu tố trò chơi mà còn để sửa đổi hoặc thay thế chúng khi bạn quyết định điều chỉnh hoặc sửa đổi trò chơi. </p> <p> Trong TTS, mọi thứ từ màu sắc đến trọng lượng của một đối tượng đều có thể thay đổi chỉ bằng một cú nhấp chuột, giúp quá trình chỉnh sửa diễn ra suôn sẻ và không gây đau đớn. </p> <p> Ngoài ra, thật dễ dàng để phát trực tiếp trò chơi của bạn và thể hiện nó trên phương tiện truyền thông xã hội và các nền tảng phát trực tuyến. </p> <p> </p> <h2 id=\"what-you-ll-need-to-get-started\"> Những gì bạn cần để bắt đầu </h2> <p> Trước khi bắt đầu, bạn sẽ cần những thứ sau: </p> <ul> <li> Một tài khoản người dùng Steam </li> <li> Tabletop Simulator được cài đặt trên PC của bạn </li> <li> Hình ảnh JPG của thiết kế bảng và thẻ của bạn </li> </ul> <p> <strong> Tải xuống: </strong> Trình mô phỏng máy tính bảng đang bật <a href=\"https://store.steampowered.com/app/286160/Tabletop_Simulator/\" target=\"_blank\" rel=\"nofollow noopener\"> hơi nước </a> ($ 19,99) </p> <p> Việc thiết kế các yếu tố trò chơi được thực hiện tốt nhất trong phần mềm minh họa hoặc bằng cách quét hình ảnh của các thẻ vật lý mà bạn đã tạo. Chỉ cần đảm bảo rằng chúng có phần mở rộng JPG và được lưu riêng lẻ. </p> <p> </p> <h2 id=\"creating-boards-and-player-mats\"> Tạo bảng và thảm người chơi </h2> <p> Khi bạn thiết kế bảng và các đối tượng 2D khác, hãy đảm bảo độ phân giải đủ cao để bạn có thể đặt đúng kích thước mà không làm giảm chất lượng. TTS sẽ tự động định kích thước khi bạn nhập và bạn sẽ có thể thay đổi kích thước chính xác theo cách bạn muốn. </p> <p> </p> <p> </p> <h2 id=\"creating-cards\"> Tạo thẻ </h2> <p> Các lá bài trong TTS có ba khía cạnh: mặt lá bài, mặt lá bài trở lại và lá bài ẩn (lá bài sẽ trông như thế nào đối với những người khác trong tay người chơi). Bạn sẽ cần phải có thiết kế cho từng cái này, mặc dù bạn có tùy chọn chỉ đơn giản là làm cho thẻ ẩn ở mặt sau của thẻ. </p> <h3 id=\"create-and-arrange-card-faces\"> Tạo và sắp xếp các mặt thẻ </h3> <p> Thay vì nhập từng thẻ một, tốt nhất là nhập tất cả hoặc hầu hết các thẻ của bạn dưới dạng một bộ bài duy nhất. </p> <p> Để tạo một bộ bài, hãy sao chép và dán từng thiết kế lên một tờ thẻ 7x10. Sử dụng một mẫu như bên dưới sẽ giúp bạn bắt đầu. </p> <p> <img alt=\"Rectangular Card Sheet Template for Tabletop Simulator\" src=\"images/card-sheet-template-tabletop-simulator-509.jpg\" loading=\"lazy\"> </p> <p> Mẫu phân định các vị trí cho mỗi thẻ trong bộ bài của bạn, cho phép bạn nhập tối đa 69 thẻ cùng một lúc. Nếu bạn không cần nhiều như vậy, bạn có thể để lại các vị trí không sử dụng và nếu có nhiều hơn, bạn có thể kết hợp các bộ bài hoặc các thẻ nhân bản sau khi nhập. </p> <p> Tuy nhiên, bạn không cần phải sử dụng mẫu này. Trên thực tế, một tấm thẻ có thể có kích thước bất kỳ và TTS sẽ tự động cắt nó thành một lưới 7x10. </p> <p> Để thuận tiện cho bạn, mẫu trên và mẫu thẻ vuông có sẵn trong thư mục tệp cục bộ TTS của bạn. </p> <p> Nếu bạn không chắc các tệp cục bộ của mình ở đâu, bạn có thể tìm chúng thông qua thư viện Steam của mình bằng cách mở <strong> Tính chất </strong> menu cho TTS. Chọn <strong> Tập tin có sẵn </strong> tab và nhấp vào <strong> Duyệt qua </strong> . </p> <p> <img alt=\"Finding Tabletop Simulator Local Files in Steam\" src=\"images/steam-tabletop-sim-local-files-683.png\" loading=\"lazy\"> </p> <h3 id=\"card-backs\"> Mặt sau thẻ </h3> <p> Nếu bạn chỉ muốn một thiết kế cho toàn bộ mặt sau của bộ bài, thì tất cả những gì bạn cần là một hình ảnh JPG duy nhất của thiết kế; không cần tờ thẻ. </p> <p> Nếu bộ bài của bạn có nhiều mặt sau độc đáo, bạn sẽ cần tạo thêm một tờ thẻ với các thiết kế mặt sau tương ứng với các thiết kế mặt trong tờ thẻ đầu tiên của bạn. Đối với thiết kế mặt trong khe một, hãy đặt mặt sau được chỉ định của nó vào khe một trong tấm mặt sau của bạn. Đối với mặt hai, đặt mặt sau của nó vào khe hai, v.v. </p> <h3 id=\"hidden-cards\"> Thẻ ẩn </h3> <p> Trong khe 70 của tờ thẻ, có nhãn &quot;Thẻ ẩn cho người chơi khác&quot; trên mẫu, đặt bất kỳ thiết kế nào bạn muốn để đối thủ nhìn thấy khi thẻ trong bộ bài này nằm trong tay người chơi. Đây là màu đen hoặc trắng đồng nhất theo truyền thống, hoặc có thiết kế mặt sau của bộ bài. </p> <p> </p> <p> </p> <h2 id=\"importing-elements\"> Nhập các phần tử </h2> <p> Bây giờ bạn đã tạo bảng và bộ bài của mình, bạn đã sẵn sàng để bắt đầu nhập. </p> <p> Trước khi thực sự lưu trữ một máy chủ với trò chơi của bạn, sẽ hữu ích khi bắt đầu trò chơi một người chơi và nhập các phần tử trước. Sau đó, bạn có thể lưu thiết lập và sẵn sàng bắt đầu ngay lập tức khi người chơi đến. </p> <p> Khởi chạy TTS và nhấp vào <strong> Tạo nên </strong> , và sau đó chọn <strong> Người chơi đơn </strong> để tạo ra môi trường. Xóa bất kỳ phần tử nào được tạo bởi TTS và chọn bàn bạn muốn chơi trò chơi của mình. </p> <p> Với môi trường đã sẵn sàng, hãy nhấp vào <strong> Các đối tượng </strong> ở menu trên cùng, sau đó chọn <strong> Tập quán </strong> thể loại. </p> <h3 id=\"boards-and-player-mats\"> Bảng và Thảm cầu thủ </h3> <p> Lựa chọn <strong> Bảng </strong> từ <strong> Tập quán </strong> và nhấp vào bất kỳ vị trí nào trên bảng mà bạn muốn bảng xuất hiện. Nhấp chuột phải vào bất kỳ đâu để mở hộp thoại nhập bảng. </p> <p> <img alt=\"Importing a Custom Board in Tabletop Simulator\" src=\"images/tabletop-sim-board-import-441.png\" loading=\"lazy\"> </p> <p> Duyệt qua hình ảnh của bạn về bảng và TTS sẽ hỏi bạn có muốn tải nó lên tài khoản Steam Cloud của mình hay giữ một tệp cục bộ. Tải tệp lên đám mây nếu bạn định chơi trò chơi của mình trực tuyến hoặc trên một thiết bị khác. </p> <p> Bạn có thể tùy ý tải lên hình ảnh của mình trên một máy chủ khác, như Dropbox, Photobucket hoặc Imgur và dán URL vào đây. Tuy nhiên, các máy chủ bên ngoài kém tin cậy hơn và không được khuyến khích. </p> <p> Khi bạn tải tệp lên Steam Cloud của mình, TTS sẽ yêu cầu bạn đặt tên tệp cho tệp. Sau khi tải lên xong, hãy nhấp vào <strong> Nhập khẩu </strong> . </p> <p> Với bảng được nhập, bây giờ bạn có thể thu nhỏ hoặc phóng to nó với <strong> - </strong> và <strong> + </strong> các phím trên bàn phím của bạn. Để khóa nó tại vị trí để nó không vô tình bị di chuyển trong khi chơi trò chơi, hãy nhấp chuột phải vào bảng và bên dưới <strong> Chuyển đổi </strong> , nhấp chuột <strong> Khóa </strong> . </p> <h3 id=\"card-decks\"> Bộ bài </h3> <p> bên trong <strong> Đối tượng tùy chỉnh </strong> menu, bấm vào <strong> Boong </strong> . Bấm vào bất kỳ đâu trên bảng mà bạn muốn bộ bài xuất hiện, sau đó bấm chuột phải để bắt đầu nhập. </p> <p> <img alt=\"Importing a Custom Deck in Tabletop Simulator\" src=\"images/tabletop-sim-deck-import-310.png\" loading=\"lazy\"> </p> <p> Điều chỉnh cài đặt như sau: </p> <ul> <li> <strong> Kiểu: </strong> Thay đổi điều này nếu bạn có ý nghĩ về một hình dạng cụ thể khác với một thẻ hình chữ nhật góc tròn thông thường. </li> <li> <strong> Khuôn mặt: </strong> Nhấn vào <strong> Duyệt qua các tệp cục bộ </strong> và tìm trang thẻ khuôn mặt của bạn. Một lần nữa, chúng tôi đề xuất tùy chọn Steam Cloud trên các tệp cục bộ hoặc máy chủ bên ngoài. </li> <li> <strong> Mặt sau độc đáo: </strong> Kiểm tra tùy chọn này nếu bộ bài của bạn có nhiều thiết kế mặt sau, sau đó tải bảng mặt sau của bạn lên trong <strong> Trở lại </strong> cái hộp. Nếu bạn đang sử dụng một thiết kế duy nhất cho toàn bộ bộ bài, thay vào đó, chỉ cần tải lên thiết kế mặt sau của bạn. </li> <li> <strong> Chiều rộng và chiều cao: </strong> Điều chỉnh điều này nếu bạn sử dụng tỷ lệ khác với thẻ hình chữ nhật tiêu chuẩn, 10x7. </li> <li> <strong> Con số: </strong> Đảm bảo rằng số này khớp với số thẻ bạn đang nhập. </li> <li> <strong> Một bên: </strong> Điều này thay đổi hướng cho <strong> Thu phóng thay thế </strong> chức năng trong TTS. Bỏ chọn nó trừ khi bạn muốn thẻ xuất hiện sang một bên. </li> <li> <strong> Trở lại là ẩn: </strong> Kiểm tra điều này nếu bạn muốn chế độ xem ẩn của thẻ của mình chỉ đơn giản là mặt sau của thẻ. </li> </ul> <p> Khi cài đặt của bạn chính xác, hãy nhấp vào <strong> Nhập khẩu </strong> . Bộ bài của bạn sẽ xuất hiện trên bàn và bạn có thể bắt đầu xáo trộn và chia bài. </p> <p> Nếu bạn muốn các thẻ của mình có tên để giúp sắp xếp, hãy nhấp chuột phải vào một thẻ và nhấp vào <strong> Tên </strong> . </p> <p> </p> <h2 id=\"importing-other-game-elements\"> Nhập các phần tử trò chơi khác </h2> <p> Việc nhập các đối tượng 2D khác tương tự như quá trình nhập bảng. Đừng quên rằng TTS có nhiều yếu tố chơi game phổ biến, như xúc xắc và các bức tượng nhỏ, sẵn sàng sử dụng trong <strong> Các đối tượng </strong> thực đơn. </p> <p> Nếu bạn có các yếu tố 3D tùy chỉnh mà bạn muốn sử dụng, hãy làm theo <a href=\"https://kb.tabletopsimulator.com/custom-content/custom-model/\" target=\"_blank\" rel=\"nofollow noopener\"> Hướng dẫn nhập mô hình 3D của TTS </a> . </p> <p> </p> <h2 id=\"saving-a-complete-game\"> Lưu một trò chơi hoàn chỉnh </h2> <p> Sau khi sắp xếp các thành phần ở trạng thái thiết lập ban đầu, hãy nhấp vào <strong> Trò chơi </strong> trong menu trên cùng. </p> <p> <img alt=\"Saving a Custom Game Set Up in Tabletop Simulator \" src=\"images/tabletop-sim-save-game-630.png\" loading=\"lazy\"> </p> <p> Lựa chọn <strong> Lưu và tải </strong> và nhấp vào <strong> Lưu trò chơi </strong> cái nút. Đặt tên cho nó và nhấp vào <strong> Tiết kiệm </strong> . Bây giờ, bất cứ khi nào bạn lưu trữ trò chơi, bạn có thể tải lại nó ở thiết lập hoàn hảo bằng cách truy cập <strong> Lưu và tải </strong> thực đơn. </p> <p> </p> <h2 id=\"making-the-most-of-custom-tabletop-gaming\"> Khai thác tối đa trò chơi trên máy tính bảng tùy chỉnh </h2> <p> Việc thiết kế và chơi các trò chơi tùy chỉnh rất đơn giản trong Tabletop Simulator khi bạn biết cách thực hiện. Mời bạn bè của bạn hoặc tìm kiếm những người chơi đã sẵn sàng và sẵn sàng tham gia <a href=\"https://steamcommunity.com/app/286160\" target=\"_blank\" rel=\"nofollow noopener\"> cộng đồng TTS </a> . Bây giờ, bạn có thể giới thiệu trò chơi tùy chỉnh của mình với những người khác! </p>"}