{"title":"Cách tạo hoặc chỉnh sửa mẫu trong Adobe Illustrator","content":"<p> Tạo một mẫu trong Adobe Illustrator và bạn có thể nhanh chóng áp dụng nó cho các hình dạng, nét vẽ và thậm chí cả văn bản. Bạn có thể làm một cái gì đó đơn giản, chẳng hạn như một mẫu dấu chấm hoặc làm một cái gì đó phức tạp hơn. Bạn thậm chí có thể sử dụng một phần của đồ họa vector hiện có và biến nó thành một mẫu. </p> <p> Các mẫu rất phù hợp cho nền, họa tiết và hơn thế nữa. Đây là cách sử dụng các công cụ mẫu của Illustrator và cách tạo và chỉnh sửa các mẫu của riêng bạn. </p> <h2 id=\"using-the-default-patterns-in-adobe-illustrator\"> Sử dụng các mẫu mặc định trong Adobe Illustrator </h2> <p> Illustrator đi kèm với một số mẫu được tích hợp ngay trong đó. Ngoài việc hữu ích theo đúng nghĩa của chúng, chúng cũng là một cách tốt để xem các mẫu hoạt động như thế nào. Những mẫu này cũng sẽ cung cấp cho bạn ý tưởng về cách sử dụng các mẫu của riêng bạn sau khi bạn đã tạo chúng. </p> <p> </p> <p> Bạn có thể tìm thấy các mẫu trong cửa sổ Swatches của mình. Nếu nó chưa mở, hãy truy cập <strong> Window&gt; Swatches </strong> từ menu trên cùng. Ngoài các màu đồng nhất, có thể đã có một số mẫu trong cửa sổ Swatches của bạn — nhưng đây không phải là những mẫu duy nhất mà Illustrator có. </p> <p> Nhấn vào <strong> Thư viện Swatch </strong> ở dưới cùng bên trái của cửa sổ Swatch của bạn. Di chuột qua <strong> Mẫu </strong> , và sau đó chọn một trong các thư viện mẫu mẫu. </p> <p> <img alt=\"open pattern library in Illustrator\" src=\"images/open-pattern-library-425.png\" loading=\"lazy\"> </p> <p> Bây giờ bạn có thể áp dụng các mẫu này như bạn làm với các màu đồng nhất. Tại đây, bạn có thể thấy các mẫu từ <strong> Nature_Foliage </strong> thư viện được áp dụng dưới dạng điền và nét, cũng như cho văn bản. </p> <p> <img alt=\"Nature foliage patterns applied in illustrator\" src=\"images/nature-foliage-patterns-applied-in-illustrator-253.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-make-a-basic-repeating-pattern-in-illustrator\"> Cách tạo một mẫu lặp lại cơ bản trong Illustrator </h2> <p> Bạn có thể biến bất kỳ vectơ nào thành một mẫu, cho dù đó là thứ bạn đã thiết kế sẵn hay thứ bạn tạo ra với ý định cụ thể này. Bạn có thể làm điều đó với toàn bộ đồ họa vector, một lớp duy nhất hoặc bất kỳ thứ gì ở giữa. </p> <p> Tất cả những gì bạn phải làm là chọn những gì bạn muốn chuyển thành một mẫu, sau đó kéo nó vào cửa sổ Swatches. Ví dụ: bạn có thể kéo mắt mèo này vào Swatches của mình. Điều đó sẽ tạo ra một mẫu mẫu, sau đó bạn có thể sử dụng để tô một hình chữ nhật hoặc bất kỳ hình dạng nào khác. </p> <p> <img alt=\"cat eye used as swatch in illustrator\" src=\"images/cat-eye-used-as-swatch-in-illustrator-958.png\" loading=\"lazy\"> </p> <p> Ngoài ra, bạn có thể làm điều tương tự với toàn bộ vector. Trong cả hai trường hợp, Illustrator sẽ tạo một mẫu từ bất kỳ thứ gì bạn kéo vào cửa sổ Swatches. Bạn có thể chỉ cần áp dụng mẫu như bạn làm với bất kỳ mẫu màu thông thường nào. </p> <p> <img alt=\"cat vector used as swatch pattern in illustrator\" src=\"images/cat-vector-used-as-swatch-pattern-in-illustrator-997.png\" loading=\"lazy\"> </p> <p> Nếu bạn bấm đúp vào mẫu mẫu của mình trong cửa sổ Swatches, nó sẽ mở ra <strong> Tùy chọn mẫu </strong> cửa sổ. Bạn cũng có thể mở nó trực tiếp từ <strong> Windows&gt; Tùy chọn mẫu </strong> trong menu trên cùng. </p> <p> Tại đây, bạn có thể chỉnh sửa thêm mẫu của mình, bao gồm cách nó lặp lại và khoảng cách lớn như thế nào giữa mỗi lần lặp lại hình ảnh của bạn. Bạn cũng có thể chỉnh sửa thiết kế mẫu của mình trực tiếp tại đây. Phiên bản của hình ảnh không bị mờ có thể được chỉnh sửa như bình thường. Bạn có thể thay đổi màu sắc, di chuyển các lớp, v.v. </p> <p> <img alt=\"pattern options window in illustrator\" src=\"images/pattern-options-window-in-illustrator-183.png\" loading=\"lazy\"> </p> <p> Có nhiều thứ bạn có thể làm với cửa sổ Tùy chọn mẫu. Ví dụ: bạn có thể lặp lại hình ảnh của mình theo bố cục gạch so le và giảm khoảng cách giữa mỗi phần của mẫu. </p> <p> <img alt=\"cat pattern swatch in illustrator brick layout\" src=\"images/cat-pattern-swatch-in-illustator-brick-layout-496.png\" loading=\"lazy\"> </p> <p> Đặt các phần của mẫu của bạn đủ gần nhau và bạn có thể làm cho chúng chồng lên nhau. Làm như vậy, bạn có thể tạo ra một kiểu lát gạch như hình bên dưới. Hãy thử tất cả các cài đặt chồng chéo khác nhau trong Tùy chọn mẫu để tìm thứ gì đó phù hợp với bạn. </p> <p> <img alt=\"fish scale effect pattern in Illustrator\" src=\"images/fish-scale-effect-pattern-in-illustrator-453.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"how-to-create-a-seamless-pattern-in-adobe-illustrator\"> Cách tạo một mẫu liền mạch trong Adobe Illustrator </h2> <p> Nếu bạn muốn tạo một mô hình hình học liền mạch, bạn cần đảm bảo có sự đối xứng trong thiết kế của mình. Ví dụ: một đường bắt đầu lên 10px ở phía bên trái của mẫu của bạn phải kết thúc 10px ở phía bên phải. Khi nó lặp lại, những điểm đó sẽ cần phải cộng lại. </p> <p> Để làm điều này, hãy tạo một tài liệu mới với kích thước hình vuông. Bật lớp phủ lưới bằng cách nhấn <strong> Ctrl + &quot; </strong> ( <strong> Cmd + &quot; </strong> trên máy Mac). Hướng dẫn thông minh cũng hữu ích — hãy kích hoạt chúng với <strong> Ctrl + U </strong> ( <strong> Cmd + U </strong> trên máy Mac). Nếu thước của bạn không hiển thị, hãy nhấn <strong> Ctrl + R </strong> ( <strong> Cmd + R </strong> trên Mac) để kích hoạt chúng. </p> <p> Bạn cũng có thể tìm thấy các cài đặt này trong <strong> Lượt xem </strong> trong menu trên cùng, nhưng chúng tôi khuyên bạn nên sử dụng <a href=\"https://www.makeuseof.com/tag/adobe-illustrator-keyboard-shortcuts-cheat-sheet/\" target=\"_blank\" rel=\"nofollow noopener\"> Các phím tắt của Illustrator </a> nơi bạn có thể để tiết kiệm thời gian. </p> <p> <img alt=\"\" src=\"images/illustrator-pattern-making-square-with-grid-on-654.png\" loading=\"lazy\"> </p> <p> Bố trí thiết kế của bạn trong hình vuông. Bất kỳ bộ phận nào đi qua các cạnh sẽ cần phải xếp hàng ở phía bên kia. Các <strong> Căn chỉnh </strong> dụng cụ ( <strong> Cửa sổ&gt; Căn chỉnh </strong> ) có thể giúp bạn sắp xếp mọi thứ đúng cách. Nhấp và kéo vào từ các thước kẻ để tạo các hướng dẫn của riêng bạn ở những nơi bạn cần. </p> <p> <img alt=\"dragging rulers into illustrator\" src=\"images/dragging-rulers-into-illustrator-129.png\" loading=\"lazy\"> </p> <p> Điều quan trọng là phải có màu nền, ngay cả khi nó là màu trắng. Đảm bảo rằng nó hoàn toàn phù hợp với các cạnh artboard vì bạn cần nó để cắt bớt vật liệu thừa. </p> <p> Chọn mọi thứ với <strong> Ctrl + A </strong> ( <strong> Cmd + A </strong> trên máy Mac), rồi nhấn <strong> Shift + M </strong> để kích hoạt <strong> Trình tạo hình dạng </strong> dụng cụ. Điều này cũng có thể được tìm thấy trong hộp công cụ. Nhấn giữ <strong> Alt </strong> ( <strong> Lựa chọn </strong> trên máy Mac). Điều này đặt <strong> Trình tạo hình dạng </strong> công cụ vào chế độ trừ. </p> <p> Khi bạn di chuột qua các phần của thiết kế bằng công cụ này, bạn sẽ thấy chúng thay đổi màu một chút. Nhấp vào các khu vực bạn không muốn và Illustrator sẽ loại bỏ các phần đó, chỉ để lại các bit trùng với hình vuông nền. </p> <p> <img alt=\"using illustrator shape builder tool\" src=\"images/using-illustrator-shape-builder-tool-153.png\" loading=\"lazy\"> </p> <p> Sau khi hoàn tất, hãy chọn mọi thứ và kéo nó vào các mẫu của bạn để biến nó thành một mẫu. Để sử dụng mẫu của bạn trong một tài liệu mới, bạn có thể lưu nó vào thư viện mẫu hoặc sử dụng Thư viện đám mây của Adobe. </p> <p> Ngoài ra, bạn cũng có thể sao chép nó từ cửa sổ Swatch này và dán nó vào một cửa sổ Swatch khác trên một tài liệu khác. </p> <p> <img alt=\"seamless pattern dragged into illustrator swatches\" src=\"images/seamless-pattern-dragged-into-illustrator-swatches-806.png\" loading=\"lazy\"> </p> <p> Bây giờ bạn có thể áp dụng mẫu này như cách bạn làm với bất kỳ mẫu nào khác. Nếu bạn đã làm đúng, mọi thứ sẽ không có khoảng trống. Thực hiện các điều chỉnh trong tài liệu mẫu của bạn nếu bạn cần. </p> <p> <img alt=\"customer illustrator pattern applied to text\" src=\"images/customer-illustrator-pattern-applied-984.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"when-should-you-use-patterns-in-adobe-illustrator\"> Khi nào bạn nên sử dụng các mẫu trong Adobe Illustrator? </h2> <p> Cách sử dụng rõ ràng nhất cho các mẫu là tạo ra các ô có thể lặp lại cho nền, nhưng bạn có thể sử dụng chúng để điền vào các hình dạng để tạo cho chúng có kết cấu. Văn bản đầy hoa văn là một công dụng tốt khác và có thể làm cho kiểu chữ của bạn thực sự nổi bật. </p> <p> Nếu bạn muốn, bạn thậm chí có thể tạo các mẫu của riêng mình theo cách thủ công, sao chép và dán lại cùng một hình ảnh. Có thể có những lúc bạn muốn làm điều đó, nhưng hầu hết thời gian, khả năng tự động tạo mẫu của Illustrator sẽ là cách tốt nhất. </p> <p> Đó chỉ là một trong nhiều cách mà Illustrator có thể làm cho cuộc sống của bạn dễ dàng hơn, giúp bạn có nhiều thời gian hơn để làm việc trên các thiết kế của mình. </p>"}