{"title":"Làm thế nào để cải thiện kỹ năng chỉnh sửa Lightroom của bạn: 10 cách đơn giản","content":"<p> Adobe Lightroom là một trong những nền tảng chỉnh sửa ảnh nổi tiếng nhất trên thị trường. Giải pháp này được ưa chuộng không chỉ vì nó có rất nhiều tính năng hữu ích mà còn vì tính thân thiện với người dùng. </p> <p> Khi các nhiếp ảnh gia muốn xem xét kỹ năng của họ nghiêm túc hơn một chút, điều đầu tiên họ sẽ làm là mua phần mềm chỉnh sửa. Nhưng ngay cả khi bạn chỉ là một người xem ảnh thông thường, Lightroom cung cấp nhiều cách để khiến bạn bè của bạn phải trầm trồ. </p> <p> Trong hướng dẫn này, bạn sẽ khám phá một số cách dễ dàng để cải thiện ảnh của mình trong Lightroom. Những mẹo này hoạt động cho cả Lightroom Classic và Lightroom Creative Cloud. </p> <h2 id=\"use-masking\"> 1. Sử dụng Mặt nạ </h2> <p> Nếu bạn làm sắc nét ảnh của mình theo mặc định, bạn sẽ thêm chi tiết vào toàn bộ bức ảnh — ngay cả những vùng bạn không muốn. Điều này có thể để lại cho bạn rất nhiều hạt ở những nơi không mong muốn, như trên bầu trời và nước. </p> <p> Bạn cũng có nguy cơ làm cho ảnh của mình giống một bức vẽ hơn là một thứ bạn chụp bằng máy ảnh. May mắn thay, có một giải pháp dễ dàng. </p> <p> Trong ứng dụng Lightroom, cuộn xuống <strong> Chi tiết </strong> . Khi bạn ở đó, hãy truy cập <strong> Mài giũa </strong> &gt; <strong> Đắp mặt nạ </strong> . </p> <p> <img alt=\"Adobe Lightroom Sharpen Mask\" src=\"images/masking-lightroom-999.png\" loading=\"lazy\"> </p> <p> Cuộn thanh trượt cho đến khi các phần của hình ảnh bạn muốn làm sắc nét được chọn. Để xem những gì bạn đang đắp mặt nạ, hãy nhấn vào <strong> Alt </strong> trên bàn phím của bạn cùng một lúc. </p> <p> Khi bạn đã che khu vực mình muốn, hãy cuộn thanh trượt làm sắc nét nhiều hay ít tùy ý. </p> <p> </p> <h2 id=\"use-camera-profiles-instead-of-the-default-adobe-ones\"> 2. Sử dụng cấu hình máy ảnh thay vì cài đặt mặc định của Adobe </h2> <p> Nếu bạn tải lên một hình ảnh ở định dạng RAW, Adobe sẽ thêm một trong các cấu hình chương trình của nó theo mặc định. Và mặc dù những điều này có thể làm cho hình ảnh của bạn trông đẹp hơn trong một số trường hợp, nhưng bạn thường tốt hơn nên chọn một máy ảnh dành riêng cho máy ảnh. </p> <p> Khi bạn sử dụng cấu hình máy ảnh, hình ảnh sẽ trở nên dễ chỉnh sửa hơn dựa trên những gì bạn đã chụp bằng thiết bị của mình. </p> <p> Để thay đổi hồ sơ ảnh của bạn, hãy truy cập <strong> Hồ sơ </strong> &gt; <strong> Khớp máy ảnh </strong> . Sau đó, bạn có thể chọn từ <strong> Tiêu chuẩn </strong> , <strong> Trung tính </strong> , <strong> Phong cảnh </strong> , và các ngoại hình khác. </p> <p> <img alt=\"Adobe Lightroom Camera Profiles\" src=\"images/lightroom-camera-profiles-514.png\" loading=\"lazy\"> </p> <p> <strong> Nhớ lại: </strong> bạn không thể thay đổi độ sâu của cấu hình ảnh nếu bạn chỉ chụp ảnh JPEG. Vì vậy, trước khi ra ngoài chụp một số bức ảnh, hãy đặt máy ảnh của bạn thành <strong> RAW </strong> hoặc là <strong> JPEG + RAW </strong> . </p> <p> </p> <h2 id=\"brush-over-parts-of-your-picture\"> 3. Chải qua các phần của hình ảnh của bạn </h2> <p> Bạn đã bao giờ nâng cao độ rõ nét, độ bão hòa hoặc chi tiết của toàn bộ bức ảnh của mình, mong đợi một kiệt tác, nhưng thay vào đó lại nhận được một hình ảnh giống như được chụp trong lò vi sóng? Nếu vậy, thay vào đó, bạn có thể chỉ chỉnh sửa các phần của bức ảnh. </p> <p> Trong Lightroom, bạn có thể truy cập một tính năng được gọi là <strong> Chải </strong> . Bạn có thể sử dụng điều này để &quot;chải&quot; qua các phần của bức tranh trong khi để yên phần còn lại của nó. </p> <p> Để sử dụng công cụ này, hãy truy cập <strong> Chải </strong> biểu tượng ở bên phải màn hình của bạn. Bạn có thể làm cho bút vẽ của mình lớn hơn hoặc nhỏ hơn, tùy thuộc vào mức độ ảnh bạn muốn chỉnh sửa. </p> <p> <img alt=\"Adobe Lightroom Brushing\" src=\"images/lightroom-brush-639.png\" loading=\"lazy\"> </p> <p> Trước khi bạn bắt đầu chải, hãy thay đổi các đặc điểm hình ảnh mà bạn muốn chỉnh sửa. Ví dụ: bạn có thể tăng thanh trượt độ rõ nét lên nếu bạn đang muốn làm cho một phần của hình ảnh rõ ràng hơn. </p> <p> Sau khi thay đổi các tính năng này, hãy chải qua các khu vực bạn muốn chỉnh sửa. nhấn <strong> O </strong> trên bàn phím của bạn để xem nơi bạn đã lướt qua. </p> <p> Nếu bạn đã đi quá nhiều vào một khu vực cụ thể, hãy giữ <strong> Dấu trừ </strong> ( <strong> - </strong> ) Và chải qua các phần đó để xóa các chỉnh sửa của bạn. Biết <a href=\"https://www.makeuseof.com/adobe-lightroom-keyboard-shortcuts/\" target=\"_blank\" rel=\"nofollow noopener\"> phím tắt cho Adobe Lightroom </a> rất hữu ích cho những trường hợp này, vì vậy đừng quên chuẩn bị cho chúng! </p> <p> </p> <h2 id=\"defringe-your-photos\"> 4. Làm lệch hình ảnh của bạn </h2> <p> Đôi khi, máy ảnh của bạn sẽ chụp ảnh mà các cạnh có màu sắc không tự nhiên. Bạn sẽ đặc biệt nhận thấy những điều này khi chụp ảnh dưới ánh sáng mặt trời gay gắt. Chúng chủ yếu có màu xanh lá cây và tím. </p> <p> Để làm lệch ảnh của bạn, hãy cuộn xuống <strong> Làm lệch </strong> . Bạn có thể chọn loại bỏ viền màu tím hoặc xanh lá cây. </p> <p> <img alt=\"Adobe Lightroom defringing tool\" src=\"images/lightroom-defringe-351.png\" loading=\"lazy\"> </p> <p> Sử dụng <strong> Số tiền </strong> để quyết định bạn muốn thêm bao nhiêu đường viền. Trượt thanh màu cho đến khi bạn hài lòng với kết quả. </p> <p> </p> <h2 id=\"use-geometry-to-straighten-your-photos\"> 5. Sử dụng hình học để làm thẳng ảnh của bạn </h2> <p> Dù bạn có cố gắng thế nào đi chăng nữa thì việc cầm thẳng máy ảnh là rất khó trừ khi bạn có chân máy. Nhưng nhờ sự kỳ diệu của phần mềm chỉnh sửa, việc làm thẳng hình ảnh của bạn trở nên dễ dàng. </p> <p> Trong Lightroom, bạn có thể tự động làm thẳng ảnh của mình bằng cách đi tới <strong> Mùa vụ </strong> phần. Tuy nhiên, có một cách chính xác hơn để đạt được kết quả tương tự. </p> <p> Trên tab bên phải, chọn tùy chọn trên cùng. Sau đó, cuộn xuống <strong> Hình học </strong> . Khi bạn ở đây, hãy truy cập <strong> Thẳng đứng </strong> &gt; <strong> Cấp độ </strong> . </p> <p> <img alt=\"Geometry Adobe Lightroom\" src=\"images/lightroom-geometry-973.png\" loading=\"lazy\"> </p> <p> Bạn cũng có thể vẽ theo các đường thẳng để làm cho bức ảnh càng thẳng càng tốt. </p> <p> </p> <h2 id=\"6-adjust-the-size-of-your-sharpening-area\"> 6. Điều chỉnh kích thước vùng mài của bạn </h2> <p> Bây giờ bạn đã biết về tạo mặt nạ, nhưng bạn có biết bạn cũng có thể làm sắc nét các khu vực cụ thể của ảnh không? </p> <p> Để chọn khu vực trong ảnh có mặt nạ mà bạn muốn làm sắc nét, hãy chuyển đến <strong> Mài giũa </strong> , giữ <strong> Alt </strong> chìa khóa và đi đến <strong> Bán kính </strong> . Điều chỉnh thanh trượt này cho phép bạn làm cho vùng mài lớn hơn hoặc nhỏ hơn. </p> <p> <img alt=\"Lightroom Radius Slider\" src=\"images/lightroom_radius-115.png\" loading=\"lazy\"> </p> <p> Sau đó, đi đến <strong> Mài giũa </strong> quán ba. Tương tự, giữ <strong> Alt </strong> và di chuyển thanh trượt sang phải. Điều này sẽ giúp bạn dễ dàng làm sắc nét một vùng cụ thể của ảnh, thay vì toàn bộ ảnh. </p> <p> </p> <h2 id=\"use-the-color-point-curves\"> 7. Sử dụng các đường cong điểm màu </h2> <p> Nếu màu ảnh của bạn trông không ổn ngay cả sau khi điều chỉnh cân bằng trắng, bạn có thể muốn kiểm tra các đường cong điểm màu trong Lightroom. Bạn có thể sử dụng những thứ này để điều chỉnh một số màu nhất định trong hình ảnh của mình. </p> <p> Bạn sẽ tìm thấy ba bảng đường cong màu sắc khác nhau trong ứng dụng: đỏ, xanh dương và xanh lá cây. </p> <p> Để đến những đường cong màu này, hãy cuộn xuống <strong> Đường cong điểm </strong> . Sau đó, nhấp vào màu bạn muốn thay đổi. Sau đó, bạn có thể thử với các màu giống như cách bạn làm trên tiêu chuẩn <strong> Đường cong điểm </strong> chuyển hướng. </p> <p> <img alt=\"Adobe Lightroom Color Curve\" src=\"images/lightroom-color-curve-899.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"type-a-number-for-each-slider-and-tweak-accordingly\"> 8. Nhập một số cho mỗi thanh trượt và tinh chỉnh theo đó </h2> <p> Thông thường, các nhiếp ảnh gia mới sẽ bị kích thích bởi số lượng các tùy chọn chỉnh sửa có sẵn cho họ. Khi họ mở Lightroom, họ sẽ trượt từng thanh quá xa theo một trong hai hướng. Nhưng thay vì nâng cao hình ảnh của họ, họ lại kết thúc với một mớ hỗn độn quá mức. </p> <p> Khi chỉnh sửa ảnh của bạn, điều quan trọng là thực hiện những thay đổi nhỏ. Rất có thể, bạn đã là một nhiếp ảnh gia giỏi và bức ảnh bạn chụp chỉ cần chỉnh sửa một chút ở khâu hậu kỳ. </p> <p> </p> <p> Thay vì tự do di chuyển từng thanh trượt, hãy thử thay đổi số trên các khu vực bạn muốn thay đổi <strong> +10 </strong> hoặc là <strong> -10 </strong> . Nếu bạn nghĩ rằng cần phải làm thêm, hãy lặp lại quy trình. </p> <p> <img alt=\"Lightroom Slider Click\" src=\"images/lightroom_change-sliders-706.png\" loading=\"lazy\"> </p> <p> Khi bạn cảm thấy như bạn đang ở gần, hãy từ từ di chuyển từng thanh trượt sang trái hoặc phải cho đến khi bạn hài lòng. </p> <p> </p> <h2 id=\"crop-your-photos\"> 9. Cắt ảnh của bạn </h2> <p> Cắt xén có vẻ hiển nhiên, nhưng nhiều nhiếp ảnh gia vẫn chưa sử dụng tính năng này. Việc cắt hình ảnh của bạn tùy thuộc vào nơi bạn sẽ sử dụng chúng cũng rất quan trọng. Nếu không, chúng sẽ bị bóp méo. </p> <p> Để cắt ảnh của bạn, hãy chuyển đến <strong> Mùa vụ </strong> biểu tượng. Đây là mức cao thứ hai từ trên xuống. Đi đến <strong> Tỷ lệ khung hình </strong> để thay đổi kích thước và kéo các góc để loại bỏ mọi đối tượng không mong muốn. </p> <p> <img alt=\"Adobe Lightroom Crop\" src=\"images/lightroom_cropping-269.png\" loading=\"lazy\"> </p> <p> Sau khi bạn đã cắt xong, hãy nhấn vào <strong> Đi vào </strong> trên máy tính của bạn và các thay đổi sẽ có hiệu lực. </p> <p> </p> <h2 id=\"use-the-histogram\"> 10. Sử dụng Biểu đồ </h2> <p> Biểu đồ Lightroom rất dễ bỏ qua nhưng cần biết. Biểu đồ nhỏ này sẽ cho bạn thấy nơi màu sắc và ánh sáng không đồng đều trong hình ảnh của bạn, cho phép bạn tạo một bản chỉnh sửa rõ ràng hơn. </p> <p> Theo quy luật chung, một bức ảnh được chỉnh sửa tốt sẽ có ít điểm đột biến trên biểu đồ. Đôi khi, điều này là khó tránh khỏi. Nhưng nói chung, bạn nên xem xét để làm cho biểu đồ càng đồng đều càng tốt. </p> <p> Tùy thuộc vào phiên bản Lightroom bạn sử dụng, bạn có thể thao tác trực tiếp với biểu đồ nhiều hơn hoặc ít hơn. Trong Lightroom Classic, bạn có thể nhấp vào biểu đồ và thậm chí mọi thứ bằng cách trượt trên các phần nhất định. </p> <p> <img alt=\"Lightroom Classic Histogram\" src=\"images/lightroom-classic_histogram-582.png\" loading=\"lazy\"> </p> <p> Trong Creative Cloud, biểu đồ cũng hiển thị tương tự ở góc trên cùng bên phải — nhưng bạn phải tự thay đổi các thanh trượt để biểu đồ di chuyển. </p> <p> <img alt=\"Creative Cloud Histogram\" src=\"images/lightroom-cc_histogram-636.png\" loading=\"lazy\"> </p> <p> Trên cả hai phiên bản của nền tảng, biểu đồ có sẵn ở đầu màn hình của bạn phía trên các chức năng chỉnh sửa. </p> <p> </p> <h2 id=\"great-editing-isn-t-only-for-the-pros\"> Chỉnh sửa tuyệt vời không chỉ dành cho chuyên gia </h2> <p> Lightroom là một phần mềm chỉnh sửa tuyệt vời cho bất kỳ ai muốn nâng tầm nhiếp ảnh của mình lên một tầm cao mới. Và ngay cả khi bạn chưa từng sử dụng nền tảng này trước đây, bạn cũng không cần phải lo lắng vì nó rất dễ học. </p> <p> Khi chỉnh sửa ảnh của bạn trong Lightroom, hãy nhớ rằng ít thì nhiều. Cùng với việc xem xét các mẹo này, bạn nên lùi lại sau khi chỉnh sửa và quay lại sau để xem liệu chúng có được chỉnh sửa tốt như bạn nghĩ hay không. </p>"}