{"title":"Cách quản lý nhóm người dùng với Groupadd trên Linux","content":"<p> Quản lý người dùng khá đơn giản nếu bạn đang chạy Linux trên máy tính cá nhân của mình. Nhưng, đối với những người có một máy chủ với hàng nghìn người dùng, việc quản lý trở thành một vấn đề nghiêm trọng cần được quan tâm. </p> <p> May mắn thay, hệ điều hành dựa trên Linux cung cấp cho bạn một cách để kiểm soát và quản lý người dùng trên hệ thống của bạn. Bạn có thể tạo nhóm và thêm người dùng vào nhóm. Sau đó, thay vì chỉ định quyền cho mọi người dùng trên hệ thống, bạn có thể dễ dàng cấp quyền cho các nhóm người dùng bằng cách cung cấp cho họ các đặc quyền liên quan đến quy trình làm việc của hệ thống. </p> <h2 id=\"create-user-groups-on-linux\"> Tạo nhóm người dùng trên Linux </h2> <p> Linux đi kèm với một lệnh mặc định để tạo nhóm người dùng. Bạn có thể dùng <strong> groupadd </strong> lệnh để thêm nhóm mới vào hệ thống của bạn. Cú pháp cơ bản của lệnh là: </p> <pre><code class=\"hljs\">groupadd [options] groupname</code></pre> <p> Để tạo một nhóm người dùng mới &#39;người viết&#39;: </p> <pre><code class=\"hljs\">groupadd writers</code></pre> <p> Chạy lệnh được đề cập ở trên sẽ thêm một mục mới vào <strong> / etc / group </strong> và <strong> / etc / gshadow </strong> các tệp trên hệ thống của bạn. Bạn có thể kiểm tra mục nhập nhóm mới trong tệp bằng cách nhập <strong> mèo / etc / group </strong> và <strong> cat / etc / gshadow </strong> trong thiết bị đầu cuối của bạn. </p> <p> Lưu ý rằng chỉ những người dùng có quyền quản trị mới có thể tạo nhóm người dùng. Đừng quên chuyển sang superuser trước khi thực hiện lệnh groupadd. </p> <p> Nếu bạn cố gắng tạo một nhóm có tên đã tồn tại, bạn sẽ thấy một lỗi cho biết: </p> <pre><code class=\"hljs perl\">groupadd: group 'writers' already exists</code></pre> <p> Tuy nhiên, bạn có thể loại bỏ lỗi bằng cách sử dụng <strong> -f </strong> hoặc là <strong> --lực lượng </strong> cờ bằng lệnh. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <h3 id=\"create-user-groups-with-unique-gid\"> Tạo nhóm người dùng với GID duy nhất </h3> <p> Khi bạn tạo một nhóm người dùng mới, hệ thống sẽ tự động gán cho nhóm đó một ID nhóm hoặc GID. Nếu bạn muốn nhóm của mình có một ID nhóm cụ thể, bạn có thể làm điều đó bằng cách sử dụng <strong> -g </strong> hoặc là <strong> --gid </strong> cờ. </p> <pre><code class=\"hljs\">groupadd -g 600 writers<br>groupadd --gid 600 writers</code></pre> <p> Nếu bạn cố gắng chỉ định một ID nhóm đã được sử dụng, lỗi sau sẽ xảy ra. </p> <pre><code class=\"hljs perl\">groupadd: GID '600' already exists</code></pre> <p> Mặc dù nó không được khuyến khích nhưng bạn có thể thêm <strong> -o </strong> hoặc là <strong> - không phải là duy nhất </strong> cờ để buộc phải gán ID nhóm. </p> <pre><code class=\"hljs\">groupadd -o -g 600 writers</code></pre> <h3 id=\"create-user-groups-with-a-password\"> Tạo nhóm người dùng bằng mật khẩu </h3> <p> Mặc dù bạn có thể thêm mật khẩu vào các nhóm của mình, nhưng chúng không có ích cho người dùng. Các <strong> -p </strong> cờ cho phép bạn chỉ định mật khẩu cho nhóm người dùng của bạn. </p> <pre><code class=\"hljs\">groupadd --force writers<br>groupadd -f writers</code></pre> <p> </p> <h3 id=\"create-system-groups-in-linux\"> Tạo nhóm hệ thống trong Linux </h3> <p> Có một chút khác biệt giữa nhóm hệ thống và nhóm thông thường. Nhóm hệ thống là những nhóm đặc biệt bao gồm những người dùng chịu trách nhiệm thực hiện các hoạt động của hệ thống như sao lưu và bảo trì. </p> <p> Sử dụng <strong> -r </strong> hoặc là <strong> - hệ thống </strong> cờ để tạo một nhóm hệ thống trên Linux: </p> <pre><code class=\"hljs perl\">groupadd -r hardwareteam<br>groupadd --system hardwareteam</code></pre> <h3 id=\"get-list-of-members-in-a-user-group\"> Nhận danh sách thành viên trong nhóm người dùng </h3> <p> Để biết có bao nhiêu thành viên là một phần của một nhóm cụ thể, bạn có thể sử dụng <strong> getent </strong> lệnh từ thiết bị đầu cuối của bạn. Lệnh sau sẽ hiển thị danh sách tất cả các thành viên có mặt trong nhóm &#39;nhà văn&#39;: </p> <pre><code class=\"hljs\">getent group writers</code></pre> <p> </p> <h2 id=\"add-users-to-groups\"> Thêm người dùng vào nhóm </h2> <p> Bây giờ bạn đã tạo một nhóm người dùng trên hệ thống của mình, đã đến lúc thêm một số người dùng vào đó. Usermod là một tiện ích dòng lệnh mạnh mẽ vì nó chứa các tùy chọn khác nhau liên quan đến quản lý và kiểm duyệt người dùng. Nó cũng cho phép bạn thêm người dùng vào nhóm của mình một cách dễ dàng. Cú pháp cơ bản của lệnh là: </p> <pre><code class=\"hljs\">usermod [options] groupname username</code></pre> <h3 id=\"add-an-existing-user-to-groups\"> Thêm người dùng hiện tại vào nhóm </h3> <p> Nếu bạn muốn thêm người dùng hiện có vào nhóm của mình, <strong> -a </strong> và <strong> -G </strong> cờ là những gì bạn cần. Các <strong> -G </strong> cờ là viết tắt của nhóm, trong khi <strong> -a </strong> viết tắt của append, add, or add. </p> <pre><code class=\"hljs\">usermod -a -G writers randomuser</code></pre> <p> Bạn cũng có thể thêm một người dùng vào nhiều nhóm. Tất cả những gì bạn phải làm là nhập tên nhóm được phân tách bằng dấu phẩy. </p> <pre><code class=\"hljs\">usermod -a -G writers,admin,owner randomuser</code></pre> <h3 id=\"add-a-new-user-to-a-group\"> Thêm người dùng mới vào nhóm </h3> <p> Bạn có thể dùng <strong> useradd </strong> ra lệnh khi bạn muốn <a href=\"https://www.makeuseof.com/linux-add-user/\" target=\"_blank\" rel=\"nofollow noopener\"> thêm người dùng mới vào hệ thống Linux của bạn </a> . Useradd cung cấp cho bạn một cách để gán một nhóm cho người dùng tại thời điểm tạo nhóm. Các <strong> -G </strong> cờ cho phép bạn chỉ định một nhóm cho người dùng. </p> <pre><code class=\"hljs\">useradd -G writers randomuser</code></pre> <p> Thêm một người dùng vào nhiều nhóm cũng dễ dàng. Chỉ cần chuyển các tên nhóm được phân tách bằng ký tự dấu phẩy trong lệnh mặc định. </p> <pre><code class=\"hljs\">useradd -G writers,admin,owner randomuser</code></pre> <p> </p> <h2 id=\"remove-users-from-a-group\"> Xóa người dùng khỏi nhóm </h2> <p> Bạn cũng có thể xóa người dùng khỏi một nhóm bằng cách sử dụng <strong> usermod </strong> . Hãy nhớ rằng trong hệ thống Linux, nhiều nhóm có thể được chỉ định cho một người dùng. Một trong những nhóm đó được khai báo là nhóm Chính, trong khi những nhóm khác được gọi là nhóm phụ. </p> <p> Nếu bạn đang cố gắng xóa người dùng khỏi một nhóm, hãy đảm bảo rằng người dùng đó có ít nhất một nhóm chính sau khi xóa. Ví dụ: người dùng &#39;ngẫu nhiên&#39; là một phần của quản trị viên nhóm, người viết và người biên tập; trong đó quản trị viên là nhóm chính và phần còn lại là nhóm phụ. </p> <p> Bạn chỉ có thể xóa người dùng khỏi nhóm người viết và người chỉnh sửa. Và để làm như vậy, bạn phải chuyển tên nhóm mà bạn muốn người dùng tiếp tục là thành viên. Điều này có nghĩa là, để xóa người dùng &#39;ngẫu nhiên&#39; khỏi trình chỉnh sửa nhóm, lệnh sau được sử dụng: </p> <pre><code class=\"hljs\">usermod -G writers random</code></pre> <p> Lưu ý rằng tất cả những gì bạn phải làm là tước bỏ <strong> gắn cờ (-a) </strong> từ lệnh bạn sử dụng để thêm người dùng vào một nhóm. </p> <p> </p> <h2 id=\"delete-groups-on-linux\"> Xóa nhóm trên Linux </h2> <p> Khi bạn không muốn giữ một nhóm người dùng trên hệ thống của mình nữa, bạn có thể xóa nhóm bằng cách sử dụng <strong> groupdel </strong> chỉ huy. Cú pháp của lệnh là: </p> <pre><code class=\"hljs\">groupdel [options] groupname</code></pre> <p> Để xóa nhóm người dùng &#39;người viết&#39;: </p> <pre><code class=\"hljs\">groupdel writers</code></pre> <p> Nếu bạn cố gắng xóa một nhóm không tồn tại, bạn sẽ nhận được thông báo lỗi: </p> <pre><code class=\"hljs ruby\">groupdel: group 'writers' does not exist</code></pre> <p> </p> <h2 id=\"managing-user-groups-on-linux\"> Quản lý nhóm người dùng trên Linux </h2> <p> Quản lý người dùng có thể khó khăn nếu bạn không biết về các lệnh Linux mà bạn cần sử dụng. Nó trở nên thực sự dễ dàng khi bạn biết các lệnh vào và ra liên quan đến kiểm duyệt và quản lý. </p> <p> Quản trị viên máy chủ nên cố gắng sử dụng các bản phân phối Linux phù hợp với nhu cầu của họ. Bằng cách này, họ sẽ nhận được tất cả các công cụ và tiện ích cần thiết để quản lý máy chủ ngay lập tức. </p>"}