{"title":"Cách xem số liệu thống kê về thời gian chơi của bạn trên PS5","content":"<p> Nếu bạn thích xem mình đã dành bao nhiêu thời gian để chơi trò chơi, PS5 có một tính năng ẩn nhưng hữu ích dành cho bạn. Nó theo dõi lượng thời gian bạn đã chơi trò chơi trên hệ thống. </p> <p> Dưới đây là cách kiểm tra lượng thời gian bạn đã chơi trò chơi PlayStation 5. Điều này có thể khuyến khích bạn <a href=\"https://www.makeuseof.com/how-to-turn-off-ps5/\" target=\"_blank\" rel=\"nofollow noopener\"> tắt PS5 của bạn </a> thương xuyên hơn. </p> <h2 id=\"how-to-check-your-playtime-stats-on-playstation-5\"> Cách kiểm tra thống kê thời gian chơi của bạn trên PlayStation 5 </h2> <p> Trên màn hình chính của PS5, hãy chọn biểu tượng hồ sơ của bạn ở trên cùng bên phải. Bạn có thể nhấn <strong> Tam giác </strong> để di chuyển lựa chọn đến khu vực đó của màn hình một cách nhanh chóng. Sau khi bạn mở menu đó, hãy chọn <strong> Hồ sơ </strong> . </p> <p> <img alt=\"PS5 Profile Menu\" src=\"images/ps5-profile-menu-400.jpg\" loading=\"lazy\"> </p> <p> Bây giờ, hãy chuyển sang <strong> Trò chơi </strong> chuyển hướng. Tại đây, bạn sẽ thấy tất cả các trò chơi bạn đã chơi trên tài khoản PlayStation của mình. Mỗi một hiển thị lần cuối cùng bạn chơi trò chơi, cũng như tổng số giờ chơi của bạn. Tuy nhiên, nó không chính xác đến từng phút. Bạn sẽ thấy thời gian chơi được làm tròn thành giờ. </p> <p> Bạn cũng sẽ thấy thời gian chơi cho các tựa game PS4 của mình tại đây, ngay cả khi bạn chưa chơi chúng trên PS5. </p> <p> <img alt=\"PS5 Game Time Spent\" src=\"images/ps5-game-time-spent-152.jpg\" loading=\"lazy\"> </p> <p> Theo như chúng tôi biết, thời gian chơi này bao gồm toàn bộ thời gian trò chơi đang chạy — không chỉ khi bạn đang chơi tích cực. Điều này có nghĩa là nếu bạn rời trò chơi trên menu tạm dừng khi đang gọi điện thoại hoặc ăn gì đó, thời gian đó sẽ được tính vào tổng thời gian. Vì vậy, nó có thể không quá chính xác, nhưng ít nhất sẽ cung cấp cho bạn ý tưởng về thời gian bạn đã chơi mỗi tiêu đề. </p> <p> </p> <p> Nếu tò mò, bạn cũng có thể xem số liệu thống kê về thời gian chơi cho bạn bè của mình. Chọn <strong> Bạn bè </strong> từ cùng một màn hình và chọn người bạn mà bạn muốn tìm hiểu thêm. Điều này sẽ cho bạn biết họ đã dành bao lâu trong các trò chơi của họ trong một menu giống hệt nhau. </p> <p> Nếu bạn không muốn thông tin thời gian chơi của mình hiển thị với những người chơi khác, hãy cuộn sang bên phải và chọn <strong> Những thiết lập riêng tư </strong> . Trong menu đó, bên dưới <strong> Hoạt động của bạn </strong> , thay đổi tùy chọn cho <strong> Ai có thể xem lịch sử chơi trò chơi của bạn </strong> . </p> <p> <img alt=\"PS5 Gaming History Privacy\" src=\"images/ps5-gaming-history-privacy-872.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"some-games-track-their-own-play-time-too\"> Một số trò chơi cũng theo dõi thời gian chơi của riêng họ </h2> <p> Nếu bạn quan tâm đến dữ liệu như thế này, hãy nhớ mở các trò chơi yêu thích của bạn và xem chúng có theo dõi lượng thời gian bạn chơi hay không. Một số lượng lớn các tiêu đề bao gồm tổng thời gian phát trên tệp lưu của bạn, bên trong menu tạm dừng hoặc tương tự. </p> <p> Mặc dù điều này không nhất quán giữa các trò chơi và có thể bao gồm hoặc không bao gồm thời gian bị tạm dừng, nhưng nó có thể cung cấp cho bạn thông tin chi tiết hơn về trò chơi mà bạn muốn biết thêm. Một số trò chơi trực tuyến, như Overwatch, thậm chí còn theo dõi thời gian của bạn với từng anh hùng ở các chế độ. </p> <p> <img alt=\"Overwatch PS Play Stats\" src=\"images/overwatch-ps-play-stats-469.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"see-how-much-you-really-game\"> Xem bạn thực sự chơi bao nhiêu </h2> <p> PS5 giúp bạn dễ dàng xem bạn đã dành bao nhiêu thời gian để chơi trò chơi. Đó là một tính năng nhỏ nhưng được đánh giá cao, vì PS4 không làm cho dữ liệu này dễ dàng truy cập. </p> <p> Trong khi đó, có nhiều cách hơn để quản lý trò chơi của bạn đang chơi bên ngoài bảng điều khiển. </p> <p> <small> Tín dụng hình ảnh: LightField Studios / <a href=\"https://www.shutterstock.com/image-photo/kyiv-ukraine-june-9-2020-excited-1768723397\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}