{"title":"Cách các dịch vụ nhắn tin tức thì hàng đầu sử dụng mã hóa đầu cuối","content":"<p> Dữ liệu cá nhân quan trọng hơn bao giờ hết. Các chính phủ, công ty và tội phạm mạng khao khát dữ liệu cá nhân của mọi người để phục vụ lợi ích của họ. Các nền tảng trực tuyến khác nhau đã khiến dữ liệu cá nhân dễ dàng bị cho đi mà chúng ta không hề hay biết. </p> <p> Vì lý do này, điều quan trọng là phải hiểu rõ về cách các nền tảng bạn sử dụng trực tuyến bảo vệ quyền riêng tư của bạn. Một trong những yếu tố chính cần chú ý khi xem xét các biện pháp bảo vệ của các ứng dụng nhắn tin là mã hóa đầu cuối. </p> <p> Nhận thấy sự cần thiết phải ưu tiên bảo mật dữ liệu, nhiều ứng dụng nhắn tin đã thực hiện các bước quan trọng để thực hiện mã hóa đầu cuối. </p> <h2 id=\"what-is-end-to-end-encryption\"> Mã hóa End-to-End là gì? </h2> <p> </p> <p> Mã hóa end-to-end là <a href=\"https://www.makeuseof.com/eu-legislative-e2e-encryption-privacy-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> một phương pháp mã hóa thông tin liên lạc </a> để các bên thứ ba không thể truy cập thông tin được chia sẻ giữa những người nhắn tin cho nhau. </p> <p> Với mã hóa end-to-end, một mã bí mật, thay vì văn bản thuần, được sử dụng để che giấu nội dung của các tin nhắn. Điều này có nghĩa là chỉ những người giao tiếp trên nền tảng được mã hóa end-to-end mới có thể đọc các tin nhắn được gửi giữa họ. </p> <p> Hãy xem ba dịch vụ nhắn tin an toàn phổ biến, Signal, WhatsApp và Telegram, sử dụng mã hóa end-to-end như thế nào. </p> <p> </p> <h2 id=\"signal\"> Tín hiệu </h2> <p> <img alt=\"Signal messenger\" src=\"images/signal-messaging-app-on-phone-354.jpg\" loading=\"lazy\"> </p> <p> Signal được coi là một trong những ứng dụng nhắn tin an toàn nhất. Tất cả thông tin liên lạc trên nền tảng được mã hóa end-to-end theo mặc định. </p> <p> Signal không sao lưu tin nhắn trên đám mây, điều này giúp giảm rủi ro bị những kẻ xấu sử dụng các phương pháp thay thế để thu thập thông tin. Nó cũng mã hóa siêu dữ liệu của tin nhắn để vị trí và thời gian của các hoạt động nhắn tin không bị theo dõi. </p> <p> Với công cụ mã hóa nguồn mở, công chúng được hưởng lợi từ mức độ minh bạch cao hơn về công nghệ đằng sau các hoạt động nhắn tin của họ. Người dùng có thể xem xét kỹ hơn các chi tiết kỹ thuật để hiểu rõ hơn về các phương pháp được sử dụng để bảo vệ quyền riêng tư của họ. </p> <p> Nền tảng mã nguồn mở có thể làm cho phần mềm dễ sử dụng hơn nhiều và an toàn về lâu dài. Mọi người không chỉ có thể hiểu rõ hơn về cách hoạt động của phần mềm mà còn có thể cố gắng thiết lập phiên bản ứng dụng của riêng họ, có thể phù hợp hơn với nhu cầu bảo mật riêng của họ. </p> <p> Signal sử dụng kết hợp OTR, được gọi là Nhắn tin không ghi âm cho nhiều bên giúp có thể mã hóa đầu cuối tin nhắn trong các cuộc trò chuyện nhóm. Rủi ro về vi phạm dữ liệu có thể tăng lên khi số lượng người tham gia vào mạng tăng lên. Với trò chuyện nhóm được mã hóa end-to-end, những rủi ro như vậy được giảm thiểu đáng kể. </p> <p> </p> <h2 id=\"whatsapp\"> WhatsApp </h2> <p> <img alt=\"WhatsApp on IPhone\" src=\"images/whatsapp-on-iphone-452.jpg\" loading=\"lazy\"> </p> <p> WhatsApp là một trong những ứng dụng nhắn tin phổ biến đầu tiên cho phép mã hóa đầu cuối. Nó sử dụng mã hóa đầu cuối cho các tin nhắn và cuộc gọi. </p> <p> WhatsApp sử dụng giao thức mã hóa end-to-end được phát triển bởi Open Whisper Systems, nhóm đứng sau Signal messenger. Đây là một điểm cộng lớn cho ứng dụng, xét đến mức độ an toàn của giao thức mã hóa của Signal. </p> <p> </p> <p> Việc sử dụng triển khai độc quyền của WhatsApp có nghĩa là nó có thể không được nhiều nhà nghiên cứu bảo mật kiểm tra thường xuyên như phần mềm nguồn mở hoàn toàn của Signal. </p> <p> Mặc dù có mã hóa tin nhắn, nhưng các cách khác có thể được sử dụng để tìm hiểu thêm về tin nhắn được gửi trên WhatsApp vì tin nhắn có thể được sao lưu trên đám mây và siêu dữ liệu trên ứng dụng không được mã hóa. Điều này giúp bạn dễ dàng biết thời gian và vị trí của tin nhắn. Ngoài ra, các báo cáo xuất hiện về các cuộc trò chuyện nhóm WhatsApp được lập chỉ mục trên Google tìm kiếm đặt ra câu hỏi về tính bảo mật của các cuộc trò chuyện nhóm của nó. </p> <p> </p> <h2 id=\"telegram\"> Telegram </h2> <p> <img alt=\"Telegram Application\" src=\"images/telegram-application-392.jpg\" loading=\"lazy\"> </p> <p> Telegram được yêu thích vì sử dụng mã hóa và các thông điệp tự hủy của nó. Đáng buồn thay, có một số mối quan tâm về mã hóa end-to-end với Telegram có vẻ không quá rõ ràng đối với nhiều người dùng. </p> <p> Trên Telegram, mã hóa đầu cuối không được bật theo mặc định. Nó chỉ được cung cấp khi người dùng chuyển sang trò chuyện bí mật. Đối với những người dùng không am hiểu về kỹ thuật, điều này mang đến những rủi ro bảo mật mà họ thậm chí có thể không nhận thức được. </p> <p> Telegram có thể truy cập các tin nhắn được lưu trữ trên các máy chủ được sao lưu trên đám mây của nó. Một số người tin rằng điều này đưa ra các vectơ tấn công bổ sung có thể dẫn đến vi phạm dữ liệu cá nhân trong trường hợp tội phạm mạng cố gắng đánh cắp dữ liệu nhắn tin từ ứng dụng. </p> <p> Điều đó đang được nói, tất cả các cuộc trò chuyện bí mật trong Telegram là dành riêng cho thiết bị, có nghĩa là các tin nhắn bạn gửi qua các cuộc trò chuyện bí mật chỉ có thể được truy cập từ thiết bị mà nó được gửi từ đó. </p> <p> Mặc dù các cuộc trò chuyện bí mật của Telegram được mã hóa đầu cuối, nhưng các cuộc trò chuyện nhóm thì không. Điều này có nghĩa là người dùng có thể sử dụng nhiều thiết bị cho cùng một cuộc trò chuyện nhóm. Người dùng có thể tải nhật ký trò chuyện trên nhiều thiết bị. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Trò chuyện bí mật trên <a href=\"https://twitter.com/hashtag/Telegram?src=hash&ref_src=twsrc%5Etfw\"> #Telegram </a> có nghĩa là tin nhắn của bạn được bảo vệ bằng mã hóa đầu cuối và sẽ bị xóa sau một khoảng thời gian nhất định. <br><br> Đây là cách bạn có thể kích hoạt tính năng này. <a href=\"https://t.co/xxvomChIIQ\"> https://t.co/xxvomChIIQ </a> <a href=\"https://t.co/QdzG01YnUP\"> pic.twitter.com/QdzG01YnUP </a></p> - Kaspersky (@kaspersky) <a href=\"https://twitter.com/kaspersky/status/1355923874098065422?ref_src=twsrc%5Etfw\"> Ngày 31 tháng 1 năm 2021 </a></blockquote>  <p> Telegram tạo bản xem trước liên kết trên các máy chủ từ xa của nó từ cả cuộc trò chuyện bình thường và bí mật. Khi người dùng nhập một liên kết lần đầu tiên trong một cuộc trò chuyện bí mật, ứng dụng sẽ cảnh báo họ rằng các liên kết sẽ được gửi đến các máy chủ từ xa. Đây được coi là một điểm yếu về bảo mật vì việc gửi các liên kết được chia sẻ trong một cuộc trò chuyện riêng tư đến một máy chủ từ xa đi ngược lại mục đích của mã hóa đầu cuối. </p> <p> Giao thức mã hóa của Telegram, MTProto được thiết kế để truy cập vào API máy chủ từ các ứng dụng trên thiết bị di động. Nó là độc quyền và chỉ một phần mã nguồn mở. Điều này đặt ra câu hỏi về mức độ kiểm soát và hiểu biết của công chúng đối với các phương pháp mã hóa đang được sử dụng để bảo vệ tin nhắn của họ. </p> <p> Rất may, ứng dụng nhắn tin đã không phải đối mặt với các khiếu nại nghiêm trọng về vi phạm dữ liệu nhưng cần biết rằng các nhà khai thác của nó có thể truy cập tin nhắn của bạn. </p> <p> Bất chấp những lo ngại, nhiều người có thể yên tâm bởi các vòng pháp lý khác nhau cần phải được thông qua để truy cập tin nhắn. Trước đây, Telegram đã nói rõ rằng mọi người gặp khó khăn như thế nào khi truy cập tin nhắn trên nền tảng của nó. Các khóa sẽ cần được truy cập từ các khu vực pháp lý khác nhau, điều này có thể khiến nhiều người thất vọng. </p> <p> </p> <h2 id=\"choosing-the-most-secure-messaging-application\"> Chọn ứng dụng nhắn tin an toàn nhất </h2> <p> Mặc dù Signal có thể không phổ biến như WhatsApp, nhưng giao thức của nó đã đóng vai trò là một yếu tố đóng góp đáng kể vào thành công của WhatsApp với mã hóa đầu cuối. Mặc dù các phương pháp mã hóa end-to-end của nó tương tự như WhatsApp, nhưng nó được coi là tốt hơn WhatsApp về mã hóa end-to-end. Nó tự phân biệt bằng cách thực hiện các bước bổ sung để bảo vệ người dùng. </p> <p> Quyết định không ưu tiên mã hóa đầu cuối của Telegram được cho là do ưu tiên của nó cho sự tiện lợi. Khi thiếu mã hóa, nó bù đắp bằng các phương pháp gián tiếp bảo vệ người dùng bằng mã hóa đám mây và lưu trữ khóa ở các khu vực pháp lý khác nhau. </p>"}