{"title":"Cách thực hiện khởi động sạch trong Windows 10","content":"<p> Có thể bạn đã cài đặt vô số ứng dụng của bên thứ ba trên máy tính Windows của mình. Đừng lo lắng, hầu hết mọi người đều vậy. </p> <p> Từ việc thực hiện các tác vụ cơ bản như duyệt web đến giải ra các dòng mã phức tạp, mọi người thích sử dụng các ứng dụng thay thế từ các ứng dụng được tích hợp sẵn trong Windows. Trong khi các ứng dụng này giúp cuộc sống của chúng ta dễ dàng hơn, chúng đôi khi can thiệp vào các chức năng của hệ thống. Chúng có thể bao gồm từ rủi ro nhỏ đến lỗi nghiêm trọng và BSOD. </p> <p> Đây là nơi khởi động sạch sẽ vào hình ảnh. </p> <h2 id=\"what-is-a-windows-clean-boot-anyway\"> Dù sao thì Windows Clean Boot là gì? </h2> <p> Khởi động sạch Windows 10 cho phép người dùng loại trừ các ứng dụng của bên thứ ba là nguyên nhân gây ra lỗi. Nó được thực hiện đơn giản bằng cách khởi động thiết bị với tất cả các ứng dụng của bên thứ ba bị vô hiệu hóa. Và mặc dù cái tên nghe có vẻ như đây là một tính năng tích hợp sẵn của Windows, nhưng không phải vậy. Bạn phải tự dọn dẹp khởi động máy tính của mình. </p> <p> Lợi ích của khởi động sạch không chỉ giới hạn ở việc chẩn đoán lỗi. Nó được biết là có ích khi <a href=\"https://www.makeuseof.com/tag/fix-windows-update-error-0x80070057/\" target=\"_blank\" rel=\"nofollow noopener\"> Các bản cập nhật Windows không cài đặt đúng cách </a> . Nó cũng đặc biệt hữu ích khi hệ điều hành của bạn hoạt động chậm chạp và bạn muốn kiểm tra xem điều gì có thể gây ra sự cố. </p> <p> </p> <p> </p> <h2 id=\"how-to-clean-boot-and-fix-errors\"> Cách làm sạch khởi động và sửa lỗi </h2> <p> Khởi động sạch là một quá trình tương đối đơn giản khi người dùng đã thử một vài lần. </p> <p> Trước khi liệt kê các bước, người dùng nên biết rằng một số hành động yêu cầu đặc quyền của quản trị viên. Máy tính của bạn cũng có thể không hoạt động theo cách bạn đã quen, nhưng bạn không cần phải đổ mồ hôi. Điều này xảy ra bởi vì đôi khi người dùng thậm chí không biết rằng một số tác vụ nhỏ đang được xử lý bởi phần mềm của bên thứ ba. </p> <p> <img alt=\"windows system config tool\" src=\"images/windows-system-config-tool-128.png\" loading=\"lazy\"> </p> <p> Dưới đây là các bước về cách xóa khởi động Windows 10: </p> <ol> <li> Trong thanh tìm kiếm của menu Bắt đầu, hãy nhập <strong> sysconfig </strong> và nhấp vào <strong> Cấu hình hệ thông </strong> . </li> <li> bên trong <strong> Cấu hình hệ thông </strong> cửa sổ, đi tới <strong> Dịch vụ </strong> chuyển hướng. </li> <li> Kiểm tra <strong> Ẩn tất cả các dịch vụ của Microsoft </strong> cái hộp. </li> <li> Kiểm tra tất cả các dịch vụ trong danh sách và nhấp vào <strong> Vô hiệu hóa tất cả </strong> nằm về phía dưới bên phải, sau đó lưu và thoát. </li> <li> Bây giờ, hãy mở <strong> Quản lý công việc </strong> . Bạn có thể thực hiện việc này bằng cách nhấp chuột phải vào Thanh tác vụ và chọn <strong> Quản lý công việc </strong> hoặc sử dụng <strong> Ctrl + Alt + Delete </strong> . </li> <li> bên trong <strong> Quản lý công việc </strong> cửa sổ, điều hướng đến <strong> Khởi động </strong> chuyển hướng. </li> <li> Chọn tất cả các dịch vụ một và nhấp vào <strong> Vô hiệu hóa </strong> . </li> <li> Lối ra <strong> Quản lý công việc </strong> và <strong> Khởi động lại </strong> máy tính của bạn. </li> </ol> <p> <img alt=\"Startup tab in the task manager\" src=\"images/startup-tab-task-manager-383.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"fixing-errors-with-clean-boot\"> Sửa lỗi bằng Clean Boot </h2> <p> Sau khi làm theo các bước được liệt kê ở trên, <a href=\"https://www.makeuseof.com/tag/clean-computer-original-state-reinstalling-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> PC sẽ khởi động vào trạng thái sạch. </a> Điều đầu tiên người dùng nên làm là đợi và kiểm tra xem lỗi tương tự có xuất hiện trở lại hay không. Đôi khi, nguồn của lỗi có thể là các tệp hệ thống Windows, trong trường hợp này, lỗi sẽ xuất hiện, nhưng có thể mất nhiều thời gian hơn so với khi khởi động bình thường. </p> <p> Nếu lỗi không xuất hiện, thì đã đến lúc thu hẹp các nghi phạm. Đây là một nhiệm vụ hơi tẻ nhạt nhưng, thật không may, cũng là cách tốt nhất để thực hiện nó. Để thu hẹp danh sách, hãy làm như sau: </p> <ol> <li> Trong khi ở trạng thái khởi động sạch, hãy mở <strong> Cấu hình hệ thông </strong> . </li> <li> Phía dưới cái <strong> Dịch vụ </strong> , chọn nửa trên của danh sách và nhấp vào <strong> Kích hoạt </strong> . Đảm bảo rằng <strong> Ẩn tất cả các dịch vụ của Microsoft </strong> hộp được chọn. </li> <li> Bây giờ mở <strong> Quản lý công việc </strong> và đi đến <strong> Khởi động </strong> chuyển hướng. </li> <li> Tương tự, kích hoạt nửa trên của các dịch vụ và khởi động lại máy tính của bạn. </li> </ol> <p> Sau khi khởi động lại, nếu lỗi không xuất hiện, bạn có thể loại trừ phần mềm và dịch vụ đã chọn khỏi danh sách thủ phạm. Bạn sẽ phải lặp lại các bước này cho đến khi bạn thấy chương trình hoặc dịch vụ có trách nhiệm và gỡ cài đặt nó. </p> <p> </p> <h2 id=\"clean-boot-windows-10-to-isolate-errors\"> Khởi động sạch Windows 10 để cô lập lỗi </h2> <p> Bây giờ đã đến lúc khởi động lại Windows 10 theo tiêu chuẩn. Chỉ cần mở <strong> Cấu hình hệ thông </strong> và <strong> Quản lý công việc </strong> và kích hoạt tất cả các dịch vụ và chương trình. Người dùng nên thực hiện khởi động sạch trước khi sử dụng các bản sửa lỗi nâng cao hơn khi Windows gặp sự cố hoặc hiển thị BSOD. </p>"}