{"title":"Cách lắp đặt bộ điều khiển cửa nhà để xe thông minh","content":"<p> Bạn có muốn kiểm soát cửa nhà để xe của bạn bằng điện thoại thông minh hoặc máy tính bảng của bạn? Bộ điều khiển thông minh là một lựa chọn tuyệt vời nếu bạn đã lắp đặt thiết bị mở cửa nhà để xe trong nhà. </p> <p> Chúng tôi sẽ hướng dẫn bạn cách cài đặt bộ điều khiển cửa nhà để xe thông minh. </p> <h2 id=\"differences-between-an-opener-and-a-controller\"> Sự khác biệt giữa bộ mở và bộ điều khiển </h2> <p> Có hai điểm khác biệt chính giữa bộ mở cửa nhà để xe thông minh và bộ điều khiển. Đầu tiên là kích thước. </p> <p> Hầu hết các thiết bị mở đều lớn và gắn trên trần nhà để xe của bạn. Họ sử dụng một rãnh cơ học để mở và đóng cửa. Mặt khác, bộ điều khiển cửa nhà để xe là một thiết bị điện tử nhỏ cho phép bạn điều khiển thiết bị đóng mở bằng ứng dụng trên thiết bị thông minh. </p> <p> Điểm phân biệt thứ hai giữa hai sản phẩm này là giá cả. Dụng cụ mở cửa nhà để xe có thể có giá khoảng 300 đô la. Việc lắp đặt các thiết bị mở này thường yêu cầu sự trợ giúp của một trình cài đặt chuyên nghiệp. </p> <p> Tuy nhiên, một bộ điều khiển thường không cần cài đặt chuyên nghiệp. Thay vào đó, bộ điều khiển hoạt động như một phần bổ sung cho bộ mở hiện có của bạn. </p> <p> Điều này có nghĩa là với một phần nhỏ giá của một dụng cụ mở mới, bạn có thể đạt được chức năng tương tự chỉ bằng cách sử dụng một bộ điều khiển. </p> <p> </p> <h2 id=\"what-are-the-benefits-of-a-smart-garage-door\"> Lợi ích của Cửa nhà để xe Thông minh là gì? </h2> <p> Có ba lợi ích chính của việc có một cửa nhà để xe thông minh. </p> <ul> <li> <strong> Sự an toàn </strong> —Một cửa gara thông minh cho phép bạn mở và đóng cửa từ hầu hết mọi nơi. </li> <li> <strong> Bảo vệ </strong> —Hầu hết các bộ điều khiển và mở cửa nhà để xe thông minh thông báo cho bạn biết khi nhà để xe của bạn đã được mở trong một khoảng thời gian cụ thể. </li> <li> <strong> Tiện </strong> —Nếu bạn đã từng phải trở về nhà để đóng cửa nhà để xe, thì việc có một ứng dụng cửa nhà để xe thông minh sẽ tiết kiệm thời gian. Thay vì lái xe về nhà, bạn chỉ cần rút điện thoại ra. </li> </ul> <p> </p> <h2 id=\"how-to-install-a-smart-garage-door-controller\"> Cách lắp đặt bộ điều khiển cửa nhà để xe thông minh </h2> <p> <img alt=\"Meross Controller Instal Complete\" src=\"images/controller-installed-ready-to-test-921.jpg\" loading=\"lazy\"> </p> <p> Nếu bạn đã quyết định rằng một bộ điều khiển cửa nhà để xe thông minh phù hợp với mình, thì hướng dẫn này sẽ chỉ cho bạn cách cài đặt một bộ điều khiển. Trong cuộc biểu tình này, một <a href=\"https://www.amazon.com/dp/B07QCTN71J?&linkCode=ll1&tag=makeusw-20&linkId=d0c4cd29646b044b387114a0bdca5ccf&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Meross MSG100 </a> được sử dụng, nhưng quá trình này cũng tương tự nếu sử dụng nhãn hiệu khác. Tham khảo tài liệu của bộ điều khiển của bạn để biết chi tiết. </p> <h3 id=\"what-you-ll-need\"> Những gì bạn cần </h3> <ul> <li> Bộ điều khiển nhà để xe thông minh </li> <li> Súng ghim hoặc giá treo dây </li> <li> Cửa nhà để xe có lắp đặt thiết bị mở tự động </li> <li> Philips và tua vít có rãnh </li> <li> Thang </li> </ul> <h3 id=\"plan-the-installation\"> 1. Lập kế hoạch cài đặt </h3> <p> <img alt=\"Wires Secured Across Ceiling Connected To Opener\" src=\"images/controller-wire-routing-across-ceiling-926.jpg\" loading=\"lazy\"> </p> <p> Trước khi cài đặt bộ điều khiển, bạn sẽ cần tìm kiếm một vài điểm trong ga ra của mình. Đầu tiên là nguồn cấp cho bộ điều khiển. Thứ hai là đường dẫn dây từ bộ điều khiển đến cảm biến gắn trên cửa có trong bộ của bạn. Và thứ ba là vị trí của cảm biến từ trường. </p> <p> Cảm biến từ tính này giúp bộ điều khiển biết khi nào cửa được mở hoặc đóng. </p> <p> Hầu hết các bộ điều khiển sử dụng một đoạn dây dài để kết nối với cảm biến cửa. Bạn sẽ cần phải đi dây này qua trần nhà hoặc xuống tường để giữ cho dây không bị cản trở. </p> <p> Khi bạn đã lên kế hoạch lắp đặt, hãy kiểm tra xem có lắp dây cảm biến từ bộ điều khiển đến vị trí cảm biến hay không. Sự phù hợp thử nghiệm này đảm bảo dây cảm biến của bạn tiếp cận bộ điều khiển của bạn. </p> <h3 id=\"shut-off-power-to-your-garage-door-opener\"> 2. Tắt nguồn cho thiết bị mở cửa nhà để xe của bạn </h3> <p> Hầu hết các cửa ga ra đều được cắm điện ở đâu đó trên trần nhà. Đối với những thiết bị mở đó, bạn sẽ muốn đảm bảo rằng chúng đã được rút phích cắm trước khi tiếp tục. </p> <p> Nếu thiết bị mở của bạn không có phích cắm và thay vào đó được gắn vào hệ thống dây điện từ trần nhà, thì bạn sẽ cần tìm hộp cầu dao và ngắt nguồn điện cho thiết bị mở ở đó. </p> <p> <strong> Ghi chú: </strong> Dòng điện trong nhà 120 vôn có thể gây ra thương tích nghiêm trọng. Nếu bạn không cảm thấy thoải mái khi làm việc với điện, hãy dừng lại ngay bây giờ và tham khảo ý kiến ​​của thợ lắp đặt cửa gara chuyên nghiệp và / hoặc thợ điện. </p> <p> </p> <h3 id=\"connect-the-included-wires-to-the-controller\"> 3. Kết nối các dây đi kèm với Bộ điều khiển </h3> <p> <img alt=\"Screw Terminals for Meross Garage Door Controller\" src=\"images/meross-msg100-open-screw-terminals-visable-517.jpg\" loading=\"lazy\"> </p> <p> Trên thiết bị Meross, có một bộ dây màu xanh và nâu phải được lắp vào bộ điều khiển để kết nối với bộ mở cửa nhà để xe. Mở nắp nhựa trên bộ điều khiển và bạn sẽ thấy hai đầu nối vít. </p> <p> Sử dụng tuốc nơ vít có rãnh nhỏ, nới lỏng các vít trên mỗi đầu nối. Chèn dây của bạn và siết chặt các vít. Không quan trọng dây nào đi đâu. </p> <p> Kéo nhẹ các dây để đảm bảo chúng được chắc chắn. Sau đó thay thế nắp của bộ điều khiển. </p> <h3 id=\"mount-the-garage-door-controller\"> 4. Gắn Bộ điều khiển Cửa Nhà để xe </h3> <p> <img alt=\"Meross Garage Door Opener Mounted on Ceiling\" src=\"images/meross-door-opener-up-close-shot-261.jpg\" loading=\"lazy\"> </p> <p> Vì bạn đã lên kế hoạch cho các vị trí của mình, nên bây giờ là lúc để lắp bộ điều khiển của bạn. Đảm bảo bộ điều khiển ở nơi có thể tiếp cận nguồn điện cần thiết mà không gây căng thẳng cho bất kỳ hệ thống dây điện nào. </p> <p> Tiếp theo, gỡ lớp nền dính trên bộ điều khiển và ấn nó vào vị trí. Nếu bạn có bộ điều khiển có gắn vít, thì hãy sử dụng tuốc nơ vít để cố định bộ điều khiển vào vị trí. </p> <h3 id=\"mount-the-sensor\"> 5. Gắn cảm biến </h3> <p> <img alt=\"Garage Door Sensor Installed on Side of Door\" src=\"images/sensor-installation-on-side-of-door-370.jpg\" loading=\"lazy\"> </p> <p> Tiếp theo, bạn sẽ cần gắn cảm biến cho cửa. Khuyến nghị nên đặt cảm biến này ở nơi không cản trở đường đi của cửa. </p> <p> Ngoài ra, bạn có thể muốn gắn cảm biến gần mặt đất. Điều này không được khuyến nghị, vì nước liên tục bắn trực tiếp vào cảm biến có thể gây hỏng cảm biến. Khi bạn đã định vị cảm biến, hãy sử dụng băng dính hai mặt hoặc vít được cung cấp để giữ chặt nó. </p> <p> Trong ảnh trên, cảm biến màu đen đã được gắn bên cạnh cửa nhà để xe với phần nam châm được gắn vào chính cánh cửa. Cảm biến này sử dụng băng dính hai mặt để gắn. </p> <h3 id=\"connect-the-sensor-wires\"> 6. Kết nối dây cảm biến </h3> <p> <img alt=\"Up Close Wiring Terminals\" src=\"images/up-close-wiring-terminals-on-opener-600.jpg\" loading=\"lazy\"> </p> <p> Bây giờ là lúc kết nối dây với cảm biến và bộ điều khiển. Sử dụng kế hoạch bạn đã thực hiện ở bước đầu tiên, định tuyến dây của bạn và sử dụng súng bắn ghim để cố định dây vào tường hoặc trần nhà. </p> <p> Đảm bảo không kẹp hoặc xoắn dây vì điều này có thể làm hỏng chúng. Khi chúng được định tuyến, hãy kết nối đầu nối mông cái màu đỏ trên bộ điều khiển với đầu nối mông đực màu đỏ ở cuối dây cảm biến. </p> <p> Tiếp theo, bạn sẽ cần mở nắp của dụng cụ mở cửa nhà để xe. Nên có bốn dây, hai nguồn điều khiển và chung cho thiết bị, và hai điều khiển nút trên tường. </p> <p> </p> <p> Thông thường, những dây này bắt nguồn từ trần nhà và nên có các đầu cuối bằng thép cuộn uốn cong để cố định chúng với bộ phận mở cửa ga ra. Nếu bạn không thể xác định đó là dây điện nào, hãy dừng lại và tham khảo hướng dẫn sử dụng của chủ sở hữu cho thiết bị mở cửa ga ra của bạn, hoặc tham khảo ý kiến ​​của một thợ điện được chứng nhận. </p> <p> Nếu bạn đã tìm thấy dây, hãy kết nối dây màu nâu và xanh lam từ bộ điều khiển với các đầu nối trên thiết bị mở được kết nối với nút trên tường. Trong ảnh trên, các dây điều khiển đã được lắp vào hai đầu cuối bên trái. </p> <p> Khi bạn hoàn thành, cần có hai dây được gắn vào mỗi đầu cuối nút tường. Cố định nắp cho bộ mở cửa ga ra của bạn, cắm bộ điều khiển và bộ mở và quá trình cài đặt sẽ hoàn tất. </p> <p> Trong bước tiếp theo, bạn sẽ kết nối bộ điều khiển với mạng không dây. </p> <h3 id=\"connect-the-controller-to-wi-fi\"> 7. Kết nối Bộ điều khiển với Wi-Fi </h3> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (3 Hình ảnh) </strong> <img alt=\"Meross Select Device Type Meross App\" src=\"images/select-device-type-meross-app-511.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"Companion Device Compatability Checker\" src=\"images/companion-device-compatability-check-153.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"Compatability check screen meross app\" src=\"images/compatibility-check-screen-meross-app-318.jpg\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> Để thiết lập kết nối Wi-Fi, chúng tôi đã sử dụng ứng dụng Meross. Nó có sẵn cho <a href=\"https://apps.apple.com/us/app/meross/id1260842951\" target=\"_blank\" rel=\"nofollow noopener\"> iOS </a> và <a href=\"https://play.google.com/store/apps/details?id=com.meross.meross&hl=en_US&gl=US\" target=\"_blank\" rel=\"nofollow noopener\"> Android </a> . Quá trình này hầu như luôn luôn bao gồm mở ứng dụng, xác định sản phẩm của bạn, kết nối ứng dụng với Wi-Fi, mở màn hình Cài đặt và cho phép bộ điều khiển truy cập vào mạng của bạn. </p> <p> Tại đây, hãy mở ứng dụng, sau đó chạm vào <strong> Cửa mở nhà để xe thông minh </strong> và sau đó <strong> Khởi đầu </strong> . Chọn nhà sản xuất và kiểu máy mở cửa ga ra mà bạn đang sử dụng với bộ điều khiển. Đảm bảo bạn làm theo các hướng dẫn dành riêng cho ứng dụng của mình. </p> <h3 id=\"set-the-open-close-timing-interval\"> 8. Đặt khoảng thời gian mở / đóng </h3> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (3 Hình ảnh) </strong> <img alt=\"Meross opening time setup screen\" src=\"images/opening-time-setup-screen-1-381.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"Meross opening time selection screen\" src=\"images/opening-time-meross-app-581.jpg\" loading=\"lazy\"> Mở rộng <img alt=\"Meross Your Garage Door Final Screen\" src=\"images/your-garage-home-screen-207.jpg\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> Một điều quan trọng cần đặt trước khi bạn kiểm tra bộ điều khiển mới của mình là thời gian mở cửa ga ra. Trong ứng dụng Meross, bạn có thể chọn từ 10 giây đến 40 giây trong khoảng thời gian năm giây hoặc bạn có thể thêm cài đặt tùy chỉnh cho những cánh cửa mất một số giây chẵn để đóng. </p> <p> Đặt thời gian cho cửa của bạn rất dễ dàng, nhưng bạn phải làm đúng. Khoảng thời gian quá ngắn sẽ khiến cửa mở một phần và cài đặt quá dài có thể gây ra căng thẳng quá mức cho động cơ của bộ mở cửa ga ra. </p> <p> Để đặt khoảng thời gian, bạn sẽ cần một chiếc đồng hồ có kim giây hoặc chức năng đồng hồ bấm giờ. Bạn cũng có thể sử dụng bộ hẹn giờ tích hợp trên điện thoại của mình. Chuẩn bị bộ hẹn giờ và đứng gần nút mở cửa ga ra của bạn. Sau đó nhấn nút cùng lúc khi bạn nhấn bắt đầu trên đồng hồ bấm giờ hoặc ghi lại thời gian trên kim giây. </p> <p> Chờ cho đến khi cửa nhà để xe của bạn ngừng di chuyển và ghi lại thời gian. Đây là khoảng thời gian của bạn. Chuyển thông tin đó vào ứng dụng và cài đặt khoảng thời gian hoàn tất. </p> <h3 id=\"test-the-garage-door-controller\"> 9. Kiểm tra bộ điều khiển cửa nhà để xe </h3> <p> Sử dụng ứng dụng của bạn, mở và đóng cửa một vài lần chỉ để đảm bảo mọi thứ đang hoạt động. Bây giờ bạn sẽ có thể sử dụng nút tường hoặc ứng dụng để mở cửa nhà để xe của mình. </p> <p> </p> <h2 id=\"enjoy-your-smart-garage-door-controller\"> Tận hưởng bộ điều khiển cửa nhà để xe thông minh của bạn </h2> <p> Đưa công nghệ nhà thông minh của bạn vào cửa nhà để xe không cần phải tốn kém. </p> <p> Việc lắp đặt bộ điều khiển cửa gara thông minh mới cung cấp cho bạn và gia đình sự linh hoạt, an toàn, bảo mật và thuận tiện hơn cho ngôi nhà của bạn. Nó cũng mang lại sự an tâm khi biết rằng cửa nhà để xe của bạn có thể được kiểm soát từ hầu hết mọi nơi. </p>"}