{"title":"Làm thế nào để xem ai theo dõi bạn trên Facebook","content":"<p> Nếu bạn quan tâm đến việc thu hút nhiều người theo dõi hơn trên Facebook cũng như bạn muốn tăng bạn bè trên Facebook, thì bạn có thể muốn xem ai theo dõi bạn trên Facebook. Bạn có thể dễ dàng thực hiện việc này trên cả máy tính để bàn và thiết bị di động. </p> <p> Đây là cách để biết bạn có bao nhiêu người theo dõi trên Facebook. </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-desktop\"> Cách xem ai theo dõi bạn trên Facebook (Máy tính để bàn) </h2> <p> Trên máy tính để bàn, bạn có thể xem ai đang theo dõi bạn trên Facebook, nhưng không thấy số lượng người theo dõi. Tuy nhiên, ứng dụng Facebook dành cho thiết bị di động cho phép bạn xem ai theo dõi bạn và số lượng người theo dõi bạn. </p> <p> <img alt=\"Facebook profile interface with friends\" src=\"images/click-more-and-select-followers-786.jpg\" loading=\"lazy\"> </p> <p> Đầu tiên, đăng nhập vào <a href=\"https://web.facebook.com\" target=\"_blank\" rel=\"nofollow noopener\"> tài khoản Facebook </a> thông qua trình duyệt của bạn và sử dụng các hướng dẫn sau để xem những người theo dõi Facebook của bạn: </p> <ol> <li> Sau khi đăng nhập, hãy nhấp vào <strong> biểu tượng hình ảnh nhỏ </strong> bên cạnh tên của bạn trên thanh bên. </li> <li> Trong menu Hồ sơ, nhấp vào <strong> Bạn bè </strong> . </li> <li> Trong menu Bạn bè, hãy nhấp vào <strong> Hơn </strong> thả xuống bên phải. </li> <li> Từ danh sách thả xuống, hãy chọn <strong> Người theo dõi </strong> để xem tất cả những người theo dõi Facebook của bạn. </li> </ol> <p> </p> <h2 id=\"how-to-see-who-follows-you-on-facebook-mobile\"> Cách xem Ai theo dõi bạn trên Facebook (Di động) </h2> <p> Giống như chúng tôi đã nêu trước đó, ứng dụng Facebook dành cho thiết bị di động cho phép bạn truy cập danh sách và số lượng người đang theo dõi bạn trên Facebook. </p> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (3 Hình ảnh) </strong> <img alt=\"Facebook profile about info menu\" src=\"images/tap-see-your-about-info-732.png\" loading=\"lazy\"> Mở rộng <img alt=\"Mobile Facebook interface displaying Facebook followers\" src=\"images/tap-see-all-to-load-a-list-of-your-followers-895.png\" loading=\"lazy\"> Mở rộng <img alt=\"Mobile Facebook page displaying a list of followers and their numbers\" src=\"images/look-to-the-upper-right-corner-to-see-the-number-of-followers-677.png\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <p> Đăng nhập vào tài khoản Facebook của bạn thông qua ứng dụng dành cho thiết bị di động. Sau đó làm theo các hướng dẫn sau: </p> <ol> <li> Trên trang chủ của ứng dụng dành cho thiết bị di động, hãy nhấn vào biểu tượng hình tròn bên cạnh <strong> Bạn đang nghĩ gì vậy? </strong> thanh tìm kiếm để tải hồ sơ của bạn. </li> <li> Trong menu hồ sơ, hãy nhấn <strong> Xem thông tin giới thiệu của bạn </strong> . </li> <li> Di chuyển đến dưới cùng của trang. Sau đó, dưới <strong> Người theo dõi </strong> , nhấn <strong> Nhìn thấy tất cả </strong> để tải danh sách tất cả những người theo dõi Facebook của bạn. </li> <li> Nhìn vào góc trên cùng bên phải của trang (đối diện <strong> Người theo dõi </strong> ) để xem số người theo dõi bạn trên Facebook. </li> </ol> <p> Bạn sẽ không có tùy chọn kiểm tra những người theo dõi Facebook của mình nếu bạn không có. Do đó, việc làm theo các bước ở trên sẽ không cho phép bạn kiểm tra những người theo dõi của mình vì không có người theo dõi nào. </p> <p> Bạn cũng có thể không nhận được tùy chọn này nếu tài khoản Facebook của bạn là mới, vì bạn có thể chưa có bất kỳ người theo dõi nào. Hoặc bạn có thể cần <a href=\"https://www.makeuseof.com/tag/quickly-switch-facebook-profiles/\" target=\"_blank\" rel=\"nofollow noopener\"> chuyển sang một tài khoản Facebook khác </a> . Ngoài ra, tài khoản của bạn có thể không được đặt để cho phép mọi người theo dõi bạn trên Facebook — chúng tôi sẽ giải thích cách thay đổi điều này bên dưới. </p> <p> </p> <p> </p> <h2 id=\"how-to-give-the-public-access-to-follow-you-on-facebook\"> Cách cấp quyền truy cập công khai để theo dõi bạn trên Facebook </h2> <p> Đôi khi, nếu bạn không cho phép công chúng theo dõi mình, điều đó sẽ hạn chế cơ hội có thêm người theo dõi trên Facebook. </p> <p> Đó là bởi vì những người không có trong danh sách bạn bè của bạn không thể theo dõi bạn trên Facebook nếu bạn không cho phép họ. Tuy nhiên, bạn có thể đặt tùy chọn theo dõi của mình là &quot;Công khai&quot; để bất kỳ ai cũng có thể theo dõi bạn, thay vì chỉ bạn bè của bạn. </p> <p> <strong> Để thực hiện việc này trên máy tính để bàn: </strong> </p> <p> <img alt=\"Facebook privacy settings page\" src=\"images/click-on-public-post-and-change-who-can-follow-you-to-public-880.jpg\" loading=\"lazy\"> </p> <ol> <li> Đi tới hồ sơ của bạn. </li> <li> Nhấn vào <strong> biểu tượng thả xuống tròn </strong> ở góc trên bên phải của thanh menu. </li> <li> Từ danh sách, hãy chọn <strong> Cài đặt &amp; Quyền riêng tư </strong> . </li> <li> Nhấp chuột <strong> Cài đặt </strong> . </li> <li> Từ thanh bên của menu Cài đặt, hãy nhấp vào <strong> Bài đăng công khai </strong> . </li> <li> Nhìn sang bên phải của <strong> Ai có thể theo dõi tôi </strong> và nhấp vào <strong> Bạn bè </strong> trình đơn thả xuống. </li> <li> Lựa chọn <strong> Công cộng </strong> cấp quyền truy cập theo dõi cho bất kỳ ai, kể cả những người không phải là bạn bè của bạn trên Facebook. </li> </ol> <p> <strong> Để thực hiện việc này trên ứng dụng Facebook dành cho thiết bị di động: </strong> </p> <p> <strong class=\"gallery__section-title\"> Bộ sưu tập Hình ảnh (3 Hình ảnh) </strong> <img alt=\"Facebook menu list\" src=\"images/tap-the-three-menu-bars-and-go-to-settings-170.png\" loading=\"lazy\"> Mở rộng <img alt=\"Facebook settings list\" src=\"images/scroll-down-and-select-public-posts-754.png\" loading=\"lazy\"> Mở rộng <img alt=\"Facebook followers settings page\" src=\"images/tick-the-public-option-under-who-can-follow-728.png\" loading=\"lazy\"> Mở rộng </p> <p> Đóng </p> <ol> <li> Mở ứng dụng Facebook dành cho thiết bị di động và nhấn vào <strong> ba thanh menu ngang </strong> ở bên phải của trang chủ. </li> <li> Cuộn xuống và chọn <strong> Cài đặt </strong> . </li> <li> Nhấn vào <strong> Bài đăng công khai </strong> . </li> <li> Dưới <strong> Ai có thể theo dõi tôi </strong> , đánh dấu <strong> Công cộng </strong> . </li> </ol> <p> </p> <h2 id=\"keep-control-over-your-facebook-followers\"> Giữ quyền kiểm soát những người theo dõi trên Facebook của bạn </h2> <p> Nếu bạn sử dụng Facebook để quảng bá thương hiệu hoặc doanh nghiệp của mình, việc theo dõi những người theo dõi là cần thiết. Đó là một cách tốt để kiểm duyệt những gì mọi người có thể nhìn thấy về bạn. </p> <p> Nếu muốn kiểm soát nhiều hơn bạn bè và người theo dõi trên Facebook, bạn nên cân nhắc việc ẩn họ khỏi nguồn cấp dữ liệu của mình. </p>"}