{"title":"HBO Max sẽ ra mắt tại Mỹ Latinh vào tháng 6","content":"<p> HBO Max, dịch vụ phát trực tuyến từ WarnerMedia, sẽ ra mắt trên khắp Châu Mỹ Latinh và Caribe vào tháng 6 năm 2021. Đây là lần đầu tiên dịch vụ này có sẵn bên ngoài Hoa Kỳ. </p> <h2 id=\"where-is-hbo-max-launching-in-latin-america\"> HBO Max ra mắt ở đâu ở Mỹ Latinh? </h2> <p> Hiện tại, HBO Max chỉ có ở Mỹ. Đến cuối tháng 6 năm 2021, nó sẽ có mặt ở nhiều quốc gia trên khắp Châu Mỹ Latinh và Caribe. Tin tức được thông báo trong một <a href=\"https://pressroom.warnermedia.com/us/media-release/hbo-max/hbo-max-scheduled-launch-39-territories-latin-america-june-2021\" target=\"_blank\" rel=\"nofollow noopener\"> Thông cáo báo chí của WarnerMedia </a> . </p> <p> Cụ thể, các quốc gia đó là: Anguilla, Antigua, Argentina, Aruba, British Virgin Isles, Bahamas, Barbados, Belize, Bolivia, Brazil, Cayman Islands, Chile, Colombia, Costa Rica, Curacao, Dominica, Dominican Republic, Ecuador, El Salvador , Grenada, Guatemala, Guyana, Haiti, Honduras, Jamaica, Mexico, Montserrat, Nicaragua, Panama, Paraguay, Peru, St. Kitts và Nevis, St. Lucia, St. Vincent, Suriname, Trinidad và Tobago, Turks và Caicos, Uruguay và Venezuela. </p> <p> </p> <h2 id=\"what-will-hbo-max-offer-in-latin-america\"> HBO Max sẽ cung cấp những gì ở Mỹ Latinh? </h2> <p> </p> <p> Những người đăng ký HBO GO hiện tại thanh toán trực tiếp hoặc thông qua &quot;đối tác đủ điều kiện&quot; sẽ được truy cập ngay vào HBO Max. HBO GO sau đó sẽ bị loại bỏ dần trên các khu vực. </p> <p> Chi tiết giá cả vẫn chưa được công bố, mặc dù được hứa hẹn trong những tháng tới, cùng với thông tin về nội dung mới và khuyến mại. </p> <p> Giống như ở Mỹ, HBO Max sẽ cung cấp nhiều gói đăng ký và thiết bị hỗ trợ như điện thoại thông minh, máy tính bảng và các nền tảng thông minh khác. </p> <p> </p> <p> Trong đoạn giới thiệu thông báo tin tức, có thể thấy các clip từ các loạt phim như Game of Thrones and Friends, cùng với các phim như The Matrix và Casablanca. Tuy nhiên, một thông báo nhỏ xuất hiện ở cuối để cảnh báo rằng &quot;không phải tất cả các tựa game [sẽ] khả dụng khi khởi chạy&quot;. </p> <p> </p> <h2 id=\"when-will-hbo-max-be-available-globally\"> Khi nào HBO Max sẽ có sẵn trên toàn cầu? </h2> <p> Năm ngoái, Warner Bros. gây tranh cãi khi thông báo rằng họ có kế hoạch phát hành toàn bộ hệ thống rạp chiếu vào năm 2021 cho HBO Max. Nó khiến giám đốc <a href=\"https://www.makeuseof.com/christopher-nolan-hbo-max-worst-streaming-service/\" target=\"_blank\" rel=\"nofollow noopener\"> Christopher Nolan đánh giá cao HBO Max là &quot;dịch vụ phát trực tuyến tồi tệ nhất&quot; </a> . </p> <p> Tuy nhiên, trong khi một số người trong ngành công nghiệp điện ảnh có thể phàn nàn, đó là một động thái lựa chọn ủng hộ tuyệt vời cho người tiêu dùng. </p> <p> Do đó, những người ở Mỹ Latinh và Caribe có thể sẽ rất hào hứng với sự ra mắt của HBO Max, với hy vọng rằng thỏa thuận cũng áp dụng cho họ. </p> <p> Đối với phần còn lại của thế giới? Chưa có ngày công bố chính thức, nhưng WarnerMedia tiết lộ rằng Bắc Âu, Tây Ban Nha, Trung Âu và Bồ Đào Nha dự kiến ​​sẽ được nâng cấp lên HBO Max vào cuối năm nay. </p> <p> Johannes Larcher, người đứng đầu HBO Max International, cho biết: </p> <blockquote> <p> Chúng tôi rất vui mừng vì sự ra mắt của HBO Max ở Mỹ Latinh và Caribe, đây là bước đầu tiên trong việc đưa dịch vụ Trực tiếp đến Người tiêu dùng của WarnerMedia đến với người tiêu dùng bên ngoài Hoa Kỳ và trên toàn thế giới. </p> </blockquote>"}