{"title":"Cách khắc phục mã dừng BSOD &quot;SYSTEM THREAD EXCEPTION KHÔNG ĐƯỢC XỬ LÝ&quot; trong Windows 10","content":"<p> &quot;HỆ THỐNG NGOẠI LỆ KHÔNG ĐƯỢC XỬ LÝ&quot; là một lỗi Windows 10 phổ biến xảy ra chủ yếu do trình điều khiển lỗi thời hoặc không tương thích. </p> <p> Điều khiến việc khắc phục phức tạp hơn các BSOD khác là nhiều trình điều khiển có thể gây ra sự cố và đôi khi máy tính của bạn có thể không phát hiện được tất cả. Đó là lý do tại sao bước đầu tiên người dùng nên thực hiện khi khắc phục lỗi này là tìm trình điều khiển chính xác gây ra sự cố. </p> <p> Dưới đây là cách bạn sửa lỗi không xử lý được ngoại lệ luồng hệ thống trên Windows 10. </p> <h2 id=\"boot-into-safe-mode\"> 1. Khởi động vào Chế độ An toàn </h2> <p> Bước đầu tiên người dùng nên thực hiện trước khi cố gắng khắc phục sự cố này là khởi động máy tính của họ vào Chế độ An toàn. Tùy thuộc vào tùy chọn của bạn và liệu bạn có thể khởi động máy tính của mình vào màn hình đăng nhập hay không, có một số cách để thực hiện điều này: </p> <h3 id=\"boot-into-safe-mode-via-settings\"> Khởi động vào Chế độ An toàn thông qua Cài đặt </h3> <ol> <li> Bấm vào <strong> Khởi đầu </strong> nút, sau đó chọn <strong> Cài đặt </strong> . </li> <li> Hướng đến <strong> Cập nhật &amp; Bảo mật </strong> sau đó bấm vào <strong> Hồi phục </strong> . </li> <li> Dưới <strong> Khởi động nâng cao, </strong> bấm vào <strong> Khởi động lại ngay bây giờ. </strong> </li> <li> Khi PC của bạn khởi động lại, <strong> Chọn một sự lựa chọn </strong> màn hình sẽ xuất hiện. </li> <li> Từ đây đi đến <strong> Khắc phục sự cố&gt; Tùy chọn nâng cao&gt; Cài đặt khởi động </strong> . Sau đó bấm vào <strong> Khởi động lại </strong> </li> <li> Khi PC của bạn khởi động lại, hãy nhấn <strong> F5 </strong> để khởi động máy tính của bạn trong <strong> Chế độ an toàn với mạng </strong> . </li> </ol> <p> <img alt=\"\" src=\"images/advanced-startup-settings-468.jpg\" loading=\"lazy\"> </p> <h3 id=\"from-the-sign-in-screen\"> Từ màn hình đăng nhập </h3> <ol> <li> Đơn giản chỉ cần nhấn giữ <strong> Sự thay đổi </strong> và chọn <strong> Quyền lực </strong> tiếp theo là <strong> Khởi động lại </strong> . </li> <li> Thực hiện theo các bước 4, 5 và 6 từ phần trên. </li> </ol> <h3 id=\"from-a-blank-screen\"> Từ màn hình trống </h3> <ol> <li> Nếu bạn không thể truy cập màn hình đăng nhập, hãy làm theo các bước sau. </li> <li> Nhấn và giữ nút nguồn trên thiết bị của bạn trong 10 giây để tắt. </li> <li> Nhấn lại nút nguồn để khởi động nó. </li> <li> Ngay sau khi PC của bạn khởi động, tức là logo của nhà sản xuất xuất hiện, hãy nhấn lại nút nguồn trong 10 giây. </li> <li> Nhấn nút nguồn để khởi động thiết bị của bạn. </li> <li> Nếu thực hiện đúng, máy tính của bạn sẽ khởi động vào <strong> Môi trường khôi phục Windows </strong> . </li> <li> Làm theo các bước 4, 5 và 6 từ phần đầu tiên. </li> </ol> <p> </p> <h2 id=\"finding-which-driver-is-responsible\"> 2. Tìm Trình điều khiển nào có trách nhiệm </h2> <p> Vì lỗi rất có thể là do trình điều khiển bị trục trặc, bạn có thể sử dụng Nhật ký Windows để tìm ra cái nào. </p> <p> Để thực hiện việc này, chỉ cần làm theo các bước sau: </p> <ol> <li> nhấn <strong> Phím Windows + R </strong> và trong <strong> Chạy </strong> hộp thoại, loại <strong> eventvwr. </strong> </li> <li> Điều hướng đến <strong> Nhật ký Windows </strong> và mở rộng nó, sau đó chọn <strong> Hệ thống. </strong> </li> <li> Tìm nhật ký có tên <strong> system_thread_exception_not_handled </strong> và nhấp vào nó để tìm ra trình điều khiển nào đang gây ra sự cố. </li> </ol> <p> <img alt=\"Windows Logs in Event Viewer\" src=\"images/event-viewer-windows-logs-377.jpg\" loading=\"lazy\"> </p> <p> Thông thường, trình điều khiển được liên kết sẽ là trình điều khiển hiển thị hoặc trình điều khiển mạng vì chúng nổi tiếng là nguyên nhân gây ra BSOD này. Nếu tệp được liên kết xảy ra <strong> nvlddmkm.sys </strong> , bạn có thể xem qua <a href=\"https://www.makeuseof.com/easy-ways-fix-nvlddmkm-sys-error-in-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> một số cách dễ dàng để sửa chữa nó. </a> </p> <p> </p> <h2 id=\"rollback-or-update-the-drivers\"> 3. Khôi phục hoặc cập nhật trình điều khiển </h2> <p> Tùy thuộc vào trình điều khiển nào chịu trách nhiệm cho lỗi không xử lý được ngoại lệ luồng hệ thống, bạn có thể cần cập nhật hoặc cài đặt lại các trình điều khiển liên quan. </p> <p> Nếu trình điều khiển đã không được cập nhật trong một thời gian dài, thì việc cập nhật trình điều khiển rất có thể sẽ khắc phục được sự cố. Nếu trình điều khiển đã được cập nhật gần đây, thì tốt nhất bạn nên khôi phục trình điều khiển hoặc cài đặt lại các bản cập nhật. </p> <p> </p> <h3 id=\"how-to-update-drivers-on-windows-10\"> Cách cập nhật trình điều khiển trên Windows 10 </h3> <ol> <li> nhấn <strong> Phím Windows + R </strong> và gõ vào <strong> devmgmt.msc </strong> để mở <strong> Quản lý thiết bị </strong> . </li> <li> Điều hướng đến thiết bị được liên kết và mở rộng menu. Ví dụ: nếu lỗi do trình điều khiển màn hình gây ra, bạn sẽ phải mở rộng <strong> Bộ điều hợp hiển thị </strong> Lựa chọn. </li> <li> Nhấp chuột phải vào trình điều khiển và nhấp vào <strong> Cập nhật driver </strong> . </li> <li> Trong hộp thoại mở ra, nhấp vào <strong> Tự động tìm kiếm phần mềm trình điều khiển được cập nhật </strong> . </li> <li> Sau đó, Windows sẽ tự động tìm kiếm các trình điều khiển mới nhất trên web và cài đặt chúng. </li> </ol> <p> <img alt=\"windows 10 update network driver\" src=\"images/windows-10-update-network-driver-892.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-rollback-drivers-on-windows-10\"> Cách khôi phục trình điều khiển trên Windows 10 </h3> <ol> <li> Mở <strong> Quản lý thiết bị </strong> và điều hướng đến trình điều khiển được đề cập. </li> <li> Mở rộng menu và nhấp chuột phải vào trình điều khiển. </li> <li> Bấm vào <strong> Tính chất </strong> . </li> <li> Phía dưới cái <strong> Người lái xe </strong> tab, nhấp vào <strong> Quay lại trình điều khiển </strong> . </li> <li> Windows sẽ tự động quay trở lại phiên bản trình điều khiển có sẵn cuối cùng. </li> </ol> <p> <img alt=\"Driver tab in Driver Properties\" src=\"images/rollback-driver-display-115.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"rename-the-faulty-file\"> 4. Đổi tên tệp bị lỗi </h2> <p> Khi truy xuất tên tệp được liên kết với lỗi ngoại lệ luồng hệ thống không được xử lý, người dùng nên đổi tên tệp. Làm điều này sẽ khiến Windows tạo một bản sao mới và cài đặt lại nó. Tệp trình điều khiển được đặt tại <strong> C: \\ Windows \\ System32 \\ driver </strong> </p> <p> Làm theo các bước sau để đổi tên tệp: </p> <ol> <li> Mở <strong> Chương trình quản lý dữ liệu </strong> và đi đến <strong> C: \\ Windows \\ System32 \\ driver </strong> </li> <li> Tìm trình điều khiển bị ảnh hưởng </li> <li> Nhấp vào nó và nhấn <strong> F2. </strong> </li> <li> Thay thế phần mở rộng tên tệp bằng <strong> .cũ </strong> . </li> <li> Nhấn Enter và khởi động lại máy tính của bạn. </li> </ol> <p> </p> <h2 id=\"use-sfc-and-dism-to-repair-system-files\"> 5. Sử dụng SFC và DISM để sửa chữa các tệp hệ thống </h2> <p> SFC và DISM là hai công cụ mạnh mẽ có sẵn cho mọi người dùng Windows. Kết hợp, họ có thể tìm và sửa hầu hết mọi lỗi liên quan đến hệ thống. Chúng cũng khá đơn giản để thực thi. </p> <p> </p> <p> Hãy đảm bảo tạo điểm khôi phục hệ thống vì các lệnh này làm thay đổi tệp hệ thống. </p> <h3 id=\"how-to-use-dism\"> Cách sử dụng DISM </h3> <ol> <li> Chạy <strong> Dấu nhắc lệnh </strong> với tư cách là Quản trị viên </li> <li> Trong bảng điều khiển, hãy nhập <strong> DISM / Trực tuyến / Dọn dẹp-Hình ảnh / ScanHealth </strong> và nhấn Enter. </li> <li> Chờ Windows hoàn tất quá trình quét. Sau đó gõ <strong> DISM / Trực tuyến / Cleanup-image / RestoreHealth </strong> </li> <li> Windows sẽ sửa chữa tất cả các sự cố được tìm thấy trong quá trình quét. </li> </ol> <p> <img alt=\"run the DISM ScanHealth command\" src=\"images/run-the-dism-scanhealth-command-569.png\" loading=\"lazy\"> </p> <h3 id=\"how-to-use-sfc\"> Cách sử dụng SFC </h3> <ol> <li> Trong thanh tìm kiếm của menu Bắt đầu, hãy nhập <strong> cmd </strong> sau đó nhấp chuột phải vào <strong> Dấu nhắc lệnh </strong> và chạy nó với tư cách quản trị viên. </li> <li> Trong bảng điều khiển, hãy nhập <strong> sfc / scannow </strong> </li> <li> Hãy kiên nhẫn vì Windows sẽ mất thời gian để quét và thay thế các tệp hệ thống bị hỏng. </li> </ol> <p> <img alt=\"Command Prompt window with the sfc command\" src=\"images/sfc-command-cmd-windows-108.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"use-system-restore-to-restore-your-pc\"> 6. Sử dụng Khôi phục Hệ thống để Khôi phục PC của bạn </h2> <p> Nếu vấn đề vẫn chưa được giải quyết, thì bạn sẽ phải sử dụng Khôi phục Hệ thống như một phương sách cuối cùng. Khôi phục Hệ thống là một tính năng khôi phục Windows về trạng thái trước đó. Các điểm khôi phục này được tạo định kỳ và khi cài đặt phần mềm mới. Ngoài ra, bạn có thể đặt <a href=\"https://www.makeuseof.com/tag/create-daily-system-restore-points-windows/\" target=\"_blank\" rel=\"nofollow noopener\"> Windows để tạo điểm khôi phục hàng ngày </a> </p> <h3 id=\"how-to-use-system-restore\"> Cách sử dụng khôi phục hệ thống </h3> <p> <img alt=\"Running system restore\" src=\"images/running-system-restore-850.jpg\" loading=\"lazy\"> </p> <ol> <li> Trong thanh tìm kiếm của menu Bắt đầu, hãy nhập <strong> Bảng điều khiển </strong> và nhấp vào mở nó. </li> <li> Trong thanh tìm kiếm của Bảng điều khiển, hãy nhập <strong> Hồi phục </strong> và mở nó từ kết quả. </li> <li> Bấm vào <strong> Mở Khôi phục Hệ thống </strong> . </li> <li> Bấm vào <strong> Kế tiếp </strong> và chọn một điểm khôi phục từ danh sách. </li> <li> Bấm vào <strong> Hoàn thành. </strong> </li> </ol> <p> </p> <h2 id=\"exception-handled\"> Xử lý ngoại lệ </h2> <p> Các mẹo được liệt kê ở trên cung cấp một giải pháp dễ dàng cho sự phiền toái mà BSOD như system_thread_exception_not_handled gây ra. Phần tốt nhất là hầu hết các mẹo đều có thể được sử dụng để chẩn đoán rất nhiều lỗi Màn hình xanh chết chóc (BSOD) phổ biến khác trong Windows. </p>"}