{"title":"Cách ngăn Windows 10 chặn các tệp đã tải xuống của bạn","content":"<p> Khi bạn cố gắng mở một tệp, Windows 10 có thể ngăn bạn mở trực tiếp tệp đó. Nó sẽ hiển thị cho bạn một cảnh báo bảo mật rằng tệp bắt nguồn từ một nguồn không xác định và có thể không an toàn. Điều này xảy ra khi một tính năng của Windows 10 có tên là Trình quản lý tệp đính kèm chặn các tệp mà nó cho là không an toàn cho PC của bạn. </p> <p> Mặc dù bạn có thể bỏ chặn từng tệp theo cách thủ công, nhưng đây có thể là một quá trình mệt mỏi — đặc biệt nếu bạn phải làm điều đó cho hầu hết mọi tệp bạn tải xuống. Trong bài viết này, chúng tôi sẽ hướng dẫn bạn cách có thể ngăn Windows 10 chặn các tệp đã tải xuống của bạn. </p> <h2 id=\"what-is-the-attachment-manager-in-windows-10\"> Trình quản lý tệp đính kèm trong Windows 10 là gì? </h2> <p> Trong Windows 10, có một tính năng bảo mật được gọi là Trình quản lý tệp đính kèm chặn bạn mở các tệp không an toàn. Đây có thể là những tệp bạn đã tải xuống hoặc <a href=\"https://www.makeuseof.com/tag/spot-dangerous-email-attachment/\" target=\"_blank\" rel=\"nofollow noopener\"> các tệp mà Windows xác định là tệp đính kèm email không an toàn </a> . Nếu Trình quản lý tệp đính kèm cho rằng tệp không an toàn, nó sẽ ngăn Windows 10 mở tệp đó và hiển thị thông báo cảnh báo. Trình quản lý Tệp đính kèm phân loại tệp mà bạn tải xuống dựa trên loại tệp và phần mở rộng tên tệp. </p> <p> Windows Attachment Manager sử dụng giao diện lập trình ứng dụng (API) IAttachmentExecute để tìm loại tệp, liên kết tệp và để xác định hành động thích hợp nhất cần thực hiện. Khi bạn tải xuống các tệp và lưu chúng trên đĩa của mình, Windows sẽ thêm siêu dữ liệu cụ thể vào các tệp này. Các siêu dữ liệu này được coi là tệp đính kèm. Khi Windows thêm siêu dữ liệu vào tệp tải xuống dưới dạng tệp đính kèm, đây được gọi là Thông tin vùng. </p> <p> Bây giờ, <strong> Thông tin khu vực </strong> là gốc rễ của vấn đề nằm ở đâu. Khi File Explorer mở một tệp, nó sẽ đọc thông tin Zone đính kèm được lưu trữ ở cùng một vị trí và kiểm tra xem tệp đó có đến từ một nguồn không xác định hay không. Nếu Windows nhận thấy tệp không được nhận dạng hoặc đến từ các nguồn không xác định, nó sẽ ngăn bạn mở tệp. </p> <p> Một cảnh báo Windows SmartScreen sẽ xuất hiện cho biết: </p> <blockquote> <p> Windows SmartScreen đã ngăn một ứng dụng không được nhận dạng khởi động. Chạy ứng dụng này có thể khiến PC của bạn gặp rủi ro. </p> </blockquote> <p> Nếu bạn muốn mở một tệp bị chặn theo cách thủ công, hãy bấm chuột phải vào tệp đã tải xuống rồi chọn <strong> Tính chất </strong> . Trong tab Chung, bấm <strong> Mở khóa </strong> , nhấp chuột <strong> Ứng dụng </strong> và sau đó nhấp vào <strong> đồng ý </strong> . </p> <p> Tuy nhiên, hãy tưởng tượng bạn phải làm điều này mỗi khi tải tệp xuống — điều này có thể gây khó chịu và tốn thời gian. Nếu bạn thường tải xuống tệp từ internet hoặc nhận tệp dưới dạng tệp đính kèm trong email, bạn có thể muốn ngăn hoàn toàn PC chặn tệp của bạn. </p> <p> Để ngăn Windows 10 chặn bạn mở tệp, bạn cần ngăn Windows 10 thêm Thông tin vùng vào tệp bạn tải xuống. Bạn có thể thực hiện việc này bằng cách định cấu hình Trình quản lý tệp đính kèm theo cách thủ công bằng Trình chỉnh sửa chính sách nhóm cục bộ hoặc Trình chỉnh sửa sổ đăng ký. </p> <p> Chúng tôi sẽ cung cấp các bước về cách bạn có thể thực hiện việc này. Bạn phải đăng nhập với tư cách quản trị viên hoặc bạn nên <a href=\"https://www.makeuseof.com/tag/windows-admin-rights/\" target=\"_blank\" rel=\"nofollow noopener\"> yêu cầu quyền quản trị viên </a> để có thể ngăn chặn các tệp đã tải xuống bị chặn. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-registry-editor\"> Định cấu hình Trình quản lý tệp đính kèm bằng Trình chỉnh sửa sổ đăng ký </h2> <p> Nhấn nút <strong> Phím Windows + R </strong> để mở Registry Editor. Từ đó, gõ &quot;Regedit&quot; và nhấp vào <strong> Đi vào </strong> . Một lời nhắc Kiểm soát Tài khoản Người dùng sẽ bật lên. Khi lời nhắc này xuất hiện, hãy nhấp vào <strong> Đúng </strong> để tiếp tục. </p> <p> <img alt=\"Opening the Registry Editor in Windows 10\" src=\"images/opening-the-registry-editor-in-windows10-344.png\" loading=\"lazy\"> </p> <p> Điều hướng đến khóa Tệp đính kèm trong Trình chỉnh sửa sổ đăng ký: <strong> HKEY_CURRENT_USER&gt; Phần mềm&gt; Microsoft&gt; Windows&gt; Phiên bản hiện tại&gt; Chính sách&gt; Phần đính kèm </strong> . </p> <p> <img alt=\"Navigating to the Attachments key in the Registry Editor\" src=\"images/navigating-to-the-attachments-key-in-the-registry-editor-256.png\" loading=\"lazy\"> </p> <p> Nếu khóa Phần đính kèm không có trong khóa Chính sách, bạn sẽ phải tạo nó. Để làm điều này, hãy nhấp chuột phải vào <strong> Chính sách </strong> phím, bấm <strong> Mới </strong> , nhấp chuột <strong> Chìa khóa </strong> . Thao tác này sẽ tạo một khóa mới, sau đó bạn sẽ đặt tên là &quot;Phần đính kèm&quot;. Nếu bạn thấy rằng khóa Phần đính kèm đã xuất hiện, bạn có thể chuyển sang bước tiếp theo. </p> <p> <img alt=\"Creating the Attachments key in the Registry Editor\" src=\"images/creating-the-attachments-key-in-the-registry-editor-495.png\" loading=\"lazy\"> </p> <p> Nhấp chuột phải vào <strong> Tệp đính kèm </strong> phím, bấm <strong> Mới </strong> và sau đó chọn <strong> Giá trị DWORD (32-bit) </strong> . </p> <p> <img alt=\"Selecting DWORD (32-bit) Value in the Registry Editor\" src=\"images/selecting-dword-value-in-the-registry-editor-117.png\" loading=\"lazy\"> </p> <p> Bạn sẽ được yêu cầu đặt tên cho giá trị DWORD mới tạo này. Đặt tên là &quot;SaveZoneInformation&quot; và nhấp vào <strong> Đi vào </strong> . </p> <p> <img alt=\"Creating a new key called SaveZoneInformation in Registry Editor\" src=\"images/creating-a-new-key-called-savezoneinformation-in-registry-editor-932.png\" loading=\"lazy\"> </p> <p> Cuối cùng, để tắt Trình quản lý tệp đính kèm trong Windows 10, hãy nhấp đúp vào <strong> SaveZoneInformation </strong> giá trị và thay đổi dữ liệu giá trị của nó thành 1. Nhấp vào <strong> đồng ý </strong> kêt thuc. </p> <p> <img alt=\"Disable the Attachment Manager in Registry Editor\" src=\"images/disable-the-attachment-manager-in-registry-editor-423.png\" loading=\"lazy\"> </p> <p> Khi bạn hoàn thành các bước này, hãy đóng Trình chỉnh sửa sổ đăng ký và khởi động lại máy tính của bạn để áp dụng các thay đổi. Từ đây trở đi, bất kỳ tệp nào bạn tải xuống sẽ không còn đính kèm Thông tin Vùng vào luồng dữ liệu thay thế của tệp nữa. Điều này sẽ cho phép bạn mở tệp của mình mà không gặp bất kỳ khó khăn nào. </p> <p> Nếu muốn quay lại và bật Trình quản lý tệp đính kèm, bạn có thể thực hiện việc này bằng cách điều hướng đến khóa Tệp đính kèm trong Trình chỉnh sửa sổ đăng ký: <strong> HKEY_CURRENT_USER&gt; Phần mềm&gt; Microsoft&gt; Windows&gt; Phiên bản hiện tại&gt; Chính sách&gt; Phần đính kèm </strong> . Từ đây, ở phía bên phải, hãy nhấp đúp vào <strong> SaveZoneInformation </strong> giá trị và thay đổi dữ liệu giá trị của nó thành 3. </p> <p> </p> <h2 id=\"configure-the-attachment-manager-using-the-local-group-policy-editor\"> Định cấu hình Trình quản lý tệp đính kèm bằng Trình chỉnh sửa chính sách nhóm cục bộ </h2> <p> Local Group Policy Editor chỉ khả dụng trong các phiên bản Windows 10 Enterprise, Education và Pro. Do đó, phương pháp này không thể áp dụng nếu bạn sở hữu phiên bản Windows 10 Home. Nếu PC của bạn chạy trên phiên bản Windows 10 Home, bạn sẽ cần định cấu hình Trình quản lý tệp đính kèm thông qua Trình chỉnh sửa sổ đăng ký. </p> <p> Nếu bạn đang sử dụng phiên bản Windows 10 có Local Group Policy Editor, bạn có thể định cấu hình Trình quản lý tệp đính kèm bằng cách sử dụng các bước được chỉ ra ở đây. </p> <p> Để bắt đầu, hãy nhấn <strong> Phím Windows + R </strong> , nhập &quot;gpedit.msc&quot; và nhấp vào <strong> Đi vào </strong> để mở Local Group Policy Editor. </p> <p> <img alt=\"Open the Group Policy Editor in Windows 10\" src=\"images/open-the-group-policy-editor-in-windows10-455.png\" loading=\"lazy\"> </p> <p> Điều hướng đến Trình quản lý tệp đính kèm: <strong> Cấu hình người dùng&gt; Mẫu quản trị&gt; Thành phần Windows&gt; Trình quản lý tệp đính kèm </strong> . </p> <p> <img alt=\"Navigating to the Attachment Manager in Group Policy Editor\" src=\"images/navigating-to-the-attachment-manager-in-group-policy-editor-305.png\" loading=\"lazy\"> </p> <p> Trong ngăn bên phải của Trình quản lý Tệp đính kèm, bấm đúp vào <strong> Không lưu giữ thông tin vùng trong tệp đính kèm </strong> chính sách để chỉnh sửa cài đặt Thông tin Khu vực. </p> <p> <img alt=\"Selecting the option to not preserve zone information in file attachments in Group Policy Editor\" src=\"images/selecting-the-option-to-not-preserve-zone-information-in-file-attachments-in-group-policy-editor-477.png\" loading=\"lazy\"> </p> <p> Một cửa sổ sẽ bật lên nơi bạn có thể chọn xem Trình quản lý tệp đính kèm nên hay không nên lưu giữ Thông tin vùng. </p> <p> Nhấp chuột <strong> Đã bật </strong> để cho phép Trình quản lý tệp đính kèm không lưu giữ Thông tin vùng. Điều này sẽ đảm bảo rằng Windows không chặn các tệp của bạn bất cứ khi nào bạn mở chúng. Nhấn vào <strong> Ứng dụng </strong> để lưu các thay đổi và sau đó nhấp vào <strong> đồng ý </strong> . </p> <p> Khi bạn hoàn tất, hãy đóng Local Group Policy Editor và khởi động lại PC của bạn để lưu các thay đổi. </p> <p> <img alt=\"Clicking Enabled to allow the Attachment Manager to not preserve Zone Information\" src=\"images/clicking-enabled-to-allow-the-attachment-manager-to-not-preserve-zone-information-415.png\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"windows-won-t-block-your-files-anymore\"> Windows sẽ không chặn tệp của bạn nữa </h2> <p> Nếu trước đây bạn phải bỏ chặn thủ công hầu hết các tệp bạn đã tải xuống, bạn sẽ nhận ra rằng quá trình đó có thể mệt mỏi như thế nào. Sau khi áp dụng các mẹo này, bạn sẽ có quyền tự do mở tất cả các tệp của mình một cách dễ dàng. </p> <p> Nếu bạn tải xuống tệp và bằng cách nào đó nghi ngờ độ tin cậy của chúng, bạn luôn có thể mở chúng trong môi trường cách ly an toàn để đảm bảo rằng PC và dữ liệu của bạn được an toàn. </p>"}