{"title":"iPhone 13 có thể tự hào với màn hình &quot;Luôn bật&quot;","content":"<p> Apple đã giới thiệu màn hình &quot;luôn bật&quot; của mình cho Apple Watch Series 5 vào năm 2019. Một vài năm sau, nó có thể được thiết lập để xuất hiện trên iPhone, theo phóng viên Max Weinbach, người đã chia sẻ thông tin với kênh YouTube. <a href=\"https://www.youtube.com/watch?v=FqOujNnuHBg\" target=\"_blank\" rel=\"nofollow noopener\"> EverythingApplePro </a> . </p> <p> Báo cáo tuyên bố rằng iPhone 13 --- nếu đó là những gì Apple thực sự quyết định đặt tên cho nó --- sẽ vĩnh viễn có một số phần của màn hình sáng lên để hiển thị một số chi tiết nhất định. </p> <h2 id=\"how-always-on-display-will-work\"> Cách hiển thị &quot;Luôn bật&quot; sẽ hoạt động </h2> <p> Những chi tiết này có thể bao gồm cả biểu tượng đồng hồ và pin. Chúng sẽ vẫn hiển thị ngay cả khi iPhone bị khóa, có nghĩa là người dùng không chủ động sử dụng nó. Các thông báo, chẳng hạn như thông báo tin nhắn mới, sẽ chỉ được chiếu sáng tạm thời. </p> <p> Đây sẽ là lần đầu tiên iPhone đi kèm với công nghệ màn hình &quot;luôn bật&quot;. Tuy nhiên, đây không phải là lần đầu tiên công nghệ tương tự xuất hiện trên điện thoại thông minh. Nokia đã giới thiệu tính năng màn hình &quot;luôn bật&quot; vào đầu năm 2009. Gần đây, nó đã trở thành một tính năng phổ biến rộng rãi trên các điện thoại Android khác nhau --- bao gồm các mẫu do Huawei, Motorola, Samsung, Google và các hãng khác sản xuất. </p> <p> Ưu điểm lớn, rõ ràng của &quot;luôn bật&quot; là nó không yêu cầu người dùng thức dậy hoặc mở khóa điện thoại của họ để truy cập thông tin, ngay cả khi đó là một việc nhỏ như kiểm tra thời gian. </p> <p> Nhược điểm là nó tiêu tốn thêm thời lượng pin, vốn đã có thể là thứ gì đó cao cấp trên điện thoại thông minh. Tuy nhiên, màn hình AMOLED có thể giảm tác động của pin này bằng cách chỉ kích hoạt các pixel trên màn hình cần để hiển thị thông tin. </p> <p> Nói cách khác, màn hình &quot;luôn bật&quot; này luôn sáng theo nghĩa kỹ thuật --- mặc dù phần lớn màn hình bị tắt, và chỉ một số phần vẫn sáng trong suốt thời gian. Điều này có nghĩa là ảnh hưởng đến tuổi thọ pin không lớn như những gì có thể xảy ra. </p> <p> </p> <h2 id=\"what-to-expect-from-iphone-13\"> Những gì mong đợi từ iPhone 13 </h2> <p> IPhone thế hệ tiếp theo có thể sẽ ra mắt vào tháng 9 năm 2021. Theo Weinbach, nó sẽ có thiết kế khung máy tổng thể giống như dòng iPhone 12, mặc dù sẽ có một số nâng cấp. </p> <p> Chúng sẽ bao gồm nam châm MagSafe mạnh hơn, một hệ thống camera cải tiến để chụp ảnh mặt trăng và các vì sao, ống kính camera siêu rộng trên toàn bộ dòng iPhone, video ở chế độ chân dung (thay vì chỉ là ảnh tĩnh), mặt sau mờ tinh tế và cải tiến A- chip loạt. Một báo cáo trước đây đã tuyên bố Apple có thể <a href=\"https://www.makeuseof.com/another-report-iphone-screen-touch-id/\" target=\"_blank\" rel=\"nofollow noopener\"> giới thiệu Touch ID trong màn hình </a> thay thế cho Face ID. </p> <p> Cho rằng vẫn còn hơn nửa năm nữa mới diễn ra, rất nhiều thông tin chi tiết mới có thể xuất hiện trước khi Apple trình làng chiếc iPhone tiếp theo của mình vào Quý 3. Tuy nhiên, có vẻ như nhà máy tin đồn đang bắt đầu bắt đầu hoạt động. Xem không gian này! </p>"}