{"title":"JPG và JPEG: Sự khác biệt giữa các định dạng tệp hình ảnh này là gì?","content":"<p> Không phải tất cả các định dạng tệp hình ảnh đều như nhau. Trên thực tế, nhiều người trong số họ được tạo ra để giải quyết vấn đề mà một định dạng đã tồn tại không thể giải quyết được. Ví dụ, JPEG ra đời vì kích thước tệp hình ảnh đã ngốn quá nhiều dung lượng lưu trữ. </p> <p> Tin hay không thì tùy, các phần mở rộng tệp JIF, JPEG và JPG ít nhiều đề cập đến cùng một điều. Để hiểu tại sao định dạng tệp có nhiều tên như vậy, chúng ta cần làm sáng tỏ một chút lịch sử phức tạp. </p> <h2 id=\"what-is-a-jpeg\"> JPEG là gì? </h2> <p> Từ viết tắt JPEG là viết tắt của Joint Photographic Experts Group - loại tệp được đặt tên theo tiểu ban đã giúp tạo ra tiêu chuẩn Định dạng trao đổi JPEG (JIF). Nó được ban hành lần đầu tiên vào năm 1992 bởi Tổ chức Tiêu chuẩn hóa Quốc tế (ISO). </p> <p> JPEG là hình ảnh quét tĩnh 24 bit, với tám bit trong mỗi kênh của mô hình màu RGB. Điều này không còn chỗ cho kênh alpha, có nghĩa là trong khi JPEG có thể hỗ trợ hơn 16 triệu màu, chúng không thể hỗ trợ độ trong suốt. </p> <p> Khi một hình ảnh được lưu dưới dạng JPEG, một số dữ liệu của nó sẽ bị loại bỏ trong một quá trình được gọi là mất mát <a href=\"https://www.makeuseof.com/tag/how-does-file-compression-work/\" target=\"_blank\" rel=\"nofollow noopener\"> nén tập tin </a> . Đổi lại, hình ảnh chiếm ít hơn 50-75 phần trăm không gian lưu trữ (so với các định dạng cũ hơn như BMP) mà chất lượng hình ảnh ít hoặc không có. </p> <p> Nén JPEG dựa trên kỹ thuật nén ảnh có tổn hao được gọi là biến đổi cosin rời rạc (DCT), được kỹ sư điện Nasir Ahmed đề xuất lần đầu tiên vào năm 1972. </p> <h3 id=\"what-is-a-jif\"> JIF là gì? </h3> <p> Bạn có thể nghĩ rằng tệp JIF giống như một JPEG ở dạng &quot;tinh khiết nhất&quot; của nó. Tuy nhiên, định dạng này không còn được sử dụng nhiều nữa vì nó có một số hạn chế khó chịu. Ví dụ: các định nghĩa về khía cạnh màu sắc và pixel của JIF đã gây ra các vấn đề về khả năng tương thích giữa bộ mã hóa và bộ giải mã (người xem). </p> <p> <img alt=\"Two people look at images side-by-side on separate laptops\" src=\"images/two-laptops-looking-at-images-904.png\" loading=\"lazy\"> </p> <p> Rất may, những vấn đề này sau đó đã được giải quyết bằng các tiêu chuẩn &quot;bổ sung&quot; khác được xây dựng dựa trên JIF. Đầu tiên trong số này là Định dạng trao đổi tệp JPEG (JFIF), và sau đó, <a href=\"https://www.makeuseof.com/tag/3-ways-to-remove-exif-metadata-from-photos-and-why-you-might-want-to/\" target=\"_blank\" rel=\"nofollow noopener\"> Định dạng tệp hình ảnh có thể trao đổi </a> (Exif) và cấu hình màu ICC. </p> <p> JPEG / JFIF là định dạng phổ biến nhất hiện nay để lưu trữ và truyền ảnh chụp ảnh trên internet, trong khi JPEG / Exif là định dạng dành cho máy ảnh kỹ thuật số và các thiết bị chụp ảnh khác. Hầu hết mọi người không phân biệt được sự khác biệt giữa các biến thể này và chỉ đơn giản gọi chúng là JPEG. </p> <h3 id=\"what-is-a-jpg2-or-jpf\"> JPG2 hoặc JPF là gì? </h3> <p> Năm 2000, nhóm JPEG đã phát hành một định dạng tệp hình ảnh khác được gọi là JPEG 2000 (phần mở rộng tệp của nó là JPG2 và JPF). Nó được coi là sự kế thừa của JPEG, nhưng không còn phổ biến nữa. Ngay cả khi phương pháp mã hóa tiên tiến của nó thường dẫn đến hình ảnh chất lượng tốt hơn. </p> <p> <img alt=\"A comparison of the JPG and JPEG2000 image formats\" src=\"images/jpeg2000_wikibooks_img1-325.jpg\" loading=\"lazy\"> Tín dụng hình ảnh: Dake / <a href=\"https://commons.wikimedia.org/wiki/File:Jpeg2000_wikibooks_img1.jpg\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Định dạng tệp JPEG 2000 bị thất bại vì một số lý do nhỏ. Đầu tiên, nó dựa trên một mã hoàn toàn mới và do đó không tương thích ngược với JPEG. Trên hết, việc xử lý các tệp JPEG 2000 đòi hỏi nhiều bộ nhớ hơn để xử lý, điều này hơi khó xử lý vào thời điểm đó. Rốt cuộc, máy tính trung bình vào thời điểm đó chỉ có 64 MB bộ nhớ. </p> <p> JPEG 2000 đã có một chút hồi sinh khi phần cứng máy tính nói chung đã được cải thiện rất nhiều trong 20 năm qua, nhưng định dạng tệp vẫn còn rất ít được sử dụng. Trình duyệt internet duy nhất có hỗ trợ các tệp JPEG 2000 tại thời điểm viết bài này là Safari. </p> <h3 id=\"jpeg-vs-jpg\"> JPEG so với JPG </h3> <p> Các phiên bản đầu tiên của Windows (đặc biệt là hệ thống tệp MS-DOS 8.3 và FAT-16) có giới hạn 3 ký tự tối đa khi nói đến độ dài của phần mở rộng tệp. JPEG phải được rút ngắn thành JPG để không vượt quá giới hạn. Máy tính Mac và Linux không bao giờ có điều đó, và vì vậy người dùng sẽ tiếp tục lưu ảnh dưới dạng JPEG. </p> <p> </p> <p> Các chương trình chỉnh sửa hình ảnh phổ biến hoạt động trên các hệ điều hành khác nhau — chẳng hạn như Photoshop và <a href=\"https://www.makeuseof.com/tag/gimp-photo-editing/\" target=\"_blank\" rel=\"nofollow noopener\"> Gimp </a> —Sau cùng sẽ đặt phần mở rộng tệp JPEG mặc định của họ thành JPG để giảm thiểu sự nhầm lẫn. </p> <p> Và đó là cách chúng tôi kết thúc với hai phần mở rộng tệp cho cùng một định dạng: JPEG và JPG. Khi chọn những gì để lưu hình ảnh của bạn, không có sự khác biệt giữa chúng. </p> <p> </p> <h2 id=\"jpeg-vs-png-which-is-better\"> JPEG so với PNG: Cái nào tốt hơn? </h2> <p> </p> <p> JPEG và PNG được phát hành trong cùng một thập kỷ, với mỗi định dạng tệp giải quyết một vấn đề hình ảnh kỹ thuật số khác nhau mà thế giới công nghệ phải đối mặt vào thời điểm đó. Bạn có thể nói rằng việc chúng được so sánh liên tục ... và chúng vẫn như vậy, cho đến ngày nay là điều hoàn toàn tự nhiên. Giữa JPEG và PNG, định dạng tệp hình ảnh nào thống trị nhất? </p> <p> Thành thật mà nói, câu trả lời phụ thuộc vào loại hình ảnh bạn đang lưu. </p> <p> JPEG phù hợp hơn cho ảnh vì chúng sử dụng tính năng nén mất dữ liệu để giữ kích thước tệp hợp lý. Ảnh là những hình ảnh lớn, chi tiết đến mức các tác phẩm nén (sự biến dạng hình ảnh tinh vi do nén gây ra) không được chú ý nhiều trên chúng. </p> <p> Mặt khác, hình ảnh có các điểm sắc nét, các cạnh rõ nét và với các vùng lớn của một màu (ví dụ: biểu trưng vectơ, nghệ thuật điểm ảnh, v.v.) trông không ổn khi lưu dưới dạng JPEG. </p> <p> <img alt=\"\" src=\"images/example-of-lossy-compression-621.png\" loading=\"lazy\"> Tín dụng hình ảnh: Axel Grimard / <a href=\"https://commons.wikimedia.org/wiki/File:Cube_Gif_-_Cube_Jpeg.png\" rel=\"nofollow\"> Wikimedia Commons </a> </p> <p> Đây là nơi có thể xuất hiện tệp Đồ họa mạng di động (PNG). Được phát triển bởi Nhóm phát triển PNG bốn năm sau khi phát hành JPEG, PNG hỗ trợ nén dữ liệu không mất dữ liệu và tính minh bạch. Do đó, PNG thường được sử dụng nếu chất lượng hình ảnh phải được giữ lại và kích thước tệp không phải là vấn đề. </p> <p> Một nguyên tắc chung là giữ JPEG cho ảnh và lưu PNG cho ảnh có độ trong suốt và ảnh không ảnh. Để biết thêm thông tin chi tiết về nhiều loại tệp khác nhau (không chỉ hình ảnh), hãy xem hướng dẫn của chúng tôi về <a href=\"https://www.makeuseof.com/tag/know-when-to-use-which-file-format-png-vs-jpg-doc-vs-pdf-mp3-vs-flac/\" target=\"_blank\" rel=\"nofollow noopener\"> biết khi nào sử dụng định dạng tệp nào. </a> </p> <p> </p> <h2 id=\"jpeg-and-jpg-are-the-same-file-format\"> JPEG và JPG có cùng định dạng tệp </h2> <p> Bất chấp sự nhầm lẫn mà JPEG đã gây ra với nhiều bản cập nhật và biến thể của nó, sự tràn ngập cuối cùng của hình ảnh kỹ thuật số trên internet vào giữa những năm 90 chắc chắn chủ yếu là do việc phát hành của nó. </p> <p> Lần tới khi bạn đã sẵn sàng xuất ảnh từ trình chỉnh sửa hình ảnh và được hiển thị với danh sách dài các định dạng có sẵn, chỉ cần nhớ: JPEG và JPG là một và giống nhau. </p>"}