{"title":"Bản cập nhật WatchOS mới nhất bảo vệ chống lại lỗi Apple Watch-Bricking","content":"<p> Bản cập nhật watchOS mới nhất của Apple, phiên bản phần mềm 7.3.1, bao gồm một bản sửa lỗi rất quan trọng --- giải quyết một lỗi khiến một số thiết bị Apple Watch Series 5 và Apple Watch SE ngừng sạc khi chúng vào chế độ Dự trữ năng lượng. </p> <p> Công ty cũng đã đưa ra một chương trình sửa chữa miễn phí mới cho các thiết bị bị ảnh hưởng bị mắc kẹt trong chế độ năng lượng thấp này và không thể thoát ra khỏi nó. Lỗi này về cơ bản là &quot;gạch&quot; Apple Watch của họ, khiến nó không còn hoạt động. </p> <h2 id=\"the-power-reserve-mode-bug\"> Lỗi chế độ dự trữ năng lượng </h2> <p> Chế độ Dự trữ năng lượng được bắt đầu khi Apple Watch sắp hết pin. Nó ngăn Apple Watch của bạn giao tiếp với iPhone của bạn. Nó cũng ngăn người dùng truy cập các tính năng khác trên Apple Watch. Để thoát khỏi chế độ Dự trữ năng lượng, người dùng cần sạc Apple Watch của họ. </p> <p> Trên một <a href=\"https://support.apple.com/en-us/HT212180\" target=\"_blank\" rel=\"nofollow noopener\"> trang hỗ trợ về lỗi và chương trình sửa chữa </a> , vào ngày 15 tháng 2, Apple bắt đầu bằng cách ghi chú: </p> <blockquote> <p> Một số lượng rất nhỏ khách hàng sử dụng các mẫu Apple Watch Series 5 hoặc Apple Watch SE chạy watchOS 7.2 hoặc 7.3 đã gặp sự cố đồng hồ của họ không sạc sau khi vào Power Reserve. </p> </blockquote> <p> Để tìm hiểu xem bạn có mẫu Apple Watch bị ảnh hưởng hay không, Apple khuyên bạn nên đặt Đồng hồ của bạn trên bộ sạc và đợi ít nhất 30 phút. Nếu nó không tính phí, hãy liên hệ với Bộ phận hỗ trợ của Apple và họ sẽ sắp xếp sửa chữa qua thư miễn phí. </p> <p> Đồng hồ sẽ được kiểm tra để kiểm tra xem chúng có đủ điều kiện hay không và nếu đúng như vậy, việc sửa chữa sẽ được thực hiện miễn phí và Đồng hồ đã sửa chữa sẽ được trả lại cho chủ nhân của nó. </p> <p> Không rõ chính xác có bao nhiêu Đồng hồ Apple bị ảnh hưởng nghiêm trọng bởi lỗi này. Tuy nhiên, có vẻ như sự cố chỉ ảnh hưởng đến một tập hợp con của các mẫu Apple Watch Series 5 hoặc Apple Watch SE, không có các mẫu khác. </p> <p> </p> <h2 id=\"how-to-upgrade-to-watchos-7-3-1\"> Cách nâng cấp lên WatchOS 7.3.1 </h2> <p> Đối với những người chưa gặp phải lỗi này, bạn vẫn nên nâng cấp lên phiên bản watchOS mới nhất chỉ để bảo vệ bản thân khỏi lỗi có thể xảy ra. </p> <p> Tầm quan trọng của việc sửa lỗi được chỉ ra bởi thực tế là Apple đã ngay lập tức tung ra watchOS 7.3.1 cho tất cả người dùng. Điều này trái ngược với cách mà nó thường phát hành các bản cập nhật phần mềm bằng cách cung cấp chúng ban đầu cho các nhà phát triển để thử nghiệm beta. <a href=\"https://www.makeuseof.com/watchos-7-3-new-watch-face-time-to-walk/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple phát hành watchOS 7.3 </a> vào cuối tháng Giêng. </p> <p> Người dùng có thể tải xuống watchOS 7.3.1 bằng ứng dụng Apple Watch trên iPhone. Để làm điều này, họ phải đi đến <strong> Chung&gt; Cập nhật phần mềm </strong> . Apple Watch của bạn cần có ít nhất 50 phần trăm pin để cập nhật. Nó cũng phải ở gần iPhone của bạn. </p>"}