{"title":"Microsoft phát hành ứng dụng Office mới cho iPad","content":"<p> Microsoft đã phát hành ứng dụng Office thống nhất cho máy tính bảng Apple. Với nó, Word, Excel và PowerPoint hiện có sẵn dưới dạng một bản tải xuống duy nhất trên iPhone và iPad trong <a href=\"https://apps.apple.com/app/microsoft-office/id541164041\" target=\"_blank\" rel=\"nofollow noopener\"> Cửa hàng ứng dụng </a> . Microsoft vẫn cung cấp các ứng dụng iPad này dưới dạng các bản tải xuống độc lập. </p> <h2 id=\"better-late-than-never\"> Muộn còn hơn không </h2> <p> &quot;Chúng tôi đang kết hợp các ứng dụng Word, Excel và PowerPoint mà bạn biết vào một ứng dụng duy nhất, được tối ưu hóa cho iPadOS&quot;, Microsoft viết trong ghi chú phát hành kèm theo bản tải xuống. Đây là một tin tuyệt vời nếu bạn sử dụng Office và muốn làm việc khi di chuyển. Đối với những người muốn <a href=\"https://www.makeuseof.com/make-ipad-feel-more-like-macbook/\" target=\"_blank\" rel=\"nofollow noopener\"> biến iPad của họ thành một máy tính xách tay thay thế </a> , đây là một bản phát hành quan trọng. </p> <p> Các ứng dụng này được cung cấp miễn phí, nhưng việc chỉnh sửa và chức năng nâng cao khác yêu cầu đăng ký Office 365. Đối với những người thắc mắc, Microsoft cung cấp các tùy chọn đăng ký trong ứng dụng khác nhau bắt đầu từ $ 6,99 mỗi tháng. </p> <p> Nếu bạn chỉ cần một bộ xử lý văn bản trên iPad của mình, thì tốt hơn là bạn nên xem xét các lựa chọn thay thế trong <a href=\"https://www.makeuseof.com/tag/word-processing-ipad-compare-best-apps/\" target=\"_blank\" rel=\"nofollow noopener\"> MUO&#39;s tổng hợp các ứng dụng xử lý văn bản tốt nhất cho iPad </a> . </p> <p> </p> <h2 id=\"a-unified-mobile-office-experience\"> Trải nghiệm văn phòng di động hợp nhất </h2> <p> Nói rõ hơn, đây là bản cập nhật cho Office dành cho iOS hiện có, không phải bản phát hành hoàn toàn mới. Các <a href=\"https://www.makeuseof.com/tag/try-microsoft-office-for-mobile/\" target=\"_blank\" rel=\"nofollow noopener\"> ứng dụng Office tất cả trong một ra mắt lần đầu tiên trên iPhone </a> và Android vào tháng 2 năm 2020. Không rõ điều gì đã khiến Microsoft mất cả năm để thêm các phiên bản Word, Excel và PowerPoint được tối ưu hóa cho iPad vào hỗn hợp, nhưng muộn còn hơn không. </p> <p> </p> <p> Trước ngày hôm nay, các ứng dụng năng suất có trong bộ này đã cung cấp trải nghiệm phụ trên iPad vì chúng thường chạy ở chế độ cửa sổ. Nhưng với bản cập nhật mới nhất hiện có, khách hàng của Apple giờ đây có thể có trải nghiệm Office nguyên bản trên iPhone, iPad hoặc iPod touch của họ bất kể kích thước màn hình. </p> <p> </p> <h2 id=\"ipad-specific-features\"> Các tính năng dành riêng cho iPad </h2> <p> Microsoft đã thường xuyên bổ sung các tính năng mới, được tối ưu hóa cho máy tính bảng vào các dịch vụ Office di động của mình. Ví dụ: các phiên bản di động của Word, Excel và PowerPoint gần đây đã hỗ trợ các cử chỉ chuột và bàn di chuột. Các ứng dụng cũng hỗ trợ tính năng đa nhiệm song song Split View của iOS. </p> <p> Mặc dù các phiên bản Office dành cho thiết bị di động và máy tính để bàn không có tất cả các tính năng giống nhau, nhưng Office cho iOS mới mang đến một vài tính năng mới. Những điều này cho phép bạn thực hiện những việc như ký tài liệu bằng Apple Pencil hoặc ngón tay, nhanh chóng tạo tệp PDF từ tài liệu của bạn, chuyển đổi hình ảnh thành văn bản và bảng, v.v. </p> <p> </p> <p> Ngoài ra, giờ đây bạn có thể dễ dàng chèn ngày tháng, hình dạng, hình ảnh và ghi chú vào các tệp PDF. Đối với người dùng thành thạo, giờ đây họ có thể truy cập các hành động dựa trên hình ảnh của Office (như Tạo PPT, Tạo PDF, v.v.) thông qua menu Chia sẻ đa mục đích của iOS. &quot;Ngoài ra, nếu có bất kỳ ảnh chụp màn hình nào gần đây khi bạn mở ứng dụng Office, chúng sẽ hiển thị như một gợi ý để chuyển đổi sang PDF hoặc PPT&quot;, công ty lưu ý. </p> <p> Microsoft cũng sẽ thực hiện một số thay đổi đối với bộ Office dành cho Mac và Windows. Theo nhà sản xuất Windows, các bản cập nhật sắp tới cho Office dành cho máy tính để bàn vào năm 2021 sẽ có giấy phép vĩnh viễn, bên cạnh các cải tiến khác. </p>"}