{"title":"Microsoft ra mắt Azure Into Space Với Máy tính Không gian HPE &amp; # 039; s-2","content":"<p> Microsoft đang vươn ra ngoài rìa hành tinh để cung cấp các dịch vụ ngoài trái đất. Công ty sẽ làm việc với Hewlett Packard Enterprises để kết nối với PC trên Trạm vũ trụ quốc tế (ISS) thông qua nền tảng Azure. </p> <p> Spaceborne Computer-2 sẽ kết nối với Azure thông qua các trạm mặt đất của NASA và HPE, mang lại sức mạnh xử lý dữ liệu lớn cho trạm vũ trụ. </p> <h2 id=\"azure-heads-into-space\"> Azure tiến vào không gian </h2> <p> Như đã báo cáo trên <a href=\"https://azure.microsoft.com/en-us/blog/connecting-azure-to-the-international-space-station-with-hewlett-packard-enterprise/\" target=\"_blank\" rel=\"nofollow noopener\"> Blog Microsoft Azure </a> , Spaceborne Computer-2 (SBC-2) sẽ cung cấp cho các phi hành gia ISS những công nghệ gần giống với các đối tác trên cạn của họ. </p> <p> Hy vọng là nó giảm đáng kể thời gian truyền dữ liệu giữa ISS và Trái đất, cũng như giảm lượng băng thông cần thiết để xử lý và phân tích. </p> <blockquote> <p> Các phi hành gia và nhà thám hiểm không gian xứng đáng được tiếp cận với các công nghệ điện toán đám mây tốt nhất và quá trình xử lý tiên tiến ở ưu điểm vượt trội. Đôi khi việc phân tích cần phải được thực hiện ngay lập tức tại nơi mà mọi khoảnh khắc trôi qua đều có giá trị, và những lần khác thì phân tích phức tạp đến mức chỉ có thể thực hiện được với sức mạnh của đám mây siêu tỷ lệ. </p> </blockquote> <p> Spaceborne Computer-2 sử dụng hệ thống Edgeline Converged Edge của Hewlett Packard Enterprises, được &quot;thiết kế có chủ đích cho các môi trường cạnh khắc nghiệt&quot; và sẽ đưa hàng đống chức năng Azure lên ISS. </p> <p> Khi kết nối được thiết lập và hoạt động, SBC-2 sẽ cho phép nghiên cứu trong các lĩnh vực bao gồm mô hình thời tiết cho các sứ mệnh trên sao Hỏa trong tương lai, phân tích thực vật và thủy canh để hỗ trợ tăng trưởng thực phẩm và cây trồng trong không gian và hình ảnh y tế trên chính ISS (để hỗ trợ chăm sóc sức khỏe phi hành gia ). </p> <p> Tiến sĩ Mark Fernandez, Kiến trúc sư Giải pháp của Hệ thống Cạnh Hội tụ tại HPE và Điều tra viên chính của Máy tính Không gian-2, cho biết: </p> <blockquote> <p> Bằng cách kết hợp Máy tính Không gian-2 của HPE, dựa trên hệ thống HPE Edgeline Converged Edge cho khả năng tính toán biên tiên tiến và khả năng AI, với Microsoft Azure để kết nối với đám mây, chúng tôi đang cho phép những người thám hiểm không gian truyền liên tục các tập dữ liệu lớn đến và đi Earth và hưởng lợi từ trải nghiệm edge-to-cloud </p> </blockquote> <p> </p> <h2 id=\"the-next-phase-of-microsoft-s-azure-space-initiative\"> Giai đoạn tiếp theo của Sáng kiến ​​không gian Azure của Microsoft </h2> <p> Thông báo của Microsoft là một bước tiến khác cho <a href=\"https://news.microsoft.com/azurespace/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft Azure Space </a> sáng kiến ​​mà nó đưa ra vào tháng 10 năm 2020. </p> <p> Sáng kiến ​​Azure Space là nỗ lực của Microsoft nhằm thực hiện &quot;bước nhảy vọt tiếp theo trong lĩnh vực điện toán đám mây&quot;, đưa nền tảng điện toán đám mây Azure của mình lên vũ trụ. </p> <p> </p> <p> Azure Space trước đây đã làm việc với dự án SpaceX Starlink để cung cấp băng thông rộng vệ tinh tới Trung tâm dữ liệu mô-đun Azure (MDC) và tiếp tục công việc của mình trong dự án Azure Orbital, dự án sẽ mở rộng kết nối giữa các trung tâm dữ liệu đám mây bằng công nghệ vệ tinh. </p>"}