{"title":"Microsoft đã cố gắng mua Pinterest, nhưng Thỏa thuận đã tắt ... Hiện tại","content":"<p> Microsoft gần đây đã tiếp cận Pinterest về một thỏa thuận tiếp quản tiềm năng có thể trở thành một trong những thương vụ mua lại lớn nhất từ ​​trước đến nay của Redmond. Hiện tại, các cuộc đàm phán vẫn chưa diễn ra sôi nổi, nhưng quy mô của việc sáp nhập được đề xuất tiếp tục đánh dấu kế hoạch tăng trưởng của Microsoft. </p> <h2 id=\"microsoft-wants-to-buy-pinterest\"> Microsoft muốn mua Pinterest </h2> <p> Theo báo cáo của <a href=\"https://www.ft.com/content/f88b8474-e791-4efb-a9f6-54c8222680fe\" target=\"_blank\" rel=\"nofollow noopener\"> Thời báo tài chính </a> , Microsoft đã cố gắng mua Pinterest, bảng ghim có sở thích lớn nhất thế giới. </p> <p> Pinterest hiện được định giá khoảng 51 tỷ đô la và giá trị thị trường của nó đã tăng hơn 600% trong suốt đại dịch COVID-19 khi mọi người truy cập trực tuyến trong thời gian khóa mạng. Tin tức về thương vụ tiếp quản tiềm năng đã đẩy cổ phiếu của Pinterest tăng 7% trước khi thị trường mở cửa vào thứ Năm ngày 11 tháng 2. </p> <p> Động thái này sẽ đưa Pinterest vào vị trí ngày càng phát triển ổn định của Microsoft về các vụ mua lại công nghệ lớn. Năm 2016, Microsoft mua lại LinkedIn trong một thỏa thuận trị giá 26 tỷ USD, tiếp theo là mua Github với giá 7,5 tỷ USD vào năm 2018. </p> <p> Đó là chưa kể đến việc Microsoft sở hữu Minecraft, đã mua 2,5 tỷ đô la vào năm 2014 và đang tiếp tục mua lại công ty cổ phần trò chơi lớn, ZeniMax, với giá 7,5 tỷ đô la. ZeniMax là công ty mẹ của các studio chơi game như Bethesda Softworks, id Software, Alpha Dog Games và Tango Gameworks. </p> <p> Hơn nữa, có một <a href=\"https://www.makeuseof.com/walmart-microsoft-bid-to-buy-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> không mua được TikTok&#39;s </a> Tài sản ở Bắc Mỹ, Úc và New Zealand vào giữa năm 2020. Thỏa thuận cuối cùng đã thất bại nhưng được định giá từ 20-30 tỷ đô la và đến sau khi cựu Tổng thống <a href=\"https://www.makeuseof.com/the-trump-administration-keeps-trying-to-ban-tiktok/\" target=\"_blank\" rel=\"nofollow noopener\"> Trump dọa cấm </a> mạng xã hội chia sẻ video hoàn toàn từ Hoa Kỳ. </p> <p> Nếu thỏa thuận với Pinterest được tiến hành hoặc thực sự, nếu nó hoàn tất vào một ngày sau đó, nó sẽ trở thành thương vụ mua lại lớn nhất của Microsoft cho đến nay. </p> <p> </p> <h2 id=\"why-is-microsoft-buying-up-so-many-tech-companies\"> Tại sao Microsoft lại mua nhiều công ty công nghệ đến vậy? </h2> <p> Microsoft không thiếu tiền mặt và muốn mở rộng đế chế của mình. Cổ phiếu của công ty đã tăng khoảng 80% kể từ khi bắt đầu đại dịch COVID-19 và gần đây đã tiết lộ mức lợi nhuận kỷ lục. </p> <p> </p> <p> Việc mua lại một nền tảng khác, như Pinterest, là một tấm vé thông hành dữ liệu cho các dịch vụ khác của Microsoft. Khối lượng dữ liệu tuyệt đối được tạo ra bởi các nền tảng như LinkedIn là công cụ hoàn hảo để đào tạo các công nghệ AI của nó. Hơn nữa, việc tiếp nhận và quản lý một dịch vụ trực tuyến khổng lồ như Pinterest cũng đóng vai trò như một quảng cáo cho nền tảng Azure của nó. </p> <p> Như báo cáo của Financial Times cũng ám chỉ, cuộc nói chuyện về một vụ sáp nhập khổng lồ như vậy giữa hai công ty công nghệ cũng sẽ khiến chính quyền của Tổng thống Biden phải thử thách. Liệu chính quyền mới có hài lòng khi cho phép những gã khổng lồ công nghệ như Microsoft, Google và Facebook mua lại đối thủ cạnh tranh không? Chỉ có thời gian mới trả lời được. </p>"}