{"title":"Trình duyệt Edge của Microsoft là máy chủ lưu trữ cho các trình giả lập trò chơi bí mật của Nintendo","content":"<p> Microsoft đã gỡ xuống một loạt trình giả lập trò chơi bất hợp pháp ẩn trên cửa hàng tiện ích mở rộng trình duyệt Microsoft Edge của mình. Cửa hàng tiện ích mở rộng Microsoft Edge có hàng chục trình giả lập, cho phép người dùng chơi một số trò chơi mang tính biểu tượng, không trò chơi nào được đăng lên cửa hàng một cách hợp pháp. </p> <h2 id=\"microsoft-removes-illegal-edge-extension-emulators\"> Microsoft loại bỏ trình giả lập tiện ích mở rộng cạnh bất hợp pháp </h2> <p> Ẩn mình trên cửa hàng tiện ích mở rộng Microsoft Edge là một số trò chơi mang tính biểu tượng nhất mọi thời đại, bao gồm Mario Kart 64, Super Mario Bros, Pac-Man, Tetris, Sonic The Hedgehog 2 và thậm chí cả Minecraft. Mỗi trò chơi được khởi chạy trong trình duyệt trong một cửa sổ giả lập và cho phép người dùng chơi toàn bộ từng tựa game. </p> <p> Tuy nhiên, không có tựa game cổ điển nào liệt kê các nhà phát triển trò chơi chính thức, chẳng hạn như Nintendo, Sega, Atari, và vâng - ngay cả Microsoft. Tên của nhà phát triển được liệt kê bao gồm Gamelands, Kday và StayReal, tất cả đều là hư cấu và không có liên kết với các nhà phát triển ban đầu. </p> <p> Thật kỳ lạ, tài khoản Twitter chính thức của Microsoft Edge Development, <a href=\"https://twitter.com/msedgedev\" target=\"_blank\" rel=\"nofollow noopener\"> @MSEdgeDev </a> , đã đăng về trình giả lập, xuất hiện để quảng cáo các trò chơi có sẵn trên cửa hàng tiện ích mở rộng của trình duyệt. Chúng tôi không bắt được tweet ban đầu quảng cáo trình giả lập, nhưng một bản sao có sẵn qua <a href=\"https://www.resetera.com/threads/microsoft-promotes-that-you-can-pirate-games-through-their-browser-for-some-reason.377748/\" target=\"_blank\" rel=\"nofollow noopener\"> Resetera </a> . </p> <p> <img alt=\"microsoft edge browser illegal emulator tweet\" src=\"images/microsoft-edge-browser-illegal-emulator-tweet-344.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"are-emulators-illegal\"> Trình giả lập có bất hợp pháp không? </h2> <p> <a href=\"https://www.makeuseof.com/tag/how-does-emulation-work/\" target=\"_blank\" rel=\"nofollow noopener\"> Trình giả lập cho phép bạn chạy các phần mềm khác nhau </a> trên máy tính của bạn. Bạn cũng có thể sử dụng trình giả lập để chơi các trò chơi cũ. </p> <p> Mặc dù bản thân các trình giả lập không phải là bất hợp pháp, nhưng việc tải xuống nội dung bản quyền để chơi trên một trình giả lập là không hợp pháp. Dòng tweet từ tài khoản Microsoft Edge Development chính thức là một động thái kỳ lạ khi trình giả lập tải xuống bản sao mới của ROM trò chơi để người dùng chơi. </p> <p> Chủ đề về đồ bỏ rơi cũng là một vùng xám. Trò chơi từ bỏ phần mềm không còn được xuất bản và không còn có sẵn để bán trực tuyến hoặc trong cửa hàng. Tuy nhiên, trong nhiều trường hợp, bản quyền của những trò chơi này vẫn chưa hết hạn, nhưng chủ sở hữu bản quyền không tích cực thực thi các quyền của mình. </p> <p> </p> <p> Trong nhiều trường hợp, phần mềm bỏ rơi là bất hợp pháp. Tuy nhiên, không có phiên tòa nào liên quan đến phần mềm bỏ rơi, hoặc ít nhất là không có vụ án nào liên quan đến việc một nhà phát triển trò chơi cũ truy tố ai đó vì đã tải xuống một tiêu đề phần mềm bỏ rơi. </p> <p> Trong ví dụ chính xác này, việc mô phỏng các trò chơi cũ này trong trình duyệt web là bất hợp pháp. Ngoài ra, Nintendo nổi tiếng với việc hạ gục bất kỳ trang web hoặc dịch vụ nào cố gắng sao chép hoặc phân phối lại tài sản trí tuệ của mình. </p> <p> Hiện tại, các trò chơi đã bị xóa khỏi cửa hàng tiện ích mở rộng Microsoft Edge. Hơn nữa, vẫn chưa biết làm thế nào mà các trò chơi giả lập lại xuất hiện trên cửa hàng tiện ích mở rộng hoặc ai đã đặt chúng ở đó. Không cần phải nói, họ không có khả năng quay trở lại. </p>"}