{"title":"Người đồng sáng lập Netflix chỉ trích chiến lược video + của Apple TV","content":"<p> Giám đốc cũ của Netflix, Marc Randolph, đã hạ thấp chiến lược video của Apple, nói rằng Apple TV + đang tụt hậu so với đối thủ do cung cấp miễn phí và thiếu nội dung hấp dẫn của công ty. </p> <h2 id=\"apple-not-in-streaming-with-both-feet\"> Apple không phát trực tuyến &quot;bằng cả hai chân&quot; </h2> <p> Nếu bạn hỏi cựu Giám đốc điều hành và đồng sáng lập Netflix Marc Randolph, Apple TV đã gặp phải vấn đề về kẻ ăn bám đã góp phần vào sự tăng trưởng thiếu hụt của dịch vụ so với Netflix, Disney + và các dịch vụ phát trực tuyến thành công khác. </p> <p> Đang nói chuyện với <a href=\"https://finance.yahoo.com/news/disney-is-emulating-the-netflix-playbook-for-streaming-netflix-co-founder-142230407.html\" target=\"_blank\" rel=\"nofollow noopener\"> Tài chính yahoo </a> , ông cho biết Apple TV + đang lãng phí năng lượng vào các chương trình khuyến mãi và các dịch vụ miễn phí trong khi đó nên tập trung vào việc bổ sung nhiều nội dung chất lượng hơn để nâng cao giá trị. </p> <blockquote> <p> Nếu Apple dành một phần tư thời gian cho nội dung như khi họ làm quà tặng thì họ thực sự có thể chơi. Họ không có lý do gì [và] họ vẫn không ở trong đó bằng cả hai chân. Họ thực sự phải làm điều kinh doanh và đi bộ đến rìa của vách đá và nhảy. </p> </blockquote> <p> Nhảy ra khỏi bờ vực có thể nói dễ hơn làm vì Apple TV + thiếu sức mạnh thị trường của Disney và sự công nhận thương hiệu của Netflix. Ngay bây giờ, tất cả về <a href=\"https://www.makeuseof.com/disney-plus-vs-netflix-best-value-for-money/\" target=\"_blank\" rel=\"nofollow noopener\"> Disney + so với Netflix </a> và dịch vụ phát trực tuyến nào mang lại giá trị đồng tiền tốt nhất cho khách hàng tiềm năng. </p> <p> </p> <h2 id=\"apple-tv-has-the-highest-churn-rate\"> Apple TV + có tỷ lệ churn cao nhất </h2> <p> Randolph đang chống lại các chương trình tặng quà và khuyến mãi trên thị trường phát trực tuyến, cho thấy rằng Apple TV + ‌ có &quot;tỷ lệ churn cao nhất&quot; trong số các dịch vụ chính. </p> <blockquote> <p> Bạn không thể tiếp tục thay thế mọi người. Bạn phải cho họ một lý do để ở lại. </p> </blockquote> <p> MoffettNathanson-HarrisX phát hiện ra rằng 29% những người đã đăng ký thông qua chương trình miễn phí không có kế hoạch đăng ký lại sau khi bản dùng thử miễn phí của họ hết hạn, theo báo cáo của <a href=\"https://variety.com/2021/digital/news/apple-tv-plus-freeloader-problem-percent-free-1234890385/\" target=\"_blank\" rel=\"nofollow noopener\"> Đa dạng </a> . </p> <p> </p> <h2 id=\"free-apple-tv-deals\"> Ưu đãi + Apple TV miễn phí </h2> <p> Apple đã cung cấp 12 tháng miễn phí dịch vụ Apple TV + cho tất cả những ai mua thiết bị mới đủ điều kiện từ công ty, chẳng hạn như iPhone mới. Trong luc đo, <a href=\"https://www.makeuseof.com/apple-tv-plus-extends-free-subscription-period-again/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple đã mở rộng đăng ký miễn phí kéo dài cả năm </a> hai lần cho những người đã đăng ký vào năm 2019. </p> <p> </p> <p> Đó là một tín hiệu rõ ràng, chính Apple cũng không tin rằng dịch vụ này cung cấp đủ nội dung để biện minh cho mức giá yêu cầu 5 USD / tháng. Hãy nhìn nó theo cách khác: Nếu Apple TV + vượt quá dự đoán nội bộ, thì Apple đã khoe khoang về số lượng người đăng ký. </p> <p> </p> <h2 id=\"disney-and-netflix-provide-serious-competition\"> Disney + và Netflix cung cấp sự cạnh tranh nghiêm túc </h2> <p> Chỉ mới 15 tháng trước, Apple TV + đã ra mắt lần đầu tiên vào tháng 11 năm 2019. Disney + đã tiếp nối ngay sau đó. Apple không tiết lộ Apple TV + có bao nhiêu người đăng ký trả phí nhưng Disney vừa vượt qua 94 triệu người đăng ký, vượt xa kỳ vọng của chính họ. </p> <p> Để so sánh, Netflix đã thống kê được 204 triệu khách hàng trả tiền vào cuối năm 2020. Disney hy vọng hãng có thể sánh ngang với Netflix về lượng người đăng ký chỉ trong 12 tháng. </p> <p> </p> <p> Randolph nói rằng Disney + đã &quot;chiến đấu để đạt được một vị trí thực sự vững chắc&quot; nhờ vào nội dung. &quot;Đó thực sự là một cuộc chiến xem ai là người chuẩn bị nội dung&quot;, anh ấy nói thêm. </p> <blockquote> <p> Chúng tôi đang thấy các quy tắc mới của trò chơi đang phát triển. Đây không chỉ là thông báo, đây không chỉ là có khuyến mãi --- cái bạn phải chứng minh là bạn có nội dung, nội dung, nội dung. </p> </blockquote> <p> Thật vậy, trò chơi là về nội dung. Ví dụ, như được nêu trong <a href=\"https://www.makeuseof.com/netflix-plans-for-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> kế hoạch của nó cho năm 2021 </a> , Netflix sẽ ra mắt một bộ phim gốc mới mỗi tuần trong suốt năm. Ngược lại, Apple TV + có một số bộ phim như bộ phim Greyhound về Thế chiến thứ hai do Tom Hanks đóng vai chính (dựa trên các sự kiện có thật), bộ phim truyền hình gốc Palmer với sự tham gia của Justin Timberlake và On The Rocks của Sofia Coppola. </p> <p> </p> <h2 id=\"apple-s-slow-burn-approach\"> Phương pháp tiếp cận ghi chậm của Apple </h2> <p> Điều mà Randolph không thừa nhận là Netflix và Disney + đã có một lượng lớn nội dung ngay từ ngày đầu trong khi Apple TV + đang xây dựng thư viện nội dung của mình từ đầu. </p> <p> Apple rõ ràng đã chọn cách tiếp cận cháy chậm, bằng chứng là sự khan hiếm các chương trình so với Disney + và Netflix. Dù nhìn thế nào đi nữa, chiến lược của hãng với Apple TV + dường như yêu cầu thu hút mọi người bằng các dịch vụ miễn phí với hy vọng dịch vụ tích lũy đủ nội dung chất lượng để chuyển đổi khách hàng miễn phí thành người đăng ký trả phí. </p>"}