{"title":"Nintendo xác nhận trưng bày trực tiếp tiếp theo của Nintendo","content":"<p> Nintendo đã công bố thông tin chi tiết về thời điểm diễn ra buổi giới thiệu Nintendo Direct tiếp theo và bạn sẽ không phải đợi lâu để có tin tức từ người tạo Mario. </p> <h2 id=\"nintendo-direct-reveals-forthcoming-presentation-date\"> Nintendo Direct tiết lộ Ngày trình chiếu sắp tới </h2> <p> Bạn muốn biết Nintendo đã lên kế hoạch gì cho năm tới? Trong trường hợp đó, bạn sẽ cần phải theo dõi buổi giới thiệu Nintendo Direct tiếp theo và nghe từ họ. </p> <p> Nintendo Direct tiếp theo sẽ diễn ra vào ngày 17 tháng 2, như đã được xác nhận trong một tweet từ Nintendo của Mỹ. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Dò vào 2/17 lúc 2 giờ chiều PT cho một <a href=\"https://twitter.com/hashtag/NintendoDirect?src=hash&ref_src=twsrc%5Etfw\"> #NintendoDirect </a> phát trực tiếp với khoảng 50 phút thông tin tập trung vào các trò chơi có sẵn như Super <a href=\"https://twitter.com/hashtag/SmashBrosUltimate?src=hash&ref_src=twsrc%5Etfw\"> #SmashBrosUltim </a> và các trò chơi sắp tới <a href=\"https://twitter.com/hashtag/NintendoSwitch?src=hash&ref_src=twsrc%5Etfw\"> #NintendoSwitch </a> vào nửa đầu năm 2021. <a href=\"https://t.co/fbG3hEtD0Q\"> https://t.co/fbG3hEtD0Q </a> <a href=\"https://t.co/w8J6lbdIkQ\"> pic.twitter.com/w8J6lbdIkQ </a></p> - Nintendo của Mỹ (@NintendoAmerica) <a href=\"https://twitter.com/NintendoAmerica/status/1361676737730519042?ref_src=twsrc%5Etfw\"> Ngày 16 tháng 2 năm 2021 </a></blockquote>  <p> Nếu bạn muốn có tin tức mới nhất từ ​​Nintendo, hãy theo dõi <a href=\"https://www.nintendo.com/nintendo-direct/02-17-2021/\" target=\"_blank\" rel=\"nofollow noopener\"> Trang Nintendo Direct tại nintendo.com </a> , từ 17:00 ET (14:00 theo giờ PT, 22:00 GMT). </p> <p> </p> <h2 id=\"what-will-nintendo-reveal-at-nintendo-direct\"> Nintendo sẽ tiết lộ điều gì tại Nintendo Direct? </h2> <p> Nói chung là không thể nói Nintendo có những gì để đưa ra một thông báo. Có khả năng sẽ có một chút tin tức về trò chơi, đặc biệt là khi nhượng quyền thương mại Zelda sắp kỷ niệm 35 năm thành lập. </p> <p> Cho rằng <a href=\"https://www.makeuseof.com/nintendo-switch-bestselling-console-2020/\" target=\"_blank\" rel=\"nofollow noopener\"> Switch và Switch Lite là bảng điều khiển cực kỳ phổ biến ở Hoa Kỳ </a> , tin tức có thể sẽ tập trung xung quanh các bảng điều khiển hiện tại đó và các tiêu đề có sẵn cho chúng. </p> <p> Nếu bạn đang hy vọng một thông báo liên quan đến bảng điều khiển Switch tiếp theo, thì bạn không được nín thở. Nintendo vẫn kiên quyết giữ kín về tương lai của bảng điều khiển Switch và liệu nó có một cái mới trên đường chân trời hay không. </p> <p> </p> <h2 id=\"keep-up-to-date-with-nintendo-news\"> Cập nhật tin tức Nintendo </h2> <p> <img alt=\"Nintendo Switch Family Membership Header\" src=\"images/nintendo-switch-family-header-378.jpg\" loading=\"lazy\"> </p> <p> Nintendo Direct là cách của Nintendo để cung cấp cho cơ sở người hâm mộ trung thành của mình những tin tức cập nhật nhất về thương hiệu. Vì vậy, cho dù bạn có Switch, Switch Lite hay thậm chí là toàn bộ bộ sưu tập máy chơi game Nintendo, hãy nhớ điều chỉnh. </p>"}