{"title":"Bộ điều khiển PS4 không hoạt động? Cách khắc phục các vấn đề phổ biến nhất","content":"<p> Hầu hết thời gian, bộ điều khiển PlayStation 4 của bạn có thể hoạt động tốt. Nhưng khi DualShock 4 của bạn ngừng kết nối hoặc ngắt kết nối ngẫu nhiên, điều đó thật khó chịu. </p> <p> Hãy xem các bản sửa lỗi khi bộ điều khiển PS4 của bạn không hoạt động, để bạn có thể quay lại chơi. </p> <h2 id=\"ps4-controller-won-t-pair-or-connect\"> Bộ điều khiển PS4 sẽ không ghép nối hoặc kết nối </h2> <p> Thông thường, khi bạn nhấn <strong> Nút PS </strong> trên bộ điều khiển của bạn, nó sẽ bật và kết nối với hệ thống của bạn. Tuy nhiên, khi nó không kết nối, thay vào đó, bạn sẽ thấy thanh đèn trên bộ điều khiển của mình nhấp nháy một chút, sau đó tắt. </p> <p> <img alt=\"PS4 Controller Light Flashing\" src=\"images/ps4-controller-light-flashing-473.jpg\" loading=\"lazy\"> </p> <p> Điều này thường xảy ra nếu bạn đã sử dụng DualShock 4 của mình với một thiết bị khác. Ví dụ, nếu bạn <a href=\"https://www.makeuseof.com/tag/how-to-use-the-ps4-controller-on-your-mac-or-pc/\" target=\"_blank\" rel=\"nofollow noopener\"> ghép nối bộ điều khiển PS4 với PC của bạn </a> hoặc bảng điều khiển của bạn bè, nó sẽ ghi nhớ thiết bị đó về sau. </p> <p> Bạn sẽ cần ghép nối lại DualShock 4 với PS4 của riêng mình trong những trường hợp này. Để thực hiện việc này, hãy kết nối bộ điều khiển của bạn với PS4 bằng cáp micro-USB. Đảm bảo rằng bạn đang sử dụng cáp chất lượng cao mà bạn biết là hoạt động bình thường. </p> <p> </p> <p> Nhấn nút <strong> Nút PS </strong> trên bộ điều khiển của bạn trong giây lát và đèn sẽ nhấp nháy một thời gian ngắn trước khi chuyển sang màu xanh lam. Điều này có nghĩa là bộ điều khiển của bạn đã ghép nối và kết nối thành công. </p> <p> Nếu bạn đã ghép nối DualShock 4 với một thiết bị khác gần đó, chẳng hạn như điện thoại hoặc PlayStation 5, việc này có thể sẽ bật và kết nối bộ điều khiển với thiết bị đó. Do đó, bạn nên tắt và rút phích cắm của bất kỳ thiết bị nào mà bạn kết nối DualShock 4 trước tiên. </p> <p> Sau khi ghép nối lại bộ điều khiển, bạn có thể ngắt kết nối cáp USB và sử dụng bộ điều khiển không dây như bình thường. PS4 của bạn sẽ ghi nhớ nó cho đến khi bạn ghép nối bộ điều khiển với một thiết bị khác trong tương lai. </p> <p> Hãy nhớ rằng số bộ điều khiển DualShock 4 tối đa mà bạn có thể kết nối với PS4 cùng một lúc là bốn. Nếu bạn đã kết nối bốn bộ điều khiển, bạn sẽ cần ngắt kết nối một bộ điều khiển để nhường chỗ cho nhiều bộ điều khiển hơn. </p> <p> <img alt=\"PS4 Two Controllers\" src=\"images/ps4-two-controllers-410.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"ps4-controller-keeps-disconnecting\"> Bộ điều khiển PS4 luôn ngắt kết nối </h2> <p> Nếu DualShock 4 của bạn ngắt kết nối ngẫu nhiên trong khi chơi, có một số biện pháp khắc phục bạn có thể thử. </p> <p> Trước tiên, hãy đảm bảo rằng bộ điều khiển của bạn đã được sạc pin. Nghe có vẻ đơn giản, nhưng nếu pin trong bộ điều khiển của bạn gần hết, nó có thể bị ngắt kết nối. Để kiểm tra tuổi thọ pin bộ điều khiển của bạn, hãy giữ <strong> Nút PS </strong> để hiển thị Menu nhanh ở bên trái màn hình. Bạn sẽ thấy biểu tượng bộ điều khiển với màn hình hiển thị pin ở dưới cùng. </p> <p> <img alt=\"PS4 Quick Menu Battery Level\" src=\"images/ps4-quick-menu-battery-level-435.jpg\" loading=\"lazy\"> </p> <p> Cắm bộ điều khiển của bạn vào PS4 và truy cập lại Menu nhanh để đảm bảo bạn thấy hình ảnh động sạc pin. Sau khi bộ điều khiển của bạn sạc một lúc, hãy thử sử dụng nó như bình thường. </p> <p> Nếu pin không phải là vấn đề của bạn, hãy đảm bảo rằng bạn không cố gắng sử dụng bộ điều khiển quá xa hệ thống của mình. Phạm vi Bluetooth điển hình là khoảng 30 feet; tùy thuộc vào thiết lập của bạn, bạn có thể sử dụng bộ điều khiển của mình xa hơn mức này hoặc bị hạn chế sử dụng bộ điều khiển gần hơn. </p> <p> Nói về điều này, bạn nên cố gắng giảm thiểu sự can thiệp giữa bộ điều khiển và bảng điều khiển của bạn. Loại bỏ bất kỳ vật kim loại nào giữa hai thiết bị, chẳng hạn như giá đỡ hoặc máy tính xách tay, có thể cản trở tín hiệu. Bạn cũng nên mang PS4 của mình ra khỏi bất kỳ không gian kín nào mà nó có để truyền và nhận tín hiệu tốt hơn. </p> <p> Cuối cùng, hãy nhớ rằng PS4 có cài đặt tắt bộ điều khiển sau khi chúng không hoạt động trong một thời gian. Nếu bạn không muốn bộ điều khiển PS4 của mình tắt khi bạn đang xem các ứng dụng đa phương tiện như YouTube, hãy truy cập <strong> Cài đặt&gt; Cài đặt tiết kiệm điện&gt; Đặt thời gian cho đến khi bộ điều khiển tắt </strong> và lựa chọn <strong> Không bao giờ </strong> . Lưu ý rằng điều này sẽ sử dụng hết pin ngay cả khi bạn không sử dụng. </p> <p> <img alt=\"PS4 Never Turn Off Controller\" src=\"images/ps4-never-turn-off-controller-241.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"general-tips-for-fixing-a-playstation-4-controller\"> Mẹo chung để sửa chữa bộ điều khiển PlayStation 4 </h2> <p> Chúng tôi đã xem xét các bản sửa lỗi cụ thể cho một số sự cố DualShock 4 phổ biến ở trên. Tiếp theo, chúng ta hãy xem xét các giải pháp chung hơn cho các vấn đề với bộ điều khiển PS4. Đi qua những điều này nếu bạn cần thêm trợ giúp. </p> <h3 id=\"restart-your-console\"> 1. Khởi động lại bảng điều khiển của bạn </h3> <p> Mặc dù hầu hết các vấn đề về bộ điều khiển đều xuất phát từ chính bộ điều khiển, nhưng có khả năng PS4 của bạn đang gặp sự cố. Để loại trừ điều này, bạn nên khởi động lại bảng điều khiển của mình trước khi khắc phục sự cố thêm. </p> <p> Nếu bộ điều khiển của bạn hoạt động đủ để truy cập các menu, hãy giữ <strong> Nút PS </strong> để mở Menu nhanh, sau đó đi tới <strong> Nguồn&gt; Khởi động lại PS4 </strong> để khởi động lại hệ thống của bạn. </p> <p> <img alt=\"turn off ps4 quick menu\" src=\"images/turn-off-ps4-quick-menu-842.png\" loading=\"lazy\"> </p> <p> Trong trường hợp bộ điều khiển của bạn không hợp tác, hãy nhấn và giữ <strong> Quyền lực </strong> trên bảng điều khiển PS4 của bạn cho đến khi bạn nghe thấy hai tiếng bíp. Thao tác này sẽ tắt hoàn toàn (không có đèn ở mặt trước) —sau khi tắt nguồn, hãy nhấn <strong> Quyền lực </strong> một lần nữa để bật lại. </p> <p> Hãy thử sử dụng lại bộ điều khiển của bạn sau khi khởi động lại và xem điều đó có hữu ích không. </p> <h3 id=\"forget-and-re-pair-your-ps4-controller\"> 2. Quên và Ghép nối lại Bộ điều khiển PS4 của bạn </h3> <p> Nếu bạn có bộ điều khiển PS4 thứ hai (hoặc bộ điều khiển PS Move), bạn có thể sử dụng bộ điều khiển đó để truy cập menu cho phép bạn xóa bộ điều khiển đang gặp sự cố. Hướng tới <strong> Cài đặt&gt; Thiết bị&gt; Thiết bị Bluetooth </strong> và chọn <strong> DualShock 4 </strong> mục nhập — đó là mục không có đèn xanh bên cạnh. </p> <p> <img alt=\"PS4 Forget Devices\" src=\"images/ps4-forget-devices-873.jpg\" loading=\"lazy\"> </p> <p> Trên menu kết quả, nhấn <strong> Tùy chọn </strong> trên bộ điều khiển của bạn và chọn <strong> Quên thiết bị </strong> . Điều này sẽ khiến PS4 của bạn xóa nó khỏi bộ nhớ, do đó bạn phải ghép nối lại nó một lần nữa. </p> <p> Đây là thời điểm tốt để thử một phương pháp ghép nối hơi khác: ghép nối lại khi khởi động. Để làm điều này, hãy tắt PS4 của bạn (như đã giải thích trước đó). Sau khi tắt, hãy kết nối bộ điều khiển có vấn đề với bảng điều khiển của bạn bằng cáp USB. Đánh vào <strong> Nút PS </strong> hy vọng bật và ghép nối bộ điều khiển của bạn trong một quá trình. </p> <p> Nếu cách này không hiệu quả, hãy bật lại PS4 của bạn và thử ghép nối nó theo cách bình thường, như trên. </p> <h3 id=\"hard-reset-your-controller\"> 3. Hard Reset Bộ điều khiển của bạn </h3> <p> Nếu việc tháo và ghép nối lại bộ điều khiển không hoạt động, tiếp theo, bạn có thể thử quy trình đặt lại đầy đủ cho DualShock 4. Bạn sẽ cần một vật nhọn nhỏ, như kẹp giấy uốn cong hoặc dụng cụ tháo thẻ SIM, để thực hiện việc này . </p> <p> Tắt PS4 của bạn, sau đó lật bộ điều khiển của bạn lên. Bạn sẽ thấy một lỗ nhỏ bên cạnh con vít của nút L2 (ở bên phải của bộ điều khiển khi lật ngược lại). Sử dụng công cụ nhọn của bạn để nhấn và giữ nút bên trong lỗ này trong khoảng năm giây. </p> <p> <img alt=\"PS4 Controller Reset Pinhole\" src=\"images/ps4-controller-reset-pinhole-296.jpg\" loading=\"lazy\"> </p> <p> Khi bạn đã thực hiện xong việc này, hãy kết nối lại bộ điều khiển với PS4 qua cáp USB và xem liệu nó có ghép nối thành công hay không. </p> <h3 id=\"try-the-controller-elsewhere\"> 4. Thử bộ điều khiển ở nơi khác </h3> <p> Tại thời điểm này, nếu chưa sử dụng, bạn nên thử sử dụng bộ điều khiển đang gặp sự cố với thiết bị khác. Nếu bạn gặp sự cố tương tự trên PS4 hoặc PC của bạn bè, thì bộ điều khiển của bạn có thể bị lỗi. </p> <p> Bạn cũng nên thử một bộ điều khiển PS4 khác với bảng điều khiển của bạn, nếu có thể. Nếu bạn mượn DualShock 4 của một người bạn mà bạn biết hoạt động bình thường và thấy rằng nó có vấn đề với hệ thống của bạn, có thể đã xảy ra sự cố với kết nối không dây PS4 của bạn. </p> <h3 id=\"use-the-controller-in-wired-mode\"> 5. Sử dụng Bộ điều khiển ở Chế độ có dây </h3> <p> Trước khi từ bỏ bộ điều khiển, bạn nên thử chơi với nó được kết nối vĩnh viễn qua cáp USB. Tuy nhiên, hãy nhớ rằng điều này chỉ hoạt động đối với kiểu bộ điều khiển PS4 đã sửa đổi. Bạn sẽ biết mình có mô hình này nếu có một thanh ánh sáng bên trong bàn di chuột ở mặt trước bộ điều khiển của bạn. Nếu không, bạn không thể bắt buộc giao tiếp có dây. </p> <p> Nếu bạn chưa có, hãy mua một dây cáp dài để bạn vẫn có thể chơi game từ ghế dài. Các <a href=\"https://www.amazon.com/10ft3Pack-Charging-Smartphone-Connection-Blackwhite/dp/B06XYH75NQ?crid=ULO355DP17FF&dchild=1&keywords=10+foot+micro+usb+cable&qid=1612818801&sprefix=10+foot+micro+usb+%2Caps%2C179&sr=8-3&linkCode=ll1&tag=makeusw-20&linkId=d21d4e17b723b91a40eea5575a3d1179&language=en_US&ref_=as_li_ss_tl\" target=\"_blank\" rel=\"nofollow noopener\"> Ailun ba gói </a> cáp micro-USB dài 10 feet là một lựa chọn hiệu quả về chi phí. </p> <p> Để buộc PS4 của bạn kết nối bộ điều khiển qua USB, hãy đi tới <strong> Cài đặt&gt; Thiết bị&gt; Bộ điều khiển&gt; Phương thức giao tiếp </strong> và lựa chọn <strong> Sử dụng cáp USB </strong> . Điều này sẽ ngăn DualShock 4 sử dụng Bluetooth, ngay cả khi được kết nối qua USB. </p> <p> <img alt=\"PS4 Use USB Cable Communication\" src=\"images/ps4-use-usb-cable-communication-317.jpg\" loading=\"lazy\"> </p> <p> </p> <h2 id=\"dualshock-4-hardware-fix-options\"> Tùy chọn sửa chữa phần cứng DualShock 4 </h2> <p> Giống như hầu hết phần cứng, bộ điều khiển DualShock 4 được bảo hành một năm. Nếu bạn đã mua bộ điều khiển PS4 của mình trong năm ngoái và không thể sửa nó bằng tất cả các mẹo trên, bạn nên truy cập <a href=\"https://support.playstation.com/s/repair-services?language=en_US\" target=\"_blank\" rel=\"nofollow noopener\"> Trang Sửa chữa &amp; Thay thế PlayStation </a> để yêu cầu sửa chữa trên bộ điều khiển của bạn. </p> <p> Nếu không, bạn có thể tự mình sửa lỗi phần cứng bằng cách mở bộ điều khiển. Nhưng tùy thuộc vào vấn đề cụ thể, điều này có thể khó hoặc không thể. Chúng tôi khuyên bạn nên nói chuyện với kỹ thuật viên sửa chữa địa phương nếu bạn không cảm thấy thoải mái khi tự mình làm việc này. </p> <p> </p> <h2 id=\"ps4-controller-issues-patched-up\"> Vấn đề về bộ điều khiển PS4, đã được vá </h2> <p> Bây giờ bạn đã biết cách khắc phục các sự cố bộ điều khiển PS4 phổ biến nhất. Các vấn đề cụ thể hơn, chẳng hạn như một nút ngừng hoạt động, không may nằm trong các giải pháp sửa chữa phần cứng được đề cập ở trên. </p> <p> Hy vọng rằng sự cố của bạn có thể dễ dàng khắc phục. Nhưng nếu không, và bạn cần chọn một bộ điều khiển PS4 mới, bạn có rất nhiều lựa chọn tuyệt vời. </p> <p> <small> Tín dụng hình ảnh: Joeri Mostmans / <a href=\"https://www.shutterstock.com/image-photo/brecht-belgium-march-28-2019-portrait-1519459631\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}