{"title":"Parler trực tuyến trở lại sau một tháng ngừng hoạt động","content":"<p> Sau khi bị Big Tech đóng cửa, Parler cuối cùng đã xuất hiện trở lại trên web. Nền tảng &quot;tự do ngôn luận&quot; hiện có thể truy cập được đối với người dùng hiện tại và sẽ sớm bắt đầu chấp nhận đăng ký người dùng mới trong những tuần tới. </p> <h2 id=\"parler-reemerges-after-big-tech-blackout\"> Parler tái sinh sau khi công nghệ lớn ngừng hoạt động </h2> <p> Parler đã trở lại sau một thời gian dài vắng bóng. Mạng xã hội thay thế đã được thu hút bởi những người bảo thủ chính trị, và đã <a href=\"https://www.makeuseof.com/google-apple-amazon-give-parler-boot/\" target=\"_blank\" rel=\"nofollow noopener\"> được khởi động bởi Amazon Web Services (AWS), Google và Apple </a> sau cuộc bạo loạn Capitol. Parler bị cáo buộc đã không làm đủ để kiểm duyệt nội dung bạo lực, dẫn đến việc nó bị xóa khỏi các cửa hàng ứng dụng và web. </p> <p> Thay cho AWS, Parler hiện đang sử dụng một máy chủ có tên là SkySilk. Trang web cũng đã đăng ký tên miền của mình với Epik, một công ty đăng ký phục vụ cho các loại mạng &quot;tự do ngôn luận&quot; khác như Gab. </p> <p> Công ty đăng ký tên miền và máy chủ lưu trữ mới không phải là những thay đổi duy nhất mà Parler đã thực hiện — Parler thậm chí đã tái xuất hiện với một Giám đốc điều hành tạm thời mới. Điều này đến sau <a href=\"https://www.makeuseof.com/parler-board-fires-ceo-john-matze/\" target=\"_blank\" rel=\"nofollow noopener\"> nhóm Parler bị cáo buộc đã sa thải người đồng sáng lập John Matze </a> . </p> <p> Mark Meckler sẽ tạm thời thay thế Matze ở vị trí Giám đốc điều hành, và trước đó là người đồng sáng lập nhóm Những người yêu nước đảng cánh hữu. Trong một tuyên bố thu được bởi <a href=\"https://thehill.com/policy/technology/538872-parler-announces-official-relaunch-says-it-is-back-online\" target=\"_blank\" rel=\"nofollow noopener\"> Đồi </a> , Meckler thông báo về sự trở lại được mong đợi từ lâu của Parler, nói: </p> <blockquote> <p> Khi Parler bị thực hiện ngoại tuyến vào tháng 1 bởi những người mong muốn khiến hàng chục triệu người Mỹ im lặng, nhóm của chúng tôi đã cùng nhau cố gắng, quyết tâm giữ lời hứa với cộng đồng gắn bó cao của mình rằng chúng tôi sẽ trở lại mạnh mẽ hơn bao giờ hết. Chúng tôi rất vui mừng được chào đón mọi người trở lại. </p> </blockquote> <p> Meckler tiếp tục, lưu ý rằng Parler sẽ vẫn dành riêng cho &quot;tự do ngôn luận, quyền riêng tư và đối thoại dân sự.&quot; Ông cũng trấn an người dùng rằng &quot;Parler đang được điều hành bởi một đội ngũ giàu kinh nghiệm và ở đây để ở lại.&quot; </p> <p> Mặc dù các tài khoản cũ hơn trên nền tảng đã được sao lưu, nhưng các bài đăng cũ hơn (hoặc &quot;bài viết&quot;) vẫn chưa được khôi phục. Nếu bạn đã có tài khoản trên Parler, bạn có thể tiếp tục sử dụng trang web. Nếu không, bạn sẽ phải đợi khoảng một tuần cho đến khi bạn có thể đăng ký. </p> <p> Nhưng ngay cả khi bạn đã có tài khoản Parler, bạn có thể gặp một số khó khăn kỹ thuật khi sử dụng nền tảng này. Có vẻ như dịch vụ vẫn chưa được khôi phục hoàn toàn. </p> <p> </p> <h2 id=\"the-parler-app-still-remains-in-limbo\"> Ứng dụng Parler vẫn còn trong Limbo </h2> <p> Parler vẫn bị cấm trên Google Play Store và Apple App Store, điều này có thể gây tổn hại nghiêm trọng đến cơ sở người dùng của nó. Như hiện tại, nền tảng này có thể vẫn không khả dụng trên các thiết bị di động trong một khoảng thời gian không xác định. </p> <p> Nó có khả năng sẽ không thể quay lại Play Store hoặc App Store trừ khi nó thay đổi các chính sách kiểm duyệt của mình, đó là điều mà Parler có thể sẽ từ chối thực hiện. </p>"}