{"title":"Roku muốn suy nghĩ của bạn trên điều khiển từ xa có thể sạc lại của nó","content":"<p> Roku đang tuyển một số người tham gia Chương trình Quyền truy cập sớm của mình để thử nghiệm một điều khiển từ xa mới (được gọi là Roku Voice Remote Pro) có pin sạc. </p> <p> Đó là một ưu đãi trong thời gian giới hạn trong khi nguồn hàng vẫn còn, mặc dù bạn vẫn phải trả tiền cho điều khiển từ xa. </p> <h2 id=\"what-is-the-roku-voice-remote-pro\"> Điều khiển từ xa bằng giọng nói Roku Pro là gì? </h2> <p> </p><blockquote class=\"reddit-card\"> <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/?ref_source=embed&ref=share\"> Cuối cùng là một chiếc điều khiển từ xa có pin sạc </a> từ <a href=\"https://www.reddit.com/r/Roku/\"> Roku </a> </blockquote>  <p> Như lần đầu tiên được phát hiện bởi người dùng Kingtut206 trên <a href=\"https://www.reddit.com/r/Roku/comments/liezxf/finally_a_remote_with_a_rechargeable_battery/\" target=\"_blank\" rel=\"nofollow noopener\"> Reddit </a> , Roku đang tuyển người vào Chương trình Quyền truy cập sớm của mình để thử nghiệm một điều khiển từ xa mới có tên là Roku Voice Remote Pro. </p> <p> Điều khiển từ xa mới có pin sạc, công cụ tìm từ xa bị mất (ví dụ: bạn có thể nói &quot;Này Roku, tìm điều khiển từ xa của tôi&quot;), giọng nói rảnh tay và các nút tắt cá nhân cùng với các nút có thương hiệu tiêu chuẩn. </p> <p> Theo báo cáo của <a href=\"https://www.theverge.com/2021/2/15/22284484/roku-rechargeable-remote-testing-early-access-micro-usb\" target=\"_blank\" rel=\"nofollow noopener\"> The Verge </a> , điều khiển từ xa sạc qua micro-USB, thay vì USB-C vượt trội hơn nhiều. Có lẽ phản hồi thu thập được thông qua Chương trình Quyền truy cập sớm sẽ thừa nhận điều này. </p> <p> Việc tham gia chương trình chỉ là bằng lời mời, mặc dù vẫn chưa biết điều gì khiến bạn đủ tiêu chuẩn. </p> <p> Điều khiển từ xa có giá 29,99 USD và dự kiến ​​sẽ được giao hàng vào ngày 19 tháng 2 năm 2021. </p> <p> Chỉ 2.000 chiếc sẽ được bán và Roku sẽ thu thập phản hồi về trải nghiệm của bạn với điều khiển từ xa. Sau thời gian đó, chúng tôi có thể cho rằng điều khiển từ xa sẽ được tinh chỉnh trước khi có khả năng được đưa vào bán đại trà. </p>"}