{"title":"Báo cáo: Android 12 sẽ có chế độ một tay","content":"<p> Chúng ta đã chính thức đạt đến giai đoạn vòng đời của Android 11, khi những tin đồn về Android 12 bắt đầu xuất hiện đầy đủ. </p> <p> <a href=\"https://www.xda-developers.com/android-12-one-handed-mode-leak/\" target=\"_blank\" rel=\"nofollow noopener\"> Nhà phát triển XDA </a> đã báo cáo rằng Google đang làm việc trên chế độ một tay cho Android 12 sẽ giúp điều hướng xung quanh điện thoại bằng một tay dễ dàng hơn nhiều. Cho dù bạn có bàn tay to hay nhỏ, điều này có thể mở ra một cách hoàn toàn mới để tương tác với thiết bị Android của bạn. </p> <p> Tất nhiên, nhiều nhà sản xuất thiết bị và <a href=\"https://www.makeuseof.com/tag/opera-touch-android-one-handed-browsing/\" target=\"_blank\" rel=\"nofollow noopener\"> các nhà phát triển phần mềm đã giới thiệu các giải pháp để cải thiện khả năng sử dụng một tay </a> . Tuy nhiên, sẽ dễ chịu hơn nhiều khi sử dụng nó khi nó được tích hợp trực tiếp vào hệ điều hành. </p> <h2 id=\"android-12-s-one-handed-mode\"> Chế độ một tay của Android 12 </h2> <p> Theo báo cáo, Google đang có kế hoạch thêm tính năng một tay vào AOSP, đây là phiên bản mã nguồn mở của Android mà bất kỳ nhà xây dựng phần mềm nào cũng có thể sử dụng trong thiết bị của họ. Điều đó cũng có nghĩa là các OEM vẫn chưa phát triển chế độ một tay của riêng họ sẽ có một cách dễ dàng để triển khai tính năng này vào thiết bị của họ. </p> <p> Điều mà báo cáo không chỉ ra là liệu Google có yêu cầu các nhà sản xuất điện thoại sử dụng tính năng một tay của Android 12 hay không hay nó là tùy chọn. </p> <p> Vì vẫn còn quá sớm, chúng tôi không biết chính xác chế độ một tay của Android 12 sẽ hoạt động như thế nào. Nếu khả năng thêm các tính năng vào hệ điều hành trước đây của Google là bất kỳ dấu hiệu nào, chúng tôi hy vọng công ty sẽ làm tốt việc triển khai. Google có thể chọn thu nhỏ toàn bộ màn hình xuống một góc của thiết bị để dễ dàng truy cập. </p> <p> <img alt=\"Android Dark Mode\" src=\"images/android-dark-269.jpg\" loading=\"lazy\"> </p> <p> Báo cáo cũng chỉ ra rằng chế độ một tay của Android 12 sẽ có cách để kích hoạt nó bằng cách sử dụng chế độ ba nút truyền thống cùng với chế độ điều hướng cử chỉ mới hơn. </p> <p> Như đã đề cập, nhiều OEM điện thoại thông minh đã triển khai tính năng này vào phiên bản Android sửa đổi của riêng họ. Ví dụ, Huawei thực sự đã cố gắng gửi phiên bản tính năng của mình lên AOSP, nhưng Google đã từ chối. Có lẽ Google đã từ chối nó vì công ty biết rằng họ có ý định đưa phiên bản tính năng của riêng mình vào. </p> <p> Vì sự rò rỉ này quá sớm nên vẫn chưa có hình ảnh nào chứng minh tính năng này, vì vậy chúng ta sẽ phải đợi cho đến khi Android 12 gần hơn với bản phát hành. </p> <p> </p> <h2 id=\"when-will-android-12-be-released\"> Khi nào Android 12 sẽ được phát hành? </h2> <p> Đáng buồn thay, chúng tôi không biết chính xác khi nào Android 12 sẽ ra mắt công chúng (mặc dù sẽ không lâu nữa). Chúng tôi cũng không biết chính xác khi nào tính năng này sẽ ra mắt cho các nhà phát triển hoặc cho các bản phát hành Android Beta hoặc Ổn định. </p> <p> Như mọi khi xảy ra với các tính năng mới của Android, chúng ta sẽ phải chờ xem liệu nó có xuất hiện trên hệ điều hành hay không. </p>"}