{"title":"Máy ảnh Sony FX3 bị rò rỉ qua Twitter","content":"<p> Chỉ mới hai tuần kể từ khi Sony công bố phát hành Sony A1, một chiếc máy ảnh 8.6K có thể chụp ảnh 50MP với tốc độ lên đến 30 khung hình / giây. Nhưng có phải công ty đang khuấy động thêm một chút gì đó không? </p> <p> Tất cả những gì chúng ta có lúc này chỉ là suy đoán, nhưng Sony có thể sẽ bổ sung một chiếc máy ảnh nhỏ gọn và kiểu dáng đẹp mới vào dòng FX của mình. </p> <h2 id=\"a-preview-of-the-sony-fx3\"> Bản xem trước của Sony FX3 </h2> <p> Vào thứ Tư, Nokishita đã tweet một hình ảnh của Sony FX3, một chiếc máy ảnh có thể đang tìm cách thách thức EOS C70 của Canon và Pocket Cinema 6K của Blackmagic Design. </p> <p> </p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\"> ソ ニ ー FX3 の 画像。 <a href=\"https://twitter.com/hashtag/%E5%99%82?src=hash&ref_src=twsrc%5Etfw\"> # 噂 </a> <a href=\"https://t.co/bumC1NwmCA\"> pic.twitter.com/bumC1NwmCA </a></p> - 軒 下 デ ジ カ メ 情報 局 (@nokishita_c) <a href=\"https://twitter.com/nokishita_c/status/1359623975278583808?ref_src=twsrc%5Etfw\"> Ngày 10 tháng 2 năm 2021 </a></blockquote>  <p> Nokishita là một blog công nghệ của Nhật Bản nổi tiếng với những rò rỉ sớm, chính xác về thiết bị hình ảnh và video sắp ra mắt. Mặc dù không phải là nguồn chính thức cho bất kỳ công ty sản xuất sản phẩm quang học nào, một số người nói rằng thông tin do Nokishita chia sẻ cũng có thể được xác nhận. </p> <p> <a href=\"https://www.techradar.com/news/leaked-sony-fx3-looks-like-it-could-be-a-sony-a1-for-pro-filmmakers\" target=\"_blank\" rel=\"nofollow noopener\"> TechRadar </a> từng gọi Nokishita là &quot;Ông già Noel của những tin đồn về máy ảnh.&quot; Đáp lại dòng tweet trên, người dùng Twitter @miemelaar đã hỏi &quot;[đây] đây là sự thật hay là một khái niệm?&quot; và @rauuru_san đã trả lời rằng &quot;nếu Nokishita xuất bản nó, đó là thỏa thuận thực sự.&quot; </p> <p> Nhưng ngay cả khi chúng ta cho rằng vụ rò rỉ là sự thật, thì liệu điều đó có thực sự để lại cho chúng ta bao nhiêu thông tin? </p> <p> Chúng ta có thể cho rằng FX3 là một phần của dòng FX vì tên của nó, nhưng máy ảnh mang một biểu tượng khiến nhiều nhà đầu cơ nhầm lẫn. Nếu dấu Alpha (α) màu trắng trên mặt trước của máy ảnh trông quen thuộc với bạn, đó là vì bạn có thể tìm thấy dấu này giống hệt trên máy ảnh không gương lật của Sony. </p> <p> Vậy FX3 có phải là máy ảnh cine, máy ảnh không gương lật hay một loại máy ảnh lai kiểu DSLR nào đó? Chúng tôi sẽ phải đợi để biết thêm thông tin chi tiết. Cho đến lúc đó, hãy cân nhắc đọc bài viết của chúng tôi về <a href=\"https://www.makeuseof.com/mirrorless-vs-dslr-vs-camcorder/\" target=\"_blank\" rel=\"nofollow noopener\"> sự khác biệt chính giữa máy ảnh không gương lật, máy ảnh DSLR và máy quay phim </a> . </p> <p> </p> <h2 id=\"what-will-the-sony-fx3-bring-to-the-table\"> Sony FX3 sẽ mang đến điều gì? </h2> <p> Kể từ khi dòng tweet của Nokishita bị loại bỏ, các thông số kỹ thuật sản phẩm bị cáo buộc của chiếc máy ảnh này đã được tung lên mạng. Tuy nhiên, chưa có gì từ bất kỳ nguồn nào có uy tín như nhau. </p> <p> Rất may, chúng ta nên tìm hiểu thêm về Sony FX3 trong những tuần tới. Sự kiện nhiếp ảnh lớn nhất của Nhật Bản, CP + 2021, sẽ diễn ra vào ngày 25-28 tháng 2 này. </p>"}