{"title":"Surface Duo có ngày phát hành tại Vương quốc Anh và giảm giá","content":"<p> Surface Duo của Microsoft không có được sự đón nhận phát hành tuyệt vời như vậy, nhưng có vẻ như công ty muốn tạo ấn tượng ban đầu tốt hơn bên ngoài Hoa Kỳ. Công ty không chỉ giảm giá Surface Duo mà còn có ngày phát hành được xác nhận cho thị trường Anh. </p> <h2 id=\"microsoft-s-final-overseas-preparations-for-the-surface-duo\"> Những bước chuẩn bị cuối cùng ở nước ngoài của Microsoft cho Surface Duo </h2> <p> Tin tức này đến với chúng tôi từ <a href=\"https://www.thurrott.com/mobile/android/247151/surface-duo-drops-to-999-heads-to-the-uk\" target=\"_blank\" rel=\"nofollow noopener\"> Thurrott.com </a> . Nếu bạn có thể nhớ, hồi Surface Duo ra mắt, <a href=\"https://www.makeuseof.com/first-surface-duo-reviews-not-good/\" target=\"_blank\" rel=\"nofollow noopener\"> nó không nhận được đánh giá tốt </a> . Một điểm mấu chốt chính là hệ điều hành của Duo gặp nhiều lỗi như thế nào, nhưng một điểm khác là mức giá hấp dẫn của nó ở mức 1399,99 USD. </p> <p> Microsoft đã rất nỗ lực trong việc khắc phục các vấn đề lớn mà những người đánh giá phát hiện ra, nhưng mức giá cao của nó vẫn ở nguyên vị trí cũ. Tuy nhiên, Microsoft đang có kế hoạch giảm giá đáng kể cho Surface Duo xuống còn 999,99 USD. </p> <p> Sự sụt giảm này có thể là để chuẩn bị cho việc phát hành ở nước ngoài, vì các nhà phê bình trên toàn thế giới chuẩn bị chia nhỏ Surface Duo từng inch. Với mức giá thấp hơn này, cộng với các bản sửa lỗi gần đây của hệ điều hành Surface Duo, kỳ quan màn hình kép có thể sẽ gây ấn tượng tích cực ở nước ngoài. </p> <p> Microsoft cũng đã xác nhận khi người hâm mộ Vương quốc Anh có thể dùng thử Surface Duo cho chính mình. Nếu bạn đang ở Vương quốc Anh, hãy theo dõi các nhà bán lẻ điện tử vào ngày 18 tháng 2 năm 2021. </p> <p> </p> <h2 id=\"scratching-the-surface-of-microsoft-s-plans-abroad\"> Làm xước bề mặt của các kế hoạch của Microsoft ở nước ngoài </h2> <p> Trong khi Surface Duo phải vật lộn để tạo ấn tượng tốt ở Mỹ, vẫn có thể có hy vọng cho nó ở nước ngoài. Với tất cả các bản sửa lỗi đối với hệ điều hành của Surface Duo kết hợp với việc giảm giá này, cỏ có thể sẽ xanh hơn ở phía bên kia. </p> <p> Nếu bạn muốn biết Microsoft đã thúc đẩy loại bản vá lỗi nào cho Surface Duo, công ty gần đây đã phát hành một số bản cập nhật ổn định để khắc phục các lỗi trước khi Duo ra mắt quốc tế. </p> <p> <small> Tín dụng hình ảnh: Jack Skeens / <a href=\"https://www.shutterstock.com/image-photo/shenzhen-china-15-october-2020-microsoft-1834095706\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}