{"title":"Twitter để gắn nhãn tài khoản cá nhân của các quan chức chính phủ","content":"<p> Twitter sẽ sớm bắt đầu đặt nhãn trên tài khoản cá nhân của các quan chức chính phủ. Các nhãn được cho là giúp người dùng dễ dàng xác định bất kỳ ai có liên quan đến chính phủ. </p> <h2 id=\"more-government-officials-will-get-a-label-on-twitter\"> Nhiều quan chức chính phủ sẽ được gắn nhãn trên Twitter </h2> <p> Theo một bài đăng trên <a href=\"https://blog.twitter.com/en_us/topics/company/2021/account-labels-phase2.html\" target=\"_blank\" rel=\"nofollow noopener\"> blog Twitter </a> , nền tảng sẽ bắt đầu gắn nhãn tài khoản cá nhân của &quot;nguyên thủ quốc gia&quot; vào ngày 17 tháng 2 năm 2021. Nó cũng sẽ gắn nhãn cho các tài khoản được liên kết với các phương tiện liên kết của nhà nước. </p> <p> Twitter cũng đang mở rộng phạm vi nhãn hàng của mình để phủ sóng các quan chức chính phủ ở nhiều quốc gia hơn. Các địa điểm này bao gồm Canada, Cuba, Ecuador, Ai Cập, Đức, Honduras, Indonesia, Iran, Ý, Nhật Bản, Ả Rập Saudi, Serbia, Tây Ban Nha, Thái Lan, Thổ Nhĩ Kỳ và Các Tiểu vương quốc Ả Rập Thống nhất. </p> <p> <img alt=\"Twitter government official label\" src=\"images/twitter-government-official-label-503.jpg\" loading=\"lazy\"> Tín dụng hình ảnh: Twitter </p> <p> Nền tảng hy vọng rằng những nhãn này sẽ giúp người dùng &quot;có trải nghiệm đầy đủ thông tin hơn trên Twitter&quot; và cũng có kế hoạch điều chỉnh văn bản của nhãn để &quot;thêm tính cụ thể&quot; bằng cách &quot;phân biệt giữa các cá nhân và tổ chức.&quot; </p> <p> Làn sóng nhãn đầu tiên của Twitter dành cho các tài khoản liên kết với chính phủ được triển khai vào tháng 8 năm 2020. Ban đầu, những nhãn này chỉ áp dụng cho các quan chức liên kết với năm quốc gia trong Hội đồng Bảo an Liên hợp quốc và không bao gồm tài khoản cá nhân của các quan chức đó. </p> <p> Điều đó nói rằng, những nhãn này không phải là <a href=\"https://www.makeuseof.com/twitter-launches-birdwatch-community-approach-misinformation/\" target=\"_blank\" rel=\"nofollow noopener\"> nói thẳng vào thông tin sai lệch </a> , nhưng chúng vẫn sẽ giúp người dùng có thêm ngữ cảnh về những gì họ đang đọc và nội dung đó đến từ ai. </p> <p> </p> <h2 id=\"twitter-will-only-continue-expanding-its-labels\"> Twitter sẽ chỉ tiếp tục mở rộng nhãn của nó </h2> <p> Vào cuối bài đăng trên blog của mình, Twitter lưu ý rằng họ hy vọng sẽ mở rộng nhãn hiệu của mình sang &quot;các quốc gia khác theo thời gian&quot;. Nhãn xuất hiện dưới dạng một lá cờ màu xám nhạt trên hồ sơ Twitter của một người và có khả năng bạn sẽ bắt gặp nó thường xuyên hơn trong những tuần tới. </p>"}