{"title":"Chính phủ Hoa Kỳ muốn biết về tính chính xác của nhãn bảo mật ứng dụng","content":"<p> Với nhãn Bảo mật ứng dụng iOS 14 trong App Store, Apple đang mang đến cho người dùng một cách mới để được trao quyền bằng cách có thêm kiến ​​thức về các ứng dụng mà họ sử dụng --- và cách các ứng dụng đó có thể theo dõi họ. </p> <p> Nhưng có vẻ như nó cũng có khả năng mở ra một thùng sâu cho chính nó, vì Apple hiện đang được thúc đẩy để xác nhận tính chính xác của các nhãn này, mà các nhà phát triển đã bắt đầu đệ trình lên Apple vào tháng 12. </p> <h2 id=\"concerns-over-accuracy\"> Mối quan tâm về độ chính xác </h2> <p> Theo ghi nhận của <a href=\"https://www.macrumors.com/2021/02/11/apple-app-store-privacy-labels-inquiry/\" target=\"_blank\" rel=\"nofollow noopener\"> MacRumors </a> , Apple đã nhận được một <a href=\"https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/Apple%20Letter%20re%20App%20Privacy%20Label%202-2021.pdf\" target=\"_blank\" rel=\"nofollow noopener\"> lá thư </a> từ Ủy ban Thương mại và Năng lượng Hạ viện Hoa Kỳ, yêu cầu Ủy ban này làm rõ thông tin về độ chính xác của nhãn Bảo mật ứng dụng do nhà phát triển cung cấp. </p> <p> Các nhãn này là một tính năng được mong đợi một cách háo hức trong một số phần tư, đáng sợ của iOS 14 sẽ buộc các nhà phát triển cởi mở hơn về cách ứng dụng của họ tương tác với dữ liệu người dùng. Điều đó có nghĩa là người dùng sẽ có thể đưa ra quyết định sáng suốt hơn khi nói đến lợi ích và hạn chế của việc sử dụng một số ứng dụng nhất định. </p> <p> </p> <p> Trong bức thư của mình, Ủy ban Thương mại và Năng lượng Hạ viện Hoa Kỳ hỏi Apple về các báo cáo đề xuất một số nhãn Bảo mật của Ứng dụng có thể cung cấp cho người dùng thông tin &quot;gây hiểu lầm và sai sự thật&quot;. Đó là dựa trên một báo cáo, được công bố vào tháng trước, tuyên bố rằng nhiều ứng dụng được đưa ra một hóa đơn sạch về sức khỏe có thể không hoàn toàn vô tội như họ đề xuất. </p> <p> Một vấn đề tiềm ẩn với tính năng iOS 14 là nó dựa vào sự trung thực của nhà phát triển để nói cách dữ liệu được thu thập, cũng như để xác nhận rằng thông tin này là chính xác. Bản thân Apple cũng lưu ý rằng thông tin này &quot;chưa được xác minh bởi Apple.&quot; </p> <p> </p> <h2 id=\"requesting-a-response-from-apple\"> Yêu cầu phản hồi từ Apple </h2> <p> Mặc dù có vẻ như hầu hết các nhà phát triển sẽ chơi công bằng và tuân theo hệ thống danh dự, nhưng đó không phải là điều có thể được coi là đương nhiên. Apple sẽ thường xuyên kiểm tra thông tin mà nó được gửi. Tuy nhiên, số lượng ứng dụng khổng lồ trong App Store khiến Apple không thể tự mình xác minh từng danh sách. </p> <p> Thư của Ủy ban Thương mại và Năng lượng Hạ viện Hoa Kỳ tiếp tục viết rằng: </p> <blockquote> <p> &quot;Chúng tôi kêu gọi Apple cải thiện tính hợp lệ của nhãn Bảo mật ứng dụng của mình để đảm bảo người tiêu dùng được cung cấp thông tin có ý nghĩa về các hoạt động dữ liệu ứng dụng của họ và người tiêu dùng không bị tổn hại bởi các hành vi lừa đảo tiềm ẩn này.&quot; </p> </blockquote> <p> Ủy ban đã yêu cầu Apple cung cấp thêm chi tiết về quy trình kiểm tra của mình, liệu nhãn App Privacy có được sửa chữa nếu bị phát hiện là không đúng sự thật hay không, chi tiết về điều gì sẽ xảy ra khi các nhà phát triển cung cấp thông tin không chính xác, v.v. </p> <p> Họ đang yêu cầu Apple phản hồi với thông tin được yêu cầu vào ngày 23 tháng 2. </p> <p> <small> Tín dụng hình ảnh: Jason Dent / <a href=\"https://unsplash.com/photos/JFk0dVyvdvw\" target=\"_blank\" rel=\"nofollow noopener\"> Hủy cắm CC </a></small> </p>"}