{"title":"Volkswagen sẽ sử dụng Microsoft Azure trong ô tô tự lái","content":"<p> Microsoft rất muốn tham gia vào thị trường xe hơi tự lái, nhưng họ không có bất kỳ chuyên môn nào trong việc thiết kế và chế tạo một chiếc xe hơi. Tuy nhiên, nó có thể cung cấp bộ não đằng sau một chiếc xe thông minh và Volkswagen quan tâm đến việc sử dụng các dịch vụ của Microsoft cho các phương tiện của chính mình. </p> <h2 id=\"microsoft-and-volkswagen-s-partnership-for-automatic-cars\"> Mối quan hệ đối tác của Microsoft và Volkswagen về Ô tô tự động </h2> <p> Tin tức về mối quan hệ đối tác này đã bùng nổ vào <a href=\"https://www.reuters.com/article/us-microsoft-volkswagen/volkswagen-taps-microsofts-cloud-to-develop-self-driving-software-idUSKBN2AB0SZ\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> . Volkswagen đang hợp tác với Microsoft để giúp họ thâm nhập vào thế giới xe hơi tự lái. </p> <p> Volkswagen thực sự sở hữu một số công ty xe hơi khác nhau, như Audi, Porshe và Lamborghini. Vấn đề là, các kỹ sư ở mỗi công ty đang chọn con đường riêng của họ để thiết kế một chiếc xe tự lái thay vì chia sẻ thông tin với nhau. </p> <p> Để giải quyết vấn đề này, Volkswagen đã đưa tất cả các kỹ sư xe tự lái của mình vào một nhóm lớn, gọi là Car.Software. Ý tưởng là cả nhóm có thể đoàn kết và tạo ra một nền tảng ô tô thông minh duy nhất mà Volkswagen có thể sử dụng cho tất cả các ô tô của mình. </p> <p> Tuy nhiên, hóa ra, các kỹ sư khác nhau trong Car.Software vẫn đang sử dụng các nền tảng khác nhau để phát triển mã của họ. Do đó, Volkswagen đã chuyển sang Microsoft để giúp cung cấp cho mọi người một nền tảng cơ bản để làm việc. </p> <p> Điều này không có nghĩa là ô tô của Volkswagen đang chạy Windows 10. Microsoft có một nền tảng khác có tên Azure, được thiết kế để kết nối các thiết bị Internet of Things (IoT). </p> <p> Nếu điều này nghe có vẻ quen thuộc, đó là vì cùng một dịch vụ <a href=\"https://www.makeuseof.com/microsoft-powered-self-driving-car/\" target=\"_blank\" rel=\"nofollow noopener\"> Microsoft đề nghị Cruise cho xe ô tô tự lái của mình </a> . Bây giờ rõ ràng rằng thỏa thuận Cruise không phải là một thỏa thuận một lần; Microsoft rất nghiêm túc trong việc đưa ô tô chạy trên Azure. </p> <p> Với việc Azure hoạt động tốt như thế nào đối với Microsoft, không có gì ngạc nhiên khi gã khổng lồ phần mềm muốn tấn công trong khi sắt còn nóng. Sự kết hợp giữa các dịch vụ Azure và Xbox của Microsoft đã <a href=\"https://www.makeuseof.com/microsoft-reveals-record-profits/\" target=\"_blank\" rel=\"nofollow noopener\"> đã mang lại cho công ty một khoản lợi nhuận nhỏ trong thời kỳ đại dịch </a> . </p> <p> Do đó, có một động lực rất lớn để đưa Azure lên ô tô tự lái để giúp nó hiện diện nhiều hơn nữa trong thế giới của các thiết bị thông minh. Về việc liệu Azure có trở thành một người chơi lớn trong thế giới xe hơi thông minh hay không vẫn chưa được xem xét. </p> <p> </p> <h2 id=\"starting-the-engine-for-microsoft-azure\"> Khởi động Công cụ cho Microsoft Azure </h2> <p> Microsoft Azure đã là một nhà sản xuất tiền khổng lồ cho gã khổng lồ công nghệ, điều đó có nghĩa là công ty có một vị trí hoàn hảo để mở rộng sang các lãnh thổ mới. Cả Cruise và xe tự lái của Volkswagen sẽ sử dụng Microsoft Azure làm nền tảng của họ, có thể trở thành một nhân tố quan trọng trong tương lai của ô tô. </p> <p> Trong một sự thay đổi kỳ quặc của số phận, sự cạnh tranh cũ giữa Microsoft và Apple đang lan rộng sang thế giới của những chiếc xe thông minh. Thay vì chỉ cung cấp cho các nhà sản xuất ô tô phần &quot;thông minh&quot;, Apple dự định đến năm 2024 sẽ sản xuất &quot;Apple Cars&quot; hoàn chỉnh. </p> <p> <small> Tín dụng hình ảnh: Andrey Suslov / <a href=\"https://www.shutterstock.com/image-vector/autonomous-smart-car-scans-road-operates-635238704\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}