{"title":"VW tuyên bố Apple đã giành được một chuyến đi dễ dàng trong ngành công nghiệp ô tô","content":"<p> Herbert Diess, giám đốc điều hành của Tập đoàn Volkswagen, đã hạ thấp bất kỳ tác động tiềm tàng nào của Apple Car đối với ngành công nghiệp ô tô, nói rằng VW &quot;không sợ&quot; Dự án Titan. </p> <h2 id=\"vw-not-afraid-of-an-apple-car\"> VW &quot;Không sợ&quot; Apple Car </h2> <p> Mặc dù Diess thừa nhận rằng một chiếc ô tô mang nhãn hiệu Apple thực sự có thể có ý nghĩa, nhưng ông không nghĩ rằng Apple có thể thống trị lĩnh vực sản xuất ô tô &quot;chỉ trong một đêm&quot; do sự cạnh tranh gay gắt. Cắt giảm thép và bán ô tô cho những người tiêu dùng khó tính là một công việc khó khăn để kinh doanh, ông gợi ý, thêm rằng đây không phải là lĩnh vực mà bất kỳ công ty nào cũng có thể &quot;tiếp quản trong một cú chạm&quot;. </p> <p> <a href=\"https://www.reuters.com/article/us-volkswagen-apple-idUSKBN2AE0GN\" target=\"_blank\" rel=\"nofollow noopener\"> Reuters </a> kể lại những gì Diess nói với Frankfurter Allgemeine Sonntagszeitung trong một cuộc phỏng vấn: </p> <blockquote> <p> Ngành công nghiệp xe hơi không phải là một lĩnh vực công nghệ điển hình mà bạn có thể tiếp quản chỉ trong một lần chạm. Apple sẽ không quản lý điều đó trong một sớm một chiều. Tuy nhiên, chúng tôi không sợ hãi. </p> </blockquote> <p> Tuy nhiên, một chiếc xe mang nhãn hiệu Apple sẽ có ý nghĩa với năng lực của Apple về pin, phần mềm, thiết kế công nghiệp và các nguồn lực dường như vô tận của nó, giám đốc điều hành nói thêm. Apple không cung cấp bất kỳ sản phẩm nào liên quan đến ô tô ngoài <a href=\"https://www.makeuseof.com/tag/apple-carplay-guide/\" target=\"_blank\" rel=\"nofollow noopener\"> Phần mềm bảng điều khiển CarPlay </a> điều đó cho phép radio trên xe hơi hoặc thiết bị đầu hoạt động như một màn hình hiển thị và một bộ điều khiển cho iPhone. </p> <p> </p> <h2 id=\"the-industry-s-worst-kept-secret\"> Bí mật tồi tệ nhất của ngành </h2> <p> Các kế hoạch cho Project Titan (tên mã nội bộ của Apple Car) vẫn chưa được công khai mặc dù có rất nhiều tin đồn gần đây cho biết <a href=\"https://www.makeuseof.com/apple-car-kia-us-production/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple đang tìm cách hợp tác với Hyundai / Kia </a> . </p> <p> <a href=\"https://www.makeuseof.com/apple-car-japan-suppliers/\" target=\"_blank\" rel=\"nofollow noopener\"> Apple được cho là đã nói chuyện với các công ty ô tô khác </a> và các nhà sản xuất hợp đồng --- bao gồm Magna, Nissan và Foxconn --- về việc chế tạo phương tiện lái tự động của mình. Các nguồn tin cho biết Apple Car có thể thiếu vô lăng vì ban đầu nó có thể <a href=\"https://www.makeuseof.com/apple-car-self-driving/\" target=\"_blank\" rel=\"nofollow noopener\"> tập trung vào giao thức ăn và hoạt động của robotaxi </a> trước khi bán cho người tiêu dùng. </p> <p> </p> <p> Điều rút ra lớn nhất từ ​​nhận xét của Herbert là ngành công nghiệp ô tô đã chú ý đến Dự án Titan. Rõ ràng, ý nghĩ về việc Apple bước vào lĩnh vực này đang khiến một số giám đốc điều hành hàng đầu lo lắng. Điều đó nói lên rằng, lịch sử đầy rẫy những người đáng lẽ phải biết rõ hơn là chế nhạo Apple vì đã đưa vào một danh mục sản phẩm mới. </p> <p> </p> <h2 id=\"how-palm-ceo-laughed-off-the-iphone\"> CEO Palm cười nhạo iPhone như thế nào </h2> <p> Ví dụ điển hình nhất là Ed Colligan, cựu Giám đốc điều hành Palm. Chỉ vài tuần trước khi giới thiệu iPhone đầu tiên vào năm 2007, Colligan đã bật cười ý tưởng rằng một công ty nổi tiếng với việc thiết kế những chiếc máy tính đẹp có thể giành được khách hàng trong lĩnh vực điện thoại thông minh cạnh tranh, nói rằng: </p> <blockquote> <p> Chúng tôi đã học hỏi và đấu tranh trong vài năm để tìm ra cách tạo ra một chiếc điện thoại tốt. Những người PC sẽ không chỉ tìm ra điều này. Họ sẽ không chỉ đi vào. </p> </blockquote> <p> Tương tự như cách Colligan mô tả Apple là &quot;những gã máy tính&quot;, ông chủ Volkswagen đang cố gắng hạ thấp quan điểm rằng một công ty công nghệ có thể giành được khách hàng trong lĩnh vực kinh doanh xe hơi. Lịch sử sẽ cho thấy liệu bình luận của Herbert sẽ có tuổi đời tốt hơn của Colligan. </p>"}