{"title":"MTA-STS là gì và nó bảo vệ email của bạn như thế nào?","content":"<p> Email là thủ phạm lớn nhất đằng sau hầu hết các cuộc tấn công mạng. Đây là điểm truy cập dễ dàng cho phần mềm độc hại, phần mềm quảng cáo, thư rác và lừa đảo, đồng thời cung cấp cơ hội vô hạn cho các tác nhân đe dọa nắm giữ thông tin cá nhân của bạn. </p> <p> Để giảm thiểu những mối đe dọa này, các biện pháp bảo mật nghiêm ngặt cần được áp dụng cho cả tài khoản email cá nhân và doanh nghiệp. </p> <h2 id=\"email-security-and-encryption\"> Bảo mật và Mã hóa Email </h2> <p> Bất chấp sự phổ biến của các phương thức liên lạc khác, tin nhắn email vẫn là hình thức dữ liệu lớn nhất được truyền đi đối với bất kỳ cá nhân hoặc tổ chức nào. Bảo mật nội dung email của bạn là một điều cần thiết. </p> <p> Bảo mật email đòi hỏi phải kiểm tra và mã hóa tất cả lưu lượng email đến và đi. Mã hóa đóng một vai trò quan trọng trong việc giữ nguyên vẹn tính riêng tư của nội dung email bằng cách đảm bảo các kết nối SMTP (Giao thức truyền thư đơn giản) an toàn. </p> <p> Cho đến gần đây, mã hóa chỉ là một yêu cầu tùy chọn cho SMTP. </p> <p> </p> <h2 id=\"how-does-email-encryption-work\"> Mã hóa Email hoạt động như thế nào? </h2> <p> Mã hóa email là một quá trình thêm mật mã hoặc đoạn mã vào nội dung thư của bạn làm cho nội dung thư không thể giải mã được. Bằng cách chuyển đổi dữ liệu email thành mã, nội dung được bảo vệ khỏi bị lộ trái phép. Nói một cách đơn giản, email của bạn bị xáo trộn. </p> <p> <img alt=\"Two different looking keys\" src=\"images/public-and-private-key-244.jpg\" loading=\"lazy\"> </p> <p> Như một biện pháp bảo mật bổ sung, quy trình mã hóa sử dụng các khóa công khai và riêng tư, nơi các khóa được mã hóa được trao đổi để khóa và mở khóa các email được mã hóa. Người gửi mã hóa email bằng mật mã khóa công khai và sau đó, người nhận sử dụng khóa riêng để giải mã tin nhắn đã nhận. </p> <p> Mã hóa được áp dụng cho toàn bộ hành trình của email, từ đầu đến cuối. Như một phương pháp hay nhất, tất cả các email đến và đi phải được mã hóa — không chỉ những email mang thông tin nhạy cảm. Điều này ngăn chặn các tác nhân đe dọa đạt được bất kỳ điểm xâm nhập nào vào hệ thống của bạn. </p> <p> </p> <h2 id=\"a-background-and-issues-with-smtp\"> Cơ sở và vấn đề với SMTP </h2> <p> Khi giao thức SMTP ra đời vào năm 1982, mã hóa email không phải là một thực tế phổ biến và theo mặc định, email được gửi và nhận ở dạng văn bản thuần túy. Để giới thiệu bảo mật ở cấp độ truyền tải, lệnh STARTTLS đã được thêm vào cuối những năm 1990, cung cấp tùy chọn mã hóa thông qua <a href=\"https://www.makeuseof.com/tag/common-email-security-protocols-explained/\" target=\"_blank\" rel=\"nofollow noopener\"> Giao thức TLS (Bảo mật lớp truyền tải) </a> . </p> <p> Như hứa hẹn khi nâng cấp TLS có vẻ như, nó vẫn để lại hai lỗ hổng bảo mật: </p> <ol> <li> Tùy chọn mã hóa chỉ là: <strong> không bắt buộc </strong> . Các email không an toàn vẫn tràn lan, khiến các cuộc tấn công mạng tăng đột biến. </li> <li> Ngay cả khi có STARTTLS, không có cách nào để xác thực danh tính của máy chủ của người gửi vì máy chủ SMTP không xác thực chứng chỉ. </li> </ol> <p> </p> <h2 id=\"the-arrival-of-mta-sts\"> Sự xuất hiện của MTA-STS </h2> <p> Vào năm 2019, Google cuối cùng đã bước lên thành công và công bố việc áp dụng tiêu chuẩn MTA-STS (Tác nhân chuyển thư / Bảo mật giao thông nghiêm ngặt) mới ( <a href=\"https://tools.ietf.org/html/rfc8461\" target=\"_blank\" rel=\"nofollow noopener\"> RFC8461 </a> ). </p> <p> Điều này cung cấp cho các nhà cung cấp dịch vụ thư khả năng áp đặt TLS để bảo mật kết nối SMTP và cũng cung cấp tùy chọn từ chối gửi email đến các máy chủ MX không cung cấp TLS với chứng chỉ máy chủ đáng tin cậy. </p> <p> MTA-STS cuối cùng cũng xử lý tất cả các vấn đề trước đây với SMTP bằng cách thực thi mã hóa giữa các máy chủ SMTP giao tiếp. Nhưng nó thực sự hoạt động như thế nào? Hãy cùng tìm hiểu! </p> <p> </p> <h2 id=\"how-does-mta-sts-work\"> MTA-STS hoạt động như thế nào? </h2> <p> <img alt=\"two mail servers sending email\" src=\"images/servers-sending-mail-251.jpg\" loading=\"lazy\"> </p> <p> MTA-STS hoạt động bằng cách hướng dẫn máy chủ SMTP chỉ giao tiếp với máy chủ SMTP khác trên hai điều kiện: </p> <ol> <li> Máy chủ SMTP <strong> phải </strong> được mã hóa. </li> <li> Tên miền trên chứng chỉ của máy chủ khớp với miền trong chính sách và chứng chỉ được cập nhật. </li> </ol> <p> Bằng cách sử dụng kết hợp DNS và HTTPS để xuất bản chính sách, MTA-STS thông báo cho bên gửi cách tiến hành nếu không thể bắt đầu một kênh liên lạc được mã hóa. </p> <p> Thật dễ dàng để triển khai MTA-STS ở phía người nhận nhưng đối với người gửi, một phần mềm máy chủ thư hỗ trợ như <a href=\"https://protonmail.com/\" target=\"_blank\" rel=\"nofollow noopener\"> ProtonMail </a><a href=\"https://pypi.org/project/postfix-mta-sts-resolver/\" target=\"_blank\" rel=\"nofollow noopener\"> </a> nên được sử dụng. </p> <p> </p> <p> </p> <h2 id=\"what-type-of-attacks-does-mta-sts-mitigate\"> MTA-STS Giảm nhẹ Loại Tấn công nào? </h2> <p> Các mối đe dọa sau đây sẽ đối mặt trực tiếp nếu MTA-STS được áp dụng cho liên lạc qua email của bạn: </p> <p> <strong> Các cuộc tấn công Man-In-The-Middle (MITM): </strong> Cuộc tấn công này được thực hiện khi kẻ tấn công xen vào giữa cuộc giao tiếp giữa hai bên để đánh cắp hoặc thay đổi dữ liệu. Trong trường hợp email, điều đó thường có nghĩa là hai máy chủ SMTP giao tiếp. Bằng cách sử dụng MTA-STS, các cuộc tấn công này có thể dễ dàng được ngăn chặn. </p> <p> <strong> Các cuộc tấn công hạ cấp: </strong> Tác nhân đe dọa buộc một kênh mạng chuyển sang chế độ truyền dữ liệu không an toàn. Ví dụ: cuộc tấn công này có thể chuyển hướng khách truy cập trang web từ phiên bản HTTPS của một trang web sang phiên bản HTTP. MTA-STS giúp chống lại các cuộc tấn công này bằng cách ngăn chặn mọi truy cập trái phép. </p> <p> <strong> Các cuộc tấn công giả mạo DNS: </strong> Những cuộc tấn công xảo quyệt này thay đổi bản ghi DNS của đích đến dự định của người dùng và đánh lừa họ tin rằng họ đang truy cập một trang web hoặc miền hợp pháp. Việc triển khai MTA-STS giúp giảm thiểu các cuộc tấn công này rất nhiều. </p> <p> </p> <p> Bây giờ chúng ta đã quen thuộc với MTA-STS, đã đến lúc tiếp xúc với tiêu chuẩn báo cáo mới cho SMTP được gọi là báo cáo TLS. </p> <p> </p> <h2 id=\"what-is-smtp-tls-reporting-tls-rpt\"> Báo cáo SMTP TLS (TLS-RPT) là gì? </h2> <p> Cũng giống như MTA-STS, TLS-RPT là một tiêu chuẩn báo cáo phát hiện các vấn đề kết nối và sự khác biệt giữa các ứng dụng gửi. Sau khi được kích hoạt, nó sẽ gửi các báo cáo hàng ngày về bất kỳ sự cố kết nối nào do các máy chủ bên ngoài gặp phải trong khi gửi email cho bạn. </p> <p> Hãy coi nó như một công cụ khắc phục sự cố, nơi các báo cáo có thể được sử dụng để đánh giá và phân loại các vấn đề tiềm ẩn và các vấn đề cấu hình. </p> <p> </p> <h2 id=\"what-type-of-issues-does-tls-rpt-resolve\"> TLS-RPT giải quyết loại vấn đề nào? </h2> <p> <img alt=\"Reports and Stats\" src=\"images/statistical-report-116.jpg\" loading=\"lazy\"> </p> <p> <strong> Báo cáo Chẩn đoán: </strong> Báo cáo TLS cung cấp báo cáo chẩn đoán ở định dạng tệp JSON chứa thông tin chi tiết toàn diện liên quan đến bất kỳ email gửi đến nào gặp sự cố gửi. Ví dụ, nó cũng phát hiện các email bị trả lại hoặc không gửi được do một cuộc tấn công hạ cấp. </p> <p> <strong> Cải thiện khả năng hiển thị: </strong> Bằng cách bật TLS-RPT, bạn có thể cải thiện khả năng hiển thị trên tất cả các kênh email của mình. Điều này cho phép bạn theo dõi tất cả dữ liệu đang hướng đến con đường của bạn, bao gồm cả những thông báo không thành công. </p> <p> <strong> Báo cáo hằng ngày: </strong> Các báo cáo chẩn đoán được gửi ít nhất một lần mỗi ngày để bao gồm và tuân thủ sâu các chính sách MTA-STS. Các báo cáo cũng bao gồm thống kê lưu lượng truy cập cũng như thông tin chi tiết về lỗi và giao hàng không thành công. </p> <p> </p> <h2 id=\"when-all-else-fails-encryption-prevails\"> Khi tất cả các lỗi khác không thành công, mã hóa có trước </h2> <p> Do tính chất liên tục phát triển của các mối đe dọa mạng, các biện pháp bảo mật nghiêm ngặt và mật mã là những yếu tố cần thiết để gửi email an toàn và bảo mật. </p> <p> Nhờ các nhà cung cấp email khác nhau cung cấp khả năng mã hóa mạnh mẽ và các tiêu chuẩn MTA-STS, việc chuyển email hoàn toàn an toàn không còn là một thực tế xa vời nữa. </p>"}