{"title":"Sự khác biệt giữa LAN và WAN trong mạng là gì?","content":"<p> Nếu bạn đã chú tâm vào mạng máy tính, rất có thể bạn đã bắt gặp các thuật ngữ &quot;LAN&quot; và &quot;WAN&quot;. Tuy nhiên, ý nghĩa của từng cái và sự khác biệt khi bạn so sánh giữa mạng LAN và mạng WAN là gì? </p> <p> Hãy cùng khám phá cả hai công nghệ này và nơi mỗi công nghệ tỏa sáng. </p> <h2 id=\"what-does-lan-stand-for\"> &quot;LAN&quot; đại diện cho điều gì? </h2> <p> <img alt=\"A Local Area Network\" src=\"images/lan-wan-local-area-423.jpg\" loading=\"lazy\"> Tín dụng hình ảnh: Thuốc Naroda / <a href=\"https://www.shutterstock.com/image-illustration/smart-home-possible-devices-usage-concept-660671089\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Mạng LAN là &quot;Mạng cục bộ&quot;. Thuật ngữ này mô tả một mạng mà tất cả các thiết bị được kết nối ở gần nhau. Tất cả chúng đều ở &quot;khu vực địa phương&quot;, do đó có tên như vậy. </p> <p> Khi một máy tính kết nối với mạng LAN, nó sẽ nhận được địa chỉ giao thức internet cục bộ (IP). Điều này hoạt động tương tự như địa chỉ IP bạn nhận được khi bạn trực tuyến. Tuy nhiên, địa chỉ IP cục bộ chỉ hoạt động đối với các máy tính khác trong cùng mạng LAN với bạn. Ví dụ: bạn không thể sử dụng IP cục bộ để kết nối với PC của mình qua internet. </p> <p> Biên giới vật lý của mạng LAN gia đình của bạn có thể sẽ không rời khỏi ngôi nhà của bạn. Tất nhiên, nếu bạn mang điện thoại hoặc máy tính xách tay ra ngoài vườn để tận hưởng không khí trong lành, nó vẫn nằm trong mạng LAN. Tuy nhiên, hầu hết thời gian, tất cả các thiết bị kết nối mạng của bạn đều nằm trong bốn bức tường của nhà bạn một cách an toàn. </p> <p> Các công ty và viện cũng tạo ra mạng LAN. Ví dụ, một trường đại học có thể kết nối tất cả các PC trong thư viện của mình với một mạng để tất cả chúng có thể nói chuyện với nhau. Các doanh nghiệp cũng thích sử dụng mạng LAN vì nó cho phép nhân viên gửi các tập tin và thư từ cho nhau mà không cần kết nối mạng. </p> <p> </p> <h2 id=\"what-does-wan-stand-for\"> &quot;WAN&quot; đại diện cho điều gì? </h2> <p> <img alt=\"\" src=\"images/lan-wan-wide-area-402.jpg\" loading=\"lazy\"> Tín dụng hình ảnh: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-communication-network-concept-5g-1570147828\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"> Shutterstock.com </a> </p> <p> Mặt khác, chúng ta có Mạng diện rộng hay còn gọi là WAN. Nếu bạn đang đọc bài viết này, nghĩa là bạn đã kết nối với mạng WAN — chúng tôi gọi nó là Internet. </p> <p> &quot;Độ rộng&quot; trong Mạng diện rộng rất thay đổi. Nếu bạn kết nối với một máy chủ bên ngoài ở cùng thành phố với bạn, đó là mạng WAN. Nó cũng được coi là mạng WAN nếu bạn kết nối với máy chủ ở một quốc gia ở phía bên kia hành tinh. </p> <p> Như vậy, mạng WAN thường được sử dụng để mô tả bất kỳ mạng nào bạn kết nối tồn tại qua bộ định tuyến của bạn. Không quan trọng nếu máy chủ cách xa một dặm hay một lục địa; nó vẫn &quot;rộng.&quot; </p> <p> Internet không phải là mạng WAN duy nhất hiện có. Các doanh nghiệp tận dụng tốt mạng WAN để kết nối các văn phòng ở các quốc gia khác nhau. Ví dụ: nếu một doanh nghiệp có văn phòng ở New York, Tokyo và Sydney, thì doanh nghiệp đó có thể thuê hệ thống WAN của riêng mình để cho phép họ nói chuyện với nhau. </p> <p> Nhưng chờ một chút; Tại sao các công ty lại tạo ra mạng WAN của riêng họ khi họ có thể kết nối mọi thứ với internet một cách đơn giản? Vấn đề với giải pháp này là công ty sẽ phải trả phí cho ISP, và nếu có vấn đề gì xảy ra, họ phải vật lộn với ISP đó để khắc phục. </p> <p> Không chỉ vậy, internet được thiết kế để kết nối với rất nhiều PC trên khắp thế giới. Nếu một công ty chỉ muốn PC của mình kết nối với các PC văn phòng khác, họ có thể sử dụng mạng WAN của riêng mình để bảo vệ mình khỏi các mối đe dọa trực tuyến. Đây được gọi là &quot;mạng nội bộ&quot;. </p> <p> </p> <h2 id=\"when-to-use-a-lan-vs-wan\"> Khi nào sử dụng mạng LAN so với mạng WAN </h2> <p> Khi bạn muốn kết nối với một thiết bị khác mà bạn sở hữu, bạn có thể chọn kết nối qua mạng LAN hoặc WAN. Nhưng lợi ích và hạn chế của mỗi loại là gì, và bạn nên sử dụng loại nào? </p> <p> Giả sử bạn có một ổ cứng không dây mới kết nối với bộ định tuyến của mình và bạn có lựa chọn cho phép kết nối từ internet (WAN) hoặc chỉ giữ nó cục bộ (LAN). Cái nào bạn chọn phụ thuộc vào những gì bạn muốn từ ổ cứng. </p> <p> Cung cấp khả năng WAN cho ổ cứng là một điều tuyệt vời để tạo sự thuận tiện. Điều này đưa nó lên internet, có nghĩa là bạn có thể kết nối với nó từ mọi nơi trên thế giới. Như vậy, bạn sẽ không bao giờ bị mắc kẹt nếu không có tệp của mình nữa; họ sẽ chỉ có kết nối internet. </p> <p> Tuy nhiên, kết nối WAN cũng cho phép người khác truy cập vào thiết bị của bạn. Nếu bảo mật ổ cứng của bạn không được nâng cao, tin tặc có thể sử dụng cùng một cách bạn làm để xem tất cả dữ liệu của bạn và sao chép hoặc xóa những thứ quan trọng. </p> <p> Mặt khác, đặt ổ cứng ở chế độ chỉ mạng LAN sẽ bảo vệ nó khỏi một số con đường mà hacker có thể thực hiện. Nó không thấm. Ví dụ: ai đó có thể sử dụng PC của bạn để truy cập vào ổ cứng. Tuy nhiên, nó an toàn hơn rất nhiều so với việc phát sóng ổ cứng trên mạng WAN hàng ngày và ban đêm. </p> <p> Nếu bạn thực sự, thực sự muốn thắt chặt bảo mật, bạn có thể tạo lỗ hổng cho ổ cứng. Air-gapping có nghĩa là nó và mọi PC trên cùng một mạng trên nó không được kết nối với mạng WAN — chẳng hạn như internet. </p> <p> An <a href=\"https://www.makeuseof.com/air-gapped-computer-secure-online/\" target=\"_blank\" rel=\"nofollow noopener\"> máy tính có ga không hoàn toàn an toàn trước các mối đe dọa trực tuyến </a> , nhưng nó làm giảm đáng kể cơ hội tấn công. Tin tặc cần phải thao túng con người thực hiện cuộc đấu thầu của họ để tấn công một thiết bị nghe lén, sử dụng các chiến thuật kỹ thuật xã hội để tìm đường. </p> <p> Do đó, khi lựa chọn giữa đặt một thiết bị trên internet hoặc giữ nó bị khóa trong mạng LAN gia đình của bạn, bạn cần phải cân nhắc nếu bạn thực sự kết nối với nó qua internet. Nếu bạn không nghĩ rằng mình sẽ làm như vậy, tốt nhất bạn nên tắt khả năng WAN của nó và ngăn chặn tin tặc. </p> <p> </p> <h2 id=\"does-connecting-to-the-internet-turn-a-lan-into-a-wan\"> Kết nối với Internet có biến một mạng LAN thành mạng WAN không? </h2> <p> Giả sử bạn đã thiết lập mạng LAN nơi tất cả các thiết bị của bạn được kết nối với bộ định tuyến. Bạn cảm thấy nhàm chán, vì vậy bạn lên máy tính và truy cập Netflix. Bây giờ, PC của bạn đã được kết nối với mạng WAN: internet. </p> <p> Tuy nhiên, vì PC của bạn được kết nối với mạng WAN, điều đó có nghĩa là nó không còn là một phần của mạng LAN nữa? May mắn thay, một thiết bị có thể là một phần của cả mạng LAN và mạng WAN cùng một lúc. </p> <p> Hãy nhớ cách chúng tôi đã nói rằng các thiết bị mạng LAN có địa chỉ IP cục bộ của riêng chúng? Điều này không có nghĩa là nó cũng không thể nhận được địa chỉ IP internet. Trên thực tế, nếu bạn đang đọc bài viết này trên một thiết bị được kết nối với bộ định tuyến, nó sẽ có cả hai! </p> <p> Nếu bạn muốn tự mình kiểm tra, chúng tôi đã đề cập đến <a href=\"https://www.makeuseof.com/tag/find-ip-address-windows-10/\" target=\"_blank\" rel=\"nofollow noopener\"> cách kiểm tra địa chỉ IP của bạn trên Windows </a> . Nếu bạn đang sử dụng thiết bị di động, bạn vẫn có thể <a href=\"https://www.makeuseof.com/tag/find-ip-address-mobile-smartphone/\" target=\"_blank\" rel=\"nofollow noopener\"> tìm địa chỉ IP của bạn trên Android hoặc iPhone </a> . </p> <p> Khi bạn có số liệu thống kê, bạn sẽ thấy hai địa chỉ IP. Địa chỉ đầu tiên sẽ bắt đầu bằng &quot;192.168&quot; —đó là địa chỉ IP cục bộ của bạn. Bạn sử dụng thiết bị này nếu bạn muốn kết nối với thiết bị hiện tại của mình từ một thiết bị khác trên cùng một mạng. </p> <p> Cách thứ hai sẽ có một trong hai cách, tùy thuộc vào việc bạn đang sử dụng IPv4 hay IPv6. Nếu bạn đang sử dụng v4, nó sẽ giống như địa chỉ IP cục bộ của bạn, nhưng nó sẽ không bắt đầu bằng &quot;192.168&quot;. Nếu đó là IPv6, nó sẽ là một mớ hỗn độn của các chữ cái và số, được chia thành tám khối bằng dấu hai chấm. </p> <p> Dù bằng cách nào thì địa chỉ đó cũng là địa chỉ IP internet của bạn. Nó được sử dụng khi bạn kết nối với một máy chủ khác trên internet để nó có thể nói chuyện với bạn; ví dụ: để gửi cho bạn chương trình truyền hình bạn đang xem trên Netflix. </p> <p> Theo một cách nào đó, bạn có thể hình dung Internet là một mạng LAN khổng lồ. Khi bạn xem Netflix, PC của bạn (trên mạng LAN cá nhân của bạn) sẽ nhận dữ liệu từ máy chủ Netflix (nằm trong mạng LAN của chính nó). Mỗi mạng LAN giống như một ngôi nhà trong một thành phố, trong khi kết nối internet giống như những con đường và con phố kết nối tất cả chúng với nhau. </p> <p> </p> <h2 id=\"clearing-the-confusion-of-lan-vs-wan\"> Xóa nhầm lẫn giữa LAN và WAN </h2> <p> Mạng LAN và mạng WAN thường hoạt động song song với nhau, nhưng chúng hoạt động theo những cách khác nhau. Bây giờ bạn đã biết sự khác biệt giữa hai loại và khi nào sử dụng mỗi loại. </p> <p> Bạn có biết rằng bạn có thể thiết lập một trò chơi mạng LAN để mọi người trên cùng một mạng có thể chơi với nhau không? Đó là một cách tuyệt vời để dành thời gian với bạn bè mà không gặp phải vấn đề về độ trễ mà việc chơi game trên internet đôi khi gặp phải. </p> <p> <small> Tín dụng hình ảnh: metamorworks / <a href=\"https://www.shutterstock.com/image-photo/smart-city-telecommunication-network-concept-abstract-713649202\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock.com </a></small> </p>"}