{"title":"Bạn sẽ sớm chơi trò chơi với các nhân vật MetaHuman sử thi","content":"<p> Nếu bạn nghĩ rằng trò chơi trông thực tế ngay bây giờ, thì hãy đợi cho đến khi bạn hiểu được những gì Epic Games đã có trong quá trình hoạt động với Unreal Engine của nó. Chuẩn bị để tâm trí của bạn được thổi bay. </p> <h2 id=\"epic-games-unveils-new-metahumans\"> Epic Games ra mắt MetaHumans mới </h2> <p> Có thể bạn đang tự hỏi chúng ta đang nói về một trái đất nào. MetaHuman Creator là tính năng mới nhất mà Epic Games đã thêm vào Unreal Engine; môi trường phát triển phần mềm mà các nhà phát triển trò chơi có thể sử dụng để tạo ra các tựa game của họ. </p> <p> Theo một <a href=\"https://www.unrealengine.com/en-US/blog/a-sneak-peek-at-metahuman-creator-high-fidelity-digital-humans-made-easy\" target=\"_blank\" rel=\"nofollow noopener\"> Bài đăng trên blog Unreal Engine </a> công bố công cụ phát triển mới thú vị: </p> <blockquote> <p> MetaHuman Creator là một ứng dụng được phát trực tuyến trên nền tảng đám mây được thiết kế để tạo ra con người kỹ thuật số trong thời gian thực từ vài tuần hoặc vài tháng đến chưa đầy một giờ mà không ảnh hưởng đến chất lượng. </p> </blockquote> <p> Vì vậy, về cơ bản nó là một cách để nhà phát triển trò chơi tạo ra các bản fax của con người cực kỳ thực tế. Nhanh. </p> <p> </p> <h2 id=\"what-does-metahuman-creator-mean-for-developers\"> MetaHuman Creator có ý nghĩa gì đối với các nhà phát triển? </h2> <p> </p> <p> Điều này có ý nghĩa đối với phát triển phần mềm là trò chơi thay đổi (dự định chơi chữ). Hãy tưởng tượng các nhà phát triển sẽ đưa NPC vào thế giới trò chơi của họ nhanh chóng như thế nào bằng cách sử dụng MetaHuman Creator. Không chỉ vậy, con người kỹ thuật số trông cũng đáng kinh ngạc. </p> <p> Điều này rõ ràng cũng có nghĩa là các nhà phát triển có thể hoàn thành tiêu đề nhanh hơn, vì vậy bạn không cần phải chờ đợi qua vô số sự chậm trễ. MetaHuman Creator cho phép các nhà phát triển xây dựng dân số NPC của họ một cách nhanh chóng, dành thời gian cho những vấn đề khác, cấp bách hơn. </p> <p> Nhưng tại sao lại cần đến công cụ này? Epic Games giải thích: </p> <blockquote> <p> Việc tạo ra một con người kỹ thuật số chất lượng cao rất khó và tốn nhiều thời gian. Nhân rộng nỗ lực đó để tạo ra nhiều con người kỹ thuật số đa dạng có chất lượng theo yêu cầu của các nền tảng thế hệ tiếp theo và sản xuất ảo cao cấp thực sự là một nhiệm vụ đáng gờm. </p> </blockquote> <p> Vì vậy, như chúng tôi đã nói; công cụ này giúp tiết kiệm thời gian và cải thiện quy trình làm việc, cho phép các nhà phát triển cung cấp cho các bảng điều khiển thế hệ mới những trò chơi mà họ xứng đáng có được. </p> <p> </p> <h2 id=\"how-will-metahuman-creator-affect-games\"> MetaHuman Creator sẽ ảnh hưởng đến trò chơi như thế nào? </h2> <p> Chà, nhờ MetaHuman Creator, các trò chơi có thể phát hành nhanh hơn rất nhiều, ngay từ đầu. Với các công cụ mạnh mẽ như thế này, các nhà phát triển có thể trau dồi cơ chế trò chơi hoặc dành nhiều thời gian hơn để thực sự sửa lỗi trước khi họ phát hành một trò chơi bị hỏng ... </p> <p> Dù sao, bỏ qua một bên cay đắng, công cụ phát triển của Epic có vẻ giống như một thứ sẽ làm cho trò chơi trông đẹp hơn. Bạn chỉ cần nhìn vào kết xuất để biết con người kỹ thuật số thực sự ngoạn mục như thế nào. Tuy nhiên, khi chúng ta nhìn thấy chúng trong các trò chơi, là lúc điều kỳ diệu thực sự sẽ xảy ra. </p> <p> </p> <h2 id=\"when-will-we-see-metahumans-in-games\"> Khi nào chúng ta sẽ thấy MetaHumans trong trò chơi? </h2> <p> <img alt=\"metahuman looking at hand\" src=\"images/metahuman-looking-at-hand-650.png\" loading=\"lazy\"> </p> <p> Điều đó thật khó nói. Hiện tại, Epic đã chốt phần mềm Creator để thử nghiệm quyền truy cập sớm trong &quot;vài tháng tới&quot;. Vì vậy, bạn sẽ không sớm thấy bất kỳ MetaHumans nào nữa. </p> <p> Nếu bạn muốn tạo ra con người kỹ thuật số của riêng mình, bạn phải đợi nếu bạn muốn sử dụng MetaHuman Creator của Unreal Engine. Bạn luôn có thể thử ghép chúng lại với nhau trong một chương trình khác, nhưng chắc chắn sẽ không mất đến một giờ! </p>"}