{"title":"Bạn có thể nhận được Microsoft Teams Pro mới miễn phí","content":"<p> Cách đây ít lâu, chúng tôi đã đề cập đến một dịch vụ đăng ký dự kiến ​​dành cho Microsoft Teams có tên &quot;Teams Pro&quot;, dịch vụ này sẽ mở khóa các tính năng bổ sung cho phần mềm. Tuy nhiên, Microsoft sau đó đã lên tiếng khẳng định rằng một số người sẽ nhận được Teams Pro mà không phải trả thêm phí cho các gói hiện tại của họ. </p> <h2 id=\"microsoft-s-statement-on-free-teams-pro-subscriptions\"> Tuyên bố của Microsoft về Đăng ký Teams Pro Miễn phí </h2> <p> Trong trường hợp bạn cần lời nhắc, trước đây chúng tôi đã đề cập đến chủ đề này trong phần của chúng tôi trên <a href=\"https://www.makeuseof.com/microsoft-teams-pro-webinars/\" target=\"_blank\" rel=\"nofollow noopener\"> Teams Pro thêm hội thảo trên web vào dịch vụ </a> . </p> <p> Bây giờ, một bài báo của <a href=\"https://www.zdnet.com/article/microsoft-to-add-new-webinar-and-meeting-intelligence-capabilities-to-teams-via-teams-pro/\" target=\"_blank\" rel=\"nofollow noopener\"> ZDNet </a> về chủ đề tương tự kể từ đó đã nhận được một tuyên bố từ Microsoft. Tuyên bố là tin tốt cho những người lo lắng về việc trả thêm tiền cho hội thảo trên web: </p> <blockquote> <p> Vào ngày 9 tháng 2, chúng tôi đã xuất bản một bài đăng MC liên quan đến gói dịch vụ Teams Pro mới. Để làm rõ, không có thay đổi nào đối với giấy phép sản phẩm hiện có khi bổ sung gói dịch vụ mới này. Thay vào đó, gói dịch vụ sẽ tự động được thêm vào Microsoft 365 và Office 365 E5 / E3 / A5 / A3, cũng như các giấy phép Microsoft 365 Business Standard / Business Premium, đồng thời cho phép người dùng được cấp phép cho các SKU này tự động nhận các khả năng triển khai Các đội trong thời gian sắp tới. </p> </blockquote> <p> Microsoft tiếp tục tuyên bố rằng quản trị viên không cần phải làm bất cứ điều gì để kích hoạt các tính năng mới này. Ngoài ra, bất kỳ ai có giấy phép tương thích như được liệt kê ở trên sẽ nhận được các tính năng mới sáng bóng này mà không phải trả thêm phí. </p> <p> </p> <h2 id=\"getting-more-for-the-same-with-microsoft-teams\"> Nhận được nhiều thứ tương tự với Microsoft Teams </h2> <p> Microsoft đang tung ra gói đăng ký Teams Pro mới mở khóa hội thảo trên web và hơn thế nữa, nhưng không phải ai cũng phải trả thêm tiền cho nó. Nếu # bạn đã đăng ký một trong các giấy phép ở trên, bạn có thể mong muốn nhận được tất cả các tính năng của Teams Pro mà không phải trả thêm gì. </p> <p> Điều đó không có nghĩa là những người không có Teams Pro sẽ bị bỏ rơi trong bóng râm. Ví dụ: mọi người sẽ sớm có quyền truy cập vào tính năng tóm tắt hữu ích trong Microsoft Teams. </p> <p> <small> Tín dụng hình ảnh: Postmodern Studio / <a href=\"https://www.shutterstock.com/image-photo/new-york-usa-9-april-2020-1738929362\" target=\"_blank\" rel=\"nofollow noopener\"> Shutterstock </a></small> </p>"}