{"title":"Tuy nhiên, một thương hiệu mặt kính PS5 không chính thức khác đang có mặt trên thị trường","content":"<p> dbrand, công ty sản xuất da, màn hình và vỏ cho nhiều thiết bị khác nhau, đã tham gia vào việc đánh lừa Sony và phát hành mặt nạ PS5 không chính thức của riêng mình. </p> <h2 id=\"dbrand-releases-darkplates\"> dbrand phát hành Darkplates </h2> <p> Nếu bạn đang tìm cách tùy chỉnh PS5 của mình, thì dbrand là công ty mới nhất cung cấp mặt nạ bên thứ ba không chính thức cho bảng điều khiển thế hệ mới. Họ gọi chúng là Darkplates, bởi vì chúng là những tấm mặt đen. </p> <p> Bạn có thể kiểm tra các tấm trên <a href=\"https://dbrand.com/shop/special-edition/ps5\" target=\"_blank\" rel=\"nofollow noopener\"> cửa hàng dbrand </a> , nơi bạn có thể mua các tấm mặt đen mờ với giá $ 49,00 (tại thời điểm viết bài). </p> <p> Bạn cũng có thể nhận ra thứ mà dbrand gọi là &quot;lớp da giữa&quot;, là một miếng dán vinyl phủ lên bảng điều khiển trung tâm, màu đen, có độ bóng cao trên PS5. Điều này có giá thêm $ 11,95 và có sẵn trong một loạt các màu sắc và kiểu dáng. </p> <p> <img alt=\"dbrand shell texture detail\" src=\"images/dbrand-shell-texture-detail-544.png\" loading=\"lazy\"> </p> <p> Bạn cũng sẽ nhận thấy nó tự hào về kết cấu bề mặt của nó. Điều này tương tự như <a href=\"https://www.makeuseof.com/sony-how-ps5-controller-textured-playstation-symbols/\" target=\"_blank\" rel=\"nofollow noopener\"> các ký hiệu PlayStation nhỏ mà bạn sẽ tìm thấy trên DualSense </a> , các phụ kiện PS5 chính thức khác và mặt nạ của bên thứ nhất đi kèm với bảng điều khiển khi bạn mua. Tương tự, nhưng chúng có ấn tượng như nhau không? </p> <p> </p> <h2 id=\"will-dbrand-last\"> Liệu dbrand có cuối cùng không? </h2> <p> Bạn chắc chắn đã thấy <a href=\"https://www.makeuseof.com/cmp-shells-ps5-faceplate-colors/\" target=\"_blank\" rel=\"nofollow noopener\"> phạm vi bảo hiểm faceplategate liên quan đến CMP Shells </a> , điều này đã khiến Sony tự đắc với lệnh cấm quay trở lại. Một số người có thể nói rằng sự trở lại của nó là kiêu ngạo, vì nó đã tuyên bố về mặt pháp lý của nó là không thể chạm tới. Chúng ta sẽ thấy. </p> <p> </p> <p> Loại này khiến bạn tự hỏi tại sao dbrand thậm chí còn bận tâm. Sony phân loại <strong> đã không </strong> vui lòng đến CMP Shells, trước tiên vì tên thương hiệu cũ của nó quá giống với PlayStation (PlateStation). </p> <p> Sau đó, Sony đã đưa ra vấn đề vì họ quyết định các mặt kính là một phần thiết kế của bảng điều khiển và do đó việc sao chép chúng là vi phạm quyền sở hữu trí tuệ. Cue tiếng nổ của ban gavel. CMP Shells đã kết thúc sản xuất, hủy tất cả các đơn đặt hàng trước khi tái xuất hiện dưới dạng mới. </p> <p> dbrand đã ở trong làn sóng bán hàng trước của những khách hàng tiềm năng chưa hoàn thành lần thứ tư, vì vậy bạn phải nhanh chóng nếu muốn lấy một trong những mặt hàng tùy chỉnh. Liệu các tấm có thực sự được sản xuất hay không là một vấn đề khác. Sony cũng có thể hạ bệ một lần nữa. </p> <p> </p> <h2 id=\"should-you-buy-a-dbrand-faceplate\"> Bạn có nên mua một tấm dán mặt dbrand không? </h2> <p> Như với câu chuyện CMP Shells, chúng tôi khuyên bất kỳ ai quan tâm đến việc tùy chỉnh mặt kính PS5 của họ nên thận trọng. Đây là các sản phẩm của bên thứ ba và vì vậy bạn không có cách nào để xác nhận chất lượng của chúng ngoài những gì thương hiệu cho bạn biết. </p> <p> Ngoài ra, trước sự khăng khăng của Sony rằng PlateStation (nay là CMP Shells) phải ngừng sản xuất, sẽ không có gì ngạc nhiên nếu hãng này không gọi nhanh các luật sư của mình để giải quyết trường hợp của dbrand. </p> <p> Tóm lại, hãy cẩn thận nếu bạn muốn tùy chỉnh các mặt ngoài của mình. CMP Shells đã hoàn lại tiền cho tất cả các khách hàng của mình ngay lần đầu tiên. Nhưng điều đó không có nghĩa là một thương hiệu khác sẽ làm được. </p> <p> </p> <h2 id=\"do-you-really-need-to-customize-your-ps5\"> Bạn có thực sự cần tùy chỉnh PS5 của mình không? </h2> <p> <img alt=\"ps5\" src=\"images/ps5-183.jpg\" loading=\"lazy\"> </p> <p> Nếu bạn không hài lòng với vẻ ngoài của PS5, bạn luôn có thể sửa đổi nó theo những cách khác (ít tốn kém hơn đáng kể). Bạn luôn có thể thêm da vinyl vào bảng điều khiển nếu bạn muốn nó trông khác. </p> <p> PS5 chỉ ra mắt vào tháng 11 năm 2020. Có lẽ hãy thử chơi một vài trò chơi trên nó trước khi bạn cảm thấy thôi thúc không thể cưỡng lại được để thay đổi vẻ ngoài thẩm mỹ cho giao diện điều khiển của mình. </p>"}