{"title":"如何保護您的個人數據免受雇主的侵害","content":"<p> 監控技術在辦公室內外都很猖獗。許多雇主將移動管理產品用於公司發行的設備，如手機、筆記本電腦和平板電腦。其中包含旨在保護企業免遭盜竊、企業間諜活動或惡意企圖的程序。 </p> <p> 然而，雖然所有這些都非常適合保護您的公司，但它們對您來說並不是最好的選擇。這不再是一個問題 <strong> 如果 </strong> 您的公司正在跟踪您；接下來您需要問的是，公司實際上可以找到多少數據？令人驚訝的是，很多。 </p> <h2 id=\"what-can-employers-see-on-company-wi-fi-and-remote-devices\"> 雇主可以在公司 Wi-Fi 和遠程設備上看到什麼？ </h2> <p> 大多數人沒有意識到公司可以在多大程度上訪問他們的數據，或者他們在使用公司設備時簽署了多少數據。這裡有些例子。 </p> <h3 id=\"location\"> 地點 </h3> <p> 許多員工認為使用虛擬專用網絡 (VPN) 足以讓他們的雇主相信他們在他們應該去的地方。 </p> <p> 雖然有多種方法可以在個人設備上隱藏您的真實位置，但並非完全萬無一失，尤其是在使用公司發布的電子郵件地址或手機號碼登錄任何應用程序或網站時。 </p> <p> </p> <p> 使用公司發行的設備時，幾乎不可能隱藏您的真實位置。例如，電信公司可以檢測您何時連接到他們的任何漫遊合作夥伴。 </p> <p> 此外，企業 VPN 不同於商業 VPN，其網關由內部 IT 團隊監控。 </p> <h3 id=\"notes-documents-and-emails\"> 筆記、文檔和電子郵件 </h3> <p> 如果您認為沒有人知道您一直在使用公司 Wi-Fi 來尋找下一份工作，那您就錯了。即使您沒有使用公司電子郵件地址，許多企業也會在公司筆記本電腦中預裝程序，其中包括實時活動日誌、瀏覽歷史更新以及打開文檔和電子郵件的定時屏幕截圖。 </p> <p> 在防止可能發生的數據洩露的前提下，許多公司還將這些用作報告機製或生產力跟踪器。 </p> <p> </p> <h3 id=\"online-messaging-history\"> 在線消息歷史 </h3> <p> 儘管加密平台興起，但現實情況是，您的消息在公司設備上並非完全私密。使用消息傳遞平台時，公司可能無法查看您的交易的確切詳細信息，但可能仍然能夠識別元數據，例如文件大小和類型。 </p> <p> 有了這個，如果您決定通過像 WhatsApp 這樣的應用程序發送大尺寸的 PDF，您公司的入侵檢測系統可能會標記您的可疑行為。根據公司準則，他們可能會要求您證明自己的行為沒有惡意，並且可能需要要求領導簽字才能批准。 </p> <p> </p> <h2 id=\"how-to-avoid-sharing-personal-data-with-your-employer\"> 如何避免與您的雇主共享個人數據 </h2> <p> 沒有絕對的方法可以讓您的個人信息、對話和活動始終完全無法訪問。但是，您可以通過多種方式降低風險。 </p> <p> 我們不支持向您的雇主隱藏數據；事實上，他們有權收集關於他們員工的信息——即使是 <a href=\"https://www.makeuseof.com/tag/heres-employer-allowed-track/\" target=\"_blank\" rel=\"nofollow noopener\"> 能夠合法地追踪你 </a> .但是你需要知道什麼時候把事情留給自己是合適的，這取決於個別公司。 </p> <h3 id=\"read-company-policies\"> 閱讀公司政策 </h3> <p> 在您爭論數據透明度之前，您還必須了解您通過為雇主工作而有意提供給雇主的信息類型。只有當你知道什麼是期望時，你才能建立適當的專業界限。 </p> <p> <img alt=\"Surveillance Cameras\" src=\"images/surveillance-cameras-487.jpg\" loading=\"lazy\"> </p> <p> 旨在在收集數據之前了解公司數據收集政策和程序。從那裡，您可以有效地制定計劃，選擇不提供不必要的信息。 </p> <h3 id=\"use-personal-gadgets\"> 使用個人小工具 </h3> <p> 雖然使用公司設備來省錢總是很誘人，但現實是，沒有什麼是真正免費的。投資筆記本電腦、手機和平板電腦供個人使用。 </p> <p> 擁有單獨的個人設備也是建立界限的好方法，尤其是在遠程工作時。 </p> <p> 使用您自己的設備，您可以建立和管理各種必要的安全措施，以防止您的數據被窺探。這似乎是不必要的開支，但它對保持您的內心平靜大有幫助。 </p> <h3 id=\"use-guest-profiles-on-personal-devices\"> 在個人設備上使用訪客配置文件 </h3> <p> 連接到任何不屬於您自己的網絡始終存在安全風險，即使是在工作場所也是如此。登錄公司 Wi-Fi 後，您的雇主可以訪問從消息元數據到瀏覽歷史記錄的所有內容。 </p> <p> 如果您絕對需要在公司網絡上使用您的個人筆記本電腦，您可以選擇使用訪客配置文件來減少他們可以遠程訪問的數據量。或者，您可以連接個人手機的數據計劃或便攜式 Wi-Fi 設備。 </p> <h3 id=\"keep-your-passwords-safe\"> 保護您的密碼安全 </h3> <p> <a href=\"https://www.makeuseof.com/tag/7-ways-to-make-up-passwords-that-are-both-secure-memorable/\" target=\"_blank\" rel=\"nofollow noopener\"> 創建強密碼 </a> 還不夠。您需要確保您的密碼不會保存在公司設備上。如果您的公司數據庫遭到入侵，在您不擁有的小工具上保存在線銀行帳戶、個人電子郵件或政府網站的個人密碼會使您的數據面臨直接風險。 </p> <p> 僅使用您的個人手機或筆記本電腦訪問重要帳戶，尤其是涉及金錢的帳戶。如果可能，請啟用雙因素身份驗證。 </p> <p> </p> <h2 id=\"separate-your-work-and-personal-life\"> 將您的工作和個人生活分開 </h2> <p> 如果雇主懷疑您參與任何形式的非法活動、將公司信息置於危險之中或被執法部門要求進行調查，他們有權遠程訪問您公司發放的設備。 </p> <p> 然而，這與個人設備不同。 </p> <p> 您的安全感取決於與您接觸的人（包括您的雇主）。將您的個人設備和工作設備分開只是分散數據的一步。通過實施強大的安全措施，您可以限制黑客對文檔、電子郵件和網絡的訪問點數量。 </p> <p> 分散個人數據是必要的，因為它可以保護您個人和您的公司免遭盜竊、欺詐和其他形式的網絡犯罪。 </p>"}